[
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "A_Roode",
        "review_rating": "3",
        "review_title": "Utterly dreadful",
        "review_detailed_main": "Every time I watch this movie blood comes gushing out of my eyes. Yes, you read that correctly: I've watched this wretched, foul thing more than once.\n\nCaddyshack 2 went wrong for so many reasons: Harold Ramis dialing in a script and abandoning the direction duties, Rodney Dangerfield (wisely) walking away from the project because they wouldn't allow him to tinker with the script, Bill Murray showing excellent judgement and not being part of it, and a puppet being pushed forward as the feature player of a cast who deserved much better.\n\nI can't help but think of Dyan Cannon in this and wonder why she's perpetually laughing and smiling. The only conclusion I can draw is that she is indeed the face of pure evil. Stay with me a moment. She must have been watching as the film came together and revelled in the untold agony that it would inflict on countless soon to be extremely sorry movie goers who would have this film inflicted on them. She may also have been extremely drunk. That's what I need to be right now to wash the foul taste of this complete and utter failure out of my mind. If I'm lucky it'll be washed out forever.\n\nI have seen this film several times. I blame several of them on childhood and being a very dull and dim-witted boy who apparently had no aesthetic sensibility. Perhaps puppets are just funnier when you're a kid. No, the Muppet show is funnier now ... guess I was just dull. Caddyshack 2 is that rare kind of film that is so extraordinarily disappointing on so many levels that you convince yourself after the end credits that it couldn't have been as bad as all that. It WAS. It IS. It will only get worse with time.\n\nMy reasons for going back to this film, mercifully, are becoming fewer. Randy Quaid is limited in his role as Jackie Mason's lawyer. His opening scene isn't bad and brought out my only chuckle. We see him a few more times but it becomes as tired as the rest of the movie and descends with unfortunate rapidity from incidentally amusing to vapid wasteland. Randy Quaid acquits himself well, and this film owes him big time because if there was reason to watch this film as anything other than a torture tactic, he was it.\n\nMaybe that's the trick of the movie. It has enough potentially endearing qualities that people watch it, are horrified at what they've done to themselves but later because the pickings were so slim can remember only what did actually amuse them. Years later they unwittingly watch it again and the cycle repeats.\n\nJackie Mason takes a lot of the blame for this film but in fairness, I'm not sure he deserves it. He's really trying out there but it is impossible to not to notice that he spends the entire movie doing a Rodney Dangerfield impersonation. That's who the movie was written for but I'm not sure even he could have saved it. Ultimately this fails miserably through terrible direction, bad editing (shall we count continuity errors?) and a rehashing of the same story with none of the wry humour or heart that made the first film endearing.\n\nDragged kicking and screaming up to a three out of ten instead of two by Randy Quaid's bulldog determination. It isn't even bad enough to laugh at. I've definitely seen worse, but trust your memory -- this one is a dog. If you've never seen it you've made excellent life choices and I salute your excellent judgement."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "5",
        "review_title": "Fun, but stupid",
        "review_detailed_main": "After all seeing the very funny movie Caddyshack, I was looking forward to seeing the sequel, but I have to admit that I was nervous because I heard a lot of bad things about Caddyshack 2. I was also reading on the internet how this was voted one of the worst sequels of all time, which is sad. But I wanted to see the movie still, just at least see if it was really that bad. So I rented it anyways and watched it the other night. Now, I agree, this movie is really stupid, but it's a funny stupid that's very light hearted and has a few really good laughs. I know Randy Quaid can be annoying at times, but he really steals the show and his comedy is outrageous. I didn't like how they were trying to replace certain characters from the first film, but I let go and ended up laughing and having fun with Caddyshack 2.\n\nJack Hartounian is what you might call, \"New Money\", but he's a very successful in construction and is worth millions. He's a bit out there, personality wise, and dresses a bit crazy, but knows the hard work of the common man. His daughter, Katie, begs him to join a golf club so she could be with the upper class elite. But he makes a fool of himself and wants revenge on those who made fun of him. He buys the club and turns it into an amusement park! But this doesn't stop the elite from trying to tear him down.\n\nCaddyshack 2 is stupid at times, like the gofer, they took the joke a little far. And Dan Aykrod's character, I love Dan so much, but it's like he took on Bill Murray's character from the first Caddyshack and made Dan really annoying. Jackie Mason is a bit out there and can't stand up to Rodney Dangerfield. But Caddyshack 2 still has a few good laughs, I mean, if you couldn't laugh at Randy Quaid and how he delivered his lines, check your funny bones. Caddyshack 2 is a silly movie, but it's all in good fun, but if we are just going to keep comparing to the first movie, then you're not going to have a good time.\n\n5/10"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "videorama-759-859391",
        "review_rating": "4",
        "review_title": "The old, funny, classic shack, isn't back",
        "review_detailed_main": "Here's another example of a sequel that falls into \"the too late, and why bother category\". It has one asset: Jackie Mason. He's a classic, and rightfully likable guy, where Bushwood won't accept him, so he retaliates and that he does with personal malice, by planning to knock it down and put up an amusement park. All the magic to the original Caddyshack has gone, save for a couple of original stars, including that notorious gopher who we see more of, in this. Chevy Chase chatting up some hotties, uses some rude, tasteless lines that kind of mirrors how this quality whole movie comes across. Dan Ackroyd, donning a real high squealy voice, comes across as really annoying, a pain in the butt, which is where he gets shot with an poison arrow. Watching Weekend At Bernie's Jonathan Silverman at the start, getting used, by a snotty heartlss bi..h, that has him running many yards to fetch her a soft drink, made me thirsty, which had me thinking later, this scene was pointless and unfunny, although I'll always remember it. Mason and some hotties are really the only things, this movie has going for it, oh, and that gopher. Off by many tees."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Sub-Par",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "purplebiker",
        "review_rating": "1",
        "review_title": "watch this movie",
        "review_detailed_main": "Watch this movie .....only to truly appreciate how good the original is. I'm not real hard to please, but this was one of the worst movies I have ever seen.\n\nIt hurt me deeply, because I like Chevy Chase, Jackie Mason, and Dyan Cannon. The writing was just terrible! I thought Chevy would have at least ad libbed some better stuff than he did. There was hardly anything to laugh at in this movie. I went into it wanting to enjoy it. I wanted to laugh but nearly cried.\n\nIn the beginning credits it read Special Appearance by Chevy Chase. This worried me from the start. Chevy is actually in more than I thought he would be. It's more than a \"special appearance\". Too bad the appearance wasn't special. Mason's character would have been a good secondary character but got old as a main. I would rather have seen more (much more)of Dyan Cannon. At least her character was fun, if not well written. I also missed the gratuatis teen sex scene. Mr. Gopher went from being cute and innocent to a pesky rodent that deserved to be blown up. Jonathan Silverman is the only character that interested me and we didn't see enough of him.\n\nI take it back. Try..to watch half of this movie, then...remember the Alamo, the Maine, and CaddyShack I."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "jrdodson",
        "review_rating": "1",
        "review_title": "Worst. Sequel. Ever.",
        "review_detailed_main": "It's eight years after the mega-hit \"Caddyshack,\" and the studio wants to milk that cash cow again, but it all went horribly, horribly wrong. They couldn't get Rodney Dangerfield, so they went with the third-string facsimile, Jackie Mason. Ted Knight? No, Robert Stack. Bill Murray? No, a bizarre and whiny Dan Ackroyd, in what has to be the worst performance of his career. I guess Chevy Chase's phone wasn't ringing off the hook, since he reprises his role as Ty Webb.\n\nAnd it all went downhill from there. Where else could it go? Randy Quaid is just awful (surprise!) as is Dyan Cannon, Jonathan Silverman and Dina Merrill. The script could have been written by a high school drama class (and probably was), the direction is tepid and unfocused, and the whole thing is a limp and deadly mess.\n\nSave your time and money and brain cells. It was like watching a car wreck--you want to avert your gaze, but you just can't believe what you are seeing. The worst sequel of all time. Ever, ever, ever."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Aaron1375",
        "review_rating": "5",
        "review_title": "This one isn't nearly as good as the first, but it isn't one of the worst movies ever.",
        "review_detailed_main": "While this one certainly is not the original, it certainly isn't bad enough to be on the list of worst movies ever. I found some of the jokes to be funny and it wasn't a complete waste of time so I just don't see how it has such a low ranking. Well maybe I do. The main problems I had with this one are the story and its focus. This movie really has nothing to do with caddies, other than Silverman's character there are no other caddies that are focused on. In fact, other than the fact it is a country club, Chevy's character is back, and the gopher it really doesn't have much else in common with the original. Jackie Mason is the focal point here taking the Rodney Dangerfield role from the first. Here is one of the problems; he isn't nearly as funny or likable as Dangerfield. The scenes with his daughter also get annoying as it gets somewhat serious at times. Chevy reprises his role as Ty, but other than the fact he goes \"nananana\" he almost is a different character. Dan Akroyd sort of takes the place of Bill Murray's character and has a few funny lines, but his performance will not make anyone forget Bill Murray from the first one. Also, you do not have special appearances in a movie, when that appears it just makes your whole movie seem a bit generic. Also, both Chevy and Dan were in the movie more than say Marsha Warfield who is listed ahead of them. There are some good performances though...I liked Randy Quaid's character and Robert Stack was rather good too. It is good for a couple of laughs and I do not really think it is all that awful, but if only they could have done a better job with the central story in this one. I just don't think Jackie was very good and he kind of pulls the movie down a couple of notches."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "bkoganbing",
        "review_rating": "4",
        "review_title": "Plebeian manners",
        "review_detailed_main": "Rich contractor Jackie Mason has at the urging of his daughter Jessica Lundy gone to mix with the establishment at a posh country club. Her best friend is Chyna Phillips who is the spoiled rotten daughter of club president Robert Stack and Dina Merrill. She also has a brother Brian McNamara who is equally spoiled and interested in Lundy.\n\nSo Mason goes there and truly does not fit. What does he do but start a social revolution of sorts as was done in the original Caddyshack.\n\nOnly Chevy Chase and the gopher return from the original cast. The chemistry in the cast of the original is missing. Caddyshack II is not the classic low brow comedy that the original was.\n\nSome funny stuff is present though. I liked the brain dead Dan Aykroyd and his battle of wits with the elusive gopher. Guess who comes out on top?\n\nDefinitely second rate. Like a road company production of the original Caddyshack."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "PatrynXX",
        "review_rating": "5",
        "review_title": "Does what it sets out to do. Creats laughing. :)",
        "review_detailed_main": "ahh, digging in the $5 dvd bin. come up with this controversial doozy. Still remember being almost 13 looking forward to this movie. Having never totally understanding film at the time, I loved it. Today 2004... I still like it. Provides a decent laugh. Sure, it probably doesn't deserve the name that it's under... but neither did the Italian Job. (which I prefer to call The American Job. ) But hey, you just don't go into this film expecting the first movie. If you did, you'll be crying for decades. Fortunately, I see the movie for what it was. More of a parody of the original. Nothing can beat the original. Caddyshack II doesn't bother to try. And I love that for it. :)\n\n5/10\n\nQuality: 0/10 Entertainment: 9/10 Replayable: 10/10"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "bachdt",
        "review_rating": "1",
        "review_title": "They never should have bothered",
        "review_detailed_main": "What were they thinking! The original Caddyshack was brilliant and should be considered a classic. Everything worked even though it shouldn't. I still quote lines from it 25+ years later.\n\nThe cast of the original was superb. For Caddyshack II however none of them seem right. There is no chemistry at all. All the jokes fail badly. I just felt sorry for both Mason and Akroyd (maybe they realized that they missed out on a fantastic movie the first time and were trying to make up for it) I generally will sit through just about anything I've paid $3 to rent but after 20 minutes I couldn't handle any more. Its THAT bad."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "hot311champagne",
        "review_rating": "3",
        "review_title": "NOT GOOD, but for the circumstance NOT TOO BAD",
        "review_detailed_main": "Caddyshack II is NOTHING compared to the original Caddyshack. But, there are legitimate reasons for it. (1) Rodney Dangerfield was supposed to be the ace of this film BUT he didn't like the script, wanted to change it, his request was denied, so he didn't do the film. (2) It was low budget, Bill Murray had grown to superstar status. Ted Knight passed away in 1986, and Chevy Chase the \"so called ace\" of the first movie (although it was Rodney all the way)couldn't't be on more than 5 minutes, because it would cost too much to pay him. BUT you had Dan Aykroyd, Robert Stack, Randy Quaid and Jackie Mason, all serviceable substitutes, who none had their best performances."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "treakle_1978",
        "review_rating": "8",
        "review_title": "Better than you think",
        "review_detailed_main": "Look nothing is ever going to touch the original movie. However this sequel is funny and has some good performances as well. I will admit the character of jack isn't the best but I've seen worse. The Gopher is funny and the soundtrack led by Kenny Loggins is great. So judge for yourself and give it a look.\n\nTim Treakle."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "loadofsmith",
        "review_rating": "7",
        "review_title": "Awesome movie",
        "review_detailed_main": "I have seen this before in the 80's watched it again yesterday. I laughed and giggled through the whole movie."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "BandSAboutMovies",
        "review_rating": "3",
        "review_title": "A hard watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Banky-4",
        "review_rating": "",
        "review_title": "Pretty Lame...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "dru690",
        "review_rating": "2",
        "review_title": "Mediocre",
        "review_detailed_main": "Caddyshack Two is a good movie by itself but compared to the original it cant stack up. Robert Stack is a horrible replacement for Ted Knight and Jackie Mason, while funny just cant compete with Rodney Dangerfield. Ty Webb is funny, being the only character from the original. Most of the other characters in the movie lack the punch of the original (Henry Wilcoxon for example) except for the hystericly funny lawyer Peter Blunt, being played by Randy Quaid. Every line he says reminds me of the originals humor, especially the scene at his office (I don't go in for law suits or motions. I find out where you live and come to your house and beat down your door with a f***ing baseball bat, make a bonfire with the chippindale,maybe roast that golden retriever (arff arff arff) then eat it. And then I'm comin' upstairs junior, and I'm grabbing you by your brooks brothers pjs, and cramming your brand new BMW up your tight a**! Do we have an understanding?). Offsetting his small role however, is Dan Acroyd, who is obviously no replacement for Bill Murray. His voice is beyond irritating and everything he does isnt even funny, its just stupid. Overall Caddyshack II is a good movie, but in comparison to the awesome original it just cant cut it."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "The amazing thing about this one is that SOMEONE actually thought it was a good idea and would make money!!!",
        "review_detailed_main": "Have you ever heard the old expression \"you can never go back\"? Well, regardless, the saying definitely holds true when it comes to \"Caddyshack II\"...a film that fails in every way to capture the magic (such as it was) in \"Caddyshack\". Part of the problem is that this sequel came out eight years later....the other part is that almost no one from the original film is in this one. The sole person playing the same part is Chevy Chase...and he was the worst part of the original film!\n\nIn this story, a young girl from humble roots has inexplicably made friends with a cold and nasty spoiled brat. The brat's father runs a countryclub and so the girl's family is invitied to visit the place. However, the Hartounians are anything but the types for countryclubs and Jack Hartounian (Jackie Mason) soon ends up making a mess of everything with his low-class ways. All this results in great embarrassment for the Hartounian daughter who wants to fit in with the nasty rich jerks that are members of the place. And, it results in the club members not only giving Jack Hartounian the cold shoulder but trying to destroy his business...out of spite. And, naturally, Hartounian returns the favor!\n\nBecause of the dearth of original actors who reprised their roles, the filmmakers made a very bad decision. While the cute groundhog was one of the best things about the original film, here in the sequel they elevate its part significantly....which is NOT a great idea when you're talking about a puppet! Now, the puppet can actually talk (a bit) and its antics are no longer cute but boorish and stupid. Add to that lots of farting, a horse that laughs. the most idiotic golfing scenes in history as well as joke after joke after joke that fall completely flat because they aren't funny, and you've got a film that is a chore to watch.\n\nI would have to agree with comments like \"it's the worst sequel ever\"....as I can't think of a worse one off the top of my head. However, it has a few tiny laughs here and there so it manages to eke out a 2...hardly a glowing endorsement for this mess! It's inept on every level...and especially where it counts...with the god-awful writing. As for the acting, it isn't good...but Dan Akryoyd is simply god-awful....worse than he was in \"Dr. Detroit\" or \"Neighbors\" or even \"Nothing But Trouble\"!"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "lee_eisenberg",
        "review_rating": "1",
        "review_title": "unnecessary...VERY unnecessary",
        "review_detailed_main": "I saw \"Caddyshack II\" when I was ten and I mostly laughed because of the horse scene. I should have realized that the movie was as empty as...I can't come up with a good comparison. It's stupid and not even really funny. The cast members from the original who chose not to star in this made probably the best choices that they ever made in rejecting this; why, oh why, did Chevy Chase return?! And how on earth did Jackie Mason, Robert Stack, Dyan Cannon and Dan Aykroyd get involved in this swill?! I bet that every person who had his/her name even remotely attached to this junk (e.g., the caterer) is ashamed beyond redemption. So, all in all, it's beyond dreadful, terrible, and everything such. Avoid it like you would the Ebola virus."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "mattpope384",
        "review_rating": "1",
        "review_title": "Caddyshack 2: A Cautionary Tale of Bad Sequel Making",
        "review_detailed_main": "Caddyshack 2 is a study in god awful sequels. Along with Blues Brothers 2000 and Beverly Hills Cop III, CS2 is in the trinity of terrible sequels to 80's comedy classics.\n\nThe basic plot of CS2 is the same as the first: a vaguely ethnic new-money guy crashes the WASP-y Bushwood Country Club. There are subplots about a groundskeeper and a gopher and young people learning to stand on principle, and it all climaxes in a golf match. But the original Caddyshack felt like a raunchy celebrity roast; the sequel feels like a lame afterschool special.\n\nCS2 was rated PG while the original was rated R. This highlights sequel kiss-of-death # 1: the studio wanted it to appeal to a wider audience (read: something for the kiddies).\n\nNo part of the first Caddyshack is for kids; even the Gopher is more like a good acid trip (does anyone else see that dancing gopher?) – than a family friendly puppet. CS promoted sex and drugs and a contempt for authority. That's because it was directed and headlined by comedians who also promoted sex and drugs and a general contempt for authority.\n\nBut the studio wanted a family accessible sequel since the PG rating is generally seen in Hollywood as better for box office returns.\n\nAnd so there are literally Looney Toons cartoon characters in Caddy Shack 2. Instead of Rodney Dangerfield's hilariously profane Al Czervik, we get a cornball Jackie Mason as a developer-with-a-heart-of-gold. Instead of the class warfare middle finger of Caddyshack, CS2 brings a saccharine \"Up-With-People\" message about self-acceptance. Bill Murray's brilliant comedic menace as the burned out Carl the Groundskeeper, is replaced by a grating Dan Aykroyd. Aykroyd is best as the straight man (Elwood Blues on SNL, Joe Friday, Louis Winthorp ). When he goes for zany like he does in CS2 he is like the unhip but well-meaning uncle at a family gathering who likes to do funny voices for the tots but then uses the same shtick when coming over to talk to the adults.\n\nCS2's second sequel kiss-of-death is the lazy attempt to recycle the original film. Even though Chevy Chase was the only original cast member to return, CS2 limply retreads most of Caddyshack's other character types. Robert Stack is no Ted Knight and Jonathan Silverman is too bland to fill Michael O'Keefe's shoes in the Danny Noonan role.\n\nComing back as Ty Webb, Chase's one stab at edginess in CS2 is a bizarre and unnecessary scene in which he chases off a table full of attractive women in the club's lounge by propositioning each of them with silly euphemisms for sex. The joke falls woefully flat and is out of character with the charming Ty of the original.\n\nThe third sequel kiss-of-death plaguing CS2 is its troubled development history. Harold Ramis, who co-wrote and directed the original, was reluctantly coerced into scripting a sequel. Rodney Dangerfield initially pushed hard for a sequel, but later pulled out over creative differences with the studio. Ramis also dropped out and urged the studio to let the sequel die. Instead the studio brought in other writers and director Allan Arkush who had more experience with TV than big screen filmmaking, (which may explain why CS2 feels like a made-for-TV project). Other than Chase, none of the original cast wanted anything to do with the sequel. Lawsuits popped up over the use of characters and unfulfilled contracts. All indications were that CS2 was a project that should have been terminated in early development but, as is the case with many Hollywood disasters, the suits saw dollar signs and ignored the warnings of the creatives.\n\nCaddyshack 2 is simply unacceptable. It's only redeeming value is as a cautionary tale for future filmmakers and studio execs about how to kill a comedy classic's name by attaching an abominable sequel to it."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "arclight-5",
        "review_rating": "1",
        "review_title": "Bad!!!!",
        "review_detailed_main": "Why was this movie ever made?They have tarnished the original Caddyshack with this crap.I was only able to watch half of it and i didn't laugh once.At least i didn't pay to see it because it was on t.v. but i won't get back that hour of my life that i spent watching this dreadful mess.There wasn't one original star from the first except for Chevy Chase and he probably regrets doing this film.Jackie Mason was supposed to be the outrageous,funny buffoon like Rodney Dangerfield was in the first but Jackie Mason wasn't funny at all.Jackie Mason is no Rodney Dangerfield.If you want laugh,watch the first Caddyshack.If you like terrible movie's,then this you're movie.This movie stinks like a barnyard in july.Avoid at all cost."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "bleve",
        "review_rating": "1",
        "review_title": "as highlander II was to Highlander, so was caddyshack II to Caddyshack",
        "review_detailed_main": "It sucked.\n\nI returned the video after watching half of it. Not funny,\n\njust a cheap and desperate attempt to cash in on a very very funny original. junk, forget it, don't waste your time etc etc"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "clayjar_azn",
        "review_rating": "1",
        "review_title": "Totally unfunny and stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "ajohns1",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "I have no idea why everyone hates this movie to call it garbage a travesty an unexceptable sequel is just unfair i mean what else could they have made for a sequel then. Cause seriously I think it should have had a sequel (Rodney Dangerfield) says: hey everyone were all going to get laid and then a little dancing goffer and thats it thats the end of Caddyshack even though the film rating on first one was (R) and the second one was (PG) it was still lots of fun .\n\n(7/10)"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "rtksunflower",
        "review_rating": "6",
        "review_title": "Why the Bad Reviews?",
        "review_detailed_main": "No, its not Caddyshack... but it made me laugh out loud which is what I needed. Personally, I liked Jackie Mason. The movie is not an Oscar winner but who cares when you want a light film that doesn't require a lot of brain power."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "A swing and a miss of golf comedy sequel...",
        "review_detailed_main": "Eight years after the original 1980's classic comedy, the world was gifted with \"Caddyshack II\" from writers Harold Ramis and PJ Torokvei. Now, after having seen this 1988 sequel, it is hard to believe that Harold Ramis was actually involved in this train wreck of a sequel.\n\nThe storyline in \"Caddyshack II\" is essentially just a watered down rewrite of the original \"Caddyshack\" movie. Yeah, that was about the originality that writers Harold Ramis and PJ Torokvei could muster in an eight year span between the two movies.\n\nThe storyline was a swing and a miss, it was lacking in originality and it was lacking in laughs. So you're not in for anything particularly grand when you sit down and watch \"Caddyshack II\". So don't get your hopes up for this movie from director Allan Arkush.\n\nAnd not even with the likes of Robert Stack, Jonathan Silverman, Brian McNamara, Randy Quaid, Chevy Chase and Dan Aykroyd on the cast list was there much to be enjoyed in this watered down version of the first movie.\n\nWell, sure, if you are a die hard fan of the original movie, then there is perhaps some enjoyment to be found in \"Caddyshack II\". But I was just a casual viewer, so this movie didn't really cut it for me. But hey, the gopher made an appearance, and truth be told, then the gopher was mainly the reason why \"Caddyshack II\" managed to stay afloat.\n\nMy rating of \"Caddyshack II\" lands on a four out of ten stars."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "bleuxxx",
        "review_rating": "",
        "review_title": "no",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "grahamsj3",
        "review_rating": "2",
        "review_title": "Awful! Just awful!",
        "review_detailed_main": "This film should never have been made! It stinks, it's awful, it's no good, it's bad, it's terrible. Starting to see a pattern here? Jackie Mason is certainly no Rodney Dangerfield. Gone were Ted Knight and Bill Murray, who, along with Dangerfield, were essential to the first film. It seems that the three of them (the stars) all knew a stinker of a script when they saw one. The one who didn't have the good sense to bow out of this was Chevy Chase, who stuck around but was extraneous to both films in my opinion. This film is quite simply NOT FUNNY. Nor does it have any other endearing qualities. This thing relies heavily on anti-Semitism to work and it works to it's detriment. I hated this thing. A waste of everybody's time."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "czunic",
        "review_rating": "1",
        "review_title": "Inexplicably Terrible",
        "review_detailed_main": "Still can't believe someone produced this atrocity, yet thought, \"Yes! This is it! This is exactly my vision! People are going to laugh at this!\"\n\nHands down, one of the worst movies ever made."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "jldehaan",
        "review_rating": "5",
        "review_title": "Not great",
        "review_detailed_main": "Despite the fact that there are some funny parts, this movie is pretty dumb. Chevy Chase is barely in it, the new characters aren't really funny, except for Randy Quaid's, and the atmosphere is really boring."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "IMSandman",
        "review_rating": "3",
        "review_title": "A far cry from the first Caddyshack...",
        "review_detailed_main": "Why is this one no good when the first one rocked? Try the fact that they attempted to replace Rodney Dangerfield with Jackie Mason! Please! That's like replacing the Beatles with Wierd Al. Randy Quaid is the only one that saves this movie from a zero.\n\nHowever, don't let this stop you from watching the first movie which was outstanding."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "coachcampbellmhs",
        "review_rating": "1",
        "review_title": "Who thought this was necessary?",
        "review_detailed_main": "I'm rating this a 1/10, because they wouldn't let me rate it lower. Jackie Mason is awful to listen to, doing his best, worst Dangerfield impression riffing and \"trying\" to be funny. Chevy Chase seems embarrassed to be in it while he's giving his lines, and the premise is downright stupid. This is bad even for a money grab, silly, supposed to be bad but funny movie."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "drewrhutchinson",
        "review_rating": "1",
        "review_title": "Not a hole in one",
        "review_detailed_main": "If you had to choose this to either be A) The worst movie of the 80s. B) The worst sequel. C) Worst sport movie or D) All the above. I choose D. I saw Caddyshack a year before I saw The first one, and that was back in 1992 when ABC decided to air this movie as part of their Saterday night movie night. To be honest here. This movie is not good as any of the movies that came out in 1988. The only good one I seen that year was Willow. The main problem was that it did not compare to the first. The cast in this one did not have same type of cemenstry that the cast in the first one had. First of all they replaced a red head Michael O Keef w a dark hair cool new comer Johathan Silverman, then they Replace Bill Murray who save the first one w another Ghost Buster Dan Aykoyd, then they replace Roddney Dangerfeld w an obnoxious Jackie Mason. And then Harold Ramis decides to give Allen Arkush the directing job and has not directed another movie since this one. The rest of this film was just slow and dry. Just remember that this was one of the first movie that Warner Brother put a new thing called DVD. The DVD cost $5.00 at Walmart and there no special feather. Just the movie in full screen along w chapter names.\n\nFood for thought. If its a nice and sunny day and its 70 degrees outside. Instead of spending $5.00 or or watching this movie. Why not go out the country club and treat you and your friends to a nice game of gold. Or if its a nice and sunny Sunday afternoon. Take the family to the miniature golf course and play a nice round of miniature golf"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "davekingman",
        "review_rating": "5",
        "review_title": "really underrated",
        "review_detailed_main": "I was really expecting to hate this, I'd heard so many bad things about it. So maybe that's why I liked it more than most of the reviewers here. I didn't have such high expectations that it would be as good as the original. Well, it isn't as good as Caddyshack of course, but it is good on it's own merits, & very funny at times. I thought Jackie Mason was just terrific in this, he has great comic timing even when his jokes are old ones that I'd heard before. Even his delivery or his mannerisms make me laugh. The supporting cast were all real good for the most part, especially Chevy Chase who had some great one-liners, & Dyan Cannon was real good & fun to watch as usual. She looks really beautiful in this, considering she was in her early 50s. The girl who played Jackie Mason's daughter was pretty good too, & really nice to look at. The worst part of this movie was the Dan Akroyd character. Bill Murray would have been so much better. Also, the movie is just too silly, and just plain dumb at times, the gopher is used too much, and Marsha Warfield is in it (but thankfully, not too much). So, if you don't expect much, you might enjoy it. It's not a great comedy, but it's not embarrassingly bad like most people say it is. The problem with those people is they want to compare it to the original. You can't really blame them for that. But when you watch it, try to forget about the original and accept it as something separate from that. I wish Rodney & Bill Murray were in it too, but they're not. So what? I wish John Candy was in it. He would have been great too. But he's not, so what? It's still pretty funny. Hey, if I liked it than it can't be that bad. My standards are pretty high."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "harrytrue",
        "review_rating": "9",
        "review_title": "A equal That Exceeds the Original",
        "review_detailed_main": "Everyone is entitled to an opinion. The only critic who counts is yourself. I think this is a great movie. Much better than the original.\n\nIn \"Caddyshack\", Rodney Dangerfield is funny, but obnoxious. He was asked to do the sequel, but things got in the way. Jackie Mason shows the saying that \"less is more\". He is funny, but a man with real family issues, a more rounded person. It's no drama, but a movie that makes you feel. Actually in some points, you feel sorry for Jackie Mason, especially when his daughter walks out on him.\n\nIt has a good soundtrack, and overall, a good sorry. A good end to the series.\n\nIn the TV show \"Alf\", Alf says that he cried in \"Terms of Endearment\". The wife , Kate Tanner, played by Anne Schedeen, also says he cried at \"Caddyshack 2\"."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "theskylabadventure",
        "review_rating": "7",
        "review_title": "So it's not Caddyshack. What's the problem?",
        "review_detailed_main": "Caddyshack 2 has a dreadful reputation, due only to the fact that it is a sequel to a highly-held classic. People have criticised the film on a lot of grounds, but they all ultimately hark back to the fact that this is not Caddyshack.\n\nI would begin by saying that we should just take Caddyshack out of the equation and consider this film on its own merits, but I think that would be unfair. The movie does have a lot in common with its predecessor. The class-related themes of 'snobs versus slobs' and the desire to fit in to a class above your own are as prevalent here as they were in the first movie. The two things that are truly lacking here are Bill Murray and Rodney Dangerfield, who are replaced with Dan Ackroyd and Jackie Mason respectively.\n\nNow I am not about to try and argue that Ackroyd comes close to Murray in the movie, but Jackie Mason is an admirable successor to Dangerfield. He comes off as a cross between Dangerfield and Arnold Stang, but without biting too heavily on either. I wouldn't say that he is anywhere close to being as funny as Dangerfield is in Caddyshack, but there is a whole lot more point to his character and his dilemma in the film.\n\nChevy Chase only pops up and handful of times in the movie, which is another common complaint. Maybe these particular naysayers didn't notice that he only popped up a few times in the first movie. For my money, his scenes here are a lot funnier, if somewhat over-directed.\n\nWhile I'm on the subject, it is really the over-direction of this movie that brings it down. It comes across as far more self-conscious in its attempts to get a laugh. Many of the jokes are laboured and there's far too much of the Gopher, who seems to have taken on a far more anthropomorphic personality and a voice, just in case we didn't grasp the idea that its meant to be funny.\n\nCharacters are similarly hammered home, particularly the smarmy yuppy kids. Jackie Mason rarely misses a beat, and is consistently likable and very funny, but we didn't need the tango sequence at all! The director is clearly not of the same school of thought as Harold Ramis. Not to suggest that Caddyshack was subtle, but the jokes here are just a little overcooked, and most of them are unnecessarily embellished with a quirky music cue.\n\nAll things considered, this is a fun, goofy movie with something to say about class and identity that very few movies at the time were saying. Don't be put off by the appallingly low rating on IMDb, check it out for yourself."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "eddie-32826",
        "review_rating": "4",
        "review_title": "Not as good as the first",
        "review_detailed_main": "I liked the original Caddyshack, so thought I'd give this one a go. I agree with oher reviews, its not as funny as the original. There is the same character as before, someone that is hated by everyone in the club, that is richer than all of them. Same as before, why repeat the same storyline? The caddy in this version isn't even the main role, like the first. The only thing that made it for me, funny wise, was Chevy Chase, and maybe the auction bit..."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "friday-6",
        "review_rating": "",
        "review_title": "i think i'm the only person in the world that likes caddyshack 2 better than the first",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "yaornw",
        "review_rating": "5",
        "review_title": "The original was juvenile with only a few genuine laughs, this is about the same",
        "review_detailed_main": "Honestly, CADDYSHACK has always been overrated in my book, and frankly, this sequel is just as funny, which is to say-neither are classic comedies. As a kid I thought the first film was juvenile, and I was disappointed that Dangerfield, Chase, and Knight, three of my comedy favs, were giving weak performances when I'd seen them do much better elsewhere. AS an adult, rewatching, I have the same reaction. There are moments-like Murray eating the Baby Ruth that just chased everyone from the pool when he realizes what it is-that are laugh worthy, but too few and far between. The rest of it is just overacting silliness that tries to hard and flops. And this second movie is much the same. I thought Mason did a decent job given the material, and Dyan Cannon is always worth a watch but Jessica Lundy really shown here in rather a thankless straight role. Beyond that, this is pretty much the TV cast sitcom version of CADDYSHACK, and it is what it is."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "wavecat13",
        "review_rating": "2",
        "review_title": "Garish, lame, substandard, and ludicrous",
        "review_detailed_main": "Garish costumes, lame wisecracks, a substandard replacement for Rodney Dangerfield, all make for a ludicrous example of 1980s comedy. What a pathetic sequel to a great comedy."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "oyx",
        "review_rating": "3",
        "review_title": "Bad follow-up to Caddyshack",
        "review_detailed_main": "When I first viewed this movie, I didn't know the title of it. I realized it had Chevy Chase in it with the same name he had in Caddyshack so I had an idea this was Caddyshack 2. At the end of the movie when I did find out it was Caddyshack 2 I was disappointed. They could have done better. Dan Akroyd I thought was bad. The whole story was bad. Call this movie by another title, but don't call it Caddyshack 2. You give that great movie a bad name. Jackie Mason's daughter when I first saw her looked like his wife. How old is this girl? Geez. How about making this movie a little believable. I thought Chevy Chase was good."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "beetle-259-554148",
        "review_rating": "2",
        "review_title": "Why does this movie exist?",
        "review_detailed_main": "I loved the first Caddyshack so when I saw this movie for sale on DVD at the now-gone Liquidation World, I asked my grandma to buy it. I watched it all the way through and it felt like I was watching a movie that shouldn't exist in this universe. The only returning cast member was Chevy Chase reprising his role as Ty Webb.\n\nIt felt like a movie that wasn't supposed to exist. I have no idea where grandma's DVD of this thing is now, probably in a box gathering dust in my grandpa's bedroom or god-knows-where after it was donated to Salvation Army."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Nitpicking",
        "review_rating": "1",
        "review_title": "Vile",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "wayofthecass",
        "review_rating": "2",
        "review_title": "Why?",
        "review_detailed_main": "Caddyshack II is one of those pictures which makes you ask 'Why?' As in; 'Why was it funded?': 'Why was it made?' and 'Why was it released into the public domain?'.\n\nTo say the least it's a bad film. It serves little purpose but to underline how superior its prequel was by setting an almost identical set of characters against each other in a similar storyline as a 'New money' land developer attempts to buy out the establishment's golf course sanctuary.\n\nRight off the bat making the follow-up a whole 8 years after the original is somewhat bizarre. I mean if your going to cash in on highly successful picture such as the first one then you have a window of a few years to do so. But leaving it 8 years means that the formula is hardly fresh enough to simply do a follow up, or poor imitation as this is, so your sort of obliged to reward fans of the original by giving them at least reference to if not indeed actual contributions by the actors who made the first one so memorable. But there's little if any of this.\n\nInstead we get cheap imitations. Okay the passing of Ted Knight in the interim years would have made it impossible to bring back the memorable Judge Smails but Robert Stack's inclusion as 'Chandler Young' (a fellow WASP elitist akin to the Smails character) is unimaginative and seriously lacking in the sort of anarchic frustration that made Knight's turn so watchable. Jackie Mason's 'Jack Hartounian' is a feeble attempt at recreating the non stop wisecracks delivered by the Al Czervik (Rodney Dangerfield) character of the first. While Dangerfield's role was endlessly quotable Mason's is completely forgettable.\n\nBill Murray's laughably ridiculous groundskeeper 'Carl Spackler' and his war of attrition with the pesky local gofer is substituted for his Ghostbuster's co-star Dan Ackroyd's role as the militant 'Capt. Tom Everett' who's high pitched voice just splits your sides with frustration as opposed to the intended laughter.\n\nRandy Quaid , brilliant as Cousin Ed in the National Lampoon's Vacation series, is quite the opposite here playing Hartounian's unstable lawyer. The looks of disbelief shown by the actor's looking on at Quaid's character's intended to be hilarious acts of inappropriate violence echo that of the audience. Your not laughing. Your just asking 'What the hell is he doing?'\n\nChevy Chase shows up, all be it occasionally and wisely rather fleetingly considering the disaster that's perpetrating itself around him,as club pro 'Tye Webb' in the films only direct reference to the original not withstanding the golf course itself that is. With his deeply tanned skin and loud Hawaiian shirts Chase looks like he's just got back from a lengthy summer vacation and needs a paycheck. He distances himself from the events in the actual picture enough that he takes little of the blame and leaves with some, all be it little, credibility still intact.\n\nJessica Lundy as Mason's daughter 'Kate' takes over from the 'Danny Noonan' role of the original as teenager struggling against class divides. Sounds ridiculous doesn't it? At least in the first Danny (an Irish Catholic from a blue collar family) and his laughable attempts to make inroads into the White-Anglo-Saxon-Protestant dominated world of the golf club mover and shakers was played out to some memorable set pieces such as being dismissed by the resident Lutheran Bishop as well as being mocked by the offspring of the local yacht club. Lundy's embarrassment of her father's inability to fit-in is hinted at being because of his Jewish roots. That aside it may also have to do with him being a classless moron but such intricacy's are swept aside though I stopped caring long before they were resolved. At the end of the day Noonan was trying to get ahead in life. Miss Hartounian's biggest problem is getting the hob nobbers at the local golf club to like her multi-millionaire father so that she can get a date with the club's prodigal white kid. Or so I gathered.\n\nAnyway in summation its poorly written, badly scripted with lame set pieces and wastes a lot of talent. Indeed kudos if you were able to sit through it to it's conclusion. It really is a penance. There is that question mark though of why did so many of the original actors not return as opposed to being replaced by performers who on paper at least looked their equals. Maybe they just weren't asked. Or perhaps I suspect they actually read the script. Stick to the original!!!"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "johnmack63",
        "review_rating": "1",
        "review_title": "Must Be Seen to Be Disbelieved",
        "review_detailed_main": "Caddyshack 2 is so bad it must be seen to be disbelieved (and I loved Caddyshack). It is an insult to movies, golf, gophers and humanity in general and must rank as one of the worst movies ever made.\n\nIt's not bad in a bad Adam Sandler movie way either. It is so bad its surreal. It is so strange and poorly written you will be convinced that the screenwriters must have been dropping acid. Everyone in the movie is embarrassingly awful and Dan Akroyd, who speaks his lines in a strange, high-pitched voice, should have his SAG card revoked for his performance as a crazed grounds keeper.\n\nThe movie \"stars\" an incredibly miscast and unfunny Jackie Mason, and his love interest is played by an ancient and cadaverous looking Dyan Cannon (I am not kidding). To give you an idea of how old Dyan Cannon is, she was once married to Cary Grant. For masochists only."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Hole in one",
        "review_detailed_main": "I like the bit where he hit the ball really hard and got a hole in one on a par 4"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "The-Sarkologist",
        "review_rating": "7",
        "review_title": "A rather blatant jab at the world of high society",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "SeminolePhenom",
        "review_rating": "2",
        "review_title": "A huge leap downward from the original",
        "review_detailed_main": "When a hardworking entrepreneur is rejected from a prestigious country club, he starts a battle between the members and eventually buys it from Ty Webb(Chevy Chase) and turns it into a theme park/golf course in which everyone can join.\n\nThis is by no means a good movie, but it is still slightly amusing at times. Almost all of the comedy is cheap slapstick and bad jokes except for Chevy Chase. Chevy Chase plays one of his greatest roles as Ty Webb for a second time and plays it great. He is not only the funniest character in the movie, he is the only funny character in the movie. Even Dan Akroyd fails to bring humor to this film which aspires to be a great sequel to a classic comedy but falls to rubble with others shown on Comedy Central. The movie might have been better if Ty Webb(Chase) had a larger role but instead he was reduced to a minor character and the star became Jackie Mason(Who??) They should have brought back all of the cast and made a sequel the right way! This is a perfect example of what not to do when making a sequel to an already great movie. Overall, Caddyshack II is humorous but a large mistake.\n\nI do not recommend this movie."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "CuriosityKilledShawn",
        "review_rating": "5",
        "review_title": "It's NOTHING compared to the original, but still quite amusing in its own right",
        "review_detailed_main": "Eight years after the classic original Warner decided to do a sequel to Harold Ramis' director debut. Only Ramis isn't in the chair this time (surrendering the honors to sitcom director Allan Arkush), but he did pen the script.\n\nThe only returning characters are Ty Webb and Mr. Gopher. There were supposed to be more but Bill Murray and Rodney Dangerfield hated the script and Ramis would not let them make their own changes, which I think was a huge mistake and quite arrogant and out of character for Ramis. Taking Murray's place is Dan Ackroyd as Captain Tom Everett, a mentally-scarred war vet turned mercenary, and Jackie Mason as Jack Hartounian, another boorish, blue-collar millionaire property developer. He's entertaining, but he's certainly no Al Czervik.\n\nTed Knight passed away in 1986, so Judge Smails couldn't return either. Instead we have Robert Stack playing the villainous Candler Young. Again, I like Stack, but he just can't live up to Ted Knight.\n\nHartounian agrees to join the prestigious Bushwood Country Club to please his teenage daughter who is desperate to fit in. The snobs don't take too kindly to his unsavory humor or his connections to the local working class. Together they conspire to shut him down, but Jack Hartounian doesn't give up easily.\n\nAlmost everything that made Caddyshack so good is dumbed down in this sequel. The R-rating, the raunchiness, the complex character interactions...all gone. Though they somehow still managed to squeeze in a single F-word (courtesy of Randy Quaid's obnoxious lawyer Peter Blunt) in a PG, which is very rare. Caddyshack also had dozens of speaking roles and didn't care if the audience couldn't keep up with it. Those kind of quirks make it endlessly watchable, while Caddyshack II is merely good for a laugh only once in a while.\n\nThe theme of the working class clashing with greedy snobs who have had everything handed to them might be a little more relevant today, I just wish that they hadn't comprised the film so much. Had there been more continuity with the original we could have had another classic.\n\nNot as bad as its reputation suggests, and there are a decent amount of laughs. But just not enough.\n\nI do appreciate the Mad Magazine and Root Beer references though."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Gislef",
        "review_rating": "2",
        "review_title": "Faulty Cloning at work",
        "review_detailed_main": "Have you heard the theory of cloning redundancy, where a copy is poorer than the original? Caddyshack 2 is a perfect example of that. They try to duplicate everything from the first movie. Now, in a few cases this work. Robert Stack is actually a little better than Ted Knight, when they play essentially the same character. I actually like Randy Quaid, who is no more or less offensive than Bill Murray in the original. But Jackie Mason is no Rodney Dangerfield, and worse of all, C2 demonstrated once and for all that Dan Ackroyd is one of the worst comedy actors of all time. There is very little that I like him in, and C2 nailed the coffin shut on his \"comedic\" career as far as I'm concerned. He seems to feel the same, sticking more to tuffy like Driving Miss Daisy and hosting Psi-Factor. Other than that, it's mostly, \"been there, done that\" for Caddyshack 2. Watch the original twice rather than each version once, and you'll get more for your rental money."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "jennifereisenbach",
        "review_rating": "1",
        "review_title": "Far removed from the original on many levels",
        "review_detailed_main": "Caddy Shack II pretty much bombed for many of the reasons already mentioned by those here who already panned it. And I agree that it's essentially the story, not the actor's fault as the cast comprises of good actors, but this was not enough to save it. Those who opted out of doing the sequel like Rodney Dangerfield and Bill Murray chose wisely and avoided this cinematic flop. If it wasn't for Chevy Chase reprising his role as Ty Webb, this movie would have ZERO connection to the original, but despite this, Caddy Shack II is still faaaaar removed from the original.\n\nThe fist major flaw, which totally threw the movie for me is the congruence - it's painfully obvious that Bushwood Country Club is in a entirely different locale than the first movie. It is my understanding that the first Caddy Shack was filmed at a country club in Florida, and the entrance gates of the club shot on Sunset Blvd - so would it have been that complicated to at least send a second unit film crew to the original locations to at least capture various footage to use in Caddy Shack 2? And while you all are at it, get some shots of Ty Webb's Zen pad, as he never lived in a castle on a mountain. Seriously. Both the club locale and where Ty Webb lived ruined it. And the only reason I stuck it out watching is for Ty, who was quite the ladies man in the first Caddy Shack, but totally came across like a creep to women in II.\n\nBut in final - Caddy Shack II story line was literally a re-hash of the first version; country club vs.. Real estate developer. WTF?\n\nI could continue my rant of other things gone horribly wrong about Caddy Shack II - but I think the other contributors at IMDb.com have it covered."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "aeowen-03398",
        "review_rating": "1",
        "review_title": "Absolutely NOT funny!!",
        "review_detailed_main": "This is long overdue - which movie sequel was much worse? To me, it was either \"The Jerk, Too\" or \"Caddyshack II\"? I hold reservations for both wastes of celluloid, and just by a pinky finger, this follow-up to the 1980 laugh-fest seemed to gather even a chortle from me.\n\nSadly missing is not only Chevy Chase, but the late Ted Knight, Michael O'Keefe, and Cindy Morgan. So instead, they have the totally unfunny Jackie Mason, the stoic Robert Stack, and of all actors, Dan Aykroyd replacing Bill Murray! I was appalled by Aykroyd's role I just wished that Murray would have popped in for at least a cameo. Even Rodney Dangerfield was not his zinger-filled self. I just wanted to leave the theatre early, but I was on a date and didn't want to be rude. Yet she agreed that this was arguably the stupidest sequel of a 1980s hit to ever be filmed or released.\n\nSkip this, burn your DVD or VHS tape...for the sake of humanity! Just not funny."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Mark-201",
        "review_rating": "1",
        "review_title": "Horrible unfunny trash",
        "review_detailed_main": "This is quite possibly the worst sequel ever made. The script is unfunny and the acting stinks. The exact opposite of the original."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "Not completely horrible but...",
        "review_detailed_main": "Only Chevy Chase and the gopher are back. The Bushwood country club are getting new electric golf carts and the caddies won't be needed anymore. Jack Hartounian (Jackie Mason) is the inappropriate construction boss with a golfing daughter Kate (Jessica Lundy). He doesn't fit in with the snobby high class members especially since some of them from the historical society want to stop his low income apartment building. The only true friends may be Ty Webb (Chevy Chase) and caddy Harry (Jonathan Silverman).\n\nRodney Dangerfield doesn't come back and they replace him with Jackie Mason. I respect his old school comedic style. He manages to put some of those jokes in here. I find it endearing at first. Chevy Chase is back but he's just a supporting player anyways. This is Jackie Mason's movie. I don't even know why the gopher is back. It's really just a mascot without Bill Murray. The movie isn't as horrible as one may expect, but the lost of so much comedic power could never be truly replaced. Dan Aykroyd is probably the only one of the new cast who actually gets this sense of humor ostensibly to take over Bill Murray's comedic spirit. One must judge this without the Caddyshack name. Even then, this is a bland comedy."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "johnnyhbtvs27",
        "review_rating": "2",
        "review_title": "Caddyshack 1.5?",
        "review_detailed_main": "One of those comedies you just sit there and stare at as if you were numb. Not a laugh to be had in the whole movie. Dan Aykroyd has committed some amount of acts against cinema and his Captain Tom Everett character is up there with the worst of them."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "allanfinn7777",
        "review_rating": "10",
        "review_title": "Give Jackie Mason a chance -- he's an underrated comic genius.",
        "review_detailed_main": "Like Richard Pryor, Mason never got the material he deserved. Whatever you know of him is probably wrong. Get past the accent and go see his stand-up. You'll be very surprised -- he's one of the best stand-ups I've ever seen and I have seen a lot of stand-up comedy (from Lenny Bruce to Eddie Murphy to Jerry Seinfeld to Chris Rock -- Jackie Mason is definitely up there). He's known for being a comic's comic. Even Howard Stern said he is one of the top 3 funniest comedians ever.\n\nThe accussation that Mason is no Dangerfield is ridiculous. Dangerfield is known for having been a huge Mason fan. Dangerfield's career was going nowhere for a long time until he started following Mason's shows. That is when Mason provided Dangerfield with inspiration for his, \"get no respect\" routine. While I think Dangerfield is great, see them both do stand-up and you'll see Mason is the better comedian."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Solnichka",
        "review_rating": "7",
        "review_title": "Not as bad as people would have you think ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "gcic",
        "review_rating": "2",
        "review_title": "Just terrible!",
        "review_detailed_main": "I'm an absolute Chevy Chase nut but this is the worst. Ramis was right, this thing should have been scrapped before it was made. Terrible writing. Terrible storyline. Chevy Chase is the only positive in such a train-wreck. Akroyd's character is terrible."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "thebishop2",
        "review_rating": "",
        "review_title": "There's only one reason to watch this film......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "J. Canker Huxley",
        "review_rating": "1",
        "review_title": "When does the hurting stop?",
        "review_detailed_main": "In this dreadful follow-up, Jackie Mason stars in the role that was custom-made for Rodney Dangerfield. Unfortunately, Mason is no Dangerfield. Also missing from this poor excuse for a sequel are jokes, a plausible story, and (most important) Bill Murray. Chevy Chase does make a few appearances that surprisingly ease the hurting, but his contribution is nowhere near enough to save this death camp of a film."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Sinemah_Freek",
        "review_rating": "1",
        "review_title": "This \"movie\" Is without any merit, whatsoever !!!",
        "review_detailed_main": "I very much wish that I could give this movie a zero, or a negative number. The talents of these enormously talented actors - Jackie Mason, Robert Stack, Dyan Cannon, Randy Quaid, Chevy Chase and Dan Aykroyd were enormously wasted in this film that took away 98 minutes of my precious life. Were the writers, producers and the director of this tragedy on some kind of hallucinogenic drugs, or were they just so lacking in talent that they could not produce a much, much, much better sequel than this disaster??? I feel like I totally deserve to receive every penny of the money that I wasted going to see this bad, really bad flop of a film. I expected a much better film than this monstrosity. There is some debate as to which movie made, throughout the history of film is the worst. Well, this \"film\" puts an end to the debate. It is the worst movie of them all. It was not even slightly funny. In fact, nothing in the movie made me smile, let alone laugh. I will never understand why in the world the big talents I mentioned earlier didn't merely walk away from this movie after reading the script. Even the gopher was UN-funny. It was just another annoyance in this totally rotten tomato of a film."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Josey_Strife",
        "review_rating": "4",
        "review_title": "You can see Chevy die a little each time he speaks",
        "review_detailed_main": "Hampered by a PG rating and rarely landing with its funny bits, this movie has a reputation for being one of the worst sequels of all time. While not the worst film ever made, it's not really worth watching if you enjoyed the first. There are some funny moments to be found in the film for those that persevere, but nowadays you could simply find the clips on YouTube.\n\nIt still holds that 80s soundtrack charm at least, thanks to Kenny Loggins."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "saint405",
        "review_rating": "4",
        "review_title": "Stinker!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "bobbitt",
        "review_rating": "1",
        "review_title": "\"CaddyCrap\" should be the title of this movie",
        "review_detailed_main": "caddyshack II does NO justice for the caddysack. thin plot, thin actors(exception of randy quaid). the ONLY thing that is decent with this movie is the soundtrack..maybe. this movie should have been destroyed when the script was written."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "jacobjohntaylor1",
        "review_rating": "1",
        "review_title": "Worst then first movie of Chaddyshack and that was an awful movie.",
        "review_detailed_main": "This is an awful movie. 3.7. This is such a an awful movie that 3 is overrating it. This is a 1. The fist movie of Chaddyshack was awful and this is worse. This movie is not funny. The story line is awful. The hummer is awful. Do not see this movie. Life is to short and like most comedy movie this is just a money grab. Do not see this movie. There are good comedies out there. This is not one of them. You have been warned. Do not see this movie. Most sequel are better then the fist movie. But not this one. It is just awful. I hope there is not going to be a Chaddyshack remake. And if there was it would probably be better then this movie."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "disdressed12",
        "review_rating": "5",
        "review_title": "not as bad as the first one",
        "review_detailed_main": "i actually almost liked this this movie.i thought it was witty and better written.the dialogue is better than the first one.there are also a few amusing moments.i even chuckled a few times.plus,i thought the characters were better and the movie had a better,more substantial story.having said all that,i still didn't think it was a great movie,but at it was watchable,even entertaining at times.the rating for this movie,on this site(3.4/10)is even less than half the rating of the first Caddyshack movie,and i am truly mystified.i will never see the appeal of that movie.as for Caddyshack II,not the best movie every made,but nowhere near the worst,either.my vote for this movie is a 5/10"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "sparkitupman",
        "review_rating": "8",
        "review_title": "very funny and enjoyable",
        "review_detailed_main": "Some of you people out there are just pathetic. You give this movie a bad review because it is not quite as good as Caddyshack. This is a great movie and no sequel could stand up to the original but thats no reason to give it a bad review. This movie and is very entertaining and I think the cast was great, not as good as original cast but adding a few very funny actors including Robert Stack, Dyan Cannon, Randy Quaid, Jackie Mason, Jonathan Silverman and Jessica Lundy just to name a few and all these actors did a very good job, especially Robert Stack who was hilarious as Chandler Young. Sure Rodney Dangerfield was not in this movie but it did not need him, and again some people prefer to put down this movie just because he appeared in the original and not this one. Jackie Mason is great as the main character and fills in nicely. If you loved Caddyshack and you don't enjoy this movie something is just wrong with you, as sequels go this is one of the better made movies. To everyone out there who gave this a bad review you are mental, I suggest you seek help."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Kat-42",
        "review_rating": "6",
        "review_title": "Unexceptional sequel, but cute.",
        "review_detailed_main": "Very few sequels are up to par (excuse the pun) with their predecessors, and this is no great exception. It's far-fetched, and out there, but seeing the underdog come out on top of a bunch of snobby, rich, perpetual yuppies is kinda fun. Chevy Chase's character is an amusing distraction as well."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Tak005",
        "review_rating": "1",
        "review_title": "Don't bother",
        "review_detailed_main": "If you enjoyed Caddyshack then don't bother with this film as you will be sorely disappointed. Just another example of Hollywood trying to milk the success of an original with an all round poor sequel"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Chasey",
        "review_rating": "",
        "review_title": "Utter Pants....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "michaeledbe",
        "review_rating": "1",
        "review_title": "Bad movie, but...",
        "review_detailed_main": "This movie is pretty bad. It's a pale comparison to the original, but there's one aspect that needs to be brought to light. The truly awesome song \"Nobody's Fool\" by Kenny Loggins. This song is a shining star in Loggins' anthology of hits. It's a fun song that has this amazing hook in the chorus. And this full synth bass line, that gives it an almost hard rock song. Loggins, vocals are also at the top of his game. It's a shame such a great song is coupled with this atrocity of a film. For those that have read this far, please take a listen to this hit song. I'm listening to it as I write this review and it still holds up after 30+ years."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Asch",
        "review_rating": "1",
        "review_title": "One of the worst movies of all time",
        "review_detailed_main": "This movie is so God-awful that it was literally a chore to watch. I wanted to eject it from my vcr and throw it across the room, but kept thinking (foolishly) that it would eventually get funny and then everything would be all right. \"You lose, we win, yay!\" This movie should be required viewing for anyone who even once entertained the thought that Jackie Mason was funny. After that, beat them ove the head with this movie until the tape cracks. And if you're even considering renting this turd (or worse yet, have!) I have one thing to ask of you: didn't you even look at the cover? I mean, with crap like this you can tell with just a glance how bad it is! \"Oy vey!\" This movie sucked."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "dsdsmith91",
        "review_rating": "1",
        "review_title": "biggest waste of my time since disaster movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "tyler-costigan",
        "review_rating": "3",
        "review_title": "Why?",
        "review_detailed_main": "Despite what the tagline would lead you to believe, the shack is not back. Except for the film's setting at Bushwood Country Club, and Chevy's \"special appearance\" as Ty Webb, this has little to do with the original classic.\n\nThere are only two caddies in the film, only one (Jonathan Silverman) has any part of the story and it's a minor subplot. It may as well have been called \"Country Club\". It focuses almost entirely on the rivalry between Jackie Mason and Robert Stack. Mason turns the club into an elaborate mini golf course and they have a competition.\n\nThere are some funny bits and Jackie Mason tosses out some great one-liners but that National Lampoon sense of humor is missing. Randy Quaid is there doing his Randy Quaid thing. Dan Aykroyd comes off as unfunny and annoying. And for some reason the gopher speaks English (and in one scene, Italian) and has a strong sexual attraction to poodles.\n\nIf you're a hardcore Caddyshack fan, it might be mildly amusing. But probably not."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "psionchronicles",
        "review_rating": "2",
        "review_title": "The Thrill Is Gone",
        "review_detailed_main": "Watching this movie is like watching some bald old man have his midlife crisis: buying a Corvette, wearing a bad toupee and a girdle, and hitting on teenage girls. It tries desperately to recapture what made the past great and fails at every turn. If I'd never seen the original, I'd be wondering where they were going with this. It's hard enough to make life around a golf course funny, but trying to do it without a single actor with any charisma is hopeless. Lack of charisma could theoretically be compensated for by ensemble chemistry, but that's missing too. There's not a single likeable or funny character; even Chevy Chase is a poorly-written husk of what he was in the original. The story is hard to sit through and not written by anyone with comedic aptitude. The music isn't there. No topless hotties; Dyan Cannon isn't exactly ugly, but she is aging and not attractive enough to keep you interested with only a smile. The gopher isn't even cute anymore. No budget for drugs this time? Whatever the problem is, this car has no wheels."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "spencer-w-hensley",
        "review_rating": "5",
        "review_title": "Not horrible; Just not very funny",
        "review_detailed_main": "This is considered one of the worst sequels (maybe even movies) of all time, and I really don't think it deserves that distinction. The only real problem with it is unlike its predecessor it just isn't very funny. I maybe laughed two or three times compared to lots of genuine laughs that its predecessor had. Granted since Chevy Chase is the only person from the first movie to return for this sequel, (even though it says special appearance he was in the movie more than I expected) the rest of the cast tries it's best to make this a good movie so their effort is there, they are failed by a script with practically no humor in it. Jackie Mason just isn't a match for Rodney Dangerfield's over the top irreverence. Robert Stack tries to recapture Ted Knight's snobbishness from the first film, and even though he was very funny in Airplane! he had a script with genuinely funny lines and visual gags in that movie, which he has none of here, and as a result he is just a total wasted bore. Dyan Cannon is underdeveloped and more opportunity for her character to do something could have made this a much better movie, same with Randy Quaid as Mason's lawyer. Dan Aykroyd steps in to Bill Murray's role and does horrible. Granted, I blame the script and direction for that. He could have been a great substitute for Murray if those things were better. Chevy Chase's schtick you saw in the first film and much better at that. According to Harold Ramis who wrote and directed the first movie the studio begged him for a sequel with Rodney Dangerfield returning as Al Cszervick from the first movie. Dangerfield wanted to do it but he got into a fight with the studio and dropped out of the project. Had he accepted this could have been one of the few sequels better than the first because he made the first movie the classic it was in my opinion, but he backed out and other writers decided to do the final project that is this inferior sequel. They also wanted to broaden it for a wider audience. The first was an adults-only R rated comedy whereas this is an edgy PG rated flick. By abandoning the irreverent crude humor this film failed. If Caddyshack was supposed to be a franchise, they needed to remember the irreverence that made the first so funny and carry it over to the sequel. By abandoning that the film was just desperate for humor, and we have barely a laugh to be had and actors trying to bring life into lousy material and failing. Its not as bad as you have heard but stick with the first film only and pass this one up because unlike the first this just isn't that funny. They should have scrapped this when Rodney Dangerfield decided he wouldn't do it."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "wzevonfan",
        "review_rating": "5",
        "review_title": "If you don't compare it to Caddyshack I, you'll be okay.",
        "review_detailed_main": "Alright, so Caddyshack I was better in all respects. Perhaps I didn't seem to hate Caddyshack II as much as everyone else because I wasn't expecting all that much and I wasn't comparing it to the original. But please, it is not that bad. I see other people on here giving it a one or a two, and that's uncalled for. There are far worse movies out there, and Caddyshack II has a couple of funny moments, (especially those with Dan Aykroyd). True, the storyline is weak, and Jackie Mason, (although funny), is no match for Rodney, this movie does not deserve all of the criticism it gets. It's still mildly amusing. However, I will agree with others on these following aspects: Randy Quaid was terrible and incredibly annoying in his role, the story with Hartonian's daughter added a sappiness to the story that was so trite and predictable, the carnival idea was definitely not funny, Chevy Chases cameo seemed desperate and detached, and it was too long. At least Aykroyd was funny, and was maybe, dare I say it... as funny as Bill Murray. Thats right, I know it sound like blasphemy to Caddyshack I fans, but when he said \" I read you loud and clear Mrs. Esterhouse\" I almost fell of my chair. That was funny. The rest of the movie... not so much. Just don't knock it until you try it, but don't expect a homerun, or in this case a hole in one."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "releasethebats76",
        "review_rating": "10",
        "review_title": "NOT Caddyshack!!!!",
        "review_detailed_main": "The only conceivable flaw of this film is it's title!! Please stop comparing it to the first! I did in my previous review only to separate it from the first. If you haven't seen the movie and are curious, TOTALLY forget about the first and invent a different name for this. There is nothing alike and has a mood all its own. This is a great exponent of screwy mid-80s comedy. I seriously doubt such big names in this cast did the movie because they were broke or even wanted to remake the first. Anybody who ever wanted to give a kick to the snobbish aristocracy should love this little opus. I maintain, the only reason this is in the IMDB bottom 100 is because of its title. I usually hate movies like these (i.e. adam sandler, will farrell, farrelly bros....), but this movie just keeps me laughing hysterically. I dunno, maybe it's like a bad relationship I can't get out of or just a ridiculous guilty pleasure. Either way, this is the single most underrated movie of the 80s behind 'The Stunt Man.'\n\nRobert Stack- WE LOVE YOU!!! (1919-2003)"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "mpurvismattp",
        "review_rating": "6",
        "review_title": "I actually like this movie...let me tell ya why.",
        "review_detailed_main": "OK first off I'm not gonna say I like this film more then the original, that would be crazy and completely absurd. That being said I think \"Caddyshack 2\" gets a lot of undeserved hatred and ridicule. I must admit when I was a kid I saw \"Caddyshack 2\" way before I saw the original so I think I had the luxury of not comparing the two films to each other and experiencing it as a stand alone movie. I have since watched the original many times and it's one of my all time favorite comedies. So many great quotable lines from so many great comedians make it a classic and far superior, but the sequel has some pretty damn funny parts if you give it a chance. The characters in the sequel don't go by the same names but are quasi-replacements of the original characters (except for Chevy Chase). Now this is a good thing and a bad thing as at first it seems very weird to do such a thing, but I think they made the right choice. To replace the actors and keep the same named characters would have been a much bigger mistake and would have been sacrilegious so they made the best of a bad situation and made that decision. Robert Stack, Dan Aykroyd, Randy Quaid and Jacky Mason aren't Ted Knight, Bill Murray and Rodney Dangerfield but they're not chopped liver either and that's my case for the sequel. While it's not the original it has it's moments so give it a swing and see if it's a hole in one, a bogey or just above par."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "buckeyes-05926",
        "review_rating": "1",
        "review_title": "Sets the standard for how bad comedy sequels can be.",
        "review_detailed_main": "Like the majority of people of love the original Caddyshack. Then years after seeing the original I found out their was a sequel and was excited until about 10 minutes into the film when i realize I was in a complete and utter dumpster fire. It's shoddy, lazy and numbingly stupid. The film features someone who walks like Jackie Mason, talks like Jackie Mason, does everything except make people laugh like Jackie Mason. Caddyshack II, is lamer than a duck with bunions, and dumber than grubs. It's patronizing and clumsily manipulative, and top banana Jackie Mason is upstaged by the gopher puppet. Do not watch just go watch the original again and you will thank me later."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "brother ian",
        "review_rating": "",
        "review_title": "Quite frankly, one of the greatest film achievments of all time...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "radams1425",
        "review_rating": "1",
        "review_title": "Worst \"comedy\" EVER!!!",
        "review_detailed_main": "To even call this movie a \"comedy\" is being VERY generous. I've been going to movies at the cinema religiously for more than 40 years, and in that entire time, only ONCE have I ever gotten up and walked out of a film that I paid to see. Which time was that? Well, it was the time I went to see this megaflop. Years later, I watched it all the way through on cable. It didn't get any better. Imagine a movie where every attempt at situation comedy fails, and instead of making you laugh, absolutely bores you to death. The first Caddyshack was a funnier than average film. This one, by contrast is just profoundly UNfunny. There are a number of accomplished comedy actors in the cast, but they can't make up for a script full of witless lines. If you end up seeing this one, watch it only to see just how BAD it really is. I promise you that you won't laugh once........except possibly to laugh AT it."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "pmtelefon",
        "review_rating": "5",
        "review_title": "Watchable but not very funny.",
        "review_detailed_main": "\"Caddyshack II\" is not a very funny movie but it does have a few laughs. Although I enjoy the original \"Caddyshack\" it is not sacred territory to me. The idea of a \"Part 2\" doesn't bother me but \"Caddyshack II\" is not nearly as good as the first one. Jackie Mason is a poor substitute for Rodney Dangerfield. Mason has a few good lines but he's in way too much of the movie. When the star of your movie is Jackie Mason, you're in trouble. The rest of the cast is mostly fine. Chevy Chase is funny. Dan Aykroyd is not. \"Caddyshack II\" is an okay but mostly forgettable movie. Honorable mention: Robert Stack."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "I have things to do...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "mark.waltz",
        "review_rating": "4",
        "review_title": "\"Boy this is a tough room.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "mgarland",
        "review_rating": "8",
        "review_title": "Good thing I don't throw in with ratings!!",
        "review_detailed_main": "Amazing, one of my favorite movies way down at the bottom. Guess I can take some pride in not liking what \"the general populace\" tends to go for. Jackie Mason is hilarious in this movie, and so's Randy Quaid. I can never get enough of his \"strong-arm\" tactics, just like in Moving. He was also notable in National Lampoon's Christmas Vacation. Love that guy."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "cjase22007",
        "review_rating": "7",
        "review_title": "7/10",
        "review_detailed_main": "It's really not that bad! Give this one a chance. It's not brilliant, but it's a fun movie from the late 80's. Great writing. Chevy Chase returns in his usual comedic form and the rest of the cast is pretty solid. Be the ball!"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "releasethebats76",
        "review_rating": "10",
        "review_title": "what? are you kidding?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "It At Least Lives Up to Its Reputation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "thasaint-1",
        "review_rating": "7",
        "review_title": "Not the worst",
        "review_detailed_main": "I remember my late sister and I watched this all the time as kids. Honestly without the Kenny Loggins song it would be a 5/10 imo. Granted it's not the slapstick R rated comedy like the first but for the PG-13 kids it's enjoyable. I have seen a lot worse sequels than this one."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "The Shack Ain't Back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Kotter7579",
        "review_rating": "10",
        "review_title": "A good movie, not as bad as many say it is.",
        "review_detailed_main": "One of the most interesting things is that this 1988 film is highly touted as an `in-name only' sequel. There's nothing wrong with that except this: The return of Chevy Chase as Ty Webb. This connects the viewer to this character (from the original Caddyshack in 1980,) and makes fans thinking or wanting Caddyshack II to be similar to the first one.\n\nThere are rumors that Rodney Dangerfield was supposed to return. He carried a big part of the first film, so his return would have put Caddyshack 2 over the top. Jackie Mason is the `new' Rodney for this movie and does a decent job, even though their comic deliveries are way different. Dan Aykroyd was great but not in the film enough. He should have been involved to the tune of how much screen time Bill Murray got in the first one. Robert Stack (Airplane!) was good in the `new' Ted Knight/Villian role. (We miss you, Ted!) Danny Noonan should have been back. So many others could have returned to show us what happened to their characters eight years later. Bushwood should not have undergone the total makeover it did. Instead, the characters involved, rather than the club itself, should have been the main focus like they were in the first one. When you watch this film, keep in mind that it isn't a major sequel and you may think it's another good or bad eighties comedy. Fans of the first should see it but don't be shocked when the comparisons between the original and Part II are so far apart."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "SykkBoy",
        "review_rating": "6",
        "review_title": "Not nearly as good as the first",
        "review_detailed_main": "While this lackluster sequel isn't nearly as good or funny as the first, it's got a few laughs and is likeable enough.\n\nI'm not much of a Jackie Mason fan, but was amused by his performance here. Randy Quaid was hilarious as always and stole the movie from Mason.\n\nI also got a few chuckles here and there from the golf course makeover.\n\nSo, don't expect much, but it's good for a few laughs and worth catching on HBO..."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "cellomaster",
        "review_rating": "",
        "review_title": "It's not THAT bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "kurt7825",
        "review_rating": "10",
        "review_title": "You will love this movie",
        "review_detailed_main": "If you liked the first then you will like this to it has a few similarities to the first but in some ways its even better I wish more of the original movies actors came back but they probably had prior commitments overall it's a great movie."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "kevin_robbins",
        "review_rating": "6",
        "review_title": "This isn't as iconic as the first film, but it still has its own magic and is worth a viewing",
        "review_detailed_main": "Caddyshack II (1988) is a movie that is in my DVD collection and I recently rewatched on MAX. The storyline follows a rich developer who joins a golf club and doesn't fit in because he's too tacky. He uses is funds and connection to try and gain revenge on those who don't like him. Meanwhile, his daughter wants to be more uppity and respectful and she doesn't agree with her dad's ways. Her dad will need to balance both making her daughter happy and his plans for revenge.\n\nThis movie is directed by Allan Arkush (Rock 'n' Roll High School) and stars Chevy Chase (National Lampoon's Vacation), Jackie Mason (The Jerk), Robert Stack (Airplane!), Dyan Cannon (Deathtrap), Randy Quaid (National Lampoon's Vacation) and Dan Aykroyd (Ghostbusters).\n\nThis cast, dialogue, set of circumstances and characters are outstanding. Even the premise of this movie had some potential. It was fun to see this cast of characters in every scene; unfortunately, this doesn't have the realism of the first film and this was a bit too over the top. I still enjoy the concept and could watch this one hundred times; it just doesn't have the magic of the first film. There are some legendary scenes in here like the auction, construction site scenes and any sequence with Chase and Quaid. The comedic content, while inconsistent, is still classic.\n\nOverall, this isn't as iconic as the first film, but it still has its own magic and is worth a viewing. I would score this a 6/10 and strongly recommend it."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "sloth47",
        "review_rating": "",
        "review_title": "very stupid, but hilarious flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "maq27",
        "review_rating": "10",
        "review_title": "a good movie, just misunderstood",
        "review_detailed_main": "I liked this movie.\n\nNo one I know likes it, but I do.\n\nI didn't like it as much as the first one but it was still good. The script and plot may not have changed at all, but the story was better than Caddyshack 1.\n\nThe only reason I didn't like Caddyshack 2 is...\n\nNO RODNEY DANGERFIELD!\n\nI think the movie would be better if Rodney Dangerfield had Jackie Mason's part. Although I did like Jackie Mason in the movie, it would be alot better if they kept Rodney Dangerfield.\n\nAnother flaw in the movie, that I didn't hate as much, was Dan Akroyd. The movie was done 8 years after the first one. Bill Murray, \"Carl\", could've quit his job as an assistant greenskeeper and joined the military, you know? If Warner Bros. had thought of that, it could've made the movie better, also.\n\nThis was my comment for Caddyshack II.\n\nI give it 8.2 out of 10\n\nIt could've been better, but good nonetheless.\n\nIf you've seen Caddyshack 1 and are debating on whether or not to see Caddyshack 2, I say give it a try."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "JohnHowardReid",
        "review_rating": "6",
        "review_title": "Six is generous, I know, but,,,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "miker75058",
        "review_rating": "",
        "review_title": "Aykroyd.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "neufeldesq",
        "review_rating": "9",
        "review_title": "I can't believe the hate on this movie.",
        "review_detailed_main": "Sit back and enjoy the ride. Randy Quaid at his literal best. Don't listen to all the haters. This movie is alot of fun. Seriously I cannot believe the bad reviews. All these other people don't know anything about cinema. And let me tell you, I know cinema. I e seen some movies back in my day. And hey you got that A hole Chevy Chase who is funny but not as funny when you find out that he's a big a hole. Too bad , I used to love Chevy Chase. Oh well back to what I was saying. This movie is fun for final sake. It's no comparison to the original movie, but who cares. Lets all watch a movie and crack so.e beer and enjoy!!!"
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "buccola13",
        "review_rating": "6",
        "review_title": "Who's Reviewing This?",
        "review_detailed_main": "Anybody who gives this a 1 should slap themselves. The original is not only a Classic, but also an all time movie. No sequel lacking the original cast could duplicate what the original accomplished, so they didn't bother to try. Caddyshack 2 sets out to be a semi slapstick comedy, and it succeeds completely. The jokes are stupid, and that's the point. It isn't a low budget movie that's just bad, it's a full fledged Hollywood production that tells goofy jokes from start to finish. It pulls off good guy vs bad guy perfectly. It didn't try to be part 1 so only blame yourself if you are mad that it isn't."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "BDPI",
        "review_rating": "",
        "review_title": "Just a tiny tap!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "DarylJGittings",
        "review_rating": "6",
        "review_title": "Nowhere near as good as the original.",
        "review_detailed_main": "Caddyshack II is almost remake of the original film. Jackie Mason basically takes over the Rodney Dangerfield role as the rich outsider who is snubbed by the snobs of Bushwood Country Club. He uses his money to torment the snobby members of the club who think that they are to good for him and his daughter.\n\nThe movie isn't on par with the original, but it's still decent. Chevy Chase is the only original cast member who returns unless the gofer counts.\n\nJoining Chase are Jackie Mason, Randy Quaid, Robert Stack, Marsha Warfield, Jonathan Silverman and Dan Aykroyd.\n\nThere are few laughs, but the story isn't too original. Jackie Mason is basically the same character that Rodney Dangerfield was in the first movie.\n\nKids will probably enjoy this more than adults would."
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "soranno",
        "review_rating": "",
        "review_title": "Not a hole in one but at least a decent par",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "genius-15",
        "review_rating": "",
        "review_title": "I know I'm gonna get booed for saying this, but......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Brian Blueskye",
        "review_rating": "",
        "review_title": "A movie for lazy golfers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "NCYankee",
        "review_rating": "",
        "review_title": "Absolutely terrible - don't waste your time - watch paint dry instead.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "Curly-18",
        "review_rating": "",
        "review_title": "No Bill Murray, boring, and slow paced",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "fast_eddiee",
        "review_rating": "",
        "review_title": "not gonna do for me what Caddyshack did",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094824",
        "movie_name": "Caddyshack II",
        "movie_rating": "3.8",
        "review_username": "otter77",
        "review_rating": "",
        "review_title": "Not a worthy sequel but there's a few good laughs",
        "review_detailed_main": ""
    }
]