[
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mcornett",
        "review_rating": "1",
        "review_title": "Every bit as bad as its reputation says",
        "review_detailed_main": "This movie is so, so utterly wretched, not only in its execution but also in its conception.\n\nJust from a filmmaking perspective, it's extremely shoddy. Many portions look like home movies. A large part of the film is Cameron sitting in a car talking to a friend, and that's not interesting to watch. \"Comedy\" scenes have nothing to do with the rest of the story, and are creepily unfunny. A bizarre dance scene at the end is out of place and seems inserted to extend the time. Cameron's presence here is smarmy and smug; he lays out his spiritual views and his friend just gushes about how right Cameron is and how he's helped him see the light and love Christmas and all that.\n\nA bigger problem is the misinformation that Cameron spews so authoritatively, some of which runs counter to the Bible and to known history. To give a partial list:\n\nCameron claims that Joseph and Mary were hiding from soldiers sent by Herod to kill all babies being born. But the Gospel of Matthew says the soldiers were sent by Herod AFTER Jesus was born, when Herod was tipped off by the visiting Wise Men that a King of the Jews had been born. Joseph and Mary then took Jesus and did the Flight into Egypt to save the child's life.\n\nCameron insists the Nativity took place in a cave because the manger was made of stone. No source claims the manger was stone, or that the Nativity took place in a cave. Matthew says it was in Joseph's house in Bethlehem, Luke says it was a stable. This seems like a post-hoc attempt to link the Nativity with the Resurrection.\n\nCameron says frankincense and myrrh were \"funeral spices.\" Although myrrh had been used in Egyptian mummification, frankincense was not, and both were much more commonly used as a sacred incense in Hebrew temples.\n\nHe goes into detail about Saint Nicholas' life, presenting it as fact, but in truth very little is known for sure about him, and some Christian leaders openly suggest that he may never have existed. All that is known for sure is that someone named Nicholas was at one point the Bishop of Myra; everything else is unsure and in the territory of legend and myth.\n\nLegend has it that during the Council of Nicaea, Nicholas angrily struck Arius in the face for saying that Jesus and God were separate. Cameron depicts Nicholas savagely and brutally attacking Arius and beating him with a shepherd's crook, a scene many Christians found objectionable.\n\nCameron depicts the historical Saint Nicholas climbing on a sleigh to deliver presents to children, something he never did in any legend. He also claims that Saint Nicholas is the gift-giver everywhere, also not supported by history. Some areas give gifts on Christmas, others at Epiphany, others on St. Nicholas' day, and in some areas the gifts are delivered by someone else entirely, such as La Befana in Italy, St. Basil in Greece, the Yule Lads in Iceland, St. Lucy in Croatia, and multiple countries have the gifts delivered by the Magi, angels, or the Christ Child himself.\n\nCameron says Nicholas was \"sainted,\" when in reality Nicholas was never canonized. His sainthood was more by word-of-mouth.\n\nCameron makes an elaborate rationalization for Christmas trees relating to the crucifixion and to the Garden of Eden; this connection is very convoluted and labored, and doesn't hold water. And he doesn't address the parts of Jeremiah which some feel are a commandment against Christmas trees.\n\nHe claims that gifts piled under the Christmas tree are perfectly acceptable as they are reminiscent of the skyline of Jerusalem. By that reasoning, they could also be the skyline of Babylon or Rome, and could represent oppression and slavery. It's a poorly considered analogy that should never have been included.\n\nI'm sure I'm missing other bits, but I'm not inclined to go back and watch it again. It's unsettling to see Cameron stand and claim that it's OK to be materialistic at Christmas, because that's when God came to the Earth in material form. (That's pretty much a direct quote.) Never mind the many passages where the Bible tells us to set aside worldly things and not be materialistic! He exhorts viewers to eat themselves to bursting and buy the biggest ham and the richest butter....but isn't gluttony considered a deadly sin?\n\nAt no point does he address such issues as helping the poor, feeding the hungry, giving to charity, volunteering, or anything. One is left with the impression that one should only think of one's self and one's immediate family and friends. Does Cameron remember Jesus' command to his followers to give away all they had to the poor? Somehow, I don't think so.\n\nCameron gives the impression of someone who read parts of the Bible long ago, but rather than fit his life to the Bible, he is fitting the Bible to the life he wants to lead, and making one justification after another without ever bothering to double-check if he's remembering it correctly, or if there's something in the Bible that disagrees with him. It's clear he considers himself a better Christian than you. Many of the faithful have been turned off by this movie, some even going so far as to declare it blasphemous and call Cameron a false prophet. I'm not so sure I would agree, but at the same time, this movie does have some value of showing how even a faithful Christian can fall victim to the sins of pride and arrogance. It's clear that Cameron's ego was in overdrive, and this movie is not as much a testament to God as it is an expression of Cameron's arrogance."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "NJ-Films",
        "review_rating": "1",
        "review_title": "An interminable, shoddily-researched lecture masquerading as comedy",
        "review_detailed_main": "For those of us who have watched Kirk Cameron pontificate on the wonders of the banana, or read his musings on the legitimacy of the existence of fire-breathing dragons, we know that Kirk Cameron himself is comedy gold. One might expect more hilarity from Cameron in Saving Christmas, but Cameron actually intentionally tries to build a comedy here, and the result is an unfunny, unfocused, interminable mess.\n\nThe film begins with an uncomfortable scene involving Kirk Cameron sitting in a chair, lecturing at the audience. \"They don't want us to love Christmas,\" Cameron declares authoritatively, never bothering to define exactly who \"they\" are. Cameron drones on for several more minutes, and at this point in the film, I heard a kid in the back of the theater yawn loudly—perhaps an audible protest that this film would not be the exciting romp promised on the poster.\n\nFinally, the film cuts away from Kirk Cameron, and we see several characters enjoying a Christmas party. But then we see Kirk Cameron again, the film freezes, and we hear Kirk Cameron narrating about himself: \"That's me—Kirk!\" More lecturing ensues.\n\nEventually, a character by the name of Christian (almost as clever as \"Josh Wheaton\"), a Christian himself, despondently finds his way to a car, apparently disillusioned by the materialism of Christmas. Enter Kirk Cameron, who enters the vehicle and does what he does best—more lecturing.\n\nThe majority of the film takes place in this car as Kirk lectures to Christian, with occasional cutaways to Biblical imagery. Cameron tries to make the case that Christmas traditions, such as celebratory trees and gifts, all somehow originated with Christianity, not paganism. (Never mind the fact that ancient paganism predates Christianity.) \"Last time I checked, God created the winter solstice!\" is the type of asinine reasoning you'll hear from Kirk Cameron throughout the film. Cameron's facts are both dubious and sparse, and his connections are spurious—but Christian is nevertheless invariably blown away by Kirk Cameron's apparently amazing insight.\n\nPerhaps aware that interminable lecturing on its own would be unbearable for an audience, the film provides characters with quirky personalities in an effort to break up the tedium. In particular, we are treated to a scene back in the house of two characters rambling schizophrenically as they drink hot chocolate. It has nothing to do with Christian's story, it makes the movie feel unfocused, it goes on for far too long, and if my theater is any indication, it is not funny at all. In fact, there was dead silence in my theater throughout the entire run of this \"comedy\" film.\n\nThe film ends with a dance sequence that feels like it lasts ten minutes, as well as multiple, gratuitous blooper scenes—I suppose for no reason other than to pad the running time. Just when you think it's finally over, we see Kirk Cameron again, and he continues to lecture the audience—this time about how materialism is just fine, because Jesus came to us in a material body, after all.\n\nOne gets the impression that Kirk Cameron actually started reading his own Bible, was disturbed by what he found (such as Jesus' instruction to \"go sell your possessions and give to the poor\"), and produced this film as a desperate justification for his own hypocrisy.\n\nAt my theater, nobody laughed, and nobody stayed for the end credits. This purported comedy film fails at every level. If you're really looking for a laugh, go back and take a look at what Kirk Cameron and Ray Comfort have to say about the glorious design of the banana."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "StevePulaski",
        "review_rating": "1",
        "review_title": "A yuletide atrocity",
        "review_detailed_main": "It's no secret that, on both the mainstream and independent circuit of film, Christian cinema has been a big focus in 2014. Films like \"Heaven is for Real,\" \"Noah,\" \"Son of God,\" and next month's \"Exodus: Gods and Kings\" have all catered to the faithful in some way and have gone on to achieve uniformly strong financial numbers as well. The independent circuit has seen big hits like \"God's Not Dead\" and marginal successes like \"Left Behind,\" \"Mom's Night Out,\" \"Persecuted,\" and \"When the Game Stands Tall,\" all of which finding ways to connect with their target audience in at least recognizing their faith in the cinema, a place where it's fair to believe the religious demographic has felt ignored. Former Television star and devout, outspoken Christian Kirk Cameron has now thrown his hat in the ring, latching on to this newfound trend, and effectively making not only the worst film of its genre but the worst film of 2014. \"Kirk Cameron's Saving Christmas\" is a disjointed mess, structurally pathetic and morally bankrupt as we watch scenes interwoven with little coherency, dialog written and delivered in its most wooden form, and wonderful morals to teach our children, like \"materialism is good.\"\n\nThe film begins with Cameron sitting in a blatantly artificial living room, decorated with more Christmas lights and flair than Macy's after Thanksgiving passes, giving us an introduction to the film at hand. He states the biggest problem with the Christmas season is the \"people\" who want to segregate the spread of faith and good cheer to the private homes of those who celebrate the holiday or simply want the holiday done away with all together. He rambles on for about three minutes as the introduction sets the perfect theme for this film; it's a circumventing project that never results in a specific or thoughtfully-articulated point.\n\nWe cut to a Christmas party held by Cameron's sister, where a Santa has been hired, the tree has been erected, the house has been decorated, a feast has been prepared, and everyone is in an incorruptibly cheery mood; everyone except Cameron's brother-in-law Christian (director Darren Doane), who is seen moping around the house before quietly slipping away to his car. Kirk follows Christian and learns the materialism of Christmas bothers him immensely, as he watches kids beg for toys they won't play with in three weeks and parents max out their credit cards, giving way to the materials and the illuminating tree in the center of the room, and all while neglecting the baby Jesus in the manger, who is the ultimate \"reason for the season.\"\n\nCameron begins to initiate flashbacks to biblical times to \"justify\" why we have the Christmas traditions that we do. However, it's not enough that we get a history lesson told from the enormously biased lens of Cameron, but in a dodgy and muddled manner. Cameron gets absorbed in the significance of baby Jesus's swaddling cloth and the original mean-spirited roots of Saint Nicholas (something that will undoubtedly scare and confuse children), never addressing Christian's true distaste for the holiday season. Kirk meanders for about forty minutes, talking himself in incoherent and redundant circles, never addressing Christian's questions in a way that we can extract counterpoints or citing Christmas's Pagan and cultist roots (if you're going to show Saint Nicholas as a brute, at least address the backstory).\n\nInterjected in these ridiculously dry biblical flashbacks and in-car dialogs are exaggerated characters masquerading as likable people with personalities drawn so wide they are desperately unfunny. We see two party guests discuss \"The War on Christmas,\" relating it to several other conspiracy theories that just feels like a soundoff of paranoia. We get a few minutes of dead-end, annoying conversation and some of the worst displays of acting this year before it's back to the car for a half-assed lecture.\n\n\"Saving Christmas\" ends with an abhorrent dance number to an incorrigible techno/rap hybrid, with members of the cast obnoxiously dancing and doing slow-motion choreography together. We end things with a perfunctory voice-over with Cameron before we're greeted by almost ten minutes of closing credits showing bloopers, outtakes, and a barrage of other things padding this project to just barely being feature- length (eighty minutes). If my plot synopsis sounds like it has not made any sense, then I have effectively lived up to the structure and the narrative pace of this particular film.\n\nJust by comparing the full-length film to its trailer, you can tell \"Saving Christmas\" was Cameron's last minute idea to cash in on the Christian cinema craze of the year. The trailer for the film talks about how Christmas has been corrupted by materialism and the political correctness of the holiday. However, Cameron blatantly contradicts his thesis when he states during the closing monologue that \"materialism is good\" because Christmas is about \"God taking possession of a material body.\" Aside from ushering in a pathetic excuse for a moral at the end of a film about Christmas, the cardinal sins committed here run amuck: a sloppy narrative hodgepodge of biblical flashbacks, inept lecturing, and pointless filler clearly padding a small runtime, atrocious acting on all fronts, a desperate attempt at \"staying hip\" and keeping the attention of the audience by throwing in a hip-hop dance number, contemptible morals, and failure to address or even stick to a cogent thesis. Kirk Cameron and company should be required to volunteer at local charities or help cater several breakfasts with Santa to make up for such a yuletide atrocity."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "meefcast",
        "review_rating": "1",
        "review_title": "Kirk Cameron's Low Budget Soapbox",
        "review_detailed_main": "I created this account just to give this 1 star. That's how bad it was. I went into this expecting a generic Christmas movie, and I didn't even get that. The \"plot\" is awful. I put plot in quotation marks because I'm not even sure if this movie has one. Two guys walk out to a car and talk for an hour. That's all that happens. It's basically a feature length sermon, and a crappy one at that. There are literally NO redeeming qualities in this film. The camera work is extremely amateurish, and the acting and direction were absolutely abysmal. I had extremely low expectations for this, and it still managed to be disappointing.\n\nThis movie is a total waste of time and money, and I honestly believe it's the worst movie of 2014."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "batboyexe",
        "review_rating": "1",
        "review_title": "This movie is why a 0 star rating should be implemented on this site",
        "review_detailed_main": "Saving Christmas needed saving...and by that, I mean it should have been mercy killed. the acting is horrendous and it's story is only a reminder that anyone that paid to see it wasted their money. Even if you are a die-hard Christian, please do not see this movie, it's one of the worst movies you could ever watch ever, and considering stuff like The Room and Birdemic exists, That's saying A lot. oh, and that thing Kirk Cameron's doing to try to boost the rating on Rotten Tomatoes: Cameron, you should know the Bible verse \"Thou shalt not bear false witness\" it's one of the 10 commandments. That's all I have to say on this matter, Don't watch the film. I mean Seriously Cameron, you should know better."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Jimmy-128",
        "review_rating": "1",
        "review_title": "How to Watch Saving Christmas",
        "review_detailed_main": "Every so often, a movie comes along that reminds us why drinking games were invented. This is that movie.\n\nThree margaritas seems to be the minimum for watching this one. With that much tequila in you, you will be able to appreciate the subtle humor and profound wisdom of Kirk Camer...hmph....hmph....hmph....BWA-HA-HA-HA-HA-HA-HA!!!!!!!!!! Sorry. I thought I could type that with a straight face. I couldn't. Must be the margaritas.\n\nAt any rate, this is a laughably bad movie that should go a long way toward torpedoing Mr. Cameron's already sinking career. And I say, fire at will!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "philgarnersucks",
        "review_rating": "1",
        "review_title": "Kirk Cameron doesn't speak for all of us",
        "review_detailed_main": "I barely survived the trailer. I have no idea how people paid money to see this movie. As a Christian, I have to beg Christian filmmakers to stop preaching to the converted by writing atheists and agnostics as idiotic, hateful, anti-Christian monsters. Your persecution complex in a country comprised almost entirely of Christians is laughable and only further isolates you from those you hope to convert.\n\nKirk Cameron could have made a movie that's actually about family and the true meaning of Christmas. Instead, he wanted to create a polemic against the people he's imagined that are trying to prevent him from calling it Christmas. It's just sad. Please stop making these terrible films. You're embarrassing all of us."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "DanielRobertRoss",
        "review_rating": "",
        "review_title": "St Nicholas gonna open up a can o' whup ass!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "oldkingsol",
        "review_rating": "1",
        "review_title": "Notice how long the 10-star raters have been members, and how many movies they've reviewed...",
        "review_detailed_main": "First, let me state that in spite of the claims of Cameron and those who support him (and who have attempted to artificially raise this movie's ratings with fake profiles and fake reviews), I, as someone who hated this movie, have nothing against Christians or Christianity. Not at all. Most everyone I know and love _are_ Christians. Die-hard, conservative, dyed-in-the-wool Fox-news-loving fundamentalist Christians. And even THEY thought this movie sucked.\n\nThat Kirk tried to use religious guilt on people to have the ratings artificially inflated is just pathetic. Seriously, dude, you have a problem. You need help. Get some. :-/ My opinion of this movie is pretty much the same as the opinions of EVERYONE I know who's actually had the misfortune of deciding to give it a try. It would be pure camp if those who made it weren't being so stone-faced serious. It's patronizing, condescending, childish and just downright _bad_. And it's not the message, itself - even those I know who agree with the central point Kirk's trying to make see the movie as doing more harm than good.\n\nAs for that illicit ratings-inflating campaign, it appears to be bearing fruit. When you have a movie with overwhelmingly bad ratings (and I man REALLY bad, where most are just 1-star with, shall we say, \"Nothing nice to say...\"), and just a couple of profiles with 10-star ratings and glowing things to say, and ALL of those 10-star profiles were clearly just set up just to make the glowing review about just that one movie... I'm not going to outright accuse anyone of anything, but, well, it doesn't inspire confidence in their legitimacy.\n\nI mean seriously, dude, stop it. You're not helping Christianity's image at all. In fact, you're making it worse. Even if you don't care about your own image, you should seriously give thought to how much more damage you want to do to the Christian image in the U.S. today. Or are you a closet atheist trying to destroy the \"enemy\" from within? Your actions are hurting far more than helping.\n\nAnd I have nothing against Christianity or religion in general. If people want to be proud of their religion and remind themselves of the spin Christianity has added to the meaning of all these previously-existing traditions and holidays, that's wonderful. But this? This isn't _that_. This is just pandering, patronizing, exploiting - pure and simple.\n\nPlease, Kirk, get help."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "I am pretty sure the American Atheists must have actually made this film!",
        "review_detailed_main": "While I am sure that many Christians will think that this film was savaged because they are all haters, the fact is that \"Saving Christmas\" is an incredibly bad film. Christians and non-Christians alike will most likely find it tedious--like a lecture by a boring professor that goes on and on and on and on. It lacks the structure or style to make it interesting or even a movie. Instead, it mostly consists of Kirk Cameron lecturing and lecturing and lecturing and who wants to go to see a film or pay for a DVD like this?! On top of that, so much of the film was just badly made...such as the insufferable opening song, the illogical 'truths' in the film (such as the myth about swadling clothes and how they are the same as burial cloths--which they AREN'T), the poor acting and overall dullness of the movie.\n\nThis film isn't even bad in a fun way like BIRDEMIC or THE ROOM or PLAN 9 FROM OUTER SPACE. Instead, it's just ponderous and preachy-- things no one wants from a movie. Totally misguided and terrible."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "datemaru",
        "review_rating": "1",
        "review_title": "You have to see this to believe it, I mean it!",
        "review_detailed_main": "I'm kinda in charge of my church's youth group. It's because I'm the only guy in their 20s that shows up for church. I don't know how we ended up seeing this movie because none of us wanted to see this. The teens didn't want to see some religious movie, my pastor didn't want to see this because she loathes Kirk Cameron, and I didn't want to see it because I wanted to see a good movie. Apparently one of the parents insisted we see a documentary about making Christmas more about Jesus and less about commercialism.\n\nWell the jokes on them because shockingly this movie is all about justifying the commercialism of Christmas.\n\nI was seriously not expecting that. THis movie throws so much BS at you that it's pretty worrying. It's also really funny. I think I was the only person who enjoyed this movie. I was hoping that Kirk would have a seeing where he's just says insane things like his infamous interview on evolution.\n\nThis whole movie is insane. I don't think anyone was expecting it to be like this with the random dance scenes, the stereotyped black guy, the stereotypical atheist, and everything else.\n\nAnd now here is an example of Cameron's crazy points about Christmas: -The Christmas tree is not Pagen, it is because Adam and Eve stole from the tree of knowledge and to make up for the original sin, Jesus returned the fruit which was part of man by hanging himself on a cross, which is made of wood which naturally comes from a tree. So trees are really crosses and the Christmas tree is a cross.\n\nI did not make that up, that is seriously an argument he makes.\n\nAnd the whole movie is so insane that you have to see it to believe it. I don't think this movie will harm society because I think most Christians who make a big deal about the \"War on Christmas\" will be horrified by this and those who actually buy into it were probably lost causes. But if you want to see a man who clearly needs to be institutionalized just be gloriously and honestly insane, then watch this movie. I haven't seen anything this funny since Twilight Breaking Dawn Part II."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "wpmansfield",
        "review_rating": "10",
        "review_title": "Cinematic equivalent of a car accident",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "rje58",
        "review_rating": "6",
        "review_title": "Definitely not a 10, nor a 1",
        "review_detailed_main": "This movie is not a '10', and not a '1', either. Why are the vast majority of the votes either 1's or 10's, then? Because people are voting their worldview, instead of voting on a movie.\n\nIt is hard to categorize this film - if I had to categorize it, I would call it a Christian docudrama, or Christian Christmas movie. In my opinion, an hour long television program would have been a better format for this effort, than an hour and twenty minute theatrical release.\n\nIt is a low-budget digital independent film, and the production values reflect that. It sets out to present a conservative Christian point of view, and does that openly and unapologetically. There was nothing that I found intolerant or mean spirited, and it seemed rather to espouse traditional Christian values of Christmas, such as \"Peace on Earth, Goodwill toward All\" - although that line does not occur in the film.\n\nThe bottom line is: if you are a conservative Christian, then you will probably enjoy this movie or at least find it interesting. The further your worldview departs from that, the less enjoyable you will likely find it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "fierylocks1-179-415835",
        "review_rating": "1",
        "review_title": "Another terrible movie from Kirk Cameron",
        "review_detailed_main": "This movie was a joke. Don't waste your time or money. It's a typical pandering movie that will no doubt be forgotten. Cameron claims that Christmas has become too materialistic, yet in a recent article claimed he was a 'sucker' for all things Christmas. The decorations, the gifts, the trees (which are Pagan by the way), and the shopping. He stated in an article he was a sucker for these things. Pretty much in contrary to his movie. He even once claimed Halloween was stolen by the Pagans from Christians. Kirk Cameron is quite clueless. Even Christmas is Pagan. He's a joke and so are his movies. His movies are made just to line his pockets. He And he's a bigot to boot."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "davidermold-183-66576",
        "review_rating": "1",
        "review_title": "Everything that needs to be said about this movie has already been said.",
        "review_detailed_main": "When a movie makes the bottom of the IMDb worst movie list, I have to see it in the theater if at all possible. For weeks now, I read the bad reviews, read Cameron's plea for fans to up his ratings online, and anticipated this getting cam'd so I wouldn't have to pay good money to see it. Unfortunately, it's not even good enough for someone to cam and upload online.\n\nThe problem is that this movie never should have been released in theaters; it should have been straight to video. More accurately, it never should have been released at all. All this film equates to is a big stroke of Cameron's ego. He is clearly in love with himself, and I'm sure every review, good or bad, makes him feel all the more confident. It's sad, but true. Or, maybe he was just trying to do something nice for his family. If you have the money, why not make a movie with your sister so she can feel like a star too. Unfortunately, she probably feels more shame than good.\n\nThere is no doubt here. This is a bad movie. Yes, I might even say it's the worst movie ever. I've never walked out on a movie before, and that record still holds. However, the thought passed my mind several times while watching. I now feel ashamed of myself that I did not. The bastardization of Christianity that this movie inflicts upon the viewer is almost unbearable. I'm sad to know that I supported Mr. Cameron by paying to see this film. However, I am happy to see this filth voted into oblivion."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kira02bit",
        "review_rating": "1",
        "review_title": "Abhorrent in every way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Terastas",
        "review_rating": "1",
        "review_title": "Should have been called \"Murdering Christmas\"",
        "review_detailed_main": "Forget the laughably shoddy production value, the overt preaching, and Kirk Cameron's epic social media temper tantrum when the film was critically panned. All you need to know is that Cameron's message about Christmas is the opposite of what one would expect from a movie called \"Saving Christmas.\"\n\nSee, that whole \"saving Christmas\" storyline has been played out in kids' movies and Hallmark specials over and over again, and it's always about stripping away the commercialism and materialism and getting back into friends and family.\n\nKirk does the exact opposite in this film: He CELEBRATES and ENCOURAGES rabid commercialism. And worst of all, he even attempts to justify his materialism -- his greed and narcissism -- by claiming that's the good proper Christian thing to do.\n\nSo if not from rabid consumerism, what is Kirk Cameron trying to save Christmas from? From people celebrating, or even acknowledging the existence of, other holidays besides Christmas, from non-Christians celebrating Christmas, and from Christians celebrating Christmas any other way than the way Kirk Cameron believes you should.\n\nIn short, this is eighty minutes of Kirk Cameron trying to cram one hundred pounds of his self-absorbed discount-salvation bull**** into a one-pound bag, slap \"Christmas Spirit\" on it with a label maker, and hopelessly attempt to cram it down your throat.\n\nUnless you are a raving fascist fundamentalist who only hasn't watched this movie because you are afraid of what will happen if you turn your 24/7 Fox News feed off, this movie is guaranteed to make you very angry. It does to Christmas the exact opposite of what the title promises: It delivers unto Christ this biggest black eye in our lifetime."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "t_atzmueller",
        "review_rating": "1",
        "review_title": "Not remotely funny, neither in the right nor wrong sense",
        "review_detailed_main": "I have to admit, that I hadn't even planed to go to the movies on the day that I walked into \"Saving Christmas\". There was nothing on offer that interested me, so I turned to figure another way to squander my money. But then I saw the name \"Kirk Cameron\", saw that pasty face on the poster and two words came to my mind: \"Crockoduck\" and \"Banana\"! Yes, through the internet-memes and jokes I had been exposed to Cameron and his ilk. Upon realizing that those people were not comedians, I figured this was the most hilarious insane stuff I had heard in a long time and that Kirk Cameron may well be the missing brother of \"Dumb and Dumber\". So I flashed the buck, walked in and expected much unintentional hilarity and future memes in the making.\n\nThere were about 10 to 15 people sitting in the cinema, most with kids (I presume they were expecting a Christmas comedy). For a good deal of the beginning we are exposed to Cameron brattling on about some things or other, but it was mainly boring, nonsensical stuff that contained no (unintentional) comedy gold. Only when Kirk spouts that \"god created winter solstice\", there was some chuckling to be heard. Not bad, but heard before (what hasn't god created allegedly? Cars, air, shoes, bacteria, the universe and everything else, etc – this answer will give you a guaranteed A+ in any bible- or koran-school). At this point Cameron is sitting in some car with another guy and, like a true believer he keeps rambling and rambling and rambling. Nodded off for awhile but since I have a light sleep and get easily awoken by noise, I can only deduct that there was no joke missed since nobody had been laughing so far. At what I presume must have been the end of the \"movie\" there was some ridiculous dance-sequence (you know the type that should signify to the audience that they're watching a 'hip' film) and I decided to call it a day. As I turned to leave, I noticed that the cinema was empty and that I was the last rat to leave the sinking ship. So I left Kirk and his friends to dance to an empty cinema – and for all I know, they still dance there as I write.\n\nLook, we are all aware that people will believe much if only it gives them a crutch for reality. Virgins giving birth, horses flying from Mekka to Jerusalem overnight, zombies rising from the grave in order to bring world-peace, etc. It would be pointless (and perhaps even unkind) to point out that virgins cannot give birth, horses don't fly and that the dead stay dead. But that's were magic and science clash, alchemy has to make way or chemistry and believe hollers at common-sense and knowledge. Nothing new there, it's been going on since the stone-age. But the stuff that Cameron and his ilk have formulated here (to put it kindly), that's a whole new dimension of crazy. It reeks not only of fanatics but of self-serving. And the worst sin: this movie is boring, tedious and free of laughs, no matter which way you slice it.\n\nThe lesson learned: it can be mildly amusing to watch a five minute YouTube video about a deranged guy, but giving him 80 minutes of your live, that's simply not a good idea. It's like holding a 'deep' conversation with a bunch of jehova's witness or the guy on the corner with the \"the end is nigh\"-sign – what's the point if no real laughs are to be had? Just wait for the internet-meme; if there's something worth laughing about, the \"haters\" will find and post if for sure (and it's free!). \"Jesus Camp\" was funnier (and \"Jesus Camp\" was actually a very sad movie). This here is \"IMDB Bottom-100\"-material.\n\nNow, enough electronic ink wasted on this. Let's make space for those who found the movie \"exceptional\", \"inspirational\" and \"great education\" – you might be able to guess from which corner those come.\n\nWhat I give this tripe? Of course nothing. If you see a one point rating, it probably comes from god (pardon, meant to say IMDb)"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "matthewvanderels",
        "review_rating": "1",
        "review_title": "Did more to destroy Christmas than save it.",
        "review_detailed_main": "\"Jesus became Material... so that is why materialism is OK\" - is pretty much the summary of the movie. There are some Christians who do not participate in Christmas for many reasons. Kirk apparently wanted to respond to this crowd by producing this low budget, effortless film. Not only does he do his best to destroy any solid logic for celebrating Christmas, he paints fellow (non Christmas observing) believers as grumpy, ignorant, radical, and stupid. Thus, giving mainstream Christianity a horrible image. Essential Kirk has brought Christian evangelism 2 steps back in reaching the world with the true message of salvation and replaced it with justification, poor logic, and and a refocus of the faith, not of Christ, but on emotion.\n\nKirk attempted to encourage Christians with logic and reasoning to defend the mainstream stance of Christmas.... he failed.\n\nI left this film wanting more to NOT celebrate Christmas than I did celebrate it. Horrible film, waste of money, and waste of time.\n\nAn E for Effort would not even be suitable to merit this film... No effort was placed in it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "GoUSN",
        "review_rating": "1",
        "review_title": "Not feature-length quality",
        "review_detailed_main": "Full disclosure: I am a Roman Catholic, raised by devout parents and taught by dedicated clergy. I happen to subscribe to the view that the \"war on Christmas\" is part of a larger, not necessarily connected, movement whose chief side effect is to eliminate or diminish the chief underpinnings and foundations of western Judeo-Christian society. Lawsuits against Nativity displays are, to me, the handiwork of unhappy zealots.\n\nHaving said all that, this film was earnest but profoundly flawed.\n\nFirst, I didn't appreciate the swipe against the Catholic Church's hierarchy (bishops with high hats and scepters) during the St. Nicholas segment. I do like the St. Nicholas story, but it was contrived here with the original St. Nicholas doing a \"ho-ho-ho\" (I am not kidding) just before being told by his assistant to start the deliveries (presumably of gifts).\n\nSecond, if indeed the simplicity of the original Nativity is to be stressed, with Jesus born to Mary and Joseph in a cave, laid in a feeding manger, then perhaps they should have cast a Mary who had not just had her nails done. There they were, as Mary was holding the Christ child, each nail impeccable - and painted. And their garments? Perfectly clean, even looking like they'd just been ironed.\n\nThird, don't direct so that we can see the direction. Head turns, puzzled looks, earnest looks . . . I shouldn't be hearing in my head the director's exact stage directions. \"OK, look right at him then turn away.\"\n\nFourth, this was not about Saving Christmas. This was about explaining our modern celebration of it - it's already been saved, judging from the frequent references to it being celebrated the world over.\n\nI liked Noah. I liked Narnia. I like the Hobbit movies.\n\nI did not like this one."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ryan_19932",
        "review_rating": "1",
        "review_title": "Absolutely deserving of the worst rating on this website",
        "review_detailed_main": "I never in my life thought a movie would be deserving of a rating a full point lower than \"Santa Claus Conquers the Martians.\" Call it a Christmas miracle.\n\nThere are movies that are boring, there are movies that are factually incorrect, and there are movies that exist solely to pander to a specific audience. This movie is deserving of recognition for, incredibly, setting records in all of these categories.\n\nOnly an amazingly uneducated person who has expended a large amount of effort sticking their head in the sand for a large portion of their existence could possibly rate this movie in the 2-4 range. Anyone above that is simply bearing false witness (against the Bible's commands, by the way) at the request of Cameron himself."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "h_a_eriksson",
        "review_rating": "",
        "review_title": "Don't let your children watch this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "alan-52796",
        "review_rating": "8",
        "review_title": "Lightheaded but a little slow",
        "review_detailed_main": "Agree that Christmas is what we make it. God knows our heart and intent. Symbolism and traditions can get lost in translation. Setting some standards on the reason why we celebrate Christmas centered on Christ. Interesting spin on some of the common Christmas decorations. This film is targeted for Bible believing Christians that are being pelted with negativity and shamed by beliefs that Christmas traditions are all steeped in paganism. It is pretty slow and loosely put together. I can understand the reasons for others low ratings. Thought provoking for me. I will continue to read on some of the details shared in the film."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "texasballoonman-33575",
        "review_rating": "7",
        "review_title": "There are a lot of misguided people out there.",
        "review_detailed_main": "First of all, it's horrible that this movie has 230+ votes in the Parent's Guide for extreme sex, violence, language, alcohol, etc. When there is only mild violence in one part and none of anything else. It's amazing to what extremes people will go to to trash someone they don't like.\n\nSecondly, Kirk Cameron is cheesy. Yes. He created a low budget film to help spread a message he believes in for Christmas. No, not all of what he says is historically accurate. Though, a lot of it is and he makes some good symbolic connections that we often miss when we read the words of the Bible.\n\nIf you're a Christian and can't see past the production value of this movie you're missing the the forest for the trees.\n\nWe watch this movie every year with our kids. Yes, the production sucks. That's why I only rated it a 7. But, it opens up some fantastic dialogue and questions. Even, questions around the ridiculousness of it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "walkingmind3",
        "review_rating": "1",
        "review_title": "Merry Kirkmas",
        "review_detailed_main": "Kirk, you set new standards for just how low the bar can be. I don't know what genre this movie would fit int but it somehow is humorous and terrifying at the same time. I'm not sure if it was satire or you really believe in your own bu11sh*t. The message of this movie was so forced and there were more logical fallacies than I could juggle with. I almost recommend others to watch it because the entirety of FAIL this film contains is too much to believe. The record score of 1.5 stars should tell you something, Mr. Cameron. All hope isn't lost though, you may make a 1 star film that would make this one look better. Having less arbitrary music, better acting, and improved cinematography over all might be a good start."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "marty_comroe",
        "review_rating": "1",
        "review_title": "More Plot in this review than in the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jerichoJMX28",
        "review_rating": "1",
        "review_title": "Awful X1000",
        "review_detailed_main": "I never thought a movie could be as bad as Battlefield Earth, until this was released.The movie starts of literally with no plot and from there it is just Kirk and his \"brother\" Christian talking in a car. Kirk, you have not saved Christmas, you have ruined it just like you did film. What you tried to do is make everyone follow what you think Christmas is all about. Literally, this man cherry picks the Bible and creates his own version of the story. You know it amazes me how Kirk finds a\"good way\" to say \"materialism is right\". How does he go from making such a great movie like \"Fireproof\" to this???? I am sorry as a Christian, but it was just so bad. Again, Please if you know what's good for you, don't watch this movie, it is that bad."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "fb-162-418207",
        "review_rating": "1",
        "review_title": "Kirk Cameron isn't \"saving Christmas\" he's desecrating it",
        "review_detailed_main": "What's wrong with this movie? There's not enough time or space to cover all of it, so I'll just share the main reasons why anyone who loves Jesus, His Word and His people should or would never watch this mockery of Christmas.\n\n\"Saving Christmas\" is in direct violation of Romans 14:5-6 and 22-23, twists Scripture, reconstructs history and encourages gluttony.\n\nThere's nothing in this film that is \"wholesome\" and good for anyone, believer or non-believer.\n\nLet's save others from Kirk and crew's version of Christ's first coming and celebrate (if your conscience allows) with reverence, awestruck wonder and with the true and great joy that envelopes all who are humbled by and grateful for God's most amazing Gift--Jesus Christ, the one and only Son of God.\n\nhttp://www.sunnyshell.org/2014/10/kirk-camerons-saving-christmas.html"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "fsnami",
        "review_rating": "1",
        "review_title": "Yikes!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jeff-1987",
        "review_rating": "1",
        "review_title": "Jesus Clearly Hates Kirk Cameron",
        "review_detailed_main": "In this movie, Kirk Cameron shows us that the best way to get get the world to hate you is to judge and hate people who are different from you. Like Kirk Cameron, the key is to make sure you let everyone know that your judgmental and hateful behavior comes from Jesus and the Bible. Kirk doesn't judge and hate because that's who he is as a person. No. That is not why. Kirk judges and hates other people because the Bible and Jesus told him that he could behave that way. Where has the old Kirk Cameron of old gone? We all want to know. What made you so cray cray? Why are you so angry at the gays? Why do you hate other religions so much? Why did you ruin your sister, Candace, with your terrible ideas and nutso religious rantings? Oh, dearest Kirk, Bless Your Heart."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kennycook",
        "review_rating": "1",
        "review_title": "Spoiler Alert... It was awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "phaylen",
        "review_rating": "1",
        "review_title": "A complete waste of time",
        "review_detailed_main": "I love a really strong, beautiful or funny film that lets me, as a Christian, not be embarrassed about my faith. Saving Christmas had me wanting to climb into a hole. From beginning to end, it plays like one of those late night infomercials where the host is far to excited to be human. This film is nothing but a vanity vehicle for Kirk Cameron, it's self congratulatory and he comes off like a 12 year old locked in a toy store over night. His performance is a wreck, his exaggerated enthusiasm is cringe-worthy and at any minute you expect him to giggle and shout \"Hey Ma! I'm making my own movie.\" This is less a movie about Christmas, Jesus, or anything else as much as it is about Kirk Cameron begging you to look at him as he twirls."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Illinoisguy1",
        "review_rating": "",
        "review_title": "Surpasses Santa Clause Conquers the Martians as the worst Christmas movie ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "tjboiclark",
        "review_rating": "10",
        "review_title": "This is what christmas is about",
        "review_detailed_main": "Before watching this film, i was depressed, lost and hopeless but then this classic came up, in desperation to find something i watched and was not disappointed, the last time i saw a rivalry like this in films was when Thanos fought the avengers, absolute box office classic, if your marriage is in jeopardy, youve lost your job basically if your life is in the gutter watch this film and it will all change, This ranks above Avatar, Any Avengers film and is the nickelback of the industry. My parents marriage was saved by this, Jurassic Park is the only film close to this film, thank you to the creators."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "abdiver",
        "review_rating": "7",
        "review_title": "Educational Movie - Made For TV Quality",
        "review_detailed_main": "Well we saw the movie. It wasn't what I expected. I thought it was going to be a regular movie. Instead, it was an educational movie; he gave you different reasons, ideas and ways to think about the Christmas of today. He also discussed how the different factions would like you to think about Christmas; it's all Pagan, there's nothing about Christ left in it, why the tree, why the 25th of December, etc., and how to keep it based on faith, etc. Not bad. Internet Haters will hate on this but this movie isn't for the regular movie public, it's for believers and kids. I do agree that the poster is misleading; if you judge the movie by the poster you would think that it's a comedy - family - faith based movie. It's not, it's an educational, faith based movie, with a few laugh, but it's not a scripted comedy in the least. Run time was short as well which was good. Pretty tight and to the point."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "sic3",
        "review_rating": "1",
        "review_title": "Wow",
        "review_detailed_main": "After watching this movie, I may have to gouge my eyeballs out of my head in an attempt to erase the inane images seared into my retinas. Alas, it won't help. Why can't I give this a zero score? A score of 1 is infinitely higher than zero, and it frankly doesn't deserve a 1. A more redeeming film could have been made simply by filming a humpback whale attempting to mate with a Russian submarine, or perhaps watching howler monkeys preen and consume the gnats out of each other's hairy backs. But no . . . I was instead subjected to this sermon pontificating about how society has distorted the true meaning of Christmas (well, duh!) but yet after watching this, I found the thought of selfish consumerism to be rather uplifting. Now that is a Christmas miracle!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "brickmeyer",
        "review_rating": "1",
        "review_title": "How wretchedly horrible and insulting",
        "review_detailed_main": "This has to be one of the most insulting and wretched movies of all time. It doesn't even look like anyone bothered to edit it competently, much less write a decent script.\n\nDon't bother with this unless you need to educate yourself on the latest crap out of Kirk Cameron's pie hole.\n\nJust total garbage. I'd personally like to know what exactly happened to this kid back in the 90s to cause this mess.\n\nPlease. If you see this film then give it a review here. People need to be warned fairly about the disgusting nature of it as well as the incompetent work done in it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "sarah_del_lovely",
        "review_rating": "1",
        "review_title": "Worse than Ebola, Aids, The Black Plague, 9/11 and Bucky Larson combined.",
        "review_detailed_main": "Prior to viewing this film I was a devout Christian and Pastor. However this film broke my spirit and has caused me to not only reject my faith in God but in humanity all together.\n\nEach scene is worse than the last as Kirk Cameron uses the first portion of the film gathering wood, nails and a microphone to construct what will be int he second half, The worlds largest soap box.\n\nAs a former pastor I once sat for a 5 hour sermon and still think this film is more preaching than that.\n\nWhen the film ended two thoughts crossed my mind, One was the strangely absent 'That's All Folks\" Looney Toones ending and the second was a written apology and or refund of my money.\n\nDon't watch this film, ever, don't subject your family, friends or even stray animals to this picture.\n\nKirk may be trying to silence the critics but the reality is this movie is so horrid so void of content and character that it may induce suicide in the depressed.\n\nIn summation a 0 ratings needs to exist on IMDb because giving this long winded rambling non non sequitur a 1 is giving it too many stars."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "zebratigre",
        "review_rating": "1",
        "review_title": "This Is Too Bad To Be Funny",
        "review_detailed_main": "Anyone who has seen any of Kirk Cameron's previous pseudo-films, which generally consist of a sort of Christian apologetic aimed at the grammar school crowd, may think that they know what to expect with this latest offering, and they would be right. Here is Kirk with his usual mugging and winks to the camera as he leads his audience through a tangled and woefully inaccurate lecture on the mythical \"War on Christmas\". It is just plain awful. I forced myself to watch until the end and it wasn't worth it. It is a really pathetic attempt by a pathetic little man to grab a little cash riding on the coattails of Bill O'Reilly and Fox News. I was hoping at least it would be stupid enough to be funny, but it was just pedantic, dull and annoying. Miss this one and see a real movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ReverendSpaceman",
        "review_rating": "1",
        "review_title": "This is awful, but the kind of awful you have to see",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "charleerae",
        "review_rating": "1",
        "review_title": "I almost made the biggest mistake of my life...",
        "review_detailed_main": "I almost watched this movie. Sadly, I saw the trailer which was enough for me to stare blankly at the screen for a full 5 minutes after it ended, wondering to myself why no one had come on screen and taken Cameron away to a \"special\" hospital for a little while. I know I shouldn't have expected this film to be a light hearted Christmas cozy like you would see on the Hallmark channel given that Kirk is a raging delusional nut bag, but I didn't quite expect this. Based on the little I saw (again, I got all this from the trailer!), this was more of a deranged sermon given by someone who doesn't really know what they're talking about and just decides to wing it and make things up as they go along hoping that you are gullible enough to become one of his followers. If the trailer alone looks like some sort of cult introduction into the land of the stupid, I can only imagine what the movie is like."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Rastifan",
        "review_rating": "1",
        "review_title": "Transparent drivel",
        "review_detailed_main": "This is nothing more than a poorly hidden attempt of Cameron to do some preaching and to his fellow Christians by the looks if it. And he does so with the total lack of historical and factual knowledge he is so well known for. This disaster is a mess from the sound, cam job to the post editing if any was done at all. I won't even mention the acting because there was none. The logic behind his argument was best illustrated by Penny Walker; Arizona Republic! \"How do you prove a horse is an animal? Because I like Sweden. That's the style of absurd logic that happens in \"Kirk Cameron's Saving Christmas\".\n\nI turned the damn thing off half way. I simply couldn't stomach any more of his ramblings. Given Cameron's track record, I knew it was going to be bad, but thus he reached a new low on his decent into obscurity. I spent some time thinking of something positive to say about this laughable dung pile, and I came up with one thing. It didn't have Ray Comfort in it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jprizzotto",
        "review_rating": "",
        "review_title": "Horrible Horrible Horrible and Horrible on all ways possible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "bennettj-32015",
        "review_rating": "8",
        "review_title": "1 star reviews are trolls.",
        "review_detailed_main": "Kirk Camerons Saving Christmas Is Good Entertainment, But people seem to have taken the movie in the wrong way. The movie was supposed to be informative instead of having a plot which people think is the only way a good movie is created. The movies camera also Is a popular subject for reviewer's to talk about, the camera was supposed to be in an almost home video style look. Don't look at the 1 star reviews because most of them don't know what they are talking about. Good light hearted movie though"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "bradtx-56247",
        "review_rating": "7",
        "review_title": "Attitude is everything",
        "review_detailed_main": "A great reminder of the classic \"attitude is everything\", and seeing all things in alignment with our faith is the reason of the season. And ... a number of incredible symbolic parallels that God the Father arranged, at the birth of Jesus and His death and resurrection."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "asddarkness",
        "review_rating": "1",
        "review_title": "To call this movies cliché is an insult to the word cliché.",
        "review_detailed_main": "You know I am not a religious man, yet I like most Christmas and even religious movies but this is the worst out of the horrifically bad 2014 lot. God's not dead, Noah, Its a matter of faith no gems in the bunch. No Ben-Hur but this out does them all in how bad it is. Two thirds plus of this movie is not only not uplifting (as I feel a Christmas should be) but it is downright depressing. It is a lot of talk about how this guy is so sad that Christmas is not hyper religious, \"Christian\" the man in the film did something I thought impossible. He made Christmas sad, he made my favorite day of the year a sad pathetic pity party in which only your own wishes matter. Here is to a better 2015 for Christians, and I say that as an atheist, because damn this year was harsh."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "loves_secret_domain",
        "review_rating": "1",
        "review_title": "Terrible in the worst way imaginable",
        "review_detailed_main": "Most if not all Christian holiday traditions are in fact Pagan in origin and contrary to popular belief Christmas was in fact not Christ's birthday. The bible even confirms these facts yet Christians blindly believe that Dec. 25th is Jesus's birthday and no matter what proof is given to support this fact just the mere suggestion to this reality will label you an atheist at best or sacrilegious at worst.\n\nI did in fact watch this movie. The time spent doing so, I will never get back. Disregarding my poor judgment in watching this movie I will give a few observations regarding how I felt about what I saw with these burning orbs still scarred and traumatized at this very minute.\n\nNo spoilers given. The movie opens with a Kirk Cameron monologue followed by a sad attempt at a James Earl Jones like narration on the history of Christianity and Christmas. Although I did enjoy the ska interpretation of Christmas music in the beginning sadly it all went down hill from there. The production value sound and camera-work was top notch and reflected highly on the skill of the crew in Hollywood who work hard everyday with little to no appreciation for their troubles as in most cases the only people recognized are the Director and Actors involved. The continued use of narration by Kirk Cameron interlaced by his own opinions on the matters presented begin to wear thin on the viewer in such a way as to become annoying.\n\nIt was a difficult road to continue to watch this movie to its conclusion. I began to see and think about the perfect means of torturing enemy combatants by forcing them to watch this film on repeat. It was a chore to scrub the feeling from my mind that I was in fact being tortured or perhaps hated myself for purposely assaulting my senses with this pure propaganda piece. It was highly predictable, highly annoying, and the continued forceful narration by Kirk Cameron drove rusted railroad spikes into my ears like a Toolbox Murders horror movie.\n\nI won't spoil the plot as there was none to spoil. If you value your time, your sanity and you like yourself perhaps you shouldn't be so unkind to assault your eyes and ears with this predictable, over narrated, imitation docudrama.\n\nAs a real Christian who does not follow the Pope, a Church, idolize any single person famous or infamous, I only follow my heart, my convictions, my love for humanity, my hope for peace and happiness for all mankind.\n\nIf I could rate this movie .01/10 I would, and after watching this drivel I would wish that IMDb would allow us the option to rate 0/10."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Orion80202",
        "review_rating": "1",
        "review_title": "Ho Ho No!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kvnsml",
        "review_rating": "1",
        "review_title": "Kirk unleashes another flaming trash heap upon humanity.",
        "review_detailed_main": "Kirk Cameron is a moronic, mentally ill nutcase who also makes some of the worst movies known to mankind. Movies like Saving Christmas, which is so bad it actually make cancer look good."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "snlash",
        "review_rating": "1",
        "review_title": "Kirk Cameron - Hero in the 80s, Pathetic at Best Now",
        "review_detailed_main": "This movie should have never been made, it's a farce at best and an insult to the viewer's intelligence at best. I used to admire Kirk Cameron when I was growing up in the 1980s, he was a cute star then. It is so sad to see that he is now a fanatical, bible thumping, proselytizing has-been. I'm sure if you are also a fanatical extremist Christian, this movie will surely appeal to you, and you can share in Cameron's sad, lonely little world of fanaticism. However, if you are a non-extremist Christian, or anyone else in the world, you will find this movie to be offensive in at least one or more ways.\n\nThis movie surely belongs at the bottom of the bottom 100 list. Mr. Cameron, please retire."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kamamer",
        "review_rating": "1",
        "review_title": "Cameron isn't so much saving Christmas as he's saving the economy for his pay masters",
        "review_detailed_main": "Ultimately if Christmas returned to its more simple religious roots (\"reason for the season\"), the vast economic pump that enriches, oh, Koch Industries and everyone else who keeps the religious right in power would be gone and they would, gasp, lose vast sums of money. Even if Christmas became more of an Easter level of commercialism, the effects on the economy would be ruinous. One wonders why Cameron has made such a film when most Christians scream about the commercialism (which technically is keeping most of them in jobs). I suppose Cameron isn't so much saving Christmas as he's saving the economy for his pay masters."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "matt29680",
        "review_rating": "1",
        "review_title": "Must Not See",
        "review_detailed_main": "This is the worst holiday movie ever made. Don't go see this movie, don't buy it. forget it happened, i try so hard every day to forget i wasted my life watching this. instead of viewing this movie, turn of your TV and spend time with your family. Get to know them better instead of watching 2 guys talk in a car for 20 minuets. just dot go,just dot go. just dot go ,just dot go . just dot go ,just dot go. why would anyone want to sit and watch this. go watch Rosewater way better film.what every you do don't go and see this crappy film. you will hate it i hated it. Had \"Saving Christmas\" run any longer, i wold of died."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Wizardling",
        "review_rating": "1",
        "review_title": "Excreatable crap and false propaganda.",
        "review_detailed_main": "Kirk Cameron tries to 'revise' history to make Christmas have always been about Christianity. Sadly any forth grader with access to a library, or even just Google, can discover this isn't true.\n\nCameron uses terrible acting and transparently obvious preachy propaganda to make what surely must be the most banal Christian movie ever.\n\nI'd rather have my internal organs liquefied by flesh eating viruses, than have to watch another second of this crap.\n\nIt it was JUST boring as hell, or JUST transparent propaganda, or JUST full of 'lies that are OK to tell because it's in service of my religion', then would be a bad, yet forgettable religious infomercial... I mean movie. But it's all that and worse, so I'm left wishing there was a way to edit out my memory of this abysmal turd of a movie.\n\nUgggh."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "8D",
        "review_rating": "",
        "review_title": "Ughhh.... Well Worth Avoiding This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "j_walking1516",
        "review_rating": "10",
        "review_title": "Honestly charming and enjoyable",
        "review_detailed_main": "It wasn't perfect but people are overreacting. I gave a 10/10 to counter to obnoxious 1/10 edgelords. It was cute and simple and charming. I'm not even a Christian but I enjoyed the central message of not being a jerk around the holidays. It was an enjoyable film and had some fun trivia and lore from their faith and overall was pleasantly uplifting. Don't be that guy and stop making everyone miserable"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "tamlentoo",
        "review_rating": "7",
        "review_title": "Definitely learned something",
        "review_detailed_main": "Obviously this has a low budget but I learned a lot from it & how all my beloved Christmas decor can remind me of the true Christmas story."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "eligiussantos",
        "review_rating": "1",
        "review_title": "Heresy",
        "review_detailed_main": "Kirk Cameron is a heretic! This is full of half truths and bald face lies. Typical of a greedy materialistic prosperity charlatan."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "archibaldpitzman",
        "review_rating": "1",
        "review_title": "Just don't...please!",
        "review_detailed_main": "This excuse for a \"movie\" is nothing more than a Christian persecution complex disguised as a preachy family film. I couldn't make it all the way through. I have no idea how so many Christians think that they're under attack in a country that's mostly Christian. If you think Christmas is too commercial, then celebrate it differently! I'm not going to act as though I'm not disgusted at people being trampled to death under crazed consumers turned to a herd of farm animals in order to score a deal on the new iWhatever go buy for a child too young to appreciate it, but guess what? You don't have to participate. Also, why is Happy Holidays so offensive? News flash, this country is a melting pot and people from all over the world come here with different beliefs. I'm sure EVERYONE who knows you're Christian will wish you a Merry Christmas, so why not be a little more cultured and inclusive so the rest of the world will stop laughing at us for a little while?"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "SpotMonkee",
        "review_rating": "1",
        "review_title": "A Fascinating Specimen of Awfulness",
        "review_detailed_main": "Once in a great while, we as a people are privileged to view a creative art that, is so completely terrible, that it unites our troubled world against it, so that in one brief, glorious moment, we are in agreement. And so is one Kirk Cameron's Saving Christmas a \"film\" that was \"written\" and \"directed\" by former Blink-182 music video director Darren Doane, \"starring\" Kirk Cameron as, well, as himself, and his family and friends during his annual Christmas party. At least I suspect that's how this movie was made, Cameron was probably throwing a Christmas party and realized he could make a quick buck, got some cameras, and through this together in under an hour. There is little story to speak of, beyond Cameron preaching to the audience that rampant materialism in the holiday season is OKAY by Jesus was a corporeal being and therefore, material. Intercut within this overlong audience fillbuster are recreations of all the wonderful Christmas imagery we have come to know and love, like the soldiers of King Herod murdering hundreds of babies, and a terrifying-looking Saint Nicholas beating a man to death because he didn't agree with him. Cameron goes to great lengths to explain away holiday traditions like a decorated tree and gifts, but the audience will be far too distracted by the weird bunch-ups in Doane's Christmas sweater, and his weird, pause-filled delivery that will make you think he's some kind of serial killer. And of course, are film ends on a completely random hip-hop dance number that exists only so that Cameron can show us that yes, he can do the worm. This film we leave you scalping yourself because you're scratching your head in bewilderment, trying to comprehend what you've just seen. Even the likes of David Lynch would look at that movie and say it's too much. A 30 minute sermon stretched out over 80 minutes, this film should only be viewed if you want to know Scrooge's reasons for hating Christmas so much."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "carguynumberone-98016",
        "review_rating": "1",
        "review_title": "This was extremely torturous!",
        "review_detailed_main": "I lost a bet and my punishment was to sit through this entire movie. At first I laughed considering the creativity my friends have pulled out of thin air in the past. I love all genre of movie and was highly suspicious. As soon as I heard the name Kirk Cameron I knew it would be dominated by his opinions and personal beliefs, but then again it was supposed to be a comedy. It turned out I had every right to be worried. Getting through this entire movie was extremely cruel and unusual punishment. I have watched some \"bad\" movies in the past, extremely low budget b rated with no named actors that I look back on and laugh at. Those movies all look great compared to this. This movie is simply \"pathetic!\" Do yourself a favor, if you haven't yet put yourself through this save your brain cells and watch anything but this movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "roger-70721",
        "review_rating": "1",
        "review_title": "Makes the \"Emoji Movie\" look good.",
        "review_detailed_main": "If I wanted to see a movie with two people in a car for most of the movie I'd watch Stephen King's \"Cujo\"."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mbcdadb",
        "review_rating": "1",
        "review_title": "This is an awful movie",
        "review_detailed_main": "This is a vehicle for Cameron to demonstrate his intellectual superiority without anyone challenging him. The other actors do not question anything he says no matter how extremely stupid it may be. It was painful to watch but at least the idiots that try and say this is a good movie can't accuse me of not seeing it.\n\nCameron has no talent and continues to spew this insane notion that Christianity is under attack. You are a moron Kirk Cameron.\n\nBelieve what you want but stop wasting money that could be used for much better purposes like feeding the hungry, or even better, buying hat for dogs, because that would be a much better use of the money.\n\nI'd say more about the movie but there is no point. It is boring and stupid with disconnected sub-plots about work memo.\n\nBad acting, bad dancing, just bad, bad, bad."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Im-not-all-here-myself",
        "review_rating": "1",
        "review_title": "The \"Non-War\" on Christmas",
        "review_detailed_main": "By now, everyone has become familiar with Kirk Cameron's delusional and self indulgent attitudes about evangelical Christianity. Most probably also realize that his ideas and opinions are simply wrong. This movie is simply one of his more self indulgent tirades about the supposed removal of Christian themes at Christmas time and how we are all going to Hell. Or something similar. His complete lack of accuracy concerning the actual beginnings of the Christmas holiday not only make the movie a laughable joke, but also showcase his ignorance, therefore ALL Christian's ignorance (He seems to like taking credit for speaking for all Christians) A 10 minute search on the internet will inform even the most staunch Catholic that EVERY aspect of Christmas including the iconic Christmas tree, gift-giving, yule logs, etc, were all adapted by early Christian leaders from PAGAN sources! Here's another quick fact; Jesus wasn't born in December! He was probably born sometime during the Summer months. He is also apparently unaware that when the Puritans settled in America, they OUTLAWED all Christmas celebrations for almost 80 years! We are also treated to more whining about the removal of manger displays, etc from public areas. Yet not a single display on a truly PUBLIC area has been forced to be be removed by public outcry (at least none that I have heard about) Instead, most manger displays that have been removed were on State or Federal property! And yes, THIS IS a violation of the \"Separation of Church & State\" laws. All in all, the movie is a complete mess! Loaded with self indulgent garbage, this waste of film is also horribly written and directed with acting so far below par as to make a grade school play seems like Shakespeare in the Round. Kirk needs to keep audiences amused with his fire breathing dragons and keep his nose out of major film-making."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Zebb67",
        "review_rating": "1",
        "review_title": "Ho Ho Horrible!",
        "review_detailed_main": "How does a co-star on an 80s sitcom get to be such a loud mouth in the fundamentalist Christian movement? Audacity, I guess. Kirk, there is no war on Christmas -- only people making money off of other people's persecution complexes and desire to play the victim. This film is good for a few laughs, until you realize some people actually take this stuff seriously. Looks like it was made by a high school audio video club and it consists of nothing but Fox News type statements about the demonic forces of secularism trying to destroy Christmas (which must be a surprise to those who continue to receive Christmas presents each year and the billions of adds on TV for Christmas bargains). Christians should be more concerned about starving children than whether someone says Happy Holidays instead of Merry Christmas."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jasonaspears",
        "review_rating": "10",
        "review_title": "Fun and informative movie",
        "review_detailed_main": "Another well done piece by Darren Doane. A fun way to to hear about the origins of Christmas from a Christian perspective. Sit back and enjoy with the whole family."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "danrober",
        "review_rating": "7",
        "review_title": "More of a Christian Documentary",
        "review_detailed_main": "Well, I agree the acting was not great. Kirk Cameron was better compared to the others. This movie asks us to enjoy and celebrate Christmas. I do not think that is a bad thing. The movie could have been much better if it removed the 'conspiracy scene' and 'the over-excitement dance scene'. It could have added more elements on why it is important to celebrate Christmas. It certainly is not the worst movie out there. 1.4 is not the rating this movie required. 4-5 would be apt but since this movie is soo underrated, I am going to give it a 7.\n\nKids may like this movie. I do not think that it is as bad as people say it is. More people with open minds should watch and decide for themselves."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "louie-bergquist",
        "review_rating": "1",
        "review_title": "Cheap, Condescending Exploitation Masquerading As Family-Friendly Fare",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ironhorse_iv",
        "review_rating": "1",
        "review_title": "I'm sorry, but this movie isn't worth saving. Just throw this XMAS film, away! It's not that good of a film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "steinmto-1",
        "review_rating": "1",
        "review_title": "I am a Christian and this movie was horrible.",
        "review_detailed_main": "I am a Christian and this movie was horrible. Kirk is not va good director or actor."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "julesofgondor",
        "review_rating": "1",
        "review_title": "Never again.",
        "review_detailed_main": "A relative of mine insisted that I watch this movie with them a year or two ago, so I did.\n\nGiven the choice between re-watching this movie, or dousing my posterior in the spiciest hot sauce imaginable, I'd probably re-watch the movie. Probably. I'd have to think about it for a few minutes. Does the pain of chili peppers coming in contact with my sphincter outweigh the pain of sitting through the entire duration of Kirk Cameron's Saving Christmas? That's a question I hope no one ever has to answer."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "bbpaya-178-792227",
        "review_rating": "1",
        "review_title": "Cautionary Tale",
        "review_detailed_main": "Aside from the fact that Mr. Cameron is the dean of the Tool Academy; this is so unwatchable that if Kubric was alive, he would replace all the ultra-violent movies in A Clockwork Orange with this turd and he wouldn't even have to induce a gag reflex . . . that much is conveniently built-in. Plot? Acting? This disaster leaves so much to be desired that he should pray for forgiveness for the rest of his days. I do not think Jesus himself would be able to forgive this offensive attempt at art. Is it not enough to embarrass yourself on CNN and YouTube with the bible thumping? He has the temerity to ask people to spend their hard earned money, and precious time enduring this drivel. The rock is ready for you when you're ready to crawl back under it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "gjleger",
        "review_rating": "1",
        "review_title": "Christmas ? No...",
        "review_detailed_main": "This movie had simply nothing to do with Christmas.\n\nThe whole point of the movie was to preach... nothing more.\n\nThe acting was just that... acting... no sincerity at all. The point of the movie was to attempt to convince folks the true meaning of Christmas without showing sincerity what so ever.\n\nThe actors were just simply not believable. It simply showed how unconvinced they were about their message.\n\nThey were reading a script of the message they had to send. No true emotion was shown in the delivery of their message, making them seem like frauds."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "woodruffw",
        "review_rating": "1",
        "review_title": "Terrible Film, Even Worse Message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Save Yourself, Instead!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Lombardi65",
        "review_rating": "8",
        "review_title": "Funny and Faith based movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kassielmcwhorter",
        "review_rating": "7",
        "review_title": "*GASP* It is not the worst movie ever!",
        "review_detailed_main": "Well, I finally went to see the movie. There were actually good crowd. Everyone is setting this out to be a horrible movie. While I admit it is not the best movie I have ever seen it is by far NOT the worst. It was entertaining. I even laughed a little (But not as much as the elderly couple beside me). There were some highlights and other spots that could have better potential. But it served its point. I left pondering the content. What is Christmas about? While it probably won't put 'Christ back in Christmas' world wide it can cause individuals to have a change of heart. Why shouldn't everyone Christmas with a major dance party?"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "benjaminweber",
        "review_rating": "1",
        "review_title": "Someone spiked the hot chocolate",
        "review_detailed_main": "This film is completely off-the-wall crazy. It is one of those rare films that has the power to descend to the depths of insanity, dragging its helpless audience along with it, until WHAM! The phrase \"Aspergers in your burgers\" is uttered by a man holding a cup of coffee in front of his mouth. The madness is universally expressed by all characters present, leading to an unsettling conclusion: this is not about Jesus at all, but a tale of a party in which the hot chocolate somehow becomes contaminated with marijuana. Suddenly the strange giggling in the car, the hallucinogenic Santa segment and the random conspiracy theory scene with two minor characters makes sense when viewed this way. It makes more sense than the idea someone thought this movie was a good idea, anyway!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "3",
        "review_title": "It's not the worst movie I've seen, but it's a bad movie",
        "review_detailed_main": "Saving Christmas would be nothing more than another bad movie, but this one tries to touch on the subject of Christianity related to Christmas and does it pretty badly. It's surprising that a man of faith like Kirk Cameron would have done something like this, since that must surely make him a lousy evangelist. What is salvageable is the soundtrack and some of the scenes that Kirk is narrating since they are worthy of a music video. The story is too short and the conflict is resolved at once, but there is a lot of filler and a lot of slow motion so that the film lasts longer. It pretends to be a comedy, but it's not funny. It also has many historical errors that are difficult to take seriously and it is not understood if Kirk wanted to give a metaphorical meaning to the Christmas things that he considers Christian. It's not the worst movie I've seen, but it's a bad movie and that's why I give it a 3/10."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "editor-178-839216",
        "review_rating": "1",
        "review_title": "Serious Piece of Crap",
        "review_detailed_main": "Why? Why? WHY???? This is about 70 minutes of nothing but Kurt Cameron telling everyone how they're doing Christmas wrong. I've got news for you, Kurt. Christmas is about celebrating Jesus, and everyone celebrates in a different way. Not only that, but when did you stop even trying to act??? Please... go back to sitcoms, become a preacher, become a writer - just don't do ALL of those things, because multi- tasking is not your forte. There are some really good reviews of this movie on here, and that just reminds me of why some people just shouldn't be allowed near a keyboard - ignorance, brainwashing, and just plain dumb. Don't waste your time with this film. If you want a nice, wholesome - HONEST movie for the holidays, rent the 10 Commandments or Ben Hur."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jlburkeyjr",
        "review_rating": "1",
        "review_title": "horrible, just horrible even Jesus cries in shame at this",
        "review_detailed_main": "this movie is by far worse than anything I have ever imagined. Kirk turns this into an hour long lecture sprinkled with bits and pieces of bible stories. I've been to funerals with more plot than this steaming pile of crap. We get to see two guys talk about nothing for an hour and we get to pay for it! Nice job Kirk. This movie is a sermon, a bad one, that is nothing less than a rant about trying to redeem the holiday, which has never been Christian to begin with. I wish mr cameron would either read his bible (and see that christians are forbidden to decorate 'trees from the field') or at least recognize that his cult, er religion, has done nothing but steal other cultures ideas and make them their own. Nice guys. Save your money, if you want to 'save' Christmas, don't see this."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "A must avoid Christmas",
        "review_detailed_main": "Watched 'Saving Christmas' out of curiosity to see if it really was as bad as the universal panning, its ranking on the Bottom 100 and its Razzie wins and nominations in most categories made out. The film is not available in my country, but the full film can be found online for anyone to see just in case anybody is wondering how it came to be watched by me.\n\nFinally seeing 'Saving Christmas', it turned out it not only really is that terrible but is one of my most regretted film viewings. One where a very early bailing was strongly considered but generously stuck with it in order to be fair, never judge films without seeing the whole thing (wish that more people did that instead of bragging about walking out after twenty minutes or something similarly ridiculous). It is by far the worst film of 2014, an easy contender for the worst of the decade and is bottom 5 material.\n\nAnd Kirk Cameron's immature and condescending defence of 'Saving Christmas' and attacking those who hated it (note to Mr Cameron, you don't have to be an atheist or even religious to find 'Saving Christmas' a terrible film, speaking as someone who is neither but with not a biased against Christians bone in my body) is a perfect example of what is wrong with how people express their opinions on film, critics and film watchers today. People who have an inability to tell the difference between fact and opinion, resort to the \"I'm right and you're wrong\" cliché and have to insult others, bash critics and invent ridiculous and easily disproven conspiracy theories.\n\nBack to talking about 'Saving Christmas', the whole thing is hopelessly inept. It feels very slapped together with no rhyme or coherence, with amateurishly designed, written and acted biblical flashbacks, a lot of padding with scenes that go on forever (got tired of the scenes in the car fast, which saw lots of forced at best acting and gobbledegook that passes for dialogue), lots of repetition (like with the hot chocolate and the car conversations) and others having no reason for being there and Cameron's dubious generalisations (refuse to call them facts) and narration that come over as preachy, biased, self-absorbed sermonising standing out as especially bad. Oh and that ending dance sequence was an abomination in every sense, pacing, choreography, music, everything.\n\nIt even looks bad, with some of the most artificial production values one will find anywhere let alone a film, complete with pedestrian photography and disjointed editing. The music was instantly forgettable as soon as the film was finally over and as for the direction, what direction? There is no coherence to the whole thing, the pacing is all over the place (interminably dull mostly) and there has never been more non-existent direction of actors, even on films riffed on MST3K.\n\nWriting is appalling from heavy-handed, egotistical start to abominable finish. That for Cameron has already been discussed but there is nothing heart-warming, funny or insightful about 'Saving Christmas', nothing that makes one think hard or feel anything. For a festive occasion, one couldn't imagine and will never see again a more drearily portrayed Christmas, this actually felt like it was made by people who hated Christmas even more than Ebeneezer Scrooge did. One is just bored out of their mind and angry at their life being wasted on a film that has no engagement, is so poorly put together and made, is impossible to learn anything from or get emotionally invested in and talks at them. Am not easily preached at, but 'Saving Christmas' talked at and down to me.\n\nCameron's \"acting\" is extremely forced and patronising, pretty much like mugging, throughout and his huge ego bursts alive just as much on screen, in his material and how he delivered it, as it did when he attacked those who panned the film for far more legitimate reasons than he and the very small minority agreeing with him can ever give for finding any kind of value in the film. To me he is hypocritical as well as egotistical, due to that it is Christians that are more likely than anybody else to feel patronised to the most. The other cast members are not worth mentioning, don't even remember many, that's how much Cameron and his ego dominates.\n\nOverall, one of, and one of the biggest examples of, not many irredeemably awful films out there. Unless watching for curiosity's sake, this is a must avoid. 0/10 (an unheard of rating for me these days, have grown to hate giving them out, but 'Saving Christmas' is in the top 10 of the most deserving recipients of it). Bethany Cox"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "TheBillionthGuyNamedJack",
        "review_rating": "1",
        "review_title": "I'm a Christian, and I still think it's the worst.",
        "review_detailed_main": "This movie is not only unfunny, the beliefs and suggestions of these characters is extremely questionable. This frantic Christian flick movie tries to connect Christmas to everything in the universe while using desperate humor. The actors (besides Kirk) feel like they were kidnapped in the middle of the night and forced to read lines. Throughout the film, Kirk supports violent examples and has a generally weird idealism. Despite it's slow tone and plot, the world of Kirk Cameron's Saving Christmas is a frenzied religion obsessed dystopia."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Quinoa1984",
        "review_rating": "1",
        "review_title": "\"This cannot be what God wants.\" Right!",
        "review_detailed_main": "A question I kept thinking as I somehow went through Kirk Cameron's Saving Christmas was 'how is this even a movie?' In the interest of full disclosure I have to admit I didn't go into this expecting it to be very good. That may be a fault on my end, to enter into any movie to do that, but the hype I had heard about this thing - that it was among the craziest pieces of WTF put to screen in the past several years (if ever) - made me too curious to not avoid it. I think also the idea of, frankly, Christian nutter Kirk Cameron going on about the War on Christmas made me wonder if he would make it a screed against those who would denigrate the most sacred of holidays... well, rest assured, it's not that. It's so much wilder than anything you'd hear on FOX News by a pundit. It's a unique specimen in how NOT to make something with a camera and sound equipment and what I guess are sets and maybe some actors(?) and a would-be director-cum-actor-cum-writer. I mean, Jesus this movie...\n\nFirst of all, it's not really a movie, not in the way that we have anything close to compelling characters or dialog together. What we get following an introduction by Cameron (playing himself) where he sips his hot cocoa smugly and bemoans those who don't enjoy Christmas whole-heartedly (smugly in that way that he is constantly smiling and literally preaching to the camera, surrounded by a fireplace and tree and the accouterments of the holiday), is the story of 'Christian' (GET IT?) who seems to be the sad-sod at the holiday party - also Cameron's brother in law - who isn't in the spirit. He is actually depicted harshly, all in voice-over of course (because why show us things when you can TELL us, at length), as someone who looks down on the Christmas holiday and isn't into the 'spirit' of the season. Cut to a Christian sitting in his parked car in the drive-way, and Kirk gets into the passenger seat. This is where the \"meat\" of the movie takes place. Boy howdy.\n\nThis is a straw-man preach-fest, where Christian, after espousing actually (to me) *reasonable* thoughts about how the money and effort spent on putting up decorations and on presents and so on could be used to help feed the poor and do things that aren't part of actual teachings in the Bible as far as the trappings of the modern holiday goes. Here's where it gets weird: Cameron basically spends the rest of the movie, in really shoddy voice-over over \"scenes\" showing things like what the swaddling cloth the Baby Jesus was covered with and Christmas trees and Santa Claus actual mean and how they're \"REALLY\" connected to the Bible. In other words, it's all deep down justifying why things like the commercialization of the holiday, presents, hot f***ing chocolate, are fine in this time and age. And if the part about the swaddling cloth, and how he makes these connections that just are not there don't make you tear your hair out, the connection with Christmas trees to the *Christ on the Cross* will get you more.\n\nOne might say that at least Cameron isn't really *mean* with his statements here, and it's certainly not the usual war on Christmas screed. No, the one part you get the latter is in a really jarring and rather unnecessary scene (as if anything here IS necessary to begin with, but even in this context) where it cuts to a scene in the party between two characters - one the (I'm not kidding) token black guy, and the token, uh, conspiracy theorist - and the latter brings up things like Loose Change and Fox News and the war on Christmas like... are we supposed to see him as crazy or a joke or believe him? Aside from being ludicrous (in the best possible way) as this character goes through a monologue with a mug over his mouth so that everything can be ADR'd, it seems so muddled. Is this a joke?\n\nWhat the hell did I just watch? Even if I believed whatever crazy horse-pucky that Cameron spouted here - and to give you an idea of how far out this stuff is, Republican president candidate (and fan of grain-in-the-pyramids theory) Ben Carson gives an endorsement on the DVD cover - the production quality is barely above that of Birdemic. Many shots are just really bizarrely staged (the scene between the two token characters is framed in such a way I want to show it to film school students to see if they know it's correct or not, if they think the former, they're automatically flunking, period). Other times, like the 'recreations' of what Cameron is preaching about in the car, it looks like they didn't have enough money for things like other actors to play the parts - I can't be sure but it looks like Kirk was \"Bad\" Santa in a couple of key shots - and on sets that look like they filmed on a stage in a high school auditorium. Oh, and there's a hip-hop dance sequence that pads out the run-time for what is essentially a LECTURE by Cameron, padded by the token characters and Christian the Straw-Man, and funded by a fundamentalist university.\n\nIf you watch this and believe this stuff, I feel sorry for you. Go do your own research, see if you can challenge this guy on his claims. But even if everything he said was valid or had some credibility (and it doesn't), the quality of what went into this production makes it easily a contender for among the ten worst films of all time."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mandark77",
        "review_rating": "1",
        "review_title": "Worst. Movie. Ever.",
        "review_detailed_main": "Honestly I didn't watch it. I was going to then I seen a video of Kirk Cameron and some dude talking about how Evolution is fake because a banana fits in a hand. This made me realize I was into dudes because a dudes banana fits in my hand. Now I'm gay because if Kirk Cameron. Thanks Kirk.\n\nI guess I should watch it. But honestly Kirk seems like a complete psycho path. I understand he's one of those celebrities that cant find work so he found \"God\". It's just sad to see him taking advantage of people who believe in magic invisible sky monsters. SO watch it, don't watch it. I wont contribute my valuable time to such a sicko. But you can do what you like!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "nlathy-839-300677",
        "review_rating": "8",
        "review_title": "It's Christmas.Enjoy This Movie!",
        "review_detailed_main": "Worst film of the year? Kirk Cameron's personal disaster? Not to fall into Joe Biden's \"C'mon Man,\" yet it's no time to go Scrooge either. Uplifting story about importance of Christmas including Christian basis for holiday traditions. It clocks in at 70 minutes minus closing credits. No tedious epic to endure here. Those who think A Charlie Brown Christmas tells story better can watch double feature."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jre-5",
        "review_rating": "",
        "review_title": "Kirk is a great guy, but this film just isn't very good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "rcr1608",
        "review_rating": "7",
        "review_title": "Live and let live!",
        "review_detailed_main": "\"Live and let live\" comes to mind when I see all the 1-star reviews. I'm glad I'm not so nosy that I'd go on the internet and give 1-star reviews to a movie that is not even in my categories of movies I'd ever watch. I don't care about sports, but I don't go around ripping on the fact that sports exists, nor do I personally attack other people for liking sports. I saw the movie just to see what it was about and to see what they did with it. I've never researched Christmas so I can neither confirm nor deny any of the arguments. I don't know where the symbols came from. I choose to decorate by my own personal likes and dislikes and not other people's opinions. What I walked away from the movie feeling was, 'don't let the haters embitter you and take the joy out of your own personal celebration.' Keep the joy in your Christmas celebration, whether you 100% with zero doubts fully understand every single aspect or not. For those of you who believe and celebrate Christmas, Have a joyous Christmas! For those of you who don't believe and resent the existence of Christmas, why don't you go look up something on a topic that you like rather than stress yourself out by enraging yourself to the point of wanting to attack other people. Live and let live."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "dhamptongj",
        "review_rating": "1",
        "review_title": "Ummm...WTC?",
        "review_detailed_main": "I wanted to say WTF, but all I could think of was, \"What the Christ?\"\n\nYeah, maybe a step over the top considering I'm an atheist. So yeah, of course I wouldn't like this movie. To be honest, I only watched the trailer. Enough for me to give it one star. If there was an option to erase the movie from my memory and from the public domain completely, I would have taken that one.\n\nChristmas (really, the holidays in general), are not about Christ. This time of year is about giving and thanking. Yeah, we all say we love to give, but oh boy that new flat screen sure makes me a happy man. And the fact that people have to pull politics and religion into this time of year is disappointing.\n\nAnyway, this movie is not worth the time of the trailer. Heed my warning, and stop now! Just love one another (or so the saying goes), and enjoy this time of year! It's cold and miserable, but somewhat magical. Just wear protection."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "tyjenn902",
        "review_rating": "1",
        "review_title": "So ungodly awful that it at times becomes amazing",
        "review_detailed_main": "Sweet unholy Christ this was bad. Like, bad to almost a stupid degree. At times, I was transfixed to the screen simply out of disbelief of what I was watching. But in a way, I would actually recommend people to watch this movie. I mean, it definitely does reach the \"so bad it's good\" territory several times, and never seems to realize that it is indeed a bad movie (i.e. Sharknado, Birdemic 2). From strangely dated depictions of race to utterly confusing explanations of religion and holidays, this movie never lets up on the head-scratching levels of bizarre decisions. So like Troll 2 and The Room before it, director Darren Doane and producer/actor/egomaniac Kirk Cameron strike fool's gold with this aborted fetus of a film."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "nickybuttons",
        "review_rating": "1",
        "review_title": "\"Saving\" Christmas",
        "review_detailed_main": "I remember seeing this a little ways back and it was pretty much either boring or bad at all times. In summary its Kirk teaching Gordon Freeman to appreciate Christmas again. Sounds innocent enough, however honestly most of his reasons for not liking Christmas are kind of justified and Kirk's arguments for why he should just unconditionally love Christmas are pretty bad. On top of that Kirk is portrayed as an absolute good guy who cannot do wrong. I remember it feeling preachy and generally like the movie is trying to make me believe in its ideas. I don't use the word propaganda very often but it felt a little like it. Just don't see this one, its not worth the time. Its not even really the kind of bad you can sit down with friends and laugh at."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mirrishadow",
        "review_rating": "1",
        "review_title": "bad bad, really bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "thatonebigfellainschool",
        "review_rating": "1",
        "review_title": "Bottom of the Barrel",
        "review_detailed_main": "Every time Kirk opens his mouth, I just wanna see the big X from Family Feud over his face.\n\nDespite the fact that everything Cameron says is either inaccurate or just plain stupid, despite the fact that this movie looks like it was all shot and edited on someone's iPhone, despite the fact that Cameron decided to blame all the bad reviews on \"haters, pagans, and atheists\" even though there were plenty of Christians and/or religious folks trashing this movie, despite the fact that this movie is only 1h 19m long yet it feels like 7h 44m long.\n\nDespite all of that........No, I guess there's really nothing good to say about this.\n\nOne of the worst Christian movies ever, then again, I guess that's not saying much."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "BlackJack_B",
        "review_rating": "1",
        "review_title": "Razzie Award winning Christmas nonsense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "faustpd",
        "review_rating": "1",
        "review_title": "Mike Seaver is a Believer",
        "review_detailed_main": "I used to like Kirk Cameron as Mike Seaver. Ya know, from Growing Pains? I thought this movie would be as funny as Growing Pains. Apparently Kirk Cameron is a Born Again Christian now? That doesn't seem right. Him, Eddie and Boner were always up to no good on Growing Pains. And I don't think an actual Christian would've made fun of Carol like that. Remember how Leo DiCaprio got his start on Growing Pains? I wonder if they still talk. Remember the episodes where his brother Ben is into that blonde girl? She went on to play Penny Belding, Mr. Belding's daughter on Saved By the Bell. Anyway, I didn't much care for this movie. Kirk Cameron's character spent too much time talking about Jesus of Nazareth."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "What an awful way to start this year's Christmas season",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "crowes-18865",
        "review_rating": "10",
        "review_title": "Forever Changed The Meaning Of Christmas For Me",
        "review_detailed_main": "I was a life long non-believer before watching this wholesome family holiday gem but Kirk Cameron lit my path and filled a hole. I had reached a point where I felt all of the holiday specials were drowned in commercialism and materialism and then one day I sat down while this happened to be playing on a television in the ward I was staying in and I realized that there lives a true Christmas angel - Kirk Cameron who really cares about all of us and that we enjoy Christmas his way rather than our own misguided ways. Thank you Kirk for filling the hole and I hope you can do the same for everyone else out there floundering through Christmas the wrong way! Does anyone know if there is a Kirk Christmas tree topper for sale anywhere rather than the traditional angel because Kirk is my angel all the way!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Vinny37",
        "review_rating": "6",
        "review_title": "Full of good intention, it partly works",
        "review_detailed_main": "It's got some sad KJV throwbacks (\"only begotten\" / \"shine before men\") It ditches a stable for a cave - this adds to symbolism, though I suggest that Jesus' birth was in Joseph's parents' house. A song cited says: \"so be good for goodness' sake\" - the mercenary \"so\" should be contrastive \"but\", so I flinch at this lyric. At least no anti-Christian \"Away in the Manger\" reference. \"Eternal god taking on a material body\". I dislike polytheistic language - no god-type, thank you very much. Moreover, better to specify God the son as having become human. Santa Claus (Saint Nicholas (Sinterklaas)) is depicted as an angry (orthodox) bishop beating the hell out of the heretic Arius at the C4 Council of Nicea: poetic amplification from a medieval folk-tale of Bishop Nicholas trying to slap some sense into a follower of Arius. In reality, Nicea probably had more freedom of speech than the BBC, really wished to hear Arius and other ideas, and probably Bp. Nicholas wasn't there. An interesting take on Christmas trees as linking Genesis to Golgotha. Arguably the film drags a fair bit (keep going at least the first 5 minutes), but some good acting and good fun sustains it, plus its invitation to at least rethink what the Christmas event really meant and means, even if we don't buy Kirk's take. Particulars aside, Kirk's generalisation is valid: instead of knocking the accrued tinsel of Christmas, see how they can point to deeper reality, but don't go singing to Christmas trees. A good hip-hop number at the end."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "windwarrior-25742",
        "review_rating": "1",
        "review_title": "The Most Boring Movie I Have Ever Seen",
        "review_detailed_main": "Never before have I seen a movie this boring in my life. There's nothing interesting going on. All this film is is just Kirk being preachy about what Christmas is all about, uninteresting dialogue, and philosophies that drag on for too long.\n\nThe acting is garbage. Everyone is either annoying, bland, or even unintentionally hilarious.\n\nThere is not much effort into the production value as most of the movie takes place in either the car or the house.\n\nThe writing is also awful. Apparently, Christain is a jerk and he is ruining Christmas for everyone even though he never publicly said to anyone (aside from Kirk) that he hated Christmas. He just simply hid away from the party.\n\nOverall this film stands as one of the worst I have ever seen. I can only recommend this film to true masochists. Everyone else, stay away from this movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "alexandre-jouan",
        "review_rating": "1",
        "review_title": "Wish there was a 0 star rating",
        "review_detailed_main": "I had know Fox News had a movie production company.\n\nThis is bad on every level.\n\nis there anything more hilarious than christians portraying themselves as a persecuted religion....\n\nIf that movie was on fire.... i wouldnt pee on it, i d throw more gasoline"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "cdxlii",
        "review_rating": "1",
        "review_title": "A slow motion hell",
        "review_detailed_main": "It's a movie that never starts, never ends and in between is just a lot of slow motion to pad the run time. It's painfully obvious all the way through that they didn't even come close to have enough story or movie to fill out the run time, so the solution was giving the movie 3-4 different beginnings, inexplicable and gratuitous slow motion shots all the way through, characters repeating the same thing at each other ad nauseam, and a hip hop dance scene that goes on forever despite only one person taking part in that scene actually knowing how to dance.\n\nIf your thing is watching bad movies don't even bother, it's incredibly dull. You can just look up the two scenes worth watching: the scene where the alien wearing Kirk Cameron like a skin suit is drinking from what is clearly an empty cup and the one where santa is beating up some dude to a dubstep soundtrack (in slow motion of course)."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Moonbeam_87",
        "review_rating": "1",
        "review_title": "Kirk Cameron is the Biggest Ham",
        "review_detailed_main": "Kirk Cameron was Saying During The Feast to Pull out The Biggest Ham. I guess he was talking about himself. Because he Also said it's about a Material God, so it should be MARKED with Material Things. WRONG, DING! Christmas is about the birth of a Humble King, So it Should Resemble Humility."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "gummybear-99145",
        "review_rating": "1",
        "review_title": "This movie took me a month to watch",
        "review_detailed_main": "I'm not joking. This movie is so bad that it took an entire month (December 2021) to watch. It's about Kirk Cameron and his huge forehead talking about how everything in Christmas is related to Jesus. He also says that a candy cane is a perverted symbol. You should watch this to experience how bad this is."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "AntonFokker",
        "review_rating": "1",
        "review_title": "Worst Christmas movie ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kmakahikm",
        "review_rating": "1",
        "review_title": "Bad acting and not even sound Biblically",
        "review_detailed_main": "I respect Kirk for his ferver and heart but he needs to go back to Genesis and re-read. I was going to suck it up for the ultra bad acting but when he started teaching un-Biblically sound doctrine I had to shut it off. Sorry brother, but in all your respectable years in serving the Lord, I have to (in love) tell you that you're missing the mark on this one."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Grandslamwich",
        "review_rating": "1",
        "review_title": "This has the audacity to call itself a movie",
        "review_detailed_main": "I'm gonna keep this brief, but this is barely an actual movie. The last 20 minuite are just a terrible out of place dance scene and some Kirk cameron narration that takes place way too often throughout the movie. This movie is full of contradictions, stupidity and sometimes getting actual parts of the bible wrong. This movie is a disaster on every level and isn't even a movie so bad that it's good. Do not watch this movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "nationformarriage",
        "review_rating": "9",
        "review_title": "Not a bad movie -Unfortunately a link to this page was posted....",
        "review_detailed_main": "Funny at times. Has a good message. Makes you feel good at the end, restore your faith in humanity. I'm not too sure about his friend, sketchy\n\nI think the idea is correct about putting Christ back in Christmas. I hope it makes a lot of money. Nothing wrong with a GOOD Christmas movie. It's a lot better than \"Bad Santa\" or some of the other terrible Christmas movies I will not let my kids watch. The movie seemed a bit long, and the plot was a bit predictable except for the end (I wont spoil it for you) Unfortunately a link to this page was posted on a homosexual website, and they requested that people down vote the movie, so the results we are seeing may be inaccurate :("
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "gmedheadache",
        "review_rating": "7",
        "review_title": "This is pretty good.....",
        "review_detailed_main": "I had never heard of this i'm seeing it in 2019. I think it wasn't well received because people were expecting a fun Christmas movie and what they got was some really good teaching about the holiday. Yes I would have been upset going to see this at the theater expecting a Christmas flick and getting this...but seeing it as a teaching piece it's very very good."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "fuzziestbunniest",
        "review_rating": "1",
        "review_title": "Reminds me of English class",
        "review_detailed_main": "Kirk Cameron connects things the way one does when writing an English paper: with very little sense and a lot of desperation. I, personally, would not want to make my paper a movie, but I see that Kirk Cameron feels differently."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "brmckim",
        "review_rating": "1",
        "review_title": "Literally the worst thing I've ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jordanbarr-12472",
        "review_rating": "1",
        "review_title": "Lives up to it's horrible reputation",
        "review_detailed_main": "This movie is horrible. It probably would have been better if this were made only for Kirk Cameron and Darren Doane's families and never released. It might have been better if there wasn't constant stalling for time.\n\nThey should've cut maybe 15 minutes out of this and it would've been better. Maybe."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mvike",
        "review_rating": "1",
        "review_title": "I liked...",
        "review_detailed_main": "When it was over.\n\n(My review has to be so many letters to be able to post...but I have nothing else to say so I'm telling you)"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "WondrousMoose",
        "review_rating": "1",
        "review_title": "Saving Christmas is inept, imbecilic, and an absolute waste of anyone's time.",
        "review_detailed_main": "When I reviewed The Last Airbender last year, I figured it would be the worst movie I would bother writing about on here. This one is something special. I have given very few films a 1/10 rating, as in order to do so, I must feel that it's devoid of all artistic and entertainment value. Because Saving Christmas fits the bill, I've given it that rarest of honors.\n\nWhen Kirk (Kirk Cameron) sees that his friend Christian (Darren Doane) isn't enjoying Christmas, he sits down with him to explain away his concerns about the holiday.\n\nI once saw a movie called Santa and the Ice Cream Bunny that was worse than Saving Christmas. I guess that's about the best I can say about it.\n\nThe movie feels like a short film drawn out to an hour and twenty minutes. The main \"narrative\" involves 38 minutes of two men sitting in a car interrupted by slow motion flashbacks and fifteen minutes afterward dedicated to a dance sequence and credits/bloopers. That leaves the remaining half hour or so for slow motion footage, plodding narrations, and an obsession with hot chocolate. This is a movie that is terribly difficult to sit through.\n\nWhile it's clear that the film's technical integrity was at best a quickly abandoned afterthought in favor of its thematic material, the fact that it fails there as well is damning evidence of how poor this movie is. Saving Christmas isn't even about putting Christ back in Christmas, as the poster claims, but is instead about Cameron making up some spots to stick Him in. Much of the movie consists of Cameron explaining to his friend how different traditions had Christian meanings all along, such as Christmas trees representing Christ's cross, presents representing city skylines, and snow globes representing nativity scenes. The cast is likely a group of people that Cameron knows, and let's just say the few non-white people present really stand out. The only black character with a speaking role, Diondre (played by a man named David), is a jive-talkin', hip-hop-lovin' DJ who fits just about every stereotype you would expect of a man in this kind of movie.\n\nThe worst part of this film, both onscreen and off, is Kirk Cameron himself. From this movie and the events surrounding its release, he strikes me as arrogant and self-aggrandizing. Every smug, nonsensical explanation that he offers to his friend is met with immediate awe and reverence. In reality, what he says throughout the film is at best naive and at worst falsehoods, distortions, and misrepresentations of both Christian and pagan histories. The fact that Cameron wrote these interactions framing himself as flawlessly as he did says something about the man's character.\n\nHe goes as far as to praise Christmas-season materialism by declaring it to be a way to thank God for taking on a material body. That comparison is inherently trivial, as beyond the equivocation of the word \"material\", Cameron is describing every holiday and how it is celebrated. That is, of course, unless there is some ethereal holiday that cannot be celebrated by any physical means. What am I even talking about at this point?\n\nSaving Christmas is among the worst movies I've ever seen. It is an abject failure in all matters spiritual, historical, visual, audible, and ethical. At the core of this travesty is a pretentious, one-man charge toward desperate re-appropriation of Christmas traditions by a man who sees himself as our cultural savior. The acting is bad, the writing is bad, the message is bad, the music is bad, the dancing is bad, the jokes is bad, and the hot chocolate is probably bad. Do not watch this movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Sober-Friend",
        "review_rating": "1",
        "review_title": "Everything About this is wrong",
        "review_detailed_main": "Kirk Cameron claims to be a Christian but he must of flunked Sunday School because he gets many facts wrong in this stupid inept film.\n\nI know Kirk did not write this film but the Christian Bigot should of pointed all the facts that were wrongfully presented in the screenplay. Then again I am assuming that Kirk Cameron has a brain. He doesn't. He is just a middle-aged former teen heartthrob who can not act or even be a decent human.\n\nIn this film Kirk's sister's annual Christmas party is about to be ruined by Christian, his brother-in-law, and Kirk realizes he has to show Christian how important Christ is to the holiday season.\n\nKirk go away."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Pied-Pfeffer",
        "review_rating": "1",
        "review_title": "Ideal Movie for Film Classes and Specialized Theaters",
        "review_detailed_main": "There used to be a cinema that featured really bad movies. It cost nothing to get in, but the viewer had to pay if they wanted to leave before the film ended. If that place still exists, they should add this one to their list.\n\nThere are brilliantly bad movies that deserve a \"1\" rating. This is one of them."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "againyes",
        "review_rating": "1",
        "review_title": "Why does this exist.",
        "review_detailed_main": "Terrible Christian message delivered in a way that will upset even the highest Believers. Bad acting a plot of nothingness, and Cameron trying to force God down the throat of the audience. Not one part of this thing is worth viewing. You will be more entertained and have faith in watching Grandma got run over by a reindeer."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jsdarden",
        "review_rating": "10",
        "review_title": "Great Movie!!!",
        "review_detailed_main": "It's nice when there is a movie that explains the true meaning of Christmas!\n\nThe movie takes all the aspects of current day Christmas and uses historical and Biblical facts to show how Christ is the center of Christmas and how over time atheists have tried to take Christ out of Christmas and turn it into commercialized idolatry.\n\nA must watch for kids when they're old enough to know about Santa and for anyone that wants a solid Biblical lesson about Christ and Christmas!\n\nIt's a fun, factual comedy/drama that everyone will enjoy and open your eyes to what's actually going on at Christmas.\n\nHard to find a good wholesome movie like this anymore!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Phoeniloculus",
        "review_rating": "1",
        "review_title": "The Torture is Finally Over (After forcing myself to watch this)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "shawnmcg-49206",
        "review_rating": "1",
        "review_title": "Why Can't you rate things 0/10",
        "review_detailed_main": "If anything deserves it, this does. What is effectively Christian propaganda, fails on every aspect. Not even able to be enjoyed ironically"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "dana-kellish",
        "review_rating": "1",
        "review_title": "God-Awful",
        "review_detailed_main": "Kirk Cameron takes a Yuletide dump on the screen is the most charitable thing I can say about this dreck. It's dull, preachy, ridiculously inaccurate with regard to history, inconsistent with its message, incompetent in technical matters, and an all-around unpleasant cinematic mess. One can easily grasp the emptiness of this film by watching only the credits, which mainly serves to pad out the film by including an idiotic blooper real, outtakes (one is left to wonder how it was decided which individual nuggets of cinematic dung should be included in the film as opposed to those that were left on the floor), and various other inanities. Worst, the film completely misses its own point.\n\nCameron has blamed \"atheists\" and \"haters\" for the bottom-of-the-barrel reviews this pile has garnered, but he gives those groups far too much credit. It would be difficult to imagine an atheist producing on purpose what this crap fest did by, one assumes, accident."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "djelliott1002",
        "review_rating": "1",
        "review_title": "This is how lunacy looks like ...",
        "review_detailed_main": "This is how lunacy looks like ... There is NOTHING good about this movie I could say about. It seems like: put few loonies into the room and make a mockery of the season ... Save yourselves and do not watch this BAD FILM .. There are better religious movies than this monstrocity. 1/10 is being generous."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "greatwallwalker",
        "review_rating": "1",
        "review_title": "Awful would be too good a title for this mess",
        "review_detailed_main": "I'd call this the worst movie I have ever seen, but to be honest, it's frankly not good enough for such a title. The movie is dull, preachy, badly written, poorly acted, badly produced, and also, extremely ridiculous... quite typical from what you would expect from Kirk and his merry mob of morons. Avoid this one like the plague"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "sawsecake",
        "review_rating": "1",
        "review_title": "Insulting to Christianity.",
        "review_detailed_main": "I am an atheist and am far from a fan of Christianity but this film appears to want to emphasize why. It makes the faith out to be a horrific ideology of cule despots who despise the poor. According to this, it is some holy reverence to buy the finest silver and linens rather than give any money to the poor. It frames Kirk as a hero for being Christ and making Christmas as selfish and greedy as possible. I mean I got to watch this on October 20th as a Christmas movie and I think that says a lot, this movie is so unlike Christmas it has to come before Halloween so you can forget about it by October 25th."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Movie-ManDan",
        "review_rating": "1",
        "review_title": "It IS As Bad As It's Made Out To Be!",
        "review_detailed_main": "Kirk Cameron's Saving Christmas officially joins Santa Claus (1959), Santa and the Ice Cream Bunny, and Santa Conquers the Martians as the worst Christmas films ever made. At least those films had a few moments that were so-bad-they're good. This is an insult to intelligence! It currently stands at number 2 on this site's Bottom 100. I would place it top 10...there's just a few other films I've seen that I found worse.\n\nLet me start out by saying that I am a practising Catholic. I don't claim to be an expert on religion or the Bible as humility on the subject needs to be kept. Kirk Cameron could really use some of that too. Let me also say that there have been a few interviews where I agree with what Cameron debates. But this film made me lose all respect for him.\n\nSaving Christmas looks like a mockbuster. A \"mockbuster\" is a low-budget (sometimes micro- budget) rip-off of a huge film being released at the same time that is meant to capitalize on the bigger film's success. They look like they have a budget of $4. This movie literally looks like a micro-budget film. It stars Kirk Cameron playing himself who's hosting a Christmas party. The scenes that show the party are agonizing. The acting is unbelievably bad! His brother Christian is sick of the materialistic nature that Christmas has become and wants to put \"Christ\" back in \"Christmas.\" He hides out in his car to do some thinking where idiotic Kirk comes to talk to him about his insecurities. This is the plot and it doesn't sound that bad eh? Only Kirk Cameron and company could take a subject worthy of discussion and spin it out of control.\n\nSo what's so bad about the story? Sure the acting is horrid and the budget is low, but that's not the worst. The majority of the movie takes place in Christian's car with Cameron doing voice-overs in dramatizations of what he's taking about. Those dramatizations are very bad and unnecessary. It could have been a \"My Dinner With Andre\" style and kept the camera on them the whole time, but nooooooo. The technological issues are bad enough, and these little scenes just add fuel to the fire! And what Kirk talks about are all wrong and make no sense. The first thing that Christian complains about is the materialistic possession in Christmas and Kirk says all that stuff is great. Right away that's wrong. And he just goes on to randomly and falsely talk about Jesus' birth without even saying how that ties in with Christian's issue. Next is his shpeel about Christmas trees. Again, wrong explanation! And Kirk saying why Christmas is celebrated on December 25 is wrong too! Studies show that He was born around August. And that goes on and on with what feels like forever.\n\nKirk Cameron's buddy in Christian director and pastor Alex Kendrick who I think is great. He could not save this mess. Any self-respecting Christian or anybody with half a brain can see that this is not a good film. It practically makes a mockery of the Messiah! Cameron caused a backlash with what he said was done by \"atheists.\" It's not just atheists, it is also Christians that know better than you, Kirk!\n\nInstead of making a movie about Christ in Christmas, get somebody who knows their stuff to do a documentary on the subject.\n\n0/4"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "troy-daniel-bush",
        "review_rating": "1",
        "review_title": "I hate Kirk Cameron even more now!",
        "review_detailed_main": "Characters are annoying.\n\nActing is terrible.\n\nThe story is nonexistent.\n\nAnd this movie's message is, \"I'm Kirk Cameron! My way is the right way, so just do what I tell you.\""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "gillfam-15793",
        "review_rating": "9",
        "review_title": "I liked it.",
        "review_detailed_main": "I just watched this movie for the first time this past Christmas, (2019) and I really enjoyed it. Is it a bit chessy and cheeky? Yes. But the information is sound and really helped me explain why we celebrate the way we do to my young children. I even learned a lot. Well done Mr. Cameron."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "haydenagain",
        "review_rating": "1",
        "review_title": "Erased from existence",
        "review_detailed_main": "Kirk Cameron is a fraud and a Ku Klux Klan supporter. Burn this white trash of a film!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jeremyjohnson-83220",
        "review_rating": "1",
        "review_title": "Why Kirk Cameron? Why?",
        "review_detailed_main": "Kirk Cameron has taken proselytising to a new low. There is absolutely no story here, just Kirk's I'm write you're wrong sanctimony.\n\nThe characters are unbelievably self-centred and not at all christ-like.\n\nBut then what did I expect?"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mrsmaldridge",
        "review_rating": "1",
        "review_title": "Sad",
        "review_detailed_main": "Kirk Cameron had to work extra hard to defend cultural traditions of Christmas to \"point to Jesus\". Ridiculous to try to make these things seem biblical."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "erkkigeggonen",
        "review_rating": "1",
        "review_title": "most ridicilous thing ever",
        "review_detailed_main": "Dont watch this save you poor soul its cancer to you eyes. i made mistake and watched this it was the worst decision of my life"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "shermie-66535",
        "review_rating": "1",
        "review_title": "Proably the worst Christmas ever",
        "review_detailed_main": "People actually paid to see this waste of 1 hour 19 minutes. I saw it free on Youtube and had to fast forward thru parts before i lost my dinner.\n\nI've tried to view Kirk Cameron's movies to give it the benefit of a doubt. In this movie, don't doubt people's words, it is a really bad bad movie, Not one bad enough to be campy either.\n\nI once got to see a private showing of a Christmas movie in progress. That was just as bad of this movie and trust me, that other was really really awful.\n\nI couldn't talk you which of these two films were the worst Christmas movie, but if IMDB had a zero rating, I would have given it for this movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ethanshephard-57056",
        "review_rating": "1",
        "review_title": "Insulting to Christmas and an embarrassment for Christianity.",
        "review_detailed_main": "Saving Christmas is answering the burning questions about the most wonderful time of the year. Is Christmas pagan? No. There, I just saved you from losing brain cells trying to watch it.\n\nThis movie is pandering, boring, cheaply made, and insulting to its audience. It makes me want to apologize on behalf of Christians everywhere."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "pringlesman-72457",
        "review_rating": "1",
        "review_title": "terrible",
        "review_detailed_main": "Just plain terrible and it was a waste of 1 hour and 19 minutes. find a better movie. not recommended for anyone"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "retroman2k4",
        "review_rating": "1",
        "review_title": "The Ghost of Christmas Ass",
        "review_detailed_main": "After ten minutes I needed to have a bath and cleanse my soul from this monstrosity. It was December and 10:50pm.... I had no hot water in the tank. I still decided to jump in the freezing cold bath and feel the warm glow I wasn't watching this 'film'."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ungercd",
        "review_rating": "8",
        "review_title": "Interesting!",
        "review_detailed_main": "As a Christian, and a person that attends bible study, not only do I find unique views interesting, but from researching, I find it compelling.\n\nI am sorry to see how many people left ugly reviews. I have no problem with constructive negative comments, I don't find the ugly helpful or insightful.\n\nYou should watch and make your own decision."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "blamdrum",
        "review_rating": "1",
        "review_title": "Holy roller, this is awful",
        "review_detailed_main": "I think it's fair to say that the Scientologist have a better grasp on movie making, with the exception of Travolta's \"Battlefield Earth\" fiasco. But at least the Scientologist have the imagination to invent an entire new religion. While Cameron sticks with a book that's essentially \"Life lessons for the illiterate bronze age goat herder\". This movie is actually exemplifies a great example the mental state of a person who's lofty arrogance level is only matched by their ignorance, mixed with a volatile blend of complete and utter lack of self-awareness. This people, is why the evangelical prosperity business is worth billions in the US. The pearl grasping \"war on Christmas\" diatribe trope is made even more intolerable with the absence of even a shred of the \"good stuff\" their imaginary savior was to have supposed to have preached to the first Christians. Nothing about helping the sick, and poverty stricken, it's all \"me me me me\". But what would you expect from a person who claims to have a direct communication with the omnipotent creator of the entire of everything? This movie, and the religion it advocates (as with all equally absurd religions), is and should always be open to ridicule. This should be the message anyone takes from this display of unsolicited sermon homily."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "irishboy141",
        "review_rating": "1",
        "review_title": "No effort, no skill, barely a story, I'm not even sure I'd classify this as a movie",
        "review_detailed_main": "This movie is the work kind of bad... It's boring/mediocrely bad. At this point no one remembers it, I don't think a single person (other than youtube film critics) have watched it a 2nd time.\n\nWhere to start.... Kirk Cameron is using this cash grab to preach prosperity gospel and collect money in the most uninteresting way possible.\n\nThe acting is abysmal, the morals spit in the face of Jesus's teaching, the lighting sucks, the sets are terrible and there seems to be no logic in terms of scene structure, direction, writing, and horrible humor only a rock could laugh at.\n\nThis film is cheap crappy and not worth your time. Leave it be and let it be forgotten."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "vrpmbpc",
        "review_rating": "1",
        "review_title": "Christian version of The Room...",
        "review_detailed_main": "Man, the acting is just awful. Awful. Everyone is so stiff and wooden including Mr. Cameron. I don't know if the script was just that bad but it is extremely off putting. There is nothing redeeming about this movie. If you have a message there are thousands of ways to get that across without it being presented like this. Trust me and avoid this movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "There's no reason for this movie to exist.",
        "review_detailed_main": "Kirk Cameron had some success as a child actor. As he grew up however, and found religion, he moved away from the normal Hollywood fare and started making \"Christian\" movies. Now I don't care about any of that. If a movie has a Christian message it's fine so long as the movie is good. But this movie is far from good and just shows the utter drek that \"Christian\" movies tend to provide.\n\nThe movie is supposed to provide a \"new\" understanding of Christmas and what it means. When you get down to it, it's a pagan holiday with all it's trappings that was co-opted by the early church. The people didn't care because they still got to party like they did before but instead of it being a celebration of the end of the year and a feast in honor of Saturn, it was now about Jesus. What we get instead is something that looks like a home movie and Kirk Cameron and the director sitting in a car for most of the run time and talking. Well it's more like Kirk lecturing to the other guy about the meaning of Christmas and injecting new information which the other guy just accepts as being true without questioning. Kirk even admits at some point that these stories are just that, they're just stories. But new stories in an attempt to change the way the holiday is seen. In a sense he's trying to rewrite history in order to match his personal views.\n\nAlong the way there's some bad attempts at comedy here and there and, I kid you now, a 10 minute dance scene at the end that just feels like it was there to pad out the running time. And even then the movie is barely 80 minutes long.\n\nRightfully this was savaged by the critics and the audience who saw it for what it was. And the most ironic thing is that Kirk actually asked Christians to go and rig the vote on \"Rotten Tomatoes\" to bump up the score whether they had seen the movie or not. That's right. Kirk was asking people to lie which, as far as I remember, is not something that his God looks too favorably upon. That was met with the Streisand Effect and if anything it drove the score even lower.\n\nThis is a misguided movie in every sense of the word."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Saving Christmas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Zbigniew_Krycsiwiki",
        "review_rating": "2",
        "review_title": "The only person who could possibly enjoy this movie is",
        "review_detailed_main": "that worthless little troll with two accounts, and goes around voting down everything, using both accounts, and is already plowing through the reviews for this title. \"0 out of 2 people found this comment useful.\"\n\nThis *must* have been conceived as a comedy, a joke on the audience, because the majority of this film's brief runtime consists of bearded, delusional KC rambling and lecturing his grumpy brother-in-law, while sitting in a parked car. We get various scenes atrociously acted out, with grade school-level production values, and horrible dubbing, in attempt to shove KC's warped views on us, and to distract us from the fact that we are watching a movie about two people sitting in a parked car, talking for an hour.\n\nYes, even including the lengthy pauses in dialogue reading, the stuttering and stammering, the ridiculous overuse of slow motion, and the comically long, drawn out intro, this movie is barely an hour long. So what's a wannabe filmmaker to do if their film is only a scant 60 minutes long? Pad out the runtime with slow motion dancing, blooper reels, and various other outtakes and filler material, that's what! 20 minutes worth of that can barely bring the film up to its current 80 minutes run time, and it's a long 80 minutes .\n\nBarely even \"so bad it's good\", mostly just dull and ponderous, and kind of creepy at times. The guy playing Santa in the film looks like he's straight out of Silent Night, Deadly Night.\n\nMy favourite line: \"This is a complete hijacking! This is a hijacking! High-handed, hijacking! Handedness-jacking! It's like a car-jacking of our religion!\" Paranoid. Delusional. (Awful) stream-of-consciousness. Ad-libbed? Did they really intend lines like that to be taken seriously?"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "NightlySun",
        "review_rating": "1",
        "review_title": "An exercise in cognitive dissonance, but a hilarious one",
        "review_detailed_main": "There's very little I can actually say about this movie that it doesn't already say about itself. I watched it to laugh at the hypocrisy and the leaps and bounds in logic that Kirk Cameron takes, and it delivered in that regard. Right off the bat, Kirk starts projecting by claiming there's people who want Christians to keep their holiday spirit it to themselves. Where have I heard that before? Oh yeah, like how homophobic Christians pushed \"don't ask, don't tell\"?\n\nThe entire next hour or so is just as disastrous as the introduction. Kirk tries (and succeeds, way too easily, I might add, especially when it looks like he's about to laugh in his face each time Kirk finishes a lecture) to win over his brother in law - the none-too-subtly named Christian White - with absurd arguments that today's Christmas symbolism is, in fact, rooted in the Bible and has nothing to do with idolatry or paganism whatsoever, and finally argues that materialism is good because Christ is God in his \"material\" form. Which... no. Just no. We're talking about two different meanings of the word \"material\". And besides, the gospels EXPLICITLY condemn wealth. It still feels weird having to explain the Bible to fundamentalist Christians as an apostate, yet here I am. Also, Kirk arguing that nutcrackers, who according to him represent the soldiers of King Herod that tried to kill Jesus when he was a baby, have a place in Christmas decorations because they're part of the story of Jesus, despite never actually killing him but killing a bunch of other innocent babies. Oh, really? Well if that were so, then why don't we have decorations of Judas Iscariot and Pontius Pilate out on Easter? They were directly responsible for Jesus' crucifixion, so why aren't THEY treated with the same respect given to nutcrackers/Herod's soldiers on Christmas?\n\nThere are maybe a few valid points that Kirk makes every once in a while. You know what they say about broken clocks, after all. Of course symbols see usage across several different cultures. Just look at the swastika and the pentagram, for instance. But he forgets that - according to Christianity - if the symbol is being used by pagans, it's blasphemy and idolatry, whereas with Christians, it's completely acceptable. Similarly, the movie makes jabs at conspiracy theorists who willingly swallow and digest whatever Alex Jones tells them whatever the government is secretly doing. I love a dig at those whackjobs as much as any relatively sane person, but the hypocrisy comes in when you remember Kirk believes IN EARNEST that there's a war on Christmas and that Christians are being expected to keep it to themselves, and engages in just as many ridiculous mental gymnastics as they do to justify the use of materialism and symbols of pagan origin on a supposedly Christian holiday.\n\nHonestly, I would recommend watching this movie at least once. It's good for a laugh, and unlike certain other Christian propaganda flicks, it doesn't really cause any harm. Sure, the token black character is clearly supposed to be the stereotypical comic relief, and the glorification of materialism is all wrong, but otherwise it doesn't make the dangerous generalizations or give terrible advice for its target audience that they'd expect them to take to heart like God's Not Dead."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "worldsworstwryter",
        "review_rating": "1",
        "review_title": "This is not a movie.",
        "review_detailed_main": "It's hilarious to watch, but it's also incredibly insulting to anyone that actually pays attention to it. It's insulting to both atheists and religious people at the same time. People of different faiths have fought each other throughout the years but I think we can all come together to agree that this is a disgraceful piece of rubbish.\n\nIt really doesn't even count as a movie. It's a lazily hidden piece of propaganda intended to guilt trip you and coerce you into agreeing with Kirk's specific way of thinking.\n\nWith all that said, the incompetence on display here is truly entertaining to watch. If I could give this a 0/10 I would!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kevindm-74825",
        "review_rating": "10",
        "review_title": "Haters gonna hate.",
        "review_detailed_main": "It wasn't as bad as a movie as all these people say. Go read reviews from somewhere you can actually purchase it. Funny I've watched moves critics said were great and they sucked. Watched ones they said sucked and they were good. I dont believe this is about that though, it appears most of the horrible reviews are just anti Christians. Really is sad. I wouldn't of given it ten stars honestly, but after all I read here got to balance the scales of the Christian haters."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "rtbruce-77953",
        "review_rating": "1",
        "review_title": "Sermon with live action as opposed to PowerPoint",
        "review_detailed_main": "This \"movie\" has three scenes: the guys in the car, the Jesus flashbacks, and the extended Cameron clan at the party.\n\nThis is a \"tell, don't show\" experience with a smug star who is trying to make Jesus modern and cool.\n\nAnd it has no plot. This \"movie\" is just a sermon, and it's like Kirk didn't want to be boring with a PowerPoint, so he recorded some video to go along with it.\n\nAt least the production value is good.\n\nIf you read through the cast, you'll see that there are many Camerond and extended family Camerons in the flick.\n\nI guess if you are still into Kirk Cameron or want to get a mangled, religious history lesson, then this is worth watching.\n\nThis isn't even very fun to hate-watch."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "idyllicpursuit",
        "review_rating": "2",
        "review_title": "30 minutes of content, the balance was crap",
        "review_detailed_main": "The introduction was slow. The five of us were in our queen-sized bed watching it on my laptop, and my 6-year-old passed out before the introduction was over. Not knowing about the movie prior, I would have thought this was how it was going to be throughout it, which made me a little nervous. I kept looking over at my 9-year-old to check if she was still paying attention. Thankfully she's got a longer attention span than my 6-year-old.\n\nThe movie starts with Kirk Cameron attending his sister's huge Christmas party that she throws every year. The house is gorgeous– everything is decorated beautifully, there are a ton of people and lots of food. Kirk asks his sister where her husband is, and she explains he's just not feeling Christmas this year. Kirk then goes out to the car where he finds his brother-in-law sulking and grouchy, complaining about how all of this STUFF isn't what Christmas is really about! How it's all Pagan!\n\nKirk goes on to combat each one of his brother-in-law's objections about the Christmas traditions; the Christmas tree, Santa, Christmas lights, and gifts. Each objection is given a story. My 9-year-old's favorite was seeing Santa beat a guy up! You'll have to watch the movie to find out why Santa beats this man up:)\n\nOverall, I enjoyed the content of the movie--not the fluff. Some parts were really corny, but I think that was Kirk's intent. They poked fun at Pentecostal Christians. There were several scenes where I found myself saying, \"I don't understand how this fits?\" or \"I don't feel this explains his intent very well.\" Santa was spot-on, but a lot of the explanations seemed like a very high-level overview that left me feeling a lot like Concrete Blonde's lyrics:\n\nThese little conversations Well for me they'll never do Now what am I supposed to do with Broken sentences of you? Like a book with missing pages Like a story incomplete Like a painting left unfinished It feels like not enough to eat.\n\nI would have loved to see more depth to the stories told.\n\nThe movie is about 69 minutes long, 30 minutes of which had content\u0085 the rest was just, \"fluff\". I'm not sure I would spend $10 at the theater for it. It's more suited for a TV special.\n\nTowards the end of the movie, there is a hip hop dancing scene that made me really uncomfortable. From reading the credits, I understand this is some sort of faith-based hip hop dance crew, but I felt it wasn't very appropriate for the movie. I wouldn't consider myself a prude, either\u0085it just felt odd.\n\nIf you ignore those minor details, I think you'll enjoy this movie, too! This was unlike some of Kirk Cameron's movies that are more like a documentary–this was part story, part documentary...I think.\n\nI think what sealed the deal on the film was what Kirk said in summary,\n\n\"We need to make traditions of our own. We need to infuse old symbols with new meaning. We need to arrange our lives and our homes so that every single thing points to Jesus. \"\n\nAlso,\n\n\"Remind your children that every character in God's story has a place.\""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "lewisfindleygcpbc-129-937520",
        "review_rating": "1",
        "review_title": "masterfully brilliant",
        "review_detailed_main": "If the world hate me, so shall it hate you.. these words of prophecy spoken by none other than Jesus Christ the Eternal Master Himself whose birthday is celebrated at this Most Glorious Time of year every year..Welcome be the critics placing true genius at the bottom rung of the proverbial totem pole, which comes as no surprise to those true geniuses and artists, for this is the design of the ages and is so meant. SOMEONE has to be bottom of the ladder. And First step. Why not a great work of Christian Family Cinematic genius as has been deemed by the critics. For which we are most and eternally grateful and thankful. Merry Christmas to you all. Christians, atheists and all critics and fans. MERRY Christmas TO ALL!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "yzgvfvpkm",
        "review_rating": "1",
        "review_title": "The dance scene at the end!",
        "review_detailed_main": "I somehow survived watching whatever this was. I thought I was having a terrible dream, but then the dancing happened. I decided this needed a star of its own! I would seriously love to be inside Kirk Cameron's mind for 30 seconds. Any more than that, and I'm afraid I would be permanently scarred. This is truly as terrible as everyone has said. I think I'm going to make watching this a Christmas tradition."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "stebird",
        "review_rating": "1",
        "review_title": "Someone really does need to save Christmas after this garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "masoncheek",
        "review_rating": "1",
        "review_title": "Extremely boring.",
        "review_detailed_main": "I watched this when i was 10 years old and loved it. Now 5 years later, I am bored by this heap of boring trash. Don't watch this. Watch Elf or Polar Express, not this."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Allierubystein666",
        "review_rating": "1",
        "review_title": "I don't even know what I just watched",
        "review_detailed_main": "Easily one of the worst films ever made, Kirk Cameron's Saving Christmas is a dreadful bore and an often dreadfully long cringe fest that will honestly make you never want to celebrate Christmas again. The film goes like this, needlessly long introduction scene, followed by a random scene from a different time period that isn't explained until its shown again in its full length 40 minutes later- and then we finally start the film. Those first 10 minutes already go to show you how much of a mess this film is and unfortunately, it's probably the best this film has to offer. We focus on a large generic family during Christmas and we soon see the dead-eyes of Kirk Cameron talking about beating up his sisters husband. We then see said husband conversing with an overly-stereotypical black man somehow relating Christmas and the bible to crazy shirt Fridays and playing the victim as straight men. We then spend the next 40 minutes or so (truly it feels like 6 hours) watching the husband talk with Kirk Cameron in a car in their driveway. Again and again the scene starts with the husband asking how something relates to Christmas and then Kirk Cameron goes into an unrelated monologue for about 15 minutes that's as inaccurate and tiresome as it is just poorly filmed- as the cutaway scenes are nearly all stock footage. Eventually the husband character decides to grow a pair and face his family and runs up to the door in a very dramatic fashion only for everyone to stare at him standing in the doorway for what must be like 10 minutes as he stares at them back with rage induced eyes. He then starts freaking running towards them hilariously and decides to fall on the floor and crash into the presents, and everyone's just like, okay then and walks away. Then eventually he consoles his wife for not being Christian enough for the holidays and starts a hip hop dance group scene which comes out of absolutely nowhere and may just be the longest thing i've ever had to watch. It's also not until that moment that Kirk finally comes out of the doorway he has been standing in for like 25 minutes with the door open and starts cheering and dancing. I don't have a single good thing to say about this film, and i'm honestly surprised this wasn't intended as a parody of some kind, because it's honestly so ridiculous I was laughing so hard all the way throughout. There is literally a scene where a man talks about how fluoride in the water is giving people aspergers, and that he saw it on Fox news. This film is truly everything wrong about Christians, white people, Christmas, and american society in general- and I will honestly be dumbfounded if I ever see a film of this sort of nature ever again.\n\nMy Rating: 1/10."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Mr-Fusion",
        "review_rating": "2",
        "review_title": "Putting Christ back in commercialism",
        "review_detailed_main": "It's not like I didn't know what to expect with this movie - I mean, it's a Kirk Cameron joint, the sanctimony and glaring strawmen are to be expected. But the dissonance between that action-movie poster and the actual product is what leaves a bad taste. C'mon, the guy's coming at you with candy canes of fury, ready to win the War on Christmas by attrition. The marketing on this bad boy is nuts!\n\nThe movie on the other hand is pure garbage. Cameron spends the entire running time lecturing us on the true origins of Christmas, reassuring his audience that they have morality on their side. That's his bailiwick, but the whole movie's just a conversation in a car. That's it. The sermon's interminable.\n\nLook, I know this was never intended for me, but the overall cheapness is unforgivable. To say that it's disappointing is an understatement, but Christmas is the last thing being saved here. And now that poster isn't nearly as fun.\n\n2/10"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "wcclass",
        "review_rating": "10",
        "review_title": "Krik explains to his brother-in-law that Christmas is all about Jesus, but it isn't how his brother-in-law things.",
        "review_detailed_main": "I loved the movie!!! It isn't really made for lost people. It's for Christians, and it has amazing points in it!!! It allows viewers to see Christmas in a different way than they ever have before!!! If you don't love Jesus then I wouldn't say you should go see it. However, if you do love Jesus then you gotta go see this movie. If you think people are no longer focused on Jesus during this time of year then you really need to go see it. I was amazed at some of the things Krik said because I have read and heard the stories he spoke of, but I have never put two and two together. The movie is a must see for any believer, and it's very family friendly."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mhthehammer",
        "review_rating": "2",
        "review_title": "Draining Christmas",
        "review_detailed_main": "If you looked at the poster of Saving Christmas and expected a fun family action comedy featuring the actor from \"Growing Pains,\" get ready to be disappointed. Kirk Cameron, the formerly popular teen actor turned born-again Christian, is off to save Christmas and what does he do? He stalls inside a car with his brother-in-law Christian (Darren Doane) and lectures to him and the audience about the true meaning of Christmas and the birth of Jesus. Saving Christmas is more about inflating Cameron's ego than spreading the holiday cheer to all your friends. Despite being a Christian, Cameron contradicts his own religious philosophy of love and forgiveness and suggests that Saint Nicholas, the originator of Santa Claus, murdered heretics when not giving presents. I guess Cameron was trying to be ironic with his \"Lord of the Ringsy\" take on the figure, but instead it comes off as mean-spirited, especially in a Christmas movie. To be fair, the joke might have worked in a tongue-and-cheek sense, if the other characters weren't so poorly-written. Christian is a one-dimensional Scrooge in the mud, the atheist conspirators contribute nothing and neither do any of the party-goers, including Kirk's sister Bridgette, except a dance number. Seeing the characters' lack of onscreen presence only adds to Kirk Cameron's overlong sanctimonious preachiness; that's me a film lover in general. If Kirk Cameron is reading this post (I seriously doubt that he is), I apologize for being a \"hater and atheist,\" but Saving Christmas wasn't very good. (1 Hot Cocoa in a Mike Seaver Mug out of 5)"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "garygabriel-17044",
        "review_rating": "4",
        "review_title": "Not Good",
        "review_detailed_main": "I didn't like the movie, there should be good script."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "bkoganbing",
        "review_rating": "2",
        "review_title": "Amateur Theologian",
        "review_detailed_main": "Way back when Kirk Cameron was a bubblegum teen idol and in the second year of Growing Pains found fundamentalist religion and started making demands at ABC due to said religion, an ABC executive was quoted as saying why could Kirk have drug and alcohol problems like a normal teen idol?\n\nThose 'demands' no doubt led to the tanking of his career, but by that time Kirk was on the Christian circuit, his talents reserved for them and a select but steady audience. He also was developing into an amateur theologian. Saving Christmas is the culmination of his self taught theology.\n\nThis film was made in response to the secularization of Christmas as fundamentalists see it. Kirk in this message gives all the religious reasons for certain holiday traditions from his perspective.\n\nThe film is an amateur job from Liberty Baptist University which should tell you all you need to know. The threadbare plot has Kirk explaining to his brother-in-law all the reasons for Christmas traditions going back to Adam and Eve. The adaption of certain pagan rituals is conveniently left out. The birth of Jesus is the reason for everything in the season. NOT.\n\nOf course there's a hip-hop version of Hark The Herald Angels Sing. I'll take mine traditional though.\n\nSaving Christmas was once at rock bottom of worst film ever. That was more a stand against Kirk Cameron's fundamentalism and all that implies with homophobia and sexism and a general war on progress. Now it may be the worst thing Kirk Cameron ever brought to the big screen or small. But there are worst films out there that have nothing to do with religion.\n\nHardly a ringing endorsement for Saving Christmas."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "PeaceAndLongLife",
        "review_rating": "1",
        "review_title": "Cameron's Christmas Revisionism",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "b-96875",
        "review_rating": "1",
        "review_title": "This review is dripping in sarcasm.",
        "review_detailed_main": "Wow! My man Kirk singlehandedly saved Christmas! Incredible!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "johnbmoore-17",
        "review_rating": "1",
        "review_title": "There are no words",
        "review_detailed_main": "The theology is absurd, the message is incoherent, and the tone is condescending. They even work in a few racist stereotypes. For a movie that claims to be fighting the \"war on Christmas,\" its target is actually fundamentalist Christians who are attacked with a superficial justification for Christmas excess by Christians. Once again, Christians prove to be the biggest enemy of the Christian faith."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "anaconda-40658",
        "review_rating": "2",
        "review_title": "Cannot Save This Christmas Disaster.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "bleupython",
        "review_rating": "2",
        "review_title": "Really, Really Bad...but interesting in a way",
        "review_detailed_main": "If you are watching this movie to be entertained or as a Christmas movie. Run away, do not walk, run. It is a bad movie. It is preachy, and lacks humor, plot, or any believable researched historical lessons. It is propaganda and spin. Some of the stories have bits and pieces of truth here and there, but it is used mainly to further preach and push the agenda of Liberty University and Kirk Camron.\n\nSo why did I not give it a 1 like many of the reviews I am reading. Well, I found it interesting, and here is why. The evangelical Christian movement is excreting influence unlike any time in its history in our daily and political lives. I find it interesting to learn how and what they are thinking, how they try to twist and rewrite history, and how the entire spin machine works. Therefore, a TWO."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "papadisney9",
        "review_rating": "10",
        "review_title": "This Movie Gets the word out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "sjwestbrooks",
        "review_rating": "2",
        "review_title": "Why everyone should see this movie",
        "review_detailed_main": "I know what you're all thinking: \"What in the name of Santa are you doing? Saving Christmas a movie EVERYONE should see? SERIOUSLY?!\" Please, before you dislike this review, hear me out.\n\nThere is no need to me to discuss all the dozens of problems with, well, everything about the film. I'd only be the ten thousandth person to do so if I did. Instead, I will explain why every Christian, every atheist, every Christmas fan, every not-Christmas fan, every film student, every everybody (I'm starting to sound like Kirk, aren't I?) should watch this movie.\n\nWe live in an age where logic often takes the back seat. This is an age where choosing the most logical view of an issue can make you, in the words of Kirk, \"ruin (the party) for everyone.\" People will call you all sorts of names and make you sound like some kind of inhumane criminal. Well, if that's you, then I just want to tell you this: you're not.\n\nChristians should watch this movie to learn how not to debate theology. Film students should watch this to learn how not to make a movie. Logic professors should mention this film in their classes as an example of the uses of red herrings, straw men, and other fallacies in popular entertainment.\n\nKirk Cameron appears to have moved on from this movie. I hope he continues on that path and I wish both him and all of you a Happy Holidays this year."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "megchandler-41-227215",
        "review_rating": "1",
        "review_title": "Decent bad movie to watch",
        "review_detailed_main": "I like watching bad movies and this one is a pretty good candidate. I suggest watching it with someone who actually knows stuff about Christianity (as it seems Kirk does not). It's factually inaccurate and seems to be something made so Kirk Cameron could prove he is a Christian.\n\nMost of the movie is the two brother in laws sitting in the car talking about the \"origins\" of Christmas. Pretty boring but some of the parts did make me laugh out loud at how wild they were (whether it was the scene or the claims they were making).\n\nAll in all, it's a sort of fun movie to watch if you're looking for a bad movie. Do not watch this if you're looking for factually accurate information. And I HIGHLY recommend looking at the trivia on here after watching it. It's hilarious. Apparently it's won a Worst Picture award."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Marynewcomb2013",
        "review_rating": "1",
        "review_title": "All wrong!!",
        "review_detailed_main": "First off, for Kirk to slam people for being honest as atheist just shows how bad he and his religion truly are!! It's not being atheist because you don't like something that someone like him makes!! Second, no where in the Bible does it say the son was born on Christmas!! The way the book talks about his birth puts it in the fall!!! Christians took Christmas, like many others for THEIR own beliefs & they condemn the holidays that they can't take!! Last, the writing & acting of this head on train wreck is god awful!! I will agree that Christmas has become more and more commercial each year but the true meaning is giving, being with loved ones, enjoying life!!! I have watched some religious movies that are pretty good, I'm not bashing this because it's \"religious\". I'm bashing it because it's awful!! Kirk did another movie that came in a pack of movies we got & that one is called fireproof & it's just as bad!! Kirk needs to step away from films all together!! Anyone who has dealings with the corrupt Liberty U is corrupt themselves!!!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "fredcdobbs5",
        "review_rating": "1",
        "review_title": "Would turn Jesus into an atheist",
        "review_detailed_main": "You have to give Kirk Cameron credit for consistency. Every movie he makes is consistently worse than the one that came before it. That's a not inconsiderable accomplishment; even Edward D. Wood Jr. And Uwe Boll have made movies that didn't make you want to rush for the nearest bathroom. That's one more goal Kirk can shoot for. Unfortunately for him, he didn't reach it with this one.\n\nInept at every conceivable level--and even at some that were previously inconceivable--I wouldn't even recommend seeing this just for the laughs (there are plenty of them there, although it's not supposed to be a comedy--I don't think it is, anyway. It's hard to tell). It reminded me of what a friend of mine said not long after he got hit in the cojones by a line drive while playing baseball: \"It may have looked funny to you, but it hurt too much to laugh for me\".\n\nNow I know how he feels."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "joshua-jasso",
        "review_rating": "1",
        "review_title": "This should be studied",
        "review_detailed_main": "This is the WORST movie I've ever seen and I say that as a Christian. This movie makes us look like absolutely cry babies and does nothing that it sets out to. It's also just a travesty on the level of production, truly the WORST movie I've ever seen and everyone involved should never be allowed near a film camera ever again. Our entire world depends on the fact these filmmakers would never work again. Watching this movie during Christmas is the perfect way to get people to leave your house in the first five minutes and if they do make it though the whole movie they'll probably never speak to you again."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "wapotter",
        "review_rating": "3",
        "review_title": "Semi-documentary--Meant to Inform More Than Entertain",
        "review_detailed_main": "I like Kirk Cameron's stuff. Let me put that out there. I understand where he is coming from and tend to enjoy it. \"Saving Christmas\" was informative but draggy. The format--two guys speaking together in a parked car on a driveway--tends to make the movie narrative and leads to an extremely slow pace. With a little livelier pacing and some editing (to remove the pregnant pauses), the message could have been presented in 45 minutes. I did not go into this movie thinking it would be a comedy, so I wasn't disappointed. However, the comic relief presented was a little strained and contrived.\n\nThere is, actually, very little acting. The descriptive parts frame a number of vignettes that illustrate what is being discussed. In between different themes, a party is going on. Some of the party sequences made little sense. There is one sequence where two coworkers are talking behind coffee cups (presumably to keep from being seen on video discussing things at work) which has absolutely nothing to do with moving the story and, mercifully, is never addressed again until the out-takes.\n\nThat having been said, I came away with some information that I did not know or had never thought about before seeing the movie. I believe the message should be heard by Christians and, thankfully, it is aimed directly at Christians. I don't feel like I wasted my time in the movie, but I feel like it could have been presented more evenly. My suggestion is to support Mr. Cameron by seeing his other stuff and borrowing this movie from the Church Library."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "dhainline1",
        "review_rating": "1",
        "review_title": "I Am Reviewing a Movie Based on What Others Say!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jodawa80",
        "review_rating": "2",
        "review_title": "A Haiku Review",
        "review_detailed_main": "Come one, come all...sit Both Atheists and Christians lounge on Kirk's bold stool\n\n~jodawa."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "lorierickson-17978",
        "review_rating": "9",
        "review_title": "I Liked It",
        "review_detailed_main": "I can't figure out why everyone hated this so much. I thought it was great. I'm a Christian, but I learned a lot from Kirk's little lectures - I thought they were very well done. I'm planning to play those parts for my family on Christmas."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "bu_MN",
        "review_rating": "4",
        "review_title": "Educational movie with a touch of family comedy",
        "review_detailed_main": "Made me think more about the reasons for celebrating Christmas. Helps me to see that I can focus on the true meaning of Christmas while partaking in the celebrations of the season. The main character named Christian did an excellent job and was enjoyable to watch. The others in the cast provided the right amount of lighthearted humor. There was a good balance of scenes between Christian and Kirk Cameron and the main party. Kirk Cameron is known for producing great movies and people have a certain expectation from his films. This film seems to be marketed as a full action comedy which sets expectations different than what the movie actually is. I liked it. Just know it has more of an educational approach with light humor."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "JediMasterGandalf",
        "review_rating": "3",
        "review_title": "Not Good, But Not As Awful As Some Would Have You Believe",
        "review_detailed_main": "Look, this movie has a lot of problems. It's preachy, plodding and the ending is cringeworthy, but I have seen much, much worse. Especially Christmas movies. At least the folks who made this remembered that Christmas is supposed to celebrate the birth of Christ. Too many contemporary \"Christmas\" movies claim that the true meaning of Christmas is \"family\" or \"finding your true love.\" Nice, safe sentiments to be sure, but not the \"true meaning of Christmas.\"\n\nDid the makers of \"Saving Christmas\" get everything right? Far from it! Would I watch it again? Nope. Would I recommend it to anyone else? Probably only to fundamentalist Christian friends. But it is not deserving of all the hate and the (currently) 1.5 rating.\n\nThis movie is definitely not for everyone. However, there are certainly more awful and unwatchable movies out there."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "tjahain",
        "review_rating": "4",
        "review_title": "Misleading poster - not a plot-driven piece",
        "review_detailed_main": "I love bad movies - The Room, Birdemic, and A Talking Cat rank very highly among my favourites. When I saw the IMDb rating for Saving Christmas, I was convinced that I had to see it.\n\nThe movie is not good, but I do not think its low rating is entirely justified. Based on the promotional image, I expected Kirk Cameron to play an action hero, saving Christmas from heathens. But this was not a plot-driven movie. We meet a character who is frustrated with the way that Jesus was put on the periphery of the season, but he is simply a device for explaining the historical or Biblical meaning of the symbols seen at Christmas. This film was originally produced to be shown in churches for educational purposes. For that venue with that audience, the film largely succeeds. That is, the information is interesting, though the acting is poor, several characters are lazily written as old stereotypes, and there are some very cheesy moments. For a broad audience, this movie has very low appeal. I consider myself an open-minded but non-religious person. I found the interpretation of some symbols interesting, and although the information was not presented in a way that I found especially fun, I think to try to do that would detract from the core message.\n\nThis film is not in the same category as The Room, Birdemic, or others of their ilk. It was not designed to be a widely-viewed masterpiece that fell utterly short. Judging the film against what it intended to be, it is fine. Not good, not bad, but fine.\n\nI do think that the Christians who complain about the red Starbucks cups introduced in 2015 could learn something from this film. The people who would gain the most from the viewing are those that are disappointed in the secularization of Christmas."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "BandSAboutMovies",
        "review_rating": "4",
        "review_title": "I've seen worse...",
        "review_detailed_main": "The narrative flow of the movie works like this: Christian says something he believes in and Kirk gently chides him and then explains what an idiot he is. For example, Christmas trees are not Biblical in original, right? Wrong. God made trees. And we should see a cross every time we see a Christmas tree. You can see the logic. But it's a leap. If you can make these leaps, then you can watch this film and get something from it. You just have to let Kirk take you on a ride.\n\nIt's only when we read too much into things - if that's Kirk's real sister, why isn't the brother-in-law played by the real brother? Where's Candace Cameron, his somewhat of a bigger star sister, and her husband, hockey player Valeri Bure? Why was there no hot chocolate in Kirk's mug in the overly earnest open? Does anyone who made this movie not realize that the DeAndre character is racist in its depiction of black people? Is anyone mad that they co-opted dubstep? Why wasn't POD in this movie?\n\nThat said, I'm not going to make fun of Kirk for being a child star or his earnestly vacant stare. Obviously, this was not a movie made for me. I also don't think it was made for Christians. I think it was made for Kirk, his family and close multiethnic friends. Things just got out of hand and it ended up being released in theaters and they had to go along with it."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "catholiccontriversy",
        "review_rating": "5",
        "review_title": "Both REALLY good and REALLY bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "blueskiesmom",
        "review_rating": "10",
        "review_title": "Perfect film to smash the humbugs",
        "review_detailed_main": "People who are sick of the commercialization of Christmas and are ready to give it all up will appreciate this movie. People who are not familiar with Christianity will not get this movie or think it's bogus. However anyone familiar with the history of the church will recognize the story of Nicolas of Myrna and his role in the Council of Nicea. The recounting of the events of the original St. Nick will put a new spin on the Ho Ho Ho! This was a great way to spend an afternoon leading up to the celebration of the birth of Christ. It's not a special effects bad guy hero film, but it is what it promises to be and it fulfills its promises well. I highly recommend it and wish it was going to be in theaters longer."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "sylviatsouza",
        "review_rating": "10",
        "review_title": "Educational, informstive, not much comedy",
        "review_detailed_main": "This is more like a documentary type of movie. Educational to teach the history and the symbolism of the origins of Christmas. Very informative movie. A little cheesy at times but very worth it to learn what Christmas is truly all about"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "ranhodge",
        "review_rating": "10",
        "review_title": "Finally, a REAL Christmas movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "kkaylynn",
        "review_rating": "10",
        "review_title": "Point of View",
        "review_detailed_main": "Really, why are so many atheists even rating this movie? Did they really watch it? Why would they? I can see why they would hate it, and I don't blame them. It's totally opposite their point of view.\n\nI gave it a ten rating, not because I'm trying to help out Kirk Cameron, although I have to admit it's not the greatest movie I've ever seen. I can't even say I agree with everything in the movie.\n\nBut - and this is important to me when it comes to movies - it made me think. It made me want to go home and do some research. And I found that there are other sources out there who back up what the movie says.\n\nAlso, I did think the movie was funny. Maybe I'm just easily amused."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "djaysplash",
        "review_rating": "10",
        "review_title": "Awesome Movie",
        "review_detailed_main": "I saw the movie, and it was great. Interesting, funny, enlightening - I loved it. On Reddit I saw that readers are calling on \"all atheists\" to give this movie a 1 Star rating - even if they haven't seen it. Don't believe the low rating its been getting. Very misleading. Kirk does an excellent job of putting together a family friendly film. It's not too preachy - it's actually anything but that. The characters are endearing. The jokes come at all the perfect times. My family got the biggest kick out of some of the humor. Way better than 99% of the garbage Hollywood puts out these days. I guarantee anyone rating it low has not actually seen it, and are simply haters."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "lisapatricia-69474",
        "review_rating": "10",
        "review_title": "great",
        "review_detailed_main": "Enjoyed this movie and would watch it again, positive and funny/"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "yodergrrr",
        "review_rating": "8",
        "review_title": "A surprisingly charming film",
        "review_detailed_main": "After reading the bad reviews, I was very surprised by the movie. It was a quasi-documentary showing how the regular trappings of Christmas all point to Jesus in the end. It had a lot of humor to it and gave me a lot to think about. Kirk Cameron is the narrator and brother in law of a grumpy Christian who looks at all that goes on at Christmas and can not see anything that has any thing to do with the coming of Christ. The brother in law sets him straight in an imaginative way."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jackie-06239-81045",
        "review_rating": "8",
        "review_title": "A good watch for Christians.",
        "review_detailed_main": "My family and I learned many lessons on this movie. The plot is a bit puzzling at first, but then Kirk explains it all in his narration. It was educational and inspiring. It ran a little too long. However, the allegory was expressed nicely. I'm glad I watched it, and I'm looking forward to educating a couple family members on the meaning of Christmas."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "darren-25623",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Forget the other reviews, highly recommended. Enjoyed the message, and the humor."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "jesusinuislife",
        "review_rating": "10",
        "review_title": "one star reviews likely not real reviews, activists weighing in on Jesus himself:)",
        "review_detailed_main": "Anyone that isn't a religion despiser has to be honest; this movie rocks. It was heartwarming adorable and really really fun. Yes the plot was limited, but hey, so are the plots of many very enjoyable entertaining flicks:) It had enough plot to be interesting and enough endearing holiday garb and jingle to boost my holiday season. I am amazed at the emotion ....and sheer LENGTH (college term paper length) of some of the very inaccurate wildly neg reviews. These folks obviously are 'activisting' not 'movie reviewing' or they wouldn't be so emotional; but rather they would be doing a shorter 'matter of fact' review,....like is normal:)I saw Saving Christmas at the 'Egyptian' theater at Arundel Mills mall on Dec 15th. My son went with my husband and I. It was ridiculous that the movie was so hard to find. We drove 30 min to see it:)...because we heard it was really good and represented our heart on Christmas. Regardless of ones view on that matter, there is nothing to despise and attack about this light hearted beautiful film. It is great,exceptional acting (which surprised me). It was really well written and put together from start to finish. Anybody badly bashing this film in an unusually lengthy manner,is simply on a lib activist rant and should be refraining from showing that ulterior nonprofessional motive so obviously:) Mr. Cameron came up with a very good quality film with a well chosen cast. It was a highlight of our Christmas this year and it deserved to be in more theaters! I hope he initiates another film for next Christmas, I would be in the front of the line going in:)"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "LeighJordan",
        "review_rating": "10",
        "review_title": "Saved My Christmas",
        "review_detailed_main": "This movie enlightened me, made me laugh and gave me food for thought. Isn't that what Kirk was trying to accomplish? For those of you that gave it a negative review - shame on you. You obviously missed the meaning of this movie. For those of you that didn't see it...should. It brought together all the things we think of at Christmas and gave them actual meaning - and how Christ relates to each one. I can't wait to see this come out on DVD so that I can share it with those that missed the opportunity to see it with me. This movie also didn't give the viewer too much to process - just enough to get the meaning across. It's up to me (and you) to delve into God's word to learn more to find out more about each of the story lines in this movie. I want to know more...and that is what Kirk Cameron was trying to get us to do. #SavingChristmas #KirkCameron #KirkSavedMyChristmas"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "Son_of_Abraham",
        "review_rating": "10",
        "review_title": "Excellent movie supporting the true meaning of Christmas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "txst-40313",
        "review_rating": "10",
        "review_title": "I personally enjoyed it and here's why-",
        "review_detailed_main": "I get it. Atheists trolling the IMDb message boards don't like the movie (though it seems more than half of them never actually took the time to watch it). I did. Here's what I discovered: as someone who's had a bad attitude toward Christmas, this film was able to turn my attitude around. I understand the real meaning behind so the Christmas traditions, like Santa and the Christmas tree (they're not based in materialism). The film was funny and I loved that the filmmakers made a unique film that isn't just like the other formulaic material Hollywood mass produces.\n\nI enjoyed Saving Christmas and am glad I watched it this Christmas!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "thomashdsupply",
        "review_rating": "10",
        "review_title": "The movie has a beginning, middle and end. Follows story characters and may or may not depict actual representations of the events in question",
        "review_detailed_main": "I been seein movies for a minute now but this one right here was aight. Wish I could have had a bigger role in the movie but the homie Kirk Cameron did his thing so I ain't mad at him. Great movie to watch if you're in the mood for laughs and fun...big bday party in 22 days, hope y'all can make it! The Lord, out!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "hurley_elizabeth",
        "review_rating": "10",
        "review_title": "Wonderful Christmas movie!",
        "review_detailed_main": "This movie opened my eyes to the true meaning of Christmas. My husband and I learned quite a bit that we already didn't know. The movie was creative and insightful. Contrary to what other people are saying, it is suitable for the whole family to watch. Thank you to Kirk and the family for putting this awesome movie together. It's nice to have something to watch this time of year that isn't complete garbage! God bless everyone and have a Merry Christmas!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "pypastor",
        "review_rating": "8",
        "review_title": "It was fine.",
        "review_detailed_main": "More of a sterilized sermon than a movie. I thought the movie was paced a little slow but in the end the movie was enjoyable and had a since of humor. I'm sure it was polarizing for many and that many that have panned it never saw it. My wife and I both enjoyed the movie and it gave a great platform for extensive discussion. I especially enjoyed the refocus on the Christmas Tree. It gave me no new information but a little different perspective on the tree and its importance. The movie has no real plot but is rather one group's (obviously Kirk didn't make this film by himself) explanation for the significance and enjoyment of Christmas. I saw no real reason to involve the story of St. Nicholas with the Lord of the Rings, but it was more history of the church than most people ever get."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "alligood-181-220990",
        "review_rating": "8",
        "review_title": "Who went to this movie expecting anything other than what was delivered",
        "review_detailed_main": "Did you seriously go expecting something else. The movie delivered exactly what was advertised a frank discussion of the traditions of Christmas from a Christian view. I knew what I was going to see and I enjoyed it. For those who have not seen it, this is a discussion of something we as evangelical Christians have heard for many years. Does the celebration of Christmas and the inclusion of everything not Jesus make us less of a believer. Cameron puts forth the argument that not embracing our long held traditions is an attack on Christmas itself and why we should be OK with each one. Could it have been more cinematically engaging, yes, but I enjoyed the movie."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "egg_fu_young",
        "review_rating": "10",
        "review_title": "To Carnal Christian and to The Gospel rejecting population need to learn Biblical History",
        "review_detailed_main": "This is my updated review on Kirk Cameron's Saving Christmas, and it has been submitted to IMDb for review.. Will it be on IMDb? I would say more of a no, than a yes.\n\n(1) Book of Genesis and the Origins of trees (God created the trees) and winter solstice (astronomy of the planets aligning with this particular solar system), and their actual meanings; (2) Book of Exodus - specifically about the Tabernacle and what inside of the Structure, and their references; (3) Saint Nick (known as Santa Clause) and that he was part of the Council of Nicea, that he was also born-again, and help others with gifts. (4) Books of the Gospels (which are technically Old Testament) - Tree is the main central theme, in that Christ is God Incarnate (Fully Man and Fully God); He (Christ/Messiah) was born in swaddling (burial) clothes, that He was meant to die. He couldn't sin at all, and He was tested at all points, and still did not sin at all; He (Christ/Messiah) was beaten, Crucified on a Roman built Cross, died, covered in swaddling clothes, then buried for 3 days and 3 nights, and rose again (Resurrected). Why did He (Jesus Christ/Yeshua Messiah) do this? He did it for you, for every man, woman, and child is born a sinner because of Adam in the book of Genesis sinned, and we inherited this sin nature. This is what the movie is really about! It's about the Gospel, that Christ died for sinners! People who say 'Christmas is pagan', need to watch this movie, and then go back to the Origins, from the book of Genesis, whether's it's in your Torah or Tanak, New Testament, Gospels, History, Apostolic Writings, and/or Bible. This movie is really a commentary of Biblical History, and that you can still receive Salvation for your sins, and that you can be a child of God through Christ's Blood Sacrifice (The Perfect Lamb of God, Old Covenant typology).\n\nThe media in news and movie reviewers view \"evil is good\", and \"good is evil\", and view this as the \"worst movie ever\" (in reference to Saving Christmas).. Really, it's the worst movie ever? Are you sure? What about James Cameron's Titanic, which really wasn't about the Titanic? I mean, you see the Titanic here and their, but it's about adultery, if you understand the term and it's origins: engagement, and it really means = to be married.\n\nWhat about Michael Bay's Transformers (2007)? You get the Transformers with very few lines to them (robot characters), and the lines are given to an actor and an actress, who are unknown until this movie came out. I felt like I was watching a cross-between Bill & Ted's Excellent Adventure and Clueless (which I can't recommend either movie). I would hear from people in my area, that it was \"a good movie!\" and \"Megan Fox is hot!\", and in translation: \"Good special effects, hot girl, and no substance to the story at all.\" Is their such a thing called movie plagiarism? It would apply to this particular movie!\n\nWhat about the recent Noah by Darren Aronofsky? This is behind the grade F-, and it fact, this is a very heretical version of Noah. It only had about 5 good points to the mass amount of liberties and rejects the Biblical History altogether..\n\nWhat did these three do, along with other movies who fall hard in Hermeneutical and Exegetical (Science and Art of Interpretation, letting the writer(s) speak for themselves, and having good application to what's being written/said) standards? In the fiction historical background, and non-fiction (literal history) accounts who fail to follow manuscripts in history, and it fact, people get praised to doing something that receives an F-, and get ridiculed for A+ when it comes to movies, documentaries, and commentaries. It's really: \"Let's apply A+ to Ivy Leagues with their buy-out program\" and \"Let's apply F- to who understand True Interpretation of things.\"\n\nIn today's society and since the 1920s-1930s, the view is: \"reject it: if it convicts us, you need to a full 180 in your so-called life style (it's really a death-style), corrects these forms of so-called theologians views (nazists, fascist, communists, socialists = aka liberal and moderates), has True Supernatural substance to it, and it's True Historical accounts, it doesn't do my homework (research) for me\" which Saving Christmas actually does. Yep, you get to your homework (research) on this Bible Commentary, Bible History, and actually documentational History (do Origin Source Research)..\n\nWhile the majority of society (not just in North America) embrace superficiality (i.e. Transformers, Titanic, Noah), and reject Hermeneutical and Exegetical standards, and perform Eisegesis (let's take a mass amount of liberties, and give a folklore, myths, add deceptions here and their), and it does my homework (research) for me. It's: \"Oh, I don't have to my homework for me! Hooray! I can be lazy!\" Come on! Push yourself! Overwhelm your selfishness! Do the homework! Stop being lazy!\n\nThis is a great example, to show, that Kirk Cameron wants to speak the majority who are in the two world-views: (a) Laodicean society (In the Bible, in the New Testament, read the book of Revelation, Chapter 3). (b) Corinthian society (In the Bible, in the New Testament, read the book of 1st and 2nd Corinthians)."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "krissypoet",
        "review_rating": "10",
        "review_title": "Great Content & Great Quotes... \"Santa's the man!\"",
        "review_detailed_main": "I saw this movie, with a bunch of friends & family at a Regal theater. Although it was a different style than what I was expecting, in that there was a lot of narration, the overall content was great! Basically, it was a celebration of the meaning of Christmas and it had funny one-liners like...\"Santa's the Man!\" Plus, I really enjoyed the scene with the two guys who were rapping behind the mugs were hilarious! Lol #GoodTimes The actual filming too had some nice effects that flowed well with the story-line. I bet most of the people writing reviews are \"haters\" who didn't even see it! #YouKnowItsTrue #BahHumbug Great Job to those who made this! Great Information! Merry Christmas!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "rgardner-39692",
        "review_rating": "10",
        "review_title": "LOVE IT",
        "review_detailed_main": "Appreciate the authentic heartfelt message of the true meaning of Christmas.\n\nSaving Christmas is a heartwarming and delightful holiday movie that captures the true spirit of the season. The film, starring the charmingly witty Kirk Cameron effortlessly blends humor with meaningful messages about family, faith, and the joy of giving.\n\nThe story revolves around a man who's struggling with the commercialization of Christmas and his need to rediscover the magic of the season. What makes this film stand out is how it balances lighthearted comedy with moments of emotional depth, reminding viewers that the holidays aren't just about presents, but about connecting with those we love.\n\nThe performances are genuine, especially from the supporting cast, who bring their characters to life in a way that feels relatable and real. The dialogue is clever, with enough warmth and humor to keep everyone entertained, yet it doesn't shy away from addressing the deeper themes of gratitude and community. The movie also has a fantastic soundtrack, filled with both classic Christmas songs and original tunes that capture the festive atmosphere perfectly.\n\nUltimately, Saving Christmas is a movie that will resonate with anyone looking for a feel-good film to watch with family. It's a reminder that sometimes, the best way to save Christmas is to look inward and focus on what truly matters. Whether you're looking for laughs or heartfelt moments, this film delivers in all the right ways. Highly recommended for anyone wanting to get into the Christmas spirit."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "chartercross",
        "review_rating": "10",
        "review_title": "A History of Christmas Tradition",
        "review_detailed_main": "We wanted to see this movie because we read on the synopsis that it was a Christian explanation of Christmas traditions. As Christians who are a little overwhelmed by the commercialization of the celebration of the birth of Christ, we appreciated the way this movie made us appreciate even the more secular appearing traditions. It all comes down to one's posture of heart, whether it's one's Christmas celebrations or one's attitude toward this film. If you just want to escape and be entertained, choose another movie, this is not that type of entertainment. But if you are looking to reconnect with beloved traditions in a more meaningful way, this movie will give you something to think about. We loved it!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "brad-179-705898",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "This movie is great and it has a great message. It is everything I expected it to be while explaining in a cue and funny way what Christmas is really about! While it is not a great cinematic production it was never designed to be. It is based around the belief that people need to realize that Christmas is a great celebration and worship of the greatest event in history!! When it comes out on video I hope the tide will turn and more people will accept it for the simple movie of truth it was designed to be. I do not always agree with Kirk Cameron but this time he has the message of Christmas in a great context. Everyone should at least watch this movie one time, Jesus is the reason for the season."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "btjeep26",
        "review_rating": "10",
        "review_title": "What did everybody think this movie was about?",
        "review_detailed_main": "I went with my niece because she wanted to and I was not expecting much. the movie had a nice message, there was no gang wars, no cussing for no reason, no girls dry humping anything in sight. If you want to take a younger person to a move and not have to worry about sex scenes, murders, drug use or exploding cars. I do not always want to go see an over acted movie, with over the top special effects, sometime I think they have some special effect just to show off how great they are, and over directed. Some time you just want to go to a movie with a cheerful message and as a religious person I liked the message as did my niece. I do not need a movie that is as much about evil as it is about good to enjoy myself."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "nikogodfrey",
        "review_rating": "8",
        "review_title": "We enjoyed it!",
        "review_detailed_main": "Kirk has seemed to definitely ruffle some feathers on this one. As for us, we really enjoyed it! It definitely is more enjoyable to those who are already Christian. As I can imagine, those who would much rather take the \"Christ\" out of Christmas will feel more awkward watching a movie that is teaching Christian values then they would actually fully understanding it and enjoying it. (As you can see from the many hateful reviews). Anyways, if you're looking for a nice family movie that will give you a few chuckles, give you a few history lessons, and teach the importance of centering God around all that you do... then this movie is for you! Merry Christmas!"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "satine6985",
        "review_rating": "8",
        "review_title": "Its a good way of letting people know the story",
        "review_detailed_main": "It is a family oriented film that shows a little bit of the things we do at Christmas with bible stories that relate to those things. It is a good way to look into the bible stories more in depth after you watch the film and after that you can come to your own conclusions. I personally know most of the stories very well but not everybody does. So it is a good way to explain in not more than 90 minutes what it is all about. I would not go to the cinema to watch it, but viewed with family I think it can open very good conversations, especially with children. It definitely does not deserve a one star rating. And it is incredible to see how nasty people can be over the internet.\n\nMerry Christmas"
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "richard-405-755171",
        "review_rating": "10",
        "review_title": "See for yourself",
        "review_detailed_main": "There are way too many votes down on this movie, which makes me think there were robo hits on it. I wouldn't be surprised though, the main star is hated by liberals. if you are conservative and/or Christian; see this movie yourself; I am sure you will find it entertaining.\n\nthe synopsis on this movie is straight forward:\n\nIt's a satire on Santa Clause.\n\nIt challenges conventional wisdom\n\nAnd finally, it clean; no foul language or sex scenes.\n\nOverall, I give the movie:\n\n10 for story\n\n8 for acting\n\n8 for directing\n\n10 for laughs that are NOT dirty."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "mpiredwn",
        "review_rating": "10",
        "review_title": "Very worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "msbasssinger-23281",
        "review_rating": "10",
        "review_title": "Missing the point",
        "review_detailed_main": "Perhaps some reviewers just prefer a sectarian view of the holiday. But the point of this movie is to explain the Christian origins of the holiday and the original meaning of the symbolism.\n\nI liked the content, the juxtaposition of the almost comic book parts with the more serious explanations. The main point of the movie is that there is ample Christian symbolism in the usual Christmas decorations for those who choose to center Christmas on Christ.\n\nThe movie nowhere says everyone must celebrate Christmas only in this way. A tolerant non-Christian might not care (and can just not watch), or might want to know why his or her Christian friends are so focused on Christ during Christmas (and watch to get an idea).\n\nThere is quite a bit of history about Christmas in the early church and down through centuries. Much of the secular explanations are not factually accurate. For the curious, the topic is worth exploring."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "cowillejansevanrensburg",
        "review_rating": "9",
        "review_title": "Title reflects the movie experience!",
        "review_detailed_main": "Well done to movie and all involved in creating it, looking at the reviews it might seem that this movie isn't worth to watch. Luckily I've seen the movie first, then googled the movie and found the reviews. Maybe the reviews would've convinced me otherwise not to watch, would be a great loss of inspiration.\n\nPlease see the movie for what it is, many people these days find themselves as the bad character in a story of their life and is unsure where to start. This will give you some structure, just watch:).\n\nSometimes we need to realize that our measuring instrument can be faulty when rating movie as good or bad and that it might need to be calibrated."
    },
    {
        "movie_id": "tt4009460",
        "movie_name": "Kirk Cameron's Saving Christmas",
        "movie_rating": "1.3",
        "review_username": "whatisbecky",
        "review_rating": "9",
        "review_title": "Kirk Cameron really does save Christmas.",
        "review_detailed_main": "I think this movie is fantastic! I like his views and interpretations of the Bible. I like how he connects Christmas symbols with the Bible. This isn't a typical movie structure and it's not quite a documentary; it's a style that is original and his own. It's deep and thought provoking; I even took notes! I like his views on the manger, Santa, Christmas trees and presents. It's all about perspective: WE MAKE THINGS ABOUT GOD! It's a breath of fresh air because a lot of Christmas movies have similar storylines, such as going back to the hometown and falling in love for 90 minutes. This one is focused on Jesus and a Jesus perspective for everything. I watched it free but I bought the DVD."
    }
]