[
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "churchofsunshine",
        "review_rating": "5",
        "review_title": "One of the better \"Movie\" films - if that sounds like faint praise, it's because it is!",
        "review_detailed_main": "There seems to be a general rule of thumb now that a \"Movie\" franchise film is only really half-decent if Aaron Seltzer & Jason Friedberg aren't involved with the production. The good news then, is that in this case, they weren't. The people behind \"Extreme Movie\" are the same people who brought you \"Not Another Teen Movie\" which is one of the better spoof movies of recent years.\n\nThis is not the kind of movie you'd let grandma watch. It's not really the kind of movie you'd want your parents to catch you watching either, but it is perhaps the sort of thing teenagers would watch as a 'Date Movie'. It's juvenile and full of sex and fart jokes, not to mention a fair bit of nudity, so its not really for the easily offended. A film about teenagers and sex is by its very definition going to be a bit raunchy. At the grand old age of 35, maybe I'm getting a bit long in the tooth for these kind of teen 'High School' movies, but I do like comedy and spoof films so am always prepared to give stuff like this a chance, and I did find a couple of parts of this film quite funny and I did laugh. Also for once, I was disappointed that the film came to an end after just over seventy minutes - unlike with the 'Epic' and 'Disaster' movies, my brain cells weren't starting to fry and I could easily have sat through more of the same.\n\nThis is not a movie in the normal sense of the word but a series of skits with the common theme of teenage sex. Personally, I liked the guy who went to the wrong apartment by mistake dressed in a mask to act out a kidnap fantasy with a girl he met online - \"Did anyone order a rape?\" - it just cracked me up for some reason - not sophisticated by any means, but funny. This is definitely a film for the Lads rather than the ladies though."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "wouter-de-groot",
        "review_rating": "3",
        "review_title": "Don't, please don't!",
        "review_detailed_main": "First of all, I love the simple 'you-don't-think-just-watch-and-laugh'-movies. That is exactly what I was going for when I put in this DVD. A mainstream storyline, some basic characters, mediocre acting, stupid jokes etc.; that's all! Now let's see what this movie brings; one or two good actors (can some1 explain to me why Michael Cera wanted to be in this movie; same for the guy from malcolm in the middle) and a few good looking girls! Together with some lame fart and sex jokes, these parts bring in the three stars I gave them.\n\nNow lets have a look at the 7 stars I didn't reward this movie with. First of all, I'm completely missing a storyline. Only sketches! Oke, most sketches continue where the others end, but still...this is not enough for a storyline, not even for these kind of movies. Than we have the jokes; these are probably not as bad as I think right now, but that's due to the acting. Bad actors make bad jokes! The only time I was really laughing was during Michael Cera's sketch.\n\nSo we have no storyline, bad actors and bad jokes. Hmmm, you're still thinking about seeing this movie? Don't, please don't! Wout"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "krahl-227",
        "review_rating": "3",
        "review_title": "Totally Extreme - Extreme disappointment that is.. ..",
        "review_detailed_main": "Its been a long and painful viewing experience for audiences and fans of the scary movie series as the recent bunch of spoof-movies (date,epic,disaster movie and meet the spartans) have been quite horrible. And then along comes this movie. I watched this movie hoping that it just might be good. But alas, what starts out as a hilarious opening scene quickly gives way to an utterly disappointing movie with some really awkward scenes.The movie itself is about teens going through the usual issues with sex and maturity (well just sex actually) and plays in the form of small episodes.The only probable reason to even watch this movie would be for its few good funny scenes,namely - the opening scene with Frankie Munitz,the misplaced cell phone,the mistaken room,the scene with the prostitute and the intermittent commentary scenes with Matthew Lillard.In fact,the most hilarious scenes are those with Matthew Lillard and are worth watching (but only these scenes).\n\nAll in all this movie which starts out promising is just another sad excuse for an attempt at comedy,which contains mostly awkward but un-funny scenes and pretty women (surprisingly enough), with the only good part being Matthew Lillard's jokes. Ultimately in the end not worth the effort or your precious time.What still amazes me though, is how in hell did IMDb give this movie a 7 out of 10???."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "jennifer626",
        "review_rating": "1",
        "review_title": "Save yourself",
        "review_detailed_main": "I've read IMDb reviews for years, either to research a movie before I see it, or check out whether others agree with my thoughts after the fact. I hope I've caught you as someone who hasn't yet seen this, because I registered with the site for the sole purpose of warning you. This \"movie\" is really just a series of moving pictures from the backlot of a fourth-tier porn studio that decided to have its actors get together between takes and try to put something \"funny\" together. To discount it as offensive and gross would be unfair to offensive and gross movies; it's just...pointless. No acting, no plot, no special effects, no jokes, just the constant repetition of naughty words and breast shots. Though I put this movie on in the background while I was cleaning the house (yes, I am intentionally including that disclaimer to distance myself as much as possible), I still feel that an hour of my life is forever tainted. DO NOT WASTE YOUR TIME."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Matt_Layden",
        "review_rating": "1",
        "review_title": "One Of The Worst Excuses For A Movie",
        "review_detailed_main": "I caught this flick before it was released and had no idea what it was about. The title instantly gives you a bad feeling all over. Is it really one of those franchise \" ______ Movie\". Is it really as bad as those films? The answer is no.\n\nIt is incredibly worse.\n\nLadies and gentlemen this flick has cracked my top ten on the list of the worst movies ever made. It is truly that terrible.\n\nThe film, if you can even call it that, has no virtually no story or plot. It is honest to god, a bunch of sketches. Something off of SNL or Mad TV, but for raunchy. There is one character that runs throughout the entire film and he tries to get the girl. Nothing new, original or funny there.\n\nThe \"film\" for some reason has recognizable names. Stars like Jamie Kennedy, Matthew Lillard, Frankie Muniz and Michael Cera. This \"film\" is an embarrassment for all involved and should be locked away with films like Belly or Carnivore.\n\nNon of the sketches are funny. We've seen all these things before. It tries to be edgy, but comes off as juvenile. A woman gets her cellphone stuck in her vagina and it constantly goes off, pleasuring her at the most inappropriate times. A kid buys a sex toy, a life like vagina and the entire skit is his relationship with it, it becomes jealous and kills itself. Matthew Lillard some unknown reason inter cuts the sketches with unoriginal jokes that your father probably knows.\n\nThe only tolerable bit was Cera, and it's only because he sells it, not the writing.\n\nFor the love of god and all that is good, never watch this trash."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Floated2",
        "review_rating": "1",
        "review_title": "Basicall a bunch of unfunny skits",
        "review_detailed_main": "Extreme Movie is very deceiving in its name. Many people have assume that it was a spoof movie such as Epic movie, or disaster movie, but it isn't. Its basically just a bunch of skits of teens in embarrassing situations trying to get the girl. Though there's one main story, involving a kid-Mike (Ryan Pinkston) trying to get a girl from his class. That seems to come around here and there and ends up being there towards the ending. The setup of this movie reminded of the animation series of Robotchicken: a bunch of sketches which are zapped when finished. And the same thing is going on here. Mix Robotchicken with an average teen movie and this is what you get. Also the talented cast was wasted (Frankie Muniz, Michael Cera, Jamie Kennedy), they're only in about one scene which is pretty deceiving considering they get top billings and are on the cover of the poster. Overall this movie was just lame, unfunny and just horrible."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Dire",
        "review_detailed_main": "Extreme Movie is not the worst of its genre. When I watched, I was expecting a terrible movie, along the lines of Disaster Movie and Epic Movie. To give this movie credit, it is not as bad as those two. However, it is still a dire movie. The title is a head-scratcher, I wasn't sure what it meant by extreme, if it meant the humour I'll understand but if it was something else, sorry I don't get it. The film is rather cheap to look at, while the direction is decidedly patchy. The acting is pretty terrible, not the worst I've seen, but nobody seems comfortable with their material. Frankie Muniz is bland, Ashley Schneider is all looks no acting talent, Jamie Kennedy is uncharismatic, Michael Cera tries hard- in all honesty he is the only actor seemingly who tries- but struggles with bad material while Matthew Lillard is pointless. The biggest failings of Extreme Movie are in its humour and storytelling, the jokes are unfunny and the script is really lame on the whole, while the story is predictable and almost a non-event. I also hated the irritating characters and the ending, which felt really tacked on. All in all, a dire movie but I have seen worse. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Adequate to entertain but nothing very funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Lemon_Stick",
        "review_rating": "1",
        "review_title": "Even the Razzies spat this crud out.",
        "review_detailed_main": "From the offset this film tries so hard to pull off a 1999 teen comedy spoof, though it fails cringefully. The movie is just one incoherent skit to another - all involving different characters, with flashes to an awful 'Street confessions' mock TV show and film editing transitions of white noise, how windows 95. Also talent wise Frankie Muniz headlines the movie, which for an out of work child actor doesn't say a lot. Big name Michael Cera looks embarrassed through trying to bounce off other wooden 'actors' (I doubt they were even that) involved a small role in an equally unfunny scenario. And the porn scene... I think it's safe to say SAG have no idea where those artistes were hired from. The writers also embarrassed themselves implementing poor, poor imitation scenes from Weird Science, Girl Next Door and Not Another Teen Movie, so much it ruins the original.\n\nOverall I felt hurt I had wasted my time watching this film, the very least they could have done was edit it so it all stories were linked and thus gave somewhat correlated chronology of events, instead of mind wobbling mess of themes. There was a main plot of the film nestled inbetween the separate dire toilet humour gags, though it was underdeveloped and poor."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "stefan-pfennigsdorf",
        "review_rating": "6",
        "review_title": "Obscene and below the waistline, but funny and OK for 70 minutes",
        "review_detailed_main": "You know this scene form \"American Pie\" which gave the movie its title - this movie is all about that topic an EVERYTHING else you can imagine about teenage sexual fantasies or fears.\n\nThere are worse \"-insert topic- Movie\"s, I actually laughed a lot, although it is a very rude humor. I don't know why it is called \"Extreme Movie\", but it fits the way that topic is depicted. If you liked \"Not Another Teen Movie\" then this one might be suitable for you, although the level of the humor is mostly lower.\n\nDefinitely not a movie for the really young or the elderly or Cannes-lovers, but enjoyable for a comedy fan who already took a shot at other \"... Movie\" movies.\n\nPS: This is my first comment, right after THIS movie and some drinks, so I hope you don't mind."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "robertplant19",
        "review_rating": "1",
        "review_title": "This isn't even a movie",
        "review_detailed_main": "The best part about this movie was the credits....\n\nWhy is Matt Lillard a star guest playing himself in this movie...u did Scream and Scooby-Doo.\n\nI have never done a review for a movie on IMDb but this movie was so horrible I had to come onto the site and register in order to help save others from wasting an hour and 10 minutes of their life.\n\nThis movie doesn't even deserve 4 stars...it doesn't even deserve to be on this website or considered a movie.\n\nI've lost respect for all of the actors that took part in this movie, except for Kyle Gass and Michael Cera but what the hell were they thinking. And poor Will Forte...why did you write this movie. Jesus."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "trenchkrymor",
        "review_rating": "7",
        "review_title": "Not as bad as some have reviewed",
        "review_detailed_main": "So here's the deal, I caught only the last 3 skits of this movie and now I really want to see the rest of it. The fact that people are saying it's worse than the spoof movies that have been flooding theatres is complete garbage. It's not for everyone, imagine the most vulgar movie you have seen, this more than likely pushes the envelope a little bit farther. I am not a fan of American pie movies and things that fall in that genre, which this kind of does, what separates it from that style is that it's a few separate skits, no one falls in love, or learns a valuable life lesson to take it from crude entertainment into corniness. Not for everyone by any means, but if you like vulgar comedy this is worth checking out. Just don't take it too seriously."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "its-kris-maytee",
        "review_rating": "2",
        "review_title": "A really, really awful movie",
        "review_detailed_main": "Dimension have done it again..\n\nEpic Movie was epically terrible, Disaster Movie was a disaster, and Date Movie.. I won't even go there. But no film has soiled the once funny 'spoof' format as much as Extreme Movie has.\n\nI haven't enjoyed any of the films along this route apart from the original few Scary Movies. However, I was quite looking forward to watching this film, but now wish I hadn't bothered. Not once did Extreme Movie refer to a successful box office movie I have seen before, and I have seen a fair few 'teenage sex comedies'.\n\nI wish I could say one good thing about this film but I'm struggling to do so. With no real storyline at all, this film really is ridiculous.. and the ending proves that. Not once did it make me laugh, and not once did I think the film would get any better.\n\nThe only reason I have given it a 2 is because of the one or two nudity scenes. Even those are pretty crap."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "bonehochane",
        "review_rating": "",
        "review_title": "For a pretty respectable team of people, this was extremely disappointing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "razil-690-479718",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "This is probably one of the stupidest movies i've ever seen. After seeing Scary Movie, which I thought was great. I thought anything that ended with the word \"movie\" would be good. I was VERY mistaken.\n\nNow where do I start, well I know comedy movies can be disgusting and gross like in Scary Movie and it can still be funny, but not with this movie. Extreme Movie could be funny but it just ended up taking the sick jokes way too far and actually started to really annoy me.\n\nI mean, comedies can be as disgusting as they want as long as they have a story behind it and at least one normal character that can lead us through it. Extreme Movie had neither, it was just a bundle of jokes that started to get annoying quickly, 12 year old kids playing with sex toys, just about every character was some sex addict, and it was just horrible. It was a waste of money and time and the character you think may be the normal character I was talking about hardly ever comes up or does anything the rest of the movie is just about stupid people doing stupid stuff that gets on your nerves after a while.\n\nI could probably best describe this as a deranged orgasm in the form of a movie, if that makes sense, because I'm telling you now this movie doesn't. See my vote to see what I really think it's worth!"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Never let your kids see this.",
        "review_detailed_main": "Currently, \"Extreme Movie\" is the 100th movie on IMDB's infamous Bottom 100 list--the 100 lowest rated major motion pictures. The fact this film made the list is no surprise, as in recent years they've made a lot of similar pictures...and many have made the list, such as \"Disaster Movie\", \"Epic Movie\", \"Date Movie\", and \"Scary Movie 5\". All are very similar...with a barrage of jokes, almost all of which are crude, disgusting and rarely funny. And, like these other films, there really isn't much plot, so I cannot really describe what you'll be seeing if you see the movie.\n\nSo did I like \"Extreme Movie\"? No...but it was less because it was so unfunny but because I felt uncomfortable because these films are all marketed towards teens...and \"Extreme Movie\" is about sex...pretty much each and every joke. I cannot even mention what many of the jokes are about (due to IMDB standards)...but, yes, there is a scene involving dwarves and a girl dressed up like Hitler...yes, Hitler! Many of the jokes also are about STDs and all sorts of nasty things....and all handled in a crude and unfunny manner. In many ways, it felt like a movie that was made by 13 year-olds....and I am sure many of them would laugh themselves silly with this film, though any sane parent would be horrified if they watched this thing. And, I cannot imagine adults finding any of it funny.\n\nI laughed once...maybe twice...and that is why this one managed to earn a 2."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "DeaditeGaz92",
        "review_rating": "1",
        "review_title": "Average, Some Scenes Are Genuinely Funny and Some Genuinely Ain't...",
        "review_detailed_main": "When I watched this movie I didn't really expect much from it to be honest, so I wasn't shocked that it was just an average American teen comedy with plenty of dirty humor. There were some laugh out loud moments (such as the next level scenes, the Michael Cera rape scene, the portable vagina scene and most of the scenes with Ryan Pinkston in, mainly because he really plays the average teenager trying to get with the hot girl really well) and unfortunately there were some really not so funny scenes (mainly the Matthew Lillard scenes).\n\nAnyways to sum this film up, it's a middle of the road comedy with a few good laughs so if you're expecting to see a great comedy film with funny moments throughout I strongly advise you go and watch The Hangover films or The Inbetweeners movie instead.\n\n5/10"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "alejandrogmx",
        "review_rating": "1",
        "review_title": "Horrible. There's no other word.",
        "review_detailed_main": "I caught this film on T.V. tonight and decided to give it a try. I shouldn't. This is one of those films that wants desperately to be funny but ends up being pathetic, boring and in many cases, disgusting.\n\nAt some points the sketches have potential, but they all end up being silly and with poor taste, some others are formulaic and lack of any fun. It seems to me they tried unsuccessfully to make a spoof or an update teen version of the 1987 satire \"Amazon Women on the Moon\". The result is a lose and poorly written series of shorts about silly and uninteresting characters, some of them connected through one story (just like the fore-mentioned film), but that is not enough to keep the audience's attention through its painful 86 minutes run.\n\nAbsolutely not recommended."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "skejt_danne91",
        "review_rating": "5",
        "review_title": "Better than most of the \"New Age Random Comedys\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "he88",
        "review_rating": "6",
        "review_title": "More Like \"Groove Tube\" Than Movie",
        "review_detailed_main": "OK...So there was a lot of flat and not too polished aspects to this film. On the other hand there were some definite home runs. The first scene with Frankie Muniz was one most gut busting funny bits ever. I laughed so hard I started choking on a cookie I was eating. The movie was set up more like the 70's gem \"Groove Tube\" that came across as if you were surfing through TV channels. There was one consistent story line that it would keep coming back to, but in between there were fake commercials, skits, and even a tip to HBO's \"Real Sex\" where they would do the supposedly random interviews on the street....Which usually turned out with more info than one of the interviewed knew or basically wanted to know about the other (or others).\n\nI too was going to drop the movie early on, but I decided to hang in there a bit and was able to get a few more laughs...I mean a movie with fart jokes involving pretty girls can't be all bad right??? Like groove Tube I think this was probably made with the idea that people in a state of mind pollution would find this rolling on the ground funny....And they'd probably be right.....But this isn't the seventies so I don't think it received the same underground fame that Groove Tube did..."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "t-g-orrell",
        "review_rating": "5",
        "review_title": "Could've been worse",
        "review_detailed_main": "Usually these (insert genre) Movie movies don't appeal to me at all. However after seeing a couple clips of this, it actually looked kind of funny. And in the end it was kind of funny. Sure there were some unfunny, lowest-common-denominator humor, but some parts, Michael Cera's and Andy Milonakis's especially, were very funny. I also liked Matthew Lillard's \"And Now You Know-esk\" segments. There isn't much story to it, as a lot of it is individual \"skits\", but the main story is a boy who is trying to reveal his crush/love to a classmate of his. Most of the funniest parts come from the scenes that don't have anything to do with this and the longer musical number makes NO sense. Probably if they stuck to a structured story, the movie would've sucked a lot more. However it could've been a lot worse, and I expected worse."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "GodBug",
        "review_rating": "6",
        "review_title": "Watchable? Perhaps for teens.",
        "review_detailed_main": "First of, the movie is meant for teenagers (or people who feel like one). It is also true that it isn't a proper movie, but more like a collage of different sketches - that tend to be quite ridiculous - loosely connected with a teenage love story. Some sketches don't even fit in the main story, which is also by itself very loose.\n\nBut, the movie isn't meant to be serious and the viewer should keep that in mind, because only that way one can enjoy the movie.\n\nSo it wouldn't make much sense talking about the acting and the scenery and all that - it's there and it's OK. Not that I'd know much, but I've enjoyed.\n\nNot much artistic value, but could serve a lot of fun."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "twailer_twash",
        "review_rating": "1",
        "review_title": "extreme(ly bad) movie: thoughts from an international viewer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Qwuijibo",
        "review_rating": "1",
        "review_title": "Truly Awful: watch if you hate cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "gamerx08",
        "review_rating": "3",
        "review_title": "Have time to waste?",
        "review_detailed_main": "In one word the movie is PATHETIC!!!. It seems director had some wild weird kiddish imagination which he portrayed in this awful film. The script is very weak and the sense of humor was very cheap and bad . The movie was suppose to be in the same genre as that of euro trip or American pie but alas! it lacks the slightest of the humor when it comes to comparison with them!. Extreme movie is extreme waste of time. By the time movie ends you will realize you hardly laughed anywhere. The acting was o.k. Ryan Pinkston did fine but then movie is too bad to be covered up by the acting only. It has one use for sure .if you have an enemy gift him the DVD of this movie and you wont regret it!"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Rent_lola",
        "review_rating": "1",
        "review_title": "Worse than \"Disaster Movie\"",
        "review_detailed_main": "I saw this tonight on Comedy Central after midnight. I've seen a ton of terrible movies and I rather enjoy the \"so-bad-they're-good\" genre of movie (ala Birdemic and The Room). Extreme Movie is just... So bad it's worse than Disaster Movie. I've watched both titles and I'll admit, I laughed once during Disaster Movie (also viewing it on Cable) during the break dancing scene and the bad stunt double bit. This piece of utter fecal matter didn't even make me smile. Even Kevin Hart and Micheal Cera's parts were awful and those two crack me up normally. I had to make an account to leave my rating and review for this crap fest. Please if you want to laugh, watch anything else, anything at all is much funnier than this. Not even worth watching if its on TV and there's nothing else on. Watch an infomercial, you'll have a better time guaranteed."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "datorsiers2",
        "review_rating": "1",
        "review_title": "Dire garbage.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "mrcheminee",
        "review_rating": "5",
        "review_title": "Robotchicken meets average teen movie",
        "review_detailed_main": "No, this ain't no top comedy, typical teen movie, porn movie or really extreme movie, but it also isn't as bad as most IMDb'ers say. Some of the jokes are funny, some are lame and the acting is sometimes pretty bad, but still it as some funny and interesting aspects. The setup of this movie reminded of the animation series of Robotchicken: a bunch of sketches which are zapped when finished. And the same thing is going on here. Mix Robotchicken with an average teen movie and this is what you get. I did like the movie and I think the movie could have been only a little better, not much, because this is what this genre is like. Bad sex jokes, sexy babes and some typical American life lessons. If you like movies like American Pie, this movie is worth a try."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "john-diamante",
        "review_rating": "7",
        "review_title": "Funny movie",
        "review_detailed_main": "Not what i expecyed but very enjoyable. The wife and i liked it and we are both over 50."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "fradifiu",
        "review_rating": "3",
        "review_title": "ehhh pretty bad",
        "review_detailed_main": "I watched this, i laughed at the scenes, but i still don't know what was it about. Actually this movie has not story. They just put random scenes together, its like watching 2 minutes long sitcoms Yes, its funny, and probably you wont stop it halfway, but not worth to watch this. Its like being stuck in a pervert, funny guy's brain, the sh.tstorm is just coming and coming. The main plot is that a looser teenage boy, try to pick up the hot girl, and try to lose his virginity. But the actual scenes that want to show this, is about 10-15 minutes. I watched this movie 5 minutes ago, and i don't remember everything. THAT sh.tty is this movie. The 3 point is probably correct, there are hundreds movies that are way better than this, don't waste your time on that"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "nyle91",
        "review_rating": "4",
        "review_title": "An actual positive comment about this movie",
        "review_detailed_main": "My suggestion to anyone who is going to see this movie: Expect it to SUCK! The movie will in fact turn out a lot better if you keep that thought in mind. I actually to some extent enjoyed this movie, it was a perfect way to waste some unneeded time. And it most certainly was MUCH BETTER than Meet the Spartans and Disaster Movie, and I thought it was going to be worse since it was a Direct-to-DVD. It had its moments, some funny bits, many Stupid scenes, and it kind of gave me a Kentucky Fried Movie or Robot Chicken feel, but definitely not as good as either.\n\nRemember to think negatively and the movie isn't as bad as you think."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "HorrorEnjoyer",
        "review_rating": "3",
        "review_title": "Expected worse",
        "review_detailed_main": "Going into this I expected something \"Disaster movie\" bad , but was kinda surprised when most of the segments had some actual humor in it good enough for few cheap laughs. The title is kinda misleading, from the \"extreme\" movie I didn't expect all jokes to be about sex, but oh well, could be worse, I guess. Anyways it's still a pretty bad picture with no plot at all and some parts doesn't make any kind of sense, I though that Matthew Lillard segments were completely pointless and did they really need to have that musical number at the end? I can't recommend it, but then again I'm not really a fan of this kind of humor and if you are, you'll probably find some fun with this flick."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "jasongaylor",
        "review_rating": "3",
        "review_title": "Only if you're bored, have absolutely nothing to do, and it's on cable",
        "review_detailed_main": "That's the only real reason to watch this film. A few of the skits were amusing somewhat but it relies way too much on sex and fart jokes to achieve laughter. That should automatically tell you that whoever wrote this had nothing substantial to pad out a good film. The same thing over and over just gets tired after awhile. If you want a skit-based comedy like this..I would recommend the original flick that started this genre instead, that would be \"The Kentucky Fried Movie\". Also check out \"Amazon Women On The Moon\". There's much more variety and plenty of more humor in these films.\n\nJay"
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "p-stepien",
        "review_rating": "3",
        "review_title": "Sex'R'Us",
        "review_detailed_main": "Picking up the movie by chance the title made me think this would be a spoof movie in the veins of \"Date Movie\" or \"Scary Movie\". However it quickly turned out that this was actually a collage of sketches centred around teenage sexual experiences with ideas ranging from farting to accidentally getting cast in a porno flick. The cast itself is the who is who of on-screen geeks: Michael Cera, Ben Feldman, Matthew Lillard, Frankie Muniz, Steven Christopher Parker, Roy Pinkston.\n\nAn average, but admittedly occasionally, entertaining affair, which naturally lacks real focus given it has no real plot, apart from the fact it builds around one high-school and one basic concept. Much like a pretty poor Saturday Night Live episode it does have its moments, but some of the jokes are literal stinkers."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "hr-boege-546-170392",
        "review_rating": "1",
        "review_title": "garbage filled with garbage and put in a garbage bin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "Enchorde",
        "review_rating": "3",
        "review_title": "Crude even for a teen sex comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "Kevin Hart was funny...",
        "review_detailed_main": "It's a series of sketches about the teens at Great Bay High School. The senior prom is coming up and the kids have sex-ed. It's part spoof and part sex-romp. The team of Adam Jay Epstein and Andrew Jacobson has made various broad spoofs. It's a lot of scattershot jokes vignettes and they don't hit that often. The major thing holding this back are the lead kid actors. They are not terribly funny on their own. The jokes are basically inappropriate sex jokes with very young actors. It's mostly not that funny. I like Kevin Hart and a couple of the scenes. The writing team has some very notable names. It would be interesting to see who wrote which section. That would have been fun to know."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "tiffanie_says_stay_in_your_lane",
        "review_rating": "1",
        "review_title": "Should be called \"Extreme Stupidity\"",
        "review_detailed_main": "There's some movies that weren't even worth making. The money could've been used for something much more useful, like a charity donation. Or anything that would help people. This is hands down the most idiotic, obscene, and filthiest junk that's ever been created. And it was marketed towards teenagers?? Who would let their child watch this garbage? The whole film is a collection of sketches about the sexual encounters of teenagers. Don't really see where that's humorous, because it's not like teenagers should be having sex anyway. I don't have kids, but I can't see myself being one of those parents who gives my son or daughter condoms/birth control and then says \"okay, be careful!\" They're not mature enough to handle the emotions and changes that come with having sex in a relationship. As if the premise isn't ridiculous enough, there's an endless amount of vulgarity. A bisexual camera show, vibrators... This boy using a time machine to travel backwards and have sex with an historical figure. The scene with the girl passing gas was stupid and overdone. It might've been funny the second or third time, but after that it just became disgusting. I experience stomach problems often (I'm not consistent with eating healthy or getting adequate sleep). There is no way I would've done that in front of a guy who I was trying to romance, or anybody for that matter. It's like filmmakers have no idea how people outside of Hollywood behave and interact with each other, and I think it's because they live so sheltered from the general public. Comedy is more likely to be humorous when it's realistic. The jokes in this movie are overly stupid, and that's just lazy on the part of the writers. They should be ashamed of themselves for making such repulsive material. Go figure the minds of youth have been poisoned."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "phildeesnow",
        "review_rating": "1",
        "review_title": "Just for the sake of it.",
        "review_detailed_main": "This is why I'm writing this review.\n\nI don't think by now anyone would be interested in reading this, or actually in watching this movie. But here is my opinion.\n\nI can't review it because i only watch 30 minutes of it, and that was enough.\n\nWhen the second sketch was a homophobic joke, i knew this was going to be bad, by the second homophobic joke i was over it, but in a masochist way of curiosity i kept on watching until Kevin Heart showed up, as always screaming and trying to be funny by being loud.\n\nWho thought of making a comedy out of good comedies.\n\nWatch the original ones, like Weird Science... without Homophobia or Kevin Heart screaming from the top of his lungs."
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "gwnightscream",
        "review_rating": "4",
        "review_title": "kind of Funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "Take it to the next level",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0806147",
        "movie_name": "Extreme Movie",
        "movie_rating": "3.7",
        "review_username": "nicholasaseychel",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Just a really, really bad film. I only watched it because I'm a fan of a few of the actors involved. Definitely the worst film in each actors catalog. Don't even bother watching it unless you enjoy being frustrated."
    }
]