[
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "A nice realistic comic film which teaches that life should move on.",
        "review_detailed_main": "Having so many strong, bold and issue based movies in his kitty, Madhur trying his skills in a comedy actually had me in doubts initially. But with DIL TOH BACCHA HAI JI, the talented director surprises the industry as well as the viewers, revealing a new undisclosed dimension of his personality, which is light, fresh and enjoyable. Thankfully following the comedy genre of Hrishikesh Mukherjee or Basu Chatterjee and not Aneez Bazmee, Priyadarshan or Rohit Shetty, Madhur comes up with a nice, feel good realistic comedy which also tackles the mid life crisis problem of men in a delightful manner.\n\nRevolving around the three one sided love stories of Ajay, Emraan and Omi, the film has an entertaining first half and a realistic second one with some regular comic touches inserted smartly to keep the viewer smiling. Plus DTBHJ also has the Madhur Bhandarkar we all are familiar with, evidently visible in few sequences dealing with the rich socialites and office colleagues. In its first hour the film keeps on moving at a pleasant pace introducing all its characters in no time and moving into their individual love stories effectively. And just before the intermission, Madhur brings on a surprising twist in the script which further adds a new dimension in the movie and one expects to see a much more exciting second half coming up.\n\nBut post intermission, as usual the pace drops a little with all the emotional drama coming in and that does make you feel restless for a while. However, Madhur hits back again in the last half an hour and gives you a completely unpredictable climax which makes the viewer feel light and refreshing with a smile on his face. Still, as I see it, the post interval part of the movie could be much better with a faster edit and a better selection of supporting actors. In fact the choice of actors by Madhur Bhandarkar in DTBHJ remains quite strange and questionable keeping in mind the fact that he could easily have roped in much better and known actors for some important roles in the script.\n\nThe merits of the movie include its fresh and cool, story-telling style which is very close to the one seen in Hrishikesh Mukherjee and Basu Chatterjee movies. So for that Madhur indeed deserves his praises considering the fact that he has never ever tried this genre before in his career. The other major merit is the way the film tackles the issue of mid life crisis in both men and women. At one side Ajay Devgan is shown fighting with his divorce and new one sided love life together in a hilarious manner and on the other is Tisca Chopra dealing with her middle age after having a successful career as a famous model and former Miss India. Along with that the film has a very soothing presence of Shazahn Padamsee, who looks very pretty, bubbly and ravishing on the screen.\n\nThe weaker points of the movie include the same old or monotonous kind of role given to Emraan Hashmi who plays a Casanova in the film as seen several times before in his previous films. And second is the not so great kind of character given to Omi Vaidya who is now hugely famous after 3 Idiots. Though both Emraan and Omi have done full justice to their assigned roles but their fans may feel disappointed as there are no specifically enjoyable scenes featuring both the actors. In addition to this, I found the casting of Shruti Hassan not up to the mark as she looked very heavily over confident in her role of a rich socialite. In other words I found Tisca Chopra much better and impactful in comparison.\n\nActually it's the main story of Ajay - Shazahn and the scenes of all the three friends Ajay, Emraan and Omi together, which keeps the ball rolling and you don't mind the other minor hiccups in the second half. Ajay Devgan once again proves his versatility with a brilliant performance which simply shows that he can equally perform well in both Hrishi Da style and Rohit Shetty kind of comedies made in Bollywood. Emraan Hashmi has got nothing new to do but still he looks charming and inviting in his lover boy role. Omi Vaidya underplays his part well and impresses but his fans may not find what they were looking for in his shy character of a poet. Shazahn as stated before looks great and acts well too but Rituparna Sengupta and Shraddha Das are just OK. Shruti Hassan overacts whereas Tisca Chopra is simply superb in her scenes with Emraan.\n\nMusically I liked the track \"Abhi Kucch Dino Se\" instantly after a long time and also \"Tu Khwaab Hai Ya Koi Jaadugari\" playing in the background. So Pritam once again gives you something to cheer about in his soundtrack. But I couldn't understand why 'Abhi Kuchh Dino Se\" was not used and promoted in the film's promotions. Cinematography is pretty descent with an eye catching art direction along with some enjoyable dialogs from Sanjay Chhel. But after watching DTBHJ I really wondered why the Censors gave the movie an 'A' certificate. May be they just gave the rating by only seeing the name of Madhur Bhandarkar in the credits without even seeing the movie entirely.\n\nSumming up, if you want to have a good time in the theater with nothing loud or over the top, keeping your comedy expectations on hold, then the chances are that you might like the movie on the whole and would enjoy it with a smiling face. In all its a nice, welcome changeover from the serious and bold director."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "MuviFan73",
        "review_rating": "7",
        "review_title": "I enjoyed Ajay's story.",
        "review_detailed_main": "There are three parallel running stories in movie dil toh baccha hai ji. Of the three stories I liked Ajay Devgan's story the most. It may be because of my ethics. Only thing I would like to tell about the two other stories is yes it happens and its not my cup of tea. My rating(7.5/10) is only for Ajay Devgans story.\n\nDirection, Screenplay, Cinematography: It was good.\n\nTone: Love life of three pairs has been captured well.\n\nMusic: It was above average.\n\nActing: It was good, especially June Pinto."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "HollowScar",
        "review_rating": "7",
        "review_title": "A modern day sweet romantic comedy movie which is good for one time watch!",
        "review_detailed_main": "After watching Once Upon A Time In Mumbai, seeing an Ajay-Emraan duo was exhilarating only because of their stellar performances in the previous movie. If you are like me and watch this movie after that, you can notice the significant difference in the acting abilities of Ajay Devgan. With Emraan however, there is a common pattern in his character. He never plays a saint, and his reactions and playboyish charm is almost anticipated. The third guy was great too in his awkwardness and did remind me of the nerd from Three Idiots. Unfortunately, the women are overshadowed by the men in their performances. Still, you cannot detect any mistakes in their part.\n\nGoing to the storyline, it is a modern tale of three bachelors who look for love. Even though Ajay is a middle aged divorcée, Emraan is a playboy, and Omi is the naive salesman with no prospect for future, they all follow the same trends of luck and failures around the same time. This is evident as they celebrate together, mourn together, and share together. However, the saving grace of this movie is not the comedy which is barely existing, but rather the sweet day to day lives of average people without love who many can relate to.\n\nOverall, it is a good watch if only you can watch it once. There are some sexual jokes, but nothing that might put you in a position of sheer embarrassment (unless your parents are really intolerant and strongly religious). There are no sex scenes even though there are implications. Emraan himself managed to stay away from any boldness even though he is wooing both mother and daughter at one point. Overall, it is a sweet movie for all the loveless bachelors, but could have benefited with a February 14th release day to really get the spirit flowing. It is a good watch for family too as it is not really as predictable as other Hindi movies. A good watch for a quiet night, but unfortunately nothing out of the ordinary."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "The heart has its reasons that reason knows nothing of",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "Herag",
        "review_rating": "6",
        "review_title": "Fun to Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "kunalkhandwala",
        "review_rating": "7",
        "review_title": "Light hearted, genuine entertainer",
        "review_detailed_main": "In a departure from his regular fare of reality inspired films, Madhur Bhandarkar indulges in the comic world with Ajay Devgan, Emraan Hashmi and Omi Vaidya in this light hearted, refreshing entertainer, that is 'Dil toh bachha hai ji'. Accompanied by Pritam's pleasant tunes and good performances by all three actors, the film narrates the love seeking journeys of the room-mates while revealing their idiosyncrasies. Unlike his previous works, this one is hardly bold or bitter and it doesn't even prove his versatility in story telling. However, it succeeds in providing those laughs that come out of genuinely funny dialogues if not innovative situations.\n\nNaren (Ajay Devgan), a divorcée and an executive, finds his new room-mates in the form of Abhay (Emraan Hashmi) and Milind Kelkar (Omi Vaidya) who are two opposite individuals. While Abhay is the jobless playboy who lives on the favours of his one night stands, Milind, who works at a marriage bureau, believes in marriage only after love and sex only after marriage. Naren has an innocent crush on his new secretary who is 17 years younger but finds it difficult to blend into her lifestyle. While his age-gap challenges his feelings, Abhay's audacity with a rich model of yesteryears enriches his own life with the perks that come along. Then we have Milind, playing the sincere simpleton for whom, his love exceeds all limitations and his perseverance, all his budgets. Each of them have a love story in the making but they just cannot seem to make it come their way. Through their experiences, we get some giggles and some laughs while Bhandarkar refrains from adding any seriousness that would weigh the otherwise thin plot down.\n\nPritam's melodious score keeps the mood subtle and hummable. Tu khwab hai ya jaadugari comes a little too often but is melodious nevertheless. Tere Bin is a good come back for Sonu Nigam with some real singing while all the attention falls upon the beautiful Shruti Haasan on whom it is partly picturized. The film's outstanding song Abhi Kuch dino se is performed by Mohit Chauhan who continues his unstoppable run.\n\nThe actors do more justice than what the script and story asked for and Devgan leads the pack impressively with his innocent performance showing teenager like attributes while avoiding the over-the-top 'Golmaal' comic avatar. Omi Vaidya excels at his tailor-made role which he gets absorbed into. We would love to see more of him this year and hopefully, in more comedies. Emraan Hashmi has come a long way with his acting and after 'Once upon a time in Mumbai', he proves yet again, that it's not only the music in his films, but his performance too, deserves appreciation. Shazahn Padamsee has the cheesiest dialogues that are overdone. Tisca Chopra is good in her role but it is Shruti Haasan's beauty (credited to Sarika) and bold persona that captures one's attention.\n\nMadhur Bhandarkar wasn't making a comedy like 3 idiots. It was not meant to be a didactic experience, nor was there any guidance to real living. But by avoiding ridiculous situations and corny dialogues that are the basis of most comedies, he ensures that there isn't a boring moment in the film, no matter the lack of nuance and originality.\n\n7.63 on scale of 1-10."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "Kornephoros",
        "review_rating": "1",
        "review_title": "Terrible Acting and Irritating Dialogue",
        "review_detailed_main": "We went to see the movie tonight after watching the trailers and assumed that it must be a good movie because of the cast. But that proved to be a terrible mistake !! The movie lacks everything that should have defined it. Acting is very superficial and poor, dialogues are so poor that you feel like kicking yourself, the outdoor scenes look artificial and you find people looking directly at the camera. It is a \"C\" grade movie that uses cheap sexual jokes to make the audience laugh. Frankly,the movie does not even deserve to be reviewed. We got out of the theater even before half time. So, my sincere advice to all - Please avoid this movie and save your time, money and sanity."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "deeprise1988",
        "review_rating": "6",
        "review_title": "There is lot of Bachcha",
        "review_detailed_main": "Madhur Bhandarkar's new venture, before he had directed serious movies and by this he had tried new genre. I would say first half is enjoyable as there is enough punches to make you laugh with the dose of some clumsy lines but its acceptable.\n\nBut in second half it loses its track and most of the scene looks to be imposed in movie. The Emraan Hashmi's track is half baked and also some scenes are not fitted nicely. But I would say for the some entertaining parts I enjoyed this. Although there are some of amateurish performance by supporting cast but it is leading male actors who done well also Tisca Chopra. And at last I liked the ending of the movie."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "namashi_1",
        "review_rating": "4",
        "review_title": "A Letdown!",
        "review_detailed_main": "Madhur Bhandarkar has made remarkable films. 'Chandni Bar, 'Page 3', 'Satta', 'Jail', were killer films, which just proved how talented of a storyteller he is. But like 'Fashion', 'Dil Toh Baccha Hai Ji' is a letdown from this accomplished, National-Award-Winning Filmmaker!\n\n'Dil Toh Baccha Hai Ji' is a tale of 3 men, who are in search for true love. To give it's due, the film begins well, and the characters are established fairly. But, The problems begin right after the things get established, the film gets very monotonous and begins to bore. The second hour is a downer, and the climax leaves you in mixed emotions.\n\nMadhur Bhandarkar's Screenplay is monotonous and lacks pace. His direction, there-after, gets limited. Cinematography is just right, while Music by Pritam Chakraborty, is lively.\n\nPerformance-Wise: Ajay Devgn performs well, as always. Emraan Hashmi is decent, but Omi Vaidya doesn't work. Shazahn Padamsee looks fine, but fails to engage as a performer. Shraddha Das is efficient. Shruti Haasan is below average in a brief role. Tisca Chopra is passable. Rituparna Sengupta, Aditya Raj Kapoor, Mukesh Tiwari & Daisy Irani are wasted.\n\nOn the whole, an unexpected letdown!"
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Amazing and reality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "saba2115",
        "review_rating": "5",
        "review_title": "A huge letdown",
        "review_detailed_main": "I have been so impressed with Madhur's films and expected to see something good when I went to watch his latest offering but sadly, the movie was a huge disappointment. Every thing was below par ( when I say that I mean compared to the standards set by MB himself)--- the humour is self conscious and falls flat even though the writer has made full use of sexual innuendos, the actors (the male protagonists) are all wasted and this is such a pity because we know all of them are capable of much much more, the women are ridiculous caricatures of the 21st century woman and the entire story line on which all this hangs seems terribly contrived and predictable.\n\nPritam's music is good; the song by Mohit Chauhan is great but even this fails to lift the film. A comedy of this sort needs to be running on wheels not dragging as it does and at the end one feels as frustrated as one does at having to eat a collapsed soufflé."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "talalz",
        "review_rating": "8",
        "review_title": "Nice Movie",
        "review_detailed_main": "Madhur Bandharkar has recently brought us great movies to watch such as Fashion, Jail, etc. Now he has stepped into the romantic comedy genre with Dil To Baccha Hai Ji.\n\nIt isn't the best movie or the best comedy in recent times, however its definitely 2 hours well spent. There has been some criticism that the movie's foundation resides on sexual jokes. Sure, i agree that there are quite a few of them but there aren't as vulgar as seen in other movies for example Masti. The 3 male actors, Tisca Chopra performed really well however the other 3 actresses did not shine in my opinion. Especially, Shruti since her role only lasts 15-20mins. The love stories for Ajay and Omi are well structured but i found Emraan's story to be kind of random. It is never clear when he falls in love. The music in the movie is quite good and i really liked the use of 'Jadugari' in the BGM.\n\nAjay is already set but this movie is a stepping stone for both Emraan and Omi. Emraan in the past has stuck to Mahesh Bhatt movies and this could be his introduction to more commercial movies - he is very talented and deserves a chance to shine. Omi's acting even though was very similar to his character in 3 idiots but the context was different and maybe we will see him in other comedies soon.\n\nAs far as 2011 is considered, after No one killed Jessica, this is my favorite movie of the year so far. I recommend that everyone (adults) should go and give this one a shot."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "drsnehithmd",
        "review_rating": "5",
        "review_title": "a depressing comedy",
        "review_detailed_main": "First of all i need to say that i am not a fan of Mr.Bhandarkar's movies.His movies being realistic is pretty much a joke as all his movies are very superficial,but apart from that the only reason i watched this movie is due to ajay devgan,he's one of the most underrated actor of our times.Anyways the basic plot is 3 guys,a soon to be divorcée,a playboy and a poet leave their respective homes for different reasons and end up together in ajay devgan's house.soon they meet up 3 random women and fall in love.Will they succeed in finding true love forms the rest of the movie.Now the positives of the movie,the performances of ajay devgan,emran hashmi and omi vaidya are commendable and they save the movie from sinking immediately which the film ends up eventually.The performances of the women are nothing special to write about as they play the usual girlie characters,very forgetful ones.As i am a south Indian and i do believe one should not give up their local language so the preference given to marathi is appreciated.Music is okay.Dialogues are surprisingly witty,modern and intelligent.Direction is okay. Now the negatives,the usual fault of the director that is to be superficial in his approach to story telling,there is absolutely no character development.The poor guys don't even realize why they keep losing in love.The movie is all about running behind women,giving lifts to women and providing money when in need,does this make women fall in love,i don't think so.In trying to be too modern in his approach to show how his characters should behave the director loses his grip on realism.Being a guy i did have a few laughs during the movie but ended up being depressed for all the men by the end of the movie.Watch the movie for the 3 actors performances and please stop saying that these kind of movies reflect the real India."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "ganeshkss97",
        "review_rating": "2",
        "review_title": "Bland",
        "review_detailed_main": "Madhur Bhandarkar's Dil Toh Baccha Hai Ji is dull.\n\nThe movie has an interesting story.What goes wrong is the characterization and its screenplay.\n\nIts sad to know that this film was directed by Madhur Bhandarkar.The movie's first half is good,providing some laughs.The second hour is bad,which makes the movie worse.\n\nMadhur Bhandarkar's direction is strictly okay.\n\nThe music is average.\n\nPerformance wise-Ajay Devgn is good.Omi Vaidya is a shock.Was he the one who played Chatur Ramalingam in 3 Idiots?He is bad.Emraan Hashmi is first rate. Shazahn is bad.Shruti Hassan is okay.Shraddha is bad.Tisca Chopra excels. Mukesh Tiwari is wasted.Manoj Joshi hams.\n\nOverall Dil Toh Baccha Hai Ji is a disappointment."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "andydgr8",
        "review_rating": "5",
        "review_title": "Quite amateurish & immature film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "silvan-desouza",
        "review_rating": "4",
        "review_title": "One of Madhur's below average movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "MovieInspector",
        "review_rating": "8",
        "review_title": "A nice romantic comedy",
        "review_detailed_main": "Madhur Bhandarkar, a national award winning director, is well know for his hard hitting movies such as \"Fashion\" and \"Chandini Bar\", and that's why you have to give him lots and lots of credit for going out of his comfort zone.\n\nThe performances by all 3 of the leading males (Ajay Devgan, Emraan Hashmi and Omi Vadiya) are good. The character development makes up the story; hence, we get to know more about the personalities of the three characters as the film progresses. Their respective stories are all different so the theme of love, of course, is thoroughly explored.\n\nThe cinematography is good as you would expect, as is the screenplay.\n\nMusic has been nicely incorporated; there are no songs that don't 'fit in'.\n\nVerdict: a nice, funny and romantic movie that shouldn't be missed. 8/10."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "drjumokeojo",
        "review_rating": "9",
        "review_title": "Lovely movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "souravt9",
        "review_rating": "10",
        "review_title": "Entertaining Movie... MUST WATCH!!!!!!",
        "review_detailed_main": "National Award-winning director Madhur Bhandarkar, known for making hard-hitting and realistic films like CHANDNI BAR, PAGE 3 and FASHION, traverses a completely new terrain with DIL TOH BACCHA HAI JI. Mind you, it takes a lot of courage to get out of your comfort zone and make a completely different film.\n\nDTBHJ brings back the successful jodi of Ajay Devgan and Emraan Hashmi after ONCE UPON A TIME IN MUMBAAI. It also stars Omi Vaidya (3 IDIOTS fame) in a pivotal role. The quirky promos and some smart marketing went in favour of the film and managed to create the right buzz.\n\nIn a hilarious voice-over by Paresh Rawal, we are introduced to bank officer Naren Ahuja (Ajay Devgn), playboy Abhay Suri (Emraaan Hashmi) and Milind Kelkar (Omi Vaidya). Abhay and Milind are paying guests in Naren's house.\n\nThe film basically traces the lives of Naren, Abhay and Milind and their encounters with women. Unable to resolve their rising differences, Naren and his wife (Rituparna Sengupta) are about to end their seven-year-old marriage. In a disturbed state of mind, Naren falls for a cute 20-year-old new trainee June Pinto (Shazahn Padamsee) in his bank. Abhay is a gym instructor who can't get enough of girls and women (married and unmarried). He even loses his job for teasing the wife of an underworld bhai from Dubai. On the other hand, Milind writes 'dard bhari shayrees' which cause 'sir dard'. He also works in a matrimonial site, zhatpatshaadi.com, but is unable to find himself a suitable match. He gets infatuated by radio jockey Gungun Sarka (Shraddha Das), who just uses him to get out of troubled situations. The rest of the film shows how their respective tracks move forward."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "killswitch-159",
        "review_rating": "8",
        "review_title": "Madhur's Rom com delivered!",
        "review_detailed_main": "This is a Hindi movie with a difference! Yeah, I expected something from the promos and well, I got exactly what I was expecting. But I said it is different, because unlike many Hindi romantic comedies I have watched, it does not portray love as stupid.\n\nThe characters in the movie are pretty detailed and distinct. The first half of the movie takes a bit time introducing the protagonists, which is a good thing, so that we actually give a damn about the characters! The title is so apt because the 3 lead characters are so different in character, but they all have a common attribute - falling in love. And their love for the girls, why they fall for them and the incidents following that, make up the story.\n\nI don't wanna reveal anything. I am posting this review here because I have found some negative reviews here. I don't understand why! Hats off to Madhur Bhandarkar for making this movie! He had done a good job..Guys, don't miss this movie! Its kind of an eye opener too, because of some unpredictable stuffs followed by a strong climax. Awesome!"
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "hereiam-kumar",
        "review_rating": "10",
        "review_title": "Very Good movie",
        "review_detailed_main": "I think the movie reviews about this movie on IMDb is very misleading. This movie is in fact very unique and very good. It has a different plot compared to other comic romantic movies and is totally enjoyable. All lead actors have done a wonderful job and kudos to the director. I enjoyed every second of the 2 hours well spent watching this incredible piece of art anticipating whats next in the plot. I think the movie deserves more than one viewing. This is my first review in IMDb. I don't know what to write more about this movie. I don't know whatelse to write to meet the 10 lines requirement of IMDb. But the movie is superb. Most watch for Indian movie goers."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "dkgupta493",
        "review_rating": "10",
        "review_title": "I like movie even after 11 years",
        "review_detailed_main": "This movie is hilariously funny and entertaining and make me laugh and many moments I love this movie I worst it man I was in my studies and I wasted again after 11 years and I can see it is very good movie so for an anyone can enjoy it a performance of Imran Hashmi is very good Ajay Devgan also suit in his role all the female actresses are very good."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "hs-movieman",
        "review_rating": "8",
        "review_title": "A Twisted Tale of Love....!!!!",
        "review_detailed_main": "Ye dill hai nakhrewala.....its perfect true!!!! The title Dil to baccha hai ji is perfect for movie nd u can feel it while watching.Madhur Bhandarkar is a director of hard hitting serious cinema but now he changed his track to Rom-com movie nd he succeed in it, its a light hearted romantic comedy with a soulful music(Pritam) nd direction(Madhur). Ajay is perfect in his role as he is a versatile actor,Emran is too good nd Omi is well nd all other characters performed nice.The best part of movie is its engaging screenplay with background score by \"Sandip Shirodkar\".The tracks like abhi kuch Dino Se,tere bin,nakhrewala nd last Jadugari.....its really memorable.So at last,its worthy watchable movie,go for it...............nd its right \"Love grows Men Don't..........a twisted tale of love!!!!!\n\nIts one of the best lovable romantic comedy movie from the era....:-))))"
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "sreearihant",
        "review_rating": "9",
        "review_title": "Madhur Bhandarkar does an Expose on LOVE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "anupam-durg",
        "review_rating": "8",
        "review_title": "Madhur proved once again his wit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "navi-m-1947",
        "review_rating": "8",
        "review_title": "Cute movie. Fun to watch.",
        "review_detailed_main": "Very entertaining movie. Who cares about action. Things come together for excellent comedy between 3 men. Padamsee as June Pinto is very cute. Shruti Hassan is awesome, easy acting, confident, she's gonna make waves soon. Madhur Bandarkar did good job cooking this recipe. Nice songs.\n\nMovie starting with a Divorce situation may be the sentimentally weakest point of the movie from Indian perspective. Also projecting infidelity as an acceptable part of life is no big deal for non-Indian audience as it is dealt delicately but Indian audience may not feel the same. But the movie did not came out cheesy or insulting to women. Could have been a disaster if any of these delicate topics had been mishandled. But the comedy, cuteness, bold dialogs, and brilliant cast selection made the movie stand apart from the hind movie crowd."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "dipteshmodak",
        "review_rating": "8",
        "review_title": "Beautifully made.",
        "review_detailed_main": "Lovely story, Nice songs, good acting, what more can anyone ask for!"
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "Dil Toh Baccha Hai Ji (A)---------------Rating : 4/5",
        "review_detailed_main": "Dil Toh Baccha Hai Ji (A)---------------Rating : 4/5\n\n*It is an romantic comedy with emotions and finally ends happily.... *Cast and their performances were good especially AJAY devgan... *Songs and BGM rock the movie.... *INTERVAL slot will rock u with a major twist....\n\n-Movie is seems to be large in the first half then ends up fast..... -Story was realistic but it was too real and the director succeeds....\n\nThree man staying under same roof are in search of true love. They meet their ladies but will these man be able to convince them to be their soul mates?\n\nAfter Mumbai-based Naren's Ahuja's wife, Madhvi, leaves him along with their daughter, he decides to move into an apartment, and share it with two others. He ends up having two tenants - a Casanova-type Abhay Suri, and an aspiring-nerdy poet, Milind Kelkar. While fending-off advances from his lawyer, Sunanda Pradhan, he falls head-over-heels with a new employee, June Pinto, at his bank where he works as a Loans Officer. Abhay decides to woo former Miss India, Anushka, who is married to wealthy Harsh, while Milind has given his heart to Gungun Sarkar. The trio then embark on a roller-coaster ride in order to woo and win the women they want to spend the remainder of their lives with."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "mahmoodafifa",
        "review_rating": "9",
        "review_title": "Just plain awesome",
        "review_detailed_main": "Such a underrated film! The film has been really nice built by the director. All the Actors and Actresses did such an awesome job. The film deserves much better. It teaches us a lesson that we should move on life , no matter what."
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "Dhaval_Forever",
        "review_rating": "9",
        "review_title": "Madhur Bhandarker Rom com Comedy !",
        "review_detailed_main": "Just an Beautiful Movie .... Some Cherecter Played Very Well!...After All Full To Comedy Movie Can't Boring!"
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Film toh Boring Hai Ji",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1727496",
        "movie_name": "Dil Toh Baccha Hai Ji",
        "movie_rating": "5.9",
        "review_username": "rahultrivedi410",
        "review_rating": "",
        "review_title": "watch with good quality",
        "review_detailed_main": ""
    }
]