[
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "ABCA: Any Body Can't Act... Yet It Scores!",
        "review_detailed_main": "The acting is questionable and the story of this dance-centered enjoyable movie is ditto Hollywood flick \"Step Up!\"\n\nFor people who didn't get the first line, ABCD is a very good movie for dance lovers. Minus the aforementioned factors, it is a visual treat. And the 3D is very amateur, to be frank. But, who cares when we are really enjoying it. The 3D, actually spices up the dance moves and water splashes. Director Remo has justified at making a hardcore attempt on a dance film. The dance sequences are great and with oodles of style and motions, ABCD scores high! But, when it comes to the plot, acting, dialogues or even screenplay, ABCD fails, badly.\n\nBut, with a plot so predictable and feeble, ABCD is not serious cinema. Prabhu Deva is cool with his wacky moves but I couldn't find improvisation 'cause it gives you the old Television reality show look. More like a b-boy battleground this. Dancing has been little bit misinterpreted here. It has n number of plot holes and over that one gaping hole which could sink a ship. Clichéd, stylish, and subtle - that's what ABCD is. But, over all, I enjoyed it!\n\nBOTTOM LINE: A must watch for dance lovers and a fine entertaining watch if you don't get serious with the plot or story or acting. For everyone else, there's Special 26.\n\nOVERACTING ALERT: Ganesh Acharya & Dharmesh Yelande!\n\nCan be watched with a typical Indian family? YES\n\nLanguage: No | Sex: No | Nudity: Very Mild | Violence: No | Alcohol, Smoking: No | Drugs: Mild"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "sashank_kini-1",
        "review_rating": "6",
        "review_title": "Remo is a Dilletantish Storyteller But A Virtuoso Choreographer; With A Committed Cast Who Give Honest Performances, He Gives Us A Mildly Yet Consistently Entertaining Work",
        "review_detailed_main": "Remo D'Souza is a dilettante in the art of storytelling. He isn't able to proficiently explain and construct his character motivations and narrative respectively nor is he able to write something truly novel. His films' themes are predictable and visibly repetitive, his plots have hardly any complexity and both his works are I believe borrowed from Hollywood ideas (his first feature film disaster 'F.A.L.T.U' was the Hindi version of a 2005 movie 'Accepted'). The only difference between his debut attempt and sophomore effort is that the latter has its heart in the right place for the obvious reason that the movie is all about 'dance' and not some faltu 's.h.i.t' (those who've watched Accepted will get the pun).\n\nYes, Remo D'Souza is a dilettante in the art of storytelling, but he is doubtlessly a virtuoso in the arts of dance and choreography and with the perfect theme to complement his talents, he is able to put up a mildly albeit consistently entertaining work that has a clearer vision and cleaner execution than his dismally wonky 'F.A.L.T.U'. His cast in 'ABCD' also has a major role in realizing his vision successfully, mainly because the actors who played dancers are dancers themselves in real life and so they are able to understand their characters and their struggles much easily without looking too artificial or schmaltzy.\n\nABCD, acronym for Anybody Can Dance, uses the classic theme of competitive rivalry with Jahangir Khan (played by Kay Kay Menon) the pompous, calculative and ego-maniacal head of a prestigious dance academy clashing with Vishnu (played by Prabhu Deva), the former head choreographer at his academy who quits after Jahangir relegates him to desk-job duties just to accommodate a new foreign choreographer. Jahangir's monomaniacal ambition is to win awards, name, fame, money and personal glory and he heedlessly crushes anyone who comes in his way. Vishnu on the other hand believes that the best man should win, and so he leads life righteously and encourages his protégés to do the same. When Vishnu moves in with his old buddy Gopi (played by Ganesh Acharya), he discovers immense latent potential in some of the youth there and makes up his mind to teach them everything he knows for free. The motley of youngsters is divided into two rival gangs, one led by Rocky and the other by D; Rocky's gang is less tapori (street) than D's gang, and they are the ones who readily accept Vishnu's offer. Slowly, Vishnu's team builds with D's gang joining in first, then a few others in the locality and lastly Rhea, the lead dancer of Jahangir Dance Academy who quits after being fondled by Jahangir during rehearsals. Both the rival groups enter a national dance event similar to the popular Dance India Dance show (most of the dancers in the movie are former contestants of the show) and try giving their best shot at winning the prestigious title, but Vishnu's group has to overcome many obstacles on the way.\n\nA surprising thing about ABCD is that its story is'nt flat. I liked the way they used Ganesh Chaturti as an important motif in the film and was impressed by the manner in which Jahangir and Vishnu's ongoing rivalry parallels with Rocky and D's. There is a scene towards the climax of the film when we realize someone from Vishnu's group has switched loyalty and joined hands with Jahangir's group, and here we are kept in suspense for about a minute where we are keen to know whether the person whom everyone suspense indeed turns out to be the Judas. Well, I do not intend to reveal the suspense which is surprising in an effective way, and the entire sequence leading to the climax is well shot. My personal favorite dance sequence is when Vishnu's group perform dressed as clowns after being told off in the previous round that they were only selected to 'entertain like clowns and get TRPs'. The movie does drag in the middle and I feel it is because the screenwriters didn't have much in mind about what to do with all these dancers and so they added some uninteresting and trivial subplots that don't really add up to anything consequential.\n\nThe thing that's helped a lot in saving the film is the cast, which is quite likable. Everyone in the theater except me knew the dancers since I'm the only guy who doesn't watch Dance India Dance, yet I smiled often at the cast's peppy presence and genuine attempt at filling their roles; it shows that despite being paid comparatively marginal fee and having zero or little acting experience, these dancers at least bother trying unlike those mega- stars like Salman and Akshay Kumar who've being doing every new role on autopilot. I felt throughout ABCD that Prabhu Deva really cared about the film, and this could be seen in his performance; he is no Gene Kelly, he has little of Kelly's suaveness and charisma but in this particular film, his lack of screen presence works to an extent as his character is supposed to be selfless plus he does compensate for that in his lengthy but exciting dance number. Ganesh Acharya's casual charm made him noticeable but he has got to lose some weight. The dancers all try hard, especially the guy who plays the alcoholic (but his solo creeped me out) and bubbly Lauren Gottlieb whom I instantly recognized being a fan of So You Think You Can Dance. Kay Kay Menon has the best part in the film, and he shines during the movie's resolution which I won't reveal!\n\nThe title ABCD reminds me of the Pixar film Ratatouille; while the former doesn't explicitly state the relevance of the title, the latter does and the quote, which applies to ABCD goes like this: 'not everyone can be a great artist(or dancer), but a great artist can come from anywhere'. I am satisfied."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "Watch it essentially if you love dancing and watch it as a must if you don't!",
        "review_detailed_main": "Exploring a new genre of dance movies in Indian Cinema (earlier tried in the 80s with DISCO DANCER, DANCE DANCE & more) ABCD straight away comes to the point in its first scene itself featuring a dance competition. And then it takes you on to an energetic dancing journey right till its explosive climax where Lord Ganesha is remembered in a spectacular show on the stage.\n\nTo finish with its weaker points first, story wise ABCD may not have got anything novel or fresh to offer but execution wise it does have many exclusive firsts in its kitty, especially for the viewers who share the same passion of dancing in their real life. The film has music, dance and expressions written all over it and it keeps moving around these three things only woven with all the clichéd plots already seen before on screen in various films.\n\nBut if it has nothing new to offer then what is so special about this film which forces me to rate it as an essential watch for every young at heart living in India?\n\nThere is in fact more than one answer to the above question and they are all mentioned below as the merits of the film intelligently called ANY BODY CAN DANCE which interestingly gets an abbreviation as ABCD.\n\n1. First of all this is a film in which you have \"The Indian God of Dance\" Prabhudeva(acting after a long time) playing the Master of Dance only for a group of enthusiastic students eager to learn from him. And when Prabhudeva is there as the maestro himself then you are sure to get some exclusive, unbelievable and jaw dropping dance sequences on the screen like never before.\n\n2. Along with Prabhudeva, ABCD has also got another popular dance maestro Ganesh Acharya playing a dance teacher assisting Prabhudeva as a true friend to achieve his desired goal. The lovable act of Ganesh straight away wins your heart as its not easy to accept such a side role, when one himself is running a professional dance academy and considered a Master of the art in his own industry. Displaying this appreciable sportsman spirit, its indeed a treat to watch the two masters together on the screen in one frame.\n\n3. The third merit of the film includes all its stunning stage performances well supported by a breathtaking choreography, innovative cinematography and a dazzling technical show which superbly shines in 3D. Director Remo shows a tremendous growth in his second venture made on his most favourite subject and he does come up with an impressive show with many worth watching songs and dance sequences lead by the grand finale saying \"Bappa Moreya\" loudly. The film features almost all kind of dance forms and is sure going to be a great watch by the young ones who are into learning the art seriously. Here though I missed an instantly likable composition with some catchy beats in its songs but still the soundtrack of ABCD (by Sachin-Jigar) successfully impresses the viewer while watching it as required. Particularly I loved hearing the track, \"Duhaayi Hai\" & \"Saada Dil Vi Tu\" which are both rendered and filmed quite well.\n\n4. Now after these key points, in my opinion ABCD's biggest USP is that it features almost all the winners/participants of the famous TV show \"Dance India Dance\" who became famous in their hometowns due to their amazing performances on the show.\n\nHere director REMO thankfully found that vision, courage and spirit to bring all his young contestants of the show together in his own film made on dance. Therefore I consider ABCD as a valuable example set by him in the industry by acting like a responsible mentor, giving them the much required chance to showcase their skills on the big wide silver screen. This young brigade in ABCD is lead by Dharmesh and Salman along with many other talented names who show a commendable confidence acting with stalwarts such as Prabhudeva, Ganesh and KK, who is simply outstanding as the cunning, ambitious owner of a renowned dance academy.\n\nAdmitting the truth, yes as a film script one may find ABCD just an average flick made with great passion, highly inspired from the STEP UP series of the west. But as a special project collectively made by all the masters of the art together along with the young talent picked up from their own TV Talent shows, I would like to rate ABCD as an important film of the current times which actually shows us a new inventive way of making interestingly appealing films featuring the fresh talent.\n\nSharing the experience of watching it in the theater, it was really great to see ABCD with a group of young dance students sitting in the row ahead, who were really enjoying each and every dance movement on the screen with their energetic shouts, whistles and comments.\n\nAnd while its final song was there (in the end credits) with Saroj Khan, Prabhudeva, Ganesh Acharya and Remo dancing together on the screen in one frame, I just had a thought that if me and these young students are enjoying so much watching these masters dancing together, then what a good time they all must have had in shooting the whole project like an unforgettable picnic lived away from all the worldly pains and discomforts...........following only one common mission in mind and that's the passion of dancing.\n\nSo as I see it, ABCD is a zealous and appreciable attempt from all the dancing maestros putting their own students in the front, which deserves to be looked upon with love & respect by one and all. In short, watch ABCD essentially if you love dancing and watch it as a must if you don't as it may open your mind towards one of the most precious gifts of nature, i.e. The Joy of Dancing\u0085\u0085\u0085Cheers!"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "hardik-godelite",
        "review_rating": "7",
        "review_title": "ABCD Any Body Can Dance Movie Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "nbboss",
        "review_rating": "7",
        "review_title": "***Entertaining and Entertaining***",
        "review_detailed_main": "A great dance movie from the house of Bollywood, starring - non other than the Michael Jackson of India.\n\nSome excellent dance numbers with mind blowing performances. KK is as usual- spot on in his role. Some sudden twists in the plot, which make the movie even more exciting. Lauren is a great dancer, but she proved that she is a good actor too.\n\nIt's a different movie which has a story well presented along with some nice dance performances. It clearly reveals the hidden talent of India and proves that India can dance too. Hats off to Remo - for this brave initiative. He undoubtedly complied the movie with a clever brain & pure heart.\n\nA must watch for dance lovers!!"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "AnkitKukretiOfficial",
        "review_rating": "6",
        "review_title": "Story basis",
        "review_detailed_main": "I love the way Remo present the movie . But it can be present inmuch more better way"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "ajeetpanigrahi",
        "review_rating": "4",
        "review_title": "DO-If u love watching Dance.....DON'T- If u love watching Movies.",
        "review_detailed_main": "Well, after watching FALTU i didn't have the courage of watching a Remo D' Souza movie. But still it were my friends who bought the ticket and i had to go. I knew there wont be any story, direction, acting, etc. But one thing that everyone will find in it is Choreography. Remo is good at it.\n\nSYNOP-\n\nActing- KK Menon very good acting, or an average one seemed so because no body else new what the thing is acting. All rest of the actors(i doubt they can be called so) deserve 1/10. Prabhu Deva needs to learn the diction first. Also his much hyped dance was looking awkward in front of others. He was good but awkward.\n\nScript and Story- Well, after watching this movie, any one will say \" What the hell is this thing called Script\" lol.\n\nDANCE- The only thing in this movie that can pull the show and Remo has really worked well in the choreography of Dance Sequences. And to those who say that it is inspired from step up, buddy all the Dance movies are one and the same. And so is this movie.\n\nAs i said DO WATCH-If u love watching Dance...\n\nDON'T- If u love watching Movies...\n\nAlso i would add that in-spite of being a dumb movie, this movie is going to do good business, all credit to its Wonderfully choreographed Dance."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "priyadarshicivil",
        "review_rating": "10",
        "review_title": "Review of India's best Dance flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "nileshmandhan11",
        "review_rating": "7",
        "review_title": "A treat for people who are regulars of Boogie Woogie and DID",
        "review_detailed_main": "One can only like movie when movie fall into expectation band or go beyond. GO with dance/music and not for quality drama or acting. All tries their best to act and does just enough justice in movie to make it digestible and fillers for dance sequences where they beat all odds.\n\nExpected story flow but great music and moves brings life on screen. Remo has just got it right amount of humour, few scenes can be edited but wouldn't make difference. Though having huge number of great dancers across the country he didn't add any guests appearances to get oohhs aahs from audience which tells us he knew what he wanted to present on screen.\n\nCasting has most of dancers from DID (most of them were first seen in Boogie Woogie), who are undoubtedly very disciplined and great dancers. Starting dance at home, taking it forward on street, accepting challenge of competing at bigger platform and finally making it in a movie with delivering all their best is something immensely appreciable.\n\nQuite balanced amount of performances for all characters like Dharmesh/Salman/Lauren/Puneet No one gets extra limelight.\n\nPrabhudeva fits into the character with decent acting, you know him for dance not for his acting and he is bloody best in it. Lauren Gottlieb was like bonus in a movie. Intelligent choreography and honest attempt for showing quality of Indian dance on cinema.\n\nGo for making yourself aware of where we are heading in dancing and what talent we posses. This one belong all talented dancers who has struggled and delivered over the years and open doors for many more.\n\nInstead of comparing it with Step Up series, call it as Indian version of step up and just enjoy the treat. We have more variety of music and dances, hoping sequels to come in future with more dancers like Shakti/Binny/Raghav and obviously little champs."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "iamwhatiam8990",
        "review_rating": "2",
        "review_title": "Remo and Prabhu Deva, with all respect, please stick to CHOREOGRAPHY!!!!!",
        "review_detailed_main": "Well, this is totally my opinion of the so-called \"India's First 3D Dance movie\".\n\nBad story, horrible acting (especially Prabhu Deva), decent music and F.A.L.T.U direction. Dance was the sole winner in this movie.\n\nWhen Prabhu Deva speaks, I couldn't help but wonder \"what the hell is happening\". There were instances where I got furious too. Having said that, India's best and the most excellent dancer is Prabhu Deva. My respect. But this movie was more sort of a dance show! Though all the dance sequences were amazing.\n\nWhat I've learned and decided after seeing this movie is - No more watching movies directed by Remo! Waste of money and time. It's better to see a dance reality show :P\n\nStory - 2/10 Direction - 3/10 Acting - 4/10 Dance - 11/10"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "sachinsingh2005",
        "review_rating": "10",
        "review_title": "Must Watch for Dance Lover",
        "review_detailed_main": "Any Body Can Dance (ABCD) was awesome movie for all dance lover...I really appreciate a hard work done by remo d'souza. must watch :)\n\nAll are good in this movie and specially prabhu deva dance is super to watch.\n\nRamesh sir and others are super duper and dance also awesome done by these people.\n\nStory is not bad and D, Chandu and other character done great work with this movie and have respect after watching by people.\n\ngood steps taken by dancers and we can also wait for future if remo d'souza direct any other dance movie."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "kishan1093",
        "review_rating": "6",
        "review_title": "Its an exceptionally nice dance flick in Bollywood.. Gripping",
        "review_detailed_main": "Without any doubt, this can be called the best movie in Indian Cinema which involves dance of the 'awesome-st' quality. This is the one most significant thing you will find in this movie which will keep you stuck to your seats. Its a nice work consisting of some of the best dancers on TV.\n\nAlthough one cant help but notice that the theme is quite similar to Hollywood movies such as 'Step Up', ABCD has a story line and plot which captivates the audience by depicting it in an 'Indian' way.\n\nThere can be overacting that is evident at times, along with a few flaws. But even in spite of that, the dancers in the team of ABCD has done an exceptionally good job in this movie. The dance performed by Prabhudeva adds to it, of course.\n\nThe screenplay and dialogues are no good. But then again, it proves to be a great entertainer which goes with the theme of the movie.\n\nI enjoyed it a lot. Most definitely a one time watch...!"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "Amit1541994",
        "review_rating": "1",
        "review_title": "ABCD =indian step up 2",
        "review_detailed_main": "average movie with average acting ab=nd copied script. want to see a special movie go for SPECIAL 26 ,\n\nCast\n\nPrabhu Deva as Vishnu Ganesh Acharya as Gopi Kay Kay Menon as Jehangir Khan Terence Lewis Lauren Gottlieb as Rhea Pankaj Tripathi Dharmesh Yelande as De Salman Yusuff Khan as Rocky Saroj Khan in a special appearance ABCD: Anybody Can Dance is a 2013 Bollywood dance film and the first of its kind in India to release in 3D. It is being directed by Remo D'Souza and produced by Siddharth Roy Kapur.[1][2] It stars Prabhu Deva and Ganesh Acharya in key roles. The participants of Dance India Dance also essay central characters.[3] Along with the Tamil dubbed version titled Aadalam Boys Chinnatha Dance"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "pradeepghora0",
        "review_rating": "7",
        "review_title": "Bollywood first dance movie...",
        "review_detailed_main": "The movie is very good. As compare to a dance movie the dance is little low. But overall it's a Good movie. It is the first Bollywood movie based on dance. Or we can say a Bollywood dance movie. For the first movie i can say a Good starting. The story was quite good. The main fact of the movie is all the dancers act in the movie . They all are from a Indian dance show Dance India dance. As a dancer acting in a movie is quite difficult. But they did a fabulous job. And it's not a copy of movie step up. Add many people says. All three dance are good and impressive. But the last dance is the best. The last scene is quite sentimental also. But it's a Good complete movie. It will be a Good inspirational movie for the dance lovers . Or who want to be a dance. And also for the people live in backward areas a Good inspiration. The second part of the movie is releasing soon. I hope the movie will be more better than the first part. It's a must watch movie. At least one time watch. The movie deserve quite better rating Than its current rating."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "ahegde3149",
        "review_rating": "4",
        "review_title": "Just for dance lovers",
        "review_detailed_main": "To begin I would like to appreciate Remo for his effort and bringing the Bollywood audience something new. I know this is much like the Hollywood \"Step Up\" flicks of which I am not much of a fan and I don't think I am fan of this one either. The only thing enjoyable here are the dance sequences and music, minus that we have a fill of poor acting, screenplay and dialogues. The story clichéd and predictable. The cheap 3D usage with all those pointing sticks and pipes was evident even if I saw it in 2D. Overall, if you ignore the elements of good film and just focus on the dancing you will have a good time. I mean, even I enjoyed watching the Prabhudeva light up the screen with his wacky moves! and Remo's choreography is always fantastic. Still, I cannot say ABCD is a good film.\n\nRATING: [2/5]"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "rinkuhimi819",
        "review_rating": "9",
        "review_title": "Really a good movie.",
        "review_detailed_main": "I was impressed by the presentation of the movie including the dance and music. I got the feeling that I am watching a Hollywood movie.\n\nI was expecting movie like Step Up series but I could clearly say that it gives a blow to Step Up. It was bit above step up. The VFX, SFX and Sound effect are too good and can be compared to Hollywood.\n\nThe only negative point in the movie (in 3D) was about the camera focus. The camera focus is not properly and cause a headache to me. In Some Part (in clip when Dill Se appears) it was too bad even worst in some dance steps.\n\nOtherwise movie is awesome and i will give it 9/10. You can say that movie is \"Full Paisa Vasool (got full value for money)\""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "himanshujn-55265",
        "review_rating": "1",
        "review_title": "Hyper cringe",
        "review_detailed_main": "You can use this movie to torture someone. Audience target -chapris You will try to break your screen after watching this movie."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "alwaysplanb",
        "review_rating": "8",
        "review_title": "Gr8 Indian Dance Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "Buddy-51",
        "review_rating": "3",
        "review_title": "ABCD - the title tells you all you need to know about this simplistic movie",
        "review_detailed_main": "Even with all the considerable resources of color and choreography that Bollywood customarily brings to bear on its productions, \"ABCD: Any Body Can Dance\" has no more depth, maturity or sophistication than its American dance- film counterparts like \"Step Up\" and its sequel \"Step Up 2: The Streets.\" And it's a lot more cloying and lengthy to boot.\n\nPrabhu Deva stars as a mopey dance instructor - who can be a bit of a drama queen when things don't go his way - who takes on the task of whipping a group of high-spirited but decidedly undisciplined youngsters from the \"ghetto\" (which looks only a shade less affluent than Beverly Hills) into a presentable troupe in time to compete on an amateur TV dance program.\n\nIt's all pretty much paint-by-numbers as Vishnu (Deva) takes his charges through their various stages of readiness, with teeth-rotting cutesiness and thumb-sucking childishness the order of the day. The dancing's okay, I guess, but, I seriously think it's time for Bollywood to grow up a little and stop pandering to this apparent need on the part of its audience for emotional primitivism all the time. As one character, in a rare moment of honest self-reflection, says about the entertainment industry in India, \"Mediocrity is king.\" Truer words were never spoken."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "iamvibh",
        "review_rating": "5",
        "review_title": "A Nice treat to hardcore dance fans but fails while delivering plot and performances.",
        "review_detailed_main": "If you love watching dancing reality shows,then ABCD is for you. as your favorite dancers have assembled to treat you with this dance flick.The movie fails while delivering the story and story has too much resemblance to first step up movie. The dancing sequences are the only scenes when the movie is nice to watch.Kk Manon has justified his character and only performer when it comes to acting .Movie has too much flaws and crunches and the 3d is nice especially the dance sequences while raining .Lauren is gracious to look .Expecting more of her in bollywood and salman,dharmesh has a nice attempt.\n\nVerdict:- An average storyline with some heartwarming choreography."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "ketgup83",
        "review_rating": "9",
        "review_title": "ABCD is the bible for dancing which will entertain right from the beginning till the end.",
        "review_detailed_main": "I have always believed that music has no boundary. After watching ABCD , my saying has changed and I would say that dancing \"pumps up your heartbeat , refreshes your mind and will make you forget about all the pain in life\". Any Body Can Dance is the bible for dancing which will entertain right from the beginning till the end.\n\nA brilliant choreographer is fired by his own company after they claim that his dance skills are old-fashioned. To prove his mettle , he starts his own company by hiring group of wanna-be dancers and even some local goons.\n\nDirected by Remo ( FALTU) , ABCD takes you by complete surprise with excellent presentation of dancing skills and beautiful choreography. Remo , being a great choreography himself, does a superb job as director making sure that film is made with universal appeal. The story line is strong with Prabhudeva being the soul of the film. Watch for him dancing extensively in the disco scene and you will know he is one of the best dancers in the country. Screenplay is tight keeping you engaged. Cinematography is eye-catching capturing the wonderful choreography with ease. Editing is crispy. Dialogues are good. Background score gels well with the flow of the film. However , I felt music could have been better considering it to be a musical movie. Barring tuneful \"Bezuban\" with wonderful picturization , other songs were average. Kay Kay Menon did fine job as a shrewd as Jahangir Khan. Other performance were nice.\n\nOverall , ABCD was heart-wrenching dance movie which will leave you spellbinding with excellent dance moves and eye-catching choreography. Excellent 4.5/5"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "r96sk",
        "review_rating": "5",
        "review_title": "It's very much dance routine first, film second",
        "review_detailed_main": "Cool title, but that's as good as 'ABCD' gets.\n\nIt's very much dance routine first, film second. They really do disregard any attempt at a proper premise, instead putting full focus on dance. In fairness, that's all the majority who choose to watch this will likely want. Still, they could've tried harder with the plot; which hits almost every cliché/trope imaginable.\n\nThis might've made for a fun/silly 90 minute production, but at 136 minutes it's a very long watch - it proper dragged, for me anyway. I was OK with events until the ending, which is awful from a story point of view. That's unfortunate, as it is actually set up well with a hearty event - the performance for which is nice, but it quickly loses any momentum that it created from it.\n\nPrabhu Deva (Vishnu), while likeable, isn't lead-worthy in my opinion - he doesn't bring anything memorable or noteworthy to the role. Ganesh Acharya is alright to watch, he brings the amusement as Gopi. None of the dancers stand out, away from their dancing anyway.\n\nA disappointment in many ways for me, though you may like this if you're in search of a film filled to the absolute brim with dance."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "arijit-pritamzoro",
        "review_rating": "10",
        "review_title": "Brilliant stunts..Brilliant Dance...much needed movie in Bollywood",
        "review_detailed_main": "ya..it's a old story with new wrap..ya some people don't know what acting is..but you know what the truth is...they don't need those things..because they have DANCE..STUNTS... and A BRILLIANT ART...ABCD is one of the most needed film in Bollywood...no one ever care about why a song is so beautiful when you see it in big screen..DANCE...AND THIS WHAT ABCD TEACH US.. ABCD IS A BRILLIANT FLICK OF DANCE ,STUNTS ...3D effect is brilliant in dances mostly...of course you can't expect to be resident evil 3D level..but ya it's good...the most attractive thing was Music..perfect music in perfect dance...each and every one were good...many people say why it's so brilliant if the idea is a copy of step up...???..But there is a difference..every dancer have his/her own style...and you gonna hate his/her look..but you can't avoid Dance... i'm not a dancer..or regular dance program watching people..but i impressed with the effort of Remo desuza and prabhu deva...amazing.... IT'S A TREAT FOR EVERY ONE.... 10/10...FOR EFFORT..FOR A MUCH NEEDED FILM .IT BRINGS BOLLYWOOD TO ANOTHER LEVEL...."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "dfgremnants",
        "review_rating": "5",
        "review_title": "Skip to the Dance Routine",
        "review_detailed_main": "As a avid fan of the Step Up series, I am open to watching dance movies and I am adjusted to the plot hole issue. In dance movies there is always something that doesn't add up. I agree that even Step Up series has its own set of problems but I should mention that ABCD did try their best.\n\nIf you just judge this movie based on the music, dance routine and overall look, it will be awesome, simply one of the best from Indian Cinema but if you add the other factors it just goes down.\n\nBut then again, their is still hope for future movies. Also, I did watch Special 26 it was great. But it doesn't have the unity factor that this movie aims to highlight and showcase."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "5",
        "review_title": "Only dance",
        "review_detailed_main": "Remo desouza forgot that this is actually a movie and not a dance show. For this he forgot to bring any story or write any script. Mute animals have more expressions than the actors acted in this movie."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "stillbonamit",
        "review_rating": "10",
        "review_title": "I was impressed by the presentation of the movie including the dance and music.",
        "review_detailed_main": "I was impressed by the presentation of the movie including the dance and music. I got the feeling that I am watching a Hollywood movie.\n\nI was expecting movie like Step Up series but I could clearly say that it gives a blow to Step Up. It was bit above step up. The VFX, SFX and Sound effect are too good and can be compared to Hollywood.\n\nThe only negative point in the movie (in 3D) was about the camera focus. The camera focus is not properly and cause a headache to me. In Some Part (in clip when Dill Se appears) it was too bad even worst in some dance steps.\n\nOtherwise movie is awesome and i will give it 9/10. You can say that movie is \"Full Paisa Vasool (got full value for money)\""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "anjali-singh7",
        "review_rating": "5",
        "review_title": "Too much of dance",
        "review_detailed_main": "You have dance in the movie but there is no story. A good dance can be accompanied with the better flow to make the movie memorable. In terms of acting the supporting actor has done a better job as compared to the main cast. Instead of randomly putting a dance in the movie it should be combined with suitable succeeding scene. The story which is been decided for prabhu deva does not fit in. As the way it is been shown is shrewd way but at the end his motives were nothing to do with the stealing of money. Abetter direction is needed the movie is elongated in the unnecessary way.\n\nOverall to see the various dance steps anyway you-tube videos are available"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "akhil-panwar06",
        "review_rating": "10",
        "review_title": "Best Dance Movie",
        "review_detailed_main": "Best dance movie i have ever seen.Step up sucks man.This is the power of India and the power of dance.Amazing movie with awesome dance I gave it 10/10 because i have never ever seen such entertaining movie in my life.The dance moves were amazing and the story is also very good.Prabhudeva's dialouge delivery is like oh no why is he acting in a movie like this.But who cares the dance is amazing and the songs are bloody awesome!!!!!! Direction is good Keep it up Remo The cast is very good and are very good dancers.Lauren Gottlieb was the pick of the dancers. Dharmesh's acting is as good as his dancing skills\n\n10/10 from me"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "SBcriticImdb",
        "review_rating": "3",
        "review_title": "Why? Why? Bad! Bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "calhobbes99",
        "review_rating": "5",
        "review_title": "Great potential, didn't quiet reach the heights it could",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "dineshprakash",
        "review_rating": "9",
        "review_title": "A foot tapping, refreshing and heart touching film",
        "review_detailed_main": "Score 9/10 Director and Choreographer Mr.Remo D' Souza has done a very impressive job. He is the story writer of film also and story is good. You will get goose bumps while seeing them dancing, credit should be shared by Choreographer Remo D'Souza also. Crescendo of film is very good. It goes high, high and higher in all aspects. Hats off to director Mr. Remo D'Souza. Film is very vibrant, even the fight is colorful. Screenplay by Tusar Hiranandani is smooth. They slightly touched the sensitive issue of drugs also, which gels with script. Your eyes get moist in emotional scene and widely open to see their dance. Dialogues by Amit Aryan is very good. This film could have been very small but it is big in every way, rather it is in 3D, or cinematography, graphics. It has only lack that is star power but if you go in then you won't regret or feel need of any star. Performance wise Mr. Prabhu Deva is very impressive and emotive. Surprisingly Mr. Ganesh Aacharya is very good. His comic timings are just like any veteran comedian. He makes you laugh even without dialogues, only with the help of his expression. Kay Kay Menon is good. All other actors are very good but they are in lot so I am requesting to excuse me for not mentioning every one name but you all rocked guys. A person who performed in discotheque scene, in some robot style dance, is as good as Mr. Prabhu Deva , even in his brief performance. I would have loved if they invited some known choreographers as Judge in the dance show. Music and background score by Amit-Jigar is good. It keeps the film pace moving. Lyrics by Mayur Puri is good. Any Body Can Watch it and would love it."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: ABCD",
        "review_detailed_main": "You'd wonder why it took so long before Bollywood finally came up with its own dedicated film about dance. With dance incorporated into just about every film, perhaps that was reason enough not to have a movie that dwells within the confines of a dance premise, which the US has in its Step Up franchise and UK with its StreetDance equivalent. But the lucrativeness of these franchises mean untapped opportunity, so why not make one and dabble with the 3D technology as well? The result is the aptly titled ABCD - Any Body Can Dance, because if anything, every character here does show off a thing or two, of the rhythm within.\n\nAnd not to mention the success of the wildly popular Dance India Dance television series that also made that final push for box office potential, with some of the participants also making it to the film in leading roles. The storyline by Tushar Hiranandani is kept functional, and really simple. After all, all you need is an excuse to assemble a crew, and have them put through the paces in rehearsals and competition whether underground or official, to have highly choreographed item numbers to thrill the movie going audience. It begins with the rivalry within Jahangir Khan (Kay Kay Menon) and Vishnu (Prabhu Deva), the brains behind JDR, a dance troupe who is once again crowned champions in the nationwide Dance Dil Se competition, only for the former to kick out the latter through the employment of foreign talent.\n\nIt took a while before things started to pick up, because of the necessity for Vishnu to go through the motion of moping about what he should be doing, whether to go back to Chennai and continue teaching dance, or hang around in New Delhi to take another potshot at Dance Dil Se, with a vastly different crew. And helping him assemble something is good friend Gopi (Ganesh Acharyaas), although the members they finally get into their troupe are hardly any professional to begin with.\n\nLike any self-respecting dance movie, this is again the requisite characters necessary to impart values like teamwork, camaraderie, trust, loyalty, and more essentially, dance skills through various training montage. And having a rag-tag crew also allowed little subplots to creep in, such as romantic rivalries, parental objections to all things modern and deemed destructive to culture, envy, melodrama, and drug abuse even, that allows individual characters their respective share of the limelight, given so many supporting ones who will inevitably fall by the wayside.\n\nAs far as competition goes, we don't really get to see much of JDR in action, especially since they're progressively turned into a balletic outfit courtesy of their new choreographer from the US imparting something that's quite lacking in the imagination. After all, they're an outfit who are dancing to impress, moving away from Vishnu's, and their original philosophy of dancing to express. So we follow DDR for the most parts, in watching how Vishnu whips up a motley bunch into a well oiled machine able to take on some of the best, especially with its inventive choreography.\n\nWhich in truth belonged to the multitude of choreographers that Bollywood is no lack of, providing an opportunity to showcase various dance forms through DDR's execution and their march towards the finals of the Dance Dil Se competition. Even Prabhu Deva playing Vishnu has to put his foot where his mouth is, given once central spot before the interval to dance and demonstrate a thing or two why he is and still at the top of his game. Unlike the Hollywood counterparts, the camera-work and editing here all combined seamlessly in providing the audience with the best possible vantage point in which to observe the dance and dancers, and nary did any put on the wrong foot such that you'd miss something crucial to their movement. It's only a pity though that there's no screen in Singapore showing the 3D version, as you can tell that deliberate care has been taken to craft this for the 3D medium.\n\nWhile some dance choreography and sub-plots may have already been suspiciously experienced before in other films, there's no doubt that the key ingredient to the film's success is its ability to blend culture into dance, which will whip up any audience into a frenzy. And I suppose that is the key message, that while things we share and experience can be universal, culture is what will truly make a people stand out and differentiate themselves for the better. And in this case, if others can make a dance film, so can India, and doing it even better! For those venturing into dance movies fo the first time, ABCD should be on the top of your list, and for fans of dance movies, this is something you'll not want to miss!\n\nP.S. It's interesting to note that besides the Smoking is Injurious to Health warning at the start of every Bollywood movie of late that features scenes that have characters smoking, a little warning also appears at the bottom of the screen just when the deed is about to be done!"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "atiyaahsan",
        "review_rating": "8",
        "review_title": "Must watch for every dance fan out there...!",
        "review_detailed_main": "Before watching this movie, I'd read some awful things about it that how it's nothing but a rip-off of Hollywood's Step-up movie franchise. I decided to watch it just the same as I am an avid dance fan, and let me tell you I'm really glad I did. Not to put the step-up movies down or anything, but of late they've become a canvass for showcasing done-to- death dance sequences without paying much attention to the story- line/script or even acting (case in point Kathryn McCormick as the female lead in the last step up movie, Step Up Revolution). This movie, although it started out like any other \"jilted-dance-teacher-changes- the-fate-of-some-down-trodden-dancers\" film, but as the story progresses, it develops into a moving and at times pretty funny film and you can't help but become emotionally invested in the characters. Some of the acting performances were extremely commendable especially Kay Kay Menon as the proverbial scornful yet comedic villain out to get the little guys, as well as Ganesh Acharya as Prabhu Deva's trusted and humorous side-kick. I was particularly amazed by Lauren Gottlieb's Hindi-speaking skills. For those of you who don't know her, she was a contestant on the American T.V series \"So you think you can dance\". At first I thought somebody had lip-synced for her, but then I found out I was wrong. Seeing as how she has no background knowledge of the Sub- continental culture or language, I thought she did a surprisingly good job. There were a couple of songs you won't be able to get out of your head,( \"duhayi\" and especially \"bezubaan\") not just because they're catchy but because their background story is so deeply stirring that they get seared into your brain. As far as the dance sequences themselves are concerned, they're nothing you haven't already seen in any typical Hollywood dance film. Save for a couple of solo performances like Rocky's (Salman Yusuff Khan)and especially Chandu's. I was also pleasantly surprised by the free- running/ parkour sequence in the beginning that was superbly choreographed and well executed. In short, this is one movie you won't be sorry to see, watch & enjoy...!"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "adithyanelangovan",
        "review_rating": "8",
        "review_title": "worth watchable",
        "review_detailed_main": "once again prabhu master proved himself.its a old wine in a new bottle named as 3d.u can c some of the resemblance of step up but this movie should be praised for its brilliant efforts which shows many type if dances (example:prabhu master performing in interval sequence) and the film don't loose its grip till the end.The movie is full of dance dance and dance so don't look for acting just look for the dance.remo did a splendid work as a choreographer as well as director mainly the climax performance i bet u will surely dance in the climax performance.There are many number of people in this movies usually the movies having more number of casting will make u tuff to remember them but in this movie u will remember each and every character not by their face or acting but u will remember them by their dance.The cinematography and background score was the major backbone of the movie at last those who love dance will love this movie and those who doesn't love dance will start loving it"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "pipersaniyaankit",
        "review_rating": "10",
        "review_title": "Must Watch (if you love dance)",
        "review_detailed_main": "Finally after a long waiting time a good movie in Bollywood. I am a Dance loving person and I didn't expect such a wonderful movie from Indian cinema(as it is the first dance movie of Bollywood). Great work of Prabhu Deva and Remo D'Souza's Team. ABCD is a full package with comedy, emotion and of course Dance. Prabhu Deva Dance performance was stunning(truly in Prabhu Deva style).\n\nthe reason why I liked this movie just because of true creativity. the last performance was awesome and they promoted our common ganesh visarjan and wedding dance. However in some part of movie they have copied many scenes from old Hollywood movies but finally it was entertaining and that's the whole point is.\n\nI will say to must go movie as you can enjoy it in big screen only."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "vijekrishnan",
        "review_rating": "8",
        "review_title": "Good attempt by Remo",
        "review_detailed_main": "Once I watched the film the only feeling that came over me was \"Pride\". I was proud that India could make a music and dance oriented film without messing up the entertainment and logic factor of the audiences.\n\nAlthough it is not a \"Dirty Dancing\" or a \"Singing in the Rain\" however what it manages is to keep the viewer interested with a good plot, superb dancing and good music. There could have been no one other than Prabhu Deva who could have played the role of \"Vishnu\" with so much conviction. Kay Kay Menon was great as usual - Give this man anything and he can do it. For that matter Kay Kay is in a different league as an actor along with others like Manoj Baypayee, Nana Patekar, etc.\n\nIt is so good to see that all the others in the star cast managed to put up such great performances despite being new to the big stage of the Bollywood. It is surprising that some of them even managed to act better than our seasoned plastic faced Bollywood actors. Only if we Indians would give more value to acting skills rather than good looks then these youngsters would have a great career ahead of them. I firmly believe that good acting belongs to the theaters and films and good looks belong to the modeling world.\n\nOverall a good film and should be watched for the sake of all the great artists who put up a good performance in the film along with the film crew and the director."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "paulsmithson-192-243826",
        "review_rating": "8",
        "review_title": "Great feelgood movie",
        "review_detailed_main": "If you love dance you will love this film. If you don't like dance then the chances are you're unlikely to pick a movie called 'Any Body Can Dance'.\n\nLots of dance movies such as Flashdance and Dirty Dancing are, to a greater or lesser degree, feelgood films, and this is no exception.\n\nThe story is pretty typical. I won't go into any detail here as I don't want to spoil it for those who have not seen the film yet. However, by typical I do not mean it is bad in any way. It definitely isn't. By typical I pretty much mean it is the kind of story I want from this kind of movie. It is a formula that works, and the way the story unfolds in this movie is both satisfying and entertaining.\n\nThere is some great cinematography ranging from the way some of the dance scenes are shot through to great skyline shots and just a general attention to detail when it comes to camera angles and visuals that work well.\n\nI felt the acting was excellent and everyone played their parts superbly.\n\nBut for me, the highlight of the movie was the dancing - and that is how it should be. It was vibrant, exciting, colorful, sexy, and superbly choreographed. If there's one thing a Bollywood film should be able to do well it is a large scale dance scene, and ABCD certainly doesn't disappoint in any way.\n\nAll in all a great movie that will prove a hit with anyone who loves a feelgood movie filled with dancing. It scores a well deserved 8/10 on both counts."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "Satyrlil",
        "review_rating": "9",
        "review_title": "Some things, simply cannot be expressed with words",
        "review_detailed_main": "Well, as the summary above says. I find it very hard to express what I feel after watching this movie.\n\nHowever, since I'm writing a review, here are a few words.\n\nDancing: 10/10 This movie offers the variety and the quality. I could hardly point any repetitions, and that's says it all in a movie with so much great moves!\n\nStory: *can't grade a taste* Well, with that being said, I personally, really loved the story. It's not too original, but certainly shown in an interesting way. Moreover, I watched the whole movie \"in one breath\" (and it's about 2.5 hours long).\n\nCharacters: 8/10 I can't presume to know about the country and/or it's people, certainly not on a level to judge the originality or reality of the characters. Something I can say however is, Everyone will find someone to connect to. *lost 2 points simplicity for some semi-main characters.*\n\nTotal: *check whats in the summary (the title of the review)* As noted above, can't express with words. That in itself says something. Feelings. Isn't that what a good dancing movie is all about? If you love dancing.. And not afraid to feel - Give this movie a chance. You won't be disappointed.\n\nHave fun!"
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "manavsingh655",
        "review_rating": "8",
        "review_title": "Dance is Powerful.Dance unites.Dance is all about faith,but ABCD(Any Body Can't Dance) like this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "sshogben",
        "review_rating": "8",
        "review_title": "'Liberation' for India's film dancers – and choreographers!",
        "review_detailed_main": "For a nation whose film industries have traditionally thrived on lush use of dance in its cinema, it is honestly shocking how so few of India's movies focus directly ON dance. All too often, a choreographer's duty is to distract the audience from the fact that a movie's lead actor or actress cannot actually dance. Even when a lead actor can dance well, backup dancers are usually there just to provide colour and fill out the screen. The dancers are always there, but we do not 'see' them.\n\nThus \"ABCD Any Body Can Dance\" arrives like a breath of fresh air!\n\nHere dance and dancers take centre stage – not just as magic elements in and of themselves, but as a celebration of the power of art and dance to draw people together and transform lives.\n\nVishnu (Prabhu Deva), the longtime choreographer of India's most successful professional dance group, gets cashiered by his ambitious and domineering partner Jehangir (Kay Kay Menon). Vishnu's career seems over. He feels like giving up. But on his way out of town, he spends a few last days with an old friend, Gopi (Ganesh Acharya), a retired dancer who ekes out a small living teaching dance in a not-very-fancy neighbourhood. Through Gopi, Vishnu becomes impressed with the sheer raw talent he observes among an assortment of apparently dead-end street kids whose lives are limited by their inability to get along with each other, their parents, or anyone else. He volunteers to teach these kids dance for free, determined to change their lives through imparting Discipline, Attitude, New(ness), Confidence, and Expression. In the process, Vishnu manages to rebuild not just his own life and those of his students, but even his old friend and later nemesis Jehangir.\n\nSome of India's greatest living dance choreographers came together to make this film happen.\n\nPrabhu Deva himself, of course, is not only a celebrated choreographer (for instance, the National Award winning 'Main Aisa Kyon Hoon' straightjacket dance from \"Lakshya\" (2004)) and commercially successful director (such as \"Wanted\" (2009) and \"Rowdy Rathore\" (2012)) but also probably India's best pure dancer.\n\n(My biggest gripe? Tamil native Prabhu Deva's voice is badly dubbed, in a heavy baritone that suits neither this character nor his own personality.)\n\n\"ABCD \u0085\" is directed by famous choreographer Remo D'Souza, who also wrote the story.\n\nGanesh Acharya is so sincere and charming as Gopi in this, his acting debut, that he almost steals the movie. (The elephantine but surprisingly-light-on-his-feet Mr Acharya, despite his bulk, is best known for choreographing sexy item numbers such as 'Sheila' in \"Tees Maar Khan\" (2010) or 'Chikni Chameli' in the 2012 \"Agneepath\".)\n\nIndia's all-time most honoured choreographer – the legendary Saroj Khan herself – dances a cameo over the end credits with Mssrs Remo, Acharya, and Prabhu Deva. Terrence Lewis and Shiamak Davar also contributed to \"ABCD \u0085\" and are thanked in the opening credits."
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "sheriefryan",
        "review_rating": "10",
        "review_title": "Great movei",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2321163",
        "movie_name": "ABCD (Any Body Can Dance)",
        "movie_rating": "6.3",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "Dance to express!!",
        "review_detailed_main": ""
    }
]