[
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "paulwattriley",
        "review_rating": "4",
        "review_title": "Sunday Afternoon Movie",
        "review_detailed_main": "Not all that good but possible worth a watch on a rainy Sunday afternoon."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Seth_Rogue_One",
        "review_rating": "6",
        "review_title": "Flawed but watchable",
        "review_detailed_main": "Despite of a cast with some really big names such as Anna Kendrick, Bryan Cranston, Christopher Mintz Plasse, Marcia Gay Harden, Jorge Garcia, John C McGuinly, Brandon T Jackson, Ravi Patel this was filmed in 2012 but it was not released until 2016.\n\nOnce you've seen it it's not terribly hard to see why, it tries to squeeze in a little too much than it can handle in a very short running time (74 minutes without credits) to the point that it get a little confusing at times.\n\nWhich it's definitely not meant to be as this is meant to be a easy going comedy influenced by 80's coming of age comedies but set in present day.\n\nBut it's far from all bad though, there are some seriously funny stand-alone gags and Miles Teller is a pretty good lead and I could have swore he was John Cusack's son (he sure looks like it).\n\nIn the end I kind of enjoyed it but I felt like it should have been a lot more fleshed out, not sure if perhaps it was longer at some point and the studio mercilessly cut it down because they felt like it didn't have enough substance to be a 100 minute movie or whatever.\n\nWhich caused it to often lack coherence and flow, whatever it may be despite it's flaws I definitely didn't dislike it, it helps if you like the cast, just don't expect a big movie experience.\n\n5.5/10"
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "so many good actors",
        "review_detailed_main": "Will Davis (Miles Teller) and Jillian Stewart (Anna Kendrick) are a recent graduate couple with jobs lined up. It's an overconfident generation where every little accomplishment is greeted with rewards. Will's first paying job at LA Weekly is greeted with downsizing. He and his roommates are weed-smoking video-gamers. Luke (Brandon T. Jackson) starts at a trading firm. Ethan (Christopher Mintz-Plasse) has a questionable internet idea. Charlie (Nicholas Braun) is a teacher. Will gets a motel night manager job and quickly gets fired. His dad (Bryan Cranston) also gets downsized and faces the new landscape. Tanya Sellers (Alison Brie) is an inappropriate manager and Katherine Dunn (Marcia Gay Harden) is the strict VP.\n\nThere are so many good young actors and skilled veterans in the cast. None of the characters are worth rooting for. There are too many of them and with too many stories. There are lots of attempts at humor but few actual laughs. It has to be the fault of the writers and director. Even the basic premise of a generation of underachievers being rewarded is questionable. Neither Will nor Jillian is presented as slackers. Ethan is delusional and only Charlie truly fits the premise. In fact, Charlie brings the premise to its conclusion. This is so scattered that nothing sticks. If these actors weren't so good, this would really suck."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "lnvicta",
        "review_rating": "2",
        "review_title": "Should have never been released.",
        "review_detailed_main": "Let me start by saying that everything in Get a Job is atrocious except one thing: the acting. If these stars weren't attached to the movie nobody would bat an eye at this thing. It's so awful. I audibly \"ugh\"-ed when it finished. The message this movie tries to convey is that it's hard to find a job, so you have to stop smoking pot and be determined and never give up and do whatever it takes to get a job. Or don't get a job and be an entrepreneur. The movie throws that one in at the end. A stupid message in the first place because, hey, not everyone has the same circumstances. This type of movie can only resonate with a niche crowd, but worse than that the writing is just dreadful. Cringe-City is what this movie should've been called. I felt bad for Miles Teller having to deliver these cliché lines like, \"Never stop believing.\" Sorry Get a Job but I learned that lesson from Journey a long time ago. Bryan Cranston and Alison Brie try to have fun in their roles, and they really brighten up the mood, but it isn't nearly enough. Anna Kendrick is forced into this shell of a character who gets fired and can't get back on her feet so she succumbs to the evils of weed and laziness. When Anna Kendrick can't be adorable for every second she's on screen, then you know you have a problem.\n\nThe problem is literally everything else. The writing, the directing, the editing, the f*cking music, it all SUCKS. It's painful. It's one of those movies where you know if the actors weren't already attached to the project, it would've never been made. But the money was there so they hired great actors and they forgot about the rest of the crew so they got people on the street to do direct and their pet cat to write and who needs an editor anyway? The cat can do it! It's like an amateur film at points. I'll be honest, I chuckled a couple of times. And by a couple of times I mean it. I chuckled twice. Maybe smiled a few more times, but for a majority of Get a Job I was either cringing or frustrated at the fact that it was even greenlit and released. This movie... just...\n\nUGH."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "dave-mcclain",
        "review_rating": "6",
        "review_title": "\"Get a Job\" is a flawed, but charming and significant movie.",
        "review_detailed_main": "Get a job! It's a simple sentence, but it gives rise to many difficult questions. (What kind of job do I want? Where do I look to find the right one? How do I get them to hire me?) And then, when you get a job, there's another set of challenges. (How do I do this job? What indignities am I willing to suffer to keep this job? When do I move on and try to get a better job?) Sometimes, the job you get doesn't work out and you have to start asking those same questions all over again. An all-star cast of well-known movie and TV actors deals with these issues – and others, in the well-titled comedy \"Get a Job\" (R, 1:23).\n\nWill (Miles Teller), Ethan (Christopher Mintz-Plasse), Charlie (Nicholas Braun) and Luke (Brandon T. Jackson) are pot-smoking, video game playing L.A. housemates who have recently graduated from college. The four of them, as well as Will's girlfriend, Jillian (Anna Kendrick) are at various stages of trying to figure out how best to make money in the world of grown-ups. Charlie is about to start a job as a junior high school science teacher (for which he seems quite unqualified) and basketball coach (ditto). Luke's dream is to work as a stock broker, but his entry-level position working in the firm managed by Mr. Diller (John C. McGinley) has Luke taking orders for just about everything but stocks. Ethan believes he's going to make his way in the world by developing and selling a smart-phone app called \"IstalkU\".\n\nBut the main focus of the movie is on Teller's character. As the movie opens, Will believes he has turned two summers of unpaid interning at the L.A. Weekly into a full-time job as their new tech writer\u0085 until one of the editors (John Cho) tells him differently. Will gets a job as a night-shift desk clerk in a cheap hotel run by an unscrupulous hotel manager (Marc Maron), but that job only lasts until local pimp \"Skeezy D\" (Jay Pharoah) messes things up for Will. Surprisingly, however, Will's association with Skeezy D indirectly helps him secure a great job as a videographer for a firm which producers video resumes and secures interviews for people seeking upper-level management positions. Will convinces Lawrence Willheimer (Bruce Davison) to hire him, but he soon finds out that taking orders from harsh and demanding CEO Katherine Dunn (Marcia Gay Harden) and dealing with sexual advances from a co-worker (Alison Brie) makes the job a little less desirable than he first thought it would be. A mysteriously omnipresent janitor (Jorge Garcia) ends up helping Will out, but while Will is trying to navigate the choppy waters of interoffice politics, he also has to deal with the fallout from both his girlfriend and his father (Bryan Cranston) losing their respective jobs – and the misadventures of his friends on their jobs.\n\nThis is a rather unusual movie in a few different ways. It's a comedy, but delivers an important message to its target audience. Although the challenge of getting and keeping a good job is seen through the eyes of several people at different stages of their working lives, the focus is on the generation known as the Millenials. Characters within this generation that is often derided for a sense of entitlement and lack of motivation are shown learning necessary lessons that will equip them for success in the future, while remaining true to themselves and pursuing their dreams. The film's ability to simultaneously validate, teach and encourage Millenials is unusual, but so is the amount of time this film took to get to theaters.\n\n\"Get a Job\" was filmed in early 2012. Anna Kendrick said in a 2014 interview that the film had encountered \"distribution problems\". Whatever the specific reasons for the delay, it's interesting to note that in the four years between this movie being shot and made available to the public, these are just some of the projects that a few of the main cast filmed AND saw released: \"Fantastic Four\", \"Whiplash\", \"The Spectacular Now\" and three \"Divergent\" films (Teller); \"Cake\", \"Into the Woods\" and \"Pitch Perfect 2\" (Kendrick); \"How to Be Single\", \"Get Hard\", \"Sleeping with Other People\" and \"The Lego Movie\" (Brie); \"Neighbors\", \"Kick-Ass 2\" and \"This is the End\" (Mintz-Plasse); \"Whiskey Tango Foxtrot\", \"How to Be Single\", \"The Stanford Prison Experiment\", and \"Poltergeist\" (Braun); \"Fifty Shades of Grey\", \"Grandma\" and \"Parkland\" (Harden); plus \"Kung Fu Panda 3\", \"Trumbo\", \"Godzilla\" and the end of \"Breaking Bad\" (Cranston). Just sayin'.\n\nWhether the delay in the film's release, or the low scores it has received on various websites, raise too many red flags to ignore is, of course, up to the individual Movie Fan, but this Movie Fan is giving \"Get a Job\" a moderate recommendation. The cast is easy of the eyes and fun to watch. The story is a bit disjointed and is a little short on laughs, but it's often charming and approaches real issues with truth and compassion. The movie tells its tale in a meaningful and pretty entertaining way. \"B\""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "larrys3",
        "review_rating": "1",
        "review_title": "I'm Being Kind to Say It's Abysmal",
        "review_detailed_main": "How the likes of Miles Teller, Anna Kendrick, Bryan Cranston, Marcia Gay Harden, Alison Brie, John C. McGinley, and Brandon T. Jackson, all most talented actors, can be in such a stinkeroo is a mystery to me. I'm no prude, but when a film is incredibly vulgar and mean-spirited and the intended humor falls flat as a pancake it just becomes torturous to watch. The customary 180 at the end of the film was way too little and way too late.\n\nI saw some reviewers state that this movie was \"in the can\" for 4 years before being released. Why inflict us now? I guess this is a puzzle only the filmmakers can know the answer to."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "jessmr-43191",
        "review_rating": "",
        "review_title": "4 Seasoned Actors Deserved Better Jobs...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "mihai_alexandru_chindris",
        "review_rating": "6",
        "review_title": "Decent",
        "review_detailed_main": "Well, it's not super, super funny, but at least it's enjoyable. The jokes made are not that bad, but there was room for improvement. I expected to get a lot of laughter and my desires were not satisfied. I guess we can just throw it into the commercial series section and just forget about it."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "maripere95",
        "review_rating": "2",
        "review_title": "The jokes fall flat, just like its characters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "lakings97",
        "review_rating": "6",
        "review_title": "Mediocre Comedy",
        "review_detailed_main": "Get a Job was a mediocre comedy movie staring Miles Teller and his girlfriend Anna Kendrick as recent college graduates who have a hard time getting decent jobs. We could all relate one way or another, where we are lost at sea till someone or something helps us along the way. The characters discover that the most important adventures are those you don't see coming. Bryan Cranston played Mikes' father as he loses his job along the way and hides his secret from his family. The all star cast also included Allison Brie as part of middle management associate, Brandon Jackson and Christopher Mintz-Piasse as Teller's roommates who are also jobless. Marcia Gay Harden is the over the top CEO, Jorge Garcia as the janitor, Jay Pharoah as the sleepy pimp, a brief appearance by John Cho, as well as John C. McGinley and Bruce Davidson. If it wasn't for the cast, I wouldn't have watched it but it was okay to watch once."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Reno-Rangan",
        "review_rating": "3",
        "review_title": "Get a job, get along in a job, drugs, video game addiction, young generation.",
        "review_detailed_main": "This film delayed its release for a couple of years due to the distribution issues. That's not it, the film is no good, the writing was terrible, but a bunch of good actors in it. It is about the recent college graduates who struggles to get a job, even if they do, finds hard to fit in. A very good theme, but they failed to draw a decent storyline for it. I think they knew the film won't get a good response, so they used 'distribution issue' card to hold it back, but now it's out and the result was as expected.\n\nIt should have been called a drama than the comedy, because right now it lacks from those two categories. It digs on the topics like workplace bullying, harassment, as well as the youngsters' addiction to drugs and video games. In one of the scenes it emotionally appeals when the father tries to pay the bill in a restaurant. They had the right content, but lost in the translation to the screen. There's no proper flow in the story, they had tried too much, at a time it all remained very plain.\n\nThis is the second film to release in this year for Anna Kendrick and both of them did no good for her, especially this film fell short from a long distance. Same goes for Miles Teller and Bryan Cranston. I hope they all forget it and come strong in their next projects. A few people might like it, but not me. I like quality contents where this film is not one. Thankfully it was short, but only thing is it was not sweet.\n\n3/10"
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "dark_wolf_1987",
        "review_rating": "8",
        "review_title": "not a bad movie not a great movie tho",
        "review_detailed_main": "it was amusing for what it was a low budget film it had a few good points had a few bad points the plot was kinda stupid but its kinda a feel good movie, would i go buy the movie on DVD/blu ray no probably not re watch value is low but is a good enough movie to rent if your wanting a good feel good movie. the only reason it only gets 8 out of 10 stars is because the lack of a real solid plot/story line, yes it does hurt the movie some but in this day and age with movies coming out like crazy its only to be expected that the plot/story lines will be a little thin on some of them for a movie that was made in 2012 and was told it would never see the light of day i think it was well not bad i have seen worse movies but have seen better too i guess what i am getting to is don't go into it expecting a lot from it like i said its a feel good movie its not top of the line Hollywood grade A+ stuff but it does pull off what it is and it does not try to be anything else,"
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "cosmo_tiger",
        "review_rating": "7",
        "review_title": "As funny as Teller is, Alison Brie really steals the movie. A hilarious and fun movie that you can watch over and over.",
        "review_detailed_main": "\"Maybe we're not all geniuses. So we're not the greatest generation. So what. These are our lives and we're gonna make the most of them.\" Will Davis (Teller) has finally graduated college and is ready to attack the world, with the help of his parents. When is dad loses his job and Will has to support himself he realizes things aren't as easy as he was hoping. Now him, his friends and his girlfriend Jillian (Kendrick) must face a world that none of them are prepared for. I will start off by saying this is nothing all that original or amazing and won't win any awards. That said, the movie is hilarious and one that is easy and fun to watch. Something I could watch over and over. Miles Teller has great timing and made me laugh through out. The movie deals with real and serious topics in a way that you don't realize they are being brought up until you are like...oh yeah, that makes sense. There really isn't a whole lot to say about this one other than if you are looking for a light-hearted comedy that actually has a message this is one to definitely pick up and watch. As funny as Teller is, Alison Brie really steals the movie and I wish she was in it more. Overall, a hilarious and fun movie that you can watch over and over. I give this a B+."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "1",
        "review_title": "Disjointed unfunny mess of a comedy",
        "review_detailed_main": "There's a reason as to why this film was released years after its filming date and went straight to video. It's quite a mess of a comedy. Featuring a little too many characters (most of which we don't care about) trying to get jobs just isn't entertaining. The comedy is just forced, is either gross out and silly and in no way clever- very standard and a little too \"try-hard\" for its R rating.\n\nThe film has the feel of a sitcom comedy (perhaps there is/has been a sitcom with this exact same type of plot/story). Thankfully the film isn't long as it's less than 1 hour 20 minutes (excluding end credits). Certainly just a one time watch."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "yusufpiskin",
        "review_rating": "5",
        "review_title": "Mediocre",
        "review_detailed_main": "I'm going to be completely honest, I really enjoy this movie. It's by no means great, but with a sense of humor that I thought worked and the fun charm of Teller, Kendrick, Cranston, Brie, and everyone else here, the film wasn't a complete mess. It could've been a much better movie, but at the end of the day it's a dumb, fun mess that I could watch a couple more times."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "bobetjo",
        "review_rating": "7",
        "review_title": "Quite shallow but funny",
        "review_detailed_main": "I am sorry to see the poor reviews. Get a Job is a bit shallow but has some good laughs in it. A group of young slackers hope to find work but apart from playing ultimate Frisbee and HALO they don't have a lot of skills. Brian Cranston is also job hunting and provides that older point of view where no-one will interview him. The actual job hunting is not really covered in depth. That's because it is the setup to a number of situational jokes. Which kept me watching and lsughing. The characters are successful more through luck, and there is a bit of shallow (and untrye) philosophy at the end. But it doesn't detract from this short tightly edited comedy."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "lanaliliya",
        "review_rating": "2",
        "review_title": "Poorly executed plot",
        "review_detailed_main": "This movie was so bad I cringed throughout it. I didn't even laugh one time and usually I'm a lover of cheesy dumb comedy. With all the great actors in this movie, I expected more. The plot of the movie could've been good, but it was poorly executed."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "scythertitus",
        "review_rating": "6",
        "review_title": "Subversive and Ironic... Or just not very good?",
        "review_detailed_main": "This is a mediocre comedy with a ridiculously stacked cast. Not since Movie 43 have there been so many great actors in a comedy that is just plain not funny. Although in this case it is not because the film is outlandish and crude, it is just kind of dull. The stellar actors in this movie get nothing to do for the most part and it reads more like a paint-by-numbers early 2000s comedy where it seems to be giving out scudo-philosophies on life, while mostly getting things wrong and not really saying much of anything of actual note.\n\nHere is the thing though, it's a film about the compromises that promising people make for money and what is expected of them and when you look at the cast and the quality of the film you realise that it is a perfect metaphor for the themes of the movie. Did the filmmaker intend to send a message about the compromise of growing up and working with the movie itself?! If so then it is a subversive masterpiece that they slipped by studios to become a real life example of the modern day problems it is supposed to highlight.\n\nOverall I don't think this is actually the case, you can still take it as an example of how great actors get roped into doing a bland script through promise of money and meaning, but apart from that it is only one to watch for the cast, just don't expect to laugh or really feel much of anything by the end. Solid 'Eh'."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "solojere",
        "review_rating": "3",
        "review_title": "Good actors bad script",
        "review_detailed_main": "I would give this movie a 1 if it weren't for Anna Kendrick and Bryan Cranston, who made the best with what they were given. The movie follows Will, his girlfriend (Anna Kendrick), his dad (Bryan Cranston), and his roommates. The film is supposed to be a comedy about life in the real world after college. But it is not funny at all. I don't think I laughed even once. A lot of the jokes are very cringe-worthy, and I didn't like any of the characters. You know it's probably bad when they shoot it in 2012 and then don't release it for 4 years. The exception to all this was Anna Kendrick's and Bryan Cranston's characters, who were way underused. However, these characters are given a couple of serious scenes, which made me glad I watched it. But there are a lot of good actors in this movie, such Brandon T. Jackson and Alison Brie, who are completely wasted in the film. It's sad because this film had a lot of potentials. But since it was just shot before Anna Kendrick's and Bryan Cranston's careers really blew up, I can't help feeling like they were just trying to cash in on theirs' fame. This film had a lot of potential, but it sadly didn't live up to it."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Hellmant",
        "review_rating": "",
        "review_title": "A 'slacker millennials' flick that actually makes millennials look good, and greedy employers look bad!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "time-bomb",
        "review_rating": "7",
        "review_title": "Entertaining fun movie for what it is.",
        "review_detailed_main": "This movie was entertaining. Nowhere near as bad as some are saying. Get a Job doesn't take it self too seriously. From the get go the pace of the film keeps constant and at no time did it feel like it slowed down. It has a lot of heart and its not a movie that has jokes coming at you from left and right non stop through out the movie but the story telling and the comedy that it does have is more than enough.\n\nIt relies more on its story telling than its comedy which i found to be a good thing. All actors and actresses worked well together and the acting was very solid. It was exactly what i needed on a Friday night as i said earlier it has a lot of heart and at the end the movie entertained me and was a lot of fun. If i had to describe the movie i would say its a feel good movie. Its message at the end really hit home with me, the music used through out the movie worked and complimented the movie when needed. For what it is it did not disappoint."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "myronlearn",
        "review_rating": "2",
        "review_title": "Get Lost",
        "review_detailed_main": "What a waste of talent! Bryan, did you really need the money? Didn't you think about your career? This LA based loony tune of a film starts off bad and rapidly descends like an airplane heading for the ground. I gave it two stars only cause Cranston was in it. How embarrassing it must've been for him. The writers are talentless. This is a film that should never have been made."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "bkykbfkgs",
        "review_rating": "8",
        "review_title": "Decent, Typical American Movie",
        "review_detailed_main": "This is no worse than Free Guy or the Ted movies, it has a stellar cast who are all just doing what they do best. There's an unhurried charm to this movie, like the entire cast is just letting it freewheel downhill, and that's its charm, it really isn't the type of movie that you want people going all Alan Rickman over, this is 100% solid typical American movie, and all the better for that. Miles Teller and Brian Cranston are incredibly solid, it would have been nice to have more from Anna Kendrick and I think she was perhaps a little let down by the writing, but there are moments when she is almost allowed to shine. Plus, the supporting actors are great, its always a pleasure when there is consistency throughout a movie, and there are so many little cameos here that are solid. If people hate this move because it's formulaic, then so are 95% of all American movies and many of those are worth a 7 or 8 out of ten for the same reason as this movie. I understand it had a troubled production history, so perhaps it got a bad reputation even before it was released and then all the critics just jumped on the band wagon, but basically this is a solid movie, with a great cast who are enjoying themselves and with really good supporting actors."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "digdog-785-717538",
        "review_rating": "7",
        "review_title": "i liked this film so much, why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "itai-orion",
        "review_rating": "5",
        "review_title": "Just...Embarrassing",
        "review_detailed_main": "I really cannot express how disappointing it is to have a film with such talented young actors and have it squandered on this piece of film-garbage. There is a whole slew of supporting cast that deserve so much better than to appear in such an uninspired sequence of events. Every character is a stereotypical punch-line waiting to happen. Even an appearance from the legendary John C. Mcginley's Dr. Cox Whistle is not enough to save this plodding, depressing mess.\n\nSeeing Walter White out of work is about as thrilling as remembering that he used to be Malcolm in the Middle's dad.\n\nI do, however, want to commend the filmmakers for attempting (admittedly with poor results) to address the frustration and actual difficulties faced by today's generation, and realise that it isn't all about being spoiled... Until that Hollywood ending shows us it is just that."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "thekarmicnomad",
        "review_rating": "2",
        "review_title": "Great actors in a real insipid turd of a film",
        "review_detailed_main": "A university graduate has to find a job to pay the rent and get his girlfriend off his back.\n\nThe premise is simple enough and all the characters are set up to make this an entertaining movie. The film boasts an excellent line up. All lights are green.\n\nI cannot give this movie a full review as I could not bare to sit through the whole thing. It is just not funny. I cannot even tell you why? But it is like watching a stand-up comedian die on stage, for over an hour.\n\nAll the ingredients for a comedy are here, they just don't work. The scenes with the stoners are boring and flat, their hapless attempts at getting a career are just stupid - yet not funny. The stripper scene, even with perky boobs on display, is tedious and dull.\n\nAlison Bree's character is bland and caustic, and only there so we can hear awkward, sexual references come from the mouth of a pretty woman - what a waste.\n\nI have never seen a film with so much talent be so painfully bland. As we watched - in stony silence - I actually started to feel embarrassed for the actors and just had to switch off. I have not had to do this for some time."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "abyssquad",
        "review_rating": "6",
        "review_title": "Get a Job: Movie Review",
        "review_detailed_main": "It wasnt the nicest movie i ever seen but its ok for a sunday night."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "albertchandler",
        "review_rating": "1",
        "review_title": "Why",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "madisonquiz",
        "review_rating": "7",
        "review_title": "Entertaining Episodic Ensemble Effort",
        "review_detailed_main": "This film may have been marketed as a \"hilarious\" comedy, but that's not what it is. That doesn't mean it's bad, just that it needed a little help to get viewed, or, in an ironic way, to get the \"job\" of people wanting to see it. The great cast alone should do that (and the performances are all very good), but let's face it, there's a lot of competition for eyeballs, most of which expect to see a constant stream of outrageous situations in \"R\" rated big screen comedies. This is not the first film whose ad copy oversells the funny (e.g., \"The Bucket List.\")\n\n\"Get a Job\" is not over-the-top trendy-edgy like \"The Hangover\" or \"Bridesmaids,\" but even though it zips back and forth between several story lines, everything feels fairly authentic and relatable, considering. That's a sign of a well-made film, which this is."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "rosanna-83335",
        "review_rating": "4",
        "review_title": "So boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "storytimeamanda",
        "review_rating": "",
        "review_title": "My review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "davidzuber",
        "review_rating": "7",
        "review_title": "Not nearly as bad as people are saying",
        "review_detailed_main": "After reading these horrible reviews, I had to post my first review.\n\nI think people are missing the message of this movie. It's about the generation that has had everything handed to them. Getting praise for failing, participation trophies for losing, and constantly being coddled. As someone from this generation, I was able to relate.\n\nThe overall message (to me) is that growing up and becoming independent is understandably difficult for some people from this generation. With everyone constantly telling you how great and special you are, its no wonder these characters feel lost, and struggle with \"adulting\".\n\nI enjoyed the comedy, and thought the runtime was perfect. The humor in the movie is definitely gritty, but I like the theme of finding something your passionate about, and not to settle for a job you will be miserable with for the rest of your life.\n\nObviously, this movie isn't going to win any awards, but its a lot better than people are giving it credit for in my opinion. The acting is solid, and the characters are believable. Worth a watch as it isn't going to take up much time."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "claire-howson",
        "review_rating": "3",
        "review_title": "A reasonably good idea, executed extremely poorly.",
        "review_detailed_main": "The idea of a film about how hard it is to get a good job, regardless of your age, is a good idea. However, this film is not good. It is written poorly, by someone who appears to have almost no real world experience of talking to another person. There's very little character development, and nothing that they do makes any sense. Urgh, I never want to see this movie again."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "NestorTheGreat",
        "review_rating": "8",
        "review_title": "How times have changed, or why the world is run like an unwinable Monopoly game.",
        "review_detailed_main": "Not a song is sung throughout Kendrik's screen time, and yet the melody that runs through the film is befitting a Pitch Perfect scene. If the song was by The Cure, and the pitch was for a desk job at K-mart! That's how left-hand this film was!\n\nAbsolute truth thrown at us through a filter of rainbow laughs about this generation's unfair go at finding meaningful employment.\n\nFrom the stoner science teacher to the app-making stalker, every young adult in this film makes one question where the he'll we're going...in the movie and real life!\n\nSome incredibly funny and awkward scenes, with some brilliant cameo choices, it'll sting when it counts.\n\nNo bullies. No revenge of the nerds. No nice old man wisdom. Just an effed up era portrayed effing brilliantly by an effervescent cast! Liked it a lot."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "HeatherOHara",
        "review_rating": "6",
        "review_title": "Reviews From Insipid Millennials",
        "review_detailed_main": "The film is not 'insipid' as several reviewers without a grasp of vocabulary have suggested, it's light fare for a different demographic than most of the reviewers here. Reading the reviews by entitled millennials offended by a satirical take on entitled millennials might be the best thing about this film, and that's okay. The actors are solid in a film released perhaps several years past its Best Before date, and the story does not strive to teach any new lessons - this is pure entertainment for the Fed Up With Entitled Snowflake Millennials gang, and nothing else.\n\nEnjoy it, or don't - like these lost characters with little sense of the real world: No One Cares.\n\nGood for a laugh, especially the reviews from the targeted age range of viewers who cannot understand irony. 6/10."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "ryrymadrid",
        "review_rating": "1",
        "review_title": "Zzzzzzzzz",
        "review_detailed_main": "Sooooo boring!!!!!! Don't waste your time, stare at the ceiling fan better. A ceiling fan actually serves a purpose, this \"movie\" doesn't."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "hudders-64806",
        "review_rating": "3",
        "review_title": "Sucks.",
        "review_detailed_main": "I give this a generous 3, I thought it was bad enough to warrant my first review on this site.\n\nIt starts off as a cool feel good movie, but quickly goes nowhere. A lot of bad jokes, and a terrible plot for a movie.\n\nBut beyond anything else, the messaging of the movie is awful. Get a job, that is messed up. Not everyone should get a job, a lot of people should be entrepreneurs, we need more of them. It suggests that the only possible path in life is to find a job.\n\nI despise this kind of thinking as an entrepreneur.\n\nThe funny part is, at the end the guy decides to start his own business, which makes the entire premise and on-going stupid remarks of the movie irrelevant. Screw these movies, I think anyone can go into the movie business at this rate."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "It's alright",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "MikeC19",
        "review_rating": "7",
        "review_title": "Get a Look",
        "review_detailed_main": "I was in no hurry to watch this film, but when I did, I was surprised by it.\n\nI don't really care for Miles Teller, and Anna Kendrick I can kind of take or leave, but this movie has a lot of actors and familiar faces that I like.\n\nWhen I heard it had sat around for multiple years, I didn't even think I'd finish it, (With a lot of movies, I don't) but I did! It had a good pace, and some laugh out loud moments. I feel like it had a good message in the end, as well, about finding a job you like, and following your dreams.\n\nWas it Earth shattering? The funniest comedy you'll watch all year? Nah, but it's about as good as most comedic films you'll see in a year. I would, actually, recommend it to those looking for a chuckle. It's nowhere near as bad as you might think it is. Give it a try."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "StevePulaski",
        "review_rating": "4",
        "review_title": "After four years of rotting on a shelf, it does nothing but further blemish great actors' careers",
        "review_detailed_main": "It's always hard to completely blast films like Get a Job because beneath an exterior of crude humor and a meandering narrative lies themes and ideas with underlying truth. The problem is that Get a Job brings such ideas to the surface but fails to capitalize on them, so it feels like they were just mere coincidences and conveniences. This wouldn't be such an issue if the film wasn't ostensibly in a hurry to go nowhere, predicating itself off of characters that feel cloyingly artificial and impractical, as well as introducing a plethora of subplots that serve no purpose other than to clutter a story with the overarching idea that life and employment in the modern world is hard, man.\n\nThe story follows Will and Jillian (Miles Teller and Anna Kendrick), a pair of recent college graduates who are looking to move in together and break out into the real-world. Will looks to have a promising gig lined up as a video-maker for a magazine, and Jillian has just taken a position in sales. Throughout his entire life, Will has heard from his father (Bryan Cranston) about his own struggle with trying to move up in the world to the position of power he's currently in, until, in a twist of events, him, Will, and Jillian are all laid off from their jobs.\n\nThis is one of the films where Will and his three deadbeat friends (Christopher Mintz-Plasse, Nicholas Braun, and Brandon T. Jackson), who all appear to have no immediate goals besides getting high and playing Xbox, can somehow afford a beautiful loft overlooking the city. The only one who seems to be doing something productive with his time is Charlie (Braun), who is somehow certified to teach chemistry to grade-school children. After a long search, Will winds up finding a position as a digital marketer under the order of Marcia Gay Harden, who implements somewhat oppressive and dehumanizing standards in her workplace, so much so that Will feels limited in his creativity when he finally begins working the job.\n\nThe remainder of the film is a whole lot of nothing, with characters wandering around, but never saying anything too compelling, Jillian becoming a lazy pothead with Will's best friends, and Will's father losing his entire identity upon being canned at his workplace. For a brief time, screenwriters Kyle Pennekamp and Scott Turpel's screenplay seems like it is going to etch in some commentary about Will's father's lack of self-identity outside of his office-duties, potentially leading down a path that highlights ideas and commentary on the millennial workplace and how young people are not letting jobs define them as people.\n\nBut that part never arrives, and we're left with watching mostly strong actors aimlessly navigate through pitfalls and trappings of lame comedic conventions. For a screenplay so generic and remarkably dry given all it has to work with, it's the kind of vehicle that you can tell attracted its young actors and actresses as a means of getting their foot in the door to hopefully bigger and better projects. Justifying what Bryan Cranston and Marcia Gay Harden saw in the material, however, is a bit tougher.\n\nApparently, Get a Job was shot in 2012 and planned for a larger theatrical release, but it sat on the shelf for four years, at one point with Kendrick commenting how it may never get a release due to distribution issues. Finally, in 2016, it was given a very limited theatrical and video-on demand release on various platforms, ending the film's checkered history, which we'll probably never get to fully know anyway. If nothing else, this only furthers the above assumption as to why talents like Teller and Kendrick would even bother with such a subpar script, as Get a Job's belated release only works to effectively remind and blemish both actors' (particularly Teller's) iffy filmographies when they're simply trying to be tomorrow's Oscar winners.\n\nStarring: Miles Teller, Anna Kendrick, Bryan Cranston, Christopher Mintz-Plasse, Nicholas Braun, Brandon T. Jackson, Marcia Gay Harden, Alison Brie, and John Cho. Directed by: Dylan Kidd."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Frederic-Guay",
        "review_rating": "6",
        "review_title": "An entertaining movie with some weird and questionable storytelling decisions",
        "review_detailed_main": "\"Get a job\" is an entertaining movie with some weird and questionable storytelling decisions. The moral of the story was great, but the over the top approach to important moments was jarring. The movie would have worked better if it took itself a bit more seriously."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "minipentz",
        "review_rating": "1",
        "review_title": "Truly terrible",
        "review_detailed_main": "I couldn't even finish watching it! So disappointing."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Prad-Pitt",
        "review_rating": "1",
        "review_title": "Maybe one of the worst films I have ever seen",
        "review_detailed_main": "Did five different people write this movie, then five different directors show up and shuffle it around with five different producers perhaps lose every other page of the script and then lose half of the footage and decide to still press ahead with stitching together this embarrassment of a movie. It needs to be burned. A hole needs to be dug and the whole affair buried!! Buried!!! Do not watch this movie. Your eyes, all your senses will thank you for it.\n\nIt's so bad I'm now going to watch Shotgun Wedding as it cannot be as bad as this movie was just now.\n\nWorst movie ever ever ever put on a screen."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "UniqueParticle",
        "review_rating": "8",
        "review_title": "Pretty enjoyable",
        "review_detailed_main": "Great concept with the right cast, solid acting and sloppy story that I don't mind. Unfortunate this got hate it's much better than perceives to be! Maybe you could say it Get a job could be better but I appreciate the final product, it has some funny moments and relatable characters that I would definitely hangout with! Another cool thing about this is I watched Cooties with Jorge Garcia in it too right before this."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "kyleeardolino",
        "review_rating": "1",
        "review_title": "Worst movie of all time",
        "review_detailed_main": "There are so many disconnects in the movie, nothing about it makes sense"
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "steefbezuidenhout",
        "review_rating": "1",
        "review_title": "Wow....",
        "review_detailed_main": "In my opinion, everyone involved from the conception to the excecution of this film, should never be allowed to partace in the film industry. I stoped after about 15 minutes... I wrote this to warn other viewers to rather go for a root canal in hell than to watch this film as it would be less painfull."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "subxerogravity",
        "review_rating": "5",
        "review_title": "It was funny and witty but the overall message makes no sense",
        "review_detailed_main": "I do find Miles Teller funny and entertaining. He's kind of this generation's Vince Vaughn especially describing him in this movie.\n\nHe plays Will, a 22 year old straight out of College who is the voice of this upcoming generation, but he's not saying much, which is saying a lot about this generation.\n\nTeller heads up a weak ensemble cast of characters that poke fun of a generation of American children who were built up with false confidence as children and developed into privilege underachievers due to it. I did enjoy watching these kids get slap in the face for expecting everything just because they put their hand out for it.\n\nThe movie also attempts to be more diverse with the unemployment situation with supporting actor, Bryan Cranston playing Will's father, a man who got fired after over 20 years on the job and his attempts to find a new job in a world that thinks her too old. This little add in I did enjoy and added some surprising heart to this fickle frat boy comedy.\n\nSpeaking of fickle frat boy comedy. Anna Kendrick is on the poster of this movie as if her part had any sort of importance. The movie was very focus on young men trying to Get a Job and has Kendrick's character more as a supportive girlfriend, which I did not like, because she's the same age as the boys going through the same stuff and they are not treating her as a equal to the others, as far as the story goes.\n\nBut the biggest issue Get A Job has is that overall the movie misses the point it's trying to make. I don't know if they were force to go with a Hollywood formula or whatever, but they spend the whole movie telling us what's wrong with this generation and how unperfect they are only for their lives to become perfect. Or maybe I'm looking at this the wrong way and it's actually a very non-Hollywood formula, because a bunch of stuff happen without anyone learning anything in the end.\n\nThe movie does have a bunch of big laughs in it from some actors I enjoined seeing on the screen, but overall, Get A Job does not say much and leaves me hating that generation even more."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "afallguns",
        "review_rating": "5",
        "review_title": "It's really a shame it isn't better...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "4",
        "review_title": "Work to rule",
        "review_detailed_main": "Get a Job is a so-so movie that was shot in 2012 but only released in 2016 when most of its cast became famous in the interim period.\n\nIt is mainly about college graduates entering the uncertain world of work and how they deal with it. Which is mainly not well which leads to money issues and confidence problems.\n\nWill Davis (Miles Teller) thinks he has a job lined up after working as a summer intern only to discover that the firm had downsized and he needs to find another job quickly. His room mates are struggling with their jobs as well. His father (Bryan Cranston) and his girlfriend (Anna Kendrick) both lose their jobs soon after.\n\nThe youngsters are hard working slackers and it is the employers that are actually presented as vile but the film is not really that funny."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "bbriddell",
        "review_rating": "10",
        "review_title": "Better than I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "sarahargue",
        "review_rating": "1",
        "review_title": "One has to work to make a movie this bad",
        "review_detailed_main": "I love Anna Kendrick and I hate rate a movie with her in it this poorly, but good heavens that was just a bad movie!"
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "climbingmoss",
        "review_rating": "5",
        "review_title": "Get a job as a script writer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "dansview",
        "review_rating": "5",
        "review_title": "Unnecessary Debauchery",
        "review_detailed_main": "I didn't hate it the way others did. Miles Teller is often an appealing lead. He makes you want to root for him. I found his character endearing.\n\nThere were also some good moments of reality and awakening. One employer who fires him to appease authorities tells him that he's sorry, but excrement runs downhill.\n\nMeanwhile his father expresses outrage at his son's immaturity and gives him a wake-up call about the world of employment. Those were good scenes with smart dialog.\n\nI don't know why film makers feel they need to push the envelope of good taste to the point of degrading vulgarity. Nor why well-known actors would agree to be part of a project that employs such tactics. I suppose they weren't as well known when this came out.\n\nThe film makes a commentary about the new generation of college graduates. That they are too focused on having fun and expect a job that will provide it. Hollywood makes films about people from their world of values. Religious or patriotic kids are likely to have a better approach to the work ethic.\n\nBryan Cranston was terrific. I bought his frustration and also found him hilarious. Anna Kendrick is always down to earth and solid. I could have done without the goofy friends."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "johnmjlacey",
        "review_rating": "1",
        "review_title": "Just Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "mark-mustermann",
        "review_rating": "4",
        "review_title": "forgettable feel good mishmash",
        "review_detailed_main": "-meh, comes to mind. if you have nothing better to do on a Sunday afternoon i guess this could do.-\n\ni hope nobody got paid for writing this, cause most of the time the writing is just that bad, right out of some college film class study- group. Take the blatant disconnect of our time, add the typical white loser comeback kid, add some quirky friends and smooth it over until any and all discernible characteristics have vanished. This movie, in way or another, has been made by the dozens and i think you could actually reassemble it out of Miles Tanner and Anna Kendrick movies alone.\n\nThe worst part is the constant breaking of \"show-don't tell\", which any movie should at least respect in so far as not to fill every possible moment of silence with some generic, out-of-can - introduction/motivation/rebellion/love/its OK/be special summery- speech. Out of which Anna Kendricks -its OK- and Miles Tanners (both OK performances btw) -be special- voice-overs are probably the worst part of the movie.\n\nThis movie got saved by its actors, and just barely. A few OK observations of our generation don't lift it above average. I guess objectively it could be a 5/10 but it was not for me."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "jawneyfloros",
        "review_rating": "10",
        "review_title": "a comedy about the pitfalls of working",
        "review_detailed_main": "Review: I really enjoyed this movie because it is a humorous take on life after graduating. The direction and screenplay are both really good. Both the casting are really good also. All in all I would give this five out of a possible five stars."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "cekadah",
        "review_rating": "4",
        "review_title": "It must have looked really good on paper!",
        "review_detailed_main": "In the reality of the finished product it is DOA! If you care to read how truly bad this flick is just scan through the other reviews here. The word FLOP is being kind to this movie. I watched it for Anna Kendrick and to see if Miles Teller could save himself from that gawd awful drummer boy movie. He falls another notch here.\n\nBut I got a message from this story. Here is the millennials facing a global job market for which they are ill prepared due to the pressures of getting a college education and discovering a job market already over flowing with applicants. And then actually getting a job is no guarantee a career will follow. The 21st Century simply does not offer the opportunities the boomer generation took for granite.\n\nWhy the writers and director pushed this story into the 'comedy' realm, I don't know. The message could really have been worthy of notice had the story taken a more serious path. But as it is we have a goof-ball flick of lackluster acting and goofy aimless editing. And somewhere a message is thrown in as with the basketball coach telling his class that awards are vacuous and worthless if you didn't actually earn it."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "tbills2",
        "review_rating": "5",
        "review_title": "Get a Job Is Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "doogal-05122",
        "review_rating": "1",
        "review_title": "Dribble from the USA",
        "review_detailed_main": "wow. I am a massive Bryan Cranston fan. Breaking Bad is epic in no small part to him and I felt Trumbo was a superb performance in this. So we have him and some terrific actors in this dross. What is going on with American films? In the last 7 weeks I have attempted to watch an American movie once a week and only last 30 minutes in each one. This movie had the premise that guys lounging around in a loft ( a rather expensive one) looking over the city and going to strip clubs after a few bongs was meant to be really funny. I feel like taking this movie to a Real Estate Agent and asking them where is my fancy apartment that I did not earn. Miles Tiller was awesome in Whiplash but I think he may have received Whiplash in that movie because he has been quite lame since then. Oh - back to the other movies. One had a 15 year old having sex with her mum's lover. Another was set in a school where students took over and use some of the foulest language towards the teachers. A Tarantino film that has a black guy forcing some cowboy to go down on him in the snow. Then the N word used to an all-time record. Another movie I watched had a lady becoming a spy. It was funny enough, but when she became a spy in the field, she began using the f word 3 times a sentence. Then I watched the Squid and the Whale. One of the worst movies of all times which somehow rated amazingly well on both IMDb and Rotten Tomatoes. It had the least likable characters I have ever seen in a movie. Just awful. The youngest lad in it is pre-teen yet apparently it is funny to see him drink beer, use the worst corse words at his parents and masturbate in a library. What is wrong with the movies that country is putting out. I don't get it and I don't want to."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "gbkmmaurstad",
        "review_rating": "5",
        "review_title": "Milennials Pre-Employment",
        "review_detailed_main": "So what happens after you've gotten your degree, don't have a job and don't want to move back home? That's the plot of this film. A group of graduates without jobs move in a frat type house and seek meaningful employment.\n\nWill Davis (Miles Teller), his father, Roger Davis (Bryan Cranston) and his girlfriend Jullian Stewart (Anna Kendrick) find \"you can't always get want you want..but ya just might find whatcha need..\"\n\nThis is a a film you will want to watch before your unemployment runs out. It'll make you think \"okay, it's not that bad.\""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "dishlady69",
        "review_rating": "2",
        "review_title": "Ms Kendrick should get a job (No spoilers)",
        "review_detailed_main": "I really believe that if a film is going to be simply average it shouldn't be produced. That ship has sailed with this production. A below average performance by a tenuously average cast.\n\nMore specifically, there's no reason to pay money to see Anna Kendrick's pinched little face and listen to her millennial psychobabble when we see and hear that all around us on a daily basis. Perhaps it's meant to be some sort of parody? John Hughes 2.0 since Miles Teller bears a mild resemblance to John Kusak in terms of his look and style? Who can say. I don't think that even the producers know the intended vibe. The directors certainly don't.\n\nI have to say that after seeing this and the smattering of Anna Kendrick's work I'm really just not impressed with her as an actor. Whatever character she's given she presents the same flat performance with the pinched face. Perhaps they should have made this one into a quasi musical too? Hmm. No, I don't think that would have saved it. Perhaps a cartoon. She's better with voiceovers.\n\nIf you haven't seen the film, no need to. Just go to the nearest hipster dive cafe and you'll see little Kendrick lookalikes everywhere. Watch your step or you'll land on a hipster."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "Marinovv",
        "review_rating": "9",
        "review_title": "The cast were well selected",
        "review_detailed_main": "The cast were great. I like that the actors managed to reincarnate in their roles. There was a slight subtle humor that was nothing special. I expected more. Perhaps they should have focused more on the humor in the movie and would have appreciated more. The finale was the best of the whole movie, but it was too short. The whole movie is designed almost well, and it is only because of the great performance of the cast that this movie will be rated a little higher, but nothing more."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "cd-71223",
        "review_rating": "4",
        "review_title": "Eh",
        "review_detailed_main": "You would think this movie was a early comedy in all these actors careers. Nope, caught me by surprise when I saw 2016. Miles Teller, Anna Kendrick and Brian Cranston come on now you know this was just a paycheck for them. Straight up paint by numbers story. I gave it a 4 because there were some funny moments in it and Allison Brie is hilarious as the HR we would all love to have."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "rayhanna86",
        "review_rating": "3",
        "review_title": "Was hard to watch till the end",
        "review_detailed_main": "I'm afraid the negative reviews here are right: this movie seems to be produced with a cheap budget, because you keep seeing the potential for a better storytelling, both in dialogue as in the way it's filmed. The actors are not bad but they are badly guided and presented by the rest of the filmmaking. It's a shame, because the concept could have been much more entertaining than this, and it could have resonated much more with a majority of viewers, who have experienced the difficulties of finding a good job where you are respected. The only reason I watched it till the end, is because I had put some time in it and it was good enough to keep me going but it felt like a task."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "joshacdc",
        "review_rating": "5",
        "review_title": "Fell good?",
        "review_detailed_main": "I don't know if this was going for a feel good movie but it really fell short, the whole point is you can get a job work your ass off and it'll all pay off in the end. Nice thought but it does not work out that way. They got promoted to bosses and were making 50-60k a month after getting hired and non of them were shown to be qualified for the jobs. The jokes were okay nothing great. Star cast that did their best but the story fell really short little to no character development over time. This is not a bad movie with this also is a very forgetful movie. I've seen a lot of movies this is very middle of the line don't care kinda film didn't make me feel anything."
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "jpaul2008",
        "review_rating": "4",
        "review_title": "Honestly I've seen so much worse before.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1468846",
        "movie_name": "Get a Job",
        "movie_rating": "5.3",
        "review_username": "abhibnlcs",
        "review_rating": "8",
        "review_title": "Much more enjoyable than some large budget movies.",
        "review_detailed_main": "This movie is worth a watch. It's not awfully long and gets the message delivered with fun & laughs on the way. A good movie to watch with the buddies or just while having a beer and looking for a late night watch."
    }
]