[
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "brethart_the1",
        "review_rating": "8",
        "review_title": "Mary Kom: With some flaws it's still great punch !!!",
        "review_detailed_main": "What's Good: Priyanka Chopra's career best performance. What's Bad: Dramatic climax.\n\nBollywood always follow a trend of success.Since past few years the most successful genre is Bio-pics like Chak De India, Bhaag Milkha Bhaag and now Mary Kom.This year only countable good movies have entertained us and most of them are women-oriented like Queen, Mardaani, Mary Kom.It seems like these women-oriented flicks are coming out at right time, as i have witnessed during the screening after the last punch the ladies gave standing ovation to Mary Kom.Mary Kom is about how a poor girl from Manipur made her way to top against all odds.Her struggle, her passion, her madness, her love towards Boxing made her 5 times world champion.Mary Kom might not be the best movie as it contains many flaws but still it stands strong just because of Priyanka Chopra's superb performance.She has held entire movie on her shoulder, she has given more than 100% for this bio-pic.\n\nPerformances wise its only and only Priyanka Chopra. She is totally into the character and this is by far her career best performance.Supporting cast like Darshan Kumar, Sunil Thapa,etc are nice. Omang Kumar's direction is decent but it could have been better looking to the hold of the script. Music goes with the flow, cinematography is top-notch.\n\nOverall its a feel pride movie. Can surely recommend one-time watch."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "A decent biopic though too melodramatic at times",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "r96sk",
        "review_rating": "7",
        "review_title": "Worthy of a watch",
        "review_detailed_main": "Good film about 'Mary Kom'.\n\nIt takes the usual liberties that biopics tend to do, but this film does it well as the story it produces is very interesting. It arguably should be around 20-30 minutes shorter, but I still found the pacing to be fine - the progression through her boxing career itself helps keep things rolling.\n\nPriyanka Chopra does a grand job in the lead role, while Sunil Thapa supports astutely as Singh. Darshan Kumar is also solid as Onler. The acting in general is satisfactory. The music suits proceedings, also.\n\nYou don't need to be a sports fan to enjoy this. Worthy of a watch."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "shiraj-dakshy",
        "review_rating": "7",
        "review_title": "Mary Kom: An Inspiring story with a Sincere Effort",
        "review_detailed_main": "Many times when you watch a movie especially a biopic which has an inspiring story you may overlook the flaws and technicalities, such was my experience with \"Mary Kom\".\n\nDebutant Director Omung Kumar brings life the story of Boxing Champion \"Mary Kom\". The story & screenplay of Saiwyn Qadras charts the journey of a daughter of a simple farmer Mangte Chungneijang from Manipur to becoming the 5 times World Champion MC Mary Kom or Magnificent Mary as she is called.\n\nSaiwyn's screenplay is shaky in the beginning but concludes on a high note. The first half looks more like a collage of incidents in Mary Kom's life put on celluloid with no cohesiveness in the narration and everything is shown in a hurry which does not have any emotional connect, but in the second half the movie takes a 360 degree turn in the narration and shows us Mary Kom's comeback after becoming a mother. The second half the narration shows a lot of depth and emotions which are depicted well concluding the movie to a high octane dramatic end. Though a lot of people will find the climax a bit dramatic but the bottom-line is at the end it strikes the right cord and you come out being proud of Mary Kom and her achievements. The other flaw in the script is that it does not delve deep in the other character's storyline.\n\nThe dialogues by Ramendra Vashishtha and Karan Singh Rathore is good but quite inconsistent in the getting the language and the dialect right. Though the dialogues has a few Manipuri words being used but sometimes the dialect and language of the principal cast look a bit out of place especially Mary Kom's character.\n\nOmung Kumar's direction is sincere and honest and it comes through in the narration especially in the second half. The one flaw in Omung's direction is his hurried narration; he should have paid more heed to the characterization of other principal characters other than Mary Kom's. Though being Omung's first film as a director and choosing a biopic as a subject really needs a lot of conviction, and he shows the spark as a director.\n\nPerformance wise it is definitely Priyanka Chopra all the way. She is sincere in her portrayal as a boxer Mary Kom, her whole transformation from a glam doll to a boxer physically right from the body language to the way she talks is to be seen to believe. Frankly I had my reservations about Priyanka portraying the role but she has really surprised me with her portrayal. Another stand out performance is of Darshan Kumaar who plays Onler Kom, Mary's husband the real pillar of strength in the boxer's life. Darshan 's underplaying the portrayal gives the needed depth required, an actor to watch out for. Sunil Thapa as Mary's coach does a good job.\n\nI have to mention the makeup artist Subhash Shinde who really did a marvelous job of Priyanka's transformation to Mary Kom, minute details like skin pigmentation etc has been taken care of. The production design by Omung's wife Vanita Omung Kumar is realistic and convincing. Stunts by Parvez Shaikh and boxing choreography by Robert Miller bring the required authenticity and thrills in the boxing sequences.\n\nAlthough it is not a \"Million Dollar Baby\", but it is definitely an applauding attempt which is worth a watch....."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "BallerinaWick",
        "review_rating": "",
        "review_title": "A biopic on Indian women boxing champion - Must watch for all sports enthusiast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "Simply a good film.....",
        "review_detailed_main": "I have read a lot of criticism of this film lately. Many critics commented that the film lacked a proper melodrama and screenplay could have been bettered. Well, I also felt the film lacked certain punches in the screenplay; but overall, the film is a very sincere effort to present the life story of a sports person. I simply found three very strong reasons to admire this film.\n\nThe first reason is the story. Very few Hindi films have done justice with the real life characters. And this one fully handles the story of a north Indian girl who defies her father by choosing boxing. Bollywood recently lacked good stories in its films and \"Mary Kom\" just sincerely fills the void. The second reason is its clarity in presentation. The film nowhere compromises for the formulaic sequences and remains truthful to its backdrop. Very few directors dare to make a complete sports movie which this does. And the last and the most strong reason is the performances. Though Priyanka doesn't look like a North Indian girl she steals the show by appearing ferocious boxer and a loving mother. Perhaps this is her second best film I've watched after \"Fashion.\" Similarly, Sunil Thapa and Darshaan Kumar in very unpolished roles also do deliver good performances.\n\nWell, don't go with a great hype for this film. It's simply a good and a naturalistic film in a dearth of good movies. Trust me, you won't leave your seats with a scorn.\n\nRating: 3 stars out of 4"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ghazwan124",
        "review_rating": "10",
        "review_title": "good film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "shail_thegreat",
        "review_rating": "6",
        "review_title": "A One-Time-Watch.!",
        "review_detailed_main": "\"MARY KOM\" is a biographical movie on Mary Kom,four times World champion Boxer. The movie depicts the hardship that a Manipur girl had to go through with, to achieve her dreams.\n\nPriyanka did a marvelous role, justifying her character in every scene. Though she lacked a bit to motivate the viewers as was expected from the promos, her sincerity to the role was attracting. Other characters like her husband and father were at par. The person playing the Coach's role was a disappointment.\n\nUntil the interval, the movie moves in a very fast pace displaying various incidents of Mary's life which leaded to her becoming a World Boxing Champion. In the next-half, the movie emphasizes on her family struggle and the comeback to boxing.\n\nThere were some unnecessary scenes used, to advertise various products from TATA salt to IODEX balm. Its distracting and unappreciated in serious movies.\n\nSome critical scenes were too filmy. Climax were predict-able, and the little Bollywood drama won't go unnoticed.\n\nBackground music and songs will keep viewers interested. National Anthem added in the end of movie was too much.\n\nConclusion: Family movie. Watchable once. Kudos to all sports-women."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "AnotherMovieFreak",
        "review_rating": "8",
        "review_title": "Magnificent Mary...",
        "review_detailed_main": "Every Husband should be like him....and every one should be like Her....THe Magnificent Mary......\n\nI went to watch the movie with a feeling that it will be a disappointment...Coz the promos were way to commercialised...But Just like M C Mary Kom.....The movie came out to be a huge surprise....The barfee gal...again showed....no one could have portrayed the living legend better....Set on the background of beautiful Manipur, the movie started with a pregnant mary being rushed to hospital by her husband Amisdt riot...It took a flashback, where a wild Manipuri girl,bashing guys, was trying to have a name in the male dominated society.....Chungnejiang was wild, not focused and raw...Priyanka never missed a single part to portray the legend's wilderness..From a farmer to World champion...It was never an easy task...Co-incidence bought that wild lady to the boxing arena, where her stubborness earned her a place in boxing...from there she was coached by yet another Stubborn but levelheaded coach of Manipuri boxing fed....She won back to back three world championship....got married, had kids and was forgotten...But no one can stop legends...with the help of yet another magnificent man, her husband, She fought back to earn a name, her name, her place....From there she won two more world championship and to make us very proud,She won India her first Olympic female Bronze medal in boxing at 2012....\n\nWith such an inspiring story, magnificent star cast, appropriate songs, Dropdead gorgeous background and those essence from My NorthEast...Indeed the movie was grand....ANd by the end scene , I promise when u will stand up for the national anthem , u will shed tears of joy....and pride...Mary Kom is all about Struggle and Survival... Director Umang, Did a fabulous job..Screenplay was way better\n\nKISIKO ITNA BHI MAT DARAO...KE WOH DARNA HI BHOOL JAE.... A mother, A Wife, A fighter, A multiple time world champion and olympic medalist.....she is indeed Magnificent Mary...."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "yashmishra91",
        "review_rating": "7",
        "review_title": "Feel Good Film with Some Energetic Factor",
        "review_detailed_main": "No, this isn't 'Million Dollar Baby\" and No, this isn't \"Bhaag Milkha Bhaag\" too. But it literally reveals you the real Mary Kom: A Boxer, A Fighter, A Wife, A Mother and A Gentle soul. It works because it has got heart at the right place and it's the moments which makes it a 'feel- good' cinematic offering. Despite following the same (read,overdone) structure which many sports theme based films worldwide have used and even some of the crucial parts which have literally been extended, just for the heck of generating extra emotional factor, the film at some extent, succeeds in showing the Struggle, the Nepotism, the Red-Tape and the hope in an entertaining manner which makes it a worth your buck. Based on the Boxing legend MC Mary Kom﻿, the film, within it's compact cinematic constraint scores because of it's supporting characters, especially Suraj Thapa, Rajni Basumatary﻿, Shishir Sharma, Darrshan Kumar Singh﻿ and Lin Laishram﻿ who brilliantly add support to the protagonist, the hard-hitting dialogues penned by Karan Singh Rathore and Ramedra Vashishth with an excellent Manipuri touch by Bijou Thaangjam﻿, the comes a canvas-like cinematography by Keiko Nakahara, editing by Rajesh G. Pandey and Sanjay Leela Bhansali is somewhere quite classy, the production design work by Vanita Omung Kumar and then the BG Score by Rohit Kulkarni. Full marks to Priyanka Chopra, who showcases the best of her energy, stamina and excellence on screen, carrying the film brilliantly on her shoulders. Overall, despite having being strayed in between in showcasing the best of Magnificent Mary, director Omung Kumar at some extent, succeeds in showcasing the legend and her times, which makes it a must watch not only for entertainment, but for some new energy, some 'feel-good' factor and even the need of having more focus on our other Champions."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "bewareofvikas",
        "review_rating": "4",
        "review_title": "Does not do justice",
        "review_detailed_main": "This movie is a huge disappointment. Billed up to be one of the most heart wrenching tales of winning against all odds, the result was a very highly dramatized offering. A good parameter to judge biopics is how much the viewer feels inspired after watching it and this film fails miserably on that account. Right from the start, the supposed hardships of Mary Kom do not ring true at all, thereby making it extremely hard to root for the protagonist.Though in the second half, this is somewhat salvaged by portraying the problems of a mother of two making a comeback to the coaching arena. Add to that the dramatization of many elements, making the whole movie feel very unnatural. The boxing scenes themselves are very bland and we rarely feel the tension that usually accompanies matches in good sport-movies.\n\nExpectedly, Priyanka Chopra carries the movie and gives a good sincere performance. If only the role had been a bit more of substance, she could have taken it to greater heights. All the supporting characters, particularly the husband, though relatively unknown play their parts well.\n\nFirst time director Omung Kumar should have worked a lot in making a tighter script. The dialogues are also very uninspiring. The effort of making a biopic on a woman sports person is appreciable but the result is not.\n\nP.S: The product placements of various brands in the movie is really annoying."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "jeringeorgepj",
        "review_rating": "9",
        "review_title": "an inspiring movie",
        "review_detailed_main": "This week's release, Omung Kumar's MARY KOM is one such film which is a biopic on one of India's most illustrious sports personalities, Mary Kom, who, despite all her hardships, put our country on the international map with her achievements. The film goes on to show the real life story of this sports star, which not many are aware of. The film serves as an eye opener not just on the fact that India can produce international 'gold medal winning' boxers, but also that Manipur is very much a part of India!\n\nOmung does a great job of building up the climax with heart wrenching scenes where Mary chooses to box over spending a blissful life with her family. Post her opting to box, Mary accidentally lands up at the boxing training academy of her coach Narjit Singh (Sunil Thapa), who, after seeing her persistence, teaches her that 'the world maybe round for everyone, but her world should be the shape of the boxing ring, a Square'! Mary's talent for the sport combined with her coach's training form a deadly unbeatable lethal combo who go on to win international competitions galore."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "yuvrajjuneja-59021",
        "review_rating": "7",
        "review_title": "Good acting, Great Biopic and Amazing story.",
        "review_detailed_main": "I think this film is One of the best Film ever of Priyanka Chopra ma'am.\n\nThis film can keeps everyone edge on their seat.\n\nPriyanka Chopra's Performance is Great in this film.\n\nThe Songs are also good. My favourite is (Adhure) Sunged by: Sunidhi Chauhan."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "phoenix-rohan",
        "review_rating": "4",
        "review_title": "A bad treatment to an amazing real life story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Mary Kom pays tribute to real-life hero but disappoints as a film",
        "review_detailed_main": "Biopics are gaining popularity in Indian Cinema as it is representing true incidents of a person portrayed on the silver screen. Mary Kom does pay respect to the great sports person but disappoints as a movie.\n\nMary Kom tells the real life story of a five-time world champion who is the only Indian to qualify for 2012 Summer Olympics games.\n\nOmung Kumar choose the right subject for his directorial debut but messes the film with loose screenplay and lousy direction. The movie begins with curfew scenes and coming-of-age drama which was forceful and had no right intention in place. Even the fight scenes were tacky. However, the second half picks up and drama sets rolling in with story begin to show light into the life of Mary Kom. If you would have read the autobiography of Mary Kom, the legendary boxer struggled to reach to the top but nothing much was shown in the film. Art direction is fine. Cinematography is outstanding. Dialogues are punching. Songs are disappointing. Priyanka Chopra gets into the character of Mary Kom. The supremely talented actress delivers a solid performance. She is mind blowing with her punches and fiery dialogues. Darshan Kumaar will surprise you in the supporting role.\n\nOverall , Mary Kom pays tribute to real-life hero but disappoints as a film. Decent 2.75/5\n\nhttps://www.facebook.com/FilmyChowk"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "SatiagoManez",
        "review_rating": "7",
        "review_title": "Decent biographical movie missing some intensity where it needed most !",
        "review_detailed_main": "Mary Kom - The efforts and dedication that Priyanka Chopra. The performance of the cast, Camera work and editing are the major efforts that can be appreciated in the movie.\n\nEvery advantage of having a movie that deals with sports, nation and patriotism applies for this movie too. You can except a handsome number of emotional moments in the movie, esp with the training scenes.\n\nThere is a lot of places where the are commercial products(Iodex, Tata salt etc..) being advertised in the movie. In few places they are very evident!\n\nBut where it misses a pinch of salt is when Mary Kom decides to leave her carrier which was her lifetime dream, goes for a marriage and When she decides to enter back into boxing leaving the twin infants -- there is no real depth in scenes justifying these decisions. In fact her husband who is very instrumental and encouraging her to get back into boxing, why would such a person let her know about the operation of one her babies when she was about to take her World Championship finals!\n\nIt's yet a other Bollywood movie that you can enjoy watching, But not a great biopic that you can expect !"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "aheaven2005",
        "review_rating": "8",
        "review_title": "Strong Sport Movie",
        "review_detailed_main": "A very solid sports movie around that excels in telling a true story and making it very interesting. We can feel what Mary Kom felt in different moments of her life. The music is also really entertaining and adds to the pace of a movie. This really gave me a desire to watch more Bollywood movies."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "dineshprakash",
        "review_rating": "6",
        "review_title": "Simple but good movie",
        "review_detailed_main": "Director Mr. Omung Kumar work is good. I personally like the films where a person challenges the boundaries. So I remain little liberal about such type of movies. Story by Saiwyn Qadras,is linear. Director tried to make it interesting using flashback and he succeeded a bit in it. Dialogues by Ramendra Vashishth and Karan singh Rathore, are very good. Few dialogue i.e Hamara Pet To Khushi Se Bhar Gaya Hai and many more are beautiful. Screenplay by Saiwyn Qadras is OK. There would be many places where emotional quotients could have been on high note but screenplay missed the opportunity. The equation between Coach and Mary Kom could have been lot of such moments but they left it very under toned. When Mary Kom shaved her head that was also a good point but they ended the scene abruptly without answering the resolution of passport issue. I was unable to find the emotions behind her this serious step. At the time of wedding why they shown the gloves being pulled by wedding car!!? She respect her boxing gloves more than life then why did she do it? Supporting actors, characters are not well defined so it does not support the scene well. Interval point is flat. Climax gives typical filmy feel while it is a biopic. Why did her husband inform her about the illness of child when he was aware that it could emotionally make her weak, if it had to be shown for curiosity sake then some other way could have been thought. They could have easily touched the Manipur issue in touching way but they made it vey subtle. Priyanka Chopda is fantastic. She enhanced every light moment to memorable by her performance. Sunil Thapa as coach is good. Darshan Kumar as Onler Kom (her husband) and the actor who played her father role are fine. Shakti Sinha as Sharma ji ( Boxing federation chief) is very good. Music by Shashi Shivam, is good."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "parameswaranrajendran",
        "review_rating": "9",
        "review_title": "Great female biopic",
        "review_detailed_main": "Watching this film at 2AM and ended up still energetic and awake at 4AM. The duration of the film is 2hr 1minute. Not a single is boring. Trust me, this is a biopic of an Indian female boxer. The director fully utilize the actor in Priyanka Chopra. PC gaves her career best performance till date. This movie has a heart pounding climax. The film is an astonishing spectacular."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "sshogben",
        "review_rating": "7",
        "review_title": "Priyanka Chopra's courageous knock-'em-dead performance shines, despite weak script",
        "review_detailed_main": "I cannot praise highly enough, the power and execution of Priyanka Chopra's performance in this movie.\n\nAs the title character, Ms Chopra swept me away with the sheer passion, dedication, and grit she brought to this portrayal: a real woman boxer who won five world championships and returned after retirement birthing twins to claim a bronze medal at the 2012 Olympic Games in London.\n\nPriyanka makes you forget she's an actress – in \"Mary Kom\" you will believe she IS the athlete.\n\nTaking on this challenging role was courageous, in a male-hero dominated industry where, even today, it's the men who are expected to 'carry' all big commercial cinema. Where even the top heroines – naturally including Priyanka Chopra herself, who co-stars in many of the biggest of the biggies, such as both the hugely successful \"Krrish\" and \"Don\" franchises – rarely get opportunity to do much more than 'look pretty and dance a bit'. This is, happily, evolving somewhat with the relative commercial success of heroine-centric films such as Kangana Ranaut's \"Queen\" (2014), Vidya Balan's \"Kahaani\" (2012), Priyanka's own \"Fashion\" (2008), and Aishwarya Rai Bachchan's \"Provoked\" (2007). Yet it is a sad fact that, even today, the much vaunted '200 Crores Club' and even the '100 Crores Club' blockbusters are male star vehicles, every last one.\n\nAgainst this industry backdrop, I salute Priyanka Chopra even more for not just taking on, but so boldly succeeding with, such an inherently 'unglamourous' role.\n\nAll credit to Ms Chopra aside, however ... the \"Mary Kom\" movie as a whole is frustrating.\n\nIt's as though, having committed themselves to making a movie about the real-life boxer Mary Kom, the filmmakers then found themselves not having a clue what to say about the woman.\n\nThe coach in the film (Sunil Thapa, who manages a solid performance despite the poor writing) repeatedly tells his boxer and the audience to \"Focus! Focus! Focus!\" Yet \"focus\" is exactly what this script (story & screenplay credited to Saiwyn Qadras) completely fails to do. The lackluster music (Shashi Suman) and uncertain direction (débutant director Omung Kumar) do not help.\n\nThere were so many potential story lines here which could have been developed into a uniting theme: the physical isolation and political unrest unsettling Mary's home state, Manipur; a young woman's struggle against family and community expectations to walk a non-traditional path; any woman's challenge to balance career and family; just to name a few. And, in fact, several of these themes are suggested ... only to be inexplicably dropped or left hanging. Forget the triumph of last year's groundbreaking ad brilliantly executed biopic \"Bhaag Milkha Bhaag\", which transcended the personal story of its athlete to present a broader message of societal healing in the aftermath of communal tragedy. \"Mary Kom\" not only fails to convey any broader meaning, this movie fails to ever settle on any one particular thing to be learned from this one woman's life. Here, what happens just, well, happens. Limply. The filmmakers' lack of direction and focus make everything that happens in this woman's life seem just too ... well, easy. There is no sustained conflict, no driving or sustained challenge for the character to overcome. The would-be climax of the film comes across as cheap melodrama which left the audience emotionally unengaged. The film's end (at an odd place, well before what I would have considered the natural highlight of the woman's career) came through 'flat' and unsatisfying.\n\nWeirdly, I came out of the \"Mary Kom\" movie less inspired by Mary Kom's life ... than by \"A\"-list actress Priyanka Chopra's real-life courage and hard work in enacting this role.\n\nSeven stars, STRICTLY on the basis of Priyanka Chopra's powerful knock-'em-dead performance."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "sbaidya-942-874872",
        "review_rating": "5",
        "review_title": "Disappointment !!!",
        "review_detailed_main": "Couple of brilliant knocks with plenty of bad misses. Could have been an excellent epic movie but overall turned out to be an average one. Tried to show a lot of things in a chaotic manner which lacked finesse. Pee Cee was sometimes good, specially the training period. The director seemed totally confused and lacked focus. There were plenty things which were over done like too much of useless aggression which could have been shown in a better way, people spoke in manipuri Hindi accent and again the same suddenly had a flawless Hindi outburst and the worst was Pee Cee in sweet 16 school uniform ... sorry utterly unaccepted. Its a good one time watch though, has all the content of a typical family weekend movie with love, inspiration, Patriotism and sportsmanship which again could have been like the outstanding \"Rocky Balboa\" types .... but sadly not, as I said a big disappointment !!!"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "s-shroff08",
        "review_rating": "9",
        "review_title": "Engrossing and Entertaining",
        "review_detailed_main": "Excellent movie that brings to life \"Mary Kom\".. her formative years, her rise despite setbacks and adversities.\n\nThe story is narrated in a very crisp manner that keeps one interested all through. The movie starts from the streets of Manipur where a little girl discovers her passion for boxing and takes us through her life; through the different adversities and successes.\n\nThis is not a typical Bollywood masala movie and potentially not for all. This is a serious effort and for those who like to watch stories based on real life. It is in the same league as \"Black\".\n\nActing overall is excellent, Priyanka has done justice to the character. Other characters that have been portrayed well are the loving husband, the coach and Mary's dad."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "anupapu8",
        "review_rating": "7",
        "review_title": "Its not bad at all but a big OPPORTUNITY lost........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "anubhavparsh",
        "review_rating": "3",
        "review_title": "forehead punching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "seru-venkatesh",
        "review_rating": "7",
        "review_title": "Good Real Life Story Line - Not well executed-Could have done better",
        "review_detailed_main": "A good life story turns into a waste execution of plot in 2 hr movie. Could have done better.Seriously I don't know Mary Kom Until the movie is announced.I suggest these types of movies to be encouraged as to make next generation to know what their country is producing.\n\nComing to cast, PC has given her best. Darshan did his job well in a suppotive role as Onler. and coach of MK is OK.\n\nThere are no Emotional scenes in movie that motivates the audience to go deep into the movie like milkha bhaag. But national anthem at the end brings emotion in movie.\n\nI Can rate still 7 out of 10 to appreciate the director/produced for making such story of boxer who many of indians don't know.\n\n7/10"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "sagarshares7854",
        "review_rating": "6",
        "review_title": "Drama dilutes the \"Punch\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "abhishekx",
        "review_rating": "10",
        "review_title": "Well done, PeeCee !",
        "review_detailed_main": "Priyanka, being the most versatile actress in the industry, has again made a brilliant performance in another womencentric movie. Biopics in India have always been very underrated. So will be this one. The best thing I loved about the movie is its flow. No melodrama and no typical 1970s thing. It's definitely a one time watch. But a must. The movie could've been a bit better. As most of the people are unaware of Mary's achievements, the director should have more elaborated a few scenes in the movie, is what I think. Otherwise, the movie is fab! You'll love Priyanka's performance so much that you'll first vote for PC for the best actress at the Filmfare website. Now, I am sure this movie won't do very well at the biopics. Because we are living in a country where people aren't much interested in watching such intense and beautiful biopics. But, that's not all. That is why Indian cinema is divided into two parts : Commercial and Art. So there's no need to feel bad if the movie doesn't perform well at the box office. It has def touched many hearts."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "Abdulxoxo",
        "review_rating": "7",
        "review_title": "Inspiring Yet Routine",
        "review_detailed_main": "Mary Kom is an inspiring biopic that shines a spotlight on the life of the renowned Indian boxer, Mary Kom. Priyanka Chopra delivers a commendable performance, bringing depth and authenticity to the role. Her dedication to portraying the physical and emotional aspects of Mary Kom's journey is evident, and her portrayal adds a genuine touch to the film.\n\nThe film succeeds in highlighting Mary Kom's achievements and the challenges she faced, making it a motivational watch. The boxing sequences are well-executed and capture the intensity of the sport effectively. The film also does well in depicting the cultural and personal struggles that Kom overcame on her path to success. However, despite its strengths, it tends to follow a somewhat predictable biopic formula. The narrative, while heartfelt, doesn't stray much from the conventional arc of overcoming obstacles. Some of the supporting characters and subplots feel underdeveloped, which can make the story seem a bit one-dimensional at times."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "morrison-dylan-fan",
        "review_rating": "8",
        "review_title": "Kom On!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "saytosandeep",
        "review_rating": "7",
        "review_title": "Mary Kom: Nice Punches but should have Knocked You Out!!",
        "review_detailed_main": "Mary Kom. The biopic on five times world champion lady boxer Mary Kom is like watching a boxing game that does have some nice punches but fails to knock you out completely at the end.\n\nThe true story has great potential where Mary Kom fights her father in the name of love for boxing, finds a father like coach to take her to places in boxing, gets married, has twin sons, has a husband who is her biggest fan, husband pushes her to go into the boxing ring again and she re-writes the history. Priyanka Chopra does a terrific job as Mary Kom. She is in full form whether as a boxer or as a mother or as a lover.\n\nWhat movie lacks is one adrenaline rushing song and some nail biting boxing game barring the last one. Movies ticks of all aspects of a struggle of a player but fails to raise the dramatic tension. The relationship with her coach or her husband is handled well but does not come across as core strength of the movie.\n\nI am gong with good 7 out of 10 for Mary Kom. It is no Chak De India or Bhaag Milkha Bhaag but it deserves a watch for its intent and Priyanka Chopra."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "shagun-khera",
        "review_rating": "3",
        "review_title": "Oh! what a waste of time and talent!! failed dedication to a champ!",
        "review_detailed_main": "If only the director had brains or had tried to take some inspiration from million dollar baby, this movie could have been legendary. Pathetic direction, awful screenplay and what more. The fight sequence looked unreal and what you could see in a fight was audience and stupid reactions. The writer didn't bother to show the sequence of training, on the contrary in first 30 minutes of the film, she is shown as a world champ. Typical mayhem case of Apne. Mary Kom!! I'm sure you will be disappointed as well. You deserved so much better, and what you have got is not even worth looking at.\n\nMy Advise - save yourself the dismay and irritation. Respect for the champ and thumbs down to the movie!!"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "indianature",
        "review_rating": "10",
        "review_title": "Must Watch - a brilliant movie",
        "review_detailed_main": "Mary Kom is a brilliant movie. Inspirational, feel good - and a sense of pride (if you are Indian) are the best description.\n\nIt is a real shame that Mary Kom was not allowed to screen in theatres in Manipur. If anything, this one movie has brought Manipur to the rest of India in a positive way, even more than Mary Kom's actual achievements. Even more of a pity that the movie could not be shot on location in Manipur due to political reasons.\n\nPriyanka Chopra has excelled herself in her portrayal of Mary Kom. All the actors were very good indeed, as were the visuals and the script. The music was not memorable but this movie does not depend on music to carry it along.\n\nThe movie has brought out well the misdeeds of our sports authorities and why this is a major reason that sports has not progressed as it ought to in our country with no dearth of talented sportspersons, but a surplus of greedy babus running the show.\n\nThis is a brilliant movie, a must watch for all. The flag unfurling at the end brings out a surge of pride in being India - and that is indeed a hallmark of a great movie."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "royadityax",
        "review_rating": "7",
        "review_title": "could have been better....",
        "review_detailed_main": "As we all know it is a biography of the living Indian boxing legend, the 5 times world champion Ã°Å¸Â\u008fâ\u0080  M.C. Mary Kom. It succeeded in depicting her life, dedication, struggle, love Ã¢Â\u009dÂ¤ for boxing and the obstacles in her way. Priyanka Chopra rocked the Manipuri accent and the other actors played their parts pretty well too.... But it had some major problems.... Main problem was that Priyanka's punches Ã°Å¸'Å , her movements in the ring, the effect of punches Ã¢Å\"Å  didn't feel natural. The last fight shown was pretty impractical. Yeah they wanted to represent her motherly senses but failed to keep the match authentic. Since Mary is a boxing legend these were very important. The other thing is that they give a hint of Manipur riot and Mary Kom's third delivery in the beginning of the film but does nothing with it later on keeping them incomplete.... I still think it's a #mustWatch since it's a tribute to a living legend...."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "nairtejas",
        "review_rating": "3",
        "review_title": "Lost In Adaptation. ♦ 34%",
        "review_detailed_main": "Lets first salute the real M C Mary Kom for her feats. She is really a fighter and a role model for aspiring sports-persons.\n\nBut at the same time I am disappointed with this clumsy adaptation, which has the worst screenplay I have seen in a mainstream Bollywood film. A little over 2 hours, the film non-linearly narrates the life story of M C Mary Kom (Chopra) as she chases her dream to become a boxer while facing resistance from her family. The plot is similar to those inspiring stories we hear and read in media about how a person should fight for his/her dream, and since this is non-fiction we are talking about here, I refrain from commenting about it. But I am agitated with the way the story was narrated. All blame Mr. Nobody, Omung Kumar for picking a potential subject and beating the life out of it.\n\nPiggy Chops is not directed well at all and all her hard-work is now down the drain. The only credible character build is that of the hero's and that guy manages it properly, too. Supporting cast has no idea what they are doing as the limelight is only on the protagonist. The plot points make no sense and only depend on the facts that may or may not be true. The action sequences could have been more persuasive and powerful. It is evident about Chopra's hard-work, but when the foundation is crooked, even the ground-base can't do anything. The narration focuses on few hardships and then instantly the phase where the protagonist defies it. There is no cohesion between plot elements and it even looked like a video from an amateur teen's YouTube channel.\n\nI was bored in the first 40 minutes itself as the story rolled like a bullet train from here to there to beyond, jumping from the 90s to 00s and present time like a bunny, until I lost track. I remember hearing at least 6 songs throughout and let me not talk about how the makers messed up the romance section, which I hear played a significant part in the real story.\n\nWe don't see much biopics in Bollywood, but when we do, they are in the extremes: Bhaag Milkha Bhaag was an 8/10, while the much anticipated Mary Kom will be lost in time, with a 3.\n\nBOTTOM LINE: Even if you have a penchant for sports (other than cricket), it will require great patience and stubbornness to follow this film, which was probably made with lots of drama and hope, but no imagination or creativity. Move along, there's not much to see here.\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "tanujpoddar",
        "review_rating": "6",
        "review_title": "Sports biopic with more melodrama than action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "subhadeep-20034",
        "review_rating": "6",
        "review_title": "Good Sides",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ankurlkw",
        "review_rating": "10",
        "review_title": "Most inspirational movie in recent times",
        "review_detailed_main": "This is a movie which needs to be seen. Not just for great cinema but for understanding what it takes to be a World Champion when you are competing from a small town in India.\n\nMary Kom is a great movie with amazing performances especially by its leading lady Priyanka Chopra. Hats off to her and for the director of this movie for helping us know this legend. The movie is very crisp and reminds me of Chak De and Bhag Milkha Bhag.\n\n2014 has been a great year in Indian Cinema with actresses being the Superstars. Be it Mardaani, Highway, Queen or Mary Kom.\n\nWatch this movie for it will inspire you and also make you think on the plight of our Sportsmen who survive on a Chai and Banana and still bring us Gold."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "DareDevilKid",
        "review_rating": "6",
        "review_title": "Mary Kom Merited Way, Way More than this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "talaiva-xxx",
        "review_rating": "9",
        "review_title": "Good Movie",
        "review_detailed_main": "Effort from the crew is good but not the best, however 30mins more addition to the movie with the struggle of real \"Mary Kom\" would justify more.\n\n+ve of the movie?\n\nActing Cinematography Music & BGM Direction\n\n-ve of the movie?\n\nEditing Fight sequences Direction and Screenplay\n\nNow the whole India would feel proud with Mary Kom and she feel more respect to what she achieved.\n\nFinally the Movie is good and inspirational. Thanks to the director/actor and the crew for the effort."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "fahimay",
        "review_rating": "6",
        "review_title": "Boxing against all odds...",
        "review_detailed_main": "This movie is about an inspiring life story. A Manipuri girl from a quite ordinary background with a knack for getting into physical squabble wherever she goes, decides to try her hand at boxing on chancing upon a pair of boxing gloves. From a culture where tomboyish girls are frowned upon, she rebels her way through to get formal training in the boxing sport. The movie takes us on a ride of how she undergoes the customary journey of a woman as a wife and a mother and still holding her fort as an international boxing woman champion.\n\nThe cast has been aptly chosen to portray Manipuri features and lifestyle except Priyanka, which we can overlook as she gets immersed in the character of Mary Kom and gives her best to exude the inner character of this female icon. Watching movies like these do, at most times, focus well deserved attention to such achievers who were practically unknown before but we Google them up after the movie. Certain aspects of the movie could have been better according to some critics but being a very simple movie watcher, I could count more pluses than minuses. A dialogue that I absolutely loved is when the trainer, Sunil Thapa, tells her that a woman becomes stronger only after attaining motherhood. The female body withstands a lot of physical and mental exertion on bearing a child, but I can claim with assurance that it makes a woman fit to face anything. That is the message this movie conveys and we feel proud to be from a country of this undeterred female achiever, Mary Kom."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "rahulgandhi-iitk",
        "review_rating": "4",
        "review_title": "Poor effort from almost everyone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ayushijain30",
        "review_rating": "10",
        "review_title": "Super Mary Kom, Super Priyanka Chopra, Unexceptional Biopic.",
        "review_detailed_main": "Mary Kom is must watch! You will clap,cry,laugh,inspired n will return home with happy feelings. Priyanka is a revelation, she never fails to surprise! Just when you thought she can't push the boundaries after Barfi!, came Mary Kom to prove you wrong! PC doesn't just take on the role of Mary she becomes Mary. Special mention to Sunil Thapa who plays PC's trainer in the film for his performance is engaging. Darshan Kumar as Mary's husband K Onler Kom does a decent job for his debut. The music is spot on. With this Priyanka Chopra is headed for another National Award! With Mary Kom Priyanka proves she is the only Mardaani on the silver screen.."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ahwaan_padhee",
        "review_rating": "6",
        "review_title": "Mary Kom : Fighter of a film",
        "review_detailed_main": "Manipur 2006.A pregnant Mary Kom is desperately rushed to Hospital by her husband amidst the politically-troubled lanes in an ambulance.While she loses her consciousness, montages of her past glory flash before her eyes.Director Omung Kumar unfolds the biopic of the underdog, five-time world Boxing champion,MC Mary Kom. A vivid portrayal of her indefatigable spirit, the film however falls short of sensitizing us with Mary Kom as a person and the real hardships on her way to success.\n\nIt ticks off pretty well.A young Mary(Priyanka Chopra),hailing from a village of the lesser known north-eastern state and clad in school uniform is shown picking up fights with the bratty guys until she encounters her coach-sir,M Narjit Singh(Sunil Thapa)in the gym and gets hell-bent on him to teach her boxing.In the process, Mary faces strong opposition from her farmer father who doesn't approve her indulgence in this male-dominated sports.Omung familiarizes with the financial state of her family when Mary jumps into an unsanctioned fight for a paltry sum to get their cow back and also happens to meet her beau,Onler( Darshan Kumar).Through a pacy narrative, we get to see her immense dedication for the sports and her chronological wins at different championships.\n\nHowever, at the pinnacle of her professional career,Mary decides to marry and settle for a sabbatical inviting her coach's ire.But that is short-lived as she makes a comeback to the ring despite having a family with her twins,demonstrating the in-born fighter in her. The film packs a punch in the second half.The real challenges when Mary grapples with motherhood,the obstacles she faces in the form of the regionally- biased malicious federation and the strenuous physical training,aided with inspiring background scores, are the winning strokes.Omung tries to rush through the myriad shades of Mary - her anger management issue when she shaves off her head in impulse , her hurt ego when a co-passenger fails to recognize her in a bus or her inner frustrations while missing boxing.With a running time of 2 hours, it doesn't engage us in lovey-doveys of Mary and Onler, but presents their unflinching commitment towards each other.Its gentle,believable and mature.Despite these good things, the problem here is that it doesn't pinch us in the right proportions.It feels like a story which could have done wonders, if it had its heart at the right place.The production designs are impressive, the fights(Rob Miller of Bhaag Milkha Bhaag,Chak De)are well choreographed but the scripting,with its over-dramatic moments, mostly doesn't evoke the poignancy or empathies for the characters.Blemishes also erupt in the form of usual clichés - a stubborn father whose heart melts watching her daughter on TV ,a lethal opponent who is bound to lose,a sleazy committee chief out to ridicule our lady-hero and well predictable climactic showdown.\n\nHaving said all this, the film benefits enormously from its protagonist - Priyanka Chopra.The actress emulates Mary with so much of precision and vulnerability.More than the rigorous fitness regime in getting the perfect physicality and sculpted muscles, she succeeds in projecting the spirit of the born fighter efficiently.After Aitraaz and Fashion,this would be her next best author-backed role illustrating a dazzling repertoire.repertoire. Sunil Thapa and Darshan Kumar are incredibly authentic in their respective parts, and match upto the actress's prowess.\n\nMary Kom holds an elusive feminist diatribe against all those chauvinists who belittle women-strength or the underprivileged states of India.It may not reach the league of the inspirational Hollywood classic \"Rocky\", but its a good film which deserves to be seen."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "prashantnakil",
        "review_rating": "1",
        "review_title": "Waited, expected, disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "freemanpatrick7",
        "review_rating": "7",
        "review_title": "A bit schmaltzy but I enjoyed it.",
        "review_detailed_main": "I came to see Mary Kom for one reason, and one reason only. I wanted to see if Priyanka Chopra was as good an actor as she is beautiful. I'm happy to report that she rocks! In fact, in terms of American actors, I can think of a short list who can hold a candle to her - a very short list.\n\nNot knowing the history behind the story, and not being fluent in the language, watching this movie was a bit of a challenge. Still I found that most of the actors' performances were so good that they were able to convey the gist of what was going on.\n\nThe negatives were few, as far as I was concerned.\n\nA few directorial snafus. Namely, two people traveling on a motorcycle at a reasonable rate of speed but their hair isn't blowing at all.\n\nThe exercise montages were decent, if a bit repetitive, but the fight choreography looked hokey. All the fighters looked good in the gym but once they got into the ring it looked like play fighting.\n\nThe whole film had a Disney/Rocky feel to it. From the build-up, to the exercise montages, to the hokey songs that had a 80's Rock Ballad feel to them. In that respect this film was kind of paint-by- numbers.\n\nThe positives, I think, outweigh the negatives.\n\nThe photography, for the most part, was awesome, especially the exterior scenes. The DP Keiko Nakahara has a relatively short resume. I suspect that will not be the case for long.\n\nThe acting was superb throughout. Every single character, even some of the minor characters really stepped up and delivered. Even the babies nailed their parts. Now how in the world do you get better than that?\n\nBut I must say Priyanka Chopra delivered in spades. It pains me that this woman with so much talent is relatively unknown here in the US. Again, I suspect that won't be the case for very long either."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "Swapnilagarwal",
        "review_rating": "7",
        "review_title": "This Mary settles for a SILVER!",
        "review_detailed_main": "Debutante director Omung Kumar's 'Mary Kom' is an inheritance in many ways – a biopic, a sports-based (non-cricket) film, a woman- oriented subject. However, as a combination of all 3 (sportswoman biopic), it is a first in B'town; more so because unlike past biopics which were based on long-lived sportspersons, this one is based on a 32-year young boxer. Right from its first teaser, it was being termed as one of the most awaited movies of the year and senior PC's ambitious film. A brief movie dissection punch-by-punch as follows:\n\n\u0095 Plot: Being a sports biopic, comparison with last released same genre flick 'Bhaag Milkha Bhaag' is inevitable. Parallely, being based on woman boxer's struggle to pinnacle, comparison with Oscar winning 'Million dollar baby' (MDB) is not unjustified. However, Mary fails to match the glory of either. The movie, as expected, takes you through the life and struggle of a Manipuri girl who nurtures the burning desire of playing this male-dominated sport since childhood. The narrative is fast and bang-on esp. in the first half. The second half, however, is too cut-short and emotional, lacking thrill-element (which is a must in a sports movie). In fact, the movie would have been crisper without an intermission considering its short length. However, it does manage to highlight the bleak side of Indian sports management and dirty politics involved. It borrows its coach-trainee relationship from MDB. Most importantly, it underlines the efforts and sacrifices of Onler (Mary's husband). The world forgets those heroes behind the heroes we know! This one is a salute to such support-systems. National anthem at the end does manage to give patriotic goose bumps!\n\n\u0095 Cast: It was supposed to be, and definitely is, an all Priyanka film. PC has tried her best to step into Mary's shoes be it the body language or rigorous physical training and exudes the vulnerability and dilemma of 'mother-boxer' Mary impeccably. However, she could not take out the glamorous Chopra from her character which she ably did in 'Barfi'. May be, her physical attributes went against her playing a North-Eastern girl. All this should not demean her otherwise stellar performance. Fortunately, all other (regional) actors appear more believable. Darshan Kumar as the underplayed Onler performs well while Nepali actor Sunil Thapa as the coconut (tough outside, soft inside) coach is brilliant.\n\n\u0095 Music: Music by Shashi-Shivam is a letdown. Barring \"Ziddi dil\", no other song impresses much. As I always say, songs in realistic movies are a bane, so does happen with 'Mary Kom'. \"Salaam India\" could have been come at end while \"Ziddi Dil\" could have been repeated in second half.\n\n\u0095 Flaws: Lot many things stopped 'Mary Kom' from becoming an epic viz.: - A less impressive climax - Too many brand-endorsements intertwined (steal away credibility of a biopic) - Lack of entertainment quotient (majorly due to no other star except PC)\n\nDespite these flaws, Mary Kom wins due to its honest intent to narrate the story of a living legend and good performances by most star-cast. Sanjay Leela Bhansali and Viacom movies deserve accolade for choosing to make movie on a non- glitzy subject like this. This magnificent Mary might not win gold (at box-office and award- ceremonies) but does manage to strike silver and wins hearts to quite an extent."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "mrinalmmehta",
        "review_rating": "8",
        "review_title": "My Review!",
        "review_detailed_main": "Priyanka Chopra not only portrayed the life of Mary Kom beautifully but did a fantastic job playing Mary Kom. Being Miss World and acting Mary Kom, I'm sure is something hard to combine. Hat's off to Priyanka Chopra & Mary Kom.\n\nPeace Out!"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "et-36345",
        "review_rating": "10",
        "review_title": "EXCELLENT",
        "review_detailed_main": "PERFECT movie, they did a great job reinforcing the character very well."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "snethaji",
        "review_rating": "3",
        "review_title": "Miss fit cast and bad screen play",
        "review_detailed_main": "Priyanka is miss fit and lacks of preparation for the role. Looks really cinematic when the fights on. Screen play is lacks and didn't hold with audience. Support cast could've been better. Story is fine but but direction not turns you into the movie May be for really Mary, you see it not for PC. so *** for Boxing ** misc ***\n\nBollywood need to come up with good screen play rather than star values, it wont work all the time.\n\nBecause PC, the whole movie will not run at the same time, when you make a movie on sports star, kindly do the preparation , do not insult them even a 1%."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "jamim63",
        "review_rating": "9",
        "review_title": "Watch IT",
        "review_detailed_main": "One of the best biography film of Bollywood Industry. And underrated too. Priyanka was mind blowing. Great Indian. I'm not even an Indian still felt the ending from my heart."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "braddugg",
        "review_rating": "4",
        "review_title": "A glorifying story was trivialized and fictionalized to an uncomfortable level.",
        "review_detailed_main": "A glorifying story was trivialized and fictionalized to an uncomfortable level.\n\nIt was a disappointment but not totally unwatchable either. It's a story where a small-town girl becomes a champion against all the odds. The odds are scattered and not etched out well. There seems to be no or rather little struggle in the making of this champion. So it was totally appalling to see such an inspirational personality being cowed down because of lazy writing and directing. I am not interested in her love story and the birth of her kids. I was more concerned with how she became a world champion, what it took and what did she go through. Surely there is no feeling whatsoever that this film evokes. Apart from generating a couple of laughs, this film actually made me feel nothing.\n\nThe film more or less seemed to be promoting products like Sugarfree and Iodex and other brands liberally and at will. I wish it stuck to content and story telling than these uncalled for promotions.\n\nI thought that the precedent was set superbly by Bhaag Milkha Bhaag and films like these would take the mantle further by bringing us close to the lives of such athletes. If, Bhaag Milkha Bhaag to me is an inspirational film, this seems to be a like a page in the history, where scenes are written based on the material available on Wikipedia page.\n\nSad to say that this a Bhansali production and what is more saddening is that he is the creative director also. So his creativity comes up in set designs, dramatizing things when not needed, bringing conflict just for the sake of it, and even making people stand for a national anthem in theater. I am primarily away from the likes of Karan Johar, Sooraj Barjatya and even Bhansali and I have gone to this film unmindful of the fact that this is a Bhansali production. No wonder, I returned home disappointed.\n\nPriyanka Chopra does not look like Mary Kom, but looks more like a made up plastic fighter. She has not got into the spirit of the athlete itself. More than the actress, I blame the writers and directors for doing such a pathetic job.\n\nThis is your average fare, which can easily be missed. Any boxing fan want to watch a great boxing film, go for \"RAGING BULL\". For the average film going audience this can be tried for killing time mercilessly. A generous 2/5 for this."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "shaluk-19500",
        "review_rating": "8",
        "review_title": "Worth watching..",
        "review_detailed_main": "Amazing movie.. Totally worth watching.. My fav. One... But I have 1 issue In the place of PC we should have A north eastern actress..Then it would be better..Sometimes I feel like this.. PC did a great job..no doubt... But through it,we will get to see the talent of north eastern India.. Casting PC gave msg to India that north east are not part of india..Somehow it did.. We should not be biased towards them.. Rest if we talk about movie,it's really amazing..."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "pkharb",
        "review_rating": "9",
        "review_title": "Director (Omung Kumar) has not done full Justic with thisTrue Story",
        "review_detailed_main": "Mary Kom is a true inspiring story of a Women's Boxing Champion. The struggle of a woman through the not-so-encouraging setup of the Indian Boxing Association, the hardships of family and motherhood and the wrath of a protective and concerned father is depicted to perfection by one of the marvels of Bollywood, Priyanka Chopra. One of BIG good thing is that this is one of the best Family movies you can watch, because these days, it's very difficult to find a Good movie can be watch together by a Family. This is very inspiring for children too and very Good songs (Jiddi) and also very good stunt by Priyanka Chopra. I would definitely recommended this to watch. Director (Omung Kumar) has NOT done full justice with the true story of a Woman Boxer. I was expecting this must be made like Rocky. This is probably one of the Best Movie, but File Director (Omung Kumar) disappoint the audience and failed in many areas, where films like this one can do much better and succeed like Rocky. It must be in two part but it was squeezed in one compacted version with a kind of short duration film. Seems like film director was in a hurry to make this film with a lot of flaws."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "aman-tandon-chrome",
        "review_rating": "3",
        "review_title": "Not so good",
        "review_detailed_main": "Mary Kom is not an unbearable film but it is largely unwatchable. It was painful to see the most hardworking sporting star of India being reduced in a film that is a insulting blend of Chak De! and Bhaag Milkha Bhaag. Obviously I went in with far too many expectations but this film isn't an heartfelt attempt at film-making. If you at all decide to watch the film, do so for Priyanka who upholds the unbreakable spirit of Mary Kom in its most pristine form. When everything else scrambles apart, Chopra courageously puts in better than her best foot. I wish the story could give both Chopra and Kom their dues. Sadly magnificent Mary loses herself in the maleficent trappings of Bollywood floss."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "pinkynovember",
        "review_rating": "10",
        "review_title": "Superppp",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "dragonite_fire007",
        "review_rating": "5",
        "review_title": "Too Long!!!",
        "review_detailed_main": "The director seems to have got overwhelmed with the magnanimity of the script with him and wandered off everywhere.\n\nThe movie was too long, the editor could have done a much better job to keep the audience interested. And the dialogues seemed to lack the punch to incite a Nationalistic feeling in our hearts about a woman who overcame so much to play for her country.\n\nActing wise PC seems to have put in her best for this movie but her performance couldn't really tug your heart strings. Somebody other than her would have been a better choice I feel.\n\nThe hilarious part was the product placement with Iodex and Tata Salt being some :P"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "SivakumarBalachandran",
        "review_rating": "9",
        "review_title": "Mary Kom hits the right chord",
        "review_detailed_main": "Bollywood these years has come up with so many women empowerment/ female centric scripts. Mary Kom is a gem to the league. Mary kom as the title says it is a bio-pic about the India's talented sports queen Mary Kom and her journey over the years in the world of amateur female boxing. Set in the backdrop of Manipur the movie starts from Kangathei a small village about a poor farmer's girl chungneizang and her dream to become a boxer. The story travels and takes us through the authentic streets, landscapes, people and life in Manipur. It rolls over different time periods and depicts phases of Mary's life and her rough journey to achieve the 6 times world championship. Mary Kom played by ‪#Priyanka‬ ‪#Chopra‬ had lived the role. She has pushed herself to the extreme horizons in acting and the result is undoubtedly exceptional. She is bold, daring, stubborn, gutsy, brave, courageous, lovable, affectionate respectful, and at the same time sentimental and brought out all these emotions well. PC ji you are definitely in for the next national award. She has changed the views we had about her skills and made us salute and respect through this honorable attempt to depict Mary kom's life history. She has completely nailed it. Sunil Thappa as the coach has done 100% justice to the role. Darshan kumar as Onler Mary's supportive husband and the football coach renders it to the right level. The debut ant director Omung Kumar has really etched this story picture perfect and added exact ingredients to make it like a movie which is not a documentary nor entertaining commercial yet it never fails even a single minute to engage you. Though the movie is not the exact raw life that Mary lived it is fictionalized in a way to believe. Music was so inspiring particularly salaam India and ziddi he. The final climax notes and national anthem made audience to stand and salute. Cinematography chronicled Mary's life on celluloid with great finesse. Editing was perfect in keeping the up pace in the movie's flow. On the series of sports films so far like Laagan, Chakde India, Bhag milka Bhag. Mary Kom is an outstanding and laudable. A must watch for all Indians. It deserves to be translated in all Indian languages and to reach every nook and corner. Overall the magic of PC and director Omung Kumar has hit the right chords. Get in for lots of goose bump moments and full dose of patriotism."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "a_khan666",
        "review_rating": "10",
        "review_title": "Excellent!",
        "review_detailed_main": "This is an awesome movie! Priyanka Chopra has done an excellent job in portraying as Mary kom. It looks like she has trained an enormous amount for this movie and I am hoping that she will win a lot of awards for this. It premiered in TIFF (Toronto International Film Festival) and that should say a lot about the quality of the movie! It was great to have an insight into Mary Kom's life and to know about what a great boxer she is! Hoping the film will break all records in India as well as in the international arena. I have seen the international version I guess since I hear there is an Indian version of the film too! All in all, a great movie to watch with great actors, directors and producers! Hoping to see more of these kinds of films!"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "HonestCritick",
        "review_rating": "3",
        "review_title": "Really Disappointing! Would recommend a pass to this one.",
        "review_detailed_main": "When we were hoping for another biopic with a Bhaag Milkha Bhaag style this one disappoints to the core. The movie is a result of bad choices in terms of direction and star cast and do no justice to the real Mary Kom.\n\nI wish they focused more on the sport rather than the star cast and the love story. It's time our movie makers gather some courage and stars act in a real manner. Really upset with this outcome.\n\nThis is made only for whistles and money. A movie of this kind needs passion and courage and I doubt if the director or the stars have the reputation of this kind. This adds to their poor reputation."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "Somanimayur",
        "review_rating": "10",
        "review_title": "Awesome movie!!",
        "review_detailed_main": "Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here...Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here Excellent film.. a must watch.. A lesson more then a film.. An emotion more then a lesson.. A teacher more then an emotion.. lovely film.. A great gift from bollywood on teachers day.. After such a long period a film like this has been here"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "gary199301",
        "review_rating": "1",
        "review_title": "A classic Indian movie",
        "review_detailed_main": "First, Mary Kom, jolly nice to know about a good player from India with a very motivating story. Nice to see an inspirational woman player from a sports-crippled country.\n\nNow moving to the movie. -=IT's CLASSIC Indian=- movie with due emphasis on dramatisation and niche (by that I mean liberally copied) special effects. The best way to introduce a great person is by making a documentary, but no, we're Indians. Unless we showboat and sugar-coat the same on a 10 hours long movie, it displeases our Gods.\n\nPathetic movie, pathetic acting, pathetic effort, pathetic direction, great intention. Here, I'll save all you viewers some time and effort - http://en.wikipedia.org/wiki/Mary_Kom. Don't be lethargic and just watch movies, read once in a while. This Wikipedia entry will actually tell you something about her life and save you from all the (severely) cheap movies that we Indians make."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "prabhulaldamji",
        "review_rating": "9",
        "review_title": "And the Award for Best Actress goes to Priyanka Chopra",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "sandeeppn2",
        "review_rating": "9",
        "review_title": "Inspiring movie",
        "review_detailed_main": "Destiny approaches u faster if u run faster towards destiny.\n\nDon't scare anyone so much that she dint scare the scare itself .\n\nFilled with punches like this . Priyankas acting was awesome .The best thing about this movie is its message,and the message was \"If u are determined enough no ODDS can stop u\".Its like the movie Million Dollar Baby ..but its story is TRUE.Mary Kom really a living legend but I have a great respect to her husband after seeing the movie . This movie is filled with many situations u often experience in your life.Like not recognizing a 3 times world champion ,rudeness of govt. officials etc . I suggest everyone to Watch this with your family ..."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ravithakor23",
        "review_rating": "5",
        "review_title": "Could have been a lot better. Just a good movie not a good biopic.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "vikasjoshi-99705",
        "review_rating": "9",
        "review_title": "Magnificent priyanka",
        "review_detailed_main": "What a performance by priyanka ..Stunning she delivered another top notch performance ..You can feel her hard work to portray mary kom role ... Fantastic...Hats off to director omung kumar for making a superb sports biopic. ..Must watch it ."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "shamik_ghosh-1",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I watched \"Mary Kom\" with my family. It's simply a foolish movie. I think, it to be a political brainwash film in the disguise of a \"sports film\". The name \"INDIA\" is unnecessarily used........probably just to capture the mainstream audience. Nothing realistic is there about Manipur's socio- political reality. Even the sets are unrealistic. The world championship held in china is full of advertisement of \"Usha\" and \"Polycrol. The character and whole thing is vaguely drawn. The last tension is childish.......any third-grade director wouldn't dare to do such melodramatic thing. \"Chak de India\" or even \"Bhag Milkha Bhag\" is much better. If you just need to see a nationalistic foolish fairy tale, watch it. But if you are a little bit conscious about intellect in films....don't dare to watch."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "Harshithnagraj",
        "review_rating": "8",
        "review_title": "Not a best biopic but it punches",
        "review_detailed_main": "Watching this film is 2020 makes me feel proud for Mary kom how she broke all obstacles and succeded in life. But in film there is flaws but still it is a good movie and chopra's acting is awesome but supporting cast has less screen time and only chopra rocks the screen but it's still really a good biopic"
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "rtoac1",
        "review_rating": "10",
        "review_title": "A sincere effort",
        "review_detailed_main": "I found this film to be an sincere effort on the part of the cast and crew to pay tribute to a legend of our times.\n\nThat 6 time world boxing champion from Bharat Mary Kom is a gutsy lady is clear from how many sensitive topics have been showcased in this film.\n\nThis is the first time I've seen a Hindi film showing how a sportswoman fought back to be a champion after motherhood. The internal struggles, mood swings, ego lashes so easily exposing the gray shades of the protagonist are so boldly laid bare on screen. Which then makes us truly appreciate the greatness of Mary Kom the gutsy human! To not be afraid to show her weaknesses and face it come what may, just like she faced her opponents in full attacking style in the ring.\n\nAn inspiring film for all the girls out there go chase their dreams no matter what - watch how she chose boxing even over her father when pushed to choose one. The father sees her promise and dedication and reconciles later.\n\nPriyanka Chopra has prepared really well and hard for this role, picking up the accent and physical training needed.\n\nThe supporting cast has also performed very well.\n\nSincere effort by the first time director Omung Kumar.\n\nA must-watch."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "prahladagarwal",
        "review_rating": "4",
        "review_title": "What a mess of a great story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "elenacalvillo",
        "review_rating": "10",
        "review_title": "Strong Woman",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "ajay-raghav-226-503514",
        "review_rating": "4",
        "review_title": "Unimpressive and uninspiring",
        "review_detailed_main": "This movie is a combined advertisement of USHA, PregaNews, Intex and what not. The bouts are more interesting live than what was shown in the movie. I thought maybe the movie was too real but that's not true either. There are at least four deviations from reality that Mary Kom herself admitted. Unlike many others, I think Priyanka was not the best choice either. Mary is a legend and this movie could have been much better."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "MuviFan73",
        "review_rating": "8",
        "review_title": "Decent entertainment gets praised for being biopic!",
        "review_detailed_main": "Tone, Script & Story: The movie highlights biopic referring to personnel and professional life of Indian athlete Mary Kom until the time the movie was released.\n\nThe movie contains elements necessary to be entertaining and being successful at box office. Apart from Mary's determination the factor that I liked most was construction and characterization of coach. He exactly knows what his candidate wants. At one instance he opposes pregnancy as a hurdle, but after the events occur he highlights the positives of a mother.\n\nDirection, Screenplay, Cinematography: As far as direction from Omung Kumar is considered, I would say Sarbjit excels as compared to this one. Screenplay and cinematography are justified. Most of the people applaud Priyanka's makeover, for me it was average. Music: Music is good. Acting: Acting was justified as well.\n\nFinal Verdict: When it comes to entertainment it's a decent attempt. It deserves to be in your collection because mostly of its nature of being a biopic."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "sivakumar-160590",
        "review_rating": "9",
        "review_title": "Has some flaws but saved by good acting",
        "review_detailed_main": "I really liked the movie very much but I will list the flaws first\n\nRidiculous product placement that are too obvious.The makers don't event try to hide that they have placed advertisements in the movie. Too many clichés from all sports films.We can find all the usual dramatizations of sports like a villainous opponent,hero(ine) falling and rasing just before end to win the match etc.\n\nmay be just two but these are really spoilers for the movie\n\nThe good thing about the movie. Priyanka Chopra's Acting . The character of Mary Kom. Beautiful picturization of Mizoram. Mary Kom is a very powerful character and Priyanka Chopra does justice for the character.Her portrayal of mother torn between sons and career is amazing."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "eldreddsouza",
        "review_rating": "4",
        "review_title": "Very poorly directed film.",
        "review_detailed_main": "I was excited about this film but it turned out to be a very horrible biopic. The director of the film should contemplate on his choice to be a movie director. He seems to have no vision, no imagination, whatsoever. The character development is poor. You just can't relate with the struggles of the protagonist, which feels so because the film is too rushed. We have seen in films like Dangal how a good biopic is to be made so the excuse that how much can you fit in a two hour long movie is no valid excuse at all."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "adityamestry16",
        "review_rating": "8",
        "review_title": "Watch it for Priyanka Chopra",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "nipun45",
        "review_rating": "1",
        "review_title": "Embarrassment",
        "review_detailed_main": "Mary Kom is a National Hero and this movie is an insult on her name.\n\nPriyanka Chopra is not athletic at all and her boxing postures are embarrassing. Atleast they should have casted a real boxer in a boxer biopic."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "gautamkumaar",
        "review_rating": "10",
        "review_title": "Priyanka Chopra is the saving grace in Mary Kom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "rajatdahiyax",
        "review_rating": "5",
        "review_title": "Respect for Mary Kom,but this was exaggerated crap!!!!",
        "review_detailed_main": "Mary Kom is a 2014 Indian biographical sports drama film directed by Omung Kumar and produced by Sanjay Leela Bhansali. The film is a biopic about five-times female World Boxing Champion and Olympic bronze medalist Mary Kom, following her story from her childhood in India to her victory at the 2008 World Boxing Championships in Ningbo City. The story and screenplay were written by Saiwyn Quadras, who also suggested the storyline to Kumar for his directorial debut.\n\nThe film stars Priyanka Chopra in the lead role as the boxer Mary Kom, with Darshan Kumar and Sunil Thapa supporting as her husband, Onler Kom and M. Narjit Singh respectively/\n\nMost of the movie is totally fictional,bearing no resemblance to reality and that too not portrayed properly,a huge disappointment..."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "gautam-gr",
        "review_rating": "5",
        "review_title": "Heartless & uninspiring",
        "review_detailed_main": "Heartless & uninspiring treatment to an average 'real' story.\n\nThe focus of the movie seemed more to showcase the actress in Priyanka rather than the sports person Mary Kom was.\n\nMoreover, with Farhan Akhtar's Bhaag Milkha Bhaag setting the bar so high for a biopic, Mary Kom fails to justify the need to make a movie on a still-sports-active boxer.\n\nUninspiring music adds to the insult.\n\nWhile Priyanka proves she is a great actor, all others around her were average or below average! Right from his coach to his father to even his husband - average or below average."
    },
    {
        "movie_id": "tt3001638",
        "movie_name": "Mary Kom",
        "movie_rating": "6.8",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "A pure filmy depiction of an inspiring, exceptional real life tale of a brave Indian sportswoman & a proud mother.",
        "review_detailed_main": "Before going for MARY KOM this Friday, I had four positives in mind about the attempt made, giving it a finer edge in comparison to a few recent biographical movies coming from Hindi Cinema.\n\nFirstly it's a biopic made in an Industry which doesn't like to venture in this particular genre in terms of commercial cinema and that too talking about the life of a woman, which is even a rarer attempt by the makers unarguably.\n\nSecondly it's supposed to be a sports movie which again is a genre rarely chosen by our reputed directors and that too focusing on Boxing, a much lesser followed sport than Cricket, Hockey, Athletics or Wrestling in India.\n\nThirdly and most importantly its not a biopic of an old person, who had done it many decades ago. On the contrary it's a film made on the life of a talented sportswoman, rather a mother, who is still young at 31 and still kicking to go further in her achievements fighting many more competitions coming ahead in the next years. And one seldom gets to see a biopic of a person who is this young and still active in his or her particular field representing the country all over the world, so proudly.\n\nIn cinematic terms, the project also had a worth mentioning strong merit of being the debut directorial film of a highly experienced and known artist Omung Kumar who began his career as an anchor almost two decades before and then remained associated with numerous reputed projects as a Production Desinger/Art Director including films like BLACK and SAAWARIYA.\n\nSo having these four positive points in mind and one negative one about the unnecessary glamourization of an important bio-pic, featuring Priyanka Chopra, I was excited to watch the film, only to get disappointed to a much larger extent than feared, witnessing the dismal attempt quite sadly.\n\nBut before moving on to the review, I would like to clearly mention that this is a just an honest analysis of the movie made on the life of the highly respected sportswoman of our country titled MARY KOM and not in any way pointing towards the iconic figure or her majestic achievements at all.\n\nThe film begins with a fine opening sequence shuttling between the present and past of a pregnant woman being taken to the hospital by her husband, amongst the tension spread in the city due to the revolting groups. The pretty weak 'boxing training' scenes coming next, straight away remind you of the masterpiece MILLION DOLLAR BABY revolving around another brave lady boxer, directed by the maestro Clint Eastwood. And then as it progresses further one feels truly amazed to see everything happening so easily in a pure filmy manner, unable to move or impress the viewer neither emotionally nor excitingly.\n\nIn fact some poor choices made in the supporting cast (like Mary's mother and her coach), too many below average songs coming repeatedly, uninspiring fight sequences and a quite lifeless direction by Omung, completely ruins the whole excitement felt in the beginning with a clear indication of the film being nothing more than a mediocre attempt dealing with an the important genre of bio-pics unfortunately. In other words, this is not anything even close to a realistic biographical movie, but a mere commercial project eyeing for a quick killing at the box office getting some instant attention and few claps here and there en-cashing the national spirit. For instance, one wonders why we always tend to go overboard with a filmy execution of all training sequences in such a film (along with a typical background song) and also what can you say about the vision followed in a sports movie when in one of its international fight sequences, a German coach hits his own reputed contestant in anger (on her head), while she is coming back to him after losing the bout. Moreover I strongly don't think the talented lady's real life had been as easy as depicted in the film with everything happening on its own without any major hassles or clashes.\n\nGiving the actual truth, I remember only one impressive scene in the entire film when Mary apologizes to the federation manager and then few good moments towards the end with another Bollywoodish kind of climax fight, ending with the national anthem being played at full length (asking people to get up from their seats) which ideally should have been avoided to end it on some different kind of inspiring cinematic note.\n\nIn short, I deeply respect the exceptional & unbelievable kind of achievements made by the brave Indian sportswoman MARY KOM, both in her personal life as a mother and in the sports career as a boxer. But I am unable to praise this too plain & filmy biopic made on her extraordinary life in any of its department be it cinematography, background music, performances or direction, despite the earnest attempts made by Darshan Kumaar (as Mary's husband) and Priyanka Chopra (who again was a wrong choice made for the role, as predicted by many).\n\nHence you can go for it as an informational film, to know more about the pride of our nation, the fearless MARY KOM, who is still ready to win many more fights in the next Olympics too. But not as any great inspiring biographical movie doing any kind of acceptable justice to the subject matter here, putting it honestly."
    }
]