[
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "chetan_r411",
        "review_rating": "6",
        "review_title": "Nice propaganda movie:",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "nadkarnisumeet",
        "review_rating": "6",
        "review_title": "Less of a biopic, more of an entertainer!!",
        "review_detailed_main": "Azhar review :\n\nBefore reviewing Azhar, it's important to understand what a biopic means and how Bollywood has misunderstood it:\n\nA biopic is a cinematic adaptation of various events of a non- fictional personality (living or dead) dramatising (to some extent) crucial aspects of his/her life.\n\nUnfortunately, Bollywood mistakes biopic to be a cinematic \"glorification\" of a real life person to such an extent that it turns him/ her in to a superhero of sorts. It worked fine with 'Neerja' whose story itself, was heroic. But when you do that to a controversial figure like Mohammad Azharrudin, it ends up looking fake. Truly, the climatic revealation of why Azhar fixed those three international matches of his otherwise illustrious career takes away all the good the movie built up to right till then....\n\nA long disclaimer read out in the start tells you that the movie is not a biopic but an adaptation of Mohammad Azharrudin's life for entertainment purposes. Wow! I wish they had also stated that it will end up making him in to a messiah of sorts while tarnishing his fellow players including Ravi Shastri and the legendary Kapil Dev.\n\nAnyways, the film covers all the major events of the former Indian captain's life - from his childhood when his Nanajaan (Kulbhushan Kharbanda, endearing) motivates him to vent his anger through the cricket bat rather than words, his still unbeaten back to back three centuries on debut, his handling of resentful senior players on being suddenly elevated to captaincy position as well as his personal life - initially blissful with his first wife Naureen (Prachi Desai) and his subsequent affair with bollywood actress Sangeeta (Nargis Fakhri).\n\nPresented in non linear format, the narrative flows well and certain scenes like Azhar talking cricket lingo in his awkward first meeting with Naureen and his ad shoot with Sangeeta which is the germinating point for their affair are well executed.\n\nOn the other hand, certain questions like how did Azhar learn his trademark flick shot, what made him the outstanding fielder he was, how did he handle the tremendous success he got as a captain before the match fixing allegations struck him are unexplored. I wish director Tony D'Souza had touched upon these aspects.\n\nEven the match fixing scandal is fleetingly passed with one scene where the bookie (Rajesh Sharma) is introduced to Azhar in the dressing room and a few scenes later, a deal is struck between the two of them.\n\nOn the film's positive is Emraan Hashmi knocking it out of the stadium with a solid performance. He doesn't physically resemble Azhar but gets the cricketers mannerisms and body language spot on. Maturing as an actor with every film of his, Emraan has come a long way from his serial kisser days. Of course, he gets his lip lock in Azhar as well but now, the guy can act like never before...\n\nThe supporting cast is a mixed bag. Rajesh Sharma is convincing as the bookie. Prachi Desai is okey dokey. Nargis Fakhri still can't act and here, she doesn't even try. Azhar's fellow mates (Shastri, Siddhu, Kapil, Manoj Prabhakar) are too one dimensional and caricatured to leave a mark.\n\nOn the tech front, editing appears flawed with an entire scene repeated for no rhyme or reason. The two romantic numbers are soulful but the Oye Oye song is poorly recreated.\n\nOverall, Azhar works better as an entertainer than a biopic. It's desperate attempt to make him a messiah is its undoing. One time watch, nevertheless!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "7",
        "review_title": "Certainly a 1 time for many reasons, after long time a good Film from Balaji",
        "review_detailed_main": "AZHAR REVIEW :- One of the most awaited film of Emran Hashmi's career from its trailer release to today. When i saw the Trailer of Azhar that time only, i decided to watch this film on First Day First Show. Reasons are known, Emran was looking promising after a long period plus i was interested in knowing our Cricketer Azharuddin's controversial life. Finally watched the Film and i am completely satisfied with this product, it completed all my expectations which were not high.\n\nActing- Excellent job by Emran Hashmi. I haven't seen his some acting oriented movies so i cant decide but still i say it is his Best Performance i've ever seen. His walking Style, Batting style, Dialogue delivery everything was perfect. Not award winning though, but still Kudos for him. Prachi Desai, Nargis Fakhri and Lara Dutta failed to match Emran. They didn't have much screen space, may be that was the reason but really their Make up talks louder than their Acting. Other star cast was strictly okay.\n\nMusic :- Certainly, not up to the mark. Songs just come and go. Nothing to remember. Same with Background Music.\n\nCinematography :- Worse. Really some scenes looks like daily soaps, especially Cricket match scenes. Disappointing field for the film.\n\nScreenplay :- Good but not great. Good because of 130 minutes run time, and not great because editing could have been better. Many scenes and especially songs deserves cut. 2-3 loo breaks are there but still Film doesn't make you feel bore.\n\nDialogues :- Superb ! Clap worthy, whistle worthy and touching. I don't want to spoil much cause it will affect the impact of those dialogues.\n\nDirection :- First of all i want to praise Tony D'Souza for daring to make controversial film like this and want to thank him for revealing some truths about Azharuddin. Direction is very good, surpassed my expectations. Tony crafted film very well, especially Interval and Climax scene.\n\nFinal Words :- Overall a good movie which deserved your one time watch for many reasons. We love you 'Fighter Azharuddin' forever. Thanks to Balaji Production for making this film so that we realise some unknown facts about our Azhar. Go for it, and don't watch it as a movie watch it as Azhar's real life story, movies like this comes very rarely. 7/10 stars by me."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "khalid-71691",
        "review_rating": "",
        "review_title": "Emraan is back with his absolute amazing talent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "A Decent Watch!",
        "review_detailed_main": "Before Emraan Hashmi begins to portray Azhar, A Disclaimer shows up, saying: The following film is NOT a Biopic on the sport legend, but a rather adaptation on the much-talked personality. So, 'Azhar' is not a biopic, even though it covers almost all highlights of Azhar.\n\nWhat works, despite that rather underwhelming disclaimer, is the fairly engaging narrative, held nicely by Director Tony D'Souza & Lead-Actor Emraan Hashmi, who bring merit & some sincerity in the goings-on. Though far from perfect, 'Azhar' is a decently made film, that certainly isn't anywhere close to being bad.\n\n'Azhar' is Based on the life of Indian cricketer and former national team captain Mohammad Azharuddin. Right from his triumphant success, to his controversial professional & personal life.\n\n'Azhar' is interesting in parts. Watching Azhar romance between his two wives, as well as take on captaincy in the Indian Team, offer some genuinely arresting sequences. His triumph does leave a mark. However, when Azhar is dragged to court for \"match-fixing\", the courtroom sequences that follow, are plain ordinary. The courtroom sequences lack fire. Had these sequences been better, 'Azhar' would've been a far superior adaptation.\n\nRajat Aroraa's Screenplay is quite decent, but why is the drama in the courtroom so lazily written? The Writing needed to be stronger, no two options on that! Even the dialogue, range from massy to entirely ridiculous. Tony D'Souza's Direction is well-done. He has handled the film competently. Cinematography is good. Editing is mostly crisp, but the second-hour could've been sharper. Music by Various Artists, is excellent. Background Score merits a special mention.\n\nPerformance-Wise: Emraan Hashmi as Mohammad Azharuddin/Azhar, is at his most sincere. The actor is in form, delivering a credible performance as the legendary sportsman. This is among Hashmi's better works, without doubt! Prachi Desai as Naureen, the first wife of Azharuddin, is excellent. Nargis Fakhri as yesteryear actress Sangeeta Bijlani, the second wife of Azharuddin, looks hot as ever, but falls flat acting wise. Lara Dutta as Meera, who fights against Azhar in court, is strictly okay. Kunaal Roy Kapur as Reddy, who defends Azhar, adapts a south Indian accent so fake, that he turns him into a caricature. Rajesh Sharma as M.K. Sharma, a slimy match fixer, is top-notch, as always. Others lend fair support.\n\nOn the whole, 'Azhar' isn't power packed, but its certainly watchable & also well-done in parts."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "Azhar Review: It's Time to Set the Record Straight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "samarthtrivedi04",
        "review_rating": "4",
        "review_title": "Poor Filmmaking spoils the fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "hassan-arafat",
        "review_rating": "7",
        "review_title": "Very good move from all perspective",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "kumarvarun1989",
        "review_rating": "4",
        "review_title": "A fascinating character but a dispassionate film",
        "review_detailed_main": "Azhar lacks spine. It is evident in the long disclaimer preceding the film in which the team seems to be making a claim on cricketer Mohammad Azharuddin's colourful and controversial life as a source material yet maintaining that it is a fictional account. All to escape the legal battles the film could land them in.\n\nAzharuddin (Emraan) is a fascinating character to have built a dispassionate film on. A man, who rose meteorically because of his game, the way he let his bat do all the talking on the field. He fell from favour just as fast because of his covetousness and his alleged involvement in the match-fixing scandal that rocked cricket. He is a man of frailties and shortcomings both on the field of cricket and in the arena of love. But instead of exploring the many shades of grey in him, Tony D'Souza attempts to defend and validate him. Such is the bias that the other players — Manoj, Ravi, Navjot (only first names, no surnames mind you) — get the wrong end of the stick.\n\nManoj is made to come across not just as jealous and vengeful but selfish, playing for himself than the country and crude and unrefined to boot. Ravi is nothing but a rake. As though that wasn't enough you have Kapil tell Azhar It's the good-for-nothing kids who trouble the class monitor the most. Poor Azhar! Such is the eagerness to justify him that D'Souza makes it seem as though the whole bad world is out to get him. From his haughty fan-turned-prosecutor Mira (Lara Dutta) to the condescending owner of the gym that he inaugurates. Why he took the Rs. 2 crore from bookie M.K. Sharma and what he did with the money is portrayed in such a way as to earn him some desperate brownie points. Even his walking away from an ostensibly fine marriage into the arms of actress Sangeeta Bijlani (Nargis) is turned into a soppy inevitability with him righteously mouthing lines like A broken relationships doesn't actually mean an end of it. But what of Naureen (Prachi), the one who was wronged? When it comes to the craft, the film looks too outmoded in the way it has been mounted — the loud background score soaring over everything else and dialoguebaazi in the name of conversations.\n\nThe lines, some of them utterly inane and vacuous, reminded me of heavy duty dialogues of Once Upon A Time In Mumbai. In that masala flick they seemed entertaining, here desperately out of place.\n\nAzharuddin's love for his grandfather becomes a way to draw out melodrama; he gets selected in the national team just as granddad breathed his last. And then there is Azhar's father's obsession with his underwear: the mandatory crass comedy track.\n\nIn the name of acting you have Emraan being stiff, staring deep into the camera, looking far from his comfortable self. Prachi and Nargis weep buckets when they are not being coy. Nargis does it most inelegantly. If that wasn't all there is also Kunaal Roy Kapur as Azhar's lawyer. As yet another stereotype of the South Indian in Bollywood, he irritates to the hilt. So does the film."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "RosanaBotafogo",
        "review_rating": "7",
        "review_title": "it's good entertainment...",
        "review_detailed_main": "It looked boring, and it really was a little, if it weren't a biography it wouldn't be so interesting, despite the slight impression that it was a totally commercial film to clean the bar of Azhar, but it was worth it to plant that seed of doubt, to know the case and yes, it's good entertainment..."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "chhabrarohit",
        "review_rating": "3",
        "review_title": "movie is on the life of Azhar",
        "review_detailed_main": "Now Bollywood made a movie with the mixture of sport and drama. Before seen the movie i read writer got inspired from the Azhar's life so this will be the good movie. But its not like that, the movie is quite simple and the dialogue delivery is not that level. Now a days the standard of Bollywood is so high . Emran Hashmi act Azhar role and he has done great job. In the movie writer tried to show how India board committee slaps a life ban on Azhar. This movie tells the story of Azhar how much he suffered. As i told story is quite simple but writer shown to the society about the Azhar.At least now people knows about Azhar. Media is the great medium to give the knowledge to society. I want to thanks writer,producer who told the story of Azhar by movie."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "MovieRecipe",
        "review_rating": "8",
        "review_title": "However you judge him, don't miss the movie",
        "review_detailed_main": "The movie is not without its flaws though. The attention to detail is quite poor and product placements are too blatant.\n\nBut don't let that hold you back. The movie has all the elements of good, clean entertainment. Romance, humor, drama and some urgency make the movie a tight two hours that you won't be bored of.\n\nI don't know whether he did it or not. The movie doesn't argue one way or the other. What it argues is legality of BCCI's verdict. Azhar was the scapegoat of a scandal that had involvement of many on the field and off the field.\n\nJudge him however you want, don't miss the movie\n\n~ MovieRecipe"
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "munish-kumar786",
        "review_rating": "7",
        "review_title": "Loved the acting of emraan and Lara",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "lediscipledessocrates",
        "review_rating": "3",
        "review_title": "Irritatingly Yours",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "maneet-jindal",
        "review_rating": "",
        "review_title": "Real Story movie of only some minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "abphadore",
        "review_rating": "6",
        "review_title": "A Glimpse into the Controversial Life of a Cricket Legend",
        "review_detailed_main": "Azhar, directed by Tony D'Souza, is a biographical drama based on the life of former Indian cricket captain Mohammad Azharuddin. The film delves into the highs and lows of Azhar's cricket career, his personal life, and the infamous match-fixing scandal that shook the cricketing world. With Emraan Hashmi in the titular role, the movie attempts to present a nuanced portrayal of a man who was both celebrated and vilified.\n\nPlot Summary The story follows Mohammad Azharuddin (Emraan Hashmi) from his humble beginnings in Hyderabad to becoming one of India's most successful cricket captains. The narrative explores his rise to fame, his controversial personal life, and the allegations of match-fixing that led to his fall from grace. The film oscillates between the courtroom where Azhar defends himself against the charges and flashbacks that provide insights into his cricketing journey and relationships.\n\nPerformances Emraan Hashmi delivers a convincing performance as Azharuddin, capturing the cricketer's charisma, style, and vulnerabilities. Hashmi's portrayal brings depth to Azhar's character, showcasing both his strengths and flaws. Prachi Desai, as Azhar's first wife Naureen, and Nargis Fakhri, as his second wife Sangeeta Bijlani, add emotional layers to the story, though Fakhri's performance feels somewhat lacking in conviction.\n\nLara Dutta stands out as the determined lawyer Meera, who is hell-bent on proving Azhar's guilt. Kunal Roy Kapur provides comic relief as Azhar's loyal friend and lawyer, Reddy. The supporting cast, including Gautam Gulati and Manjot Singh, deliver solid performances that enhance the film's narrative.\n\nDirection and Screenplay Tony D'Souza's direction effectively captures the essence of Azhar's life, balancing the glamour of his cricketing achievements with the darker aspects of his career. The screenplay, written by Rajat Arora, provides a coherent structure to the biopic, interspersing courtroom drama with key moments from Azhar's life. However, the film occasionally falters in pacing, with certain sequences feeling rushed or overly dramatized.\n\nThemes and Execution Azhar explores themes of ambition, loyalty, betrayal, and redemption. The film attempts to present a balanced view of Azharuddin's life, portraying him as a flawed hero rather than a villain. It delves into the pressures faced by professional athletes and the impact of fame on personal relationships.\n\nWhile the film addresses the match-fixing scandal, it does so with a sympathetic lens towards Azhar, which may feel biased to some viewers. The depiction of cricket matches and behind-the-scenes politics adds authenticity to the narrative, though the film could have benefited from a more in-depth exploration of the scandal's intricacies.\n\nMusic and Cinematography The film's music, composed by Amaal Mallik, is a mix of peppy tracks and emotional melodies that complement the narrative. Songs like \"Bol Do Na Zara\" and \"Itni Si Baat Hain\" resonate well with the film's romantic and dramatic moments. Cinematographer Rakesh Singh captures the cricketing action and personal drama with finesse, using a palette that reflects the different phases of Azhar's life.\n\nConclusion Azhar is a compelling biographical drama that offers a glimpse into the life of one of India's most enigmatic cricketers. Emraan Hashmi's strong performance, coupled with Tony D'Souza's competent direction, makes the film an engaging watch. While the movie does take creative liberties and presents a somewhat sanitized version of events, it succeeds in humanizing Azharuddin and shedding light on his trials and tribulations.\n\nFor cricket fans and those interested in the complex lives of sports personalities, Azhar provides an intriguing, if not entirely unbiased, portrayal of a cricket legend's rise, fall, and quest for redemption."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "navdp",
        "review_rating": "6",
        "review_title": "Would have been much better like 'Azhar'",
        "review_detailed_main": "A poorly made movie which had a good story and a wonderful protagonist. Storytelling is the only thing which stands out. Director and Actors just donot add value to the movie. Characters r not at all worked out."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "narulagaurav",
        "review_rating": "1",
        "review_title": "Comedy or Propaganda?",
        "review_detailed_main": "Azhar the Movie, like Azhar the Kaalpanik/ Fictional Character mentioned in a disclaimer (at the beginning of the movie) - both of them lack spine.\n\nThis movie is a sad attempt to justify a character who was poor as a husband, as a person and as a father. Quite frankly, and as several of the other reviews on IMDb are mentioning, this is a clear case of propaganda that the actual Azhar is trying to indulge in.\n\nThe famous match fixing scandal of the 90s dragged in some big players, both in SA and in India. The legal cases against them were substantiated, and these individuals were subsequently banned from the game for varying periods of time. Are we questioning the calibre of the courts when we try to show these folks, several years later, as upright? Seems kind of 'easy to portray, but difficult to believe'.\n\nAzhar was first and always a cheat. In the game, in his marriage, in his relationships with his children (the famous affair with Jwala Gutta, who was his son's friend), and otherwise. Following the debacle in cricket, he went where most goons go - to politics. No guesses into the affiliation he sought and achieved.\n\nNow coming to the movie. The acting is unconvincing. The plot is poor. Great actors wasted. Dialogues are juvenile, at the best. Melodrama misplaced. The characters are shallow. The direction a guffaw.\n\nAs a final statement, I'd like to say that there was no research. This is just the case of a cheat who is trying to show the world he was victimized, when it was actually the reverse. The scenes seem purported from La La Land.\n\n1 star out of 10 is what this deserves."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "gopisureshkumar",
        "review_rating": "6",
        "review_title": "Cricket based movie",
        "review_detailed_main": "Tony D'Souza's fictionalisation of Azharuddin's life works in most parts, but comes out as a deeply eulogising exercise. The film doesn't address the greyer issues of Azhar's career, even when most of it is on the match-fixing allegations that the cricketer had to deal with.The film ends with Emraan saying today is 'Judgement Day' for Azharuddin. That to believe his story or not - the choice rests with the audience. Most people will believe Azharuddin's story. For Emraan HashmiAs most of us in this cricket loving nation would know, Azharuddin was a revered cricketer and the captain of Indian team, before he was banned from playing after he was accused of being part of a match fixing scandal in 2000."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "Rawal_Afzal",
        "review_rating": "4",
        "review_title": "One of the most confusing films ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "virusharma",
        "review_rating": "2",
        "review_title": "Truly Disappointing",
        "review_detailed_main": "Azhar Movie is biopic on Mohammad Azharuddin. He was involved in Match Fixing scandal. So when I started watching the movie I was expecting it would tell me how he took such bad decision but instead movie kept showing him as victim. Story could have shown why Hansie Cronje took Azhar name during controversy.There were lot of Grey areas which were not answered. Biopics are meant to reveal something but Movie just showed events which everyone knew.\n\nI expected movie to show how he became cricketer. Show us how he used to practice but there were hardly any scene about that. Imran Hashmi did good job as far as looking like Azhar. Acting was not bad too.\n\nThis Movie had lot of potential but it falls flat on face."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "sourabhagrawal-17606",
        "review_rating": "9",
        "review_title": "another best performance by actor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "dineshprakash",
        "review_rating": "3",
        "review_title": "Goof up between fact and fiction",
        "review_detailed_main": "Makers were completely confused about their point of view while making this film so as I was confused to decide my side. Only, one page disclaimer of film is in detail which says that it doesn't claim to be real other wise all scenes are very hurried. Makers assumed that every one is well versed with the personal and professional happenings in Azhar life. Flashback type of narration is boring. Cricket scenes are not interesting. Dialogues by writer of film Rajat Arora, are OK but most of the time go over board like in beginning of film, Azhar voice over comes that as an Indian Cricket Team captain, public used to of treating him like Damad, what is it!!!? Wouldn't it be better if he said like Beta. Writer had to be aware that it is not \"Once Upon A Time In Mumbai\". If actor is unable to carry emotional scene then director shakes the camera like in the scene where Azhar gets news of his maternal grand father demise. Court room scenes are also more about heavy dialogues rather then witty and intelligent facts. In serious court scene they insert comedy which comes prominently eventually drastically reducing the required impact of scene. Casting is ridiculous. Not a single actor convinces about the real name, he was portraying including female one. Emraan Hashmi as Azhar is OK. Prachi Desai as his wife looks pretty and emotes well especially in the scene when she gets information about another girl in her husband life through his indirect confession on T.V. Kunal Roy Kapoor as lawyer Reddy is fantastic. Rest are nothing to be mentioned."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "ketgup83",
        "review_rating": "5",
        "review_title": "\"Azhar\" is a golden opportunity gone wasted",
        "review_detailed_main": "Biopics are gaining popularity in Indian Cinema as it tells the true incident of a person or event portrayed on the silver screen. With Dirty Picture, Bhaag Milkha Bhaag and Manjhi-The Mountain Man following the trend, it is thoroughly inspiring and motivating. Will \"Azhar\" lives up to the reputation and gives you hard-hitting drama with realistic views on life ? Well, let us check it out\u0085\n\n\"Azhar\" tells the untold story of legendary cricket Mohammaed Azharuddin (played by Emraan Hashmi) who was center of controversy due to one incident which changed his life.\n\nIt takes nerve of steel to make biography of a famous personality who took 16 years of his life to fight for justice. First time film maker Tony D Souza does gives a sincere attempt but it too far from making any impact. The film talks about the cricket which is considered as the most famous game in India but matches shown in the film lacks the excitement. Tony D Souza only shows the brighter side of legendary cricketer but when a biography is being made, true introspection of a person's life should be depicted which include the grey areas as well. This is clearly missing in the film. The content of the film and even the characters have not been defined. The real-life drama has been tweaked into reel world with extra spices. The screenplay in the first half is pretty smooth but falls down in the later half. Art direction is good. Cinematography is excellent. Music is tuneful. Dialogues are too corny.\n\nBeing fan of Azharuddin, I was expecting Emraan Hashmi to deep-dive into the character. Unfortunately, I was disappointed. The actor tries hard but falls flat on the face. Still his performance is sincere compared to his previous films. Other actors like Lara Dutta and Kunal Roy Kapur gives a good performance. Prachi Desai does well in small role while Nargis Fakhri disappoints.\n\nOverall, \"Azhar\" is a golden opportunity gone wasted."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "unique-pervez",
        "review_rating": "1",
        "review_title": "Fantastically hide the main reason.",
        "review_detailed_main": "A movie which shows still how much mean minded people working in Bollywood film industry. At least did expect something difference this time but how some people can make a movie showing the main reason why azhar was eliminated from the team or why not even a single person come to stand with him. And when as the film shows Mr. Kapil stands (technically) with his its already too late for him so he also played a smart role in the whole conspiracy. He was only been out because cricket is treated as the 2nd god in India and they just can't stand with azahar not because of any other reason except religion. that this was the main reason why all this conspiracy was framed against him. I wish at least one person got the guts to show the truth. Apart from that emran is really doing his best. N.B: its also true if you show the truth Indian censor board will never let the movie released. LOL"
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "theprincewarrior",
        "review_rating": "8",
        "review_title": "Whether you're a cricket fan or not, Emraan Hashmi's performance keeps you glued",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "rahulnareshmeena",
        "review_rating": "1",
        "review_title": "Propoganda flim",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "puranjan163",
        "review_rating": "8",
        "review_title": "A great comeback of Emraan Azhar Hashmi",
        "review_detailed_main": "First of all I would like to appreciate the fact that these kind of movies are being made in Bollywood. The taste of the viewers are changing with the era and actors should choose movies accordingly. The story telling and the screenplay of this movie really reaches my expectations. Emraan absolutely has done a great job in pulling out the character; some of the scenes really gave me goosebumps may be due to the dialogues. Since it is a biographical movie so if you are looking for some unnatural or supernatural stuffs to occur in the story line you would be disappointed. Overall the movie is pretty good, only the acting skills of Nargis needs a little brush up.And yeah, is IS an Emraan show, really liked the movie."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "asifbaloch096",
        "review_rating": "10",
        "review_title": "Emran Hashmi Best Acting All the time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "wasey-23016",
        "review_rating": "9",
        "review_title": "A must movie to watch for every Cricket Fan",
        "review_detailed_main": "The director has done his job pretty good and did quite a justice to the characters in the movie. Emraan has did a spectacular acting keeps me hooked up till the end. And the actress prachi perfectly suited for the role. This movie is totally entertaining and sportive. No matter what people think about Azharuddin, He played his part well like the others but slide into incrimination. A true fighter in this hard competitive game. Even the lifestyle of players is obvious as of the reality as it gets really tough to avoid limelight and luxury and fun for any star. We can't blame a single person for the loss of a team. Its people point of view changes so rationally. eg. Own people of Hyderabad didn't supported him at all and found reasons to blame. This movie speak about game which goes in and off the field. In the end I couldn't stop clapping. Superb movie of this year don't miss out."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "waheed_zuhair",
        "review_rating": "8",
        "review_title": "One time watch",
        "review_detailed_main": "Azhar- Good one time watch. This is how biographies are made. Direction is good. Plot is pretty weak and boring sometimes I watched this movie with my elder brother. He did not like it as there was no surprising element for him. As he already knew his story. This story is must watch for youngsters like me Who doesn't know who exactly Azhar was. Performance- Emraan was good.Decently played by him Bani was awesome. She is perfect for such kind of roles Nargis- she obviously can't act. Lara Dutta- she is neither beautiful nor a good actor. Gautam- waste actor. Wasted a good chance. Absolutely rubbish. Overacted in every scene. Overall good biography. One time watch. This movie did not get credit which it deserved."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "dharmendraiitdelhi",
        "review_rating": "8",
        "review_title": "the true story event",
        "review_detailed_main": "Azhar is a 2016 Indian sports drama film directed by Tony D'Souza. based on the life of the former Indian international cricketer, Mohammad Azharuddin. The movie is a real story of Indian cricketer Mohammad Azharuddin The story is really good\u0085\u0085a very good role played by Emraan Hashmi as Indian cricketer Mohammad Azharuddin The story is written by Rajat Arora and is inspired from the life of Indian cricketer and former national team captain Mohammad Azharuddin. The movie begins with Indian cricketer Mohammad Azharuddin (Emraan Hashmi) scoring a century in his 99th test match, but he soon faces allegations of match-fixing as his name has been linked with a London based bookie. The India cricket board slaps a life-ban on him. Azhar decides to challenge the ban in court with the help of his lawyer friend Reddy (Kunaal Roy Kapoor). Director Tony D'Souza and his writer Rajat Arora brilliantly capture the journey of one of India's greatest batsman, right from his birth to his eventual exoneration by the court, focusing equally on Azharuddin's storied career as well as the shocking scandal that derailed it. Along the way, he makes us remember that this man's career is indeed worth remembering, and the controversy that erupted toward the end of it needs to be looked at from a different angle. Tony's Boss and Blue suddenly feel like distant memories. Every body must watch this movie ,,\u0085\u0085.its a good movie\u0085\u0085.."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "zaildarkaka",
        "review_rating": "8",
        "review_title": "Judgement Day",
        "review_detailed_main": "On the poster of movie, under the shadow of movie tittle \"AZHAR\" it's written that \"Love him, Hate him, Judge him, so purely on-wards 13 May it judgment day for Indian. It's a biopic of Mohammad Azharuddin written and directed by Rajat Arora Tony D'Souza respectively. Emraan Hashmi is reel life Mohammad Azharuddin. Lara Dutta,Prachi Desai, Nargis Fakhri, Kunaal Roy Kapur, Gautam Gulati, Manjot Singh, Karanvir Sharma Rajesh Sharma, Hemant Choudhary, Varun Badola, Kulbhushan Kharbanda are in supporting role. I can't stop myself without praising Nargis Fakhri, she looks dam hot in his role an Lara Dutta hide her age. Coming to Movie, Moving starts with Azhar playing 99th test match, getting ready for next tour as his dream is coming true to play 100 test where BCCI says him that he is suspected linked with bookie and they put LIFE BAN, to which he challenged to court with help of his lawyer friend. A flash bank starts where all his up and down of life are shown like marriage and diverse meeting with his girlfriend, 3 consecutive centuries in his first 3 test innings and many more incident s of his real life. At end Life ban of AZHAR is took back and his record is cleared which leads to happy ending. Overall:- If you are Emraan Hashmi fan you watch because his acting was of dam high class, he brilliantly copied real life Mohammad Azharuddin, walking style, clothing style, everything .Story of movie holds you back to seats and keeps you guessing. Direction of movie is also Good but personally I am not satisfied by VFX effects. Dialogues of movie are superb and many epic reply to one another. Personally speaking AZHAR is a superlative watching experience. You shouldn't miss it for anything!! Rush to near cinema halls\u0085."
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "doctorchandank",
        "review_rating": "8",
        "review_title": "story of Azhar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "jatinbutty-62237",
        "review_rating": "",
        "review_title": "Good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "wwwgurpanthinsan",
        "review_rating": "",
        "review_title": "a good movie based on Mohmad Azhruddin 's real life story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "kgkarangupta",
        "review_rating": "",
        "review_title": "Nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4906984",
        "movie_name": "Azhar",
        "movie_rating": "5.7",
        "review_username": "manishbajaj",
        "review_rating": "",
        "review_title": "Serious Movie",
        "review_detailed_main": ""
    }
]