[
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "nadkarnisumeet",
        "review_rating": "8",
        "review_title": "Rajshri's biggest gamble which paid off",
        "review_detailed_main": "It was on 5th August 1994 that Sooraj Barjatya's Hum Aapke Hain Koun (HAHK) premiered at Liberty cinema, Mumbai. A unique strategy devised by Rajshri Productions; they released their close to three hour thirty minutes long film only in one theatre per city in a bid to curb video piracy. The film prints used to be taken back from these cinemas every night to Rajshri office and resend the next morning just in time for the matinee show.\n\nLike it happened with Sholay (1975), quite a few critics wrote off HAHK as a flop in it's first week dismissing it as an extended Marwari wedding video. But then the audience was clearly impressed with director Sooraj Barjatya's adaptation of Rajshri's own 'Nadiya Ke Paar' (1982). HAHK picked up with strong word of mouth and ran for 125 weeks (that's more than two years!!) at Mumbai's Liberty cinema. This film brought families back to theatres and audience (specially ladies) used to come dressed up as if they were actually attending a marriage!!\n\nSalman Khan and Madhuri Dixit had worked earlier in Saajan (1991) and Dil Tera Aashiq (1993) but their chemistry in HAHK was something else altogether. Truly awesome! Particularly, Madhuri looked super gorgeous and her dresses became a style statement for years to come. Madhuri herself, became the nation's heartthrob and even the late MF Hussain's heart went dhak dhak for her as he announced a film called Gaja Gamini (2000) to be directed by him just for her.\n\nHAHK broke all box office records emerging the biggest hit of all time, took home five Filmfare awards including Best actress for Madhuri Dixit and also won the coveted National award for Best Film providing wholesome entertainment that year.\n\nI saw HAHK first at Rajshree cinema (Gandhinagar) which was specially decked up to resemble a wedding hall. The gigantic screen used to get illuminated with lights during the two popular songs - \"Didi Tera Devar Deewana\" and \"Joote Le Lo\". This film was also the only one after Raj Kapoor's Sangam (1964) and Mera Naam Joker (1970) to have two intermissions (atleast in its initial weeks).\n\nTodays generation may find HAHK to be indulgent and boring piece of cinema (atleast my son does!!) but we 90s kids, know its euphoria and influence on pop culture. Indian wedding celebrations were never the same again!!\n\nRegards, Sumeet Nadkarni"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "msunando",
        "review_rating": "8",
        "review_title": "Live it, hate it, but you can't ignore it",
        "review_detailed_main": "Hum Aapke Hain Koun was a landmark film, undoubtedly. Love it, hate it, but you couldn't ignore it. Everyone watched it, from enthusiastic children to their doting parents, and even the parents' parents. Young lovebirds watched it together, for they imagined themselves in Madhuri Dikshit and Salman Khan pondering about what chaste love and sacrifice really could mean. I went to watch it too, and I had both the wife and the mother in tow, and this was probably the last time my mother stepped into the cinema theatre before her untimely demise, and that's one of the reasons that the film will hold a special place in my heart. Towards the end of the film, both the women between whom I was comfortably lodged, were in copious tears, leaving me thoroughly helpless and beleaguered.\n\nHum Aapke Hain Koun actually lacked originality. It was a shiny, polished, glitzy and expensive rehash of Rajshri's very own \"Nadiya Ke Paar\", helmed by Govind Moonis and starring Sachin and Sadhna Singh in a dual role. The storyline is absolutely similar, but the original was set in rural India which was Rajshri Production's usual playground. Nadiya Ke Paar was steeped in reality, sans the glamour, traditional overdose and musical melodrama of its later version and is unsurprisingly rated higher on IMDB. In stark contrast, Hum Aapke Hain Koun was all chocolatey, brimming with acts of kindness, upholding humanity, values and traditions to the point that one could choke, not with emotions, but out of sheer disbelief. Why doesn't God make any more men and women with such virtues?\n\nBut all the above information and critique is in hindsight, and certainly not straight from 1994. When Hum Aapke Hain Koun released, in spite of my having mapped it to Nadiya Ke Paar, I found it delightful and refreshing. Madhuri Dikshit was in her sublime form and Salman Khan played the perfect foil, energetic and charismatic. I thought he remained underrated in the film's super success story, and my heart went out to his role, just this once other than his performance in Bajrangi Bhaijaan. The music of Hum Aapke Hain Koun by Raam Laxman (Vijay Patil) was soulful, standout, immensely hummable and almost definitely the main reason for the film's runaway success, even though it came down as an overdose, almost resembling an incessant downpour. There was no lack of drama, melodrama, dialoguebaazi and the goofy goodness of everyone in the script - there wasn't an iota of badness anywhere. It's actually quite difficult to draw a parallel with Sooraj Barjatya's Hum Aapke Hain Koun, even today. Cheers to the twenty six years that Hum Aapke Hain Koun has traversed, it's often aired even now and remains immensely watchable, for different reasons to different people."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "Peter_Young",
        "review_rating": "6",
        "review_title": "A tribute to the big Indian family, and to Madhuri Dixit's beauty",
        "review_detailed_main": "Hum Aapke Hain Koun is not much of a film as it is a show, which is big and extravagant and presents a positive world of love and smiles and the wonderful fraternity of the big wide Indian family. So popular did it become that its title today is immediately associated with wide families. Strictly as a film, sadly, the film is not that great, but it's pure entertainment. The film's music is absolutely beautiful and clearly a big part of the film's success because the show is never less than a sum of its parts.\n\nIn order to make the entire show and portrayal of the big family valid, a great cast was needed here, and indeed they're all nice and they all work well with each other. But Hum Aapke Hain Koun i-s Madhuri Dixit all the way; she is its face, soul, and heart, and it fully rests on her electrifying, charismatic presence, heartfelt performance, and her impossible, heavenly beauty. No one else exists when she is there, and thankfully she is there most of the time. She is the main reason the film is so iconic today, for sure."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "ChiBron",
        "review_rating": "10",
        "review_title": "Among Bollywood's greatest entertainers of ALL TIME!",
        "review_detailed_main": "Once I finished watching HAHK for the first time in 1997(3 years after its original release), I had absolutely no doubt as to why this movie became the highest grossing Hindi film of ALL TIME. HAHK is a case where everything comes perfectly together - direction, acting, music, cinematography, sets, costumes and that extra indescribable \"magic\" every classic has.\n\nHAHK's story in itself is nothing special. Heck, it doesn't even have much of a plot to talk about. But what keeps us hooked to this 3 hour+ saga is a crisp screenplay, and the charming way in which everything is presented. In a movie where there are barely any conflicts and everybody loves everybody else, the audience could've easily been turned off by the excessive sugar. But HAHK's greatest achievement probably lies in the fact that it NEVER feels fake. The cast's chemistry is so natural and there's such generosity behind the emotions that you can't help yourself but fall in love with this world of theirs. This is something none of the HAHK copy-cats(to this day!) could accomplish. So many movies tried to recreate that magical family atmosphere, but none(especially Barjatya himself!) could really pull of that feeling of genuineness.\n\nMoving on, HAHK doesn't have a single \"boring\" or \"lets fast fwd. this scene\" moment in the movie. And that's what it ultimately is - a super entertaining musical dealing with two families and two irresistible characters in Prem(Salman Khan) and Nisha(Madhuri Dixit). These are career performances from two of Bollywood's finest looking people. People forget that Salman Khan started off being a fairly solid actor. Not only could he easily enact the typical Bollywood emotions, but his unique mischievous 'ada' and natural charm went well with his good looks and lean physique(buffing up was the worst thing he did to himself). 1994 was still a time when we could count on him to deliver a likable performance. And Salman isn't just likable here, his infectious energy and charm makes Prem utterly irresistible. I don't understand why Madhuri has always been seen as the show stealer in this movie. Salman matches her all the way. Speaking of Madhuri, she just glows in every frame here. Her charming performance was simply intoxicating. Who wouldn't fall in love with Nisha? Salman-Madhuri share terrific chemistry. One of the best ever in fact. Prem and Nisha's romance develops slowly and beautifully. Every scene shared between them is memorable and believe me, their moments will bring you back to watch this movie again.\n\nThe strong supporting cast in HAHK definitely provides the movie with the ideal stability and mood to further enhance our impression of these sweet characters as believable. The casting crew hit gold because every actor looks perfect in the role he/she is portraying. The music is also BRILLIANT and the song picturizations/choreography remains unsurpassed. Barjatya cleverly keeps the narrative flowing with each song. AND that was a HUGE key because 14 songs could've easily slowed the movie's pace down.\n\nBottomline: HAHK to me is the quintessential Bollywood entertainer. The movie, despite being unrealistically sweet, never feels fake(something no other movie has been able to recreate, not even the director himself). Every actor in the cast adds something to make the movie special. The leading stars to this day haven't given more likable performances. If you look up the word chemistry in a Bollywood dictionary, a pic of Salman/Madhuri from HAHK should be there. Overall, just an incredibly charming movie that you can't help but fall in love with."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "chutneylix",
        "review_rating": "",
        "review_title": "HAHK is classic Indian cinema that no one must miss!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "Umar Mansoor Bajwa",
        "review_rating": "10",
        "review_title": "Great Love Story cum Light Entertainment !",
        "review_detailed_main": "The success of this film is a memorable landmark inasmuch that the violent legacy of action films pioneered and boosted by Amitab Bachan came to an end and movies again took a semi u-turn to social and family oriented depiction of human values that are more close to real life.\n\nThis romantic cum social legacy of Hindi movies came to an abrupt end by the release of movies, like \"Sholay\" and \"Zanjeer\" in early 70s, when Amitabh set the stage for his personification of a young angry man willing to turn violent. In this way, the cool, romantic and charming personality of Rajesh Khanna eclipsed to give way to the new Super Star.\n\nHAKAK turned the tables, insofar, that this beautiful song studded and family drama having a focus on light merriment and jubilant frenzy took to the hearts of the audience and Salman Khan and Madhuri Dixit touched new heights of stardom ushering in a revived era of filmdom that is the touchstone of social and family drama."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "Sherazade",
        "review_rating": "7",
        "review_title": "The biggest grossing Indian film of all time... according to the DVD cover!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "zakir_md_99",
        "review_rating": "10",
        "review_title": "All time best",
        "review_detailed_main": "This movie can definitely listed among the top 5 movies of all time . It Is a breezy movie with an ingradient of all nice things . It has ear soothing music, good performances and extremely good-good happenings going on . You wont feel bored even for a second .Though without a strong story , it is pure entertainment at its best ."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "veracious_lies",
        "review_rating": "7",
        "review_title": "The fluffiest Bollywood film ever.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "anant_mathur",
        "review_rating": "10",
        "review_title": "One of the best family films ever!",
        "review_detailed_main": "At a time when action films were the norm of Indian Cinema came a family film called \"Hum Aapke Hain Kaun\". A film that broke all the records at the time. It was the turning point in Indian Cinema to move away from violent films and towards more romantic and creative efforts or as I like to call them \"Films without Villains\".\n\nHum Aapke Hain Kaun started it all. The film is directed by Sooraj Barjatya, it is his second film after Maine Pyaar Kiya. HAHK stars Salman Khan as Prem and Madhuri Dixit as Pooja, its about how they fall in love and what they have to go through to finally end up together, throw in some family values and emotion and you have Hum Aapke Hain Kaun.\n\nEveryone should watch this film, but wait, I think they already have!\n\nEnjoy!"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "alexdeleonfilm",
        "review_rating": "6",
        "review_title": "Attractive stars make drippy script acceptable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "CAMKG",
        "review_rating": "10",
        "review_title": "A Landmark Film",
        "review_detailed_main": "HAHK represents all things that the best of commercial Hindi cinema stands for. It has music that is melodious and just merges with film. There is a romantic angle full of innocence and electrifying chemistry. The premise is very simple yet has enough scope for a large array of emotions. Repeat viewing only enhances the appeal of the film. This is most definitely a Sooraj Barjatya - Madhuri Dixit collaboration to give credit where credit is due. It is the highlight of both of their careers so far, in my opinion. Barjatya does a great job with each and every character of the film. He does something that is essential for the viewer to enjoy the film: he makes you genuinely care for each character. So if they laugh, you laugh and if they cry, you cry. And he does so with sincerity and simplicity. Most definitely the film was designed to be big budget block buster, but it was made with the intention of making a great film which it most certainly is. Salman Khan and Madhuri together are one of the best onscreen couples ever depicted. Great choreography, a well-written script and most of all excellent direction by Barjatya in pacing the film superbly. One of the best films ever made. 10/10."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "maxqnzs42",
        "review_rating": "6",
        "review_title": "Sickly sweet, but great fun. It should help you find your smile",
        "review_detailed_main": "Over the last few months, I've become increasingly jaded and cynical about Hindi cinema. The choices seem to be narrowing to increasingly violent and brutal films with good performances or soulless masala clones with production line Barbie dolls for heroines, and songs that are forgotten seconds after they finish. I've been pushing myself to reach 150 BW films watched, and it has increasingly seemed like a waste of time and effort, often leaving me angry at the time chewed up by the drek on offer. In the last week, I've sat through Aashiq and Gumrah, both films that left me bewildered and angry at their awfulness.\n\nThen, today, I finally got to see HAHK. I went in expecting to loathe it. Despite my vigorous efforts, I just couldn't. Cinematically, there's almost nothing right with this film, but it was still great fun to watch. One IMDb review disparaged it by calling it \"just a shaadi cassette\", and I think that was right on the money. I also don't think that it is such a bad thing. There's an artless naivety and innocence to the film's spirit that makes it easy to overlook the fact that watching it will induce a coma in the saccharine-intolerant. I am normally very intolerant of super-sweet fluiff, but somehow this film sneaked past my outer cynic and found my inner child. It was a better K3G, better for not having all the negative elements. If you're going to make candy floss, don't try to be \"cool\" by spicing it with pepper, just celebrate the sugar, and that's what HAHK does. I don't know if I'll watch it again, but there are several songs that were well worth the watch, and Tuffy was great.\n\nI don't think such a film could be made today, since jaded cynicism is de rigueur for film viewers the world over, and I doubt that many directors would have the courage, or find the backers, to make such an unabashedly retro piece. To compress the \"mushkil\" into the last 20 or so was genius, it let the film just bubble away, with so many laughing, smiling faces that only the stoniest grinches could be unmoved. Maybe the biggest flaw with HAHK is the fact that so many subsequent films tried to copy its \"formula\", without realising it didn't really have one, and that calculating mimicry is no substitute for the real thing.\n\nAs a film, I'd give it 5/10. For refreshing my BW palate, and reminding me of the magic of masala, I'd give it 8."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "kpfashion_zara",
        "review_rating": "1",
        "review_title": "Absolute Garbage",
        "review_detailed_main": "Bad acting, no script and nonstop music. It is a treat for mindless audience."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "kalyan-kancherla",
        "review_rating": "10",
        "review_title": "A great movie at its time",
        "review_detailed_main": "People may dismiss this movie today as artificial and too cheesy but the fact remains it kept the box office cash registers ringing when it released in 1994 for years. Coming to the movie, it doesn't have any story at all but what keeps the audience glued to the movie is its tight screenplay, direction, melodious songs and the strong performances of every actor. The human relations shown were pure and simple. I must have watched this movie over and over again and every time I watched it, there was always a smile on my face and it always feels like a festival to me when I watch this movie. This movie brilliantly showcases the talented madhuri dixit."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "shivakumarvishwa",
        "review_rating": "10",
        "review_title": "One of the greatest movies ever made",
        "review_detailed_main": "This is one of the best movies ever.The direction is superb.The choreography is excellent.The story is great.It tells us about Prem and Rajesh who are orphans and are being taken care by their uncle Kailash.One day they get Rajesh engaged To Pooja chowdhary.Pooja also has a sister named Nisha.Nisha and Prem fall in love.Rajesh and Pooja get married.They have a baby noy.One day a tragic incident happens.Pooja dies after falling from a staircase.They plan Nisha to marry Rajesh.On the climax scene Pooja gives Tuffy a letter and sends it to Prem.Rajesh reads it.He realizes their feelings.All ends happily when Preem and Pooja marry.The cinematography is excellent.Madhuari and Salman are brilliant.The others are great too.The on screen chemistry is excellent.The music is excellent.The costumes are good too.Script is excellent.Dialogs are excellent.Photography is excellent.I have seen tnis 7 times already.This is Tooooooooo good.A MUST SEE MOVIE RATING-10/10"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "kalyaniadhav",
        "review_rating": "",
        "review_title": "Film was awesome, Nice love story..Nice to watch Rajshri production film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "dps_patel",
        "review_rating": "7",
        "review_title": "Good movie with great Songs",
        "review_detailed_main": "This movie is another stolen story and remake from 1980's Rajshree movie \"Nadiya Ke Par\" starring Sachin and Sadhana. Sooraj Barjatya is using old \"Hit\" to make new \"Hit\" in this movie. This movie has very good songs. Young Sallu looks bad to Sachin. I hadn't have a chance to comment on this movie early but commenting little late as it was made in 1994. If you read this comment and have seen this movie, you must also see the old HIT \"Nadiya Ke Par\" by Tarachand Barjatya.\n\nHas excellent Songs but story is old and stolen from 80s. One Must learn how to copy from Sooraj. In my opinion Sooraj Barjatya was the one who introduced the \"Remaking\" of movie.\n\nOverall this one is a good movie because of songs."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "elizy-33092",
        "review_rating": "9",
        "review_title": "One of the best Bollywood films I've seen in a while",
        "review_detailed_main": "Some parts of the movie were a bit cheesy in my opinion, but I mean, that was kind of Bollywood's thing back then I suppose, and I do think that the cheesiness of the acting and plot is what accentuates the humor in this film. Anyways, this film was actually quite entertaining. As an American, Bollywood films don't always appeal to me, but this movie was quite good. My dad put this up on Netflix with my mom, as I walked into the room, and I was instantly hooked. It had such an adorable plot line with highly likable characters that you'll instantly fall in love with in seconds. The jokes were extremely clever as well, and of course goofy and cheesy (in a sort of odd and satisfying way). In conclusion, the film is lighthearted, romantic, humorous, and just downright adorbs."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "jtbw1981",
        "review_rating": "7",
        "review_title": "Great movie",
        "review_detailed_main": "Back in the late 1990's, I worked for an Indian doctor who wanted to give me a taste of Indian cinema. He loaned me this movie for a weekend. My mom & I watched it together. We enjoyed it so much we watched it multiple times. The music & dancing was was fun, the costumes were gorgeous, & the storyline was really good. I may have to watch it again sometime as I see it's available on Amazon Prime."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "rajandey",
        "review_rating": "10",
        "review_title": "Brilliant movie with culture, emotions and lots of FUN!",
        "review_detailed_main": "This has got to be my most favorite movie ever! Even though i watched this movie over and over again i never get bored! The movie gives you an awesome performance by Salman Khan and a perfect performance by Madhuri Dixit!\n\nEverything is absolutely rocking! The comedy, Songs, Locations, Costumes, Cast!\n\nIf you are not a fan of Salman Khan yet, this movie will make you a fan of him instantly, he is just lovable! The first three hours you will have a big smile on your face the whole time!\n\nDouble thumbs up for this everlasting classic in Indian cinema!"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "shatabdimondal",
        "review_rating": "7",
        "review_title": "GOOD FILM.",
        "review_detailed_main": "IT IS ONE OF THE BEST MOVIE IN 90'S. ITS REALLY AN AWSOME FILM.EVERY ONE SHOULD WATCH THIS WITH THERE FAMILY.SALMAN AND MADHURI'S ACTING IS AWSOME."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "satmad123-778-273628",
        "review_rating": "10",
        "review_title": "Conclusion after watching multiple times - Madhuri is phenomenal",
        "review_detailed_main": "It is difficult to point out good or bad points in this particular movie. From the first watch, the movie will look quite a simple one with nothing of the excellence short (as most of the critics also could not find). Still, the movie, like a magnet, attracted viewers again and again to the theaters and slowly one realized that it is this simplicity of the movie that is its best asset. To the best of my knowledge, this is the first complete family entertainer of its kind - no blood, no violence, no hero-villain hand-to-hand combats, no dialog-baazi etc. Basically a new hit formula was born that was adopted in hits like DDLJ, Raja Hindustani, Hum saath saath hai, Vivah, Waqt and many more. Unbound love from people can be gaged from its box office result, which no other movie has matched till date. Watch it for the first time and you will be entertained thoroughly for 3 and a half hours. Watch it for second time and you will start humming the songs (14 songs and all adds fun-element to the story). Watch it for third time and you will start to fall in love with the characters. Thereafter you will continue to watch this movie every now and then. Like we enjoy meeting our relatives during festivals, fans (possibly half of pan India or more) of HAHK continue to enjoy the movie at regular intervals. It has been more than 20 years now and the love for the movie remains the same. One thing that stands out is Madhuri Dixit as Nisha. I am sure like me, many of my generations who have watched the movie have become an ardent admirer, fan and possibly a devotee of this beauty. Apart from looking million bucks in every frame she appeared, her lively act took the movie to a different level altogether. How can one not fall in love with her eyes after seeing her walk down the stairs in purple saari while Salman was humming the shayari for her. Her simplistic attire and expressions in maye ni maye is the one to die for. Madhuri mesmerized everyone from 8 to 80 years old with this movie. Obviously, there was a reason that her name appeared before Salman Khan and she was paid more than Salman for the movie."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "AbhimanyuSimha",
        "review_rating": "1",
        "review_title": "It's not just a bad film, but almost ruined Indian film industry!",
        "review_detailed_main": "With the box office success of this movie, Indian film industry hit a new low. Indian film industry is still trying to come out of the bad drug that it got infected with. Just when there seemed to be some sensible movies started to come up in India, in 1994 this movie got released and brought us back to where we were 10 years back. It inspired a genre of movies which have completely meaningless melodrama, utterly nonsense dance song sequences, brainless stories. I sometimes wonder if Indian movie industry would be better if this movie (along with another crappy movie called Kuch Kuch Hota Hai) had not come. I may be wrong, Indian movies were never worth considering seriously before that also barring a very few exceptions. But this one just took it to a new low.\n\nMany people say this movie changed the face of Indian movies, and I absolutely agree with it, not for good but for worse. It has been close to one and a half decade and we are slowly managing coming out of the hangover. Hope Indian audience will be sensible enough not to create another Suraj Bhartyaja or Karan Johar."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "beinghimanshu-08878",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "alikhan-23790",
        "review_rating": "10",
        "review_title": "excellent movie",
        "review_detailed_main": "Very good picturised.\n\nSongs are nice. Romantic scene picturised for Madhuri and Salman are tooo good. I can watch this film 100 times.\n\nIt's perfect family drama without \"saas bahu\" ....\n\nSongs are really good...\n\nSarees wearied by Renuka too good...she looking perfect newly married woman\n\nSomewhere every couple relate to madhuri and salman\n\nGood choice of story,Songs, music, drapery, shooting place\n\nRenuka and Mohnish looking pretty... Every one played a perfect role for character..."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "mariotofu",
        "review_rating": "10",
        "review_title": "The Greatest BollyWood Music Ever Created",
        "review_detailed_main": "What makes this movie so great wasn't the story line. Definitely not, considering for the first 2 and half hours there was virtually no conflict. The rising action of Prem and Nisha falling in love was what made this movie brilliant. Salman Khan and Madhuri Dixit have the perfect chemistry and considering they were both powerhouse actors used to their full potential, this movie felt heavily realistic. The romantic interactions between the two seem like something we'd see right in front of us, as if we were apart of the family too.\n\nThe rest of the cast seemed like they really were family members. The comedy and friendly interactions between all of them seemed all too common. This was the first time a movie did that while being successful. The effect was several more movies followed the Romantic Comedy without violence approach. For generations now, HAHK may seem like a cheesy and sappy love story but when it first came out, it broke records everywhere. Prem and his Bhabi have a loving relationship where he respects her like a mother but also has incredible fun with her. The traditional Desi relationship between a Bhabi and Deewar. The final Lo Chali Main song with him and his bhabi is incredibly cute and funny.\n\nThis movie was and still is the best musical romantic comedy created by Bollywood. It could easily be broken down why.\n\nThis movie consists of 12 musical numbers and each and every one of them were entertaining and catchy. Only 2-3 of the songs were actually deep in meaning but even they were fun to sing along too. The pathos in each song and chemistry between characters makes people like us want to go out there and dance along. Songs such as \"Didi Tera Deewar Deewana\" and \"Wah Wah Ramji\" have permanently assimilated within the Hindustani culture.\n\nAs the story progresses you can see more how relationships develop and you will be hooked. It might feel too lovey dovey and happy but there are no boring scenes. Which I can only say about a few other movies such as; 3 Idiots, Lagaan and Black. If you're life isn't depressing, you'll love this movie."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "sandeeptlvdy",
        "review_rating": "10",
        "review_title": "BEST Indian CINEMA EVER.....",
        "review_detailed_main": "Definitely the best Indian cinema ever released or will ever release in future. Although the film is inspired from the movie \"Nadiyaa Ke Paar\" by the same production company. It is a completely commercialized version of this movie. And believe me the class of this movie is double.\n\nExcellent work by director Sooraj Barjathya and the most brilliant screenplay i have ever seen. Perhaps the only movie which i have seen more than 200 times and whenever i watch my interest to see it doubles and excitement doubles. The career best performances from Madhuri Dixit, Salman Khan, Renuka Shahane etc is another main highlight. A completely flawless movie i have ever watched.\n\nThe brilliant songs add the beauty of the movie very much.In my top favorite songs two topping ones are from this movie. Hats off to the makers and actors of this classic."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "GypsiB",
        "review_rating": "10",
        "review_title": "Perfect Bollywood",
        "review_detailed_main": "Hum Aapke Hain Koun. . . ! is a movie about family, sacrifice, duty, and most of all, love. It is a story that will bring laughter and tears, and is heart-warming all the way through. The choreography and music were excellent, the costumes were lovely and vibrant, and the cinematography was beautiful. Madhuri Dixit and Salman Khan were perfect in their roles, and the supporting cast was also fantastic. This sweet film comes highly recommended."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "rajivgill",
        "review_rating": "",
        "review_title": "Definitely worth a watch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "foloqiga",
        "review_rating": "1",
        "review_title": "Utter trash",
        "review_detailed_main": "This entire film is nothing but a shitfest of poor music, atrocious acting and an even worse story. I recommend to not watch it."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "ryanrajsharma",
        "review_rating": "",
        "review_title": "a great film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "si_shaalini",
        "review_rating": "8",
        "review_title": "I love this movie.",
        "review_detailed_main": "Although when compared to English movies it's long and too much detail,this movie happens to be my favorite Hindi movie.I have a massive crush on Salman Khan in the film.He is too cute and adorable.And Madhuri Dixit's character is mind-blowing.This film has a thin storyline but it's the moments of the film that make it click.The romance of Madhuri Dixit and Salman Khan is so good.The songs are good and the family life made me yearn for the warmth and affection.When compared to English movie standards it's quite absurd but dil se I like this movie.The costumes of Madhuri Dixit was good too.At times she puts daUn Salman Khan too much which makes me feel sad for him.Why does she give respect to her brother-in-law and not Salman Khan in the beginning?"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "disharma-24131",
        "review_rating": "8",
        "review_title": "Explores various relationships within the family, including the complexities of arranged marriages",
        "review_detailed_main": "\"Hum Aapke Hain Kaun\" is a Bollywood film directed by Sooraj Barjatya and released in 1994. Starring Salman Khan and Madhuri Dixit in the lead roles, the film is a romantic family drama that became one of the highest-grossing films of its time.\n\nThe movie revolves around the love story of Prem (Salman Khan) and Nisha (Madhuri Dixit), who are members of two closely-knit families. The film showcases the traditions, values, and dynamics of an Indian joint family. It explores various relationships within the family, including sibling bonding, parental love, and the complexities of arranged marriages.\n\nOne of the standout aspects of \"Hum Aapke Hain Kaun\" is its strong emphasis on Indian traditions and cultural values. The film beautifully captures the grandeur of Indian weddings, traditional ceremonies, and celebrations. The songs and dance sequences, including the popular tracks like \"Didi Tera Devar Deewana\" and \"Dhiktana Dhiktana,\" add a festive and joyful atmosphere to the narrative.\n\nThe performances in the film are remarkable, with Salman Khan and Madhuri Dixit delivering heartfelt performances. Their on-screen chemistry is palpable, and they bring charm and innocence to their respective roles. The supporting cast, including Mohnish Bahl, Renuka Shahane, Anupam Kher, and Reema Lagoo, also deliver commendable performances, adding depth and authenticity to the film.\n\nThe film's screenplay is well-written, striking a balance between emotional moments and light-hearted humor. It effectively portrays the love and bond between family members and explores various emotions, making the audience feel connected to the characters. The film's length, however, is quite long, with a runtime of over three hours, which might feel a bit stretched for some viewers.\n\nThe production values of \"Hum Aapke Hain Kaun\" are top-notch, with lavish sets, colorful costumes, and visually appealing cinematography. The film's music, composed by Raamlaxman, is a major highlight, with melodious tunes that have become timeless classics in Indian cinema.\n\nOverall, \"Hum Aapke Hain Kaun\" is a wholesome family entertainer that captures the essence of Indian culture and traditions. It offers a feel-good experience with its engaging narrative, memorable songs, and strong performances.\n\nDespite its lengthy runtime, the film's emotional depth and heartwarming moments make it an enjoyable watch for audiences who appreciate family-oriented dramas."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "riddhimaakaritu",
        "review_rating": "10",
        "review_title": "Can watch it again. And again.",
        "review_detailed_main": "One of those films which you will watch whenever it's played on TV. And each time would love it even more."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "merisoch",
        "review_rating": "9",
        "review_title": "Fun movie with a bit of unnecessary drama",
        "review_detailed_main": "HAHK is a very lighthearted movie full of fun, laughter and songs. It has a very simple plot but the direction and acting keep you glued. Everyone's acting was great but the lead actors Madhuri and Salman delivered an exceptional performance. Their characters are very friendly and relatable and will be remembered for generations to come.\n\nMost Bollywood movie have a lot of songs but HAHK is dominated by them. And each one of them has become a classic.\n\nBecause of the movie's easygoing nature everyone can enjoy it from the very young to very old, and most Indians can relate to the cultural aspect. Hence it is the perfect film to watch with your entire family, and I mean it, everyone from the pardada from the village to the NRI cousin will love it! No wonder it has become the highest grossing Bollywood film of all time when adjusted for inflation.\n\nI love movies with action and thrill but I still enjoyed HAHK because it kept me smiling through almost every single minute.\n\nIf you don't want spoilers, don't read the description on Google/IMDb because it tells you everything."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "sanahashamkhan",
        "review_rating": "10",
        "review_title": "Hum Aapke Hain Koun: A Heartwarming Family Tale",
        "review_detailed_main": "*Hum Aapke Hain Koun* is a timeless family drama that beautifully weaves together love, relationships, and sacrifice. Directed by Sooraj Barjatya, the film follows the lives of two families intertwined by love and friendship. The story revolves around Prem (Salman Khan) and Nisha (Madhuri Dixit), who find themselves in a whirlwind of emotions when a tragedy strikes the family.\n\nOne of the film's standout aspects is its well-crafted storyline. The narrative skillfully explores the complexities of love and selflessness. The chemistry between the lead pair, Salman Khan and Madhuri Dixit, is electrifying and their portrayal of Prem and Nisha's love story is heart-touching. The supporting cast, including Mohnish Behl, Renuka Shahane, Alok Nath, and Reema Lagoo, delivers stellar performances, adding depth to the characters.\n\nWhat sets *Hum Aapke Hain Koun* apart is its ability to evoke a wide range of emotions. From lighthearted bickering to profound sorrow, the film takes the audience on an emotional rollercoaster. The songs, composed by Raamlaxman, add to the film's charm, enhancing the overall experience.\n\nThe film's strength lies in its portrayal of family values and traditions. The selflessness displayed by the characters, especially Prem and Nisha, is incredibly moving. The climax, where they choose to sacrifice their love for the sake of the family, is both heart-wrenching and heartwarming. It highlights the importance of family bonds and the sacrifices one is willing to make for the happiness of loved ones.\n\nWhile the film's length might test the patience of some viewers, the engaging storyline and powerful performances make it a memorable cinematic experience. The visual appeal, coupled with soul-stirring music, creates a captivating atmosphere that keeps the audience hooked.\n\nIn conclusion, *Hum Aapke Hain Koun* is a cinematic gem that continues to tug at the heartstrings of audiences even years after its release. With its compelling story, exceptional performances, and heartfelt emotions, the film stands the test of time as a classic family drama. If you're a fan of heartfelt stories and meaningful relationships, this film is a must-watch."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "halimali2000",
        "review_rating": "1",
        "review_title": "waste",
        "review_detailed_main": "what a waste movie, where is the acting??? where are the scenes???\n\ni don't blame Indian audiences, they have lost the taste long time ago. how can this silly movie be a big blockbuster.\n\nother than Lata mangeshkar's voice nothing is good in it. a boring story line that only starts from the second hour.\n\nhow can this movie be hit??? and a great classic like Lamhe flop ?? plus Madhuri Dixit didn't deserve that years award. I think Sridevi deserved the award for her powerful performance in Laadla. really there is no match.\n\ni really advice u to avoid this movie. One star only goes for Lata's voice nothing else"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "simple story but fun, with great chemistry between Madhuri and Salman",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "anishkumarjnv",
        "review_rating": "8",
        "review_title": "Good movie and it song it awesome",
        "review_detailed_main": "This is remake of nadiyan ke paar but it's song and all acting of made this movie awesome."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "mdmohammedshah",
        "review_rating": "9",
        "review_title": "The most entertaining movie",
        "review_detailed_main": "The most entertaining movie ever for me where each and every scene and character comes to mind for more than 22 years.Easily Salman Khan's best performance till date .He was the ideal brother, ideal lover, ideal nephew anyone would love to have.Naughty but responsible Prem in the movie surprised me with his comic timing and dance steps matching the angel of dancing Madhuri Dixit . Madhuri Dixit was in her most charming avatar in this so called marriage video.Have watched the movie more than 100 times and still can't get enough of it.Sooraj Barjatya nailed as a director with the movie which has a thin storyline . A symbol of national integration showing orthodox hindu family enjoying everything with a Muslim doctor and his wife as one unit."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "ultracarerx",
        "review_rating": "10",
        "review_title": "Greatest of all time family movie",
        "review_detailed_main": "Bollywood could never repeat the same work and charm again in a great family movie!"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "patilsumeetoamazon",
        "review_rating": "10",
        "review_title": "GOAT_Family Picture_no nuidity_no vulgar language_any age group",
        "review_detailed_main": "Conserving tradition with libral ideas, mon women or children, this movie will give you a way to approach a family life.. be it romantic.. responsible.. political.. personal.. judicial.. all sects of life in one.. you will know why madhuri and salman became hearth throbs of the then younger generation now in 40's and 50's, however 90's kids are also sticked to it very well.. coz i am a 90's kid.. also you will get all that you need.. songs are not forcefully imported.. they align well with the story and they are not out of context songs.. there is so much fun, glory, satisfaction, conviction, sacrifice and well up bringing of families.."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "anandkc",
        "review_rating": "4",
        "review_title": "Marriage video",
        "review_detailed_main": "The user rating says it all. This is supposed to be the biggest hit of Indian film history! Sorry I saw it only after 2 years and it was still running full, and I din't like it. Reason : its not the original. The story was borrowed form a Telugu classic 'Abhinandana'. It was a tragedy and hence not so salable. The director cleverly moulded the story with a happy ending.\n\nIt looks like a typical marwari marriage party with the all the ingredients: Big family, happy family, no bad guys. The story is thin line and moves form one song to another, with some funny tricks added, like the old trial and test methods. This is no food for the head movie.\n\nIt is solely for family entertainment, a picnic and a money spinning machine.\n\nNot recommended for serious viewing."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "Herag",
        "review_rating": "",
        "review_title": "Indian Sound of Music.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "sanketsatbhai-97463",
        "review_rating": "9",
        "review_title": "Too Good movie",
        "review_detailed_main": "This is one of the best movies of Salman Khan and Madhuri Dixit. Fresh look, nice cinematography, nice story, good direction and Performance by all lead characters. Overall its different movie of Salman Khan.If any one is not fan of Salman they will also like this movie. Thank you."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "ajitbakshi",
        "review_rating": "9",
        "review_title": "the landmark of indian cinema.",
        "review_detailed_main": "The most iconic family drama movie of indian cinema. Cul classic. Salman as prem , madhuri as nisha capture everyone's heart.a must watch."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "shahbazansarioel",
        "review_rating": "10",
        "review_title": "HAHK Salman khan sir best actor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "parth-23048",
        "review_rating": "10",
        "review_title": "Best Family Drama and Sentimental movie",
        "review_detailed_main": "This movie is very heart touching movie. And starting from lead, all actors played their job 100%. Outstanding, family drama.\n\nObviously movie actress Madhuri lead movie from front with super acting skills, dancing ability, comic skill and all versatility. Salman Khan played superb innocent and naughty Prem and could be one of best role performed ever in industry. Chemistry between two was awesome.\n\nSongs were heart touching and unforgettable. Didi tera deewana is still considered as best wedding songs. Some emotional scene cant forget.\n\nSatish Shah, Alok Nath, Reema, Renuka Shahane, Anupam, Laxmikant, Bindu, Himangi all played extremely well performance.\n\nMovie is not loud but made you feel loud.\n\nIts unforgettable master piece from Sooraj Barjatya !!!"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "yajuvendrazala",
        "review_rating": "10",
        "review_title": "All Time Favourite..!!",
        "review_detailed_main": "It's Been More then 25 years of HAHK when it released- I have strong memories associated with movie Its Still fresh, live and the greatest of all time Indian Movie. HAHK touched my heart so much so that I still started crying in few scenes of the Movie - It is just Amazing Movie which is never made Again - Lots of Love"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "rajputshri",
        "review_rating": "5",
        "review_title": "Movie superhit only basis of songs",
        "review_detailed_main": "Salman khan and madhuri starrer movie story not too good but songs sing s p subramanyam and lata mangeshkar excellent superb that's why movie become superhit on box office and public know salman before this movie madhuri famouse because of anil kapoor combination Beta 1992 , Tezaab 1987 , Karma , Parinda many more movies superhit anil kapoor and madhuri."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "desi_lover",
        "review_rating": "",
        "review_title": "for hardcore Bollywood fans only",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "abhisingla-14095",
        "review_rating": "10",
        "review_title": "Perfect family movie",
        "review_detailed_main": "My first ever favorite movie. Songs, dialogues, costumes, emotions.. everything is perfect."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "lokendra-kumar",
        "review_rating": "10",
        "review_title": "Greatest of all time",
        "review_detailed_main": "A timeless classic, with unmatched chemistry of Prem and Nisha, family values, magical songs, unforgettable Madhuri dance moves while expressing most powerful Lata ji voice, to simply put this is the movie for generations, if there ever was one, most so for current times.\n\nWhile on the face of it the movie might just appear a wedding shoot, but underlying this is a brilliant and most moving screen play presented in most sensual way. Everything is so perfect about this film, so in general it would have been tough to pick out one, but Madhuri effortlessly walks away with the glory and gives the performance, beauty, moves and expressions that remains unmatched till date."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "amitpradhan-33960",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "One of the very few movies with all the spices it has comedy,drama,songs,a beautiful cast and acting level was wow. Must have seen it more than 100 times but still not got with it."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "salmaankhan-72000",
        "review_rating": "10",
        "review_title": "Best family Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "joseph-theresa28",
        "review_rating": "10",
        "review_title": "Unconditional love without saying I love you.",
        "review_detailed_main": "My all time favorite movie. Watched it first time when I was 6 years old and this movie still tops my favorite list."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "sripad_m",
        "review_rating": "1",
        "review_title": "One of the worst Hindi Fims ever, but one redeeming feature",
        "review_detailed_main": "Many of you are familiar with the feeling when after watching a film (or midway through it) you think that this was a complete waste of time and money. I almost got this feeling after watching this film. This film has very little in terms of a story line or a plot (which you can get from the IMDb summary, so let me not reiterate it). It does not take much effort to figure out what happens in the end.\n\nThe main themes of this film (e.g. romantic love, family loyalty, sacrifice) have been better explored in many other Hindi films. A substantial portion of this film comprises of various ceremonies (e.g. marriage) and associated songs. I found this mind-numbing. The songs are repetitive and in fact tunes from a previous Rajshri film (Maine Pyar Kiya) can be heard in at least one of these songs (I have to watch this film again to be more specific, but I would rather be corrected than suffer through it again). The actors do justice to their roles, which is not saying much, given these roles. Mainstream Hindi films in recent decades have neither been very realistic nor critical, but they (at least the good ones) while being entertaining, have embedded some understanding and critique of the larger social context. For example, films of Amitabh have tried to show the larger forces that produce crime and the virtues of religious tolerance. This film, while being somewhat of a fable of morality (about love, family ties etc.) is very far removed from social reality \u0096 everything (people, families etc.) is made of honey and sugar \u0096 nothing in common with the real India.\n\nSome people have told me that this is a great film because it is family entertainment - no violence or sex. If this is true (and I think fans of Madhuri would disagree), I don't see why a film meant for intelligent families (adults and children) should be considered good for this reason. Then, why don't we watch only TV programs meant for children? I now come to the one redeeming feature. This film was a huge hit despite all the above problems. This made me think \u0096 what does this success reflect about our (Indian) society? I give this film 1 out of 10 for provoking my thoughts in this direction."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Bollywood musical at its pinnacle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "summaiyanaaz",
        "review_rating": "10",
        "review_title": "Indai's First Modern Age BLOCKBUSTER indeed !",
        "review_detailed_main": "This is a very important movie in history of Indian Cinema. When all theatres were about to shut bcoz of lack of interest of ppl in Cinema, \" Hum Aapke Hain Koun! \" caught the attention of ppl of India and bought filmy faction back in whole India including south was highest hit at that time.\n\nMaking it 74cr gross and 120crWW at that it became 1st Indian film to Gross 100crWW\n\nIt's a very good family love film"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "sdigvijay-49403",
        "review_rating": "10",
        "review_title": "Best movie of all time",
        "review_detailed_main": "Frist film i watched on my new color TV when I was 4 year old and I fell love with this movie from there only Have watched it many time but never felt bored compare to any websiries or any damm movie wether its a nolan or marvel all felt boring but not HAHK it's love All songs are always in my playlist evergreen songs No doubt why it was and it is still the highest grosser of all time This will always be my love movie Family drama comedy and very sweet cute romantic story"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "anshulsharma-80649",
        "review_rating": "10",
        "review_title": "Its a masterpiece",
        "review_detailed_main": "This is not just a movie ,its a visual treat for eyes. Lovely nd unique costumes esp of madhuri ,15 songs and no vulgarity or double meaning dialogue and above all Madhuri mam."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "fackid-04615",
        "review_rating": "10",
        "review_title": "One of the best Film Of Salman Khan",
        "review_detailed_main": "I just love the film. It's awesome. It's a entertaining & family film. for me it's not a film it's a masterpiece. Very Nice movie"
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "Ibuk",
        "review_rating": "5",
        "review_title": "Hum Aapke Hai Koun- Overrated and uneventful",
        "review_detailed_main": "I have a few problems with this Sooraj Barjatya classic. First of all there were way too way songs, it was very annoying. Secondly nothing much actually happens until the last half hour, which tries my patience. In my opinion if a movie gets stretched for that long then there is much of a story to tell in the first place.\n\nThere were quite a few good songs though. Didi tera Devar, Wah Wah Ramji are my favourites.\n\nTo be honest I don't like Sooraj Barjatya's films, the only film of his I truly liked was Maine Pyar Kiya, Hum Saath Saath hai was average, Main Prem Ki Diwani Hoon was pathetic and Vivah was average. Its like watching a home movie, nothing interesting happens just a load of people talking."
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "debacs",
        "review_rating": "",
        "review_title": "not half as good as I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "beinghimanshu-08878",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "hydermateen",
        "review_rating": "10",
        "review_title": "All time blockbuster movie great axcellent movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110076",
        "movie_name": "Hum Aapke Hain Koun..!",
        "movie_rating": "7.5",
        "review_username": "tamu",
        "review_rating": "",
        "review_title": "A typical and realistic Love story",
        "review_detailed_main": ""
    }
]