[
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "jasminemoniquebell",
        "review_rating": "5",
        "review_title": "I loved this movie!",
        "review_detailed_main": "A lot of people are bashing this movie to shreds. This movie is not to be bashed its hilarious. It brought me out of my depression for a little while. It makes fun of classic dance movies. It could be offensive to those with little to no sense of humor. It kinda picks at gays,African American community,fat people,whites from the suburbs,Interacialdating, All the while doing it in a realistic stereotypical way. As a ex fat girl & African American I was not at all offended. Sometimes the best comedy is the one thats politically incorrect & free to be itself. People that think this movies bad don't know comedy its better then the typical spoof like movies out there. I think the wayans brothers did a glorious job at writing it. I wouldn't say its a 10 out of 10 but I would say its def. about half of that. It deserves better applause & recognition then its been getting. It maybe stupid but its def. funny & not predictable."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "KineticSeoul",
        "review_rating": "3",
        "review_title": "I can't believe this film actually disses \"Employee of the Month\"(2006)",
        "review_detailed_main": "I can't believe the creators of this movie think they have the right to actually diss \"Employee of the Month\"(2006) which I admit was not a good film, but I was just astounded. Now I will admit the movie did give me a few chuckles, but that is cause of how stupid the parodies in this is, but few of the parodies was a bit entertaining since I got most of it. I sometimes enjoy stupid comedies but the stupidity of this movie was just too much to the point it just gave me a bit of a head ache. The story is retarded and very simple, a girl named Megan who does ballet meets up with some wannabe break dancer Thomas(Damon Wayans, Jr). And they get some wacky romance going, with a bunch of stupid crude jokes thrown in to lengthen the run time which would actually have been a very short movie without it. The thing about the jokes in this movie despite it being not funny, is just way too drawn out. It just seems they went to great efforts to throw in unfunny jokes. If your someone who seen a lot of movies and get the parodies will find some of it to be very slightly amusing. But if you don't get what they are doing parodies of, you just won't get the dumb joke, because it's a inside joke for the people that has seen the movie they are trying to do parodies of and it's even a lousy attempt at that. And there is a heck load of parodies thrown in from a heck load of movies. It's just obvious the Wayans brothers was just trying to cash in, because they basically used the best bits for the trailer which wasn't even funny, so if you seen the trailer there really isn't a point to seeing this movie. This movie just makes black people look bad, in my opinion. The jokes are just vulgar and messed up while trying to go in the shock humor direction while trying to entertain the audience with the suffering of some of the characters in the movie. Which is fine if it was funny but that is not the case and it just feels like it's you that is being tormented. I must say they must have either payed the lead actress a lot of money for this role or she was just desperate for fame. The film is racist and sexist, and like I said is fine by me if it is funny, but it just isn't. This is one of those comedies where everyone is obnoxious and semi-retarded and I seen this types of comedies do quite well if they go in the right direction. But \"Dance Flick\" is just a jumbled mess and when the film is finished you start to wonder what just happened, because of the stupidity. And I ain't one of those critics that think they are more intelligent and superior to everyone else and go around bashing on dumb comedies that are actually quite entertaining for not being smart. But this film deserves to be bashed on. But like I said, if you get the parodies of other films which is strung up very randomly for laughs you might find it slightly amusing and will survive through it.\n\n3/10"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "OtherBrotherDarryl",
        "review_rating": "5",
        "review_title": "The trailer was much better",
        "review_detailed_main": "In comedy, they say, timing is everything. This movie works great when boiled down to a 30-second promo, and I was actually pretty excited to see it, even though I've never been a big fan of the Wayans' movies (and haven't even seen most of the films that this one spoofs). Unfortunately, they managed to fit most of the big laughs into that preview, so those moments didn't strike me as hard, and some of them dragged on too long and simply weren't funny at all (like the \"invade my space\" scene).\n\nI do think the current rating (2.8) is a bit harsh, though. The movie isn't that bad, it just isn't as funny as I'd hoped it would be."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "2",
        "review_title": "Dance Flick did not \"step up\" like it should have",
        "review_detailed_main": "With the recent disappointments that have been in the spoof movie genre, we needed something fresh and funny, well we're not getting that obviously. But ever since the Friedberg/Seltzer team has joined in the \"I can make a movie too\" bandwagon, we were begging the Waynes Brothers to come back. The last really funny spoof movies are the Scary Movie series, they were clever and in our faces about the clichés in horror movies. The past few years we have had a major thing with dance movies like: Save the Last Dance, Step Up, Stomp the Yard, You Got Served, Honey, etc. Leave it to the Wayanes Brothers to finally put this genre in it's over clichéd and overused scripts in it's place. Unfortunately Dance Flick did not meet my expectations, it was one of those movies that used all the funny clips in the trailer. I can't even believe how many problems there was with this movie, wither it's the editing, acting, or direction, Dance Flick is a let down.\n\nMegan is a former dancer who goes to a new school where everyone can magically sing and dance. She meets some new friends like Tracy, Charity and Thomas who is in a street dance gang. When Thomas and Megan connect they must face their \"impossible\" dreams together. Trying to \"bring it\", they work together to bring the ultimate dance group together. They also must face the difficulty of having a inter-racial relationship, as black women and white men passing them by, they try to pretend their love isn't real. But will they put all aside to help Thomas and his crew win the five grand to pay back his sponsor? Well, if you've see the \"dance flicks\" of the past decade, you know how it goes.\n\nNow for some odd reason I did get a few laughs out of a stupid movie like Meet the Spartans, but that was because I kept my expectations low and knew what I was going into. With Dance Flick it was completely different, I was really excited because we have a really funny team working on the film. But they relied too much on the gross jokes, instead of getting a laugh from them, they keep pushing on the gross jokes too much on the audience and it just didn't work. The actors seemed to force their comedy too much as well where they were just not funny. The movie was also, like most spoof movies, was way too short as well, the stories didn't make sense and were just too random. I'm sorry to say that Dance Flick is just a bad movie, it has a couple giggles here and there, but the audience was silent throughout most of the film. I'd say to skip the movie, if you really want to see it, go for the rental.\n\n2/10"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "the-movie-guy",
        "review_rating": "2",
        "review_title": "They used all the funny clips in the trailer",
        "review_detailed_main": "(Synopsis) Megan (Shoshanna Bush) has a dream of going to Juilliard and becoming a dancer. While she is performing at her dance audition, her mother is tragically killed in an auto accident. Megan must move to another city to her destitute father's apartment which is located in a condemned building. She enrolls in Musical High School, an inner city high school. Since her mother's death, Megan has given up dancing. Megan meets some new friends at the school like Tracy (Chelsea Makela), Charity (Essence Atkins), and Thomas (Damon Wayans Jr.) who dance in a street dance gang. Thomas and Megan connect, and they must face their impossible dance dream together. They try to bring the ultimate dance crew together to win $5,000 at the local dance contest.\n\n(My Comment) The funny and inventive Wayans Brothers made this spoof movie, yet it was not as funny as the TV movie trailers would imply. This is one of those movies that used all the funny clips in the trailer. If you go in thinking it will be a funny movie, it will disappoint you. There are so many problems with the acting, script, editing, and direction. Unfortunately, Dance Flick did not meet my expectations. I did laugh at many of the scenes, but the few laughs that I did have, weren't enough. At least the movie was short. I would not recommend this movie to anyone, so save your money and see something else. (Paramount Pictures, Run Time 1:23, Rated PG-13)(2/10)"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Use Any Moves Necessary to Escape.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "mrbilal1987",
        "review_rating": "1",
        "review_title": "A waste of time",
        "review_detailed_main": "I went to see Dance Flick with a friend of mine just a couple of days ago. From the previews I thought the movie would be pretty funny and I hadn't seen my friend in a while so I thought \"why not.\" My, I believe this is the first time I have ever stepped out of a movie theatre wishing I could get a refund. My friend and I were both able to agree that it was is probably the worst movie we have ever seen. The jokes, many of which based heavily on common negative stereotypes, were completely overplayed to the point of being down-right insulting. Some jokes just didn't make any sense whatsoever, and were disgusting. In short, the movie left much to be desired."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "cdiddy87",
        "review_rating": "1",
        "review_title": "This movie was awful!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "davidbeckham1441",
        "review_rating": "1",
        "review_title": "Dance flick needs better choreography.",
        "review_detailed_main": "This is one of the worst movies I have ever seen thankfully I saw it online.If I had paid for this I definitely would have demanded a refund.I only laughed about 2 or 3 times thats it throughout the whole film thats bad for a spoof.\n\nShoot I even liked Disaster Movie and Meet the Spartans even own them now on DVD.But this movie was just plain awful making fun of Ray Charles(low-class).Making light of the incident where Brandy accidentally wound up costing an innocent person their life(despicable).\n\nThis movie seemed to drag on and on and on it literally bored me to death and the ending wth?!That has got to be the worst ending of any movie I've ever seen period .It made no sense to the rest of the movie and the movie it was spoofing.Plus the acting in this film:BAD flat out terrible.The jokes were forced repetitive stale and boring just seemed more like torture after a while.\n\nThe youngest Wayans debut in this movie was not a good one he needs to take some definite acting lessons he sounded like he was reading off the script while he was talking .Shoshanna Bushs character seemed lost confused and made certain facial expressions other than that her acting was also terrible she couldn't even fake crying now THAT is really bad for any actor or actress.Wayans I am begging you stop the nightmare on spoof street while you still can please.I give this a 0 out of 10 complete waste of time thank god I didn't spend money on this tripe.Oh and that part about invading space was wrong that was like promoting abuse towards women subliminally in that one scene."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "tachytron",
        "review_rating": "1",
        "review_title": "How bad can a movie be? This one is hard to beat.",
        "review_detailed_main": "My wife and I, along with our 4 sons, walked out on this movie. This movie was misogynistic and pornographic.\n\nGuess what? Our kids hated it as well; they were stunned and said it was \"just weird\". We came home and explained to our kids we don't approve of this garbage. The trailers didn't convey whatsoever the degradation celebrated in this trashy film.\n\nI enjoyed \"Something about Mary\", love Monty Python, Fawlty Towers, and Hot Fuzz etc. Assuming you can look past the tired, sophomoric attempts at pornographic humor, the not-so-funny gratuitous violence, \"Dance Flick\" simply is not funny and it certainly isn't intelligent.\n\nSeems that we are not alone in our assessment of this terrible movie. We spoke to the manager after walking out, he agreed with us, apologized, and gave us compensation for our movie tickets. This movie shouldn't be rated PG-13; I recommend a rating of R. But still, I can't imagine any adult deriving any real entertainment value from \"Dance Flick\". Do not waste your time; it isn't even worth renting when it comes out on DVD. Yeah, it's that bad."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "midtra52",
        "review_rating": "1",
        "review_title": "What were they thinking??",
        "review_detailed_main": "I've always been a huge fan of the Wayans brothers. Their sitcoms have been hilarious along with most of their movies. I mean Major Payne was great. But I don't know what on Earth happened here. We know they have talent. We know they can be funny. When it comes down to it, this movie was just plain corny and not funny.\n\nThere were a few funny parts but I mean very very few. I would have thought they'd watch this movie themselves and realize if they released it things would be a disaster. It was just painful, and I don't know what happened. I hope the Wayans brothers can rise up after this failure and make some good stuff again. As far as this movie goes, the instant I finished watching it, I took the DVD out and broke it in two so no one else would ever have to suffer."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "makaylatran-55770",
        "review_rating": "8",
        "review_title": "If you don't get the humor that's on you",
        "review_detailed_main": "It's a great parody film really funny and if you think the acting is bad that's literally the whole point it's a parody film don't rate a film bad because your humor is linear."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Jackpollins",
        "review_rating": "7",
        "review_title": "Shockingly very funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "mellvsej",
        "review_rating": "4",
        "review_title": "Definitely not \"Scary Movie\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "Chill out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "gregking4",
        "review_rating": "3",
        "review_title": "will appeal to fans who love this sort of low brow humour",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "5",
        "review_title": "Odd....a Bottom 100 film that parodies another Bottom 100 film!",
        "review_detailed_main": "If you look at IMDB's infamous Bottom 100 list, you might notice that there are a lot of parody films on the list...all made during the last decade or two. It seems that a lot of lazy filmmakers have found that such movies are popular...althought they are extremely stupid and poorly made. An unusual parody film is \"Dance Flick\"....because it parodies another Bottom 100 film, 2004's \"You Got Served\" (#75)...though there is precident, as the \"50 Shades\" and its parody are both also on this list.\n\nLike the other parody movies, \"Dance Flick\" ostensibly parodies one particular film or style of film but its jokes are very broad and they attempt to parody a variety of films and pop culture. Like these films, the misses outnumber the funny jokes. And, many of the misses are generally crude and disgusting.\n\n\"Dance Flick\" is a Wayons project, with seven members of this acting family appearing in the movie or in behind the camera. This isn't so surprising, as a few of the Wayons' other films have been on this list over the years. What is surprising is that like \"You Got Served\", the movie isn't that bad and probably should not be on the Bottom 100 List.\n\nThe story, oddly, is a hip-hop film whose star is a very white girl, Megan, who moves to the inner city and finds friends among the local teens. She is an orphan and ex-dancer who soon falls for Thomas...a guy who loves hip-hop and introduces her to the culture.\n\nOn the plus side, although the film has many misses and many of the jokes are crude, there also many hits...genuinely funny skits that made me laugh...such as the scene involving the leg, the \"Fame\" song as well as the bizarro ballet Thomas takes Megan to see. Along the way, you see them parody a variety of films...some of which must have gone over the heads of the audience, as they were references to 1980s films....and most folks who like these parody films are teens and young adults who likely never saw films like \"Fame\" and \"Flashdance\". On the negative side, I am sure the script would offend many, as it tends to reinforce some negative black and gay stereotypes...so politically correct folks should think twice about seeing this one. It also is a crude and stupid film nearly as often as a clever one...so it's not like I am heartily endorsing the picture...just pointing out that it's watchable and not especially terrible...as its inclusion on the Bottom 100 would seem to indicate."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "The Wayans don't deliver",
        "review_detailed_main": "Dance Flick is a movie that really isn't funny or even remotely that great. It had some funny moments but not enough to actually be called funny. The acting was bad all in the film, mostly by the lead character Megan, and Thomas. His facial expressions were weird and he was over the top too much. But its a Wayans film, acting isn't always that great in their films. The plot is spoofed from Step Up 2: The Streets. About a girl Megan who wants to live her dream to become a dancer so she moves to another school. This happens when her mother passes away. Many spoofs in this film were unnecessary and just plain unfunny like the spoof of Ray Charles from \"Ray\", \"Fame\", and others. Spoofing Ray Charles was a surprise because \"Ray\" isn't a dance movie, and this movie is called Dance Flick. They also spoofed \"Twilight\" at the very ending. I didn't laugh at anything except a few chuckles. And like others have said, many of the funny scenes were in the trailers. One funny scene was towards the end with the final \"you got served\" dance scene with the fat guy dancing. Also credit to Shawn Wayans character and Affion Crockett (A-con), he was pretty funny. Though overall this movie was just not funny (except a few moments)"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Dwigg12",
        "review_rating": "1",
        "review_title": "About the Movie",
        "review_detailed_main": "this was the absolute worst Wayne's movie i've ever seen. the movie was a waste of my time and money. everybody in the movie theater i was in wanted a refund for their money. The move was dumb. It had no point to it. now don't get me wrong, yes it did have some funny points in the movie but with the funny points or no funny points the movie made absolutely no sense and i wish i wouldn't have wasted my money. i was very upset with the movie and so were my older and younger siblings. if i didn't know that the Wayne's were really and truly funny people i would never go see another one of their movies. but since i know they are normally very funny people i cant wait until they make another movie i just hope its much better than dance flick"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "dbborroughs",
        "review_rating": "2",
        "review_title": "Tired even by the spoof genre level of films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Jbrown0170",
        "review_rating": "4",
        "review_title": "What the!?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "tsangari2000",
        "review_rating": "1",
        "review_title": "Their humour has expired",
        "review_detailed_main": "Just like Steven Seagal should have stopped making films long ago, the Wayans Bros should have stopped while they were at a high.\n\nOnly 10 people filled the cinema seats, including me. I was tempted to leave half way as there was no story to keep me interested, but the humour is nothing inventive.\n\nYou will find yourself laughing at some of the slapstick that's thrown at you, but the film is a real waste of good money and time. I don't think even Five.TV will want to show it either, and they're good at putting really dire films on.\n\nChoose another film to watch. The Wayans Brothers have had a very good run over the last 17 years and they should leave it at that.\n\nI mean, even the one single fart-joke was badly used in one scene. It's the one last weapon for a laugh in a film and they still managed to bodge it all up."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "sweettendersteak",
        "review_rating": "9",
        "review_title": "My regards to the makers.",
        "review_detailed_main": "Thank you for keeping us entertained with smooth hilarious parody jokes and for using great quality cameras for a budget movie. Keep it up"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "culturedogs",
        "review_rating": "6",
        "review_title": "Dance Flick is a pleasant and hilarious surprise, AND a long-awaited return to Wayans' form",
        "review_detailed_main": "When I first saw the preview for this one, I found myself hoping against hope that the family that brought us I'm Gonna Get You, Sucka and In Living Color would step up to offer us a funny movie after White Chicks and Little Man. Honestly, I never bothered to watch those films, as the trailers were so screamingly unfunny to me.\n\nAnd now I find myself horrified at the average rating of 3.3 out of ten on IMDb(as of opening weekend) for Dance Flick, which I consider a loooong awaited return to form for Keenan Ivory Wayans, and a revelation of the rebirth of that satirical spark from the earliest days of In Living Color. In fact, Dance Flick even tops all modern attempts at satire by Zucker proteges Friedberg and Seltzer (Disaster Movie,Meet the Spartans, Epic Movie, Date Movie) and even David Zucker himself (though, curiously, it seemed to me that Shawn and Marlon Wayans were in his orbit for an over decade long meltdown, including his involvement in the Scary Movie series and, finally, last year's unfunny and politically confused An American Carol).\n\nHere's reason # 1 why Dance Flick tops it: it shows every sign that it was made by adults who actually watched the movies they're lampooning in their entireity (Gasp! Imagine that!). It's not surprising to me that a number of the more negative reviews on here ignore jokes based on movies like Little Miss Sunshine or Twilight, since those gags seemed to have been written by people who sat and watched more than the trailers for those films.\n\nReason #2: A good cast given a chance to shine. David Alan Grier's Showgirls parody was a great use of DAG's singing talents. Yes, he had to act through a fat suit for most of this film (ala Martin Lawrence and Eddie Murphy), but his performance so made up for his participation in Zucker's Carol.\n\nEssence Atkins is hilarious as Charity, the student mom who hangs her baby carrier up in her locker, baby intact, telling the waif to \"breathe through the vents.\"\n\nShoshanna Bush plays Megan White, who makes a bizarre choice for her Julliard audition, and whose mom seems on the edge of a \"tragic\" fate (in one of the funnier sequences in the film).\n\nDamon Wayans, Jr., however, is a revelation as a chip off a really funny block. He plays Thomas Uncles (if you can't sit well with that joke, please go rent I'm Gonna Get You Sucka and then we'll talk), a young dancer in a street crew who's also a starry-eyed med school hopeful in what's described as a \"Cosby sweater.\" Damon Jr. shows acting and humor chops equal to any in the previous generation of Wayans, and hopefully gets the chance to work on something at least this funny again.\n\nReason # 3: The director. Damien Dante Wayans demonstrates the difference between throwing a grab bag of lame material at the screen versus an attempt at layers of jokes.\n\nReason # 4: Continuity. This film, finally, feels like a product produced by people responsible for Hollywood Shuffle and I'm Gonna Get You Sucka. I'd gladly watch this film again, right alongside the previous two. Each of the films take out the satirical knives to point out the silliness inherent in a lot of pop cinema, but with affection.\n\nReason # 5: The jokes are funny. The movie is chock-a-block with well-timed gags, right down to the set decoration and costuming. Yes, there is evidence of jokes about Hairspray and Ray that are barely used, and the film is far from perfect. But the difference is in the funny. This is, and is so worth your time."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "TrAkILLAuDiO",
        "review_rating": "1",
        "review_title": "Only person in there (some spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "Surprisingly Decent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "SanteeFats",
        "review_rating": "5",
        "review_title": "Okay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "boblipton",
        "review_rating": "3",
        "review_title": "A Comedy Dance Movie That Doesn't Care About Comedy, Dance Or Movies",
        "review_detailed_main": "It's a burlesque of post-studio musical movies, the sort of movies one might see on the secondary but not \"classic\" channels, with references to films as old as FAME andDIRTY DANCING. It has a rapid, scattergun style of gags and dance moves in the manner of Airplane and other ZAZ films. And it's a Wayans clan movie, with direction by Damien Dante Wayans, and writing credits for four of the family. Some of the gags are very funny.\n\nThe problem with the movie is that the plots and subplots stop so someone can bust a move or do a gag, and then the dance is cut short or the punchline of the gag is interrupted so someone can do some exposition about the plot. The plot is nonsense, a mishmosh of elements that no one takes seriously, and that's acceptable; but then why treat the other two elements with equal contempt?"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Stampsfightclub",
        "review_rating": "3",
        "review_title": "Awfully predictable spoof that reflects the modern trend of comedy",
        "review_detailed_main": "Megan (Bush) moves away from her troubled home life to pursue her career in dancing, all the while adjusting to her new life and preparing for the biggest dance battle in history The comedy genre has hit a slump over the past decade, particularly with spoof related genres, evident when watching Disaster Movie, Scary Movies etc. So the premise doesn't look too wonderful when seeing the trailer for Dance Flick, which epitomizes the use of slapstick in identifying the underlying nature of High School Musical and Step Up 2.\n\nBut having an open mind and a friend who can get me in the cinema for free, I politely agreed to view this Wayans picture with him and in all honesty, we knew this would be awful, but oddly despite the degrading nature of the plot, the terrible slapstick and the degrading humour of character representation, it is by no means the worst spoof you will ever view.\n\nThe plot is a gimmick of Step Up 2 the streets, taking into account the central character Megan moving away from home to pursue a career in dancing before getting involved in the underground scene. Having watched that 2007 release seeing the comparisons here were fairly accurate, bar the awful humour. In fairness, Dance Flick depicts the nature of Step Up 2 quite well. However this doesn't stop viewers from being sickened once more by an awful array of disgusting jokes.\n\nEvident with Disaster Movie amongst other spoofs, we are delivered humour around physical appearance and abnormality and sick acts, and this picture is no different. From the gangster leader's weight problems to hanging a baby in a school locker, this is silly waffle, a film made for pure attack on modern well intended films. Perhaps 10 years ago it may have been humorous, but now with the plot so carbon copy of another we can see the punch lines coming, and this predictability weighs the suspense and intrigue down and with that comes a formula of boredom when annoyance sets in.\n\nPerformances wise none of the main actors really generate enough capability to even carry out some of the physical comedy. Megan's expression when kicking everyone when dancing is ridiculous, whilst Thomas is stone faced from start to finish.\n\nIf there are any other positives then they lie with the director and choreographer for making the last dance battle well staged, even if the fat gangster stereotype ruins it with the jump and squish move.\n\nThe inclusion of some dance and sing sequences is a step away from the norm, but are very cringe worthy, especially the high school musical Tony moment about his true orientation.\n\nAt the end of the day Dance Flick is your basic normal unfunny spoof that is only different from other recent spoofs by choosing different films to target. It isn't the worst film you will ever see, but nor is it the best."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "blacklavenders",
        "review_rating": "1",
        "review_title": "This Movie is not PG13",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "MoiL",
        "review_rating": "1",
        "review_title": "Please Do Not Watch!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Poke504",
        "review_rating": "4",
        "review_title": "Not worthy of a 2 star IMDb score, but containing nothing that can impress",
        "review_detailed_main": "I am personally a big fan of the \"movie\" films (like Epic Movie and other ones), but this still left me disappointed. I recognize that the movies are bad, but always have a tendency to make me laugh. This one, however, was not. It wasn't bad in my opinion, seeing as the Wayanes Brothers put a little more effort into it rather than mindless spoofs after spoof. Perhaps funnier if you see the movies it parodies, though I have seem a couple. But to put it in a nutshell...if Star Trek and every other good movie currently out suddenly were full, this would be your movie to see. It's fast-paced, got a few chuckles, and will be over before you can get bored of it."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "raulfaust",
        "review_rating": "5",
        "review_title": "Step back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "leighabc123",
        "review_rating": "9",
        "review_title": "The Wayans Family Is Still Creative!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Robert_duder",
        "review_rating": "6",
        "review_title": "For a ridiculous genre Dance Flick actually pulls it off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "TheLittleSongbird",
        "review_rating": "5",
        "review_title": "Better than any of the Friedberg-Seltzer movies combined, but Dance Flick could have been better",
        "review_detailed_main": "I decided to see this movie in intrepidation, since I am not a fan of this sort of film. There have been some surprisingly good spoofs such as High Anxiety, but the Friedberg-Seltzer movies are all a waste of time with terrible acting and lowbrow humour. So I watched Dance Flick, and while it was actually better than I expected, I was expecting it to be utter crap you see, it wasn't particularly good either.\n\nDance Flick does have its moments though. The choreography does sparkle a lot more than it doesn't, and there are one or two appealing performances, especially Essence Atkins's terrific comic turn and Shoshana Bush's cute as a button Megan. Plus Damon Wayans Jnr is pretty likable. The film is quite short and does move briskly, and I enjoyed spotting the references to Fame and High School Musical, some of which were done in a smart manner.\n\nHowever, there are some failures. The film does start off on the wrong foot unfortunately, thank goodness it does pick up. The story is also rather thin, and the script relies too much on bad taste and gross humour than genuinely hilarious and sophisticated humour. I am especially talking about Amy Sedaris as the aptly named dance teacher Mrs Cameltoe here. The direction is perhaps a little too smug and the editing is choppy on occasions. Although it does have many problems, Dance Flick is definitely not as bad as Disaster Movie or Epic Movie, and is moderately entertaining thanks to some spirited choreography and performances but is deeply flawed due to its thin story. 5/10 Bethany Cox"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Raflet60",
        "review_rating": "",
        "review_title": "Garbage!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "4",
        "review_title": "Not the best spoof I've ever seen, and I've definitely seen better from the Wayans's",
        "review_detailed_main": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning\n\nThe art of making a decent spoof film seems to have gone out the window these days. It's either they're all obsessed with vulgarity or they've all been done better before. This latest offering from the Wayans brothers, sending up all the recent smattering of dance movies from Save the Last Dance to the remake of Fame, is sort of a mix of both, especially if you compare it to their brilliant Scary Movie films. They're certainly very thorough, sending up every pop culture about in films at the moment, including, for instance, David Hasselhoff's drunken camcorder ramblings, but a good laugh is had once every blue moon. Sadly, instead of managing a steady rhythm, this send up has two left feet. **"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "kgekko16",
        "review_rating": "3",
        "review_title": "wayans brothers lost there skill?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "DICK STEEL",
        "review_rating": "5",
        "review_title": "A Nutshell Review: Dance Flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "kosmasp",
        "review_rating": "1",
        "review_title": "Scary Movie",
        "review_detailed_main": "Really scary actually ... because it disguises itself as a comedy, although it actually isn't! But seriously though, this movie sucks in a really bad way. As another user wrote, the movie didn't \"step up 2 the challenge\" (Kudos to Kristine for that summary line). It actually didn't step up 2 anything.\n\nAfter watching this movie (and about every other spoof comedy out there), I was wondering, why it isn't possible to capture the essence, the jokes, the creativity of the Zucker comedies? They look they masterpieces compared to recent \"comedies\" (well, they are, but you get my point, hopefully).\n\nIf one of the best jokes is \"Came to pick up my son\" (if you laugh at that, you might enjoy the movie, more than most people, although I giggled at that and didn't like it), you know you're in for something really bad. The spoof movies nowadays, are more like a Saturday Night Live show. Some sketches, but nothing really coherent. Not to mention the fact, that most people in here, either can't act or did a very good job convincing you, that they actually can't act!\n\nOne other reason is, the Zucker guys always said, how much they loved the movies they spoofed. I don't get that feeling from those new movies. Most of the jokes just are mean and would work better without a \"movie\" surrounding them (I think they would work as videos on the internet, on special comedy sites, that have such videos). As you can see by the rating, not really a movie you should be watching out for. Maybe the dance movies aren't really good most of the times, but they still deserve a better comedy made out of them ..."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "ContentConsumer_v12",
        "review_rating": "3",
        "review_title": "A Tasteless, Unfunny Disaster That Misses Every Mark",
        "review_detailed_main": "Dance Flick is an aggressively unfunny spoof that attempts to parody dance movies but fails miserably. The humor is lazy, relying on tired stereotypes and crude gags that feel more offensive than clever. The blackface scene, in particular, is downright shocking-completely unnecessary and just in bad taste. It's not just offensive; it's cringeworthy, leaving you wondering what the filmmakers were thinking. The humor throughout the movie feels lazy, like they weren't even trying. Instead of quick, clever jabs at the genre, they went for the easiest, most predictable gags-and none of them land. Some of the jokes do land - I won't deny that, but they're not consistent throughout the movie."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "arielimdb",
        "review_rating": "1",
        "review_title": "why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "eminkl",
        "review_rating": "4",
        "review_title": "Not the biggest spoof film, but it has a few funny moments.",
        "review_detailed_main": "Not the biggest spoof film, but it has a few funny moments. I liked this movie better than Little Man and White Chicks. I thought the problem with this film was that too many films were spoofed. I liked the parody of the music sequence of Fame and the spoof of Hairspray. I didn't care if Save the Last Dance or Step Up was spoofed. I thought the character of David Allan Grier was too big and I didn't like the parody of his Dreamgirls."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "vaqt",
        "review_rating": "9",
        "review_title": "Welcome back Wayanes'",
        "review_detailed_main": "I actually signed up for my IMDb subscription just to comment on this movie. I saw it last night and I LOVED it! Was it a great movie? no, of course not. But it was GREAT FUN! Amy Sedaris (sp?) alone is worth a trip to the theater. This is the kind of movie that cynics will crucify before they even see it. I suggest if you are having a long, tough week... You go out and rent \"Save the Last Dance\" and \"You got Served\" then watch this movie right after those.\n\nI haven't laughed this much in a long time. And the last few scenes are classic. If you loved the original Scary Movies and hated all of the spin offs (which the Wayans' didn't make) then this will be a treat for you.\n\nps. do NOT bring the kids. This is PG 13, but it is almost as racy as the original scary movie."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "smashayre",
        "review_rating": "7",
        "review_title": "It has its funny moments",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "steeleronaldr",
        "review_rating": "4",
        "review_title": "What did some people see in this movie",
        "review_detailed_main": "I'm not sure how some gave this movie anything above a 5. The acting is purely second rate and doesn't even try to be funny. I own this in a set which made me view it out of not only boredom but for something different. Now coming from the Wayans family you'd expect a over the top parody like \"Airplane\" or Naked Gun\". Here it's just one lackluster joke after another and nothing new to contribute. A couple of names on here that are usually better couldn't even save this one.\n\nThe whole movie looks rushed and the actors looking somewhat confused about the direction they were given. Now I love parody movies because it's a comical look at what figure of speech can do on a comical level. What was even more annoying was some of the characters that seemed to be in your face. I couldn't recommend this to anyone as it just isn't funny."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "mallaverack",
        "review_rating": "1",
        "review_title": "OUTSTANDINGLY ...uh....stupid!",
        "review_detailed_main": "Haven't laughed so much for quite a while - at the reviewers here who 'genuinely'? believed this movie deserved more than a one star rating.\n\nHonestly folks, this is pure bilge. A truly woeful waste of celluloid.\n\nA really pathetic attempt at humour.\n\nNo director could ever hope to create a spoof on this failure of a spoof.\n\nDeplorable."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "MrPepperoni",
        "review_rating": "2",
        "review_title": "Its a horrible nightmare",
        "review_detailed_main": "The wayan brothers comedy is repetitive and not original in this movie. Watch it kinda very sexist, racist, and it become not entertaining. They need creativity, and traveling so their picture can entertain."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "fxybot",
        "review_rating": "3",
        "review_title": "not very pleasant, to say the least",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "anaconda-40658",
        "review_rating": "5",
        "review_title": "Dance Away from This.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Kamurai25",
        "review_rating": "4",
        "review_title": "Dance, dance your way to another movie.",
        "review_detailed_main": "Okay watch at best, don't want to watch again, and I can't really recommend.\n\nFor the most part, they managed to focus on dance movie references, but there was a Catwoman and Twilight reference that were really odd.\n\nI spent a lot of the movie questioning if things were funny or how offensive they were and if it was okay. Kind off pulled me out of the movie."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "iamtherobotman",
        "review_rating": "1",
        "review_title": "get the foxtrot outta here...",
        "review_detailed_main": "Someone really has to tell these Wayans that they're not the comedy geniuses they clearly believe themselves to be. I've had the misfortune of watching a few of their films and have yet to crack a smile. Their humour is juvenile at best and all too predictable. This effort starts off bad and sadly for them continues to spiral downward faster than their horrific jokes punctuate this pitiful excuse for a comedy."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "p-stepien",
        "review_rating": "2",
        "review_title": "You got what you deserved!",
        "review_detailed_main": "A following addition to the Wayan brothers 'flick' series comes with no added surprise. A collage of goofs, spoofs, jokey jokes, fart jokes, barf jokes without a added side helping of more subtle humour. This time around the hapless target is the onslaught of dance movies initiated by various idiotic TV competitions. Various movies (not only purely dance blockbusters) are naturally winked at including \"You got game\", \"Hair\", \"save the Last Dance\", \"Ray\" or even the Twilight series.\n\nThe plot as thin as it is focuses around the characters of Megan (the beautiful Shoshana Bush) and Thomas (Damon Wayans Jr). But given this is really a cascade of wink-winks it truly is hard to piece together a coherent recap of the story.\n\nNonetheless the movie comes with no surprises. Whoever liked the previous Wayan movies (apparently quite a reasonable amount given the Wayans are still making these movies and apparently with a rather sizeable budget) will come out satisfied with this outing, as the humour is unchanged and keeps . Actually the way the Wayans try to joke is so predictable and repetitive it seems that the newest 'flick movie' made by the brothers should be the \"Flick Flick\", which basically pokes fun at their own genre and its audacious lack of innovation."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "sarah1358",
        "review_rating": "10",
        "review_title": "classic dance flick!",
        "review_detailed_main": "i rely enjoyed this movie it was funny with its own classic jokes and never a dull scene, i could watch it over and over again!!! this movie was what i was expecting, it is by the wayans brothers (white chicks, scary movies, little man) so obliviously it was going to similar sense of humor. it mocked step up, save the last dance, you got served, stomp the yard, ray, hairspray, high school musical a bit of Edwardscissor hands and even a scene from twilight.... the actors acted rely well, and performed there 100% best. the movie went for 1hour and 27mins of full entertainment.\n\ni mean what more do you expect! it was worth a watch..."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "charlytully",
        "review_rating": "5",
        "review_title": "Let's put on a show--and charge everyone 10 bucks each!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "Very Funny!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "beetlejuice1987",
        "review_rating": "9",
        "review_title": "Dance Flick was GOOD!",
        "review_detailed_main": "I went to see Dance Flick, really unsure what I would think but still had an open mind...and I REALLY liked it. I was hysterically laughing the whole time and I really loved the dance sequences too. It's more than just a spoof movie...it has plot, humor, romance but the humor was what I loved best. It really will make you laugh and you are sure to have a good time if you see this movie. Take your friends, so you can all laugh together and quote it afterward. The Wayans always know what they are doing and they got this one right! Take your family, take everyone you know...just go see it and have a great time. Good summer comedy!"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "zardoz-13",
        "review_rating": "10",
        "review_title": "A Comic Cakewalk!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "modernmirakle",
        "review_rating": "8",
        "review_title": "I'm An Optimist While Being Blatantly Honest....",
        "review_detailed_main": "I'm going to make this plain and simple. If you like the Wayans Brothers, watch the movie. The movie has its funny moments just like any other films the Wayans Brothers star in. So if you're a fan of White Chicks and/or the Scary Movie series, I can't find a reason why you wouldn't appreciate this film. Like seriously, the movie is a comedy-based film creating spoofs just like any other spoof-movie would.\n\nIn fact, I enjoyed this movie so much, it reminded me of their old school film called \"Im Gonna Get You Sucka\" where humor was about being original. So on that note, its a COMEDY FILM. Some people enjoy them while others don't. If you're a college student looking for laughter, corniness, and cheesiness? This is the movie for you and your friends if you're looking for a good time."
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "ruru1967",
        "review_rating": "10",
        "review_title": "This was GREAT!!!!",
        "review_detailed_main": "Don't believe the negative hype; anyone that puts this movie down is just uptight and can't get with the 'Down-Low'. LOL . My God, this was a CRAZY FUNNY MOVIE!!! I was laughing through the whole movie; it was great seeing the whole Keenan Family back with new friends and old friends. Go see this movie, if you TRULY love to laugh. I saw it Opening Day; no-one walked out and everyone was laughing. I went shopping for the soundtrack, after I saw the movie; I found it on iTunes. I did see it at FYE, the following day. I loved this movie and I can't wait for the Blu-Ray! Thank you, to everyone that worked on the movie and to all the musical artists for their contributions! P.S. I got the chance to see the taping of a Keenan Ivory Wayans Show, in Hollywood, and Kim Wayans was one of his guests; I will always remember that day. RuRu1967"
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "alkolbiofuels",
        "review_rating": "",
        "review_title": "Can't stand see children suffer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1153706",
        "movie_name": "Dance Flick",
        "movie_rating": "3.6",
        "review_username": "carl_2266",
        "review_rating": "",
        "review_title": "Dancing never looked so bad!",
        "review_detailed_main": ""
    }
]