[
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ilpintl",
        "review_rating": "7",
        "review_title": "Blown away by passion, dismantled by love...",
        "review_detailed_main": "\"Fanaa\" is not a word in common parlance. In Persian, Urdu, and chaste Hindi, it means \"annihilated\", \"destroyed\", or in the context of the latest offering from Yash-Raj Films, it signifies \"devastated, ravaged, or consumed by love\". Any film bearing such an intriguing, if somewhat grandiose, title would have the onus of living up to enormous expectations. In addition, this is Kajol's first film after a self-imposed hiatus, while Aamir Khan, paired with her here for the first time, is also seen infrequently on screen due to his reputed fastidiousness in choosing movie projects.\n\nI say good for them, for this is a superb collaboration between the actors. Aided by strong writing, a different story, able direction, and slick production values, they make it an entirely worthwhile proposition.\n\nThe story\u0097as much as I can divulge in a review\u0097starts off in fairly formulaic boy-meets-girl fashion: Zooni Ali Beg (Kajol), a beautiful blind Kashmiri young woman, comes to the big city (New Delhi, in this case) for the very first time, after having lived a sheltered, happy life in a pristine little town in Kashmir. Right off the bat, she meets a tour guide with the gift of the gab and a roving eye named Rehan Quadri (Aamir Khan), and against the better judgment of her friends, takes up with him.\n\nAamir looks a bit long in the tooth to be playing Romeo, but does so gamely, and successfully gets the smitten Zooni to agree to a no-strings romance. This is where I realized that the times, they are a-changing: sweet, blind (in more ways than one), sheltered Zooni is so consumed by love that she permits Rehan to bed her before he weds her, a phenomenon that is exceedingly rare (or used to be) in Hindi films. Her parents agree to the match, and the footloose Rehan readies himself for marriage to just one woman.\n\nThen hell breaks loose. Rehan is killed in a terrorist bomb blast, or so we are led to think, while the Indian authorities launch a search for the criminal mastermind that planned this and several similar attacks. Years later, a Major Ranjeev, bearing a disturbing resemblance to the dead Rehan, shows up. So what are we to think?\n\nFrom this point on, the film takes off into novel terrain, becoming an extremely satisfying viewing experience. Differing perspectives of nationalism and terrorism are explored\u0097one man's terrorist act may also be looked at as a fight for an independent homeland\u0097as well as conventional familial and romantic relationships. Notions of love, loyalty, betrayal, patriotism, and morality get turned on their head, making for a pretty complex film. Is this overly ambitious for a commercial Hindi blockbuster? Perhaps, but the intellectual sophistication of the film-making team more or less pulls it off. There are some plot holes, but they can be overlooked in the interests of the big picture.\n\nKajol grows in stature as an actor with every film, and her Zooni goes from naive and school-girlish to anguished widow and conflicted wife\u0097a challenging character arc, by any measure\u0097yet, she makes it truthful and believable with her wonderful transparency. Also wonderful is that neither motherhood, nor her absence from the screen for five years, have dimmed her youthful looks or charm. If anything, she is more svelte, and her face shines with increased character. Kajol has been blessed with sublimely expressive eyes, and now that she has acquired more life experience, they register even greater pain. One almost feels like looking away at times, to allow her privacy in her grief. I welcome her return to the screen, and if she displays similar care in choosing her next project, it will be worth the wait.\n\nAamir Khan picks his projects with a mix of sensitivity and savvy, and presents the film-going public with a different persona each time. He contrasted his feisty village yokel role in \"Lagaan\" nicely with the glib, self-absorbed urban youth undone by love in \"Dil Chahta Hai\", so that in the same year, folks got to see two completely different Aamirs. I haven't seen his \"The Rising: The Song of Mangal Pandey\" or \"Rang De Basanti\" as yet, but I am confident that he burrowed deep into the souls of the characters of those films, too. Here he inhabits the skin and soul of Rehan Quadri/Major Ranjeev with total conviction and allows you into the thought processes of these men. He does look too old to do the romantic shtick demanded of the Rehan character, but comes into his own while playing the older Major Ranjeev, a profoundly troubled man dealing with adult ethical, ideological, and moral conundrums. To comment any more on his performance would be a disservice to the plot twists of the film, so I shall stop right here.\n\nThe director, Kunal Kohli, handled the fun and light-hearted \"Hum Tum\" with aplomb, and here he tackles subjects far weightier than those of the Rani Mukherjee-Saif Ali Khan film. His occasional missteps result in some unevenness of pace and tone (which some judicious editing would have remedied), but with the overall wallop the film packs, these are minor lapses. I personally felt the second half of the film needed no songs, but that is my own quibble. The millions in the majority would have none of that, I'm sure. Aamir and Kajol do their own singing in a small but powerful scene, and this, I felt, was far more effective and poignant than the over-produced orchestrations of Jatin-Lalit and the vast array of playback singers they assembled.\n\nRishi Kapoor, Kiron Kher, Tabu, and others offer strong support, while child actor Ali Hajji as young Rehan is amazingly unaffected and natural.\n\nAfter witnessing the combustible chemistry between Kajol and Aamir (why were they never paired together before?), and being privy to the volatile, seismic shifts in their relationship in this film, I conclude that \"Fanaa\" is indeed the title that says it best."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "natasha_00792000",
        "review_rating": "7",
        "review_title": "Loved it ....",
        "review_detailed_main": "It tickled me no end to read some viewers comment that a Kashmiri Muslim girl fell in love and allowed a man to bed her in a span of 8 days romance. They thought it slightly implausible. This might have held true for some two decades back but not nowadays. We have to understand Zooni (Kajol) came from a fairly modern family (she was no village bumpkin) in the movie and the apple of her parents eye. More so because she was blind and her mother always encouraged her to look forward to her Prince Charming the day he arrived. She was this inexperienced girl full of ideas of romance and blind to boot and Aamirs winsome voice and poetry won her over and she just went into the relationship headstrong girl that she was knowing and accepting that there might never be anything permanent (she just wanted to live for those 8 days she was able to be romanced by the person she was besotted with) a very common occurrence actually in todays scenario.\n\nThe story of a man torn between love and duty might be hackneyed but I sure as hell didn't know how it was all going to end and was eager to sit through the whole film and watch it to the very end. I don't know how some people thought the first 90 minutes was horrible and the rest even more so! I found the first half extremely entertaining and the second half was a pleasure to watch just for the sheer pleasure of watching two very high class actors perform as they never have.\n\nKunal Kohli is an extremely sensitive director and while there may have been slip ups in pace here and there (it was an emotional rather than an action packed movie after all) on the whole the movie shows a director of competence and someone who has a very bright future.\n\nThe cinematography is breathtaking and the supporting cast of Rishi Kapoor and Tabu adds to the movies worth. Rishi especially is brilliant.\n\nBut the movies strongest point is the performance of the two lead actors especially Kajol who had the more author backed role. Kajol and Aamirs chemistry leave you wondering WHY they never acted together before. And they look so good its hard to imagine Kajols a mom and Aamir a divorced dad of two."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "yourstrulyever",
        "review_rating": "8",
        "review_title": "Amazing chemistry !!!!!!!!!",
        "review_detailed_main": "This is hands down the best romantic film since .....well in a long time , all the people i know who haven't liked this film is because its got impossible situations in it and its slow in the 2nd half all i have to say : stop watching Hindi films then and continue watching 25 sec ads which have diminished your attention span .\n\nThe characters are given amazing dept and lo and behold they take the film to an all new high .Kajol has proved shes the best actress of her generation and with this film is giving serious competion to her late legendary aunt nutun as the best actress of the family .\n\nAamir is splendid though i felt his character got a bit sketchy in the 2nd half not his fault the director and writer could have made his motives more clearer for us . however what ever hes given to work with he electrifies every scene hes in .\n\nkudos to all the crew especially kunal kohli"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "masrur",
        "review_rating": "7",
        "review_title": "A complex love movie with a brilliant second half",
        "review_detailed_main": "Fanaa is a complex movie. Aamir Khan has continued his trend of working on unusual plots and delivering extraordinary performances and Kajol has outshone Aamir on many occasions in the film.\n\nThe emotional intensity of the movie gets to the core of the viewer's heart. It may help people to look at the Kashmir issue from a different angle but it does certainly portray one fact, and that is a seemingly ruthless terrorist can actually be a simple and kind man fighting for his land's freedom. For him, making judgement on greater good or lesser evil is a constant struggle. Even though Rehan (Aamir) did not derail from his cause (terorrism apparently) till the last breath in his body, he will draw sympathy from the viewers.\n\nThe splendor of light, sound and colors in big budget Hindi movies is achieving new heights every day. Viewers will be simply spellbound to the screen during most of the song sequences. The music of the movie was like a breath of fresh air. The viewers will also enjoy a ride of convincing and innovative action sequences.\n\nThe first half of the movie could have been made better though. Sometimes the pace felt a little off. The constant exchange of poetry did feel irritating at times. Perhaps, if Aamir could shed off a few kilos, things could have looked a little more natural. It was also unusual for a blind Muslim girl like Zooni (Kajol) to indulge into a physical relation with Rehan (who did not pledge any commitment to their relation) so early. But I guess these things follow typical commercial Hindi film unofficial rules.\n\nOverall the movie is certainly worth watching and, compared to most of the Hindi films, quite a unique one."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "poorni-pillai",
        "review_rating": "9",
        "review_title": "thought-provoking",
        "review_detailed_main": "Fanaa- This truly is a good movie- not just in the entertaining sense. There are a few bloopers, of course, but they may be easily overlooked, an easy enough thing for sensible and regular watchers of Indian cinema.\n\nTrue, Aamir and Kajol have performed brilliantly, the cinematography is excellent and the music heavenly. The background scores are worth more than a mention.\n\nBut the movie goes deeper and makes one think about the power of love and our utter helplessness before it... how it shapes one's life and choices. The importance of choice is given the limelight in this movie- the choices that are so unique and personal to each of us, given the same situation. It also asks, importantly, how much can love forgive?\n\nPut yourself in the place of these characters as you watch the movie and see how much is asked of you at each step, what strength is required to make the choices they make.\n\nThis movie, in some ways, is a lesson in love. It puts to shame our cautiousness, rigid moral standards, emotional walls etc in love. You cannot walk into love with tiny steps, wearing a steel armor and praying not to get hurt. There is no such thing as going too fast or too slow, or all these clichés we've come up with to explain relationships :)\n\nTo love, you truly HAVE to be free. At heart."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "udita_mittal",
        "review_rating": "6",
        "review_title": "I'm not so sure........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "lamiae27",
        "review_rating": "9",
        "review_title": "Fanaa is a dream that stays in the heart foever!",
        "review_detailed_main": "Fanaa is a love story which has been written as a love story ,directed as a love story and acted like a love story. Fanna belongs totally to Aamir and Kajol ,who both have delivered a brilliant performance. Kajol plays Zooni with such a class and natural , she reached ,with Fanaa, a place that no other actress ,today, can reach or even come close.she was breathtaking. Aamir plays Rehan, though it's a unusual role that many of Bollywood actors would turn down(nobody wants to play the anti-hero anymore), he makes it real to the core,you follow him through the whole transition of his character,you love him and you hate him at the same time !Aamir is the master of acting today. The chemistry between Aamir and Kajol was terrific!Kajol matches Aamir ,like the sun matches the sky,they delighted every frame of the screen! an award the best Jodi of 2006 will be simply fair! The other actors were efficient! The music of Fanaa is beautiful and the videos makes it just better:a high note to Dekho Na,Kunal managed to control the little space of the shot with ease and closeups of Aamir and Kajol were fantastic.however,it's Mere Haath Me that steals the show,it was just superb,and it will be fair enough to say that this video will be the reference for any romantic song !(the reference was for a long time,Suraj Hua Madham of k3g). the script of Fanaa has some mistakes for sure,but when you watch Aamir and Kajol together you just forget and forgive! Beautifully shot,Fanaa makes you following the journey of two lovers who maybe wanted and deserved their part of happiness,so they knocked the heaven's door but another destiny was writing for them. go watch Fanaa once for Kajol,twice for Aamir,a third time for Aamir and Kajol,and watch it again and again and again for all those reasons!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "arif-attar",
        "review_rating": "7",
        "review_title": "Fanaa is like reading a 19th Century English Novel",
        "review_detailed_main": "Well, if you have had that experience you will know what I am talking about. The character of Zooni is straight out of Bronte sisters' romantic novels. The strong willed, intelligent girl out to meet her prince, the supportive mother, the mysterious and charming lover, the lonely house in the middle of nowhere, the retired colonel as the only family friend who sometimes comes and shares a drink with the father; it's all there.\n\nFanaa is one of the most intense romantic movies to have come out of Bollywood for a long time. Perhaps, since Silsila. The pairing of two of the best actors of our generation (maybe, perhaps of all time) needed a story just like Fanaa. You need to scratch the surface to reveal the passion of this unique love story.\n\nThe director, Kunal Kohli has exploited the potential of this pairing admirably. Look at the picturisation of the song 'Dekho Na'. The camera hardly seems to move away from the two faces. There are innumerable scenes in the film where just these two faces share the screen.It is hard to think of any other actors from the present who would be able to pull off such a form of narration. Ultimately, the film belongs to Zooni and Kajol comes out with her best performance to date. Rehan asks, \"KOI KISISE ITNA PYAR KAISE KAR SAKTA HAI?\" and it shows in Zooni's eyes. What a role to make a come back and what a performance to make a comeback! And Aamir never ceases to surprise. He holds his own in a story primarily about Zooni and complements her character brilliantly. His performance is so amazingly understated, and yet so powerful. Rehan is one of the most complex and difficult characters played by Aamir. And it's all about the characters of Rehan and Zooni, their ideals, their emotions, their dreams and their passion. It's really like reading a 19th century English novel. It is not easy to narrate a story this way in a mainstream film and this is where the narration stumbles. The scene where Rehan takes Zooni from the train and carries her in his arms looks very cliché and awfully out of place. The tag line '.....TERE ISHQ MEIN MERI JAAN FANAA HO JAYE' is repeated to death in the film. There have been some cinematic liberties taken in the screenplay, like Rehan infiltrating the Indian Army, Zooni fumbling with the radio transmitter and speaking to the right people. The Urdu couplets, although all very good, seem to hold back the flow a bit. Also, the discussion on the political history of Kashmir at the meeting of the Intelligence Heads seems a bit off track. A better place to put that discussion would have been a friendly chat between Rehan and Zulfi (Zooni's father)over a drink.\n\nBut these are minor skirmishes in a remarkable film. The story remains true to the title of the film and if you have a liking for 19th century English novels, you would simply love this one."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "aditya_sridhar",
        "review_rating": "10",
        "review_title": "Fanna is all about Aamir and Kajol",
        "review_detailed_main": "OK the much awaited movie. Aamir after RDB and Kajol after a long break. The movie starts off with some brilliant locales and Kajol going to Delhi for a dance program where she encounters Rehan (Aamir). The sher- shayari bit in the first half is really good maybe coz of the way Aamir says it .\n\nThen there's a twist in the tale just before the interval and the story changes. I don't want to write a professional review , just things which i felt. First of all the side cast is amazing . They have been well chosen and do justice to their roles . The story is pretty mediocre . Aamir is fantastic as the happy-go-lucky tourist guide and Kajol glistens as the docile , demure blind girl.\n\nThere are instances of Kunal Kohli's trademark sequences like putting songs where they just aren't necessary and some elongation of scenes . But the thing that makes this movie from being a common fare to a must watch are Aamir and Kajol . Their screen presence is amazing and the chemistry they share was just too good. They are the only 2 actors who could make a simple hug look like the reunion between two lovers . The ending sequence was also brilliantly handled .\n\nThere are many mixed reviews to this movie . As i normally don't like any of the Yash Raj movies , this one i found to be quite touching . I would recommend this movie just for the magic that Aamir and Kajol create on the screen."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "toro1",
        "review_rating": "",
        "review_title": "\"Eye of the Needle\" plagiarised",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "pooja-vaya",
        "review_rating": "7",
        "review_title": "Worth watching once...and worth listening (shayeris) more than once !",
        "review_detailed_main": "Title \"FANAA\"....as it says \"Destroyed in Love\"...well suits the theme.\n\nRehan (Aamir Khan) is on a mission where he meets Zooni (Kajol), playing a role of a blind girl who is on a visit to Delhi for the performance. The story starts with them falling in love with each other. The dialog here are very interesting especially for Hindi / Urdu poetry lovers. It is a beautiful expression of exchanging their feelings in enchanting words\u0085truly mesmerizing. The viewers who are enthralled by this love story in the first half are astonished to see the twist of the second half. Here comes the silent message and the sad end (as the name suggests) where Zooni has to choose between right or wrong, between the life with her son and lover/husband who has returned after years or the country's wellbeing that is in danger if Rehan succeeds in his plan. Zooni chooses the right thing as taught by her parents.\n\nOver all, it is a good plot, well written and well directed. It is a love story with a twist finally depicting that the love for the truth and for the country is far greater then one's personal feeling. As mentioned, there is always a choice between good and bad but what defines one's life is the right choice.\n\nLyrics are very melodious and the music is also very good that gifts us the hit song of the month \"Chand...\""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "amby69",
        "review_rating": "8",
        "review_title": "Fanaa = true Bollywood film",
        "review_detailed_main": "After all the recent pornographic movies such as Murder and the like, it's really refreshing to have a D E C E N T Indian film which the entire family can watch. Sure the film wasn't brilliant but it beats the other crap Bollywood has been spewing out ever since the arrival of Mr. Imran-Gigolo-Hashmi. What a treat to see Kajol on screen again. She truly is the gem in the crown of Indian cinema. And as for Aamir...well, his done it again. After his stellar performance in Rang De Basanti, he pulls off the role of Rehan with immense warmth and passion. I know this is probably a pipe-dream, but it would be fantastic to see these 2 set the big screen ablaze again. Kudos to Kunal Kohli for reminding the world of what a true Bollywood film is made of!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "iftikharkhokher",
        "review_rating": "6",
        "review_title": "Fanaa",
        "review_detailed_main": "Whilst i agree that the film is well directed,has a fine script and has wonderful performances from the main stars i am totally taken aback and disgusted at the false ideals that are presented in it.In short the film is a mockery of the struggle of the Kashmiri nation and a defilement of the Kashmiri woman.Kashmir is fighting for its freedom from Indian occupation and atrocities that are indescribable.There is no Kashmiri woman or man who will put the glory of India before the life of a Kashmiri man no matter if he is a terrorist or not.Whoever conceived this idea is either a fool or an enemy of Kashmir.Show me a Kashmiri who is loyal to India and i will show you a traitor.Perhaps Aamir Khan knew this.He is very restrained and sullen throughout the film.Kajol looks more a Bombayite than a Kashmiri and Rishi Kapoor is also unsuitable.We know that Bollywood always take the leaf and goods from Hollywood but whereas Hollywood is renowned for exposing the naked and painful truth Bollywood tends to twist reality to suit the ideals of the Indian state.India has long hid the facts about Kashmir, failed to honour its policies including the one of leaving the Kashmiris to decide their own fate and this film is just another example of hoodwinking the West and ignorant minds in the sub-continent.What better then to do it through the screen idol of the millions...the mighty Khan!I wonder whether he is aware that millions of Kashmiri women have been raped,looted and murdered by Indian troops.So much for Bollywood glory!."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kkanth",
        "review_rating": "2",
        "review_title": "Self directed by Aamir and Kajol",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "1930s_Time_Machine",
        "review_rating": "7",
        "review_title": "Sentimental but in a good way",
        "review_detailed_main": "Starts as a pretty lightweight bad comedy then evolves into to sickly lovely-dovey stuff however this is actually is necessary in getting to know the characters and know how they feel for when the film really gets going about half way through. It's a brilliant piece of story-telling, really moving and stunningly beautiful to look at.\n\nKajol is a huge star in India and I can see why; even though us English can't understand Hindi (there are subtitles of course), as the film unfolds you feel as though you really know her. You don't just watch this film, you are drawn into it, what matters to Kajol's character becomes vitality important to you. It's amazing story telling."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "paribadar",
        "review_rating": "10",
        "review_title": "A well made film by Kunal, different film from others",
        "review_detailed_main": "A great made after the comedy Hum Tum. Kunal have done a brilliant job. He had wrote the dialogs, the story brilliantly. I think its totally different film of Indian cinema. As bollywood freak I recommend this film to all audience even to kids too. Its has huge stars and brilliant director. Kunal gave his best even more than Hum Tum. Way to go Kunal you surely winning in this year. Nominations for sure even awards too. I believe you deserve more this year than Karan Johar from KANK. The direction you made has been the best. I even liked KANK but after I saw Fanaa I think its a way different film and making its mark separate from all films from past. The direction of Kunal has been the best direction I seen so far this year. This film should win the best-playback and direction as well. The film stars huge cast for sure. It has Rishi Kapoor whom I really adore. He is brilliant even in small role of a father. Aamir Khan is superb just superb. I can't even say in words how he gave his performance. Great comeback from KAJOL. I am a huge fan of her since I began seeing films. Kajol is the best actress ever of new generation.\n\nAfter K3G she has made a great come back. Her performance is just brilliant. Its just marvelous. She was truly character in the film. It for one second you can't say that she is not acting as blind. Her acting is better than Rani from black. I don't say Rani didn't act good but she was good but Kajol is the best in blind role. The film is a must see. When you think you know whats happening but the second next you don't. The dialogs are written brilliantly. The lyrics are just very touchy. The music is worth it that you can't even comment because it's from the soul. Sonu sang the song beautifully. The Tere haath main mera haath ho. This song is sang by Sonu Nigam beautifully. I think he should win awards this year from this song from Fanaa. The tittle song from Kank he also sang brilliantly but he sang this song even better. Yashraj are still ruling. Making the greatest movies. Bollywood awards sometimes are differ from our choices but if i was the jury I would the award for best director of this film. I would also give Sonu for best playback singer from Tere Haath mein Mera haath ho. I would also give the award for best story and dialogs . An excellent film. I am sure this film is getting many awards but these i mentioned I think it should be the winners. As far as acting Kajol is the best and should get an award too. Aamir is brilliant but I think Shah Rukh has acted better in KANK. Kirron Kher is in both so i can't say but she is not much in this film. I give this film 1000000 out of 1000000."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "deepakt65",
        "review_rating": "6",
        "review_title": "The Eye Of The Needle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "pene9898",
        "review_rating": "10",
        "review_title": "Elegant and sensitive act",
        "review_detailed_main": "The most sensitive romance enacted by Bollywood. Fanaa is the epitome of elegant love story brought alive by the two world class and best ever actors in Bollywood, Kajol and Aamir Khan.\n\nAll the scenes by Aamir and Kajol, which represents the majority of the movie, are worth repeating watching on the big screen. Their scenes tugs your heart in happiness, regrets, hopes, sadness, helplessness and so on.\n\nLittle flaws in the narration of the movie (which are basically negligible, compared to other Bollywood flicks and even many of Hollywood flicks) are forgiven by the powerful yet very subtle act by the two actors.\n\nExcellent, go watch it."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "A Terrorist Comedy (Unintentionally of Course)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "rajesh-scorpi",
        "review_rating": "6",
        "review_title": "Good movie but with many predictable 'Hindi film' scenes",
        "review_detailed_main": "Went to see the movie last week . The movie is good to see but it contains some easily predictable scenes and also has some scenes which you can see only in typical Hindi movies(of Aditya chopra and karan johar type). I can't stop thinking that if only Mani rathnam has directed this movie, it could've been a great treat to watch. Kunal Kohli , at some places , thinks like a typical Hindi director and if he avoids this, he'll be a better director.\n\nI got to tell u something about the songs. . The song 'Dekho Naa' has been wonderfully filmed. . Also the song 'Mere haath mein' is one of the best matured duets I've ever seen in Hindi movies.. Ravi k Chandran has done an excellent job, as always.\n\nAamir and Kajol have presented a good demonstration of acting. There are a great many number of close up shots for both of them . They 've effectively managed the close ups. . Good acting.. Overall, a good movie but if those typecast scenes 've been chopped off, would've been an even better film."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "nabeel776",
        "review_rating": "9",
        "review_title": "One of the best move Bollywood ever made",
        "review_detailed_main": "I watched this movie last night and was quite thrilled with it. Aamir Khan and Kajol were both at their best. One of the other comments already has the story told so I would not tell what happens in the movie, but I will tell this much that most of the Bollywood movies that I get to watch are filled with flaws and stupidities, but this movie by far exceeds my expectation. The movies has a very humorous start, however, the ending is quite sad, but that was meant to be by the title of the movie \"Fanaa\". The music was quite different and very enchanting. The supporting actors/actresses (rishi kapoor, Haji Ali) did very good in the movie. Overall, the movie is excellent and worth watching, Bollywood does not produce such movies that often."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "AishFan",
        "review_rating": "6",
        "review_title": "Good though not as awesome as hyped up to be",
        "review_detailed_main": "One of the most awaited movies of the year, Fanaa makes box office records as one of India's favorite actresses returns after a long hiatus alongside one of the country's most talented and popular actors. Seems like the pairing of Kajol and Aamir Khan is enough to create the frenzy surrounding this movie. As is expected from Yash Raj films, Fanaa, too, has a great story, along with awesome performances, visuals, technical effects, direction, etc. However, the story is not as superb as hoped for. It is quite similar to the Amisha-Bobby-Arjun starrer, Humko Tumse Pyaar Hai, as far as the \"blind love\" goes and is also a bit reminiscent of Veer-Zaara. Music, usually one of the strongest points of a Yash Raj film, is rather disappointing. \"Chand Sifarish\" and \"Boondon Se\" are mainly the good numbers. \"Aaklam Baklam\" or whatever it's called should have been edited out. Cinematography is absolutely beautiful. Kajol is obviously the best in the film, while Aamir is great. Tabu is very nice as are Rishi Kapoor, Kirron Kher, and the really cute child artist. All performances are top-notch. Shiny Ahuja and Lara Dutta have really no role to speak of. The theme is really nice: Choosing between good and evil is easy. Choosing the greater of two goods or the lesser of two evils is what defines life."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "MovieInspector",
        "review_rating": "9",
        "review_title": "One of Aamir's and definitely Kajol's finest performance in recent times.",
        "review_detailed_main": "First of all I'd like to praise the production team for coming up with such a good script. The director, Kunal Kohli, deserves all the praise in the world for doing such a great job here. Technically, the film is great; there's a great script, great screenplay, cinematography and acting.Aamir has given one of his finest performances in recent times. Kajol has given her best performance of the decade here. Rishi Kapoor and Kirron Kher are also good in their roles. The music of the film is great, and the best song has to be 'chand sifarish'- one of the best love songs you'll ever listen to.\n\nVerdict: Watch it for the story, Aamir and Kajol. I give it 9.5/10"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "nmadhuk3",
        "review_rating": "6",
        "review_title": "Just Another Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "planktonrules",
        "review_rating": "5",
        "review_title": "It's like two totally different movies thrown together! Both halves were good...but together they just didn't work.",
        "review_detailed_main": "\"Fanaa\" is an incredibly frustrating film to watch. The first half is magnificent--very romantic and very enjoyable. The second half, though not bad, was so incredibly different in tempo and style that it really did not fit together with the first half. In fact, I almost wish the movie had just ended in the middle!\n\nWhen the story begins, Zooni (Kajol) is going on a trip to Delhi with some friends. Her parents are worried...after all, she is blind. But they also know they need to let her grow and experience the world, so they reluctantly send her. Soon after arriving, the group of young ladies are met by their tour guide--a vivacious man named Rehan (Aamir Khan). He is clearly a ladies man and the women can't help but like him. Most taken by him is Zooni. Now you aren't sure about Rehan. Is he sincere or is she just another conquest for this playboy?\n\nSoon you have your answer. Despite telling her he's no good, Rehan professes his love and the pair plan on getting married. However, when her parent arrive in Delhi for the wedding, Rehan is not there....and they soon receive word that he was killed in a Kashimiri Separatist bombing.\n\nBelieve it or not, there is MUCH more of the movie to follow. Oddly, however, while the first portion was all romance, the second half is more like some sort of James Bond film!!! To me, this didn't work well--especially because this super-agent practically has X-Men powers!!! No one is THIS tough nor this bullet-proof! What exactly am I talking about? Well, I really cannot say...it would spoil the film. Suffice to say, I adored the first half and would score it a 9. The second half, at best 5. And overall, still a 5 just because parts one and two simply don't work as a whole."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "rock831983",
        "review_rating": "7",
        "review_title": "Passable",
        "review_detailed_main": "Well finally i watched....\n\nThe story is good.Muvy could have turned much better but is letdown by poor direction.Special thanks to many over-dramatic scenes.But this is better than all the bunti's,namaste and nikki's lately churned by Yash Raj.I thought to blow away yash raj prior to watching the movie.But Aamir and Kajol saved me from doing that.\n\nPerformances are good.First half belongs to aamir.Second half belongs to kajol due to somewhat confused character of aamir.Mostly he keeps tears in his eyes.His performance is good but nowhere close to Lagaan,DCH or RDB.And kajol had never looked so much beautiful before.\n\nMany shero shayaris some heard and some unheard comes in first half.Sometimes good sometimes irritating.The little kid is really cute.And it was surprise to see howcome Shiny accepted such a useless role.Might be looking for any yash raj next flick.Cinematography is just breathtaking It could have turned into another DILSE but poor direction and dramatic scenes ruined it.Second half drags more than you expect.\n\nAnyways.I can call it so so.Definitely not worth of hype I can tell that if this flick would have not made by Yash Raj and saved by the performances of lead actors it would have fallen flat.\n\n3/5"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "anushkad",
        "review_rating": "8",
        "review_title": "Girl and boy in love when their love takes a twist as boy turns out to be a terrorist but is still weak in her love.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kiravi",
        "review_rating": "7",
        "review_title": "Great Movie - Copied though",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "amehra09",
        "review_rating": "10",
        "review_title": "Kajol Back With a Bang",
        "review_detailed_main": "I was lucky to get a chance to watch this awaited movie today with my family. Kajol was truly amazing! Aamir did pretty well too! The script is not very strong and logical and certain scenes such as the death of Rishi Kapoor were not even necessary. But, the film in totality was a treat. On top of that Kajol at her best ever and that too after a long exile from films. I am not very happy with the ending though. I would have loved to see the film end in a happy ending. I anticipated that because nobody except Kajol knew who Rehan is, Aamir will kill a terrorist and dress him up in the military uniform and put the trigger in his pocket. The anti terrorist unit will take the dead man to be Rehan and Aamir gets his family never to go back to terrorism again. The first half of the script was very good but second half seems to be written in some hurry. The scene that is still haunting me is when Aamir was getting chased by Indian Army and reaches a house to find Kajol open the door for him. This scene I believe is gonna haunt me for a long time. Overall I'll give 10/10 to the movie and a must watch for Kajol's fans."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "prashant-koli",
        "review_rating": "6",
        "review_title": "Watch it as time-pass and for music",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "shooky_mooky",
        "review_rating": "9",
        "review_title": "Beautiful Movie",
        "review_detailed_main": "Indeed this movie is worth watching for the on screen chemistry Aamir & Kajol portrays!I never expected Kajol to look so gorgeous and as for Aamir, he was looking really good....Besides their good looks,their acting was spectacular and should be applauded by everyone.Moreover, the brilliance in acting depicted by the supporting casts complemented the movie fabulously.Although the storyline might be 'biasa' (meaning normal/common) among love stories,it was worth watching for the cinematography and the bitter sweetness it instills in the heart as the love between Kajol & Aamir unfolds.Besides the poignancy it renders in the end, i would say it's a must see for romance lovers!All in all, the cast & crew have done a remarkable job of the movie...! :@>---"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Dingataca",
        "review_rating": "",
        "review_title": "Tere ishq mein, meri jaan, fanaa ho jaye...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "jacklemind",
        "review_rating": "6",
        "review_title": "What were you thinking ?",
        "review_detailed_main": "To start with I would have rated the movie 4, but for Kajol it is now 6. She is great, the perfect comeback role. Hats off to her. Her acting is great, she is in the best shape ever. Looks excellent, made me a fan again. :)\n\nOK back to the movie review. Few things whatever the circumstances are not acceptable as a story line. One such is the theme selected in this movie. not just that, also it has been dragged beyond making people bored. and People Just walked out from the hall in the second half of the movie.\n\nIts just badly tasted movie, dint enjoy a bit.\n\nThe locations of the movie is great and Kajol is amazing.. Apart from that.. movie is a total failure at least according to me... with all the hype created, I was really expecting something really nice. :(\n\nHope You feel better b4 visiting the movie. If you have nothing better to do of your time, can watch the movie once. Otherwise is a CD material"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "shadmad",
        "review_rating": "9",
        "review_title": "best movie from yashraj stable",
        "review_detailed_main": "I have been an Aamir fan since QSQT and I must admit that he never ceases to surprise me ever since. I saw Fanaa after 5 days of release and by that time I had read whole lot of reviews and barring a few all were not saying good things about it.I myself am a filmmaker and a scriptwriter and let me tell you one thing very straight, Fanaa is the best movie from yashraj stable.And i have seen Lamhe,Silsila and almost all of them.Most of the reviews missed the point that this movie is not meant for college kids. It was not a candy floss love story.To me it was one of the most intense and mature love story to be put on the celluloid and the way Aamir and Kajol have handled their characters is awesome.I don't want to talk about that because words fail me.It could only be seen and felt.It is going to be remembered as one of the best roles that Aamir and Kajol did.Among the technicals, cinematography is awesome, direction is first rate, screenplay is good(could have been better), music was refreshing and editing is perfect. Had it not been for a first rate acting and a gripping direction, this film would have ended as one of the biggest duds ever made. My only advice is that please don't go to watch this movie expecting entertainment.Go if you like to be thought-provoked.Go see how well Kashmir issue has been handled(no blame has been put on anyone).Go see what lighting up the screen with acting means. hey, i am going to watch it again tomorrow.its worth a dekko again and again. NO?"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ankur-koul",
        "review_rating": "7",
        "review_title": "its an OK Movies good for a watch once.",
        "review_detailed_main": "well well Aamir is as good as always, getting into the character,i must admit the movie storyline is a drag but it worth watching for Aamir,the age is showing on Aamir's face but still Aamir is maturing as an actor .we can't vote this performance of his better than that in sarfarosh. what about kajol don't know why she was not there for such a long time as it has been.she look good.\n\nwell well who has seen Lakshmi will really know that except for the casting,the shooting was done no where near Lakshmi.\n\nwell in totality a movie good for a watch once...at least Aamir's fans shouldn't miss it."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kgautam",
        "review_rating": "5",
        "review_title": "A so-so movie, nothing special about it",
        "review_detailed_main": "OK. I decided not to see this movie in the theaters with my friends but to wait for the DVD to come out so that I could watch it at home. That too, I borrowed it from my friend. So, technically, I m glad that I didn't spend 10$ to go to the theaters or 20-30$ on buying the DVD.\n\nKajol did good as her role of Zooni ( both in first half as the blind girl and later on ). Aamir Khan as Rehan was also not bad. I didn't understand the genre of this move. The first half which I guess is the Romantic part isn't that great. The film lacks reality. No girl falls in love with someone within 5 days. And that too by the \"shero-shairi\" of Aamir Khan. The second half which portraits Aamir Khan as a terrorist was horrible and is supposed to be somewhat Action/Drama genre. How many lame movies do we want with lame terrorist agencies like Anti-Terrorist Agency or whatever it was hunting down a terrorist in the valleys of Kashmir. Taboo and the other guy playing the role of anti-terrorist agents weren't up to mark. It was like watching a very very pathetic attempt to copy a part of 24 and CSI. The music was the only thing that I found good in the movie. The background scores and the songs were nice. it would be a better deal if u bought the audio CD than the DVD.\n\nTo conclude, if you haven't seen the movie yet, don't get excited about it. Its nothing special. Just the usual bollywood flick with an above average script and story."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kathuria_nidhi",
        "review_rating": "",
        "review_title": "Why Watch Fanaa?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "lilitabacaru",
        "review_rating": "10",
        "review_title": "Sophisticated movie",
        "review_detailed_main": "In this movie, love is a voice , love is a song , love is so soft-spoken. The only problem is that it was two movies in one : the story of the beginning is too different vis a vis of two part. But it is o.k.It's a good movie anyway. Soft, very soft..in my opinion. Complex, elegant and spiritual...many quotes, memorable quotes. And the truth is love means sacrifices..It's all about love. Indeed this movie is worth watching. The music is very pleasant, voices and face expressions are captivating, melody and instrumentation are seductive and beautiful. It is a distinct movies and brilliant story about love, about sacrifices, about power of forgiveness."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "niqbal-18172",
        "review_rating": "7",
        "review_title": "Indian ' Eye of the Needle '",
        "review_detailed_main": "Just watched Fanna. Beautiful film, good acting and direction.\n\nHowever, it is loosely based on Ken Follets novel. Novel was adapted into film called 'Eye of the Needle' thriller.\n\nDonald Sutherland was the lead actor.\n\nHere Fanna has number beautiful songs and dance. Storytelling is very good and keeps the audience interesting specially in the second half of the film. It keeps the suspense till the end. Worth watching with family and friends.\n\nRegarding Eye of the needle film, difficult to compare but music composition by Miklos Rozsa was just too good for the film. Music itself raised the Eye of the needle to a different level."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "jayantkumarsingh",
        "review_rating": "8",
        "review_title": "A different recipe",
        "review_detailed_main": "In the words of Mr. Kunal Kohli, \"The movie has age old ingredients like comedy, emotion, drama, tragedy etc, but recipe is different.\" This latest flick of Kunal Kohli, indeed, has some flaws, but then,who is flawless? Aamir Khan was absolute brilliant. Per my opinion no one else could have performed the role of Rehan Qadri, as brilliant as Aamir. Kajol made a good comeback with this movie but she needs to improve on her figure. Jatin-Lalit, hats off to both of you. The songs are mesmerizing. The first hour of the movie is sprinkled with light comedy. As the movie progresses, it gets more intense. The movie has a tragic end. But message conveyed is good."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "natishkumar",
        "review_rating": "6",
        "review_title": "Awesome movie",
        "review_detailed_main": "Movie Fanaa which means Destroyed in Love is a 2006 Indian romantic drama type film directed by Kunal and produced by Yash Raj Films.The film stars Aamir Khan in an anti-hero role, Kajol as his blind love interest, and Rishi Kapoor, Tabu and Sharat Saxena in supporting roles. Aamir Khan plays the very well role of Delhi tourist guide and Kajol plays a wonderful blind Kashmiri girl. The make-up was just wonderful. Both of Amir and kajol fall in love, but are separated by a terrorist bombing. There was a very wonderful presentation of suspense. The music of movie Fanaa was composed by Jatin-Lalit with lyrics penned by Prasoon Joshi.fanaa which is title song is one of the romantic and amazing song. Five songs are featured in the movie.overall i think music was good. Finally i rated this movie with 6 stars."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "vivekdlko",
        "review_rating": "8",
        "review_title": "forget laila- majnu, heer-ranjha \"Rehan -Zooni are here the new love icons\"",
        "review_detailed_main": "if you are expecting \"Fanna\" to be a traditional yash raj banner film. then you are wrong.Fanna is a love story but with a difference. The yash raj banner had previously attempted different films other than romance like Dhoom and have succeeded. However Fanna is a love story though its got a darker side to it. the acting of the lead actors is superb. kajol never looked more beautiful before. Aamir is in top form.his character has got many shades and he handles them all really well.The first half of the film is traditional candy floss though there is a twist towards the end of it.the film has running length of around 3 hrs in some portions the pace is very slow but overall it is well handled. The director Kunal kohli has done a wonderful job he has given some great sequences. the scene between aamir and kajol towards the end is superb. the child actor has also done a good job. music is good soothing to ears and blends welll with the film. i wont divulge any of the story.\n\nto sum up i can say \"aamir & kajol create magic on screen\" wonder why weren't they paired before. i give 7.5/10 go watch it."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sujinsuvarna",
        "review_rating": "7",
        "review_title": "Descent movie",
        "review_detailed_main": "Overall Fanaa is a good movie it could have been\n\nmore better there was a dip after interval but last 30 minutes again movie comes in its color it and saves the movie from sink. Great work by kajol.she was impressive no other actress could have done better than kajol.amir was superb as always. chemistry between amir and kajol was mind blowing."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "XAEEM",
        "review_rating": "8",
        "review_title": "Romantic but thought provoking film",
        "review_detailed_main": "First of all, the pairing of Kajol and Aamir is something i have always wanted to see but never thought i would. They are a 'different' couple on screen but very believable as they are both seasoned actors that give a sense of reality to the role.\n\nKajol shined as always, and i hadn't seen Aamir's recent films so it was a shock to see how well he pulled it off and how mature an actor he is, as the role he took on may have been frowned upon by other actors of his caliber, he took a chance and it worked out for the better.\n\nThe director has executed this challenging story very well, not dwelling too much in the ideologies represented but just enough to make it a real story.\n\nThe music is amazing, chaand sifarish and chamka chamke are on mp3 player and are there to stay. The supporting actors are worth mentioning, rishi kapoor, who is a legend, plays Zooni's dad with a lot of ease.\n\nThe story in itself is not cliché at all, though the film is at times slow in the first half, it is generally well paced and makes for an easy viewing.\n\nWatching this made me remember why i like hindustani films so much."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "SangamYadagiri",
        "review_rating": "6",
        "review_title": "nice love story",
        "review_detailed_main": "If you see it as a love story, it works well. But on the execution front, the terrorism scenes fail to capture the audience's attraction. Anyways, Amir and Kajol, as usual, have put in a nice performance. Last time, i have seen them together was in Ishq. They really rock the screen. I don't want to talk about the lift of the plot or direction. At least, I can see that, it is better than Krrish.\n\nThe best thing about the film is the screen chemistry b/w the main protagonists of the film. Also, the locales in Kashmir in which the most part of the film had been shot are breath-taking. All in all a nice movie for the weekend."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "siddharth_rajput",
        "review_rating": "3",
        "review_title": "plot holes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "chorima75",
        "review_rating": "7",
        "review_title": "love is blind",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "meydiana-65242",
        "review_rating": "10",
        "review_title": "Fanaa is a dream that stays in the heart foever!",
        "review_detailed_main": "Fanaa is a love story which has been written as a love story ,directed as a love story and acted like a love story. Fanna belongs totally to Aamir and Kajol ,who both have delivered a brilliant performance. Kajol plays Zooni with such a class and natural , she reached ,with Fanaa, a place that no other actress ,today, can reach or even come close.she was breathtaking. Aamir plays Rehan, though it's a unusual role that many of Bollywood actors would turn down(nobody wants to play the anti-hero anymore), he makes it real to the core,you follow him through the whole transition of his character,you love him and you hate him at the same time !Aamir is the master of acting today. The chemistry between Aamir and Kajol was terrific!Kajol matches Aamir ,like the sun matches the sky,they delighted every frame of the screen! an award the best Jodi of 2006 will be simply fair! The other actors were efficient! The music of Fanaa is beautiful and the videos makes it just better:a high note to Dekho Na,Kunal managed to control the little space of the shot with ease and closeups of Aamir and Kajol were fantastic.however,it's Mere Haath Me that steals the show,it was just superb,and it will be fair enough to say that this video will be the reference for any romantic song !(the reference was for a long time,Suraj Hua Madham of k3g). the script of Fanaa has some mistakes for sure,but when you watch Aamir and Kajol together you just forget and forgive! Beautifully shot,Fanaa makes you following the journey of two lovers who maybe wanted and deserved their part of happiness,so they knocked the heaven's door but another destiny was writing for them. go watch Fanaa once for Kajol,twice for Aamir,a third time for Aamir and Kajol,and watch it again and again and again for all those reasons!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ChiBron",
        "review_rating": "7",
        "review_title": "Worth it for Aamir Khan and Kajol.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "shivakumarvishwa",
        "review_rating": "10",
        "review_title": "Beautiful",
        "review_detailed_main": "This is a good movie.This is also a beautiful movie.This is a well made movie.The direction is incredible.The story tells about Zooni a blind Kashmiri girl.One day she goes to Delhi alone.Her family says not to run to a starnger.In Delhi.She meets Reham.And falls in love.Her friends tell her to avoid him.She doesnot listen.Then one day a blast takes place.Reham dies.Zooni gives birth to a child.Years later (possibly 5 years)she meets him again.She also find out that he is a terrorist.The movie is wondderful.The way how they fall in love is beautiful and everlasting.The chemistry is wonderful.The cinematography is beautiful.Aamir gives a great performance.Kajol is wonderful in her role.The others do well.The music is fantastic.The lyrics are great.The picturisations are beautiful.The movie is a watch.A good family movie Rating-8/10"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sayanti-dutta",
        "review_rating": "7",
        "review_title": "A nice story with poor execution.",
        "review_detailed_main": "When I watched Fanaa for the first time, I couldn't connect with the story. But now I watched it again. And after so many years the story is feeling relevant. Of course we have seen too many terror attacks and lots of series and movies on true stories. The movie was having only one issue. The stress was given on the romance so much that they could not build the susiense part of it. The delhi part could be shortened much to show the emotional dilemma of the character Rehan. Also the father son bonding can be elaborated and explored in details. The character of Tabu was such a powerful one but totally wasted. Needed much more details on terror plot to make it look more plausible. They should have gone for a simpler terror plot to make it more convincing instead of the nuclear one. Film should have been more logical. Like the character of Rishi Kapoor should have asked mire questions before agreeing to the nuptials of his daughter to a stranger. Editing could have been much better and crisper. Also the movie didn't need so many songs."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "pratimdgupta",
        "review_rating": "8",
        "review_title": "A tale of two stars",
        "review_detailed_main": "Kunal Kohli's a lucky man. Yes, clever too. On third thoughts, maybe a tad adventurous. Certainly a big Bollywood buff. And, of course, a man with a big heart. He's managed to pluck out the two brightest stars from the Mumbai sky and light up theaters, warming the hearts of hum and tum.\n\nHis constellation may not have been that well constructed. The Fanaa script has dollops of the two elements they ask you to avoid at screen writing schools \u0097 convenience and coincidence. The loopholes in the storyline are large enough for King Kong to slip through.\n\nThen, there's that eternal yearning to stir up a Dilwale Dulhaniya Le Jayenge. The mom-and-daughter machination of a dream man \u0097 the unseen, unheard type. Then, friends who dutifully oppose and then support the pending affair to remember. And even the great train finale by which producer Adi Chopra celebrates the DDLJ hangover and has one of the friends squeal: \"Dilwale Dulhaniya Le Ja Raha Hai\u0085\"\n\nBut hang on! We aren't even halfway through this three-hour epic tale of emotions. Let's clear the bit about SMS spoilers here. If you haven't seen the film yet or heard from a friend who has, well, as Al Jolson said in the first ever talkie Jazz Singer, \"you ain't seen nothing yet\". The mobile hoaxes are just that \u0097 hoaxes. And Kajol is blind \u0097 at least for a good part of the film.\n\nThe twist in the tale is nice and its repercussions even better. The motivation behind the terrorism and the science behind ophthalmology are not clearly laid out. But then isn't it evident that Kunal hasn't set out to make a Dil Se or a Black where the ground realities of terrorist takes and physical challenges were integral to the plot? Fanaa is a love story where two people's lives come together, drift apart and cross again, by chance, thus reviving the pangs, the pains, the pleasures and even the politics of romance.\n\nAnd what two people they are! For the first time, Aamir Khan is less a character and more a star. But that is not necessarily bad news. Because as he drifts through the many shades of his role, you can see flashes of Rang De's DJ, touches of Dil Chahta Hai's Akash and glimpses of Raja Hindustani's Raja. Here is a star who's reaping the rewards of having been honest to every character he's played on celluloid. So, even if Rehaan's character graph resembles the heartbeat of a chronic cardiac patient, Aamir brings to it a conviction only he can.\n\nAnd what does one say about Kajol? What does one say about an actress who has turned time back to orchestrate the most remarkable comeback on the Bollywood silver screen? What does one say when breathtaking beauty competes with heartfelt histrionics within the same framework? For those who have been writing off the Aamir-Kajol chemistry as thanda, they either need retinal replacements or are so hung up on the SRK-Kajol combo that they do not want Bollywood history to be rewritten. And that's exactly what Fanaa does. From the time Aamir's Rehaan Guide chances upon Kajol's meandering Zooni at the Delhi bus stand, it's protons and electrons at play. He asks: \"Andhi hai kya?\" and she retorts: \"Haan, dikhta nahin kya?\" and countless dils go hmmm...\n\nThe sparks have a lot to do with the great cinematographic ploy of playing on Zooni's blindness. Since she can't see, Aamir lets his piercing gaze rest unabashedly on Kajol's and she in turn keeps looking to the right or left of the camera revealing three-quarter of her face, which is easily the angle she looks best in.\n\nAnd that's not the only magic wand Ravi K. Chandran has waved. An absolute contrast to the stark lighting of Black, the film is a riot of colors in the first half which then leads to lots of browns, greens and greys in the more grim second half. The three love songs \u0097 Chand sifarish in and around the forts of Delhi, Dekho na in the rains and Mere hath mein in a Kashmir setting \u0097 are so beautifully canned that it would have done Christopher Doyle (In the Mood for Love and 2046) proud.\n\nLook out for the scene towards the end where Aamir and Kajol are standing on a balcony and the frame is lit up just by the expanse of snow outside and the full moon in the dark sky. Also, the ski-and-shoot action sequence is almost Bond-like.\n\nBut then again, nothing shines more bright and nothing looks more gorgeous than the lead pair. Fanaa is not about Rehaan and Zooni. The film has nothing to do with a blind girl and a Kashmiri terrorist. Fanaa is about Aamir and Kajol. It is about every movie that Aamir and Kajol acted in. It is about every character that they ever played. They all come together for this one grand waltz in the psyche of a Bollywood fan and makes Fanaa every bit the blockbuster it is."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "virindra",
        "review_rating": "6",
        "review_title": "Standard Bollywood.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "daniel-schut",
        "review_rating": "10",
        "review_title": "it nearly killed ME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "indigshai-1",
        "review_rating": "4",
        "review_title": "Great Beginning.. Mediocre Middle and Confused Ending",
        "review_detailed_main": "Great Beginning.. Mediocre Middle and Confused Ending The movie opens with a Bang! You are just hooked to Kajol and Aamir. They definitely give their best in first 30 mins. The supporting actors are also good. On the whole the movie has you asking for more for the first 30 mins. It kind of gets too much with the poetry \u0096 you have got to be well versed with the local dialect to understand what they are speaking. I mean most was some stuff we know what it means, but not really as you have got to understand the underpinning of what they are speaking. On the whole the plot is little far fetched \u0096 a kind of well to do girl from Kashmir falls for a guide in Delhi. But hey who is complaining with Aamir Khan \u0096 he's already done to Karishma Kapoor in Raja Hindustani! However, the plot thickens (or I should say loosens) after 45 mins. It is obvious where the movie is going. The director or the story fails at letting us know why the characters are as they are \u0096 they assume we have enough Bollywood experience to assume and understand the side plots. The movie lacks professional cinematography and hence we are just feeling that most of movie is shot in studio. It does not give a feeling of grandiose. Well lets say it is a great made for TV movie."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "bob_bear",
        "review_rating": "8",
        "review_title": "Love above all else...",
        "review_detailed_main": "There are three features that make this film special: The cinematography, the songs but, above all, the central love relationship as portrayed by the two wonderful lead actors.\n\nThe chemistry between Rehan and Zooni is palpable. Their relationship fairly crackles with energy. And I can only admire the fact that with the restraints of Bollywood - without so much as a kiss on the lips allowed - director and actors are able to communicate an all-consuming and deeply passionate love relationship in such a profound way.\n\nThere are things about the film that bothers me - blindness and terrorism used as plot devices in what is essentially an entertainment context but maybe that's because I have a Western sensibility and the expectations that go with it.\n\nAbove all, it is the core relationship that makes this film watchable. Epic and intimate. It was love that moved me...the rest is merely decoration."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "aisha_hd",
        "review_rating": "9",
        "review_title": "this movie is great.....",
        "review_detailed_main": "This movie is amazing.... after a break Kajol has really done a great Job.... although the ending is painful... but i like the movie however it is.... the music is very pleasant.... couldn't be better.... Aamir Khan was great... and they looked good.... well the only fault was that the first half was all romantic and funny and then all of a sudden a blast and the story turns into something else for a while.... but i guess it deserves a 9.... i would watch this movie again if given the chance....\n\ni don't really watch such movies... for example when Veer-Zara came out i didn't bother watching it.... but Fanaa is exquisite..."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "musicfreak081976",
        "review_rating": "10",
        "review_title": "Bollywood with a new Face",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "suhasnatyan",
        "review_rating": "9",
        "review_title": "fine movie",
        "review_detailed_main": "Very good movie, with mixture of patriotism and romance. The acting of Kajol as a Kashmeri is really appreciable. Aamir is doing very good films, and by chance Rang De Basanti was also full of touch of patriotism. The songs especially \"Chand Sifarish\" is very sweet and the whistle in the song will surely become popular. Though other songs are good too, but it is matter of personal choice too. The expressions on Kajol face when she meets Rihan after having here eyes in her house not knowing him are also very good, the illusion she has is nicely filmed. The last fifteen minutes of movie are really heart touching. Recommended for everyone!!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Peter_Young",
        "review_rating": "5",
        "review_title": "A so-so spectacle with little to offer other than its leading lady",
        "review_detailed_main": "Fanaa was a commercial success upon its release a little less than a decade ago. It was Kajol's well-awaited comeback to movies after a five-year hiatus, and that's how it was mainly promoted. It was the first movie in which Kajol and Aamir Khan where pitted against each other, and sadly nothing between the two of them really works. There's little chemistry, little understanding, and the relationship is left to the big songs. In the end we are left with a story so feeble and uninteresting that one would wonder why the hack an actress of her caliber chose it. Fanaa is one of those pretentious potboilers which want to be seen as poetic but then they have so little to offer on their own. The story is melodramatic and unconvincing, and all the tough job is given to Kajol, of whom naturally so much was expected. And thankfully, she doesn't disappoint. Even within the limits of a weak script (and a badly written role), Kajol rises above it to deliver a heartfelt, fully complete performance. There's something about this lady - she comes across extremely real and does so little to convey big emotions. She is always relatable, and never a star. This movie really shows why this natural actress is one of the most popular in the country and appeals so much to the masses. And then we have Mr. Khan, who suddenly looks overly jaded and old, and the terrorist part of his character was so amusingly amateurish and poorly done that no one would take this nonsense character seriously anyway. Fanaa has nice music and no story, it also wastes the talent of Tabu, Rishi Kapoor and Kirron Kher. In the end, Kunal Kohli, who was responsible for the wonderful Hum Tum, disappoints big time with this silly, silly film."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "jagdevs-1",
        "review_rating": "8",
        "review_title": "watch out everyone Kajol is back!",
        "review_detailed_main": "Hailed as Kajol's comeback movie and first movie with the immensely talented Ammir Khan. This movie just could be the breath of fresh of air that the bollywood film industry was crying out from. A little originality with some decent acting for a change. makes a change from the poorly acted Hollywood remakes. The first half movie starts out as a beautiful love story with Ammir khan and the beautiful and simply stunning Kajol and soon turns into and ingrossing tale about Kashmiri terrorism and covers all angles of the conflict. the mood of the film does change a little too dramatically between the first and the second half but soon comes back into line ties up into an interesting film with gripping climax. a well made movie with lots of deep poetic references. A brilliant move for all to see."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "axel_rose",
        "review_rating": "10",
        "review_title": "outstanding",
        "review_detailed_main": "Each and every bit of the film....mind-entrenching.\n\nAmir Khan and Kajol clearly deliver not some but a whole lot of that extra flavour that makes the movie special.\n\nWhat is more is that their partnership is created so well , that is seems that the film would have been impossible without their mark on it. Their facial features are exclusively appropriate for the film's emotion and dramatic character. Thanks to Amir and Kajol, the audience is left clearly mind-blowing in their seats. Gone with the winds- that is how natural, emotional and extensive their relationship on the scene is.\n\nAt the end of the movie, one may be left to question his viewpoint throughout the course of the film, which again demonstrates in a unique fashion the sophisticated profile of both actors and film.\n\nIt has clearly been a pleasure -from top till bottom- to see ''Fanaa''. For the lovers of poetry and aesthetics, that is a one-of-a-kind gift.Don't miss it!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sultansaif-30350",
        "review_rating": "8",
        "review_title": "It's a beautiful combat between Love and Duty. Good and Bad",
        "review_detailed_main": "Fanaa It's a beautiful story filled with beautiful Shayaris and lovely eternal songs.\n\nAbout acting don't ask. Mr. Aamir does his perfection in his craft as usual but Kajol will stun you. She oustshines aamir many times in this movie. Her beautiful eyes her expression killed me.\n\nFilm is about Love and Duty. How love can melt the stone heart of a person. The animas, the birds, The humans. Anything which has an heart is connected to each other via an invisible yet strongest and beautiful force called love. Without Love I think there is no sense of purpose and meaning to the life. The True love stays in the heart forever never changes nor compromises with anything.\n\nThe film also deals with a very good contrast About what is good and bad. And what to choose between more bad and less bad.\n\nSo, overall it is a must watch movie for aamir and Kajol fans and shayari lovers In the end I want to write a shayari which touched my heart from this movie Humse door jaaoge kaise Dil se hame bhoolaoge kaise Hum wo khusboo hai jo saanso me baste hai Khudki saanso ko rok paaoge kaise."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "hatexi-21362",
        "review_rating": "9",
        "review_title": "Zooni later sees the news report, and finds the trigger.",
        "review_detailed_main": "Zooni finds her father's body, and Rehan lies about his death. However, Zooni later sees the news report, and finds the trigger. She takes her son and flees to the officer's house, where she radios for help. Tyagi tells her to stop Rehan. Rehan arrives the next day, and takes the trigger from Zooni, saying the IKF will kill her and their son if he doesn't. As Rehan is about to give the trigger to the leader of IKF, Rehaan's grandfather, Zooni shoots him in the leg. Rehan draws his gun on her, but can't bring himself to shoot. Zooni shoots him again, this time fatally, to stop him. In the nick of time, Tyagi arrives and stops the IKF from shooting Zooni. Rehan dies in Zooni's arms."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "filmnut1",
        "review_rating": "5",
        "review_title": "Pushes credibility with its reliance on coincidences",
        "review_detailed_main": "I was interested in seeing 2006's Bollywood romance FANAA (meaning Destroyed in Love) for two reasons. Firstly, the plot involved terrorism, which is always an interesting theme to juxtapose a love story and meant there'd be some action, and secondly I discovered a large part of the film was shot at the Tatra Mountains in Poland, where myself and my girlfriend plan to take a holiday later in the year. Poland, doubling for Kashmir, looks spectacularly picturesque and the whole film is extremely well composed. Shot using sync-sound and featuring vibrant cinematography, it's clearly a big budget movie. The story itself is engaging, the terrorism element of the plotting only kicking in after over an hour of playful romance, but features some hard to swallow moments. Coincidences are all well and good, but this movie pushes credibility much too far. Which is a shame, as is the limited action, directed by Hollywood veteran G.A. Aguilar. In the near 3 hour running time the only notable action sequence is one that feels straight out of James Bond. Aamir Khan and Kajol are a great screen couple and there's a lot to recommend this movie, but it's a real shame some poorly handled plot twists ruin it."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "greenvolume_656",
        "review_rating": "10",
        "review_title": "that was the best movie that i've ever seen in Bollywood!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "safyana",
        "review_rating": "10",
        "review_title": "A Human Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Best film of the year so far.....",
        "review_detailed_main": "Fanaa is the Best film I've seen in a long long time. Finally a movie that entertains both storyline, acting and Music. My favourite songs are Chand Sifarish and Mere Haath Mein. Its great to see to Bollywood Super stars together since Ishq. Aamir Khan is among the Best actors of Bollywood. Kajol is one of the Best actresses in Bollywood. The Director Kunal has previously given us Hits like Mujhse Dosti Karoge and Hum Tum. This time he has given us his Blockbuster Hit and proves he is a great director. Aamir Khan delivers a power house performance as a terrorist who's put into a dilemma for the love of his wife and Child against his Work. Kajol is Amazing as the Blind Kashmiri Girl. To play a Blind girl, it can be quite challenging, Kajol proves that she is one of the Best. Many other ACtresses have failed to prove this (Amisha Patel = Humko tumse pya hai etc) apart from Rani (Black) who gave us a Brilliant performance. Fanaa is one of the Best films of all time. Instant Classic not to be missed."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kainaat076",
        "review_rating": "10",
        "review_title": "best movie ever",
        "review_detailed_main": "I saw Fanaa the first day that it had came out, and I loved this movie. I had stopped watching Indian movies because they never had any good story lines anymore, and they were always talking about sex or showing it. Those are not the Indian movies I grew up watching. This was the first Indian movie I saw in like I don't know how many years. But I was pretty impressed.\n\nI am not a big fan of Aamir khan but after i saw him in Fanaa I love him. He did such good acting, I was blown away. And people keep talking about how his character should have been skinner, the way that I see it, I think it was part of his role for the first half, and the second half, he looked better, and may i say damn sexy in the song \"mera hath main\" (probably spelled that wrong sorry) Now Kajol, it seems that like she never left for five years, her acting was great, viewers can really see how her character progressed over time, I don't think anyone else could have played her role better, and someone said that she need to have a better figure well i think that is stupid, she look so beautiful, and in good shape , I don't think there is anything Kajol should change about her self.\n\nThe chemistry between Kajol and Aamir is just great, i hate to say it but Kajol has better chemistry with Aamir and Srk then anyone else, every time i see her with her husband i just don't see it. I cant believe they never were in a movie together, after this i hope directors start to put them as an item, because they are just great with each other.\n\nSo all in all the movie was great, the acting was great and i loved it, It did have some little flaws but what great movies don't, not everything is perfect. So i hope people go out to watch this movie and not be biased because you would have wanted someone else in the movie instead. I am glad I went and saw it because I finally am starting to like Indian movies again."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "amey-4",
        "review_rating": "1",
        "review_title": "Worst movie of Aamir khan after mela",
        "review_detailed_main": "I went to this movie with no expectation at all as previews/trailers of movie were not that interesting. When movie starts .. its good for first half but not upto expectation. Shero Shayari and jokes in first half are OK. But second half is too boring,dragging and predictable. Like all Hindi movies, wounded Rehan lands at Zonni's Door and movie becomes too boring. In the End its all dragging of track. Kunal kohli was critic of movie but when you make a movie u forget how u use too criticize others movie. He made Hum Tum which was copy paste of \"when harry mate Sally\" with some bollywood masala. Overall movie is not a Aamir Khan Movie. Kajol is good in the movie but else is ....... My suggestion would be Even somebody gives you money to go for the movie pls take money and leave Cinema hall after first half only as second half is mental,emotional,financial torture. ;).\n\nCheers! Amey"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ms-smiiles",
        "review_rating": "9",
        "review_title": "Shakespeare himself couldn't have written it better.",
        "review_detailed_main": "It's interesting to see what kind of movies these modern day directors dish out. After a string of movies with similar plots and conclusions, Fanaa is a breath of fresh air.\n\nKajol makes a remarkable come back as Zooni Ali Beg, a beautiful blind Kashmiri girl. For those who may have forgotten the many talents of Kajol, her performance in this movie definitely reminds us all why she is still one of the top actresses in Bollywood. He transformation from a careless young singer/dancer to a troubled and guilt-ridden mother is simply flawless, and intensely believable. For those who complain that she looks out of shape in this movie, don't get me started. She looks the same as she did before, and anyone who can debate me against this point needs to prepare to be proved wrong. (: k? thanks.\n\nMoving on, Aamir Khan, as Rehan Qadri, has yet again outdone himself. He plays his role to his fullest potential, making it hard to tell the difference between himself and his character. It doesn't come as a surprise that no other actor could play this role as well as Mr.Khan. He looks as if he had lost his own identity in this movie, and truly became Rehan. This movie is yet again one that really gets you thinking. Perhaps this isn't the greatest plus in a movie for some of you, but there are messages in his movies, just like there are in Fanaa, that need to be heard, like it or not.\n\nAs for the movie itself, I can confidently say that Shakespeare himself couldn't have written it better. Why? Maybe it was the fact that the movie begins as a typical love at first sight plot, yet soon intertwines with a plot almost completely different, and definitely unexpected. Surprisingly, it fits in with the story perfectly, and is not choppy or hard to follow.\n\nOne of the most important reasons for Fanaa being such a success, in my eyes at least, is it's music. Mere Haath Mein and Chand Sifarish were no doubt my favorites, with a somewhat typical, yet completely different tune as other Bollywood songs, all at the same time. The songs didn't have the typical Bollywood \"pop out of nowhere\" theme, where dancers and background music pop out of nowhere. They flow into the story, and are foreshadowed throughout the movie.\n\nThe movie's cinematography is also utterly amazing, capturing Delhi and Kashmir at their best. Though I must admit that at parts Fanaa can drag on, I feel it safe to say that every movie has its flaws. In Fanaa, however, the pros outweigh the cons greatly.\n\nAll in all, I have to say that Fanaa is by far one of the best love stories of the 21st century. A bit far reaching? No, because every aspect of the movie appeared to have been thought out very well. I can honestly say that the only other movies able to evoke such emotion from their viewers would be Kal Ho Naa Ho and Rang De Basanti. Fanaa is a must-see. (:"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "manon-mcguigan",
        "review_rating": "9",
        "review_title": "Something to displease everyone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Tania786",
        "review_rating": "10",
        "review_title": "heart melting and has a great storyline!",
        "review_detailed_main": "After watching this movie, i was in tears. The emotion that Aamir and Kajol showed was so intense, i could not help myself. The first part of the film, i thought was fantastic. I have to admit, the outbreaks of the flirtatious poetry started to annoy me after a few times, but it went with the film very well. The second part of the film, was, again, fabulous. The child artist acted his part very well. The scene when Zooni eventually recognised Rehan, i thought was the best, and it was acted out very professionally. The ending was a bit unreal, but I was still in tears. Aamir acted really well and Kajol was very much more matured and graceful. The songs could have had a bit more work done, but overall, the film was heart melting and has a great storyline."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "tereranisharma",
        "review_rating": "8",
        "review_title": "Nice Comeback for Kajol and Aamir.",
        "review_detailed_main": "I really wanted to see this movie because when I saw the previews for it in a movie I was watching at a theater. I haven't seen a movie from Kajol or Aamir for like five years now because they took a \"break\" from Bollywood. The movie had a lot of twists n turns but some parts were easily predictable.\n\nBut I have to say I enjoyed the songs. Especially Chand Sifarish and Mere Haath Mein. The lyrics and beats were wonderful. I felt as though I wanted to start singing right there along with the song in the theater.\n\nKajol and Aamir did great acting. Kajol did a great job when it came to sadness, and Aamir when it came to being angry. Oh and I have to say young Rehan (sorry but I don't know the actor's name) put a kick into the movie. I loved how he talked in third person to everyone.\n\nSo this is a sad love story with some action. I give it eight stars because of the music, acting, and part of the storyline. Fanaa is a truly unique movie and I have to also say that I love the quote Kajol's mom told her to say to any boy she loves. (sorry but IMDb won't let me post it in the Hindi form) It's one of my favorite quotes now.\n\nEvery few years or less Bollywood makes a love story which just blows everyone away. Before Veer Zaara... now Fanaa."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "amulmohan",
        "review_rating": "1",
        "review_title": "destroyed my money!!!",
        "review_detailed_main": "I was very impressed by the music of the film which leads me to see this film excited as I was the film falls straight down hill from the word go...\n\nboasting a fanatic cast (AAMIR/KAJOL)... great music (JATIN/LALIT) and international standard photography(RAVI CHANDRAN) the best production house in India (YASHRAJ FILMS) I just had to watch this film but what director KUNAL KOHIL misses is script which is very run of the mill reminded me of DIL SE which was a brilliant film in all aspects... all though the first half is very entertaining the second half fails to live up to any exceptions... its slow and tacky, predictable to a certain extend... and all in all makes the whole movie experience BORING... its good to see new directors experimenting with different stories but at the same time movies like FANAA which have an excellent star cast and very mediocre directing, hence its dis-hearting for a bollywood fan..."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sdreelin",
        "review_rating": "8",
        "review_title": "A great story line that entertains all the way through",
        "review_detailed_main": "Kajol and Aamir have to be the absolute best choices for the main characters of this movie as their acting is spot on and they make a great pair together in the story line. Not your typical Hindi love story where the guy and girl are annoyed with each other at first. They hit is off in the beginning but the story takes a radical twist in the middle and is non-stop on the edge mystery and drama to the end from there. Supporting rolls by Rishi Kapoor and Kirron Kher are spot on (who doesn't love their acting?). Tabu's roll is a bit mediocre and doesn't add much to the story, but it is a smaller role anyways so there is no time to develop her character. A quick pop in by Laura Dutta doesn't add much either and is a bit weird feeling like a quick add to the script. The ending is a surprise and ties up the story nice and neat. The music is pretty good, though the only dance scene that stands out is by Kajol as she performs on stage for an audience (brilliant song and brilliant lyrics). Though not exactly a dude movie, there is a good story to keep any guy enjoying this flick. A good couples movie and a must see classic for any Hindi film fan."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "baadshah_khan",
        "review_rating": "9",
        "review_title": "Story Was Amazing",
        "review_detailed_main": "The story was amazing but the terrorist part was very unsuitable and the ending was crap. The songs in this movie were too too damn good and deeply meant. Zooni (kajol) did amazing acting after coming back from a long break. Well what can i say about Aamir Khan..he is just too good at acting. The couple made for the first time in movies looked amazing from my point of view. Jatin-Lalit are too good music directors and were the right ones for this movie. As nobody will forget these songs for a long while. Last but not least the Shayaris in this movie i can never forget..Until Intermission movie was too damn good and after it started getting kinda boring but all in all the movie was brilliant...I don't know about people in India but this movie was a big hit in the north American countries."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "neepun",
        "review_rating": "10",
        "review_title": "different",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Pgoel",
        "review_rating": "10",
        "review_title": "An excellent movie: A love everyone and no one wants",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "princeofsnakes",
        "review_rating": "1",
        "review_title": "Worst movie I have ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "alomia",
        "review_rating": "10",
        "review_title": "fabtastic",
        "review_detailed_main": "the movie fanaa was fabulous, fantastic, my word for it is fabtastic. i think kajol is just a superb, excellent & great actress. she is deserves award for her heartrending performance. amir is a very good actor, however he didn't give his best and i know he can do it. kank was nice. preity's performance was superb, from a her normal movies as a fun, loving & passionate person to a very cold one in this movie, excellent. this lady can act but, with actors like srk, preity, rani, etc. you can't go wrong.this movie kank made you think, however fanaa is the better movie of the two. my point of view for the 2006 awards must be like this - best actress - kajol best actor - srk or amir best movie - fanaa. vote for kank is 8 out of 10. fanaa well you know 10/10"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "presianpari08",
        "review_rating": "9",
        "review_title": "one of the best movies i have ever seen",
        "review_detailed_main": "this is basically a story of a blind girl who falls in love with a flirtatious guy who happens to be terrorists.even though the storyline may sound cheesy the way it flows throughout the movie is amazing. the dialouge is absolutely brilliant...very poetic, yet understandable. the performances magnificent. kajol is a beautiful as the day she was in k3g, and performance is probably her best yet. aamir is also very very handsome with his boyish good looks and mischievous smile and he plays the role of rehan probably better than any real-life terrorist. the music is wonderful, somewhat long but definitely not distracting. and the end is a complete surprise. to tell u the truth the whole movie was unpredictable. and the aamir-kajol pair is also oozing with \"chemistry\" or as i like to think of it...professional compatibility.all and all this movie is brilliant and definitely not a bore."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sush_kaur",
        "review_rating": "8",
        "review_title": "what went wrong",
        "review_detailed_main": "the beginning was AWESOME!\n\nit contained the correct balance of romance and comedy just before the intermission there was a dramatic change in genre (not necessarily for the better).\n\ni felt that if the film had carried on in the same style as before and still included the characters that were there in the beginning, it would had been an even better movie.\n\nthis was a real shame as \"Fanaa\"could have become a real hit like \"Kal Ho Naa Ho\" or \"Kabhi Khushi Kabhi Ghum\".\n\nafter the intermission, because the characters from the beginning were lost, there was not too much comedy or romance. it became all action and too serious\n\nbut the little boy with his not very good English adds a bit of light-heartedness to the second half\n\nhowever, the movie was very good.\n\nu should see it - i highly recommend it. =]"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ramya_54",
        "review_rating": "10",
        "review_title": "One of the best movies of 2006",
        "review_detailed_main": "Fanaa is about a blind Kashmiri girl, Zooni (Kajol), who meets Rehan (Aamir Khan) while on a trip. They fall in love, and plan to get married to each other. But while Zooni is having her eye operation, there is a bombing that takes place, and Zooni is led to believe that Rehan has died. But the truth is the rest of the movie.\n\nActing: Aamir Khan was fabulous as Rehan, having different shades at different times. I couldn't have imagined ANYONE better for this role than him. He is such a brilliant actor, and after Rang De Basanti and Fanaa, I really have much more respect for him. I hope he's working on another movie now.\n\nKajol was the perfect Zooni, and she played a blind girl so well. She never overdid the blind act, but she was very believable. I don't think any of the newer actresses of today could have held up this kind of role, and Kajol was perfect. She looks so pretty, and I too hope that she is coming out with more movies.\n\nTabu, Rishi Kapoor, and Kirron Kher hold up their roles well, and add to the overall film.\n\nAamir Khan and Kajol have created a new beautiful pair, and I can't believe that they're only acting together for the first time so far into their careers. They look so amazing on screen together, and they should act together again.\n\nFanaa is an amazing movie, and I have a feeling that it will be a timeless classic. Please watch this movie if you haven't already seen it!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "padmanabhan19",
        "review_rating": "1",
        "review_title": "Nothing works in this movie",
        "review_detailed_main": "Aamir is brilliant. Kajol looks stunning. The storyline wants you to suspend your disbelief an hour too long. Pretty much sums up the movie. This 3 hour saga left me confounded at the kind of stories and sentiments dished out by bollywood. Sadly, the songs cant save the movie either. The only good number is within the first hour and not when I needed it the most. A leitmotif runs throughout the movie - good, but overused and got to my nerves. And watch out for the scene with a desi version of the MI3 score.\n\nThe movie starts out on a fun note and has the quintessential love at first \"sight\" scenes. And there is some skepticism about the hero's devotion and commitment - not in the girl's mind but in her friends'. Some of the scenes are particularly entertaining and most of them have a repartees in shayris. All that remains now is for the girl and boy to get married and remain happily ever after. But, no. Life, as they say, is full of surprises."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "Sherazade",
        "review_rating": "10",
        "review_title": "The most appropriately hauntingly beautiful film to welcome Kajol back into the game!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "abd_mumin",
        "review_rating": "10",
        "review_title": "WICKED...Aamir kills Indian Army...Sum Indians find offencive",
        "review_detailed_main": "Fanaa is no doubt a brilliant film. If you have seen the film, you know the storyline. In the middle of the film, Aamir Kills some Indian Army. The way he kills them looks funny and entertaining. I Think thats why many Indians are finding this film offencive. It is becoming a Blockbuster Hit around the world, apart from some sections in India. Anyway, I don't see whats so bad about these scenes. There is always someone dying in the army. Aamir has done a fabulous job. Compare him, killing the Indian army in style and comedy. Compare Sunny Deol as Superman, taking on 100 guys on his own, saving his country. Should i say, thinks he is saving his country from looking pathetic. Normally Bollywood films have stupid action scenes, FInally a Good One. MUST SEE"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sharmikrish",
        "review_rating": "9",
        "review_title": "Romantic movies",
        "review_detailed_main": "The movie was a perfect romance between two characters. The director done his job wel to ease the screen play of the characters who performed well .\n\nThe heroine is a blind young girl who comes to Delhi and met a man who is a flirt . The hero is Aamir khan and he was just being with her as a friend and Kajol the round girl loves him truly .\n\nThe blind girl receives the love which she doesnot her any where in her life so she decided to live her life with the boy Aamir khan whom she met in Delhi who is a tourist guide .\n\nThe movie is a perfect comic one and characters played their role well and added more ease to the movie ."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "adheesh-sharma",
        "review_rating": "1",
        "review_title": "Only for Amir Fanaa-tics",
        "review_detailed_main": "For the first 2 minutes I thought that its a spoof on Karan Johar movies. Then I realized what I was in for! 3 long hours of pure crap. I went with very low expectations. But I was secretly praying that Fanaa would not be a simple love story. It would be something with a twist like 1947 - Earth.\n\nKajol looked great though. But rest everything is so totally crappy. There are thousands of close-ups, obscene sentimental background score at every 2nd dialog.\n\nAmir was a big disappointment. He has proved the innocence of Shahrukh Khan - \"If the director is adamant for sentimental crap, you can not do anything about it\". I liked first 3-4 instances of Shayari. But after 10 minutes, it started giving me a headache. It was like the sound of a big metal trunk being dragged on the floor. Yes, his expressions are becoming repetitive and his tummy is getting bigger. I guess he is stressed because he is pregnant.\n\nFanaa was worse than Kal Ho Na Ho and slightly better than Main Prem Ki Diwani Hoon.\n\nSo bad, they chose this very cute kid to play young Rehan. Otherwise I would have hunted him down and given him the beating of his life. The child's character was so boring and irritating. Something like Amisha Patel; cute, but irritatingly stupid/retarded.\n\nThe biggest itch in the balls : I can't find people who share my view. Especially girls are going crazy about this movie, as expected. Indian audience doesn't deserve good movies."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "prasannna",
        "review_rating": "10",
        "review_title": "Done",
        "review_detailed_main": "\"Fanaa\" is not a word in common parlance. In Persian, Urdu, and chaste Hindi, it means \"annihilated\", \"destroyed\", or in the context of the latest offering from Yash-Raj Films, it signifies \"devastated, ravaged, or consumed by love\". Any film bearing such an intriguing, if somewhat grandiose, title would have the onus of living up to enormous expectations. In addition, this is Kajol's first film after a self-imposed hiatus, while Aamir Khan, paired with her here for the first time, is also seen infrequently on screen due to his reputed fastidiousness in choosing movie projects.\n\nI say good for them, for this is a superb collaboration between the actors. Aided by strong writing, a different story, able direction, and slick production values, they make it an entirely worthwhile proposition."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "bcnkor",
        "review_rating": "10",
        "review_title": "One of the best Woolibud movies with Aamir Khan and Kajol",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "missnikiisha",
        "review_rating": "10",
        "review_title": "10/10 for absolute perfection!",
        "review_detailed_main": "In those days this movie was superhit - be it because of Star power, music , etc. But in today's times, this movie IS truly a masterpiece.\n\nIt's a challenge to make a convincing romantic movie, coz somewhere you already know what's gonna happen in the end - they'll either make up or break up. Then, there's really limited scope to go beyond this probability, so I am glad Fanaa succeeded in finding a way to tell a story & end it on a very emotionally high note.\n\nStorytelling & direction is truly an art, you get so much emotionally involved in every scene that by the time the film ends, you do realise some things could have been alot different in real life, but still you choose to go with the flow and won't regret it because you want to know what happens next, it doesn't bore you even for 2 seconds.\n\nThis movie is no doubt, one of the best films in careers of main cast in the film, and every one involved. Music too is just wholesome. This is one of the movies through which you'll gladly introduce your new 'Firang' friend to Bollywood."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "krystaltech",
        "review_rating": "10",
        "review_title": "Average first half - great second half !",
        "review_detailed_main": "Kajol looked better than she ever did - worth watching only for her. The storyline is original for Bollywood and constantly plays with the sentiments of the audience towards the character of Aamir Khan. Aamir Khan looked chubby and old in the first half but trimmed up for the second - same can't be said for Rishi Kapoor! Next to the brilliant out-of-retirement performance by Kajol, Tabu's special appearance lacked conviction and seemed contrived. Second half was definitely better directed, scripted and acted.Unlike in most Hindi movies, where the kids are repulsive (perhaps due to the lack of kids who are cute and can act!) Rehan the kid acts and looks the part. Overall, a wholesome entertainment with a couple of really nice songs."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "akbarnali",
        "review_rating": "5",
        "review_title": "Fanaa: To Be Destroyed By Commercial Interests",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kabrasarthak",
        "review_rating": "10",
        "review_title": "#Makaut #Mar_Activity",
        "review_detailed_main": "FANAA is one of the finest products to come out of Yash Raj. In fact, it wouldn't be erroneous to state that it's one of the most accomplished products to hit the Indian screens in a long, long time. The film works on every level: script, music, visuals, technique and yes, the performances."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "suryanmukul",
        "review_rating": "8",
        "review_title": "musical love drama at its best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "basavarajup-30307",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "Fanaa is a dream that stays in the heart foever!\n\nFanaa is a love story which has been written as a love story ,directed as a love story and acted like a love story. Fanna belongs totally to Aamir and Kajol ,who both have delivered a brilliant performance. Kajol plays Zooni with such a class and natural , she reached ,with Fanaa, a place that no other actress ,today, can reach or even come close.she was breathtaking. Aamir plays Rehan, though it's a unusual role that many of Bollywood actors would turn down(nobody wants to play the anti-hero anymore), he makes it real to the core,you follow him through the whole transition of his character,you love him and you hate him at the same time !Aamir is the master of acting today. The chemistry between Aamir and Kajol was terrific! Kajol matches Aamir ,like the sun matches the sky,they delighted every frame of the screen! An award the best Jodi of 2006 will be simply fair! The other actors were efficient! The music of Fanaa is beautiful and the videos makes it just better:a high note to Dekho Na,Kunal managed to control the little space of the shot with ease and closeups of Aamir and Kajol were fantastic.however,it's Mere Haath Me that steals the show,it was just superb,and it will be fair enough to say that this video will be the reference for any romantic song !(the reference was for a long time,Suraj Hua Madham of k3g). The script of Fanaa has some mistakes for sure,but when you watch Aamir and Kajol together you just forget and forgive! Beautifully shot,Fanaa makes you following the journey of two lovers who maybe wanted and deserved their part of happiness,so they knocked the heaven's door but another destiny was writing for them. Go watch Fanaa once for Kajol,twice for Aamir,a third time for Aamir and Kajol,and watch it again and again and again for all those reasons!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "shivsutsoni",
        "review_rating": "10",
        "review_title": "Drama movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "samirabaza",
        "review_rating": "1",
        "review_title": "poor treatment",
        "review_detailed_main": "absolute poor treatment. a very sensitive subject like Kashmir terrorism should be treated at the same high-quality standard, brilliant treatment of \"P.K.\", \"3 Idiots\", \"Dangal\" or \"Tare Zameen Bar\". I feel lucky that this was not my first experience with Aamir Khan movies. or I will mess the Indian national treasure. Mr. Khan please do not do this again."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "pats-78165",
        "review_rating": "10",
        "review_title": "Fanaa",
        "review_detailed_main": "Fanaa\" is an incredibly frustrating film to watch. The first half is magnificent--very romantic and very enjoyable. The second half, though not bad, was so incredibly different in tempo and style that it really did not fit together with the first half. In fact, I almost wish the movie had just ended in the middle!\n\nWhen the story begins, Zooni (Kajol) is going on a trip to Delhi with some friends. Her parents are worried...after all, she is blind. But they also know they need to let her grow and experience the world, so they reluctantly send her. Soon after arriving, the group of you #awsummovie."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ranianour-84223",
        "review_rating": "10",
        "review_title": "superb",
        "review_detailed_main": "Aamir khan always give me a new experience ... well done aamirji"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "alexdebrouwer",
        "review_rating": "10",
        "review_title": "An easy accessible film with a deep message of searching for and finding your identity",
        "review_detailed_main": "At first sight this is a patriotistic movie about a fatal love, full of cliches. But if you look deeper you see the depth in the film, that actually tells about searching for and finding one's identity of the five main characters. Rarely such accessible movie knows such a depth. It is a film about: Who are you? And what's the better of two good issues and the worse between two bad? It is also a movie about an actually impossible love in Delhi, that years later returns like a boomerang in Kashmir, in which especially the two main characters, Zooni (Kajol) and Rehan (Amir Khan), have to do some inner research about how fanatic, they have to choose for a position in the main questions of life in which they also can choose for a total surrender (a total surrender to God means fanaa in sufism and islam), even into death of your most loved ones."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "mars_sweet",
        "review_rating": "8",
        "review_title": "Fanaa is a movie loaded with emotions!",
        "review_detailed_main": "After watching Fanaa I was brought to tears because it was truly a touching movie! It was nice to see Kajol back looking as beautiful as ever, and the fact that she was paired up with Aamir Khan just completed the touch of a Hindi love film. The plot was explicitly engrossing, and Kunal has done an excellent job at bringing the characters of Zooni (Kajol), and Rehan (Aamir) to life. The dialogues in the movie are filled with humor and amorous poetry. This is a must see film, and it's going to hit box offices big time! Oh yes, how can I forget, the songs are absolutely amazing which overall makes the movie a grand slam!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "asawarsajid",
        "review_rating": "1",
        "review_title": "wow Fanaa was a total waste of time!",
        "review_detailed_main": "OK this movie really sucked, i mean i liked aamir khan but kajol just sucked. I think they shouldve added srk to the movie with kajol it would be a little better, but o well. I watched and the first half was pointless but at least the second half was a little better with the Twists. Aamir Khan hands down is a good terrorist, but adding a blind girl? eh no!hopefully Aamir KHan will do much better at Mani Ratnam film. Does anyone know if they are still making the Mahabatra? anwayz i advise anyone do not see this bad movie, itll make u sleep, and its soo freakishly long. I couldn't stay up watching this, but I mean I think Veer Zaara is much better then this story.So If id give this a movie out of 5 id give this a 1 or a 0.5"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "tataambani",
        "review_rating": "10",
        "review_title": "Movie",
        "review_detailed_main": "FANAA- Tere dil mein meri sason ko fanaa mil jaae. Tere ishq mein meri jaan fanaa ho jaae. Nice romance by Aamir kajol and kunal kohli .Good script fantastic narration portrayed. Full drama .Bole to zaakas.\n\nThnx to Aamirkhan sir for choosing wonderful fanaa. Watched 28 times till .cryed a lot .very pathetic climax . How could zoonie kill her love ??? Let's back to plot --- Rehan had true love for for zooni and son Rehan . He fell in love with zooni naturally inspite of effort more to avoid. Atfirst he couldn't convince properly Jooni abt his mission, fickle character (little more) taster of love for hurried and confuse bcoz he knew already that the field in which he had stepped that's not a straight path never. His weakness towards zoonni crossed all barriers obstacles. So it's called Love doesn't obey anything. He became the Ghulam ( slave) of her beautiness , simple heart. In another side zunni smoothly fell to him; mainly she enchanted by his sense of humour sweet mindblowing word, harmonies of touch and obviously that happened."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "mannykhan-30867",
        "review_rating": "9",
        "review_title": "One of the finest Indian films!",
        "review_detailed_main": "Fanaa is a wonderful romantic film with tragic events. Kajol plays the role of a blind girl so beautifully and with such grace and conviction. One of Kajol's best performances! Aamir Khan as Rehan had such charm and charisma. We also got to see a more serious and intense side of Rehan in the second half. Aamir's performance was outstanding! It was almost as if we saw two different characters played by Aamir. The pairing of Kajol and Aamir on screen was magic! Kunal Kohli did a fantastic job directing and the screenplay was good. A great entertaining and emotional film with beautiful cinematography and background score."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "nafeesfuadsourov",
        "review_rating": "10",
        "review_title": "Spectacular",
        "review_detailed_main": "I saw all of the movies of Aamir like Ghajini, Rang De Basanti, Dangaal etc which impressed me a lot. But, this movie contains everything like emotions, thriller, romance, intelligence and much more I can't tell you. This film make me cry several times. Just love you Aamir."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "kulvinders-27312",
        "review_rating": "10",
        "review_title": "Fanna very good Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "mofo666",
        "review_rating": "1",
        "review_title": "Sheep walk",
        "review_detailed_main": "Awful is not sufficient to describe how disgusting this movie is. Before Rang De.., I used to be a huge fan of Aamir Khan. RDB showed glimpse that Aamir is off the hooks and looking to become like Shahrukh Khan. After seeing Fanaa, I've lost everything I had for him. Soon I expect is to see Aamir getting paid for dancing in marriage parties.\n\nNow Bollywood is becoming obsessed about portraying Dumbs, Deafs and Blinds as central character and then showing them falling in love and shaking butts around the trees.\n\nBottomline, It's simply Karan-Aaditya Chopra-Suraj Barjatya-Shahrukh khan stuff, Kunal Kohli is no new god."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "priyamalhotra",
        "review_rating": "10",
        "review_title": "Best film ever",
        "review_detailed_main": "I wonder how could Fanaa be such a great film.After 10 years of its release I saw it & I m spellbound. Kajol has looked the most beautiful ever in this film & Aamir is so charming.You actually fall for Rehan specially those Shayari sequences.Kajol & Aamir were brilliant as usual & their chemistry is so great.While watching Fanaa I didn't realize I was watching Kajol & Aamir.They transformed into Zooni & Rehan completely.Thanx Kunal Kohli.Its even better than HT.Tabu Rishi Kapoor & Kirron Kher were great.Music is so beautiful & background music is too good & suits the film so much.Everything is great about this film.I just wished Zooni had not shot Rehan in the climax.A painful yet a beautiful story.Zooni & Rehan spent some 7-9 days in Delhi & some 9-10 days in the second half.Yet they loved each other.I actually started believing in love after watching Fanaa.Go & watch it if u haven't.You will be smitten.Kajol & Aamir's best performance according to me.And yes they have become my favorites.Wish they come back in a film soon."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "vkalpana-72092",
        "review_rating": "10",
        "review_title": "Lovable movie",
        "review_detailed_main": "The first half of the movie could have been made better though. Sometimes the pace felt a little off. The constant exchange of poetry did feel irritating at times. Perhaps, if Aamir could shed off a few kilos, things could have looked a little more natural. It was also unusual for a blind Muslim girl like Zooni (Kajol) to indulge into a physical relation with Rehan (who did not pledge any commitment to their relation) so early. But I guess these things follow typical commercial Hindi film unofficial rules.\n\nOverall the movie is certainly worth watching and, compared to most of the Hindi films, quite a unique one.\n\nBut the movie goes deeper and makes one think about the power of love and our utter helplessness before it... how it shapes one's life and choices. The importance of choice is given the limelight in this movie- the choices that are so unique and personal to each of us, given the same situation. It also asks, importantly, how much can love forgive?\n\nPut yourself in the place of these characters as you watch the movie and see how much is asked of you at each step, what strength is required to make the choices they make."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "ChopraParth01",
        "review_rating": "9",
        "review_title": "Opulently Emotional. They have no idea what they made.",
        "review_detailed_main": "I frequently like to judge any film by 2 factors: Universe Establishment (how well the world and the characters have been set) and Emotional Resonance (are the characters written and directed in a way that they hit some chords in the hearts of most people who watch them). Fanaa nails both these criterions.\n\nI must start with the most exhilirating part of the film, and that is its story. Some might argue that the story is nothing very unique or groundbreaking, to which I'd say they are right. Not every story is supposed to be unique, but its execution is. And Fanaa damn well was. While a fervent love story on the face of it, Fanaa is a fable on radical terrorism and the Kashmir conflict. To decide what is at the heart of the conflict for a film, we do not necessarily need a lot of screen time to the theme itself. Rather, we should be able to gauge the relative importance of the theme itself in the story; Terrorism in this case.\n\nIn the Screenplay, Every character is made to face the very thing he/she is running away from. There is the minor conflict of the love between Rehan and Zooni, but also the major conflict of terrorism affecting the dynamics of their relationships. This is a paradigm rule for adding depth to the film. I also revere the way in which the story converges inward toward the latter part of the film. They simply wrap what they started rather than overdoing by adding more themes.\n\nThe dialogues are one of the most impactful segments of the film, and are masterfully written by Kohli himself. That is to say the dialogues don't just act as a conversational tool, but an action in on themselves, propelling the story forwards.\n\nThe direction is very convincing, and nails all emotions. The organic look of 35mm adds so much character to the landscapes and skin-tones, making it a very Yash Raj love film for its time. The climax action sequence could have been done slightly better, but it is not something unforgivable, since emotional resonance and internal character struggles get right through the film to the heart.\n\nI like to relate the actor performances close to the directors work. That is to say that Kohli directed the actors marvellously. Kajol's Zooni and Khan's Rehan come across as very real and convincing characters, and their love makes them very connectable. Other actors also put up great performances like Kirron Kher and Rishi Kapoor.\n\nFanaa's review is incomplete without talking about Jatin-Lalit's music. Their final composition as a duo, Fanaa's songs live up to every expectation from the legendary composers. Each and every song behaves a part of the family of songs made for the film, sharing a unique musical heart with each other. Jatin-Lalit, for a fact, knew how to give due justice to the music even with the expeditiously written vocals. The 2 factors mentioned above led the Filmmakers to use chunks from their songs as BGM in a great deal of scenes. Now, I consider this success on part of the duo's perplexingly beautiful. Another layer of depth is added to the film when we observe Leitmotifs (character themes) which bring back emotions of nostalgia and empathy. You simply CANNOT remember Fanaa without its music.\n\nAs I scribbled in the title, with Fanaa as a film, I don't think they still realise what they made. It is a perfectly layered and structured narrative, with very real and believable characters built on top of complex themes like Love, Patriotism, and Terrorism, aided with absolute justice and boost from music. It is a MUST watch for everyone.\n\nHope the review helped :)"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "abhishekpathak-37399",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "I'm watching this in 2019 how can you believe in someone, A blockbuster movie fanaa being watched in 2019.Great movie for entertainment. Must watch."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "satish_sankaran",
        "review_rating": "2",
        "review_title": "this movie sucks!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "latajain-67763",
        "review_rating": "8",
        "review_title": "Must watch movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "udaykiran-96338",
        "review_rating": "10",
        "review_title": "Nice Movie",
        "review_detailed_main": "The best movie of amir khan.Hope this kind of movie to release these days.Nothing to say anything negative about the movie.Direction Songs Acting everything is good in the movie."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "subash-84165",
        "review_rating": "10",
        "review_title": "Fanaa💓",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "crony_mav",
        "review_rating": "1",
        "review_title": "waste of time!!",
        "review_detailed_main": "I was waiting to see this movie eagerly.thank god i managed to get two free tickets....otherwise i would have cried my hearts out to have spent 20 dollars on this awful movie. I expected it to be a very intelligent movie considering that Kajol and Aamir are in there.But to my disappointment and horror this can easily be voted as the worst movie of the year. All the hype and hoopla created is not even worth a dime. The only plus point are the songs(...Dekho Na,Chandsifarish and Mere hath Mein, which are divine)and Kajol's performance.Aamir looks really old .The movie lacks a proper script...somehow the movie lacks a gripping story."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "swathikadiyala",
        "review_rating": "10",
        "review_title": "Sentimental and good",
        "review_detailed_main": "Faana is a good movie, Aamir and Kajol performed brilliantly and the music is heavenly. The movie makes one think power of love helplessness before it. The choice that' are so unique and personal to each of us, given the Same Aamir is Fantastic as the lucky go tourist.an award the best Jodi of 2006 will be beautiful pair. Fanaa is one of the most intense romantic movies to have come out of Bollywood for a long time. Perhaps, since Silsila. The pairing of two of the best actors of our generation. How to view Delhi's beauty despite her blindness, and bowls her over with his poetry and performed."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "9",
        "review_title": "Fanaa is an average movie",
        "review_detailed_main": "'Fanaa' is at best worth one watch.But, what makes 'Fanaa' watchable is Aamir Khan and Kajol, both of who rise above the limitations of the script and show glimpses of their histrionic genius. But the movie offers nothing stellar, nothing extraordinary The main fault of 'Fanaa' happens to be its script. The shayari in the first half is a bit overdone. Even the dialogues are a bit too filmi than real. And in the second half, the lines given to Kajol's son are poorly written, ineffective and lack subtlety. Kunal Kohli has not been able to extract a performance out of the child artist and most of the sequences involving him end up looking superficial.Kajol's performance is particularly superb.Aamir, as expected, delivers a noteworthy performance. On the sidelines, Kiron Kher and Rishi Kapoor are natural. Tabu's dialogue delivery has a hint of her Hyderabadi background, and that is a downer. Lara Dutta and Shiny Ahuja appear in cameos of few seconds."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "AriaCL",
        "review_rating": "9",
        "review_title": "I cry throughout the whole movie (every time)",
        "review_detailed_main": "Oh my god.... What shall I tell you. I love these guys' acting; they're both just wonderful. Besides Veer-Zaara, this movie makes me cry my eyes out... For Veer-Zaara I cry mostly toward the end, but this one, since the chant \"Yaa Mola\" starts I burst into tears... It's beautiful, meaningful, patriotic... Just watch it, but it's not for the faint of heart.\n\nLove it!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "rssoccer-37787",
        "review_rating": "10",
        "review_title": "sensational and suspenseful",
        "review_detailed_main": "One of the best bollywood movies ever...best songs, best acting, best storyline-literally so good"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "denn_2003",
        "review_rating": "2",
        "review_title": "Free Tickets, still wasted Time",
        "review_detailed_main": "AAMIR KHAN: ----------- What an amazing actor right? Wrong, Aamir Khan is a lost actor. There I said it. He figured he would make a lot of money by doing movies like Lagaan and Mangal Paandey, be all real and show reality in the movies and become Mr. Tom Hanks for Bollywood. He looked over the fact that Bollywood movie viewers Do Not like to think after a long day of crap going on in their lives. They need Shahrukh Khan doing lovy dovy stuff and hot girls shaking this bum on the screen. Let me tell you people, Aamir Khan looked \"BROKE\" in this movie. He had that look on his face that said \"I lost all my money in Mangal Pandey and I've been out of cash since I've not been making movies like Shahrukh Khan, please, give me anything\". I'll bring this fact again people, money can make people live and die. Its wrong but real. I don't know how much money Aamir Khan has, but he can sure as hell make a whole lot more by doing movies like Fanaa. Because he has enough batter to fool people with this crap for another 10 years I can bet (take an example of Sunny Deol). Oh yes, for a top celebrity, Aamir was pretty out of shape. It was not in his character to look chubby, even though he was not, but yet he was for being a top movie star. I mean come on, hire a personal trainer. I don't have a problem with a fat actor, but only if it is in the character (e.g. Sylverstor Stallone in Cop Land, George Clooney in Syriana).\n\nKAJOL: ----- She looked pretty, but with a belly, and I don't have a problem with that. Its just that Bollywood doesn't deal with fat heroins anymore man. Get with the age girl and loose that belly cuz I can see the shape of your belly button, I can even tell that its an inny not an outy. Besides that Kajol's performance was good, much much much better than Aamir Khan, who did the same thing in this movie in the first part that he did in Andaz Apna Apna, same expressions and same types of jokes. I honestly think that Bollywood is more than ready for movies led by female as the leading character. That would be a good change, a better change than seeing everyone with ripped bodies and lack of talent. Kajol is definitely on the better half of my list as far as performance is concerned. She is the only reason I am giving this a 2, otherwise it was definitely a 1, or less if possible.\n\nKUNAL KOHLI: ------------ Oh yes, the movie. It had flaws, couldn't keep up with the story. Well the story sucked. This was the type of themes that if come in your mind you wanna wait for a better theme to come because you don't wanna show yourself as a weak director, but I guess Kunal Kohli did. Kunal was the host of Chalo Cinema, and would criticize every movie that came out. Its a shame that he ended up making a movie so flawed and so stupid. Kunal is the person who really sucked in this movie as a director. I agree Kajol needed a break-in in the movie seen again, and Aamir kinda wanted to make some cash finally. But Kunal really sucked.\n\nI would refer this movie to the people who dig love stories wayyyy too much and just can't have enough of it. For that matter it was kinda okay because Rehan does some pretty stupid things to Zooni in the movie. And I guess a girl can only take so much in the end. I wasn't impressed with the sound track, some singer immitated Kumar Saanu very well in the song Chaand Sifarish, I think it was Shaan."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sarohaharendra318",
        "review_rating": "10",
        "review_title": "Fanaaassstiiiiiicccccccc",
        "review_detailed_main": "Must watch movies online free streaming here to visit our frequently asked questions about this movie while everyone knows what basis they've been shared is a good day to day basis they've been shared with one of the day basis they've been not be revised result of which declared the same aura of the box movie while everyone knows that deserving gets fair chance of the same irrespective of the position of the box and revise result with bites and it was not able or willing to do with it are confidential may contain confidential information intended only for future reference not set file format to take action on this movie while everyone else is there."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "hemanthks",
        "review_rating": "5",
        "review_title": "Kunal Could have done something simply wonderful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "careyrajan",
        "review_rating": "1",
        "review_title": "And they Say amir is Perfectionish....!",
        "review_detailed_main": "I was very impressed by the music of the film which leads me to see this film excited as I was the film falls straight down hill from the word go...\n\nPathetic film, poor acing, poor screenplay! ordinary paces movie, amir khan couldn't do justice to the negative character! The Amir kajol chemistry is no where to amir SRK chemistry! The 2nd half is incredibly predictable, with the child rehan too bad in acting! the movie cashed in only for its hype, the foolish amir khan fans may go and waste their time and money to watch this crap! even Hrithik's Main Prem ki Diwani hoon is better than this!"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "gauravb21",
        "review_rating": "5",
        "review_title": "Fanna \u0085..Sadly not for you !",
        "review_detailed_main": "Remember disastrous Fiza by talented Khalid Mohamed and Hrithik Roshan, followed by Mission Kashmir of Vidhu Vinod Chopra. It seems like filmmakers are allured by the theory of an innocent Kashmiri militant and they never seem to get enough of it. Well, that was some six odd years ago and now once again Kunal Kohli tries to present the concept with bit more of melodrama. There have been more than one set of similarities between all these films, lack of concrete script, some fantastic cinematography, slow paced screenplay, strong female character portrayal ( be it Karisma in Fiza, Pretty in Mission Kashmir, and mesmeric Kajol in Fanaa ), and of course the dud endings leaving viewers bewildered.\n\nFanna has definitely been an attempt by the director to do something different, however I would suggest him to better stick to his foray of chocolaty films (his last was Hum Tum with Saif and Rani Mukherjee). In the nutshell, it has been a big let down to all the viewers who have been rather waiting for the movie very eagerly.\n\nFanaa meaning 'destroyed in love', was planned to embody the dark side of a love story in a patriotic flavor. The movie begins with the scenic New Delhi and all its historical architectures. The story grows at a painfully slow rate and thus loosening its grip in the first half itself, though there were hints of some revival towards the beginning of second half but nothing seemed to have helped the lousy screenplay. Even the poetry dialogs sprinkled wholeheartedly across the script are very jaded and sounds dated. Talking about performances, Kirron Kher seems to have perfected the art of motherhood in Bollywood after legendary Nirupa Roy, she is good in her short appearance. Rishi Kapoor still maintains those cute looks but he didn't have any major chunk to perform. The fulcrum of the film was always on Aamir and he never seems to disappoint his fans. He always gives a new dimension to any character he plays and Rehan Qadri in Fanaa is absolutely to watch out for his expressions and presentation. However the character never blossomed on screen, it looked much curtailed both in romantic and then in ruthless militant look. I still wonder at the choice of this script by the versatile actor. Tabu also jumps in with a small cameo but she looked far away from whole thing. She could hardly relate to the passion and the temperament of an intelligence officer.\n\nFinally, all is not lost in Fanaa, the character that really looms large over the whole show is Zooni Ali Beg, portrayed to near perfection by none other than Kajol. She has everything going for her way as she looks really enticing and powerful from within. This could have been a perfect comeback movie for the actress only if the treatment would have been little better but nonetheless she has captivated the viewer's imagination with those big expressive eyes and graceful looks. She maintains the dignity of the character and even commands attention with her screen presence.\n\nThe cinematography is another delight in the dismal depiction. The picturesque locales of Poland (shown as Kashmir) are a treat to watch and would sooth few eyes in scorching Indian summer. Also the song 'Dekho Na' is sure to hang around for sometime for visuals and background score, it shows that Sonu Nigam has well graduated to a classical vocalist and he is doing all legendary singers proud. Then comes the music and Jatin-Lalit are no Rehman, they tried to work on similar lines but without much of gain. Sufi music requires a whole lot more of depth with lyrical value and it is disappointing to say the least. The songs lack the punch and repeat value in any way. They are highly situational but still fail to bind along. To add to the latest trend of remixed fast paced songs there is one by DJ Aqeel called \"Fanaa for You\u0085\" which has been added more for a necessity than for a requirement. To complement all, the climax has been rushed up with a frantic build up and it leaves so many tattered ends to the film.\n\nAll I can say is that its mere destruction and this Fanaa is not for you"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "etawah-1",
        "review_rating": "3",
        "review_title": "What a waste of time and $15.50.",
        "review_detailed_main": "I have just returned from watching Aamir and Kajol's latest movie. This movie bored me to death. I had a lot of expectations after Aamir's totally awesome Rang De Basanti and Kunal Kohli's Hum Tum. But this movie was a total waste of time and money. Yashraj films have been cashing in with their standard sugar coated lovely dovey movies for a long time but somehow the formula just didn't work in this one. Fanaa tried to have too many genres in one movie including James Bond, Mission Impossible and some trash Hollywood love story to name a few. The premise, as promoted, of the movie is about a blind girl falling in love with a terrorist which is technically correct. First half is about Aamir and Kajol's never ending sickly sweet love story, at least that's how it felt like. Second half focused on Aamir's terrorist character, and how he re-kindles his love with Kajol ... again a total drag. One thing is for sure that Kajol is so beautiful and Aamir Khan needs to shed some weight. In one of the wet sari songs one could see his tummy through a white t-shirt he was wearing."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "agrvikasa",
        "review_rating": "2",
        "review_title": "Utterly unconvincing crap",
        "review_detailed_main": "Here is a movie from the \"biggies\".. the YASH-RAJ, who seem to be thinking that a sales is everything even if the product is a total crap. The whole movie is so much pain to heart and brain. OK, bollywood movies are generally unconvicing, but even in the David-dhavan kind of un-realism, you expect a comedy plot, sufficient to make you feel, time worth spent. Here seemingly \"underpaid\" writers wrote 1/3rd of the dialogues and repeated each at least 3 times to make a regular 3-hr movie. Director Kunal Kohli somehow manages to make sure that none of the scenes, I mean not even a single one, is something one could think logical. Even hypothetically logical.\n\nAfter watching this movie, I have more respect for the directors and writers of recent movies I watched like \"Begin Cirus\", \"Taxi number 9211\". True, ther is no limit to how stupid a movie can be, and funaa proves the point."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "anshul2001anshul",
        "review_rating": "3",
        "review_title": "really stupid i used to think Amir Khan was a thinking actor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "nuke_mayhem",
        "review_rating": "4",
        "review_title": "Fanna??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "shantanu_bagchi",
        "review_rating": "3",
        "review_title": "a poorly constructed plot",
        "review_detailed_main": "its a poorly constructed plot that defies basic logic - the romantic side and the terror side don't gel together in the character shown. a person with capabilites of single handedly converting a novice organization into a rival of a CIA and KGB and Mossad has to something like Carlos the Jackal (even more dangerous) - cold, calculated, twisted and dangerous. Such people don't \"fall\" into love so fast!!!!! Also some of the sequences really defy basic logic - like a few bursts of unaimed shots bring down military helicopters and stealing a nuclear bomb trigger - the script writer hasn't thought through the details.\n\nthe initial portion of the movie kind of rushes through with both kajol and Amir more than willing to fall in love with somebody - it was much more speedy than it should be. But then the romance after amir accidentally lands in kajol's house is too long winded - it could have been made shorter.\n\nthe plot was new - could have been dealt much much better but tendency to stick to old bollywood clichés undo the whole story. We need producers and directors who have the balls to take the plunge - just like the dark and twisted movie \"being cyrus\""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "phaneendrakumar",
        "review_rating": "4",
        "review_title": "Whatever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "chrishend",
        "review_rating": "4",
        "review_title": "Rehan's review of Fanaa",
        "review_detailed_main": "*spoilers* Rehan wonders why Mommy slept with some guy after only knowing him for a couple days. Rehan is also curious why Mommy didn't make sure the guy she just met used protection of some type so that Mommy wouldn't get pregnant. Could someone tell Rehan why daddy, an international terrorist, was working as a tour guide when he met mommy? Rehan also wonders why Mommy and Grandpa are living out in the middle of nowhere for no apparent reason. Rehan also wonders at the odds, in a country of over 1 billion people, of daddy Rehan coming up to our doorstep at random in the middle of nowhere. But most of all, Rehan wonders why Rehan always talks about Rehan in the 3rd person. Rehan wonders if viewers, annoyed by this characteristic, will wish that Rehan would fall in a well and die a slow agonizing death.\n\nOverall, Rehan thinks Fanaa was a very funny movie. It wasn't trying to be, but it was anyway. Rehan thinks viewers will burst into laughter many times over at the ridiculous, yet still amazingly predictable, plot points. Rehan also really wishes that someone would take care of Mommy's unibrow. She's good looking, but Rehan finds her unibrow distracting."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "golapi2002",
        "review_rating": "4",
        "review_title": "Everything in place but storyline and direction flounders",
        "review_detailed_main": "The movie 'Fanaa' has some of the very good actors of Hindi cinema in it's casting. It has one of the best producers and distributors backing it (Yash Raj Films). Therefore there has been no paucity in presentation and the screen fills up like a colour palette. Add the good music(it grows on you slowly) and you come up with a good treat. Well that's why it was a disappointment!! At one point the storyline (not much of a story) went haywire and the ending leaves you with a feeling of being discontented. You feel as if the movie is moving in breaks and there is no continuity. I believe the director's previous movie 'Hum Tum' was better and sorry but I have to say 'Fanaa' was tad little better than his first film. Maybe he should stick to romantic movies and steer clear of saddling serious issues with romance."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "manjus_mail",
        "review_rating": "1",
        "review_title": "I am really feeling bad about fanaa movie",
        "review_detailed_main": "I am really feeling bad about fanaa movie, in this movie they are showing a terrorist has a hero, if this is the case then all terrorists will think them self has heroes, what about he killed more than 100 Indians and their wife and their sons/daughters? We should not support these types of movies, if we are really Indians and we supports our nation then we need to burn the movie and also the actors they played in this movie.\n\nI know only this types of movies can run in India, if it is in any other country if movie like this came in their country against their own country, then they may banned and burned it at that movement it self.\n\nIf these types of movies will run in India then only GOD has to save India. Because of inefficient and always loving characters our ancestors we lost our great India now also we are doing do same mistake and we going to loose our India one day."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "umuhajir",
        "review_rating": "5",
        "review_title": "A mediocre film salvaged by a powerhouse Aamir Khan performance",
        "review_detailed_main": "Films like Fanaa remind me that I can be too harsh on the politics of a film like Rang de Basanti. Because nothing in the latter film matches the silliness, not to mention the sheer dishonesty, of what Yashraj manage with Fanaa. Consider: the Kasmiri separatist group at the core of terrorism in the film apparently targets both Pakistan and India with equal abandon and vehemence. No matter that a Kasmiri separatist group has never been linked to any terrorist act against Pakistan that I can think of. No matter that no Kasmiri separatist group has ever even advocated violence against Pakistan. Heck, there's no intellectual disgrace in advocating a view that ethnic separatism poses a long term threat to the viability and stability of both India and Pakistan; except that one suspects Yashraj don't believe any such thing, but simply wish to pander to their overseas audience, while also seeking to avoid alienating their multiplex core audience at home by pretending to be advocates of modern, progressive politics.\n\nPerhaps it is the silliness of the notion of politics in Fanaa that actually rescues it. Because so silly is the notion that one is almost tempted to say it is Silly. That it is the ne plus ultra of Silliness.\n\ncontinued at: http://qalandari.blogspot.com/2006/05/fanaa.html"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "david-robin",
        "review_rating": "5",
        "review_title": "disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "silvan-desouza",
        "review_rating": "4",
        "review_title": "Below average",
        "review_detailed_main": "Aamir Khan is a perfectionist but sometimes his films aren't that good for e.g. MANGAL PANDEY, FANAA\n\nFANAA has a good plot but the film is too clichéd\n\nThe first half is too long, boring\n\nthe entire shayari bit and the love story is damn clichéd\n\nThe interval point raises expectations but the way Aamir kills people in the snow.etc is too much but yet forgiven The film drags in the second half too and scenes get boring but yet the entire Aamir- Kajol track in the 2nd half is handled well even the climax but Rishi's death scene is too funny\n\nDirection by Kunal Kohli is good in parts overall bad Music is good the only problem was DES RANGILA as Kajol danced like a girl who could see\n\nAamir acts very well as the smooth operator and his helplessness is well handled by him but in the first half as the romantic lover he tends to be annoying and looks too old Kajol is good in her part in the second half and emotes very well though her role is too childish in first half\n\nAmongst rest Shruti is good Rishi is excellent in his part, Kirron Kher is okay the child is alright Shiny is wasted"
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sandhuji",
        "review_rating": "2",
        "review_title": "Ridiculous",
        "review_detailed_main": "I give it 2 for the photography, which is nice.\n\nBollywood movies defy logic, copy blatantly and most of the times make you cringe and this movie helps further establishing these facts. I was not expecting that from an Aamir Khan enterprise, but oh well...\n\nI can't list the number of annoying and WTF type plot holes, they are just too ridiculous for me to even waste my time writing (look at 50 things you learned from Fanna in the forum).\n\nIt's hard to establish how well acted this flick is, given the shitty plot/screenplay, however I think Aamir still did a good job. I can't understand why people think Kajor is a good actress, she either has that big grin on her face or a serious (semi-agro, argumentative..call it what you will) face. But then in mainstream Bollywood, someone with 2.5 expressions is considered a good actress.\n\nThe romance did not move me and the action is a joke.\n\nDil se is a much better movie, with a similar theme.\n\nGive it a miss."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "weird_whacky",
        "review_rating": "2",
        "review_title": "Nice 1st half, Worst 2nd half - Don't spend your money.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "caviar_sand",
        "review_rating": "5",
        "review_title": "Boring movie redeemed by performances",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "g_aparna",
        "review_rating": "5",
        "review_title": "Fanaa - Story of setting goals ,determination & motivation.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "amitgarg_pta",
        "review_rating": "5",
        "review_title": "Climax film end in partial off presentation in audit off respect value advance nature work in well category off script in deserving letter.it is inbetween time over gap value.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "megha6582",
        "review_rating": "5",
        "review_title": "It is just about OK",
        "review_detailed_main": "Well, I'd say that this is an average movie. First lets come to the plus points. The main plus point is the star cast. Its a treat to watch Aamir and Kajol in the same movie. Both of them r fine actors and always do justice to the roles that they r given. Kajol has lost a lot of weight and looks stunning. In fact, I'd say that she hasn't looked better! Unfortunately, the same can't be said about the leading man. Coming to the rest of the cast, the child actor has done a good job and is endearing. The second plus point of the movie is the music. The songs are really good and well picturised. They will surely go on to become the biggest hits of the year. Now for the minus points. The major minus point is the first half. It is quite boring & slow paced. After sometime, the shayaris get real irritating and you just want to shout at Aamir and tell him to stop! Some parts of the movie are really unbelievable... for example how Kajol, even though being blind, dances like a pro! I don't think even a trained dancer (who has vision) will be able to match steps with her! There are many more such instances. Aamir has packed on a few extra pounds and looks old. I also think that his talent has not been made use of by the director. He is capable of so much more but since his character in the movie has not been defined properly, its hardly his fault. I also cannot understand what a Tabu is doing in this movie! She is such a talented actress but has been utterly wasted in an insignificant role. The same can be said for Rishi kapoor and Kiron Kher. Well, in all I'd say it is a movie that you can go and watch once. Not too good but not too bad either."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "sheikhjabernurani",
        "review_rating": "1",
        "review_title": "Poor direction and unreal plot",
        "review_detailed_main": "The whole plot was kind of unreal story. It seemed garbage to me, director messed up. Acting of Amir Khan and Kajol was excellent."
    },
    {
        "movie_id": "tt0439662",
        "movie_name": "Fanaa",
        "movie_rating": "7.1",
        "review_username": "carlo-nardi",
        "review_rating": "",
        "review_title": "Deafened by blindness",
        "review_detailed_main": ""
    }
]