[
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "5",
        "review_title": "Amusing and humorous film with super Jackie Chan , being well accompanied by the beautiful Jennifer Love Hewitt",
        "review_detailed_main": "The movie concerns a hapless chauffeur called Tong (Jackie Chan) who hiding himself from a secret agent (Jason Isaacs) wears his special gadget-laden tuxedo with extraordinary powers . This discovery thrusts Tong into world of international espionage and intrigue and pairs him with an inexperienced colleague . As Jackie Chan and another agent (Jennifer Lowe Hewitt) will have to take on a villain who's wanting to rule over the world .\n\nFrom start to finish humor and action-packed is interminable . In the film there are intrigue , tongue in cheek , pursuits , frenetic action and includes lots of fun . The movie didn't fail at the box office and neither was a real success .\n\nAction carried out by Jackie Chan was realized by means of specials effects to difference other films in which he made his own stunts . Jennifer Hewitt is pretty gorgeous making with Jackie Chan a type of ¨Buddy movie¨ film . Final confrontation between starring and the baddies is breathtaking and astounding . The picture will appeal to Jackie Chan fans.\n\nRating : 5,5/10 nice and entertaining ."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "commodusone",
        "review_rating": "4",
        "review_title": "disapointing",
        "review_detailed_main": "although both jackie and jennifer do well with this lazy, confused script ultimately this film falls flat. a jackie chan film first and foremost is a vehicle enabling us to see jackies martial arts talents and physical comedy. The premise was childish and at times i found myself cringing with embarrassment which is unheard of im a huge jackie fan and have been since battle creek brawl. Lets face it it doesnt take much to please us rush hour 1 and 2 shanghai noon mr nice guy etc have been fantastic. just put jackie in lots of imaginitive fight scenes with a comedy sidekick or indeed police story just imaginitive fight scenes. But with the tuxedo a lot of the fight scenes have been matrixed up and are cgi'd which we dont expect from jackie. the actual plot was like something from the english school film foundation. Lets hope shanghai knights and highbinders are better."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "leekandham",
        "review_rating": "5",
        "review_title": "Put into 'Discard' mode",
        "review_detailed_main": "Despite the numerous failures Jackie Chan had in trying to break into Hollywood, and now that he has, it still seems that he never quite learnt the moral of is conquest. Simply put, this was equal, nay I correct myself, can be classed below some of his other failures in terms of quality. But fortunately he has become a big enough star for the film to be pulled off - but only just\n\nI won't try to sum up the plot, partly because it's be done by others already, and partly because it is so disjointed and skewed that it struggles to make any sense. Frankly, the intelligence level of the characters appeared to be equivalent to that of a carrot, and indeed the writers seemed to share that intelligence. Even Saturday morning kids cartoons (including Jackie's own) have much greater knowledge than this!\n\nAfter the success of the Rush Hour films, and Shanghai Noon/Knights, this film was a sheer disappointment. I love seeing Jackie Chan as part of a double act in his English language films, but The Tuxedo shows he can't quite pull it off alone. Jennifer Love Hewitt appeared as simple window dressing for Chan, and despite the miniscule amount of chemistry that did appear (better than none), Chan looked desperate in trying to pull of his one-liners.\n\nIt is hard to understand how the script left the storyboard as it did. The plot isn't the worst in the world, but the way the film was constructed left very little artistic and entertainment value. It was almost too rushed. And written without Jackie Chan in mind, I feel. It's too formulaic, too 'let's make a quick buck'.\n\nI am a devoted Jackie Chan fan and one of my life's joys was the fortune to meet him and to organise his appearance at Oxford University in 2000. It's hard for a fan to criticise his hero, but sometimes he must, especially when, as in this case, his loyal fans pay money only to be disappointed.\n\nThe Tuxedo has to be one of Jackie's lowlights. I very much hope that the man can continue to work on good scripts such as Rush Hour and leave behind the non-comical, formulaic scripts such as the Tuxedo that seem to have been written while on the toilet seat.\n\nSorry Jackie, but one I have to advise to avoid."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "shrekkie",
        "review_rating": "",
        "review_title": "One Of The Best Jackie Chan's Movies!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "udeaasykle",
        "review_rating": "4",
        "review_title": "Not even Peter Stormare can save this movie",
        "review_detailed_main": "You know its not a good movie when not even Peter Stormare can save it. It is very very very easy to see that they used wires, even on the parts where you are lead to believe that Jackie is doing it without wires. And when Jackie has to use a stunt double you know something is wrong. The slapstick humor is so and so and the action is... well not good. If i were to say something about Jackie Chan, i would say. Watch his old movies before he came to Hollywood because they are sooooooo much better. The story is of course ludicrous and is about a crazy rich man who wants to pollute the water supply for the entire us, except of course his water supply. Silly silly silly if you ask me, but then again, these movie build on action and not story. All in all if you are a Jackie Chan fan i would see it if you don't have anything else to do, but don't expect much, or anything for that matter. I rate this movie 4/10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "NickMeron",
        "review_rating": "7",
        "review_title": "Mindless but hilarious entertainment",
        "review_detailed_main": "I am surprised by how low rated this film is. Don't think. Just laugh.\n\nJackie Chan dryly pokes fun at action film clichés. He plays a non-hero, an unassuming regular guy who can't meet a girl, or do anything except drive, who gets sucked into a ridiculous situation.\n\nCompletely unbelievable and ridiculous. Not great cinema. All action movies are that way; this is funny because of the low-key irony.\n\nEven Jennifer Love Hewitt seems deliberately miscast, but hilarious as she vacillates between superintelligent nerd, ditz, valley girl and superheroine.\n\nWe prefer this to Austin Powers with its completely over-the-top, zero subtlety. Here the sexual innuendo would not be missed by a teenager, but would go right over the head of kids, making it a film any age could enjoy. But you have to want to laugh, not critique."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "guyb",
        "review_rating": "2",
        "review_title": "Cut the wires!",
        "review_detailed_main": "What a shame to see Jackie Chan's talents wasted with a bunch of kung fu wires to leap in the air with. The whole joy of watching his movies is the sheer talent and relentless energy he demonstrates while doing all of his own stunts. Leave the wires to those who really need them."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "ebiros2",
        "review_rating": "7",
        "review_title": "Love Hewitt",
        "review_detailed_main": "I like this movie now more than when I first saw it.\n\nThe movie is really a mixture of Hong Kong style action with Hollywood style production. And it has Jackie Chan style humor that goes with it.\n\nWhen this movie was made Jennifer Hewitt was still a relative unknown, and it seemed odd that she was Jackie Chan's sidekick. She kind of lacked the softness or sexiness of a woman at the time, and didn't soften the touch of the team. But now she's well known, and it's much easier to pick out her signature style of being the \"Brain\".\n\nIt's amazing to see Jackie Chan mimicking the move that's supposedly the work of the \"Tuxedo\". Human Jackie Chan is making the tuxedo look like it's making the human Jackie Chan move like super human.\n\nMaybe teaming Jennifer Hewitt with Jackie Chan was bit experimental at the time, but after a decade, I can see how beautifully this movie is made, and how interesting the action is with Jackie and Jennifer as a team."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "bill_garrett",
        "review_rating": "3",
        "review_title": "This tuxedo is barely worth renting",
        "review_detailed_main": "This movie is occasionally funny if you don't get bogged down in trying to figure out the plot holes. Jennifer Love Hewitt is attractive and charming, but absolutely nothing her character does makes sense. Is she a secret agent, a secret double agent, or a secret triple agent? Does she have a sly sense of humor or is she merely tolerating someone else's sexist humor? Is she a skilled martial combatant or an incredible lucky newbie? The script never makes any of this clear. It's like this movie was written to make her look stupid (attractive, but stupid).\n\nJackie Chan's moves are entertaining, but as an action flick this is probably one of his worst. The problem is that in the story he's wearing a near-magical tuxedo that gives him superhuman powers. Instead of knowing that everything you see is Jackie busting his butt doing his own stunts, you're watching special effects ginned up with wires, blue screen, and computer enhancement. It's more like watching a Superman movie than a Jackie Chan flick.\n\nOverall I'd give this movie a 3/10. Watching it is better than doing nothing for 90 minutes, as long as you're not paying much for the privilege."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "ccthemovieman-1",
        "review_rating": "7",
        "review_title": "Very Silly, But Fun & Fast-Moving",
        "review_detailed_main": "If you enjoyed Jim Carrey's \"The Mask,\" you might enjoy this Jackie Chan film. It has a similar storyline but instead of a mask, it's a suit someone puts on and receives some supernatural powers.\n\nIt's all extremely silly but with a lot of slapstick and outrageous scenes, you are going to get some great laugh-out-loud scenes and some really stupid not-funny stuff....especially in a Chan movie. Jackie is an amazing man, with the stunts he can do at his age.\n\nMeanwhile, Jennifer Love Hewitt is easy on the eyes, especially showing us her body, but her character in here is pretty lame. The whole movie is pretty brainless but if you don't care and just want some laughs and be entertained, this serves its purpose. It's certainly a fast-moving 99 minutes and there's nothing wrong with that."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "k15h",
        "review_rating": "1",
        "review_title": "Tuxedo is Pants!",
        "review_detailed_main": "Golden Harvest production would have probably used quarter of the budget and made a fantastic movie out of this, can't believe Dreamworks funded this production. Worst Jackie Chan movie ever."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "richardsmith5000",
        "review_rating": "9",
        "review_title": "May not be for you... but well worth a try.",
        "review_detailed_main": "What do you look for in movies? A deep twisting plot? A story that stays with you long after and still stirs up emotions? Well you won't find it here! But... why does that have to be a bad thing? If you want a film like I mentioned, there are many out there. But, if you want to sit back and enjoy some light entertainment that will still make you laugh, no-one does it better than Jackie Chan. Sure, the plot is light, but what did you expect? I have seen this film twice now and would watch it again anytime. I have seen reviews saying this film was terrible purely because of JLH's role... I say make up your own mind, I'm not promising you will like this movie but at least give it a chance... When you have made as many movies as JLH and Jackie Chan, not every film you have starred in will appeal to every critic, but this may be just the right kind of film for you. One other point- Many of the reviews I have read say something like \"This film is terrible, I'd rather watch Sin City, or We Were Soldiers,\" and while I like these movies myself, you need to remember that there are parents with young children who may struggle to find a film they are happy to show their children, and this movie may be more suitable for younger viewers, while still amusing parents. If you have read this, I want you to know that this is only my opinion, so I'll say again \"Try it for yourself.\""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "callanvass",
        "review_rating": "7",
        "review_title": "Another Underrated Jackie Chan Film That I Enjoyed Quite A Bit, With Fun Performances All Around!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "billcody",
        "review_rating": "1",
        "review_title": "This flat out stinks!!!! STAY AWAY!!!!!!!!!",
        "review_detailed_main": "I love Jackie Chan. But if this is the kind of movie he plans to make from here on out, then count me out.\n\nRush Hour was fine, and I was glad to see Jackie finally get some recognition here in the States but everything from that point on has been darn near unwatchable. Finally, with The Tuxedo Jackie hits rock bottom. Hollywood has finally dragged Jackie down to their level.\n\nI see that a lot of screenwriting hacks got fat paychecks on this unwatchable garbage. And some \"director\" by the name of Kevin Donahue (I think that's what it said) helmed this mess. I checked out his pic - the usual I've got long hair at 40, probably very good in the room - white male that gets to make money in Hollywood. I'm sure his Dad or best friend got him the job. Because it certainly wasn't his talent. He has none!!!!\n\nThis was the worst movie I have seen in a long, long time. And I don't have high expectations any more. Using my usual yardstick of Dude, Where's My Car as a 5 (I only looked at my watch once when I saw it in the theater) The Tuxedo gets a 1. My friend who paid for us to see this movie apologized afterwards for dragging me to see it. (One of her friends was in it.) I think that's all you really need to know - the person who paid for the tickets apologized after the film!\n\nDon't pass go, don't see this flick, don't rent this flick, and tell others to STAY AWAY!!!!!!!!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "uds3",
        "review_rating": "",
        "review_title": "Nice idea - pathetic realisation!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Agent10",
        "review_rating": "5",
        "review_title": "A shattering disappointment from Jackie Chan",
        "review_detailed_main": "Jackie Chan has reached a new low, and it is this film. While some of his more recent films can be forgiven, this one tends to be one of his duller and less satisfying moments. While rush Hour and Rush Hour 2 offered some charm from the dynamic master of bodily contortions, this film just didn't reach that same aura of incredulity. Maybe this is a warning to Jackie: stop making films where CGI and wires are needed. If you can't do it, then don't. While it did have some potential, the antagonist just didn't seem bad enough, kind of like Jonathan Price in Tomorrow Never Dies. Sad, and I thought that whole Jennifer Love Hewitt dynamic might aid the film."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "GOWBTW",
        "review_rating": "7",
        "review_title": "It was all right!",
        "review_detailed_main": "Jackie Chan is at it again! In the movie \"The Tuxedo\", he's a chauffeur who ends up becoming a spy wannabe. Now being a spy isn't a easy job, you got to be fearless. No problem. But clueless, that's a problem. When the man he's chauffeuring is out of action, he steps up to the plate and takes his place. His partner Del Blaine(Jennifer Love Hewitt) has some type of issues in her. Very uptight, and so unwilling to open up, Jimmy Tong(Chan) does his little magic on her. The scenes are fantastic. The fight scenes are classic, and one when he encounters \"The Godfather of Soul\". Yep, it's James Brown! It's funny when he tells Tong to \"enjoy the show\". His suit takes him out accidentally. And the suit helped him do the moves J.B. does. I know that Jackie Chan is a little shy about his dance moves, but James Brown is a demanding individual. He wants the dance moves to be perfect. Of course when they did their scene together, J.B. says, \"You're fast, but I'm faster!\" In dancing yes, but martial arts? I don't think so! In real life J.B. did meet his match in the show business, but he's not jealous of J.C. Everyone in the movie deserve their spot in recognition. Jennifer Love Hewitt can kick butt too. Ever since \"I Know What You Did Last Summer\", she was tough. In \"The Tuxedo\" she kicked it up a notch. Great movie! 2.5 out of 5 stars!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "AwesomeWolf",
        "review_rating": "4",
        "review_title": "Far from Jackie's finest hour",
        "review_detailed_main": "I started watching 'The Tuxedo' bearing in mind that I'd heard from Jackie fans and Jackie haters alike that 'The Tuxedo' was one of the worst movies ever. It looked like a kids movie, and so I was going to treat it accordingly. Then again, 'The Accidental Spy' looked like a kids movie, and 'Eagle Shadow Fist' looked like a Jackie Chan movie. I should have learned already not to assume anything about a Jackie Chan movie that I have not yet seen.\n\nJackie plays Jimmy Tong, a lowly chauffeur for millionaire and apparently world famous spy Clark Devlin. I always thought that if someone was a world famous spy, then they aren't doing their job properly. Then again, I always thought Jackie Chan always played action heroes who didn't need the help of some stupid gimmick to kick arse. When Devlin ends up hospital, Tong dons the super tuxedo of death and gets to work on stopping from a water dealing super villain and said villain's mad scientists.\n\nI thought 'The Tuxedo' was meant to be a kids movie, but it seemed a little to adult to be a kids movies. Then again, it comes complete with kiddie violence. Few people would expect a good story from Jackie Chan, but what we do want is a solid action movie. All we have here is a movie obsessed with wires and CGI, and a lacklustre plot. I know Jackie is getting older, but 'New Police Story' had a fair share of wire work, and it managed to be entertaining. 'The Tuxedo' in unimpressive and not very exciting at all.\n\nHowever, for all I've complained, 'The Tuxedo' has a few funny moments. The scene involving James Brown and Jackie Chan as the 'Emperor of Soul' being a highlight of the movie, even though is supposed to be some sort of action comedy...\n\n'The Tuxedo' is not as entertaining as it looks. It has its moments, but not the sort of movie die hard Jackie Chan fans should watch if they have anything better to watch - 4/10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Mordoggy",
        "review_rating": "7",
        "review_title": "Critics are too hard on this...",
        "review_detailed_main": "This film is what it is respectively, a good comedy with action and fun fight sequences that Jackie Chan can honestly deliver! What are the critics expecting an Oscar worthy film about a Tuxedo? I don't think so. As in a film overall? It's not a perfect film or a great film. But it is a good film in my opinion. If your a Jackie Chan fan? Then you will also surely like it. P.S The Dr Angelo Scene with The Old Lady had me in the stitches!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "OCSALON",
        "review_rating": "2",
        "review_title": "Bad Tux",
        "review_detailed_main": "I am a Jackie Chan fan. I find his movies enjoyable, but please avoid watching this one at all costs. This movie isn't funny or entertaining, it's a great disappointment. I can't name one good reason why you should sit through this entire movie."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "megadoomer",
        "review_rating": "6",
        "review_title": "Oh, it was fine",
        "review_detailed_main": "I really enjoyed this movie. I don't think that there's anything wrong with letting Jackie slow down the pace of the action a little bit and focus more on acting. Jackie is a good actor, especially when it comes to comedy, but that is frequently overshadowed by the action in his movies. Without his acting ability his early movies would have been indistinguishable from any of a hundred other kung fu movies from the same era and he probably would have retired long ago.\n\nNo, this movie isn't exactly the same as his others. Jackie's stunts are now assisted by technology a little bit, but it really is just a little bit. It's not like Matrix Reloaded or Blade II where once the action gets a little hectic the actors are just replaced by CG models.\n\nLet Jackie act a little bit. There has always been more to him than his ability to jump off buildings.\n\nI thought that Jennifer Love Hewitt was a lot of fun to watch, too. I haven't seen much of her work, but I think that her comedic instincts look pretty strong."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Chris_Docker",
        "review_rating": "4",
        "review_title": "the credits were the best part . . .",
        "review_detailed_main": "Imagine Austin Powers with a hi tech suit that enables his nervous system to do almost anything, and a wristwatch that gives him menu options for super powers ranging from disco dancing and singing like James Brown to being a kung fu superstar. Throw in a gag a minute. You've just imagined a movie that this could have been. But Jackie Chan as a chauffeur-cum-superagent has more talents here than anyone, sadly, can feel enthralled with for more than the time it takes to roll the credits. Most of the movie plays out rather limply, though entertaining enough in a sort of TV-dinner way. The funniest bit *is* the end-credits, which overlay outtakes that are genuinely funny. Even lines like \"The name's Tong, James Tong\" can sound funny when you don't try too hard . . ."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "brad-wong-322-6000",
        "review_rating": "8",
        "review_title": "Chan and Hewitt rock!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "willrasmussen-617-992319",
        "review_rating": "7",
        "review_title": "Not the Best Action Movie But Not the Most Dull Either",
        "review_detailed_main": "As this is not the best action movie and not the best Jackie Chan movie either, it does have some positive sides to this movie also. The plot seems to be original as a taxi driver gets a job driving a limo for a millionaire guy. After an accident, the Jackie Chan character finds himself in his special tuxedo that the millionaire guy wore. That tuxedo has special powers and so the plot goes. There were a few good action scenes in The Tuxedo and some humor as well but maybe this movie could of used some better dialogue script in it. This movie does also come as just another Jackie Chan type clone of a film where he does about the same stunts he does in all his other movies."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tmorv",
        "review_rating": "2",
        "review_title": "It had to happen to Jackie as well!! ;(",
        "review_detailed_main": "I'm sorry to say that this movie is NOT at ALL the quality of Action/Comedy that we are used to Jackie delivering. If you love Jackie as I do, and put \"Shanghai Noon\" as one of the favourites then you will be disapointed. The movie lacks actually everything. The chemistry between Jackie, and Love H. is really not there, he seems for the first time a little bit un-interested, and the plot is really not good. This movie is probably a must see for fans of \"Spy Kids\", but for us \"older\" Jackie fans I will wait for the coming Shanghai Knights. Owen Wilson and Jackie made Shanghai Noon a success based on a funny plot, and an AMAZING chemistry between them.\n\nJackie you rock, but you can do better than this - it's not the amount of movies but the originality and fun that we are used to you delivering that makes your movies so special!\n\n:) M"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Li-1",
        "review_rating": "",
        "review_title": "Well, it had a fun beginning.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "PenGuhWin",
        "review_rating": "2",
        "review_title": "Didn't think this could be that bad... but it was.",
        "review_detailed_main": "Embarrassing.\n\nEverything about this film is trite, recycled and dumbed-down to the lowest common denominator. The film begins with a shot of an animal urinating towards the camera, and doesn't get much better from there. Is it that today's filmmakers hold their audiences in such contempt, or are they under some illusion that idiocy and poor taste will somehow \"sell\" a film such as this?\n\nI realize Jackie's getting too old to engage in some of the spectacular physical stunts he performed a decade or two ago... but age shouldn't (and doesn't) take away any of the his unique charisma and comic ability... it's sad to see him appear in something this awful."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "VolleyFlick",
        "review_rating": "7",
        "review_title": "Fun Movie!",
        "review_detailed_main": "Note: I don't read other reviews before I write my own.\n\nWell, I just watched this movie for the first time and it was a blast! Good action, not a bad plot, very funny at times, and it really moves along. It's a good no-brainer, fun movie to watch with your kids say of about 12 years old and up.\n\nI've never liked JLH but in this movie her acting fit.\n\nThe plot could have been stronger, Jackie was often difficult to understand and the acting wasn't the greatest, but for this kind of movie that's not the point.\n\nOverall good. I'd recommend it if you're looking for a fun action movie."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "johnnymonsarrat",
        "review_rating": "5",
        "review_title": "Jon Monsarrat review: one of Jackie's worst",
        "review_detailed_main": "Let me admit up front that I am a Jackie Chan fan. I've even run a marathon of Jackie Chan movies. So I have a certain tolerance for films like \"Rumble in the Bronx\" that have no plot or character depth whatsoever, as long as there's plenty of action and some comedy.\n\nUnfortunately, The Tuxedo stretches the genre in new ways, and I do not mean in the good direction. The gimmicks in the \"secret agent tuxedo\" aren't used in a clever manner and there's very little tension. The physical comedy just didn't work for me, and there were a few stupid character reactions (Jennifer Love-Hewitt) straight out of the cheesy Disney flicks of the 1970s, you know where the badguys get soaked with a vat of milk and somehow that defeats them even though they have guns. While there are a few action scenes of merit, overall the film was slow-paced and... I'm forced to say it... just not really worth watching. It just lacked the \"cult appeal\" that bad films have to have to turn bad into good.\n\nWho should see this film:\n\n-- action movie fans, but only on a rainy day and only if you feel obligated to\n\n-- members of the American secret service who somehow have a British accent\n\nIt means a great deal that a Jackie Chan fanatic like me would give this movie only a 5 out of 10. Avoid!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "emirdumani",
        "review_rating": "7",
        "review_title": "Fun Movie",
        "review_detailed_main": "I don't see myself as a Jackie Chan fan yet i watch almost all of his movies that was the main reason why i saw the Tuxedo.\n\nI was surprised to see that Tuxedo got such low rating.\n\nI now its not a classic or anything...but it doesn't aim for that. It's a fun movie with lots of fun stuff.\n\nJackie Chan does his moves, there are fun gadgets...and a pretty lady (Jennifer Love Hewitt) what else do you need to make it a fun movie ? :) I watched the movie several times...you will love certain scenes.\n\nIf you like Jackie Chan...or action/comedy movies...this one is definitely a good way to pass a few hours :)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "randomStuff101",
        "review_rating": "3",
        "review_title": "Terrible and boring, nice cinematography.",
        "review_detailed_main": "Why can't Jackie Chan read the script and see that it's a bad script? Perhaps he does see, but takes the part regardless.\n\nThe magic tuxedo idea had potential (maybe not), but was let down by completely uninteresting scenes with awkward dialog and uninteresting action - even with Chan.\n\nJennifer Love Hewitt is totally annoying in her role as ... what was her role? I don't know, but all she did was complain a lot and over-act. The whole movie becomes too annoying to bare, and I challenge anyone to watch it to the end. I didn't make it, but watched enough to know it deserves this panning.\n\nThe one positive thing I'll say is that it often looks stunning. The cinematography and lighting is superb. Wasted talent.\n\n3 / 10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "movieguy1021",
        "review_rating": "7",
        "review_title": "The Tuxedo: 7/10",
        "review_detailed_main": "Every girl's crazy 'bout a sharp dressed man, right? So that's why Jennifer Love Hewitt works with him. Or could it be that Jackie Chan was in an amourous mood during casting?\n\nAnyway, Chan plays Jimmy Tong, a cab driver. He gets a job offer to chauffer a rich multi-zillionaire (Jason Issacs). When the car gets bombed by a skateboard (it's actually pretty funny), Jimmy's OK, but his employer is in the hospital. He puts on his superior's suit and he can do crazy stunts. Take it off and he's a bumbling nothing.\n\nThen there's this whole scheme about poisioning water and the like (it's a clever jab at the bottled water craze) and Hewitt helps Jimmy solve the case. Believe me folks, it's not as bad as it sounds.\n\nIn fact, it was pretty good. Chan's stunts were the best from any of his movies and more outrageous than the Rush Hours, for sure. If he still did all his own stunts, then I salute him. They sure were a notch above his previous comedies. The humor, though not always high-brow, didn't stoop to levels like Austin Powers and such. Most of the humor was slapstick and pratfall, but it wasn't fish-out-of-water like Rush Hour.\n\nThe plot had enough complications for an action-comedy (maybe a few too many), but it left you feeling satisfied. Actually, the first words out of my mouth after viewing were \"That was a pleasant diversion\", which it was. Though impossibly not true to life, it created an alternate world, so to speak, where the good guys always win and the action is fun. Something that was odd about this movie is, although predictable, it had my heart going a few extra beats a minute during the ending fight sequence.\n\nEnjoyably fun and funny, The Tuxedo is one movie that you may not remember in two years, but you won't be able to put on a tux without trying some of Chan's crazy stunts.\n\nMy rating: 7/10\n\nRated PG-13 for action violence."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "iddavid",
        "review_rating": "1",
        "review_title": "I want to vomit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "junkmail-5",
        "review_rating": "10",
        "review_title": "Brilliant Comedy!",
        "review_detailed_main": "I was fortunate enough to see a restricted advanced screening of this film, and while occasionally I'm disappointed by these advanced screenings, The Tuxedo really delivered.\n\nJackie Chan, while always visually stunning and frequently extremely funny, has lived to his fullest potential in this movie. If his career were to be over now, I sincerely believe that this movie would be the one he was remembered for.\n\nFrom the opening scene to the closing credits, this film keeps your adrenaline pumping and your laughter rolling. The chemistry is definitely there between Jackie Chan and the lovely Jennifer Love Hewitt, and the pair of them is funnier than either of them independently.\n\nOf course, the actors get a great deal of help from a brilliant script. The dialogue in this movie is fast and smart, and an executive of any production company, from the smallest Acme or DCJ Production company right up to MGM or Miramax, would be absolutely thrilled to see it land on his desk.\n\nAll these elements together form a film which is strong enough, funny enough, and smart enough to be the end-of-summer blockbuster we've been waiting for. See The Tuxedo - you'll be glad you did!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "djhorvath17",
        "review_rating": "7",
        "review_title": "Kellemes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "VynnyWard",
        "review_rating": "3",
        "review_title": "Owww my head...",
        "review_detailed_main": "Oh dear... After years of pleading with the American people to take JC to superstardom we do he brings this? THIS? The worst Jackie Chan movie to date, and it was up against some pretty stiff dross that he's made recently. Jackie me old mucka - we loved your original stuff; it had heart and extraordinary bravery coupled with amazing martial arts sequences. Your last few movies have been at best mediocre though and this is just eye-manure. One last thing - wires. Don't use them mate they make you look crap. Avoid - 3/10 out of pity for Jackie."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "squala",
        "review_rating": "",
        "review_title": "Not as funny as I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "twoseids",
        "review_rating": "1",
        "review_title": "What's happened, Jackie?",
        "review_detailed_main": "Okay, when Rush Hour first came out, I thought, \"Hey, let's give Jackie a chance - he's experiencing his first thrills with mainstream Hollywood.\" But then Rush Hour II, and now this! Enough, Jackie! We want you back! We want the action! The thrills! The stunts!\n\nNot the crap!!!\n\nIf you haven't seen this movie yet, PLEASE don't waste your time!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "OllieSuave-007",
        "review_rating": "7",
        "review_title": "Looks like Jackie Chan is having too much fun.",
        "review_detailed_main": "Martial arts star Jackie Chan plays chauffeur Jimmy Tong, who has been employed by millionaire Clark Devlin to be his driver. After an accident that put Devlin in the hospital, Tong was supposed to fetch some things for him and unknowingly tries on Devlin's tuxedo, which turns out to be a suit that dons special powers. This discovery leads Tong into an espionage case involving Dietrich Banning (Ritchie Coaster), who was responsible for Devlin's accident, and involving the intervention of an American spy agency, who assigns scientist Del Blaine (Jennifer Love Hewitt) to the case.\n\nI've seen this movie a number of times and most likely enjoy it for its quick-action, quick-humor and for the fact that Chan and Hewitt are in it - all despite the film having overly slapstick humor, corny acting, lack of suspense, and lack of rapport between Chan and Hewitt's characters (since they're supposed to be a team). Chan clearly didn't take his role too seriously, but was just having fun with his character, showing off a dozen martial arts moves.\n\nIt's not an action masterpiece, but a popcorn-fun film with a touch of thrills and sci-fi.\n\nGrade B-"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "HeatherBreezeMD",
        "review_rating": "1",
        "review_title": "major thumbs down",
        "review_detailed_main": "Honestly, Jennifer Love Hewitt (Well I don't love her or her lack of talent) totally ruins the movie! Not to mention the character she plays! Her character definitely made this movie a huge disappointment. Jackie Chan was the only good thing this flick had going. It also had some humor that saves it from being a total and extreme failure. I have always enjoyed watching Jackie Chan on screen- but this film (can it even be called a film?) is not worth your time. The Idea of putting on a computerized tux is a little cool no doubt, and if JLH's character's head was a little closer to earth, (not to mention being played by someone else) this movie could have at least been rated as mediocre. This movie is a waste of time. Never have I hated a movie more than the tuxedo. Movies that are actually worth watching would include: We Were Soldiers, The Mummy, The Mummy Returns, Braveheart, The Transporter, The Italian Job, Any one of The Matrix movies, Gone In 60 Seconds, Mr Deeds, Anger Management, any Harry Potter Movie, The Lord of the Rings movies, Second Hand Lions, Saving Private Ryan, Memphis Belle, and even Finding Nemo. Summary: Don't waste your time watching The Tuxedo- it sucks big time."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Shopaholic35",
        "review_rating": "7",
        "review_title": "Not Jackie Chan's best but still an enjoyable movie.",
        "review_detailed_main": "How can you not love any movie with Jackie Chan in it. He has so much charisma and is so endearing. OK so maybe this is not one of his best movies but I did find Jackie Chan and Jennifer Love Hewitt working together adorable.\n\nThe movie was kooky, zany, ridiculous and a lot of fun all at the same time. It was something different, if not completely original but it felt fresh nonetheless. I would have no problem watching this again if it came on TV and I wanted to be entertained without having to worry about real world dramas. So throw your cares out the window and give The Tuxedo a chance to charm you."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "imperial_wizard",
        "review_rating": "3",
        "review_title": "Sucked",
        "review_detailed_main": "this movie is one of the worst I have seen in a long time! The plot is completely uncomprehensible, and the acting is terrible. The sexual content is crude, and me, being a Jackie Chan fan, expected a lot from the movie. Well, lets just say I didn't get my expectations."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "rbverhoef",
        "review_rating": "6",
        "review_title": "Not all bad",
        "review_detailed_main": "'The Tuxedo' is about Jackie Chan and a magic tuxedo that can make you do almost everything. It is not his tuxedo so he also pretends he is someone else. The villain wants to make a lot of money by selling bottled money and poison all the other water in the world, which will cause dehydration. Yes, the story is as it sounds: stupid. Chan and Jennifer Love Hewitt, who plays an agent who knows everything about water, have to save the world.\n\nI have to say it is better than another James Bond spoof called 'Johnny English'. But where 'Johnny English' was all spoof 'The Tuxedo' might not even want to be that a little. The Jackie Chan martial art is always nice and fun to watch and Jennifer Love Hewitt is a very fine woman to look at, and she has some funny things as well, her giggling when an insect is on her body comes to mind. For me she saved most of the movie. I enjoyed it, but it was not good."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "zagorskis",
        "review_rating": "4",
        "review_title": "Oh no. How bad can you go!",
        "review_detailed_main": "Jackie, what are you doing to your illustrious career? Please change direction now before all credibility is lost. This movie is a stinker and I can only thank the movie lovers up in heaven for giving me the break of watching this on a plane where I didn't have to pay."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "BrunoTegano",
        "review_rating": "9",
        "review_title": "Have all of you forgotten",
        "review_detailed_main": "It seems to me that all of the people that have slammed this film have forgotten what Jackie Chan is about. I have seen most of the films, including the ones that have \"lower\" ratings. Jackie Chan movies are about having fun. I have always gotten the impression that he wants his viewers to have fun. He is an incredible actor and it shows. This movie is just simply put, a fun movie. There is no need to sit there and analyze the little bit of CG or wire work. Look at Crouching Tiger. It was mostly wire work and it did not get slammed. Go see this movie and have fun watching it. Jackie has once again made a movie that was fun to watch."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "jljacobi",
        "review_rating": "7",
        "review_title": "If you like Jackie Chan you'll like the movie",
        "review_detailed_main": "He's quite personable as usual and the stunts are fun, if not the most spectacular he's done. The premise is fun as are some of the subtle send-ups of the spy genre. There's the oft-employed Jackie Chan device of the slightly annoying female sidekick. Jennifer Love-Hewitt lacks the comedic depth to render the character innately likeable. But to be fair, she comes close, is pleasant to look at, and numerous other actors and actresses have also failed in this most subtle of screen roles.\n\nLawrence of Arabia it ain't, but I never feel as though I've wasted my money when I get to watch Jackie Chan. Except perhaps for Rush Hour 2."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "philomax",
        "review_rating": "3",
        "review_title": "Wasted Talent",
        "review_detailed_main": "Jackie Chan deserves better. Jason Isaacs, who was completely missing in Act 2, deserves better. The first part with them together is the best. What Chan needs more than anything is a writer. Special effects and daring stunts fall flat when they don't support a story."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Robot Pants",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Win14Gipp",
        "review_rating": "3",
        "review_title": "My God...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "lastliberal",
        "review_rating": "6",
        "review_title": "When I look at you, I have a wet dream.",
        "review_detailed_main": "This one was made strictly for the teens. They like Jackie Chan and Jennifer Love Hewitt and what better way to get them to the movies than put them both in a film billed as a comedy.\n\nInstead of comedy, we get slapstick. Well, that is comedy, but the lowest form. Chan is wasted as his acrobatics are directed by wires and CGI. His natural abilities are never put to use as he replaces his boss (Jason Isaacs).\n\nIsaacs (The Patriot, Lucius Malfoy) is wasted here, and I hate seeing fine actors wasted.\n\nJennifer Love Hewitt is pure eye candy. I haven't seen a demonstration of any acting ability and you certainly won't see any here.\n\nStupid story and wasted actors. Jackie Chan is so much better than this."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "boblipton",
        "review_rating": "4",
        "review_title": "Unsuitable",
        "review_detailed_main": "Weak Jackie Chan vehicle, shot without his physical charm and cobbled together with short takes and an improbable, special-effects-laden plot. Jennifer Love Hewitt shows comedic talent and there is a quick look at James Brown for fans of soul music, but there only one good joke in the entire thing."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "MovieAddict2016",
        "review_rating": "6",
        "review_title": "Overall, Worth Seeing, Despite Some Flaws...",
        "review_detailed_main": "A Review On the Film `The Tuxedo' by John Ulmer\n\nJackie Chan's newest film, `The Tuxedo,' attempts to spoof the spy/secret agent genre. It doesn't completely achieve its goal.\n\nChan is Jimmy Chang, a NY cab driver with mad driving skills. Jimmy transports a mysterious woman one day, who ends up recruiting him to be a personal chauffer for millionaire playboy Dean Devlin. There's only one catch. Never touch the playboy's prized tuxedo. But after some baddies make an attempted hit on his boss, Jimmy Chang has only one choice: to wear the tuxedo until Devlin is out of the hospital.\n\nOf course, this goes on to develop into a spy story, in which an annoying Jennifer Love Hewitt mistakes Chang for Devlin. And then, throughout the rest of the movie, the two go around doing funny things, including accidentally knocking out James Brown (guess who goes on stage instead of Brown?).\n\n`The Tuxedo' is surprising in a few ways. First of all, two things in the plot I didn't expect. One, I thought that it would be a typical comedy where a butler-type ends up touching his employer's prized object, and at the end of the film the employer finds out and blows the butler's cover. You know what I mean. Instead, in `The Tuxedo,' Chan's character is supposed to touch the tuxedo. His boss tells him to before being escorted to the hospital. Also, the ending is a bit\u0085well\u0085odd. Not what I'd expected. It breaks away from the typical guy-gets-girl ending.\n\nUnfortunately, the film also has many flaws. Perhaps its biggest is the fact that they use special effects on Jackie Chan. Who would ever want to do that?! The whole point of Chan film is that he does his own stunts! Maybe he does some of his own stunts in this film, but the majority of them are computer generated.\n\nAlso, casting Jennifer Love Hewitt was a mistake. Talk about bad acting\u0085whoa\u0085\n\nMaybe another one of `The Tuxedo's' major flaws is that it never knows whether to be a satire on James Bond films, or the next Matrix. The movie has no sense of stability. It's like a pack of playing cards stacked into a pyramid. Sooner or later, after you build up too much on a small base, it's just going to fall over because you have the base put together sloppily and it has been ignored.\n\nAlso, the film tries to go for juvenile jokes at many times. The very beginning opens up with a crude joke. Now, I don't mean crude as in `Shrek'-crude. I mean just plain dumb and juvenile. I worried when the first `joke' received laughter from children in the audience. Yet, later in the film, they go for sexually suggestive laughs. Even most of the laughs are unstable.\n\nAnd then there's the action in the film. It mixes between WB Looney Toons to `The Matrix.' Like the roots of the film, the action is unstable. I didn't know whether they wanted us to laugh at the action or feel a sense of suspense, especially the climax.\n\nOverall, I can't say `The Tuxedo' was disappointing, because I had already read many bad reviews on it. I wasn't expecting something excellent or satirical. So, with that in mind, believe it or not, I recommend this film. Perhaps it is because there are some good moments \u0096 enough to watch for, even if the bad moments negative the good moments overall. Not great by any means, but worth seeing once, especially if you're a Jackie fan.\n\n2.5/5 stars"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "gumby-8",
        "review_rating": "1",
        "review_title": "This movie stinks...",
        "review_detailed_main": "\"The Tuxedo\" proves that script and directing are key to a watchable film. Even worse are the Toronto locations doubling for New York. Looks like the production saved movie but should have spent it on better actors, cinematography, production values, etc. The opening scene instantly screams that this is not in New York. It is sad...\n\nChan needs to really read these scripts. His acting is horrid, especially the wrap-around with the girl in the art gallery...puke...And what's with every car having a license plate with no state on it...was the production too cheap to get fake New York plates...these filmmakers should take note that it is the little details that take the audience out of the story."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Nobby21",
        "review_rating": "7",
        "review_title": "This movie has something, not sure what.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "WilliamSG",
        "review_rating": "2",
        "review_title": "Why do I subject myself to this?",
        "review_detailed_main": "I'll get straight to the point. This is a terrible, terrible movie. Anyone with ANY love for good movies should stay well away. The reason I went to see this is simple. I really like Jackie Chan. No matter what you say about his American movies, like Rush Hour etc, he is always amazing to watch. Not so here. The producers decided to make it a little 'sci-fi' which doesn't work. Most of Chan's stunts are not all his own doing. You can 'see' the rope/string work throughout the entire movie. Wait...did I say 'entire' movie? What I MEANT to say is the approximately 6 minute of the movies where there is ANY action. The rest of it, which encompasses the dire script, is absolutely horrific. The dialogue is mind-numbing, and most of it is spoken by the highly irritating Jennifer Love Hewitt, doing what she does..er..best. Oh, and it's not funny, although the director probably thinks you should be laughing.\n\nStay away from this movie. My wife and I were sorely tempted to leave, but didn't only on the basis that we had paid. That's a very sad reason for staying."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tcorrell-69070",
        "review_rating": "8",
        "review_title": "It's No Lethal Weapon, Robocop or Rush Hour, But It's Still A Fun Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "FiendishDramaturgy",
        "review_rating": "7",
        "review_title": "A Great Adventure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "scott-goring",
        "review_rating": "3",
        "review_title": "Don't bother",
        "review_detailed_main": "I don't know why I'm bothering to write this review because the movie is over 3 yrs. old now and nobody is going to bother to look for it anymore. I just got it as a Christmas gift on DVD and I wanted to share my thoughts about it: man, does this movie really rot! It's a toss up as to whether this is Jackie Chan's worst Hollywood film or \"Around the World in 80 Days.\" This must be slightly better because they gave Jackie the money to make the other one after this. I don't think he'll get buckets of money after \"Around the World.\" There is no chemistry at all between Jackie and Jennifer Love Hewitt. I was so disappointed because Jackie and Jennifer are among my two favorite actors and I got absolutely no feeling at all off the screen from either of them. The action sequences are good enough but the comedy falls flat and the story is only mildly interesting. If you catch this on free cable you might want to watch if you are a fan of Jackie of Jennifer but please don't spend a penny to buy it."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "",
        "review_title": "Naff latest Jackie Chan film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Maciste_Brother",
        "review_rating": "1",
        "review_title": "Mind bogglingly bad",
        "review_detailed_main": "I recently traveled to Paris and suddenly became sick and had to stay for a few days in my hotel room, recuperating. While sick in bed, I mainly watched TV and I watched this film. Honestly, this film is so bad that I thought I was delirious from my condition or from the medicine I was taking.\n\nThe whole concept was lame, silly, whacked, amateurish! A special tuxedo that gives superpowers? Jennifer Love Hewitt with Jackie Chan? The whole bizarre plot point about water? Notice that reviews here never mention anything about the plot because it's impossible to summarize. It made no sense whatsoever.\n\nTo think I was in Paris and I was stuck watching this laughably awful film."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "closeupman",
        "review_rating": "7",
        "review_title": "Good Jackie Chan Film",
        "review_detailed_main": "While people might be complaining that Jackie had technical help in doing the stunts, you must remember he's getting older and working in the Hollywood system. Also, he did virtually all of the stunts here, the tuxedo was used to allow to him to do NEW things, not just a rehash of the choreographed fight scenes he's done in previous movies. I think this was a good idea. Although at times it may have appeared silly, it was fun to watch. Think of this, no one complains when they see obvious fake stuff in matrix or other movies, why should people do that here then?\n\nThe Tuxedo allowed Jackie also to stretch his acting and do things that would not have been LOGICALLY possible without it. For one, the very entertaining scene where he imitates James Brown, doing the foot moves and shaking his ass was one of the FUNNIEST scenes of the movie; something he wouldn't have been able to have done without the pretext of the Tuxedo. Also, his play with the sword was all him---filmed at higher speed, but all him.\n\nIn conclusion, before I had seen this movie I had read the reviews and thought it was going to be a lousy movie. However, I was pleasantly surprised. I was laughing a lot(he does Action Comedy people, not just action) and enjoyed the fight scenes he did. However, I think Jackie was trying to show off more of his creative and acting side here.\n\nI give this movie a 7, and wholeheartedly recommend any J.C. fans to see it. Also, anybody who likes vaudeville type humor will enjoy this too. Jackie is a cross between Jerry Lewis, Gene Kelly, and Bruce Lee."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Spanner-2",
        "review_rating": "4",
        "review_title": "Disapointing",
        "review_detailed_main": "This vehicle, which pairs Jackie Chan with Jennifer Love Hewitt in an action comedy is just ok... for a Chan vehicle it doesnt contain enough action. Granted some scenes are entertaining, even if the setup of a \"super-tux\" is just plain silly. Hewitt doesnt have to do much in this role, other than look cute, which she accomplishes... Chan is his usual self... there just isnt much story here. GRADE: C-"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "alienroc",
        "review_rating": "7",
        "review_title": "Great fun, enjoyable.......",
        "review_detailed_main": "Jackie Chan has always been one to entertain all his audiences with his movies. This is just another one of those 'up-down-duck-jump-fly-kick-punch-run on the wall-scramble under the table' kind of movies that has a slight twist in so far as this time it's the tux that's doing it rather than the character. Jennifer Love Hewitt, as usual her 'lovely' self, is wonderful in her role as Del Blaine. Funny, witty, and very sexy. Overall an enjoyable movie that is fast paced and funny."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "juanbuddha",
        "review_rating": "4",
        "review_title": "Not a very good Jackie Chan movie",
        "review_detailed_main": "I almost felt bad for Jackie as he redid all of the same stunts, action sequences and kung fu that he's done in all of his previous movies. And it wasn't even the good stuff! The plot is tired, the action weak and the acting par at best. You can't expect too much from Jackie, given that he's still learning English, and Jennifer Love Hewitt, while having improved a bit, still needs to study up on how to become a cinema star. Rent this maybe. You're much better off renting an older Jackie Chan import such as Drunken Master."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "=G=",
        "review_rating": "6",
        "review_title": "Stir fried, not shaken.",
        "review_detailed_main": "\"The Tuxedo\" sticks Chan in the center of a convoluted 007ish plot involving a tux which gives the wearer super human capability, a bunch of bugs which turn water into a dehydrating substance (go figure), and, of course, an evil guy who's going to take over the world by selling everyone pure bottled water...hmmm. Yeah, whatever. This inuring kaleidoscope of Hollyweird effects, stunts, and other contrivances doesn't bring out the best in Chan as much as it blurs and buries it. A fun though only marginally entertaining flick as megabuck flicks go, this step backward for Chan is for Chan fans only. All others either pass or wait for broadcast. (C+)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tadamscoco",
        "review_rating": "4",
        "review_title": "Doesn't use Jackie Chan's talents",
        "review_detailed_main": "I LIKE Jackie Chan and have seen most of his movies. This one just doesn't use his physical genius at all. There are very few fight scenes, and the plot itself has holes you could drive a Mack truck through. If you are Jackie Chan fan, I would save yourself the price of tickets and see \"Rumble in the Bronx\" or \"Supercop\" again."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "axelsteel21",
        "review_rating": "9",
        "review_title": "Jackie Chan being a clown",
        "review_detailed_main": "As a child of the 90's growing up on Jim Carey's the mask and it's animated version.\n\nI like silly comedy Is this Jackie Chans best ... no Is it citizen Kane... no\n\nDid i laugh at the humour... Yes.\n\nAlso Jason Isaacs why has he not been Bond?"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Rogue-32",
        "review_rating": "6",
        "review_title": "Jackie Chan is still. . .JACKIE CHAN",
        "review_detailed_main": "C'mon, guys - this aint that bad, I mean any film that has Jackie Chan in Full Comedy Mode isn't exactly a bummer. Sure, the plot sucks, and sure, there's too much water and WAY too many bugs towards the end, but didn't you get off at ALL on how he actually made you feel like the tux was manipulating HIM? And were Jennifer Love Hewitt's vast and amazing charms lost on you ENTIRELY?!! Are you gay or what??! Seriously, this wasn't Death of a Salesman but it wasn't The Blob either. And the outtakes were still funny, weren't they?!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "IonicBreezeMachine",
        "review_rating": "3",
        "review_title": "One of the worst from Jackie Chan's American filmography.",
        "review_detailed_main": "The Tuxedo is a rather listless action-comedy spy spoof that wastes the comedic and martial arts talents of Jackie Chan on a plot that isn't interesting and comedy that is more cringe inducing than funny. Chan plays a cab driver Jimmy Tong, known for his Crazy Taxi esque driving that can get his passengers where they need to go at quick speed which lands him a job as a chauffeur for the wealthy and mysterious Clark Devlin(played by a wasted Jason Isaacs who spends most of the movie on his back in a hospital bed) who unbeknownst to Jimmy is actually a secret agent with scientifically advance Tuxedos that give their wearers near superhuman strength. After Devlin is incapacitated by an attempt on his life Jimmy takes ends up in possession of Devlin's Tuxedo assuming his identity to undertake his mission and find out who ordered his assassination.\n\nThe premise unfortunately does not lend itself to Chan's strengths. The humor does not mesh well with Chan's style and feels more like it was written in mind for Jim Carrey or Ben Stiller. Some rather groan worthy gags include a spy counter sign involving the words \"nice rack\" that leads to predictable results and several pitiful pratfalls from love interest/co-star Jennifer Love Hewitt who has absolutely no chemistry with Chan and their scenes feel awkward and bring the film to a complete standstill.\n\nWorse still is the action sequences which aside from a sequence where Chan trashes a bedroom by turning on the Tuxedo's \"demolition\" mode(just go with it) most of the stunts use over done wirework and CGI that feels overdone and lacking in tension or impact.\n\nThe Tuxedo is a mediocre spy comedy that just happens to have Jackie Chan in it. Even if you're a Jackie Chan competitionist this will still feel like a waste as there's none of what Chan is typically known for and instead has overproduced set pieces, limp gags, and a general waste of everyone's time."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "auih111",
        "review_rating": "",
        "review_title": "a FUN movie that worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "phenoxrainflower",
        "review_rating": "5",
        "review_title": "Interesting.",
        "review_detailed_main": "I wouldn't call this a \"Family Movie\" it's more of a comedy, mostly because it has multiple references of crude humor. Still, a good comedy film, just not really a \"Family Friendly film\"."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Timofey1980",
        "review_rating": "6",
        "review_title": "A normal movie, with a beer will pull.",
        "review_detailed_main": "While Agent Clark Devlin is in a coma, private New York taxi driver Jimmy Tong has to take on a secret mission commissioned by the US government. Devlin's computerized tuxedo passes to Tong, which gives its wearer extraordinary abilities in terms of fighting, disguise, and seduction. And Jimmy begins the exciting life of a secret agent in the company of a dilettante like himself..."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "headbanga",
        "review_rating": "1",
        "review_title": "bad!!!",
        "review_detailed_main": "this movie is one of the worst chan movies ever seen . .. you can't identify which stunts are really made by jackie and which by computer! this has to do that the plot is totally stupid, especially this f***** tuxedo. it's too sick, too much high-tech . . . i really hope that \"the highbinders and shanghai knights\" will be better and jackie will stick to his old hongkong methods. cause this hollywood movie sucks butt!!! don't watch, it is too disappointing, if u remember the old movies (or the ones 2 years ago, hrhr). this plot ain't got any style!!!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Kamurai25",
        "review_rating": "7",
        "review_title": "\"The Clothes Make the Man\"",
        "review_detailed_main": "Good watch, might watch again, and can recommend.\n\nI'm not sure Jackie Chan has made a bad movie on the simple fact that almost no one can do what he does, and the flair he puts on it would keep distinct even if someone else tried to compete. Part of his charm is how humble he acts, and this movie amplifies that as he's a guy that doesn't know what he's doing and has to rely on a Tuxedo for his abilities and Jennifer Love Hewitt for basically everything else.\n\nJLH is great in this as well, she does some action, she's funny, she does some positive messaging for women, and she act's smart. I'm not sure if this could have been a little stronger if she was an experience field agent instead of a socially awkward scientist, but I don't think it would have been nearly as charming.\n\nThe writing is structured fine, but I wish it had a little more oompf to it. The villain's plot is interesting and innovative, but I feel like they could have done a lot more with it.\n\nAll said and done, it was good, but there are probably better actions, comedies, and spy movies you could watch."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "presence80",
        "review_rating": "4",
        "review_title": "What the hell!",
        "review_detailed_main": "What a disaster this movie turned out to be. I'm a big fan of Jackie Chan and I can't believe he agreed to make this movie. First of all the plot was extremely stupid and Jennifer Love Hewitt was totally annoying. She overacted in over half of her scenes. She was obviously cast for her looks and not for her acting talent. Don't get me wrong, I think she's a talented actress, but she seems completely unbelievable as a sophisticated character. We come to Jackie Chan movies to see his comedy and most of all his martial arts and spectacular stunts. He seems completely subdued in this movie, not so much verbally, but physically. He had some great lines that actually made me burst into laughter. But I didn't get to see any high speed adrenaline soaked fight scenes and worst of all, they used aids (wires, sfx, etc) to assist him. Very\n\n\"un-Chanlike\". Anyway, I can't recommend this movie. You don't see the real Jackie Chan and Love Hewitt is painfully mis-cast. Use your 9 dollars on something else."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "wafflemaker",
        "review_rating": "6",
        "review_title": "refreshing... as a slap in the face",
        "review_detailed_main": "this movie, like a slap in the face, is unexpected, unwarranted, and somewhat painful. but after the initial shock and pain wears off and the swelling goes down, there's something almost refreshing about it. in the case of The Tuxedo, this comes no doubt from Jennifer Love Hewitt's character, Del Blaine. while i'm not a fan of J. Love by any means, i found myself loving her in this film. her character is a wise-cracking agent just trying not to screw up her first assignment. and while she sometimes comes off as bitchy and mean, the kind of girl that would be more than happy to offer up that slap in the face i was referring to earlier, you can't help but fall for her. deep down, you gotta love that little girl inside trying to make good in the face of her seemingly insane partner, played by Jackie Chan. Jackie's not half bad as Jimmy Tong, a guy without the kick-ass skills Chan is known for possessing. it's a nice change for him, and his chemistry with Jennifer Love Hewitt is just the kind of friendly banter that the film calls for. but the acting can't save the story from falling on it's face as hard and often as Chan's character is forced to. the tiresome water plot nearly dehydrates the rest of the film and leaves one looking to Chan and Love Hewitt's banter for a little refreshment."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Boba_Fett1138",
        "review_rating": "4",
        "review_title": "Put this tuxedo back in the closet please.",
        "review_detailed_main": "Plain and simple; \"The Tuxedo\" is a bad movie. It already had a ridicules concept but it has an even worse execution of it.\n\nThere are several problems with this movie, one of them is the humor. For a comedy it has an awful few laughs and comical situations in it, so it's hard to tell what for a kind of movie the makers exactly tried to create here. Also the script is terribly lacking. The movie lacks a clear main plot line and has a silly villainous plot in it that's just way too ridicules, even for a movie like this one. On top of that, the main villain is hardly ever used in the movie and the movie mainly focus and Jackie Chan and his antics. Fans of Chan will also be disappointed by this, he hardly gets to show anything cool and is unfortunately given more dialog as fight sequences.\n\nNot even the presence of Jason Isaacs and Peter Stormare is enough to save this movie from being a disaster. Jason Isaacs is given a very bland role and not even he with his great charisma can prevent his character from being dull and totally uninteresting. Yes, Peter Stormare does play a good and fun role but one good role isn't of course enough to carry and save an entire movie. Jennifer Love Hewitt was also horrible in her role. I like her but she isn't much of a comical talent.\n\nNo way I'm ever watching this movie again.\n\n4/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "simple_don",
        "review_rating": "10",
        "review_title": "delightful, refreshing and entertaining",
        "review_detailed_main": "I've read numerous negative comments about this movie and its several actors on this blog, and I have to wonder what is going on the lives of these unhappy mental midgets that they did not find this movie thoroughly enjoyable. It is one of Chan's best. Jennifer Hewitt is \"DAZZLING\" (as are the other gorgeous ladies) on top of hysterical. Jason Isaacs is considerably smooth and not in near enough of the movie. It makes me think that the negative comments were written by people working for the opposition. I AM amazed at the decision to cut the majority of the deleted scenes (I won't spoil it by telling you which). Get the DVD and enjoy the whole event over and over. For my tastes, it will be a default movie... one I will look forward to watching frequently."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "mm-39",
        "review_rating": "6",
        "review_title": "Not a bad idea",
        "review_detailed_main": "Jackie Chan does some bad movies and some good ones. He is great for comedy. It reminds me of my Asian friends. This is one of his better ones. He has a great sense of humor which he combines with action. So you get a little bit of both. He plays a loser with his Hooters shirt. The story is neat and original. It is worth seeing. Jackie Chan does his trademark action in this film. He is very athletic. I enjoyed seeing this film. It was good for a laugh as well I got my action fix. 6/10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "MyOpinionIsFact",
        "review_rating": "2",
        "review_title": "Walked out half way through and got my money back",
        "review_detailed_main": "This movie is bad, bad, bad and not even in a MST3k kind of way. I gave it 2/10. I read some of the reviews by fellow IMDb members and all I can say is that it shows that the average person's IQ is not much more than 100. That people would defend this movie blows my mind. I do like Jackie Chan but he should have never of taken this role. Here's another clue for you folks: Jennifer Love Hewitt's acting here is absolutely terrible! I can't believe how many of you think she was funny. She was in over her head. One last thing before I go: a \"popcorn movie\" is not the same as a \"mindless movie\". Don't insult great popcorn movies like Indiana Jones and Star Wars by lumping them together with the Tuxedo."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "SESherrod",
        "review_rating": "",
        "review_title": "What was Jackie thinking?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "john_and_phyllis_murphy",
        "review_rating": "2",
        "review_title": "This Tuxedo Has Been Pressed Flat!",
        "review_detailed_main": "Although we are long-term fans of Jackie Chan, this movie was so dull that we left less than half-way through. The female characters are unlikeable, the jokes (mostly sexist) are aimed at teenage boys, and the martial arts sequences are flat. The best scene was Jackie's James Brown impersonation - he's quite a dancer! Sorry, Jackie, but this is not your best effort...."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "daworldismine",
        "review_rating": "6",
        "review_title": "a weak jackie chan effort, that holds back everything",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "pooh-24",
        "review_rating": "1",
        "review_title": "This Tuxedo Does Fail",
        "review_detailed_main": "Without a doubt there are few showmen in cinema today who can still entertain us as Jackie Chan can.But his film from 2002,The Tuxedo,was a disaster,for him, and his audience who adore him worldwide.\n\nThe plot was horrible.The film's supposed villians were not even a bit scary.The script was terrible.Then there was the lack of chemistry between the movie's two stars,Jackie Chan and Jennifer Love Hewitt.Lack of chemistry?Actually,there wasn't any between the two and it showed in the film.\n\nHewitt who,is paired with Chan in this adventure,looks great,no doubt,but she has this problem of whining and complaining all throughout the movie.So much so,her character becomes completely unbearable.You wish Jackie would overpower her with one punch and spare himself,and the viewing audience,anymore of Hewitt and her horrid character.\n\nThe plot of the movie would not allow this therefore we must continue to see the little girl from Kids Incorporated punch out every man she comes up against making the movie even more unbelieveable.Hewitt,it seems,is more dangerous,in this adventure,than martial artist veteran Jackie Chan is.\n\nThis movie was a setback for the once hot star Jennifer Love Hewitt,her acting is just horrid here.But one hopes this is just one bad film that is allowed every great film star every once in while,that being said The Tuxedo shall be a film that shall be considered a miss,in the many hits Jackie Chan has made in his career."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "cherold",
        "review_rating": "6",
        "review_title": "Dumb but sometimes amusing",
        "review_detailed_main": "Clever idea done in by a mess of a script. Hewitt is alternately amusing and annoying, but I'll give her the benefit of the doubt and blame the script for pretty much everything. Still, if you catch it on TV it does have its amusing moments and a couple of good fight sequences. I don't think it's as bad as others on this board are saying, but it's certainly not a shining moment for Chan."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "josefdj",
        "review_rating": "3",
        "review_title": "Jackie doesn't look good wearing \"The TUXEDO\"",
        "review_detailed_main": "Nobody's perfect. Yes, that's what I can say to Jackie. He failed on this one. He is better off making films outside of Hollywood. The Chinese filmmakers know best on how to come up with a blockbuster for Jackie Chan.\n\nThis one is an exploitation of Jackie's name. The script is terrible and the action is not entertaining.\n\nSince I am an avid fan of Jackie, I'll give him 3 out of 10 for this one. That's a consolation. Better watch his old films. I would recommend \"Accidental Spy\" for those who have not seen it yet. That's a great Jackie film for everyone to enjoy."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "CrunchyCookie",
        "review_rating": "6",
        "review_title": "Pretty entertaining, in an Americanized sort of way",
        "review_detailed_main": "If you were expecting the typical Jackie Chan formula, look elsewhere. This is more of the ordinary action flick that Hollywood cranks out by the reel, which isn't necessarily a negative, but Jackie seems sort of miscast here.\n\nThe main problem is that this film dedicates too much time developing the mindless plot, and too little time to the action Jackie's famous for. Still, he does get a good high energy fight scene or two. Also, the jokes are semi-funny, and there's even a little chemistry with Jennifer Love Hewitt since Jackie's character sort of has a personality in this film (shy guy).\n\nBut I can't help hope that films like The Tuxedo (or the even worse Shanghai Noon) don't become Jackie's new line of work. We need another Rumble In The Bronx."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Xellchiri",
        "review_rating": "4",
        "review_title": "Eh..no.",
        "review_detailed_main": "For a Jackie Chan movie, this was disappointing. Not funny, stupid gags, etc. Jennifer Love Hewitt... Well.. Bad acting, not really as great looking as people think.\n\nThe one redeeming feature of this movie : Jason Isaacs. Mmm..."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Sperry23",
        "review_rating": "9",
        "review_title": "Pure silliness",
        "review_detailed_main": "Jackie Chan is the master of fun, turn-off-your-brain-and-enjoy-it movies. This is one of the best yet in terms of pure fun. Using bits from hokey spy movies, James Bond, and Man From U.N.C.L.E., Chan crafts a funny, fast, and thoroughly unbeliveable romp. If you can't switch off your critical brain for 98 minutes, don't bother. However, if you like to laugh, this is a film for you."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "phoneyshoney",
        "review_rating": "6",
        "review_title": "Not one of Jackie Chan's best",
        "review_detailed_main": "After seeing Jackie Chan in many of his films such as Rush Hour 1 & 2, but this film fails to reach those heights of the Rush Hour films.\n\nOverall not really worth seeing unless you like action without a good plot"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "jimbob121686",
        "review_rating": "3",
        "review_title": "Waste of my time",
        "review_detailed_main": "I was coerced into going to this movie, and I sincerely regret it. Barring a few funny moments, it was bland and left a bad taste in the mouth. The plot was silly at best, the acting was not terribly convincing (especially Jennifer Love-Hewitt) and in no way did it even draw to a conclusion. I hope Jackie Chan was paid a lot of money for this, because otherwise he'll probably regret this film for the rest of his career"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "TDE156",
        "review_rating": "",
        "review_title": "stupid idea, stupid movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "wheres_bobevans",
        "review_rating": "1",
        "review_title": "bad bad bad bad bad. bad.",
        "review_detailed_main": "This movie is so bad. it has bad acting (hewitt), bad writing (terrible dialogue), and bad camera work. There is really nothing good to say about this movie.\n\nI am a huge jackie chan fan, and this movie really made me angry. I was really excited when I got to see a test screening, but it's just so stupid.\n\nGo rent Rumble in the Bronx. It's money better spent.\n\nAnd that other guy totally works for the movie studio. Go back to Sony!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "RRBarBurger",
        "review_rating": "6",
        "review_title": "I don't know",
        "review_detailed_main": "Jackie Chan's work always astonishes me, but mostly because of the feeling that what he's doing is real. In this, I felt like there wasn't as much at stake. Not his best work, but he's still my favorite action hero."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "FeastMode",
        "review_rating": "1",
        "review_title": "astonishing levels of stupidity",
        "review_detailed_main": "This has to be one of the dumbest movies ever made. I love jackie chan, but man. It feels like a cartoon, something that should be a dumb PG kids movie that would still feel too cartoonish for a kids movie.\n\nThis is one of the most potent combinations of bad and dumb ever. Multiple scenes where i felt like i was getting dumber as i watched. Multiple scenes where i yelled \"WHAT!?\" or \"OMG.\" i couldn't believe it. How would they allow this stuff to be in this movie. It physically hurt sometimes.\n\nThere is so much more i can say, but i will end with the writing for jennifer love hewitt's character. They made her the dumbest character of all time. Useless and terrible with zero brains. Worst agent of all time (about 2 viewings, 6/5/2021)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "mfellipecampos",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": "Action, adventure and a lot of comedy are synonymous with Jackie Chan. Another sensational film that this guy stars in, despite having already passed O Terno de Dois Bilhões de Dólares several times on Rede Globo, the film does not lose its luster. The story is very interesting and innovative, the performances of the two protagonists are incredible, they are well matched, they made a good pair.\n\nFilm seen on November 17, 2020."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "darkman-27",
        "review_rating": "5",
        "review_title": "Not sure what to say",
        "review_detailed_main": "I was really excited for this movie, I am always excited to see any new Jackie Chan movie. When I heard Jenifer Love was in it, I thought. \"Hummm.\" We all know what she is good for now don't we?\n\nWhen the Tuxedo came out, I figured we would be treated with some great old Jackie Chan action stunts/Kung Fu action. With a little bouncy Love added in for a bonus. Needless to say, I found my self a little board durring the film. I kept waiting for it to end. If this is not a bad sign I don't know what is.\n\nWithout having to get into to much detail. Let me say that dispite that fancy \"Tuxedo.\" This movie just seemed dull and uniteresting. Chan really did not do anything, and the movie plot was very cliche. (and not in a good way). If you like to watch Love bounce arround. (and what guy wouldn't) rent hartbreakers insted. If you want to see Chan in a good action/comedy, watch the Rush Hour series...\n\ngiven a generous 5 out of 10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "yadaks",
        "review_rating": "6",
        "review_title": "Not as good as with Chris Tucker",
        "review_detailed_main": "Jackie and Jennifer.....\n\nThey just don't have the chemistry. Don't get me wrong, I love them both, but the film story / action is just not up to the par.\n\nJennifer is adorable but this film is definitely not for her to play.\n\nYada"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "claudio_carvalho",
        "review_rating": "5",
        "review_title": "A Silly Adventure of James Tong",
        "review_detailed_main": "Jimmy Tong (Jackie Chan) is hired as the driver of Clark Devlin (Jason Isaacs), a millionaire, who is also a secret spy. One they, Clark Devlin is hurt, and Jimmy decides to help him, trying to solve a mystery with Dietrich Banning (Ritchie Coster), a great supplier of potable water. Banning is indeed a villain, who intends to poison the reservoirs of water and become richer, providing good water for the population. Jimmy wears a high-tech tuxedo of Devlin, with capability of improving the most different performances. Del Baline (Jennifer Love Hewitt) is a rookie agent, who is assigned to work with Devlin. This silly movie has the attraction of the charismatic Jackie Chan and Jennifer Love Hewitt. Entertains, being very forgettable. My vote is five."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "marioxavie",
        "review_rating": "10",
        "review_title": "Typical Jackie Chan comedy, but not the action you would expect.",
        "review_detailed_main": "Jackie Chan has a certain chemistry that rubs off on anyone he stands next to, it seems. His charisma is no less then usual in this action-comedy, although, more comedy then action. Jackie Chan action fans may feel short-changed by the lack of extensive \"Jackie-style\" action scenes but true Jackie fans will be glad to see your favorite star in a new light. Chan and Hewitt make a great on screen duo and if a sequel is made, hopefully a great romantic couple as well. Chan has the capacity for romantic comedy as well as anything else he has mastered, and in this movie, he demonstrates his ability to combine his traditional trademark action with the special effects of the present. This movie will hopefully serve as a model of what Jackie's films will look like in the future, a harmony of tradition and invention."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "McHuevo",
        "review_rating": "6",
        "review_title": "A Jackie Chan movie alright...",
        "review_detailed_main": "Jackie Chan has been doing comedy-martial arts films ever since I can recall. And this is no exception. \"The Tuxedo\" blends Jackie Chan's patented fighting sequences in the James-Bondian enviroment of spies and world domination.\n\nPersonally, Chan makes me laugh. It's amazing that at 48 he can do such stunts and be funny about it. Seems like a skill he's perfected over the years. It's the only reason that kept me from rating this movie a 6.\n\nThe big downsides are:\n\n\n\n\n\nJust like \"Pearl Harbor\" with it's aerial attack sequence, \"The tuxedo\" is worth watching only to see Jackie Chan doing the James Brown. That's right: Jackie Chan doing the James Brown!!!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "swizzy16",
        "review_rating": "2",
        "review_title": "lamest movie i have ever seen!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "FinnishChanFan",
        "review_rating": "",
        "review_title": "sucked BIG TIME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Dumb Hollywood comedy adventure is far below Jackie's talents",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "SinjinSB",
        "review_rating": "7",
        "review_title": "Another entertaining film from Jackie Chan",
        "review_detailed_main": "Another entertaining film from Jackie Chan. This time he's got Jennifer Love Hewitt as a sidekick and she does a good job. You can't take a Jackie Chan plot too serious as they are mostly just an excuse to show off Jackie's stuff. This one is pretty much over the top...with the help of a highly engineered tuxedo that is totally unbelievable, they have to stop the nation's water sources from being ingeniously contaminated using water striders that have poison on their feet that will make the water undrinkable so everyone will have to buy water from the bad guy. Sounds ridiculous I know, but any excuse to watch Jackie show off his moves with a good dose of comedy. Though not great cinema, I found it highly entertaining which was it's intention. *** (Out of 4)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "4",
        "review_title": "Not Chan's worst, but overall one of his weaker efforts",
        "review_detailed_main": "I personally think The Medallion is worse than the Tuxedo, but the thing is The Tuxedo I was left cold by. Jackie Chan is always watchable, and he is one of the best things of this mediocre effort having a lot of charisma and doing what he can do. Jason Issacs also gives a strong performance, the first twenty minutes are actually great, the Macguffin is fun and the film does look good and doesn't look as though it was edited on a bacon slicer.\n\nHowever, despite these good things, The Tuxedo does fall downhill quickly. The storytelling on the whole is incredibly clunky complete with cardboard cut-outs for characters, poor dialogue, stunts that suffer from a lack of energy and unnecessary(not to mention sloppy) CGI effects that miss the point of everything Chan stands for. The film is badly paced, with a lot of rushed and slow spots that dispand from any more believability the film could have had, and the direction is bland. While Chan and Issacs are good, Jennifer Love-Hewitt is terrible. She in general is not a great actress but she is one with warmth and endearment, but with such a poorly written and undercooked role she tries way too hard.\n\nOverall, not Chan's worst, but rather weak. 4/10 Bethany Cox"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "6",
        "review_title": "Get on up.",
        "review_detailed_main": "'The Tuxedo (2002)' is a pseudo pastiche of the spy genre, an action-comedy starring everyone's favourite acting stunt-man, Jackie Chan. As is typical for the star's American work, the fight sequences and stunt-work feel heavily neutered, chopped up and enhanced with special-effects. However, this picture doesn't make a complete hash of things when it comes to its action. It's much better than a lot of its counterparts, actually. Still, the thing has its focus first and foremost on its comedy, which is where most of its value resides. There aren't any belly laughs but some of it provokes a chuckle and it's a generally enjoyable time. Chan is as affable as always and the supporting cast do a good job with the relatively hammy material they're given. The film is, by no means, mandatory viewing. It arguably doesn't even reach its own potential; its potent central concept is only explored on a cursory level. However, it's a fun and fast-paced flick that ought to keep you entertained throughout. 6/10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "alde-2",
        "review_rating": "5",
        "review_title": "Jackie does Jet Li",
        "review_detailed_main": "Now, personally I've been a Jackie Chan fan since Rumble in the Bronx, but my appreciation goes back to even his early work, with my favourite movie of his being Armour of God 2(US Title).\n\nThis movie disappoints the deeper Jackie Chan action hero fans because of the obvious wirework throughout all but the beginning of the flick. Of course, there's a reason for this, and if we saw Pierce Brosnan doing the same stunts, no one would think twice about the wirework. But this is Jackie Chan! His reputation proceeds from his past and fails to do justice with the Tuxedo.\n\nYes, it's a James Bond device, yes, it allows him to do super human things, but if you're going to see the fight scenes that made and continue to make his legend (such as the end fight scene in Armor of God 2, or the chaotic fight scenes with Chris Tucker in Rush Hour, or the free for all with Sammo Hung and Yuen Biao in Dragons Forever in the Cocaine factory [personal fav]) failed to materialize here. Tuxedo or not, only once do you see any insight into his fighting improvisational style, and even then the prop was on wires.\n\nJennifer Love Hewitt, nice to look at, didn't have to stretch much for this role. Playing the dour role of Del, she didn't get to show much acting skill at all, as the character was fairly one dimensional. Eye Candy.\n\nIn my summation of this movie, this is a Jet Li style action flick with Jackie Chan instead of the wire-fu veteran Jet Li, mainly because no one else is close to Charlie Chaplain or Buster Keaton as is Jackie. Go to see it for his impeccable timing and Keaton-esque ability."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "LetsReviewThat26",
        "review_rating": "6",
        "review_title": "jackie and hewitt shine in this comedy",
        "review_detailed_main": "Jimmy tong is just a normal chauffer, his a little helpless and hopelessly in love with a lady alled jennifer at the art gallery that dosnt even notice him. His approchedwho but dosnt known that jason issac is actually a spy and is still oblivious even when the taxi he is driving gets blown up by a bomb in a skateboard. There was humor throughout and it worked with jackie chans character. His a good actor and brings a natural awsomeness wherever he is. Jennifer love hewitt is super cute and a great handler who dosnt known jimmy is not isscas at first but they end up having a buddy type of work together. Overall a good fun film with good action and a great cast."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "The Tuxedo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "linyencita_a_mys",
        "review_rating": "8",
        "review_title": "It keeps your attention all along",
        "review_detailed_main": "Well the movie is not fantastic, but it's enjoyable and the performances are actually good, Love Hewitt was solid on her character, and Jackie Chan was good too.\n\nYou can see the movie and enjoy a lot with it, the story has a very good structure, is understandable and the fights are really funny and with a lot of action.The relationship between Jimmy tong (Chan) and the girl at the gallery is predictable since the beginning, and you start to enjoy ever since he left the gallery, and he gets the job as the driver of Clark Devlin.When Del Blaine appears, you can see immediately her strong personality, that crushes with Jimmy Tong when she has to work with him without knowing that he was actually the driver of Clark Devlin, who takes his place because of a car accident."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "trogganbuck",
        "review_rating": "6",
        "review_title": "Not exactly one of Jackie Chan's best.",
        "review_detailed_main": "This is not really a great Jackie Chan flick. Not the same high impact stunts we are used too . We also didn't get to see his funny side as much. He does however have a pretty good James Brown scene. Although Jennifer Love Hewitt is incedibly gourgeous, she can't fight her way out of a paper bag. She looked totally out of place and slowed Jackie Chan down.\n\nWait for the DVD !"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "bingbingbaobei",
        "review_rating": "1",
        "review_title": "So, So Bad",
        "review_detailed_main": "I saw this at the dollar theatre during college. It is easily the worst film I've ever seen. So for those looking for a bad film, THIS IS IT!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "abarsby",
        "review_rating": "",
        "review_title": "Comes with optional barge pole",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "TheHande",
        "review_rating": "2",
        "review_title": "A Horrific Film",
        "review_detailed_main": "'The Tuxedo' is one of those occasions where you really wish that Jackie Chan would have stopped for a second to review the script of the film and realise just how utterly stupid it was. Instead we're treated to a film that is laughable, not because it's a good comedy, but because it is such an unbelievably bad one.\n\nFirstly the humour of the film is just too childish to contemplate. This comes from the fact that the whole plot is barely clinging to credibility even for crazy comedies. Instead of being farcical, the film turns into a farce every time someone kicks Jackie in the crotch or Jack kicks someone else in the crotch. The sexual innuendo is redundant and tiresome to listen to.\n\nEven Jackie comes off as a total ass for much of the film, rather than a lovable or even a vaguely sympathetic character. Additionally the film's CGI is shamefully bad and shows how much devotion the crew actually had for the film.\n\nAll in all The Tuxedo is an utterly miserable piece of cinema. Lesson learned, never watch a spy/comedy-film that opens to a deer pissing."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "omen-9",
        "review_rating": "7",
        "review_title": "In a month I won't remember it",
        "review_detailed_main": "Well it's fast, sometimes funny and not too long. Not much but for good start of the evening with some friends it's enough. It's a movie good for TV so if you're not a big fan of Jackie Chan you'd better choose something else. The story is very weak, acting irritating and British accent is definitely overused. There are some funny moments and thanks to them it's not waste of time. Still if there was something better I wouldn't go to see this."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "callidusman",
        "review_rating": "2",
        "review_title": "I'm glad I didn't have to pay for this!",
        "review_detailed_main": "I just saw a free screening of this. As I was walking out at the end (it was rough sitting through until the end but I'm pretty durable), I told the person I was with that I'm extremely happy that I didn't have to part with any $$$ to see this. There were 3 or 4 times when I chuckled at the juvenile storyline. The biggest problem with the movie is that the storyline (even though it's juvenile) is extremely hard to follow. The segues are abrupt and there's nothing to link what just happened with what is currently happening.\n\nThe only good thing about the movie is that Jennifer Love Hewett looks ravishing in most every scene she appears in."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Tweekums",
        "review_rating": "7",
        "review_title": "A silly but fun spy spoof",
        "review_detailed_main": "This spy comedy is centred on Jimmy Tong, a shy taxi driver, who finds himself recruited to drive billionaire super-spy Clark Devlin. Devlin is investigating Dietrich Banning, the owner of a bottled water company who is suspected of plotting to make sure only his water is drinkable. When Devlin is hospitalised Jimmy ends up taking his place. He dons Devlin's tuxedo and discovers it is no ordinary piece of clothing; it is programmable to make its wearer a super-spy with all the skills that entails... and a few more besides. Jimmy works with Del Blaine, a female agent on her first mission in the field who mistakes him for Devlin and can't understand how the man she is working with got his great reputation. Still they must work together to thwart Banning's dastardly plan.\n\nIf you come into this hoping for lots of Jackie Chan's trademark brilliantly choreographed martial arts you may be somewhat disappointed as most of his action is clearly CGI-improved to show that it is the suit fighting not him... however there is more to Jackie Chan than martial arts; he has great comic abilities without ever feeling forced and this film takes advantage of that. The concept is clearly very silly but thankfully it provides plenty of good laughs as it spoofs the genre without going too far. Jennifer Love Hewitt is solid in the more 'straight guy' role of Del Blaine and Jason Isaacs is good as the real Devlin, even if his role is relatively small. The villains plot is clearly preposterous but it fits in with the silliness of the film; pity the villain wasn't a little more menacing thought. There isn't much to cause offence so this is probably suitable for younger viewers. Overall I enjoyed this; one has to be in the mood for silliness though."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "5",
        "review_title": "I got mad skills",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Victor Field",
        "review_rating": "6",
        "review_title": "Jackie Chan and Jennifer Love Hewitt keep \"The Tuxedo\" from coming apart at the seams.",
        "review_detailed_main": "The first scene of \"The Tuxedo\" has a fawn standing in a stream. A nice, gentle opening... and then the creature urinates in the stream to usher in the opening credits. As Jennifer Love Hewitt's character says later on, \"That passes for humour around here.\"\n\nIn fairness, the movie isn't quite as crude all the way through, but this action-comedy-spy caper really needs some alterations as far as its script (by the Michaels Leeson and J. Wilson) and direction (Kevin Donovan) are concerned - the story of NY cab driver Jackie Chan getting recruited as a superspy's chauffeur, acquiring his boss's specially engineered tuxedo when the man himself is incapacitated, and joining forces with equally amateurish but eager young spy Jennifer Love Hewitt to get to the bottom of a fellow agent's death could have been a treat if the writing had been better. And if there had been a director who knew how to handle action and comedy; Chan's breakneck drive through the streets of New York and a car/skateboard chase are particularly poorly done.\n\nThe movie does improve as it goes along, with Chan making you believe his character (who's hopeless at martial arts) really is being manipulated by the tux, especially in the \"Pants Only\" scene - this movie does give him more special effects help than any of his other ones, but given that the plot involves people dying of dehydration and a swarm of insects it's forgivable; plus while he's not as old as Charles Bronson (who was still doing action movies for Cannon in his 70s, let us not forget) he can be forgiven for wanting to lighten the load a bit. Jason Isaacs is entertaining as the real superspy, andas our hero's partner JLH is fun and as appealing as ever - she's come in for some flak in other comments here and elsewhere, but she does all right; I think we should all thank heaven we got her and not Chris Tucker again. (And not only because he's not as sexy as she is.)\n\nNone of Jackie Chan's Western movies have improved on his Asian ones (including \"Rush Hour\"), and this doesn't change things, but at least \"The Tuxedo\" (unlike \"Shanghai Noon\") isn't overlong, and it doesn't (unlike \"Rush Hour 2\") forget what it's supposed to be... it sets out to be an entertaining movie, and in the end that's what it is. Although that said, I can live happily without any more references to John Travolta in \"Saturday Night Fever.\" (As opposed to any more gratuitous closeups of Jennifer Love Hewitt's body, but that's another matter.)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "petter157",
        "review_rating": "1",
        "review_title": "This is very very stupid, sad also",
        "review_detailed_main": "Jackie Chan has reached a new low. I didn't thought he could do worse than Rush Hour 2, but he sure proved me wrong. This film is amongst the most lousy I have seen in my entire life!!.\n\nIt's even worse than his old american attempts (The Prospector and Battle Creek Brawl)... Hell it's even worse than some of Jet li stupid american movies. I simply don't understand how he could ever do this film.\n\nI'm a big fan, and have seen all his Hong Kong movies (loved them all), but since he hit America it has just been one crappy film after another. He haven't made a good film since Accidental Spy - Now I'm just looking forward to the next chinese production; The Medallion.\n\nAvoid this movie, and most likely the next 1000 american Jackie Chan films\n\nPS. Sammo come back and save this guy (I just hope Gordon Chan can anyway)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Lochness_30",
        "review_rating": "9",
        "review_title": "Another Jackie Chan Classic!",
        "review_detailed_main": "Saw a screening of The Tuxedo yesterday (September 24, 2002).\n\nSome movie stars create movie after movie. These movies become predictable, with the same style of repetitive action. If you'll excuse my language, \"Same crap, different pile\". However, I'm happy to say, that Tuxedo isn't one of these movies!\n\nTuxedo is a perfect blend of fresh action, adventure and humour! If a movie can make me literally laugh out loud, it's a good movie. But this one gets you going on several occasions. The action and adventure portion is non-stop and witty. For example, in one scene, Jimmy Tong is wearing his pants, but not the jacket. The pants spring to action, leading Jimmy to fight with only his legs. You've got to see it to appreciate it.\n\nIt definitely worth the price of admission! 4 1/2 out of 5!!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "JinxsterJones",
        "review_rating": "6",
        "review_title": "It's a JC movie!",
        "review_detailed_main": "Since 1986 I have been watching (& watching!) Jackie Chan movies at every possible moment! I have collected every (I think) film he's made/appeared in since 1970. I love all of them. Some of them are pretty naff but I still find something to enjoy about them. Now, The Tuxedo, there were high expectations which unfortunately are not quite met. But it doesn't stop this film from being entertaining. Just leave the brain at home. JC has never really tried to make Oscar winning movies. He just wants to entertain. So stop panning this movie unless you have something genuine to say. JC is 49 years old this year (still fitter than this 31 year old writer!!), can you really expect him to be putting his body through the same punishment he was 10 or 20 years ago? No, is the simple answer, so what if there's a little camera trickery and CPU effects to enhance the film. JC's just out to make movies and entertain and Tuxedo does what it says on the tin! Lets face it, JC made films in the 70's which totally bombed at the box office, but are now considered classics. So all you negative critics may just be helping make this another classic!!!!!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "kevin_robbins",
        "review_rating": "2",
        "review_title": "There are a few good fight sequences and funny lines but not enough to make up for how cheesy this movie is.",
        "review_detailed_main": "The Tuxedo (2002) is a movie I watched again for the first time in a long time on HBOMAX. The storyline follows a cab driver who meets the right person at the right time who offers him a significant raise to become his personal driver. His new boss ends up being a secret agent who does dealings with the wrong people as part of his mission. The driver puts on a suit one day that causes him to have extravagant martial arts capabilities. When his boss goes missing he joins another agent to help track his boss down. This movie is directed by Kevin Donovan (What would Trejo Do) in his directorial debut and stars Jackie Chan (Rush Hour), Jennifer Love Hewitt (I Know What You Did Last Summer), Jason Isaacs (Harry Potter), Peter Stormare (Fargo), Romany Malco (40-Year Old Virgin) and Debi Mazar (Empire Records). The storyline for this picture is absolutely dreadful...so is the acting. Jennifer Love Hewitt was miserable to watch in this film. Almost every scene with her was awkward and painful. The martial arts scenes were also hit or miss. There are a few good fight sequences and funny lines but not enough to make up for how cheesy this movie is. Overall, I would recommend skipping this movie and would score it a 2/10."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "drunkedwina",
        "review_rating": "",
        "review_title": "A real shame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "gothic-child",
        "review_rating": "5",
        "review_title": "Average Jackie Chan movie....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Movie-Misfit",
        "review_rating": "6",
        "review_title": "Enjoyable flick, but not perfect!",
        "review_detailed_main": "As Jackie Chans number one fan... (aren't we all), I knew the move to Hollywood was going to put a dampener on the man we all know and love!\n\nRush Hour, as successful as it was, was a great vehicle for him, yet still managed to restrict the clown prince of kung fu who OWNED each of his films up to then.\n\nWith his Hollywood pictures, it feels as if Jackie is taking one step forward and one step back - never really being allowed to show the true star that he really is!\n\nThe Tuxedo, as one of his earlier US films, falls somewhere in between...\n\nAlthough shot in Toronto, this film is dripping with pure Hollywood cheese that really rattles my cage, and some of its main stunts are cut and repeated so much it takes away from the work involved.\n\nOn that note, and knowing that it is the Tuxedo that makes Jackie fight (I know - ridiculous), he is still held back from some incredible 'what- could-have-been' moments, as he has that many wires strapped to him!\n\nPersonally, if it was my film, I would have put the amazing Sammo Hung in the role. Allowing such a suit to give his portly butt those moves would have been stronger and funnier.\n\nThat said, The Tuxedo does get viewed in our house often. The kids love it, and I haven't tired of seeing it yet... Enjoyable!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "HelenMary",
        "review_rating": "4",
        "review_title": "Not one of Jackie Chan's best",
        "review_detailed_main": "Jackie Chan is fabulous, I think he's really funny, can do incredible stunts and is always entertaining but this film is not his best. It's not anything to do with him, just the other actors are a bit cheesy (not Jennifer Love-Hewitt, she's fine) and the story is pretty stupid. I guess it is a children's film, sort of, but it's got a little bit more adult humour than one expects from Jackie Chan, but I liked that.\n\nThe SFX aren't very good, the wire work is obvious, and whilst it is clearly a fantasy sci-fi it's just too silly to be sensible and I couldn't get involved or care anything for the characters or the disaster they were trying to avert.\n\nWatch it, but don't expect too much."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "MsMoby",
        "review_rating": "6",
        "review_title": "Not Jackie Chan's best, but entertaining nevertheless",
        "review_detailed_main": "Lots of fun, but you have to like Jackie Chan movies, which I do. Not too impressed with Jennifer Love Hewitt, whose character seems to waffle between being physically inept and being a martial arts expert---that could be the fault of the director, though. I'm also tired of the old, old cliche that putting a pair of glasses on a Barbie doll turns her into an unattractive braniac, so that has something to do with my annoyance with her as well. Taking those things into account, she probably did a perfectly fine job.\n\nAll in all, not quite as good as previous Jackie Chan movies, but an entertaining way to spend a couple of hours."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "zardoz-13",
        "review_rating": "5",
        "review_title": "Unfit For Jackie Chan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "7",
        "review_title": "Great fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Enchorde",
        "review_rating": "5",
        "review_title": "Typical Jackie Chan movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "limpfan106",
        "review_rating": "10",
        "review_title": "Cheesy old school goodness",
        "review_detailed_main": "I saw this on netflix and I was like damn I didn't know Jackie Chan and Jenifer Love Hewitt did a movie together. Knew it would be cheesy af, was not disappointed.\n\nIt's worth it just for the part where a whole team of secret agents blocks off a busy city block and attacks innocent people just to give Jackie Chan a chance to hit on a Chinese girl he thinks is hot. I mean they literally have a guy repel from a building just to knock out a guy biking down the street, and they taze another guy that was gonna block Chan... and that guy is Colin Mockery from Whoes Line is it Anyway. Oh man, so funny... like not in they way they intended for it to be, but better. FYI I wouldn't call that a spolier because it's totally irralavent to the plot, but it shows how goofy this movie is."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "evoleddy",
        "review_rating": "6",
        "review_title": "Left puzzled...",
        "review_detailed_main": "Well, I went into the theaters with the excitement, because there was a new Jackie Chan movie. I left the theater somewhat puzzled, because I didn't see a Jackie Chan movie.\n\nThis is not a Jackie Chan movie in the traditional sense. Jackie Chan movies are the great ones such as Police Story, First Strike, The Drunken Master series and Rumble In The Bronx. The Tuxedo is an American 'action' comedy that just so happens to have Chan in it.\n\nAll the stunts were done with wires, and it is very apparent. There is maybe 5-10 minutes of fighting and even then stupid American directing ruins them. Too much editing and cutting, and the camera is too close, so much of the fighting is lost.\n\nJLH did not belong in the movie; she just doesn't fit IN the movie. It was an extremely odd match up. Although she provides the movie's eye candy, I would rather have the good fights and stunts that the typical Jackie Chan movies are known for.\n\nThe story is somewhat weak, there was a weak buildup of what was supposed to be a real evil villain.\n\nI left the theater disappointed because I saw a really bad action movie. Maybe Jackie will go make some Chinese movies again so there can be another good Jackie Chan movie. Not this poor substitute.\n\nI can't stress this fact enough; this is not a Jackie Chan movie. This is an American 'Action' Comedy, which happens to star Jackie Chan. Little fighting, no true stunts, lots of wirework, and a poor story. I recommend just renting some of his better movies instead."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "BA_Harrison",
        "review_rating": "4",
        "review_title": "The Tux sucks.",
        "review_detailed_main": "Taxi Driver Jimmy Tong (Jackie Chan) is given the job of chauffeur to smooth secret agent Clark Devlin (Jason Isaacs), but after a bomb blast almost kills Devlin, Jimmy enters the world of espionage posing as his boss. With the help of sexy scientist Del Blaine (Jennifer Love Hewitt) and the use of Devlin's top secret, gadget laden tuxedo, Jimmy tries to defeat Dietrich Banning, a maniac plotting to poison America's reservoirs.\n\nI've been promising to show my 8-year-old son something from my kung fu collection for quite some time now, but due to the high level of violence in most of my martial arts DVDs, the majority were not really suitable; in the end, I gave him the choice between two Jackie Chan films: Twin Dragons or The Tuxedo. Unfortunately, he chose the latter, one of the Jackie's more recent films which I had avoided so far thanks to its being mainstream Hollywood fare aimed at a family audience. Still, I was willing to give it a go since it co-starred Jennifer Love Hewitt, whose looks and magnificent cleavage make even the lamest movies easier to endure.\n\nAs I expected, this film features very little in the way of decent action or story: the plot is awful, the comedy weak, the fight scenes far too reliant on special effects and wire work, and Peter Stormare and Debi Mazar are totally wasted in a throwaway roles. As I had suspected, curvacious Jennifer Love Hewitt is easily the breast thing... err, I mean the best thing about the whole rather sorry affair.\n\nI rate The Tuxedo a miserable 2/10, plus a generous extra pair of points for JLH's extra-generous pair of points."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tina_boland13",
        "review_rating": "",
        "review_title": "Fairly Dull",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Space_Mafune",
        "review_rating": "3",
        "review_title": "Disappointing Hollywood-ized Chan.",
        "review_detailed_main": "A hard luck cabbie, who just cannot seem to catch a break, named Jimmy Tong (Jackie Chan) is hired to be the limousine driver for top secret super CSA agent/spy extraordinaire Clark Devlin when he impresses another CSA agent named Steena (Debi Mazar) with his fast driving expertise. However, when Devlin winds up gravely injured following an explosion, he asks Jimmy to take over his assignment and tells him to wear his specially equipped tuxedo. This tuxedo as it turns out isn't ordinary in the least. In fact, it's a technological marvel capable of providing its user with whatever skill is desired, whether it be fighting, dancing or gun assembly, just by selecting it from a fancy wrist-watch also included in the outfit. Yes, Jimmy Tong finds himself suddenly thrust into a new world of excitement by assuming the Clark Devlin role. Eventually he is paired up with a new CSA agent out to prove her worth in Del Blaine (Jennifer Love-Hewitt). Together they are to bring down whatever corrupt scheme of world domination one Dietrich Banning (Ritchie Coaster), head of a bottled water empire, may be planning. Only can Jimmy find the confidence within himself to get the job done?\n\nIn many ways, this is something of a poor imitation of the Pink Panther films, only dumbed down even more to appeal to a mass audience with such an emphasis on not offending any sensibility, it likely won't appeal to many in reality. As was done with the Pink Panther films, director Donovan here tries to blend action with comedy with the emphasis being on the physical comedy itself. You would think given the involvement of Jackie Chan, it would be natural fit but this one only offers up disappointment. The fights are uninspired and forgettable with too much wire work. The attempts at humor either fall flat or are outright unfunny or they play things way too safe. Jennifer Love-Hewitt is terribly miscast as the heroine. Not only is she thoroughly unconvincing in her role but her character never comes across as anything but perpetually bitchy. This movie's best scenes actually involve Jackie Chan doing uncharacteristic stuff like dancing and performing on stage and his early cab and limousine driver scenes. The theme of self-confidence could have been used better but here is one of the film's better elements. Jason Issacs brief Bond-like Clark Devlin appearance also proves very entertaining and is much too short-lived. In the end, this just isn't the Jackie Chan or even Jennifer Love-Hewitt fans will want to see."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "eddy_currents",
        "review_rating": "6",
        "review_title": "Worth a few laughs",
        "review_detailed_main": "If you accept the ridiculous premise that this tuxedo could do all the things in the movie (eh why not, it's a fantasy movie), and an aggressive-driving nice-guy cab driver could be plucked off the street and hired to drive a superspy around without first getting extensive training and security clearance (umm, sure), and a pretty female lab rat suddenly becomes a seasoned superspy (this happens a lot in spy movies), then the rest of the movie makes sense.\n\nChan plays the same character he always plays, which is fine. His action sequences are fun to watch as always, although definitely not his best (see Rush Hour and of course Rumble in the Bronx). The villain is 2 dimensional and doesn't receive much screen time. Love-Hewitt shines in a comedic role, but I found her constant insubordination unbelievable and annoying. That was no fault of hers, she did a great job with the lines she got.\n\nI really liked the tongue-in-cheek comment on bottled water in the title scene. Chan's send-up of James Brown was really well done, although the scene that followed where the pair tried to get information from the bad guys was pretty silly. Kinda ruined it.\n\nWorth a few laughs. If you like Chan or spy movie spoofs, see it in a cheap theatre or rent it."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "3",
        "review_title": "Even a Tuxedo Cannot Render Any Originality.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "gunnergrady",
        "review_rating": "6",
        "review_title": "If you've got nothing better to do, this wouldn't be the worst thing to watch.",
        "review_detailed_main": "As with all of Jackie's recent(ish) American films, wirework threatens to render this one unwatchable. Fortunately, Jackie is still charmingly adorable as the hapless Jimmy Tong and the gorgeous Jennifer Love Hewitt as Del Blaine can quite easily hold the attention of the straight male audience.\n\nThe dialogue is not too bad and JLH's performance is pretty good, especially her impersonation of the air headed bit player, Cheryl. Jackie's delivery of his own lines is what you'd expect in an English speaking film, but he was still funny. Of course, not as funny as his performance would have been had it been a cantonese speaking film in which his comedic style is, understandably, more natural.\n\nAction-wise, this film is pretty much a dud and leaves the Jackie Chan fan with an urge to rewatch Project A or Armor of God for a dose of the good old days to wash away the sour taste of disappointment. Still, its not as bad as The Medallion.\n\nAnd any film with Bob Balaban in it can't be entirely bad (I'm a big fan of his as well). To be honest though, its not a great film, but its not a terrible one either. It is saved somewhat just by Chan's presence and JLH's performance and some very nice dresses. Probably not worth paying money to see, but if its on tele and you've nothing better to do, its a decent time waster.\n\n6/10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "leonblackwood",
        "review_rating": "3",
        "review_title": "Looks impressive but the comedy is bad. 3/10",
        "review_detailed_main": "Review: This is a big budget action/comedy movie with Jackie Chan playing a New York cab driver, Jimmy Tong, who gets an offer that he can't refuse! He's known for getting his clients to there destination with speed, so when a New York high flyer, Steena (Debi Mazar), jumps into his cab, she offers him double the fee if Jimmy can get her to her destination by the time she has finished putting on her make-up. After being thoroughly impressed with his driving, she offers him a job to be a chauffeur for millionaire, Clark Devin (Jason Isaacs), but he has to follow the many rules that Steena has given him. He soon builds a relationship with Clark but there car is targeted by henchmen, who want Clark dead. Jimmy tries his utmost to escape from a remote controlled car, which has a bomb attached to it but Clark gets severely injured in the explosion and ends up hospitalised. Clark gives Jimmy clues about who attempted to murder him but as he is unable to talk properly, Jimmy puts together the clues to try and find the murderer. When he gets back to his house, he goes through his possessions to try and piece the mystery together and he comes across a special Tuxedo, which is controlled by a wrist watch and can give the owner special powers. He then gets a call from a undercover, inexperienced field agent Del Blaine (Jennifer Love Hewitt), who wants to meet up with Clark to talk about a special mission. As she hasn't met Clark before, Jimmy poses as Clark in the special powered Tuxedo to try and take-down an international terrorist, Dietrich Banning (Ritchie Coaster), who plans to take over the world by putting chemicals in water. He then finds out that it was Dietrich who attempted to kill his boss so Jimmy has personal reasons to destroy Dietrich. After going undercover and worming there way into his operation, there cover is blown and they have to fight against Dietrich, who also gets his hands on a powerful Tuxedo. The action wasn't that great and the jokes aren't that funny. Chan makes a bit of a fool of himself by dancing, singing and making the Tuxedo take over his body and I wasn't that impressed with Jennifer Love Hewitt, who also wouldn't stop whining throughout the movie. On the plus side, you can tell that there was a big budget because it does look quite good and the concept was half decent but the comedy did get on my nerves after a while and it became more silly than funny. I did like Jason Isaacs, who would make a brilliant Bond and I found Ritchie Costner a convincing villain but the overall movie could do with a rewrite with some decent actors playing the leads. Disappointing!\n\nRound-Up: This movie was directed by Kevin Donovan, who has only directed 4 shorts behind the camera. He was lucky to get the chance to work with Jackie Chan, with such a big budget but he failed to make a unique film that will stand the test of time. This movie did make its money back at the box office so it wasn't a total failure but I personally think that people were starting to get a bit fed up with Chan's style of comedy and they just wanted to see the action scenes more than the jokes. His brief Western encounter did bring out some decent movies, like the Rush Hour franchise but I much prefer his earlier, authentic movies which had some unbelievable stunts and epic action scenes.\n\nBudget: $60million Worldwide Gross: $105million\n\nI recommend this movie to people who are into their action/sci-fi/martial arts/comedies starring Jackie Chan, Jennifer Love Hewitt, Jason Isaacs, Debi Mazar, Ritchie Coaster, Peter Stormare and Romany Malco. 3/10"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "seltzer",
        "review_rating": "6",
        "review_title": "Could have been cool.",
        "review_detailed_main": "This is a great sketch for a film, but seems unpolished. After the incredible setup that centers around an amazing tuxedo with essentially nanotechnological elements, a first for mainstream cinema, it completely fails to be the really cool science fiction film it could have been. Instead, they made a movie that is run of the mill spy spoof fodder, with dialogue dumbed down and some flashes of Jackie Chan's kung fu genius, but he isn't allowed to really show his chops, and the fight scenes are almost hilariously short. Jennifer Love Hewitt is tolerable if a bit weirdly cast as an agent of the CSA, a parallel intelligence organization that also fails to be all that it could be. She is awfully cute, though even this aspect of her talent is wasted here, reduced to juvenile humor about peeping toms and groping. When a film like this is relying on the hot actress to buddy up with the kung fu legend and the hotness and kung fu are crippled, you get this movie. Probably a great rental if a bunch of people are watching."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "manilla-73",
        "review_rating": "3",
        "review_title": "WHY!!!!",
        "review_detailed_main": "I have been a fan of Jackie Chan for a while now and I have to wonder exactly why he made this film.\n\nJackie has always made entertaining movies with his blend of slapstick, physical movements and of course the martial arts that he performs so well (maybe second only to Jet Li). But this film has nothing to entertain.\n\nThe action is not well photographed and although the original fight scenes and action set pieces may have been well designed the photography and more importantly doesn't show them to the high standard we have come to expect from a Jackie Chan movie.\n\nThe only thing that I can see is the fact that Jackie must have been offered a fee that was impossible to say no to.\n\nI wouldn't have said that this is a sell out movie but the more Hollywood movies Chan does the more it seems to dilute what has been so far a reasonably good career and cross over from Hong Kong to western mainstream.\n\nLets hope Jackie likes the movie as much as I did and never lowers himself to star in anything this bad again."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "firefox-CWN",
        "review_rating": "10",
        "review_title": "A fashionable action-adventure comedy!",
        "review_detailed_main": "This was a movie I was waiting to see for over a year and I have to say this. My wait kindly rewarded with a spectacular action-comedy picture that as classy as the tuxedo itself. I liked that the actual plot served as an original creation of a cookie-cutter Hollywood. It was also nice that this movie retained a PG rating. Even though, some parents may want to be aware that there are about two scenes which may not be suitable for very young children. But for the most part, this movie is an excitement factory for all ages.\n\nThe lead actor, Jackie Chan, performs another timeless and ageless role handsomely. Along with the trademark martial arts, Jackie Chan's character, Jimmy Tong, was the funniest one I have ever seen him portray as his character offers plenty comedic moments. This role is different than the roles we have become accustomed to seeing Jackie Chan perform. Jimmy Tong was clumsy at times, brilliant at other times, as this reluctant hero becomes just so likable in a equally impressive tuxedo that turns him into a mix between Spiderman and James Bond. After watching this movie, it is no wonder why Jackie Chan is revered by many fans; only he could be suited for this tux.\n\nThe leading lady, the enchanting Jennifer Love Hewitt, takes on her complex character of Del Blaine with incredible talent and succeeded in delivering the array of the character's emotions and thoughts. Del Blaine would also be known to use her established beauty to manoeuvre through many tough times. This performance by this great actress proves how terrific an actress JLH is yet been seen for by many incomprehensive critics.\n\nIn the fight scenes, The traditional martial arts moves of Jackie Chan are present in every fight scene. But everyone else in the movie performed just as masterfully in these scene, especially JLH. As in all Jackie Chan movies, this motion picture provides a final action scene which will make you remember the Tuxedo. Some matrix-like wire acts are commissioned but overall, they end up enhancing the martial art skills.\n\nIn conclusion, great movie which I found far more entertaining than many movies this year.\n\nTo DreamWorks: Please make a sequel and remember that Toronto is open."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "briancham1994",
        "review_rating": "6",
        "review_title": "Silly fun",
        "review_detailed_main": "Jackie Chan is usually known for silly irreverent fun but perhaps this one goes too far in that direction. It doesn't live up to his other material with flat comedy and action. The story is also too typical and uninteresting."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "5",
        "review_title": "law(less) suit",
        "review_detailed_main": "If a movie stars Jackie Chan, then there's a 90% chance that it's going to be a series of wacky stunts with a silly plot attached. That's definitely the case with \"The Tuxedo\". The main difference here is that Chan's character isn't a guy who knows martial arts; instead, a fancy outfit gives him nearly limitless abilities.\n\nAs for Jennifer Love Hewitt, most of her scenes look like excuses to show off her body (she's definitely a babe here). Basically, it's the sort of movie that lets you shut your brain off for a few hours while the star does a bunch of zany stuff. I suspect that they had a lot of fun filming it. Certainly one that you'll enjoy."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "derekb27",
        "review_rating": "",
        "review_title": "Why, Jackie, why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "loveagoodstory",
        "review_rating": "3",
        "review_title": "Hollywood doesn't know what to do with the brilliant Jackie Chan",
        "review_detailed_main": "You'd have thought Hollywood could have taken Jackie Chan's brilliant understanding of performance martial arts, action and comedic timing into terrific films. But it never seemed to get him and it shows in this film.\n\nIt's the pitifully weak central idea, ludicrous plot and weak dialogue that take a great cast of actors (Jennifer Love Hewitt, Jason Isaacs, Peter Stormare) and wastes them in idiotic plotlines. JLH's characters is put through a series of tired old knob-joke style lines that show the writers had run out of ideas. Which is a tragedy with all the skills they had on offer and the cast can't be blamed for that, apart from for signing up maybe. They should have just run instead of taking the money first.\n\nJackie Chan seems to get pushed into the second support role, presumably because Hollywood doesn't think he's leading man material. They just don't seem to know what to put him in there."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "allan-36",
        "review_rating": "7",
        "review_title": "Formulaic Jackie Chan movie lives up to previous films.",
        "review_detailed_main": "Predictable, contrived, hokey, yet THE TUXEDO entertains. Jackie Chan delivers another easy-to-go mix of action, lovely women and laughs that will attract filmgoers of all ages. Jennifer Love Hewitt is a good foil (funny, smart and sexy) for the amiable Chan. Without giving away too much of the plot, the tuxedo transports our Ordinary Joe Chan into a wild adventure (something to do with corrupt water). A surprise cameo by James Brown is a plus. Take the family. Take a date. Or rent the DVD."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Angelus2",
        "review_rating": "4",
        "review_title": "Doesn't work",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "mareikura",
        "review_rating": "5",
        "review_title": "Two movies in one ....",
        "review_detailed_main": "This was like watching two movies .. One with Jackie Chan - witty, interesting storyline (although a little predictable and shaky in places) and the other with Jackie and Jennifer Love Hewitt - so bad it was painful. The director must have said to her \"make your character as whingy and nonsensical as possible\" because she nailed that portrayal down perfectly.\n\nThe movie had moments of that ole Jackie Chan brillance. I think they tried to make Hewitt's character into the female equivalent of his successful teamings with Owen Wilson - needless to say they should keep on lookin! If he had had a better co-star (e.g Debi Mazar - shes got quite a witty sarcasm which she can carry off) to work with, I think the movie would have been received better.\n\nSo if your a Jackie fan ... probably not for you, if your a Love Hewitt fan, probably your cup of tea!!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "Silly fun movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tonix7",
        "review_rating": "8",
        "review_title": "Not that bad..",
        "review_detailed_main": "Sure I've seen better films with Chan but I still liked it. It's not much of surprises and a simple plot but worth seeing a Friday night. Chan still has that sense of humor no other martial arts actor can match.\n\nA super tuxedo, would't you like to wear one? You will after seeing this one! When his new boss is wounded in a attack he gives John(Chan) the assignment to finish a mission and wear his special tuxedo. Gave me bit of a Dr Gadget feeling. See it, its worth it."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "behnamboogi",
        "review_rating": "5",
        "review_title": "NormaL",
        "review_detailed_main": "Jimmy Tank is the simple driver of the famous millionaire Clark Devlin. Due to an accident, Clark is hospitalized and Jimmy, who is sent to bring some of his things to his house, accidentally wears Clark's suit and realizes that he has strange powers and... Tuxedo movie (The Tuxedo) is a 2002 action, comedy and science fiction film directed by Kevin Donovan. In this movie, Jackie Chan, Jennifer Love Hewitt, Jason Isaacs, Debbie Mazar, Richie Caster, Peter Strummer, Romani Malko, Daniel Cash, Boyd Banks, Bob Balaban, Christian Potenza, James Brown, Scott Yaffe, Noah Danby, Colin McRae, Kim Roberts and others played. This film produced by Dreamworks Pictures won the best actor and the best actress and was also nominated for the best actor with Jackie Chan at the Kids' Choice Awards in America."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "soccerbabe585",
        "review_rating": "",
        "review_title": "Suspend all logic...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tabuno",
        "review_rating": "4",
        "review_title": "Dumb Movie Saved By Hewitt and Some Funny Lines",
        "review_detailed_main": "28 September 2002. Sadly, this isn't Jackie Chan's best nor even good movie. The pacing and plot seems to fall apart about a fourth of the way into the movie becoming dumb and dumber. What audiences expect from Jackie Chan doesn't get full play here and the best part of the movie is Chan's famous closing credits. Hewitt gets some great lines and acting parts and saves the movie from becoming a complete waste. The movie had potential, the number of funny lines are numerous, and the effort laudable, but unfortunately, neither Hewitt nor Chan can save this movie. More of Devlin's presence, the superspy, would have been helpful in a movie such as this but Chan had to suffer having to somehow carry the whole load of the irony in this movie, better shared with another actor."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Teewurstmann",
        "review_rating": "4",
        "review_title": "poor jackie chan, Jennifer Love Hewitt ruined this little movie",
        "review_detailed_main": "4 out of 10 This movie had a good concept, an idea that could have worked. If it just wouldn't have been for the annoying I-am-a-sexy-woman-but-still-tough-and-funny Jennifer Love Hewitt. She ruined this little flick. The scenes with Jackie alone are all pretty funny. But as soon as Hewitt tries to be funny it all goes down the drain... What a pity!\n\nBetter go watch Rush Hour again!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "Sad and not funny",
        "review_detailed_main": "Jimmy Tong (Jackie Chan) is a taxi driver who can't seem to ask his dreamgirl out. Steena (Debi Mazar) comes in and hires the fast driver to be the chauffeur for super wealthy Clark Devlin (Jason Isaacs). They become friendly but Jimmy doesn't know that Devlin is a superspy. A bombing puts Devlin in the hospital. Jimmy goes back to the mansion and puts on the tuxedo which turns out to be a high tech gear with extraordinary powers. Del Blaine (Jennifer Love Hewitt) is support at CSA headquarters who mistakenly assumes that Jimmy is Devlin as Jimmy goes on assignment against the villain Dietrich Banning (Ritchie Coaster) and his plan to take over the water supply.\n\nJackie Chan is not a good comedian in English. Some people make that mistake from his work in the Rush Hour movies. Essentially, he is the straight man in those movies. He still has difficulties doing non-physical comedic work in English. This just puts all that up front. The location work isn't the best trying to make the Toronto NYC transition. The story makes very limited logical sense. There was a chance that this movie could go full camp when Jackie Chan starts doing James Brown. However this is more sad than funny."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "bogsbautista",
        "review_rating": "8",
        "review_title": "All I can say is that everyone at the moviehouse was laughing hard.",
        "review_detailed_main": "Not much of a story but seriously what do you expect from a Jackie Chan movie? At least they didn't focus too much on the already much-abused 'evil genius plotting a world-spanning scheme' theme and simply focused on what Jackie can do -- make a movie where he is the SPECIAL EFFECT. I had lots of laughs while watching this movie. The action isn't as nonstop as the Rush Hour movies but there is enough to go by. I wasn't disappointed, and by their reaction, so were the rest of the people who watched this one with me. I'm glad I didn't listen to the critics' reviews. :)"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "knickedge123",
        "review_rating": "5",
        "review_title": "no chemistry between Jackie and Jennifer",
        "review_detailed_main": "After watching The Tuxedo on opening night, I could say I'm quite dissapointed. A movie headlined by Jackie Chan really needed something with chemistry and Jennifer Love Hewitt isn't it. This movie was definitly marketed for ten year olds rather than the usual Chan fan. I went to see it for Jackie Chan. Jennifer Love Hewitt looks great, but her acting career really took a back step. Maybe that new musical career should be permanent. Also, the main plot of the movie really isn't ever announced in the movie. You have to assume what the problem is. They never say what the problem is (I dont wanna give anything away). Some of the stunts with Chan are so fake, it doesn't seem like a Jackie Chan movie. Anyway, the movie needed more \"realistic\" fighting and original ideas, although the James Brown gig was quite funny. I also cant argue with the hilarious outtakes at the end of the movie, which is becoming standard with all Chan movies. In all, I wouldnt spend $10 bucks to watch this movie in theatres. If I were you, Id wait for it to come on DVD to rent."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "jebricl",
        "review_rating": "",
        "review_title": "A true waste of time and money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Macdonaldmichael",
        "review_rating": "5",
        "review_title": "Spy film that doesn't take itself seriously...",
        "review_detailed_main": "Okay - if you are familiar with Jackie Chan's Hollywood work at all, you'll have a pretty good idea what to expect here. Cheesy effects, hokey jokes, and high action are the Chan trademarks and they're all present and accounted for in this film.\n\nI would say that if you're looking for a good popcorn film, or just some mindless entertainment to amuse yourself -- this is the show to see. Fun date film, and a great film for the teen set.\n\nIf you're looking for intrigue, thrills, whodunit or edge of your seat nailbiting - this ain't it. It's pure light fun that doesn't even bother with a plausible plot.\n\nIf you're looking for something like Rumble in the Bronx (Chan's best in my eyes - though I'm no expert) - this ain't it either.\n\nHowever - it is a fun way to spend a day - and it's worthy of a rainy afternoon, especially in the midst of the dry season we seem to be having at the movies lately.\n\nI give the flick a 6/10 for its sheer will to entertain us. It's not original, but it is fun. Besides - a shot of Hewitt's cleavage should thrill the teen set immensely."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "campblood13",
        "review_rating": "4",
        "review_title": "The comedy makes up for the bad direction/editing.",
        "review_detailed_main": "The first thirty minutes with Jackie Chan and Jason Isaacs are good. Isaacs is great as the real Clark Devlin, even though he doesn't have much to do in the film. Jackie Chan is likable especially when he does his James Brown impression. Jennifer Love Hewitt is cute, but isn't able to garner up much of a performance. Due to the age difference they weren't able to explore a real relationship between the two. It's not a good movie, but it looks nice and Jackie Chan is funny. 4/10 Fair"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "nicholls905-280-546911",
        "review_rating": "3",
        "review_title": "Hollywood Jackie Chan",
        "review_detailed_main": "Not a great film. The storyline is over the top and feels like a leftover Bond script from the 70s. Chan is likable as normal, but the film is flat and over the top. This could have been much better had they trimmed some of the staged humour. The cast is having fun, but they struggle with the filmmakers style over substance and poorly executed story beats. The Tuxedo may appeal to the younger crowd who enjoy quick humour. What was the deal with the first shot of the deer urinating in the creek? Who in their right mind would choose this as an opening shot."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "The-Sarkologist",
        "review_rating": "3",
        "review_title": "Not one of Jackie Chan's best movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "judyanddavewilliamson",
        "review_rating": "9",
        "review_title": "Very funny, classic Jackie Chan.",
        "review_detailed_main": "Great Spy Spoof, Jackie Chan at his best and great stunts. If you want a serious film don't watch this, but if you want a laugh this is for you. Whole family loved it."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "elshikh4",
        "review_rating": "5",
        "review_title": "Great First 20 Minutes, Then Forget It !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "sitesista",
        "review_rating": "",
        "review_title": "Simply Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "kittenkongshow",
        "review_rating": "3",
        "review_title": "Chan`s worst ever!",
        "review_detailed_main": "Jackie Chan is one of the greatest stars in cinema history, but since his move to Hollywood films his movies are going downhill.\n\nAnd at the Bottom... The Tuxedo.\n\nJackie please, please don`t make any more like this.\n\nWhen Miss Love-Hewitt is given more martial arts skill than JC (out of the tux) it shows that the makers have no idea about making a Jackie Chan film.\n\nThe stuntman standing in for Jackie is often obvious as well.\n\nOh I can`t be bothered going on - If you want to see Jackie at is best go rent/buy Police story or Project A."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "pauldelery",
        "review_rating": "",
        "review_title": "Lack of plot, lack of Jackie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "HotToastyRag",
        "review_rating": "8",
        "review_title": "Fluffy and cute",
        "review_detailed_main": "I loved the beginning of The Tuxedo. Debi Mazar gets into the back of Jackie Chan's taxi and gives him a destination. If he can get her there before she finishes putting on her makeup, she'll double the fee. As he speeds, swerves, and takes dangerous short-cuts, she informs him on her progress. Since his performance is so satisfactory, she hires him to be a private chauffeur for her boss, Jason Isaacs.\n\nBesides being a good driver, Jackie has no special skills in this movie. What a surprise, right? And what a short movie, since nothing interesting can happen. Just kidding - Jason Isaacs is a secret agent. When Jason winds up in a coma, Jackie (through some twists and turns) finds himself taking his place. But how can a chauffeur pass for a secret agent? Through a magical tuxedo. . .\n\nJackie is just adorable in this movie, and there are tons of laughs and sweet moments sprinkled in among the impressive action sequences. Where else will you get to see him disco dance and perform James Brown songs? He's just adorable as he masters a new skill: fooling the audience into thinking his clothes are doing all the work. As his legs and arms have a mind of their own, he mugs his hilarious expressions and goes along for the ride. Jennifer Love Hewitt plays Jackie's sidekick and pseudo-love interest. She's a scientist who's been looking forward to working with Jason Isaacs, so she's understandably confused when Jackie shows up in his place. She does get to wear some very pretty dresses, though. For one of Jackie's fluffiest roles, check him out wearing The Tuxedo."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "elloco1975",
        "review_rating": "8",
        "review_title": "Good comedy and nice action",
        "review_detailed_main": "Another Jackie Chan movie as usual.Fighting scenes are a bit the same like in al his movies,exept they get a twist of comedy with it now.Good movie and one to see. Good story and not just a kick and beat 'em up movie.\n\nGreets El Loco"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "DomNickson843",
        "review_rating": "",
        "review_title": "Was Decent Until the End!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "STAYHIGH007",
        "review_rating": "8",
        "review_title": "very funny",
        "review_detailed_main": "I found this film to be one of Jackie Chan's funniest films since the \"Rush Hour\" films! For the first time in Jackie Chan's film career, his unique fighting ability, that he displays so flawlessly, is attributed to a formal dining ensemble(the tuxedo)! Chan has also showed his uncanny ability to play well on screen opposite just about anyone who is paired with him regardless of race or gender as he does here with the very beautiful and talented Jennifer Love Hewitt! Be prepared for a non-stop romp of laughs as well as Chan's signature arsenal of stunts in this one! Chan and Hewitt deliver the kind of chemistry that might very well land them two a sequel to this film! The special effects come off dazzling and flawless! If you're a fan of Jackie Chan's, then you need to continue to support his efforts with your viewing of this film! You will not be disappointed, I promise you!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "superjxiv",
        "review_rating": "",
        "review_title": "Sad Day for Movies Everywhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "newellt-1",
        "review_rating": "8",
        "review_title": "Fun movie nothing great",
        "review_detailed_main": "This Movie was fun to watch. Had action and comedy it kept me interested. I watched it with my wife and 8 year old son. Both enjoyed it and the sex content was low so nothing to explain to the 8 year old. I don't think I would watch the movie again and again but it was a good time."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Astig",
        "review_rating": "",
        "review_title": "The Tux Sux",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "timshoebridge",
        "review_rating": "8",
        "review_title": "A good, fun, FAMILY movie",
        "review_detailed_main": "I'm a little disappointed at the many negative reviews I've read for The Tuxedo on this site. I think they are a little unfair. The Tuxedo is a good, fun, James Bond-style spoof in the same mode as Austin Powers or Johnny English. Yet in many ways I think it is better than the competition: It's got some great action sequences, it moves along quickly and never seems dull, and there are lots of funny moments too.\n\nAbove all else, it is a great family movie and the certification here in the UK reflects that fact. Maybe many of the other reviewers seem to have forgotten who the movie is ultimately aimed at? Anyhow, my kids and I are looking forward to the DVD release and will definitely be adding it to our DVD collection!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "thebarnacle",
        "review_rating": "",
        "review_title": "The most mediocre movie I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "bobojiggler",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "This is another great movie with Jackie Chan. I would have rather had Jimmy not use an advanced tuxedo to fight, but I still think that the movie is awesome. The action is great and my favorite scene is the fight scene at the end (like usual). I think that this is somewhere in my top five favorite Jackie Chan movies. The British C.S.A. agent was almost a fake, but he's still cool. I wonder if he always uses the tuxedo to fight crime. If so, that is really lame. There is a minor plot hole in this. When Jimmy first activates the tuxedo, it says that it will attack any moving object, but the suit goes around the room attacking objects that aren't moving."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "DBN43",
        "review_rating": "",
        "review_title": "Disappointing. Mr. Chan should stick to what he knows best.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "TheHonestCritic",
        "review_rating": "10",
        "review_title": "Is this a sharp and well-suited film? Check out my review below to find out!",
        "review_detailed_main": "\"The Tuxedo\" (2002), for those who may not know, I've recently reviewed my top two favorite Jackie Chan movies. Most of you know which one I think is his best film, that would be: \"Mr. Nice Guy\" (1997) and my second favorite of his movies is \"The Medallion\" (2003). I figured it was only fair to review my third favorite of his films, \"The Tuxedo\". I remember when I first saw this movie, I enjoyed it a lot. Then, the more I watched it, I found myself liking it even better! It has a perfect story, perfect acting, beautiful sets/locations, perfect special effects, and also a perfect soundtrack to tie it all together. The plot is, a hapless cab driver named Jimmy Tong gets hired to be a chauffeur for the wealthy secret agent named Clark Devlin, who owns a gadget-laden tuxedo. After Clark Devlin gets injured, Jimmy is forced to take his place. He dons his tuxedo, which gives him special powers and abilities. His mission is to stop Banning Corporation from poisoning the water supply. I won't go into any extra details about the story, but I promise that you'll be invested and laughing all the way from beginning to end. Probably the most unique aspect behind the plot of this film, is that Jackie Chan's character does not know any martial arts. His character only gains the ability when he puts on the tuxedo. At first, I thought that Jackie Chan not fighting as his normal self would ruin the whole idea of his skills in real-life. But, to tell you the truth, I thought it was an interesting change of pace! Watching someone like Jackie Chan on the screen not knowing martial arts is absolutely hilarious. Plus, when he puts on the tuxedo, the jokes and humor are raised up to 11! Just like in \"The Medallion\", I have the same nitpick here. That's right, I wish that this movie was longer! It may be 98 minutes in length, but it goes by in the blink of an eye. As for the acting, it's top-notch from the whole entire cast. Of course, Jackie Chan steals the show as usual. His acting never disappoints, and his performance here is no different! The rest of the cast does a phenomenal job as well. Jennifer Love Hewitt is funny as Jimmy's partner and eventual love interest, Delilah \"Del\" Blaine. Ritchie Costner as the villainous Dietrich Banning is fantastic. Every cast member nails their respectable character. Their chemistry on the screen is impeccable and they all help bring the film to life. All of the sets/locations are fantastic and give the film a beautiful atmosphere. As far as the special effects go, they are perfect and still hold up today. There are a few that are a bit cheesy. But, they get the job done and just give the movie that extra bit of charm. Finally, the soundtrack composed by Christophe Beck and John Debney is incredible. Their film score sets the perfect tone for the movie, and then some. Both of them are great film score composers on their own. But, when you have them both working and collaborating together, magic is created. \"The Tuxedo\" is a brilliant achievement in the world of action-comedy/martial arts movies. I can watch this movie over and over and never get tired of it. I'm giving this film 5 out of 5 stars on my scale, which equates to 10 out of 10 IMDB stars. If you haven't seen \"The Tuxedo\" yet, go see it today. Especially if you're a huge fan of Jackie Chan! I promise that you'll love it. If you don't go see it, watch out for Dietrich Banning, he might poison your water!"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "shiloh64",
        "review_rating": "",
        "review_title": "Jackie Chan? Why Why Why did you use CGI?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "skw666",
        "review_rating": "8",
        "review_title": "WoW one of BEST jackie Chan Movies!!!",
        "review_detailed_main": "Realy one of his best movies ,it is like every movie that he delivers with Action, Funny Type movies but this time whith Dreamwoke prodaction and a good director the movie is realy good and specialy for Jackie Chan Fans they will Love it !!! don't miss this one ,,"
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "a comedic bomb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "vamp88",
        "review_rating": "8",
        "review_title": "fun",
        "review_detailed_main": "Accept this movie for what it is. A fun, light-hearted action/comedy. If your expecting anything more you could be disappointed. If not you'll enjoy the ride. Some laughs, good action, and a quick pace make this an enjoyable diversion. Enjoy."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "magellan333",
        "review_rating": "",
        "review_title": "Not your average Jackie Chan film, pretty bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "TheUnholyArmpit",
        "review_rating": "8",
        "review_title": "First Chon Wang, now James Tong...",
        "review_detailed_main": "Hmmmmmmm, only Jackie Chan can get inspiration for a fight or two out of a tuxedo - a piece of clothing. I love odd ideas.\n\nOk, get the plot out of the way, spying, hapless character, evil baddie, and some idea for world domination. Thats all there is to the story. Good, leaves more time for action.\n\nThis is one of Jackie`s better recent movies, pity about the wire fights. Jackie, you are better than that, leave phoney fighting to the likes of The Matrix, Crouching Director Hidden Plot, et al, and come back to the style that you`re best at stupid life threatening stunts and lightening fast fights.\n\nThis hour and a half (or so) of movie was more entertaining than most of last years efforts, i`m looking in your direction Minority Report!\n\nYou cant see this movie and lot enjoy it.... well you can, but you would have to have a swinging brick instead of a heart.\n\nRoll on Shanghai Nights."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "jeremiah_m_cook",
        "review_rating": "",
        "review_title": "*Yawn*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "peterwang-1",
        "review_rating": "8",
        "review_title": "Great action film with Jackie",
        "review_detailed_main": "Is this an Oscar film? No. Artistic? No. Great script? Uh-uh.\n\nHuge fun for young fans and old? Yes! I love Jackie Chan movies because Jackie Chan loves making movies, and his energy and vigor are clearly up on the screen. I think Jackie & Jennifer work better than Jackie & Chris (although I think Chris Tucker's one of the funniest actors ever) because Jackie and Jennifer have a similar energy and laidback style.\n\nI also love the wonderful dynamics of action that Jackie is the master of. Great human being as well.\n\nThe James Bond guy is a great actor (Patriot) and I hope he works in American movies more often. Very cute movie! Something you can take your 10-year-old kid brother to without worrying. 8 out of 10."
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "No laughs, no thrills, no excitement, no point \u0096 an embarrassing mess of stupid plot, rubbish effects, rubbish fights, easily one of the worst Chan films I have seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "DrLenera",
        "review_rating": "",
        "review_title": "A silly, fun romp, nowhere near as bad as you've probably heard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "dragonrising2015",
        "review_rating": "",
        "review_title": "One of the greatest jackie chan movies ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "ireen-j",
        "review_rating": "",
        "review_title": "the tuxedo suits me fine",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "paul_supercala",
        "review_rating": "",
        "review_title": "Chan's movies have a reputation for being quick, funny, and full of great action sequences and this one continues that tradition.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "I liked it when it was funny; Chan and Hewitt great together",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "yossarian100",
        "review_rating": "",
        "review_title": "Standard Jackie Chan.....which means funny!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "robert-macklin",
        "review_rating": "",
        "review_title": "Jennifer I love you.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Cipher-J",
        "review_rating": "",
        "review_title": "Well tailored and packed with laughs.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "zoe_smith",
        "review_rating": "",
        "review_title": "bland Chan supported by a pretty face - again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "jfoxx-1",
        "review_rating": "",
        "review_title": "Absolutely awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "andersox",
        "review_rating": "",
        "review_title": "Too vanilla for Jackie Chan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Shilly-Shally",
        "review_rating": "",
        "review_title": "6/10, not as bad as I thought it was going to be.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "ponte1",
        "review_rating": "",
        "review_title": "Stupid, incoherent, yet recommended",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "a lot of fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "The Tux Sux",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "starmac-1",
        "review_rating": "",
        "review_title": "It's Almost as Good as It Could Be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "kraley",
        "review_rating": "",
        "review_title": "Why do the young lady's eyes keep changing color?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "",
        "review_title": "more for kids interested in gadgets",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "LedgerGyllenhaalFan",
        "review_rating": "",
        "review_title": "Not Bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "brandonsites1981",
        "review_rating": "",
        "review_title": "* * out of 4.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "craft1master",
        "review_rating": "",
        "review_title": "Good Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "modius",
        "review_rating": "",
        "review_title": "Hollywood nails the first nail into the coffin that was the 'Jackie Chan' movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "mack3175",
        "review_rating": "",
        "review_title": "Kinda reminds you of The Greatest American Hero.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "I_John_Barrymore_I",
        "review_rating": "",
        "review_title": "The Tuxedo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "pappyson88",
        "review_rating": "",
        "review_title": "I wish a had like that!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Baxter9289",
        "review_rating": "",
        "review_title": "Eh.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "Joe-Cuba",
        "review_rating": "",
        "review_title": "I finally broke down and saw it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "cool4jj",
        "review_rating": "",
        "review_title": "Not as bad as reviewed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "tenn-noodlehead",
        "review_rating": "",
        "review_title": "entertaining but weak",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "herr_skugga86",
        "review_rating": "",
        "review_title": "Low-key Jackie Chan, as always",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "hoorayformikereed",
        "review_rating": "",
        "review_title": "Watered Down Chan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "cchen4",
        "review_rating": "",
        "review_title": "Pointless, but good , somewhat clean , fun !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "lourd-master",
        "review_rating": "",
        "review_title": "NOT a waste of time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "JeffDart",
        "review_rating": "",
        "review_title": "Inspector Gadget meets Jackie Chan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "eyesoffme",
        "review_rating": "",
        "review_title": "Couldn't continue watching it... 20 minutes left",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "djp3535",
        "review_rating": "",
        "review_title": "His movies are always fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "nayanbhula",
        "review_rating": "",
        "review_title": "This Tuxedo is definitely a Rental",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0290095",
        "movie_name": "The Tuxedo",
        "movie_rating": "5.4",
        "review_username": "moviesfan11",
        "review_rating": "",
        "review_title": "not the best chan movie",
        "review_detailed_main": ""
    }
]