[
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "DarkVulcan29",
        "review_rating": "6",
        "review_title": "Don't HOP too far.",
        "review_detailed_main": "I am glad, finally a holiday comedy about Easter, and like Garfield and Scooby Doo, It mixes live action with CGI animation. Now I really liked the animation, the Easter Bunnys warehouse where they make candy for Easter is the most awesome thing since Willy Wonkas Chocolate Factory. Not to mention Hugh Laurie, Russell Brand, and Hank Azaria voice there characters perfectly, and provide much of the films humor.\n\nNow the live action was not as funny, at times James Marsden slips by with a funny line. but other than that it's all pretty stale. Even David Hasselhoff making fun of himself, hasn't he done enough of that already. I know what they are trying to do, a Santa Clause, but with Easter. And they did alright, but they could have done a little better."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "TheMysteriousReviewer",
        "review_rating": "5",
        "review_title": "Weakest Illumination Film (So Far)",
        "review_detailed_main": "I know there's people that say Minions is worse, but I thought that film was just okay. In fact, at least I take that over this. Hop is by far, the weakest movie from Illumination. Yeah, it has some good ideas its going for, some good animation that brings Easter to life and actors that have a decent amount of effort. But considering this is from the creators that brought Alvin And The Chipmunks, the story is lazily predictable. The tone tries to be modern for the young crowd making it outdated. The humor is mostly weak. The characters feel they aren't something for an Easter movie. And the ending was highly childish. The one thing I can recommend this is for the children for Easter time. As for anyone else, I think it's best to stick with the Sonic The Hedgehog movie from 2020. It may have the same plot line as this, but at least a good version. The idea sounded great of something like one of those Christmas specials, but the movie itself is just easily mediocre. Maybe one day we'll get a good Easter movie, but this is not really it. Happy Easter."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jgregg42",
        "review_rating": "4",
        "review_title": "\"Hop\" is so sweet it will give you a cavity.",
        "review_detailed_main": "\"Hop\" is another movie in a long line of big budget Easter Bunny films, just like...um... well ... er ... I guess there aren't many Easter movies that stick out in my mind. The team at Illumination Entertainment (who also brought you \"Despicable Me\") tried something new and approached a holiday that hasn't earned much attention from the film industry. Maybe they will set a standard for Easter films and this could be the beginning of Easter films. Or the end.\n\nThe movie starts off strong; we are introduced to the hero of the film E.B. (voiced by Russell Brand) (I can only assume E.B. stands for Easter Bunny) who is touring the candy factory with his dad on Easter Island (where else would an Easter Bunny live?). His father (voiced by Hugh Laurie) really wants E.B. to be the next Easter Bunny. Unlike Santa Claus, where there is only one of him that lives for a really long time; there is a long line of Easter Bunnies that have been keeping this Easter tradition alive for 4,000 years (for the Christians, do the math, does something seem fishy? For the Catholics, that fishy pun was intended for you in this Lenten season.) At the same time, we see Fred O'Hare (get it? O'Hare. I'm sure there's a joke in there somewhere) as a small child who catches a glimpse of E.B.'s dad delivering Easter eggs. Fred even sees the Easter sleigh (A sleigh? Yes, I must have missed that one as a kid. It's an Easter sleigh towed by hundreds of tiny yellow chicks.).\n\nFast forward 20 years, Fred (played by James Marsden) is now a grown man living at home with his parents with no job or even a real future. And, E.B. is now a teenager (for any of the viewers, do the math\u0085wait, don't do the math and just go with this one) who wants to drum in a band instead of inheriting the title of Easter Bunny. He runs away to Hollywood to follow his dreams. There Fred literally runs into E.B. with his car. I didn't realize how funny it can be to see a CGI bunny get hit by a car.\n\nFred and E.B. don't hit it off right away; Fred is pretty sure he is imagining the whole thing. E.B. annoys Fred with his antics and then Fred tries dumping E.B. in the wilderness. E.B. finally proves to Fred that he is the Easter Bunny by pooping out jelly beans. It's fun for the kids, I guess. Fred then remembers the time he saw the Easter Bunny which makes him ignore the fact that he despised this rabbit 10 minutes earlier. Here, as in most kiddie films, the two characters that had their differences and are now best of friends, must work together to fight a common enemy and therefore save Easter.\n\nShould you see this movie? Nope. The CGI and detail put into it was great but they didn't put half as much effort into the story. Sure it was cute and sure it had a few funny moments, but it's just not worth it to see this movie. The kids have probably seen the trailer and want to see the bunny that poops candy. If they are between ages 4 and 9 maybe put the DVD in their Easter basket next year but don't waste 90 minutes for a 15-second joke."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "ptb-8",
        "review_rating": "3",
        "review_title": "Hop away....quick.",
        "review_detailed_main": "HOP is a really lazy and lousy film. While technically amazing HOP is filled with unfinished scenes, unfulfilled moments, characters who amount to nothing, silly dumb scenes that go nowhere and worst of all the tediously unfunny Russell Brand. I have no clue as to why he is being promoted as funny or interesting. I find his work really annoying. The visuals with CGI bunnies and the Easter Island Wonka factory is fun but it all continually falls short of amounting to anything. Clever casting with appealing James Marsden helps but his family scenes are uniformly weak, and play like bad 60s TV scenes we all groaned about in the original Bewitched. Overall HOP is a huge disappointment made irritating by boring Brand. A real missed opportunity, made infuriating by the sitcom style and the go nowhere script and hopeless character development. All that technical expertise and THIS is all they do with it. That is lazy and cynical film making as if bundling shiny ribbon together is all that is needed. I went with a 4 year old and she (like others in the cinema) just became bored."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "life-of-hapiness",
        "review_rating": "7",
        "review_title": "Good Easter Movie",
        "review_detailed_main": "This is one of the only Easter films I know which is perfect for the holidays without being about Jesus. Such a cute little film which makes me laugh and I never get tired of. Perfect family Easter film."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "ctyankee1",
        "review_rating": "",
        "review_title": "Loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Justint0815",
        "review_rating": "1",
        "review_title": "The Definition Of Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "philipwing",
        "review_rating": "7",
        "review_title": "I Want CANDY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "twilliams76",
        "review_rating": "4",
        "review_title": "Alvin and the Chipmunks with bunnies!!!",
        "review_detailed_main": "In the 2011 film Hop, the Easter Bunny is basically Santa Claus and its main character, EB, is just like Alvin (of Alvin and the Chipmunks). In fact, this movie is very similar to Alvin's movie. Alvin and Hop both feature live-action stars co-starring alongside computer-animated main characters. Both of these animated, central \"cute\" animals want/dream of becoming recording/rock star musicians (Alvin sings ... EB plays the drums). James Marsden (Enchanted, X-Men, 27 Dresses) steps into the role of Dave as the character Fred O'Hare (uh, get it ... hare!?!). And that is about it.\n\nAs for plot: EB has fled Easter Island (yes, THAT Easter Island; and yes, \"lame\"!) a couple of weeks before he is supposed to take on the title of THE Easter Bunny. He flees to Hollywood (\"where all dreams come true\") and meets up with the bumbling Marsden who doesn't know what he wants to do in life. Hint ... hint ... for future plot points!\n\nEB(voiced by Russell Brand - Get Him to the Greek, Arthur, Despicable Me) is chased by a fairly tough bunch of Pink Berets who's mission is to bring him back to the island. While in LA, EB gets to meet and audition for David Hasselhoff (uh, talk about random) and his televised talent competition. I mean really!\n\nThe movie is short (luckily!) BUT rambling and devoid of anything great or meaningful. The character is cute BUT annoying and irritating and kind of selfish ... which doesn't make him a character I wanted to root for (and that the role/job of the Easter Bunny that EB is fleeing from doesn't ever come across as something dreadfully dream-killing). His plight is rather \"ho-hum, poor you\" (!) as he would only have to work-work ONE day a year (which leaves plenty of time to still rock a set of drums) as it is revealed that most of his work would be done by a large population of yellow chicks -- think Santa's elves and (boo!!!) the rip-offed Minions of Despicable Me!\n\nIt is kind of odd that such a bright and pastel-colored film with such cute animated characters (one even poops jellybeans!) would leave one with such a feeling of apathy. And ... so ... uhm ... ? But this is exactly how Hop made me feel.\n\nI enjoyed the talking pig film Babe (LOVED it); but Hop lacks that genuine human feeling of OTHER talking animal movies ... it feels manufactured and painted like a brightly-colored (yet HOLLOW) Easter egg."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jdcotton",
        "review_rating": "6",
        "review_title": "Could Have Been Better",
        "review_detailed_main": "The TV previews made me want to see this movie, but it turns out that those were the few funny moments to this movie - with the exception of the school play with the characters singing \"I Want Candy\". Nicely animated, but short on guffaws. Kids may love it, but as an adult it was a bit boring at moments and not very original. Now, really, the Easter Bunny has a sleigh? May be best to wait for this one to come out on DVD and keep it in mind for an Easter basket gift for next year. There are a shortage of good, original movie plots out there, short on story line and imagination. If the producers could only make the perfect fit of beautiful animation and storyline, you'd have one fine movie. This one needed more laughs to keep it moving along."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "DICK STEEL",
        "review_rating": "5",
        "review_title": "A Nutshell Review: Hop",
        "review_detailed_main": "Just as how Santa Claus stories work through their way through the Christmas period, Hop brings forward the Easter season some three weeks early with a kids film that combines the best of live action and animation in yet another talking animal story, which is something quite expected when you combine filmmakers who had worked on Alvin and the Chipmunks, and the producers of Despicable Me, who probably would have floated the idea that cute yellow things make for comedic villains since they're going against type.\n\nHop is a tale about sons being unable to live up to the ideals of their fathers, being told what is expected, being seen as soft and unable to exert any say in what they really want to do in life. When we first see EB (or short for Easter Bunny, voiced by Russell Brand), \"plush toy\" comes to mind for its incredibly cute design when the wide eyed bunny tours and allows the audience to see first hand what would be the equivalent of Santa's operations that the Easter Bunny adopts, with multitudes of chocolate and candy making machines all outsourced not to elves, but to chicks to operate and churn them out, before making deliveries in one single day to all the kids.\n\nBut as EB grows up, his propensity to take on the family business, or rather his calling in life, takes a hit and wanes because he aspires to dabble in music and play drums. Rather than take over from his father, he runs away to Hollywood to seek out his fortunes and thereby putting Easter potentially on hold, and bumps into Fred O'Hare (James Marsden), who is also kicked out of his family home because his father and family members find it a tad ridiculous that he mucks around home for the last one year doing nothing. So it's a chance meeting of two similar sons set to prove themselves in a whole new world, and bring about the usual kids theme of friendship, perseverance, and plenty of juvenile comedy. Look out for David Hasselhoff playing himself, and the requisite cute bunnies collectively known as the Pink Berets who would probably steal the show.\n\nI have to admit though that some of the jokes do work, since it's quite a wide spectrum from the usual toilet humour - EB poops delicious, multi-flavoured candy! - to a hilarious get up of the song I Love Candy with the duo continuing a ruse from earlier involving EB pretending to be a plush toy. This aspect of the film compensates for the lack of sophistication of the plot which for some weird reason has Fred not being satisfied with having validated that he's not crazy with his young time witnessing of the Easter Bunny going about his one day routine, but desiring to instead become a bunny himself.\n\nThat brought about what I thought was the most direct reference back to Despicable Me with the mindless bantering amongst the minions of the Easter Bunny's factory, where second in command Carlos (Hank Azaria), in the absence of EB and his dad getting old, secretly coverts a plot to usurp the festivity and run the entire show himself. While the minions have different designs and varying degrees of intelligence, the chicks here adopt a uniform look, and as expected there's always a smart alecky character to become cannon fodder for laughs.\n\nBesides priming itself for a respectable box office result when the Easter holiday rolls along, what this film would probably successfully do is to ramp up demand for rabbits and chicks amongst its targeted demographic, so parents, do spare a thought and taper those short term wants. Strictly for the kids. Do stay tuned until after the end credits for a scene to witness James Marsden's Mandarin diction."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "eddyjawed",
        "review_rating": "10",
        "review_title": "EGGcellent film!",
        "review_detailed_main": "Sometimes when I read other reviews on here from certain so called 'movie buffs' I get very irritated when they give such a good children's film like this a bad rating. I watched this film with a 'U' rating to pass the time with my little 2 year old who also thoroughly enjoyed it! - and thats the only reason you watch a film, to entertain yourself for a couple of hours.\n\nMy 2 year old sons eyes were glued to the set and I could tell that he also appreciated the fine animation that went into this film. The film also had a lot of comedy in it and was quite entertaining. For some people they they just don't realise that its a children's film for heavens sake. What do they expect a film to do when they watch one?"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "BabelAlexandria",
        "review_rating": "6",
        "review_title": "Failure to Launch/Hop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "TastesLikePanda",
        "review_rating": "1",
        "review_title": "Horrible. Not good for kids or adults.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "worldsworstwryter",
        "review_rating": "1",
        "review_title": "I legitimately forgot about this. 1/10",
        "review_detailed_main": "This was so bland and boring that I actually forgot to review it for weeks.\n\nLike I watched this weeks ago and then instantly forgot about it so quickly that I never even remembered to review it.\n\nThe only reason I actually remembered it is because it's Easter today and it got recommended to me.\n\nIf it wasn't for that reason then I'd literally never have thought about this film ever again.\n\nThat's how boring this is."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "groovybabe1992",
        "review_rating": "7",
        "review_title": "Hoptastic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "ironhorse_iv",
        "review_rating": "5",
        "review_title": "Hopping Mad like a March Hare.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "invisibleunicornninja",
        "review_rating": "6",
        "review_title": "I thought it was great...",
        "review_detailed_main": "When I watched this movie, I thought that it was fantastic. I feel like that if I rewatched it now, I'd probably have a bit of a different opinion. The animation and story is pretty good as well as the acting. Its not the greatest movie ever, not by a long shot, but for a kid this is very entertaining. The concept, though stupid, is interesting and overall its pretty funny."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "alerikanderson",
        "review_rating": "1",
        "review_title": "UUUGGGHHH!!!",
        "review_detailed_main": "This has to be one off the worst animated movies ever! The movie has the most dislikable character of all time, and the Hispanic chick is the only good thing about this film. He has to be the most sympathetic character of all time and doesn't do anything wrong until the last 21 minutes. Thee chick has been the second in command of the bunny and he wants to take over. But the daddy bunny wants to have his son to take over. But his son doesn't want to take over because he wants to be a drummer. And later on in the film he meets James Marsden's character and all that crap. The daddy's son bunny only acts like a stuffed animal to sniff the girls hair. Isn't he a likable character? He doesn't even care when James Marsden's character is kidnapped. Like I said, isn't he a character you'll like? Back to the Hispanic chick, he tries to make it clear to the daddy bunny that he is the only one that wants the job. And when it doesn't work, he takes over by force and feels deserved, because he deserves it more than the stubborn daddy bunny and his S#!% head son. I was cheering when EB was being beaten up by the Hispanic chick, because who wouldn't want him to have a bad death? And even when the daddy bunny says only bunnies can take over, but the mediocre James Marsden character is the Co-Easter bunny. The Hispanic Chick and Marsden character both did training for the job. They both wanted it equally, but only one was best QUALIFIED."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "moviexclusive",
        "review_rating": "6",
        "review_title": "Cute bunny + cute chicks – if that's good enough for you, then hop, don't walk, to see this",
        "review_detailed_main": "The Easter Bunny is to Easter what Santa Claus is to Christmas. Legend has it that both the Easter Bunny and Santa Claus go around people's houses at night before their respective days bringing gifts- though in the case of the Easter Bunny, these tend to be more specific to coloured eggs, candy and chocolates. Despite their similarities, Hollywood seems to favour Santa Claus over the Easter Bunny, going by the number of Yuletide-themed films around the plump, jolly, white-bearded man in a red suit and the dearth of films about the latter.\n\nCinco Paul and Ken Daurio however attempt to change that with their part-live action, part-animated romp \"Hop\", a through and through family film centred around the Easter Bunny. Also the writers of last summer's surprising hit for Chris Meledandri's Illumination Entertainment's \"Despicable Me\", Paul and Daurio display much less of their ingenuity this time round. Indeed, their adaptation of the Easter Bunny legend borrows too heavily from Yuletide films like \"Elf\", \"Fred Claus\" and in particular \"The Santa Clause\" that it almost feels that they have merely switched elves for chicks, reindeers also for chicks and Santa for the Easter Bunny.\n\nThe references are apparent right from the start, when we are first introduced to the Easter factory where all the candy and chocolates for the kids are prepared. Production designer Richard Holland's vision of this is no more than \"Charlie and the Chocolate Factory\" crossed with Santa's workshop in any of the films mentioned above, and despite the riot of colours, there's little wildly inventive that will make you go 'wow'. Same goes for the Easter Bunny's mode of transportation, which is really an egg-shaped sleigh pulled by hundreds of tiny chicks; or the source of its magical powers, derived from the Egg of Destiny or the equivalent of a Santa suit.\n\nPaul and Daurio's reliance on these Yuletide film tropes extends as well to the plot of the movie, which essentially is the story of the heir- apparent to the Easter Bunny throne, E. B. (voiced by Russell Brand, who also makes a live-action cameo later on) absconding his responsibilities to pursue his dreams of musical superstardom much to the chagrin of his father (Hugh Laurie). You can probably guess the narrative pretty much from here on end- just add in another out-of-work slacker, Fred (James Marsden), who is in the same real-life situation as E.B. with his father (Gary Cole).\n\nBesides sorting out their own father-son issues, E.B. and Fred will also spend time bickering with each other, before bonding through a fictional David Hasselhoff (playing himself) reality show \"Hoff Knows Talent\" (an all-too obvious riff on \"America's Got Talent\") and a sing-along at a school play where both take turns singing 'I Want Candy'. There's also a subplot which sees E.B's father's number two, a duplicitous Spanish chick Carlos (voiced by Hank Azaria), insinuating that he be crowned the next Easter Bunny in E.B's absence- but this is played for little more than to allow for an frenetic action-packed finale at the end.\n\nThough originality isn't one of its strong suits, director Tim Hill's (Alvin and the Chipmunks) film does take- pardon the pun- more than a few hops in the right direction. Most prominently, Hill's experience with such part-animation, part-live action fare is amply demonstrated in the seamless blend of E.B. and the rest of the computer-generated animals with their human counterparts- special mention goes to E.B, whose features and expressions are beautifully and vividly animated. Impressive too is Illumination Entertainment's ability to create 'oh-so- adorable' sidekick characters, the chicks including Carlos and the over- enthusiastic prone-to-dancing Phil reminiscent of the little yellow minions from \"Despicable Me\" and equally irresistible.\n\nHill has also assembled a lively voice cast led by the vivacious Russell Brand. Though there is none of the raunchiness usually associated with him (think \"Get Him to the Greek\"), Brand's distinctive laid-back charm is still intact and fits his character perfectly. Just as outstanding is Hank Azaria's voicing of both Carlos and Phil. Though the two characters couldn't be more different in nature, Azaria finds a unique voice for each, and is especially good at delivering Carlos' punchlines with aplomb- who can forget Carlos' line 'It's called a coup d'état which is a French for coup d'état!'\n\nAnd thanks to Brand and Azaria's voice talents, as well as the excellent blend of live-action and animation, \"Hop\" still proves to be more than agreeable family entertainment- even if laugh-out-loud moments are fewer and further-in-between than one would expect. Not to mention of course that the familiarity with Yuletide films of Santa Claus is unmistakable, which also makes \"Hop\" just as undemanding, if not unexceptional, fare as most of these movies. Still, it's colourful, it's buoyant, and it's cute, so that's definitely enough to keep the kids entertained."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jonnyhavey",
        "review_rating": "2",
        "review_title": "The British Bunny: Christmas Again?",
        "review_detailed_main": "Movies have been used to publicize many holidays throughout the years; however, there has not been a film that has displayed Easter in such a Hollywoodized way until now. \"Hop\" has transformed Easter into the new Christmas, drawing masses of families into the theaters. However, while the film was a success at the box office being named the first blockbuster of the summer, the film has much to be desired. Russel Brand (\"Get Him to the Greek\") stars as a rabbit named E.B. who is destined to take the place of his dad (High Laurie, \"House\") as the Easter Bunny. As the Easter Bunny, E.B. would be taking over control of Easter Island where chicks prepare Easter eggs and luscious candy delights for the Easter Holiday every year—sound familiar (elves making toys for Christmas). However, E.B. has a different idea about what his future has in store. To avoid his destiny, E.B. leaves Easter Island two weeks before his coronation on Easter day through a rabbit hole to Hollywood. After a misunderstanding at the Playboy Mansion, E.B. meets disappointment Fred O'Hare (catchy name) who has failed to live up to his father's (Gary Cole, \"Talladega Night\") expectations. However, Fred's life is turned around after he meets E.B., allowing him to realize his life long dream of becoming the Easter Bunny. However, before this realization can be made a reality, Fred and E.B. must stop the evil plot of the head chick at the factory, Carlos (Hank Azaria, \"Love and Other Drugs\") that would change Easter forever.\n\nThe only thing that \"Hop\" is successful at is targeting children. It provides this audience exactly what they would want out of a family-safe Easter film. Everything about the film is harmless and cliché within its kid friendly genre, ultimately pleasing parents, who do not have to worry about what their kids see. However, from a critical standpoint the only character that is somewhat worth following is E.B. Lets face it, you do not see many British bunnies that sound like Russel Brand every day.\n\nThe truth is that even though \"Hop\" may be the best film in theaters for kids to see, it has no excuse to totally disregard originality. Even though not many films about Easter are ever seen in theaters, \"Hop\" seems like just another Christmas film shot during the spring season. Every plot line and twist can be taken lightly because believe it or not it has all been done before. The jumbling of so many cliché plot lines makes the story random and by the end none of the film was fully developed. Also, the acting in the film is horridly hokey except for various Russel Brand moments. Even so, Brand was a very awkward choice for his role because he is the only bunny with a British accent. The clumsiness of the casting does not stop there with the evil chick Carlos (Hank Azaria, \"Love and Other Drugs\") being the only Hispanic chick in the movie.\n\nThe story is very plain mixing \"The Santa Clause\" and \"Alvin and the Chipmunks\" with an Easter shell. This makes \"Hop\" nothing more than a kid-pleasing flick that will make you wonder if Christmas came early this year."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "tigerstar154",
        "review_rating": "9",
        "review_title": "Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "inkblot11",
        "review_rating": "6",
        "review_title": "Hop is tops in animation beauty and has a good cast but only a middlin to fair story; families will still like it very much",
        "review_detailed_main": "E.B.(voiced by Russell Brand) lives on Easter Island, haha, beneath one of the giant stone heads. His father (Hugh Laurie), you see, is THE Easter Bunny and has been training EB to take over the job when its time. That day is very near, making EB fret, for he is into drumming and longs to be a rock star. On the island, the candy-and-egg factory is run quite well by Carlos the Chicken (Hank Azaria). In fact, Carlos thinks that a rooster can BE the next Big Bunny, it shouldn't be a species thing. As the holiday approaches, EB bolts off the island, via a secret tunnel, to Hollywood. At that moment, Fred (James Marsden) is driving away quickly from his digs at his parents house. Mom (Elizabeth Perkins) and Dad (Gary Cole) have just held an \"intervention\" to explain that Fred must find another job and get his own place. SOON. Naturally, Fred's car bumps into EB but the bunny is okay. In fact, since Fred is going to house sit at a huge mansion in Beverly Hills, thanks to his well-connected sister, EB thinks it is the start of a beautiful friendship between slacker and rabbit. Although the bunny does stir up trouble, Fred manages to get him an audition with the Hoff (David Hasselhoff, as himself) and EB wins over the talent critic and scores a big gig. Meanwhile, Fred loses out on another job opportunity and tries to convince the rabbit that maybe HE, Freddie, could take over the Easter Bunny position. Back on Easter Island, Dad Rabbit is frantic to find his son while Carlos launches a stealth mission to take over the entire operation. How will things resolve? What a beautifully animated movie this is, colorful and so superb at combining computer generated images with live action. See it on the biggest screen you can find, even if it means seeking out the rich relatives' home theater and begging for access. Also, the cast is nice, although Marsden, despite being a charming performer, may be too old for the part of Fred, as other critics have notices. Azaria, Laurie and especially Brand add much to the film with their voices roles and the other actors are nice, too. The sets are likewise very beautiful, especially the elegant Beverly Hills Mansion where the two unlikely housesitters go. Therefore, its near-miss as a must-see belongs to the uneven script and the rather tame and slower direction. There are clever lines and situations to be found but, alas, there's also too much banality. Nevertheless, I do urge families to hop the hop and get a showing of Hop going. It is certainly will be quite a nice view for the crew."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Thunderbuck",
        "review_rating": "4",
        "review_title": "More \"Flop\" than \"Hop\"",
        "review_detailed_main": "I feel bad rating this movie so low, because I suspect there was a lot of good intent. There was certainly good casting; the most amusing aspect of this movie is the sly cameo stunt-casting. Hugh Hefner does a voice cameo that's pretty funny, for instance.\n\nAnd then there's Hugh Laurie as EB's dad. While it may seem at odds with his nearly-amoral Dr. House, once upon a time Laurie provided the voice for Peter Rabbit in the animated Beatrix Potter stories. He reprises this voice here. It almost qualifies as an in-joke; I was certainly amused by it, but it didn't really do anything to advance the story.\n\nI also feel bad for the performers in general. They're good, and they're stuck in the most cynically-written movie I've seen in a long time. There's NOTHING original here. At all. James Marsden is likable enough, as is the near-ubiquitous Russell Brand's EB. The scenes are all pretty much lifted from old Disney movies and Christmas specials (even an incomprehensible nod to \"Back to the Future\"). We don't really learn a lot about the bunnies and their world, and we don't get anything but the sketchiest motivation for anyone. And while David Hasselhoff's cameo in the Spongebob movie was clever and self-deprecating, here it was just kind of sad.\n\nYes, I realize the response to this will be \"aw, give them a break... it's cute...\" The trouble is, there have been tons of genuinely GOOD family movies made in the past several years. Back in the bad old 80s this tired script might have been forgivable. Universal Pictures is making a lot of mileage out of \"Hop\" coming from Illumination Studios, the same people who did \"Despicable Me\", because THAT movie was genuinely GOOD. I'll grant that technically, \"Hop\" is pretty good. But all the technical brilliance in the world won't make up for a poor story.\n\nIn all fairness, I'll admit that my 7 year old enjoyed it. My 10 year old, though rates it at about a 3 on the 1-10 scale, so the bar's pretty low. Wait for video."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Rectangular_businessman",
        "review_rating": "2",
        "review_title": "What a waste of good CGI",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "classicsoncall",
        "review_rating": "7",
        "review_title": "\"I wanna be the bunny\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "gregeichelberger",
        "review_rating": "5",
        "review_title": "Film, like Easter candy, sweet but not much nutrition to be found",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "robyn-710-767167",
        "review_rating": "7",
        "review_title": "Well, it was funny, that's for sure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "WolfGifford",
        "review_rating": "1",
        "review_title": "Drivel. A failed attempt to make a Christmas movie out of Easter.",
        "review_detailed_main": "I took my two kids (5 and 8) to a preview of this. Usually, I enjoy a good kids movie - this was not a good movie. It tries to do for Easter what the Santa Clause movies did for Christmas, but misses the mark by light years. The main problem being that the iconography, the sights and sounds that characterise Christmas, just aren't there with Easter - and this leads to pretty much everything being forced, or coming across as a lame attempt to emulate the more expansive holiday period. None of the characters (inc EB) are very pleasant and attempt to have his story match that of the male lead is clumsy and obvious. On top of that, nothing interesting actually happens - characters don't develop, there is no sense of challenge or danger at any point and even the one possible exciting element (the Pink Beret's) are given nothing to do. OK, so both my kids said they enjoyed it, but I think I can put that down to the popcorn and chocolate they had. If they really like a movie it sticks with them, we'd barely got in the car before they'd moved onto another subject. 'Hop' is a lame rip off of a more successful movie franchise, don't be fooled by the fact that it's from a major animation studio. It is, quite simply, boring and unengaging for both kids and adults alike."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "surferdude1331",
        "review_rating": "6",
        "review_title": "Loved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "chirpling",
        "review_rating": "5",
        "review_title": "Nothing special",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "numberccp",
        "review_rating": "8",
        "review_title": "excellent",
        "review_detailed_main": "Despite the terrible reviews the critics decided to give this movie I decided to go and watch for myself. It seems that all critics like now days are movies with non stop sexual innuendos and sex period. They should realize that this movie is targeted towards kids while at the same time if the adults actually pay attention and listen closely they will enjoy this movie. The animation is splendid and the jokes throughout the film are jokes that any kid would enjoy. Even as an adult I was laughing throughout the entire movie. I mean would the creators of the hit \"Despicable Me\" really lead you wrong? My answer is no. This movie will leave you hopping out of the theater with nothing but a look of satisfaction. That is of course you don't know how to think like a kid anymore. So if you haven't seen it yet I would more than definitely recommend it to you especially if you have young kids."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "thekyles99",
        "review_rating": "6",
        "review_title": "I knew this flick was going to be a winner!",
        "review_detailed_main": "I have to admit ever since having kids and watching almost 10yrs of children's films, I have been a sucker for the really cutesy ones for example The Chipmunk films. So when we saw the trailer for this we all made the decision that upon its release we would go and check it out. Well did that today and we all, even myself (the most criticising of these films) enjoyed it immensely. Now i can definitely make fun of the fact that James Marsden is doing a film of this type however i have to say i love him in these kid flicks as he does such a believable job in them. This places the easter bunny and his apprentice his very own son on their home turf of Easter Island of course and the senior Easter Bunny who is voiced by TV's Dr. House's Hugh Laurie is trying with everything he has got to persuade E. B. to get seriously ready to take over the family business. E.B. voiced by Russell Brand would rather make a living being a professional rock drummer then deliver the eggs all over the world making the children ever so happy. After a row between the two of them E.B. flees Easter Island in a bid to follow his drumming dreams to Hollywood California. There he meets up with a unemployed slacker who still lives at home Fred O'Hare ( James Marsden) who has his own dreams of being something that he will never be. Eb wreaks havoc in Fred's life till they ultimately come to the determination what both of their destinies will be. A great family film to ring in the upcoming Easter weekend!"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "nuhc",
        "review_rating": "2",
        "review_title": "Good for kids, not good for adults",
        "review_detailed_main": "The only reason I watched this movie was because my wife rented it for our 2 year old son. It's OK as a kid movie, I guess, but I found it to be mindless drivel with a bunch of disjointed scenes. At different points the main character E.B. was thought to be a stuffed toy, a ventriloquist's dummy, or just a talking rabbit. As if the rabbit's identity had to be hidden from some people but not others, but the ridiculous part was that some of the characters were not even surprised by a talking rabbit. Then there were ridiculous subplots about a talent contest, the main character wanting to become the Easter Bunny, and a coup de etat by chicks at the Easter Bunny's candy factory (on Easter Island, no less).\n\nEven my son didn't pay much attention to this movie. 2/10."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "brooksbulldog",
        "review_rating": "2",
        "review_title": "More like Flop.....",
        "review_detailed_main": "This movie was a rip-off of any given Christmas Movie about the son of Santa and the pressure of becoming the next Santa. Only it uses terrible lines and bad acting. James Marsden did not work well in this film, at least he works in another CGI live action film, Sonic the Hedgehog. If you want to watch an Easter the,Ed movie that will leave a bad taste in your mouth then watch Hop. Truly the Minions should be ashamed."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "andy_wise-889-816388",
        "review_rating": "6",
        "review_title": "Nasty characters but fun for the kids (obvs)",
        "review_detailed_main": "A charming tale of two despicably self centred losers who manage to team up and enjoy a happy ending.\n\nFun, if you can get past the unpleasantness of the two central characters and our boy loves it. Obviously"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "masoncheek",
        "review_rating": "1",
        "review_title": "Awful boring lazy garbage.",
        "review_detailed_main": "Why, why why why why? Oh my gosh. So bad and boring. 1/10"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jeremycrimsonfox",
        "review_rating": "7",
        "review_title": "Good Movie, Despite Its Flaws",
        "review_detailed_main": "Seeing this film, I think it is good, but it has flaws. Telling the story of E.B., the son of the Easter Bunny who runs away to Hollywood as he does not want to be the Easter Bunny, he meets Fred, a slacker who is hired to house-sit for his sister. E.B. tries to make it big while avoiding the the Pink Berets, who are sent to bring him back to Easter Island, while Carlos and the chicks working in the Easter Factory plan to stage a coup against the bunnies.\n\nYeah, the film has a good story, but it has a lot of flaws. One of them being the use of toilet humor (mainly the scene where E.B. poops jellybeans to prove he is the son of the Easter Bunny, which is gross, even for a fictional animal like E.B.). However, the actors do a good job, some of the scenes are interesting (like Fred crashing a children's pageant to protect E.B), and the movie delivers a good message about being who you want to be. Also, the CGI characters are done well (thanks to Illumination, the people behind Despicable Me, helping)."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "mps_animaxfriends",
        "review_rating": "4",
        "review_title": "Lots of subtle and casual racism",
        "review_detailed_main": "I watched this today. And I was actually surprised at the degree of subtitle racism is in this. Specifically casual racism directed at Asians, mainly Chinese."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "kevin_robbins",
        "review_rating": "6",
        "review_title": "Hop is an entertaining picture that's solid and worth a watch, but it doesn't fully reach its potential",
        "review_detailed_main": "My daughter and I recently rewatched Hop (2011) on Peacock. The storyline follows the son of the Easter Bunny, who is poised to inherit his father's position. However, he dreams of becoming a rock star instead. The son escapes to Earth and crosses paths with a man struggling to find his purpose in life. Hopefully, the bunny and the man can inspire each other to discover their true callings...\n\nThis picture is directed by Tim Hill (Alvin and the Chipmunks: The Movie) and stars James Marsden (Sonic the Hedgehog), Russell Brand (Forgetting Sarah Marshall), David Hasselhoff (Knight Rider), and Elizabeth Perkins (Big).\n\nThe animation and potential of this film had so much going for it. The Easter Island scenes were fantastic and very well executed. They did an excellent job of creating an Easter Universe and workshop reminiscent of the South Pole and Santa's elves, but with bunnies instead of elves. The movie also boasts a great soundtrack. However, the storyline was just okay, fairly straightforward and predictable. While there were some fun elements, it's more fluff than hard-hitting substance.\n\nIn conclusion, Hop is an entertaining picture that's solid and worth a watch, but it doesn't fully reach its potential. I would score this a 5.5-6/10 and recommend seeing it at least once."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "mminer237",
        "review_rating": "4",
        "review_title": "Mean Bunny",
        "review_detailed_main": "Just feltlike the bunny was being mean to the human the whole movie. I guess it was supposed to be funny, but it just felt sad and upsetting. The whole movie just kinda fell flat."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jamesantoniou",
        "review_rating": "10",
        "review_title": "Great family entertainment",
        "review_detailed_main": "I was lucky enough to attend an advanced screening of Hop in London, and I decided to bring the whole family along.\n\nHop is a beautifully animated, funny, exciting family film. The plot is more sophisticated than Alvin and the Chipmunks, making it much more interesting and enjoyable for adults, and the bunnies and chicks are adorable!\n\nThe only criticism I have is that some parts of the film are too similar to Christmas films - something I would of thought the producers would go a long way to avoid! For example, the Easter Bunny rides a sleigh! Is that all they could come up with!? Also, I would say the voice cast are much better than the live action cast, and James Marsden does not make a particularly convincing out of work slacker.\n\nBut apart from that, Hop is a fun family film, and I would recommend this a lot!\n\nAlso, I think the critics are completely wrong! I cannot believe how inaccurate the reviews are! When I walked out of the cinema, every child in the room's face was filled with satisfaction and delight, so do not listen to the critics."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "aesgaard41",
        "review_rating": "6",
        "review_title": "Hop (Too Far On An Unoriginal Idea)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Mysterygeneration",
        "review_rating": "5",
        "review_title": "Hop until vanish.",
        "review_detailed_main": "Hop is pure sugar, in contrast to some sweetness movies. This live-action/digital animation mix with an Easter theme is a confectioner's dream. It probably ought to include caution for diabetics. Hop imagines a scenario in which the Easter Bunny oversees an Easter Island candy factory manned by fluffy yellow avian chicks in a world where the Easter Bunny manages a vibrantly pastel, underground, Willy Wonka-style candy factory.\n\nIn addition, Hop holds the dubious distinction of featuring the funniest poop joke to be found in a children's film in a very, very long time. Hop is a jumble of a movie, punctuated by the occasional belly laugh to break up long stretches of tedious subplots and stagnant narrative. Since there aren't many Easter movies that aren't about the crucifixion, what competition does this festive film with its adorable bunnies and chicks have?"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "oskakalud",
        "review_rating": "5",
        "review_title": "Hop - Rebelde sem Páscoa (2011)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Tak005",
        "review_rating": "6",
        "review_title": "Too many adult thought reviews",
        "review_detailed_main": "This is just a fun kids movie. That statement maybe obvious but I feel the movie needs some statements in its defence. There seem to be many negative reviews of the film based on adult viewpoints. Some maybe valid, however, they should be disregarded as they do not take into account the demographic which this film is aimed at - children. As far as letting your children watch it, go ahead, they will probably be enjoy it"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "samuelroberts-11378",
        "review_rating": "4",
        "review_title": "My nostalgia can't save this.",
        "review_detailed_main": "I was always a fan of this Easter movie and it was always a traditional film to sit down in front of and watch it at Easter time. Through the years it's been a bit of a joke to say that I liked this movie and throughout the years I've realised how terrible it is than I once thought.\n\nThe story just doesn't make any sense and the whole concept could have been a lot more well executed. It has an incredible cast and that's probably why I'm disappointed it wasn't better.\n\nHowever, it's still a tradition and it still has a charm to it so it will still be a tradition of mine for the foreseeable future, but will always be laughed at rather than laughed with."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "richieandsam",
        "review_rating": "7",
        "review_title": "It was good, but not a classic.",
        "review_detailed_main": "HOP\n\nI had seen a couple of trailers about this movie... but in all of the ones I had seen it was just a bunny playing drums... I was not expecting this to be a mixture of live action and animation.\n\nThe movie is about the Easter Bunnys son and a guy who is too lazy to even get a job. E.B. is the Easter Bunnys son. He is next in line to take over when his Dad retires, but he doesn't want to be the Easter Bunny... he wants to be a famous drummer. So he runs away. Fred is a lazy bum who lives with his parents and does not want a job. Can they help each other out and improve each others lives before Carlos, the evil chick, takes over the chocolate egg factory and ruin Easter.\n\nI was fully expecting this movie to be an all animation movie. I was shocked to see live action in it. I like that though... it reminds me of Who Framed Roger Rabbit? I love that movie. This is not as good as that, but is still very entertaining.\n\nThe animation was very good and the interaction between the actors and the cartoons was great. You can't really tell that the actors are not really talking to anyone.\n\nThe character named Carlos was my favourite character. I thought he was very funny, i just wish he was in it slightly more.\n\nThe movie was very amusing and a lot of fun, but i didn't find it very laugh out loud funny. I did laugh a couple of times, but not a lot. But this does not take the fun away from the movie. The kids loved it.\n\nThe acting was good and the voice acting was also good. I liked the voices in this mainly because you can tell who did them. I can't see the point in famous people doing voice acting unless you can tell who they are. Russell Brand was the voice of E.B. You can't mistake Russell Brand﻿ at all. He has a great voice and was perfect for this character. Hugh Laurie was the voice of the Easter Bunny. Again, you can tell his voice straight away... he was also a perfect choice. James Marsden was the main character in the live action parts of the movie. He did a good job, but he just has one of those faces that is good for comedy. Other cast members were Kaley Cuoco Sweeting﻿, Hank Azaria﻿, Gary Cole, Elizabeth Perkins and the legendary David Hasselhoff﻿.\n\nDavid Hasselhoff plays himself in the movie which is great. What I love about David is he does not take himself very seriously... and that just makes him all the more likable. I was a huge fan of his when I was a kid. Knight Rider was my favourite show and I even loved Baywatch when it was on. The Hoff was very cheesy in this film, but it was very well done. My favourite line in the movie was from him \"My best friend is a talking car\". :D\n\nOverall this movie is good and I enjoyed watching it... it just felt like a Christmas movie more than an Easter one. The sledge and the chicks pulling it around the world do the Bunny could deliver the eggs just seemed a rip off of Christmas which I thought was a bit lame.\n\nI will give this film 7 out of 10.\n\n\"She thinks Easter is cool. Talking rabbits freaks her out.\"\n\nFor more reviews, please like my Facebook page:\n\nhttps://www.facebook.com/pages/Ordinary-Person-Movie- Reviews/456572047728204?ref=hl"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Vincentiu",
        "review_rating": "",
        "review_title": "Easter story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "rocketry101",
        "review_rating": "1",
        "review_title": "Lousy movie trying to make a Christmas snag for Easter!",
        "review_detailed_main": "This is not a good movie at all. Can't understand the \"hype\" on this as it isn't even a good Easter movie. Which there is no need for anyway. It's also an embarrassment for James Marsden! He is a good actor, why would he do something so stupid. I would not have envisioned him in this type of quackery. What a shame!\n\nIsn't there enough fackery for Christmas without having to add such a \"bogus\" holiday such as easter. I just don't get it. Are there so few other movies out there that this is considered one of the big grossers. This is a sad state of affairs.\n\nAre people out there, that hard up for a bunny flick? What a \"rip off\"."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "missmomosa",
        "review_rating": "6",
        "review_title": "Well, it's not THAT bad",
        "review_detailed_main": "I watched this with my 10 yr old son tonight and we both thought it was OK. We laughed at the jokes, we got the point of the story and felt it was just okay. I didn't understand the reason for the movie, LOL, it's quite pointless but nonetheless entertaining. Russel Brand voices EB and does a great job. Fred O'Hare played by Marsden is highly unbelievable. . .no one is THAT excited about Easter. . There was a few moments when I was just staring at the screen not really sure what I was looking at, I kind of spaced out because the story line is a bit flat and the end was. . .well check it out for yourself. It's not all bad, see it for yourself and judge."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "james1844",
        "review_rating": "4",
        "review_title": "It Tries But Fails to Tell A Story",
        "review_detailed_main": "This fantasy tries with a few laughs and not too clever puns and quips. I just needed a meaningful storyline. I wanted to say that it was enjoyable but the truth is it reeked of the old lame Disney scripts that failed so miserably from the 60's and 70's. All too often the actors hammed it up and literally overacted to the point it detracted from enjoying this feebled film. Perhaps the kids will buy into the simple and corny plot but not the adults who expect a bit more than that. Again, it was the script and flimsy plot that let me down. Copycat of Christmas images like Santa Claus with the Easter Bunny was another sign of a weak story concept. Using a sleigh so similar to Santa's was just another example. 4 STARS"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "disseminatedfm",
        "review_rating": "9",
        "review_title": "Nice to have movies actually for kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "meeza",
        "review_rating": "7",
        "review_title": "Most of this is worth hopping away from except Brand and Azaria",
        "review_detailed_main": "I decided to get an I-HOP tasting after seeing those very enticing trailers of this computer animated film called \"Hop\" about a rock star dreaming Easter Bunny. The aforementioned protagonist is called E.B. and is vocally branded by Mr. Katy Perry himself, Russell Brand. In the flick, E.B. is about to be crowned the next Easter Bunny in his hometown of Easter Island by the former Easter Bunny who happens to be E.B.'s dad (voiced by Hugh Laurie). However, E.B. does not roll with the beat of that drum and decides to hop away from his so-called destiny by fleeing to Hollywood to pursue his dream of being a star drummer. In Tinsletown, he meets Fred O' Hare; a California slacker who is housesitting the mansion of a millionaire employer of his sister. O'Hare is played by the other James Franco named James himself, James Marsden. Obviously, O'Hare is first startled of the sight of a talking bunny, and is wondering if he saw \"Donnie Darko\" yet one too many times. Eventually, E.B. and Fred buddy up; and with Fred's help, E.B. ends up in a David Hasselhoff talent show in order to pursue his famous musician aspirations. This is where the film gets very chipmunked (whatever that means) and follows the same formulaic route as the \"Alvin and The Chipmunk\" masterpieces (sarcastically coughing numerous times). Back at Easter Island, a petite chick villain (yes, you heard right) named Carlos decides to plan a coup so he can be the next Easter Bunny. Carlos is voiced by Hank Azaria. Russell Brand did nail voicing E.B. (I don't think no one could have done better), and Azaria was also quite a bad chick delight with his vocal efforts as Carlos. However, I do have to go egging on the rest of \"Hop\". Marsden was extremely annoying with his performance as Fred, and the rest of the human cast of \"Hop\" seemed as if they were doing the bare minimum to pick up their Easter movie paychecks. Director Tim Hill and Screenwriters Cinco Paul & Ken Daurio did find their way in developing the animated characters rightfully so, but they could not hunt their way at all in constructing an engaging plot line. For the most part, \"Hop\" is a basket full of ridiculousness, but Brand and Azaria saved it from being a.. (drum roll please) Holiday cinematic disaster. *** Average"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "unpopicakbill",
        "review_rating": "3",
        "review_title": "Product placement overload",
        "review_detailed_main": "I found this a brainwashing exercise for kids, with product placement everywhere, a large effort to push products in the young minds.\n\nIt all starts with Easter presents, all of which have to be sweet, or the fact that a kid spy has to use a smartphone to get about, with map and photo camera, but also many others.\n\nI have to call this a consumer brainwashing orgy, and although in US some of the public may be used to this low quality movies, for me this seemed like garbage, as I would have appreciated 1:30h of commercials more.\n\nRegarding the kids entertainment factor, if you want your kids to follow the consumer trends (fashion) this is probably a fairly acceptable movie, pointing you to what you could be, but if you want to be independent (not look independent) this is at best a 3/10 movie.\n\nI gave my pluses because of the CGIs.\n\nDon't get exposed to this movie, it's toxic."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "lkl6411",
        "review_rating": "5",
        "review_title": "Kids were bored",
        "review_detailed_main": "We hoped good things for this movie, having really enjoyed \"Despicable Me.\"\n\nYes, the animation is lovely, especially the candy-making machines.\n\nUnfortunately, the plot was filled with tons of dialog and it wasn't all that interesting.\n\nI can easily become bored at kids' movies, but I've never seen my kids (almost 10, and 2 that are almost 6) fidget so much.\n\nAt one point about 3/4 of the way through my son asked, \"Mom, can we go home now?\"\n\nConsidering he's been to at least 8 movies to date and has never once asked this before, I knew HOP wasn't rating high with him.\n\nThe two girls said it was, \"Okay\" but that's not saying much.\n\nI wish I could have given HOP a more favorable review, but a \"5\" is a fair assessment of it in my opinion."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "lesleyharris30",
        "review_rating": "7",
        "review_title": "A great family film with a great voice cast,",
        "review_detailed_main": "Hop is a great film for the whole family,its colorful and fun with great humor and storyline.I would also praise the great voice cast, Russel Brand as EB (also does a brief cameo as an assistant talking to EB) Hank Azaria as Carlos and Hugh Laurie as Ebs Dad The Easter Bunny\n\nA young Bunnys dad,who is The Easter Bunny,wants his son to take his place when he retires,but a few years later to time has come but EB wants to be a drummer for a band instead but his fathers forces him to be the next easter Bunny.\n\nMeanwhile,a young man called Fred O Hara has failed another job review and is still living with his parents.His parents decide to kick Fred out so he will get a job,his sister lets him stay in his boss's house while he is on vacation but he must keep the place nice and clean.\n\nKeeping it clean becomes a problem,when EB runs off to Hollywood to become a drummer instead of an Easter Bunny,and decides to stay at the house after he Fred runs him over,but doesn't do a good job at keeping the place clean,The Bunny decides to audition for The Hoff(David Hasselhoff)."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "iReviewFilms",
        "review_rating": "5",
        "review_title": "Fanaticalaboutfilms Review: Hop",
        "review_detailed_main": "What with Easter fast approaching, there was bound to be a movie that tried to exploit this market just as there is every Christmas with the swathe of below average Santa Claus movies. Hop gave me some hope that it might rise above the average though as it was made by the same people that brought us Despicable Me (but then again they also gave us Alvin and the Chipmunks, twice and soon to be thrice!)\n\nThis movie has obviously set it's target market at the kids and so there is no shortage of lovable furry characters and simple smirks to be had at their bumbling about. This means the movie isn't going to make you think all that hard. It follows two main characters- a rabbit E.B. (damn that's original although I'm embarrassed to say it took me longer than it should to make that connection) voiced by Russell Brand and Fred O'Hare, James Marsden, (spot the next connection), a human, in both the animated and real worlds. Both have overbearing fathers who want something for them that they themselves do not.\n\nDeciding that being the Easter bunny is not the life for him E.B. makes for the big lights of Hollywood to try and show off his skills as a drummer and prove his father wrong. There he runs into Fred and their relationship gets off to a slow start. E.B. is very much the protagonist causing problems all over the shop that Fred has to keep resolving which is where I think most of the laughs are expected to come from. Add to the mix the pink berets (a crack squad of ninja bunnies) and a couple of token celebrity experiences from the Hoff and Hefner and there is enough to keep the plot moving forward.\n\nThe animation holds up quite well and there are only a few times in the movie where you can sense that the animators just didn't quite make it work. I'm still not totally convinced by movies that put animated characters in the real world when the movie is not an action adventure or sci-fi but they are getting better at it with Paul being a good example of the tide starting to turn.\n\nIt was slightly disappointed that Hop leaned so heavily on the template that made Despicable Me a relative success. Despicable Me has the excitable yellow minions and Hop has just added feathers and in some cases another eye to give us the chick minions lead by Carlos (Hank Azaria). Although they provide some of the better comic moments they don't really have that same impact as the critters from Despicable Me.\n\nNow don't get me wrong this isn't a bad movie, it's just that anything aimed so one dimensionally at children with no real overlay for adult jokes or anything other than 'aww look at the cute fluffy bunny' is not really going to get me going. If you've got young kids then this will be an ideal way to spend an hour and a half otherwise wait for it to hit the TV screens.\n\nFor further reviews feel free to check out: http://www.fanaticalaboutfilms.com"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "What if a human wants to become the co-Easter Bunny?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "7",
        "review_title": "Good kids' pic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "barrettcolin1",
        "review_rating": "3",
        "review_title": "Great Easter Movie ??????????????not??????????????????",
        "review_detailed_main": "Hop is about a bunny named E.B who dosen't want to become the Easter Bunny . E.B wants to be a drummer. E.B decides to leave on orientation day to Hollywood. Where everybody's dreams come true. E.b meets Fred who is unemployed and is looking for a job. After Fred learns E.B dosen't want to be the Easter Bunny, Fred wants to step in for him. While back at Easter Island ( where the bunny workshop is) Carlos ,a chick, is trying to take over the role of being a Easter \"Chick\".\n\nThis film has the voice of Russell Brand and James Marsden. This is a generic kids movie. Your 4 year-olds will love it but you might be sleeping in the process."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "varbrcesar",
        "review_rating": "7",
        "review_title": "Movie #11",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "James Marsden too old for slacker role",
        "review_detailed_main": "Fred O'Hare (James Marsden) would become the first Easter Bunny. On Rapa Nui Easter Island, E.B. is the heir to the position of Easter Bunny. Carlos is the jealous second-in-command chick. As a teenager, he dreams to be a rock drummer. He runs away to Hollywood on the eve of becoming the Easter Bunny. Henry (Gary Cole) and Bonnie O'Hare (Elizabeth Perkins) have decided to kick out their unemployed picky son Fred. Even their daughters Sam (Kaley Cuoco) and Alex are in on it. Sam gets him an interview with a videogaming company and housesit her boss' big mansion. Very reluctantly, Fred lets E.B. stay with him as the Easter Bunny sends out the Pink Berets to go after E.B.\n\nI really don't like Marsden's character. He's almost 40 and looks like it. Yet he's playing a character more like a slacker twentysomething. Unless the character is actually suppose to be this bad, I would suggest somebody much more younger as a happy slacker. E.B. is only slightly better. The other problem is that the characters don't seem to be ready to be together. It's ridiculous that Fred can't get rid of E.B. He's a bloody rabbit. Their relationship ring false. The movie does get a little better later on as they go on their wacky adventure together. Only slightly better."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "8",
        "review_title": "An Easter treat for the whole family",
        "review_detailed_main": "Hop was a film that I saw advertised earlier this week, and was immediately interested in seeing it. And I am glad I did, as for Easter this is a treat for the whole family with a lot to like. As a family movie, Hop is cute and funny entertainment for both kids and adults.\n\nIs it quite perfect? Not quite. I personally would have liked Hop to have been longer by about three or four minutes, that way some of the human characters could have been developed a little more. Also, while the pace in general is fast and brisk, there is the odd occasion in the film where it could have slowed down a little to give the audience a little more room to breathe.\n\nHowever, Hop is a perfect example of a film that ticks most of the right boxes when it comes to a family movie. In my mind, when it comes to part-animated/live-action comedies, Hop is one of the better ones, much better than the Garfield and Alvin and the Chipmunks movies anyway. The animation is great, with vibrant colours and bright backgrounds and the bunnies and chicks look absolutely adorable, and the live-action sequences with its striking locations and crisp editing are equally lovingly rendered.\n\nHop also benefits from a bright and breezy soundtrack, and a jaunty score by Chris Lennertz that fit with the tone of the film very well. The writing is funny and smart, people might argue there aren't enough pop-culture references to satisfy adults, maybe so but as an 18 year old female the lack of emphasis on pop-culture references didn't bother me as I have seen some animated films and shows where it goes overboard with references that are either dated or distract from the film completely. If anything, to be light with that kind of humour was a strength as Hop wasn't really about that. Also the running gag about Hugh Hefner and the altogether different kind of bunny didn't bother me at all, but I can see why some may find it questionable. The script has some funny and witty lines too, with Carlos having the best and most memorable.\n\nI was also taken with the story. While not the most original story in the world, it is a polished and fun one that is fast-paced and entertaining throughout and because of its sophistication it appeals to adults as well as kids. The characters are all likable and engaging, more the animated characters than the live-action characters admittedly, EB is a zany and endearing protagonist especially. Tim Hill's direction is above serviceable, and the acting is well done. James Marsden manages to be likable without being bland, and Elizabeth Perkins is lovely to watch. Even seeing David Hasselhoff was fun. And there is also a lively vocal cast, headed by a very vivacious Russell Brand as EB and Hugh Laurie who is rock solid as always as his dad, while Hank Azaria is outstanding in a dual role particularly as Carlos.\n\nAll in all, cute and funny seasonal entertainment for the family. Recommended. 8/10 Bethany Cox"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "It's watermelon....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "bad_beth666",
        "review_rating": "4",
        "review_title": "Weak....Contains spoilers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "RECB3",
        "review_rating": "5",
        "review_title": "Alright Film",
        "review_detailed_main": "I completely understand what the crew were thinking and trying to do when they were creating this film but it did not exactly fully work. The crew could have created this film a lot better and stronger if they had added some extra effort and strength. The storyline of this film was a bit basic and straightforward and went in multiple different directions which made it a bit difficult to follow. The cast selection was alright enough but could have been a lot better and stronger. They did not exactly fully commit nor connect to the storyline nor to their respective characters. The chemistry that was displayed throughout this film between the cast members could have been a lot better and stronger."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "illbegoodipromisejustturnitoff",
        "review_rating": "",
        "review_title": "I hate that I like this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "briancham1994",
        "review_rating": "6",
        "review_title": "Disjointed but entertaining",
        "review_detailed_main": "I think this film is underrated. James Marsden does a fantastic job at interacting with an obnoxious rabbit who is ruining his life. I thought their story was funny and engaging. Unfortunately, it is let down by some irrelevant detours like Carlos' coup which really steals the focus of the film."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "mitsubishizero",
        "review_rating": "4",
        "review_title": "Not as good as I thought it'd be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "6",
        "review_title": "Easter Doesn't Draw Like Christmas",
        "review_detailed_main": "\"Hop\" is Illumination studio's sophomore film. They made a grand entrance with \"Despicable Me,\" but \"Hop\" only made a whimper. Maybe there's a reason you don't see Easter movies in the theater.\n\n\"Hop\" is about the magical world of the Easter Bunny. Little did anyone know that, like Santa Claus, the Easter Bunny goes home to home one day a year, but instead of bringing presents, he hides easter eggs all over the place. I'm laughing now because typing this premise is so absurd I had to laugh.\n\nThe bunnies as well as little chicks all live on Easter Island where they're busy manufacturing candies and bunny shaped chocolates to deliver. The deliveries fall on one bunny and one bunny only. Now that the reigning Easter Bunny (Hugh Laurie) is older he wants to pass down the rights to his son E. B. (Russell Brand), except E. B. doesn't want to be an Easter Bunny, he wants to play drums.\n\nE. B. Ran away from home to Hollywood where he hoped to make it as a rocking rabbit. He crossed paths with Fred O'Hare (James Marsden), a human, who also had dreams different than those of his father. The two became friends and decided to help each other accomplish their dreams: E. B. to be a rockstar and Fred to be a human Easter Bunny.\n\nIf you're shaking your head right now I don't blame you. Interestingly enough the movie was better than it sounds. It helps that the movie is quite silly. By not being serious at all it made for a lot easier watch."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "whitehorse1914",
        "review_rating": "4",
        "review_title": "Prodigal Son",
        "review_detailed_main": "I went because I love CGI, and the candy factory did give the allusion I was going to see a Willie Wonka and The Chocolate Factory kind of story. The graphics for that where mesmerizing and imaginative. Kudos to the CGI guys, though it didn't play a huge part in the show.\n\nI see the Prodigal Son story used for Hop, but I have to wonder why children's movies are being made with crude humor. \"Up\" was so enduring and definitely family friendly. Hop? I'm hoping that my favorite Dr. Seuss story next year by Illumination Entertainment keeps the Lorax and Mr. Onceler true to their characters and not adding LA lingo to a good story."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Scarecrow-88",
        "review_rating": "6",
        "review_title": "Hop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "MrTravisL",
        "review_rating": "3",
        "review_title": "My point of view as a 17 year old",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "eric262003",
        "review_rating": "8",
        "review_title": "Best Animation Meets Live Action Movie Since Roger Rabbit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Kamurai25",
        "review_rating": "6",
        "review_title": "Almost a cuter \"Rise of the Guardians\"",
        "review_detailed_main": "Decent watch, would watch again, and can recommend.\n\nThis is a surprisingly dark, highly enjoyable, family friendly movie.\n\nWhile it takes a little bit to actually get into, just a touch too long taking to set up the ridiculous premise, once the action kicks off there is so much going on, the movie shifts from \"haha okay\" to almost being distracting.\n\nThe movie pushes that ridiculous limit quite a bit, and there are lots of little things that pop up that are neat, but ultimately don't pay off.\n\nThen the other side of it combines some \"yadada\" and the weirdest deus ex machina for a character struggling with responsibility I've ever seen.\n\nI think, if I keep thinking about it, I'll pick it apart, but in the end, I had a good time and picked this to watch and review over quite a few other candidates."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "TheMovieDiorama",
        "review_rating": "2",
        "review_title": "Hop is better off being butchered, making a nice rabbit stew.",
        "review_detailed_main": "I woke up this Saturday morning thinking \"let's put on a nice mediocre animation\". An easy and pleasant watch, that's all I wanted. Naturally, I didn't even get that! How difficult is it to produce a family fun flick about Easter? Getting children in the mood to feast on sweet sweet chocolate. Evidently, bloody difficult! Especially when the director of 'Alvin and the Chipmunks' is at the helm. Oh, and Illumination Studios. My hatred for them continues to grow! A bunny from Easter Island yearns to be a drummer, and so ventures to Hollywood where he encounters a worthless unemployed \"man child\" who must find his calling in life.\n\nMarsden. Why? Why do this to your career? You quite literally obliterated it, despite giving your best efforts. So, this animation utilises everything that I despise in mainstream family films. Firstly, animation alongside real actors. It worked in other bunny rabbit films like 'Peter Rabbit', but that's because the creatures were always in the backdrop of the real world. When Marsden is miraculously kidnapped and transported to the inner sanctum of Easter Island, it's an actor living and breathing in a green screen world. It's dumb. It's obvious. I hate it.\n\nSecondly, excessive pop songs. Drumming along to an auto tuned rendition of Taio Cruz' \"Dynamite\" in front of David frickin' Hasselhoff is not going to make me smile and dance. It's going to make me want to cut my ears off and place them over my eyes. I hate it.\n\nThirdly, terrible voice actors. Russell Brand is obnoxiously uncharismatic and cannot lead the film. His voice is more suited to an alcoholic skunk than a cute fluffy rabbit. I hate it.\n\nFourthly, no plot. The narrative is just a bunch of stupid sexually inferred jokes, like naively approaching Playboy Mansion (as if kids are going to know that!), stringed together to create a poor excuse of a story. The forced villain was forced. Supporting characters were non-existent. I hate it. Hop has no bounce. Hop has no fluffy bunny tail. Hop is hop(e)lessly inept, and I'd rather watch 'Minions'."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "goda-helgi",
        "review_rating": "",
        "review_title": "Solid, surprising family fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "5",
        "review_title": "Hop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "ofpsmith",
        "review_rating": "6",
        "review_title": "Two overused plots for the price of one.",
        "review_detailed_main": "The plot of the film Hop is made up of two clichéd story elements. Cliché 1, the kid who doesn't want to follow his fathers wishes and sets off to be independent. Cliché 2, the number two guy who has a diabolical scheme to get rid of the boss so he can take over. Put that together and then relate this whole thing to Easter and this is what Hop is. Okay I guess I shouldn't be too hard on it because I admit this did make me laugh, but I get the feeling that it's missing something. The two plots are as follows EB (Russell Brand) or Easter Bunny Jr. is next in line to take over the big Easter Bunny business as retiring time for the current Easter Bunny (Hugh Laurie). But EB doesn't want to be part of what his father wants and goes to Hollywood to become a singer. Meanwhile Fred O'Hare (James Marsden) is a human teenager who has to get a job. While driving he comes across EB and after settling their differences they become friends. Meanwhile Easter Bunny Sr. sends out a group of bunnies to find EB, and his assistant Carlos (Hank Azaria) an overgrown chick decides this is the perfect time to overthrow Bunny Sr. and become the Easter Bunny. But he's defeated and yeah that's about all this movie has. I guess it's not a bad film as it did make me laugh here and then but I just got the feeling that not much effort was put into it to make it original. I can recommend this over some of the other films I've seen but yeah. It's really just average."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "claudiaconcienne",
        "review_rating": "3",
        "review_title": "Can you say racism?",
        "review_detailed_main": "Why is the bad chick a Mexican? And the good bunny British? And the hero a rich white guy? And the band of half a dozen black men all blind like Ray Charles or Stevie Wonder? More importantly, why did this film get beyond the screenwriting phase?"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "ismaeelbuttib",
        "review_rating": "7",
        "review_title": "Illuminations under rated film",
        "review_detailed_main": "Hop is a funny movie that has a good bond between the leads. I rhought the final fight just looked abit strange with all the animation and a human. I watch this once a year and I enjoy it for what it is."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "If you are a kid at heart and love Easter then check it out.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "randomlysayinghi",
        "review_rating": "9",
        "review_title": "Adorable for all ages :)",
        "review_detailed_main": "Even if you're past the age of believing in the easter bunny, it's still a cute classic for this time of year. It has great animation as well. The bunny just sort of blends with the real world like it's there, which is also in part of the actors, I realize, who are great from beginning to end. You can easily fall in love with all the characters and it's hilarious. I remember first seeing this in the theater two years ago with my mom and the little girl I was babysitting, and all three of us left with smiles on our faces. I think it does have a couple errors, but what movie doesn't? E.B. is the stereotypical teenager who just wants to be understood by his father, and by the end, he gets his wish while still making everyone else happy. Compromise! :D This is a great movie with a great script, great actors, and a great moral."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Zoooma",
        "review_rating": "6",
        "review_title": "Rip off of Christmas",
        "review_detailed_main": "I was feeling in a cliché mood so I watched this for Easter. Ya know, this wasn't so bad... I mean not terribly horribly bad. Actually, it really is a totally stupid premise. On the plus side I guess it has some good acting from the animated bunny and chicken. Their voices, Russell Brand and Hank Azaria, respectively were exceptional. They were most excellent with the material they were provided. The bunny, E.B., provided laughs but the whole story, this rip off of Christmas and Santa, was just idiotic. I'd actually possibly watch again someday, I mean, it wasn't super-terrible.\n\n5.6 / 10 stars\n\n--Zoooma, a Kat Pirate Screener"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "paudie",
        "review_rating": "5",
        "review_title": "Even The Hoff can't save Hop!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "maybe, nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "4",
        "review_title": "Bunny Power",
        "review_detailed_main": "Bunnies and chicks and someone else said in his summary line. And while this might mean something else with other movies, this family movie is aimed straight at the kids. James Marsden character is very one dimensional indeed and has almost no charisma at all (his father is way better, with a better actor playing that role of course).\n\nThe animated stars over-shine their \"real\" counterparts, but overall they do not shine as much as they could. The story is an old one (you've seen it and you know where it is heading, unless you are the target audience that is) and the jokes are hit and miss. The moral is anything but subtle and as an adult you won't really have many things you can enjoy (something Pixar knows how to do ... combine the youth with their parents or any other adult watching the movie). Still for the young ones, there is much to enjoy!"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "motherbrain-58508",
        "review_rating": "1",
        "review_title": "I was in the hospital",
        "review_detailed_main": "Couldn't move, and had to watch something on tv.\n\nIt was played in november..\n\nBad acting, bad voice acting, bad script for a movie. Basically a 1 hour and 35 minutes cringe marathon. I feel so embaressed for James Marsden, how could he lower himself to this?"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "bkrauser-81-311064",
        "review_rating": "3",
        "review_title": "More Than a Hare Off.",
        "review_detailed_main": "It seems as long as I can remember, live action kid flicks have always been churned out like their makers were on autopilot. Primarily consisting of fart jokes and slapstick, kids movies are presumably for kids and therefore somehow less than and not worth the effort. Why? With kids television and music growing more sophisticated and educational why do we continue to dumb-down their films? \"Hop\" is a perfect example of obtuse kids entertainment. James Marsden plays Fred O'Hare (yes there are more overly forced Easter jokes to come), a lethargic layabout with no ambition other than being a leech to his parents. Finally kicked out of the house, Fred's older, presumably more responsible sister (Kaley Cuoco) takes pity on him and sets him up not only with a job interview at a video game company but also a mansion in Beverly Hills guarded by two Belgian Malinois, entrusted to her by her boss. Fred's plans...whatever they might be, are scrambled with the arrival of E.B. (Russell Brand), heir of the Easter Bunny who shows up in front of his car. E.B. you see came to Hollywood because he rather be a drummer than a bunny-fied holiday icon.\n\n\"Hop\" is brought to you by the same production company that made \"Despicable Me\" a kids film that was intelligent, charming and dared to be a little risqué in its mean-spiritedness. Sadly \"Hop\" takes things two steps backwards with its cotton candy premise and its dull, uninspired execution. The film largely consists of Marsden hopping around the set trying to control a CGI rabbit which demonstrates we really haven't gotten that far since \"The Incredible Mr. Limpet.\" Marsden's energy is completely undermined and wasted by a lazy script, sloppy CGI/live action effects and a languid voice performance by Russell Brand who sounds like he just crawled out of bed. And when I mean lazy script I don't mean phoned in, I mean literally lazy. Once the two principle characters meet they do absolutely nothing of interest. At one point they sit at a diner asking each other what to do, onlookers paying no heed to the fact that a grown man is talking to a plaid wearing bunny who poops candy. I'd hate to know how licorice is made on Easter Island.\n\nHugh Laurie and Hank Azaria also lends their voices for \"Hop\" as the Easter Bunny and Carlos, a slightly offensive Latino stereotype involved in a subplot too stupid to mention. One can't help but think if Azaria and Brand were given the chance to ad lib a little this film would have been a bit more tolerable.\n\nAt its worst this film an egg-ravating movie that has absolutely nothing to offer even the youngest of children. It is a poached commercialization of yet another holiday that doesn't need it and an egg-travagant waste of talent and resources. At its best this egg-cruciating film is an uninspired string of stale jokes. How stale you ask? My puns are fresh and bunny-er by comparison.\n\nhttp://theyservepopcorninhell.blogspot.com/"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "raypaquin",
        "review_rating": "1",
        "review_title": "What a waste!",
        "review_detailed_main": "Someday in about one century, some historians are going to write scholarly books explaining how and why our Western 'civilization' met with its downfall, which began, very gradually at first, in about 1970. If some of them are 'lucky' enough to view this film, assuming it hasn't already been thrown in a municipal dump a long time ago, the excruciating 'pleasure' provided by this experience will provide them with a large part of part of the needed answers. How can a society where 20% of the adult population is functionally illiterate, where 30% of the population has no health-care, where 42% of the adult population, when shown a map of North-America, cannot locate Canada on it, a country that shares a 3,500 mile long border with the United States (according to a survey done in 1980), where 55% of the adults can name the Three Stooges but where only 20% can identify the three arms of government, where the best educational system THAT MONEY CAN BUY is found, etc... afford to produce such expensive junk? This film provides evidence for a very advanced degree of technical proficiency, but for little else. I forced myself to watch it all, and I didn't even smile once. It is stupid, pointless, and mind-numbing, filled with smart-Aleck dialogue that has become the norm in the last twenty years, but it commits THE worst cardinal sin of all for this type of movie: it is NOT funny AT ALL. 'Nuff said..."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "rainmaker_freefall",
        "review_rating": "8",
        "review_title": "Best new family film I've seen in a looong time",
        "review_detailed_main": "I rarely go to the movies, and when I do, it's hardly ever for a cartoon. It seems like whoever comes up with these films decided that kids aren't smart enough to know whether or not something is good enough entertainment. And so, the writers and actors hardly even try.\n\nNow that my little rant is over, I'd like to emphasize that \"Hop\" is NOT ONE OF THOSE FILMS! I'm an adult (who didn't go to see this movie with a child, by the way) and it had me captivated the whole time. Most family movies that I would consider \"good\" have their UGH! moments, but I didn't get that from \"HOP\". It was utterly cute, but not lame. So, whether you're a child or an adult, I'd totally recommend this movie."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "bob_bear",
        "review_rating": "1",
        "review_title": "A Bad Egg",
        "review_detailed_main": "What a load of old bunkum this is. Absolute, unmitigated drivel.\n\n40 year old teenager still living at home with mum and dad needs to get a job...and a life...instead he gets a creepy bunny.\n\nCorn is piled on schmaltz is piled on tripe. Bunny screws up face and poos out jelly beans and 40yr old's sister eats them. Hilarious. Laugh? I thought I'd never start. And I didn't.\n\nThe Hoff plays his part like he was p*ssed up...which he probably was. I don't blame him.\n\nAnd the moral of this story? Follow your dream unless you are a bunny who plays the drums in which case go back to being the Easter Bunny if it pleases your father.\n\nSweet enough to rot your brain."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "ivo_shandor",
        "review_rating": "1",
        "review_title": "Charming? Yeah right....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "4",
        "review_title": "Hop (2011)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "KGinColo",
        "review_rating": "3",
        "review_title": "Don't Bother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "dfa120374",
        "review_rating": "4",
        "review_title": "Pretty Mediocre Family Romp",
        "review_detailed_main": "Even though I thought Hop as a movie was pretty average, the animation is superb (especially watching on Blu-Ray) and the combination between live action & animation is done really well.\n\nI usually cannot stand Russell Brand either, but I must admit that he was really good as the voice for E.B. A few other characters including Hank Azaria as the voice for Carlos were pretty well done also, and one of the much more enjoyable scenes was when Fred O'Hare pretends to be a ventriloquist with E.B. while singing I Want Candy.\n\nUnfortunately, though, I thought the humour was slightly lacking overall, but if you have young kids and you enjoy movies like Who Framed Roger Rabbit, Stuart Little and Alvin And The Chipmunks then I'm sure Hop will be a hit."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "JHackl",
        "review_rating": "10",
        "review_title": "Definitely for Kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "MB-reviewer185",
        "review_rating": "5",
        "review_title": "Easter bunny",
        "review_detailed_main": "A pretty standard movie, russell brand wasn't that bad as e.b In the movie and worked well with James marsden.\n\nOk easter movie, it has some funny bits with some imaginative scenes also."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "crecentroll",
        "review_rating": "5",
        "review_title": "Great For Kids",
        "review_detailed_main": "Unless you are a little kid or have the IQ of one you probably wont find this to be that great of movie. The story is silly, the comedy is lacking, the scenes aren't fulfilling and rather goofy. I think this great for kids as most kids wont realize how bad this is. I did watch the whole movie though and I did rather enjoy the little evil chicken. Also the fact that no one seemed surprised to see a talking rabbit was a little weird too. It seems like it is just another chipmunk type movie, kids love it, some adults will like it and hardly anyone will watch it a second time. I would expect the creators of despicable me to do a little better.\n\nThere is the argument that this is a kids movie and yes that is true but why can't a kids movie be as equally enjoyable to adults like with Rango, Shrek, Despicable Me and so on?"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "nickkel988",
        "review_rating": "4",
        "review_title": "Tediousness reinvented",
        "review_detailed_main": "Incredibly bad. Lacks momentum, pace and most critically; fun!"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "anapalmathsberry-91854",
        "review_rating": "4",
        "review_title": "it was ok, but its not a movie i would recommend.",
        "review_detailed_main": "At the start it made me seem interested,but some how it made me seem disapointed. im still glad i watched it as i was curios to see what the movie was and at least i gave it a try. it wasnt horrible, but the movie wasnt that greate for me!"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "joelthechocolateguy",
        "review_rating": "1",
        "review_title": "More like Failed Hop",
        "review_detailed_main": "Easter itself is better than this live action animated piece of trash movie"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "benzak18",
        "review_rating": "8",
        "review_title": "What a wonderful surprise",
        "review_detailed_main": "I have to admit I was dreading seeing this movie. My husband promised my sons, 5 and 8 he'd take them to see it. I read the reviews and tried to convince the \"boys\" to do something else. The reviews were AWFUL. We sat through Rango a few weeks okay. It was okay. I didn't particularly like the Alvin movies, but they were bearable. Well, this movie blew Rango and Alvin out of the water. My five year old who asks, \"Is it almost over,\" five minutes into every movie didn't ask me one time. It was very entertaining, and the audience (mostly kids) seemed to love it. The scene where Fred uses E.B. as a hand puppet is hilarious. Best kids movie I've seen with my kids...EVER!"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Allierubystein666",
        "review_rating": "5",
        "review_title": "Entertaining, but mostly a waste of time",
        "review_detailed_main": "At times sweet and charming, but mostly relying on its eventually exhausting concept through and through, Hop delivers nothing more than an average Family film, and feels more like a Holiday cash grab than true entertainment. Although it doesn't exactly meet the standard of being a decent film, Hop is not as bad as it may seem. The jokes can be juvenile at times, but it's predictable plot, eye-roll-worthy situations, and simply hard to watch scenes make it far more annoying than need be. That being said, the film is surprisingly entertaining, and though I wasn't exactly pleased with the film throughout, I was never really bored. Hop has its moments of humor, provided mostly by Marsden and his interactions with other characters. His performance is a bit over the top, but the only thing that seems to fit in its right place throughout the films short run. The film doesn't have much of a plotline, and it seems to wrap itself quite messily towards the end as it seeks desperately towards a conclusion to concepts, character arcs, and ideas shown before. In the end, Hop is not a good film, but a decently entertaining one for kids. It has its moments, but is most problematic from its various structural issues. Marsden tries his best, but even his much appreciated goofy personality, isn't enough to save the Easter Bunny from making a mess of himself. My Rating: 5.5/10"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Thanos_Alfie",
        "review_rating": "3",
        "review_title": "Boring...",
        "review_detailed_main": "\"Hop\" is a Comedy - Animation movie in which we watch the Easter Bunny's teenage son going to Hollywood in order to become a drummer star. He has to try hard in order to succeed and he is willing to do everything.\n\nI have to admit that I did not have high expectations from this movie but I was expecting something new and different. \"Hop\" tried very hard to be different but failed. I understand the meaning of a child who has dreams and wants to fulfill them without the consent of his family because his family wants from him something different than what he wants, but there are far better ways to present it than the one Tim Hill chose to. I really do not see a reason why to watch somebody this movie."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "meltingface75",
        "review_rating": "9",
        "review_title": "Awesome Cute Rabbit movie\u0085..But the last 36 minutes\u0085 -__-",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "asmetana-17-568269",
        "review_rating": "9",
        "review_title": "Great movie even for older people",
        "review_detailed_main": "This week, my family won tickets for an early showing of the movie, and we ABSOLUTELY LOVED IT. Before going, i thought it looked kind of weird and childish, but after, this movie was great for any age. E.B. is absolutely hilarious and makes many jokes only adults really understand. My only complaint about the movie was the ending; a little cheesy; but other than that, it was a great movie.\n\nThe story is about a bunny named E.B. who is suppose to become the next easter bunny. Growing up, he loved the idea but then fell in love with playing the drums (yes i know it sounds cheesy but it actually works in the movie). After running away, he runs into Fred O'hair (get the joke, O'hair. I thought it was funny) who is failing at finding a job. The two meet each other and E. B. ends up bunking with Fred. The adventure continues when E. B. meets David Hasselhoff, Freds sister, and escapes from the pink baraat.\n\nI TOTALLY RECOMMEND THIS MOVIE TO ANYONE\n\nTOTALLY Recommend"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "giovanni-carrillo",
        "review_rating": "9",
        "review_title": "I want candy!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "Awesome Family Fun!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "jesusoquendocortes",
        "review_rating": "10",
        "review_title": "I just done rewatching this movie on DVD tonight, 10/10!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "markstipic",
        "review_rating": "9",
        "review_title": "Perfect Easter family movie",
        "review_detailed_main": "Charming and funny movie, perfect for primary school aged kids and enjoyable for parents too. It's a simple plot with some funny scenes and I think it delivers on its purpose of being a fun family holiday movie.\n\nThe animation is great, the voice acting is excellent and The Hoff is a welcome inclusion. We watched it on Easter Sunday while eating copious amounts of Easter eggs and I can't think of a better movie to fill this bill.\n\nJudging the movie for what it is meant to be (wholesome entertainment for the whole family), it is one of my favourite family movies. Best watched with your kids and a lot of chocolate."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "marilyncarien",
        "review_rating": "10",
        "review_title": "Sweet and meaningful too",
        "review_detailed_main": "This is a sweet, simple film with great graphics, lovable characters, and plenty of laugh out loud humor. Plus it has a pretty nice theme. There are really no evil or scary characters and there's no revenge. Just folks with different values trying to work things out.\n\nIt's about the Easter Bunny side of Easter, but if renewal, forgiveness, wonder and father-son relationships are part of the Easter spirit, then I'd say it qualifies.\n\nI can't speak for whether kids would like it, but the witticisms, and philosophical insights sneaked in along the way made this simple story very appealing to me as a former English teacher."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "sourgurl758",
        "review_rating": "10",
        "review_title": "Super Cute and Funny",
        "review_detailed_main": "I went and saw this movie with my mother and younger brother and let me just say we ALL loved it. My brother usually is too antsy to sit through theater flicks, but he stayed put the whole time. My mom and I got quite a few genuine laughs in and left the cinema all smiles!! With semi-adult, but kid-friendly humor, such as: \"I almost jelly-beaned in my pants\", said by E.B., who poohs in the form of the Easter candy-favorite.\n\nRussell Brand's voice absolutely makes the entire movie! His character, E.B. is incredibly likable. Even his \"character flaw\" is something you can hardly blame him for: A dream of being a drummer.\n\nDefinitely worth the outrageous movie ticket price of today."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "wowalex",
        "review_rating": "10",
        "review_title": "Cute Easter bunny on adventure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "mimi-63212",
        "review_rating": "9",
        "review_title": "About the wonderful movie, 'Hop'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "georgecoffeynewyorker",
        "review_rating": "9",
        "review_title": "Great film, most enjoyable. However no need for Playboy Mansion scene.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "Jace_the_Peanuts_Fan",
        "review_rating": "8",
        "review_title": "I Want Candy",
        "review_detailed_main": "Hop used to be one of my favorite movies, and I'd watch it constantly when I was both 8 and 9 years old. It's not the most original movie in the world, but I still enjoy it regardless. I'd have to agree with what some of the other reviews say: it was high time there was a theatrical Easter movie with bunnies, eggs, and candy and isn't about Jesus. Don't get me wrong, I have nothing against religion, but there were already a lot of theatrical movies about the resurrection of Jesus. There are also a lot of Santa Claus movies out there, but how many Easter Bunny movies can you think of? My favorite part is when EB and Fred upstage Fred's adopted sister Alex's Easter play and sing I Want Candy, and even the kids in the play and the audience sing along with some of the lyrics.\n\nI enjoy the animated portion more than the full live action one. There's lots of color on its visuals, and the characters look very realistic but slightly cartoonish or stuffed animal-like. Easter Factory looks like how I picture an Easter candy factory (or any candy factory) to look. Heck, there are closeups of Hershey Kisses being made and wrapped. At the beginning, it is shown that the main human character, Fred O'Hare, saw the Easter Bunny aka EB's dad when the former was a kid, and his family didn't believe him. Now that's something you don't see every day!\n\nThere are a few Christmas-like elements here and there: EB's dad (later EB and Fred) rides an egg-shaped sleigh pulled by chicks, the same chicks and a couple of other bunnies paint the eggs and make the candy like how the elves make toys, and they live and work on Easter Island like their North Pole. Now we know how the Easter Bunny's yearly basket deliveries work and what Easter chickens do. There are a few differences between Easter Island and the North Pole, like there's no naughty or nice list, and there has been a different Easter Bunny keeping the tradition alive from generation to generation.\n\nThere are positive messages here about being open-minded with their children and supporting their career choices. That's an unoriginal but important lesson for all, especially parents, and doing the opposite can lead to trouble. At first, EB's dad retires from being the Easter Bunny and forces his son to take over, but the latter wants to be a drummer in a band instead. EB runs away from home and meets Fred, and the two of them help each other fulfill their dreams. EB's dad starts to miss EB and regret his behavior, and when EB goes home, the former apologizes for the way he acted and lets EB become a drummer, but EB decides to become the Easter Bunny alongside Fred and still be a drummer too (it's true that Fred isn't a bunny, but he's a human Easter Bunny). Who said one can't have two jobs or both fulfill your own dreams and do what your parents want you to do (but if you don't want the kind of job your parents want you to have, then just follow your own dreams)? At the beginning, Fred says that when he was a kid, his dad told him that he (Fred) was going to grow up to do something great. I'd have to agree with Fred's family; he did grow up to do something great. Who knew humans could be the Easter Bunny?\n\nThere are a lot of funny moments present. One of the funniest moments in EB playing the drums on Guitar Hero (or a similar video game) and saying, \"You never had one more lesson. I'm the EXTREME ROCK MASTER!\" I used to randomly repeat that line all the time and say extreme master master in the same growly voice as EB, which my friends and family also found funny. EB playing the drums at end and making Phil dance, mess up guiding the sleigh while Carlos is driving, and cause the sleigh to crash is also funny, and that should teach Carlos a lesson for trying to ruin Easter. I got to admit that Phil has great dance moves!\n\nI'd have to disagree with most of the negative comments some people say about Hop, but it's not without its flaws. Like I said, the story isn't entirely original, and it has a few mean-spirited moments: at first EB's dad and Fred's parents were jerks to their sons and force them to get certain jobs (though this is likely intentional so they can learn the morals), Alex kicks Fred in the leg and steals his flowers after her play, and she tells Mr. And Mrs. O'Hare that sometimes she feels like they adopted her because Fred is a disappointment. Like Mr. O'Hare says, \"That's a very hurtful statement.\" Towards the end, EB's dad tells his second in command Carlos that the Egg of Destiny to too dangerous for chicks. He should've said so sooner because Carlos was thinking about being the Easter Bunny much earlier, and only the Easter Bunny can touch the Egg of Destiny. Overall, it's still a great movie for Easter or any other day."
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "brunette_blueye",
        "review_rating": "10",
        "review_title": "Really funny- I enjoyed it as much as the kids!",
        "review_detailed_main": "Not sure why this is getting such low scores. The acting is really good, there are some genuinely funny moments that made me laugh out loud. My 7 year old twins loved it, said it's their favourite movie now!"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "lindajones-36960",
        "review_rating": "10",
        "review_title": "Rocky is my dad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "matthewsoares",
        "review_rating": "10",
        "review_title": "The Greatest Easter Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "mattkratz",
        "review_rating": "8",
        "review_title": "decent",
        "review_detailed_main": "This was a good holiday film-except for Easter, not Christmas. They were obviously trying to emulate The Santa Clause, as James Marsden plays an out-of-work slacker who spots the Easter Bunny as a kid. Twenty years later, he is deliberately ignoring all his family's pleads to get a job. Meanwhile, it is E.B's turn to become the Easter Bunny. He doesn't want the job and runs away to Los Angeles with dreams of becoming a rock star drummer, and after several stops, Marsden literally runs into him. They both become distractions and helpers for each other.\n\nI think this film was funny, and I loved seeing Kaley Cuoco (Penny from The Big Bang Theory) in it in a great role as Marsden's sister, and David Hasselhoff in a hilarious cameo. Admittedly, it could have been better, but I still liked it. My favorite scene was the interview at the video game place. You might like it.\n\n** 1/2 out of ****"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "adamjohns-42575",
        "review_rating": "8",
        "review_title": "Bunny!!!!",
        "review_detailed_main": "Hop (2011) -\n\nI personally believe that James Marsden is underrated as a comic actor. In his role of Fred O'Hare he bounced brilliantly off the Easter Bunny heir apparent, E. B., skilfully voiced by Russell Brand, whom I also firmly believe has always given his best performances when he's scripted AND voicing a cartoon character.\n\nAs the two leading men, both avoiding their responsibilities they played great characters that worked well together. Finding themselves in a place where they needed to \"Grow up\", but in different ways that made the story great fun.\n\nIt had obvious similarities to 'Peter Rabbit' (2018) and small hints of 'Rise Of The Guardians' (2012) and all of the others films/stories ever made that have a son/daughter preparing for a role that they don't want or are struggling to find their place in the world, especially the seasonal ones.\n\nAnd another similar film, 'Sonic The Hedgehog' (2020) would pair James with another chaos causing rodent. Add that to his role with a Wolverine* and he's nearly got the whole zoo.\n\nWhile the gorgeous James (Cuter than the bunny) is always wonderful I also felt that the rest of the supporting cast were good too, although I have started to become a bit tired of Hugh Laurie voicing everything in exactly the same tone and way every time.\n\nHank Azaria deserves more recognition for his voice talents however, he was perfect as the plotting Carlos the chick.\n\nI liked the action film/villain moments of the film, which would have been quite simplistic without them otherwise. It added excitement and danger, in its 'Austin Powers' (1997-2002) like delivery, as it could only be.\n\nI also liked the idea of using the actual \"Easter Island\" (Rapa Nui) as the base of operations for the Easter Bunny. Not all of the kids watching will understand that it's a real place, but it will bring it to some as a new location to discover, so there was that educational element and aside from that it was clever touch.\n\nAnd I enjoyed how they mentioned the fact that E. B. was a talking rabbit, but didn't actually make it problematic so that the flow of the film could just happen without that being an overwhelming element of the film.\n\nThe animation was wonderfully colourful and paired with a fantastic soundtrack that made it cute for kids and a pleasure to watch for the adults too, so a win-win.\n\nSadly, I don't think that I've ever participated in an egg hunt. That is something that I must rectify.\n\nOverall I found this film joyful and entertaining and I will definitely add it to my list to watch more often.\n\n810.11/1000.\n\n*X-Men (2000)"
    },
    {
        "movie_id": "tt1411704",
        "movie_name": "Hop",
        "movie_rating": "5.4",
        "review_username": "saadgkhan",
        "review_rating": "",
        "review_title": "Very immature, boring and not funny at all",
        "review_detailed_main": ""
    }
]