[
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "dineshprakash",
        "review_rating": "6",
        "review_title": "Not better than prior one",
        "review_detailed_main": "Watched \"KYA SUPER KOOL HAIN HUM\". Less humor, more torture. It is a very confusing movie. Just a jumbled compilation of jokes. They thought about the dialogues first then tried to stuff it anyhow. Very few times, they succeeded but mostly fell flat. I think Sachin Yardi is a better writer then director. Performance wise Ritesh Deshmukh is good. Anupan Kher is fantastic but I don't agree with his conviction of speaking such type of cheap dialogues. He is a cult actor. He can make audience laugh without dialogues and he does not need to do anything but who the am I to poke my nose in his conviction. One song \"TERE SHIRT KA BUTTON\" is cool. It is a sweet track. Credit goes to Meet Bros. If you have enough time then you can try friends. At least you will smile at places. It is an average film. Positive mouth publicity is doubtful. I think distributors will loose money because of it's high pricing due to it's prior version."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "iamwhatiam8990",
        "review_rating": "4",
        "review_title": "Kya Super Lame Hai Hum!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "anicjade",
        "review_rating": "5",
        "review_title": "disgustingly rap*d my eyes and my mind.",
        "review_detailed_main": "Such an annoying movie to watch, because it's nothing but a soft po*n. Actors are to shallow to be called actors."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "bobbysing",
        "review_rating": "3",
        "review_title": "May be one time watch for some but far away from being super cool.",
        "review_detailed_main": "When it comes to Indian films then making a Sex Comedy is still quite a difficult task due to the dual mindset prevalent in our society. Here at one end the 'generation now' can see just anything on their electronic gadgets at their will and on the other we are still forced to make & see films which are supposed to be Sex Comedies, without any sex in the real sense due to the strict censors ready with their scissors.\n\nAs a result, what you really get to see in KYAA SUPER KOOL HAIN HUM is a collage of suggestive scenes and double meaning dialogues where one wants to say the exact words, wishes to show some sexual content but cannot do so due to the Censor Board. In other words, the process of making films under this genre in our part of the world is just like studying the subject of PHYSICS or CHEMISTRY without having the permission to use the LABAROTARIES. Further, it all really seems to be utterly childish if you are an avid fan of Western or World Cinema and have seen some famous movies made in this particular genre.\n\nSo KSKHH can easily be called a desperate or forcible effort (made within the fixed framework of some strange restrictions and limitations), which tries its best to make you laugh occasionally. The funny moments are there in bits & parts, but that too only in its second half where the film picks up for a few minutes and then slides down again. The enjoyable scenes in the film are so hard to find that one cannot really call it a great attempt at all. The first half fails to make any kind of impact on the viewers in absence of an exciting script as compared to its unrelated \"Kya Kool Hain Hum\"released in 2005. Plus after making a decent start post intermission, the narration suddenly starts dragging due to its over-length, avoidable songs and a completely hushed up, pathetic climax. Hence if you are expecting a great laugh riot made on the lines of its Part One, then you are sure going to be disappointed hugely.\n\nHonestly speaking, its really a difficult task to make the viewers enjoy a Sex-Comedy supported only by its double meaning dialogues (using the mute button at times), a few comic sequences and some fine performances, minus the Sex. As mentioned above its like making a body stand without any spine in it. The art was perfectly mastered byDADA KONDKE in the 70s-80s and till date no-one has ever achieved that kind of excellence in this genre in Indian Cinema. To say the truth, the moment anyone else tries to do the same, it all becomes completely class-less, weird and indigestible in a bizarre manner.\n\nPutting it differently, KSKHH can also be described as just another unsuccessful attempt to create a SEX COMEDY genre in our Indian Cinema, where we still have to deal with the kind of CENSORS who think that even the vote casting ADULTS in our country are not supposed to hear the four letter word starting with F in the theater. The fact seriously makes me think about the actual age we really become Adults according to the authorities. Moreover here we have CENSORS who can readily pass a film like DELHI BELLY with hugely vulgar dialogues and contradicting themselves, can ask the other producers to mute the exactly similar words in their small films. Therefore, even though KSKHH does manage to hit you hard below the belt at times through its wacky one liners, still it cannot exactly be called a SEX COMEDY film as made in the other parts of the world.\n\nComing to its performances, both Riteish and Tusshar are complete natural when it comes to these kinds of roles, still I couldn't find anything new in their portrayal this time. They play it quite similar to what we have already seen in all their previous comedies. In the female lead, Neha Sharma looks great and acts well too but Sarah Jane Dias's effort is clearly visible and she also needs the support of her great outfits to look good on the screen. Anupam Kher gets wasted in a half- heartedly written role and Chunky Pandey fails to generate any spark. Rohit Shetty (the famous director of Singham & Golamaal series) makes an uninspiring cameo in the film but Razzak Khan shines with his most effective lines, capable of generating a good noise in the theaters.\n\nDirector Sachin Yardi handles few sequences well, particularly in the second half, but he surely could have gone for a decent storyline to support his talented dialogue writers. At times I also felt that he gave too much attention to the Pug (dog) in the film which could have been replaced by some entertaining scenes in the script. In the technical department, Cinematography and Background score doesn't give you anything special to write about. However the soundtrack of KSKHH scores some decent marks due to its peppy party tracks namely \"Dil Garden Garden\", \"Volume High Karle\" & \"UP Bihar\" redone version.\n\nTo conclude, KYA SUPER KOOL HAIN HUM may appeal only to the viewers who wish to hear some crazy double meaning dialogues alone in this supposedly called SEX COMEDY. But if you don't find what you were looking for in it, then simply blame the questionable standards followed by our CENSORS more than its makers."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "Biswas_",
        "review_rating": "2",
        "review_title": "From this film onwards, the KKHH franchise went down",
        "review_detailed_main": "I just watched KKHH 1 few days back and had a hilarious roller coaster ride. Now I decided to watch KKHH 2 thinking this might be the last good KKHH film after KKHH 3 was just next level lousy low grade film but no i was wrong. KKHH 2 is just a touch better than KKHH 3 but far more nonsensical and crass as compared to KKHH 1.\n\nWHY? See KKHH 1 had a proper story in it and in it were loads of those double meaning jokes and situational comedies that actually were pretty witty and went well with the film. However , in KKHH 2, there is absolutely no story. It felt like KKHH 2 was made only to fill your ears with even more crass double meaning jokes.\n\nEvery second there is a double meaning joke and this time, half of them don't work. Hear this ....\"Tumhe kaise pata ki wo ladki cool hai?\" ...\"Kyunki wo fridge bnati hai\".... literally this joke you see in nursery kids magazines exists in this film. Rubbish! The story is not there only as i said so the jokes half of them don't work. I was so stunned at how badly the quality of this franchise dropped in just their 2nd installment. Lots of racist and sexual jokes only few work rest feel repetitive so easily offended guys stay away.\n\nKKHH 2 follows the similar trend of giving weird funny names to characters. Like you have a dog name \"Sakaru\" which sounds like \"Suck Karu\" . Then there is Anupam Kher whose title is \"Maarlo\" and his mother has an even more ridiculous name \"Rosemary Marlo\" ...do I need to explain what's funny in this name? Roz Meri Maarlo! Yeah .\n\nThe famous \"laundry-suit\" guy has a small cameo here too (and even in KKHH 3 ) and believe me, he no more sounds hilarious. First time, i heard this in KKHH 3 it sounded epic , then after a long time i watched KKHH 1 and realised he is a franchise character but coming to the 2nd and final film of this franchise, he sounds non funny.\n\nSongs. Only \"Dil garden garden\" is my favourite, it was since 2012 .\n\nPerformances, very hammy. And with installments, the performances of actresses have gone down with the worst coming from KKHH 3. Anupam Kher is so badly wasted it's a pain to see him in such a foolish character atleast in KKHH 1 he was better.\n\nOverall, KKHH 2 signalled the downfall of the KKHH franchise with KKHH 3 being the worst and final nail in the coffin. It's a really bad film barely watchable. Can't believe that i have KKHH 1 8 stars and this film 2 just for a few witty jokes that were left in this film."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "coolmaxr",
        "review_rating": "5",
        "review_title": "A story of two failures trying to make things right.",
        "review_detailed_main": "Here's an average sequel to a super hit(on fiscal terms) kya kool hain hum as 3/5th of the leading star cast is the same the difference is created by the babes, much hotter this time and there is the uprooted level of lame jokes which were not much in the previous part, as the previous part was one of its kind during its tenure its sequel is one in a million as every other movie is using innuendo slang to create unearned humor in the flicks, as the movie proceeds this one is slightly better in screenplay than the previous part and yes the locations are cheap but good, Ritesh Deshmukh has done his average bid in the flick and Tushar kapoor after giving his Golmaal touch in few scenes has done his best justice to the character(of a struggling actor). the innuendos used in whole movie were nothing new and every one following jokes on facebook will recognize them as far as the the only few good roles we talk about in the movie were of anupam kher and chunky pandey who had done total justice to the roles and make you laugh every time they are on screen. though a bearable movie but prefer taking a friend with you so that when you get bore you have someone to talk to."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "If you are looking for some laughs, this one promises to tickle your funny bone",
        "review_detailed_main": "Kya Super Kool Hain hum was a fun filled , raunchy comedy that had no direction , no story and yet no script but still the comedy scenes are hilarious which makes it watchable at least once !!!\n\nAdi (Tusshar Kapoor) is the struggling actor and Sid ( Riteish Deshmukh)is the wanna-be DJ who are trying to make it big. They meet Anu (Sarah Jane ) and Simran (Neha Sharma) and follow them till Goa where all the confusion begins.\n\nDirected by Sachin Yardi , Kya Super Kool Hain Hum may not have the steam like the previous part but it is definitely entertaining thanks to its double-meaning dialogues and superb comic timings by the lead star cast. The movie starts without a bang in the first half with much of the scenes being senseless but in the second half it gathers steam. There are couple of scenes which really do stand out. The Devdas scenes in the transport bus , the paragliding scene etc makes it hilarious. Sachin Yardi has still a long way to go as a director. There is nothing called screenplay in the film. The cinematography is just about OK along with decent production value. The song \" Dil Garden Garden Ho gaya \" is pick of the lot. Dialogues are full of double-meaning jokes and witty. It is upto the audience of how to take it. Performances by Riteish Deshmukh and Tushhar Kapoor lead the show. They carry the film on their shoulder with superb comic timings and perfect on-screen chemistry. Neha Sharma looks gorgeous and has done well compared to her previous film. Sarah Jane does a decent job. Anupam Kher and Chunky Pandey are good.\n\nOverall , if you are looking for some laughs, this one promises to tickle your funny bone. Don't look for any story , any sense or any logic and you would not be disappointed. Good 3/5"
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "theranjith",
        "review_rating": "4",
        "review_title": "Watch it for some funny moments",
        "review_detailed_main": "This movie belongs to comedy genre, where we must not think about anything i.e leave your brain while watching it. Well.. as expected this movie is kind of Hollywood teen movies such American Pie, Van wilder type movies but it is not too cool like those. However they tried to make funny by talking double meaning dialogs, about gays , lesbians etc etc, but it makes you laugh at sometimes. Most of the times i feel like irritating. It lacks in the screenplay heavily. I started wonder how the movie will go ahead and how will they finish and yes of course they finish it off in a very usual way. I do not find anything new in the story or in anything except the funny dialogs. I think bollywood has improved well by making these kind of movies and releasing it without any problems. And can go to performance of the leads, Riteish scores well over Tushaar. Yes, Tushar can be able to act only in these kind of silly comedy movies. Leading ladies looks very pretty and sexy. Anupam kher is OK. Songs are like just fast forward type :). Overall, can watch it once for some funny moments scattered throughout the movie. But sometimes it will test your patience."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Funny but Crass & Crude!",
        "review_detailed_main": "A Sequel to the 2005 Super-Hit 'Kya Kool Hain Hum', 'Kyaa Super Kool Hain Hum' is Funny but Crass & Crude as well. But, the film does entertain, despite a paper-thin plot.\n\n'Kyaa Super Kool Hain Hum' Synopsis: Adi and Sid want to make big but always run out of luck and series of confusion start taking place when they reach Goa.\n\n'Kyaa Super Kool Hai Hum' has a terrific first-hour, with each gag working highly on its advantage. The second-hour is stretched, but it never really bores. Sachin Yardi's Screenplay offers a paper-thin plot, but yet he packs in enough gags & terrific dialogue to take the narrative ahead. Yardi's Direction, on the other-hand, is fair. Cinematography is standard. Editing is passable. Music by Sachin-Jigar & Meet Bros Anjjan, is peppy.\n\nPerformance-Wise: Ritesh Deshmukh & Tusshar Kapoor are up for vie top honors. They both excel & entertain all through. Neha Sharma & Sarah Jane Dias are efficient. Though his character is outright cartoonish, I found Anupam Kher's performance to be outstanding. He brings the house down whenever he appears on screen. Chunky Pandey is as usual. Howard Rosemeyer is genuinely funny. Kavin Dave gets minimal scope.\n\nOn the whole, 'Kyaa Super Kool Hain Hum' is certifiably funny & entertaining."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "sabiyalsaghir10",
        "review_rating": "5",
        "review_title": "Ordinary Male Entertainment",
        "review_detailed_main": "This is a very ordinary movie and the filmmakers know it! The look and feel of the movie is just like Bollywood Movies of 2003- 2008..crappy camera angles..extra colorful sets and over the top comedy scenes,until now I thought that if a movie has suggestive references,it's a great comedy,this movie has proved that wrong..the addition of crude dialogues and double meaning language did not make it that much funny,I only laughed at a few scenes..the movie just drags on,some of the scenes are brilliant while some are just down right crap,every scene has crude dialogues and sexual references,and that's what makes it boring,Kya Super Kool Hai Hum had the ability to be an excellent entertainer but fails big time,and the worst part is the producers know it's an ordinary movie,it's said in the movie several times!Instead they could have tried and made it brilliant!\n\nBottom Line:If your'e a male,you'll enjoy it.Males enjoy almost any sexual dialogues and this movie delivers that a lot!Don't except a brilliant comedy though"
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "parekhdhrumil-374-333873",
        "review_rating": "9",
        "review_title": "Dil Garden Garden Ho Gaya",
        "review_detailed_main": "Reviewing a Comedy film is a bit tough job so excuse me if you find the review bit Silly. I Saw Kyaa superkool hai hum and believe me Mera Dil Sachmein Garden Garden ho gaya.What a Ourageously funny Film and i still cannot stop myself from laughing like a Madman when i recall the creative and out of Box Double meaning jokes.WHAT A EFFIN FUNNY FILM.Everything about this film is outrageous and wicked yet its very hard to stop yourself from Laughing.I can even vouch for the Fact that This is the BEST comedy film of the DECADE.\n\nFrom Bollywood spoofs on Singham-CHINGAM,Ek Tha Tiger-EKTA TIGER,Ra.One-BRA.ONE to kiddish jokes like \"You are so witty\" \"And you are so Churchgate\" to gay jokes to Heavy and suggestive Double meaning Jokes which are Damn funny and creative.I can actually watch this film back back five times without getting bored because the Jokes will feel new each time one see's it. I would like to credit the Writer who wrote all this goofy and laugh out loud jokes and situations which will make you forget all your sorrows and you will laugh throughout the 2 hours 20 Minutes and whenever you will recall any of the jokes you will suddenly break into guffaws like a insane person.\n\nBoth the actress Neha Sharma and Sarah Jane Dias looks mesmerizing and while Neha Sharma is Adorable and beautiful, Sarah Jane Dias looks Sexy and Hot. Ritesh is Awesome Just Effing kool and probably his Best Performance, while Tushar hams in some scenes but is okay in the 2nd Half. Goa is Captured very splendidly and looks surreal on the Screen, credits to the cinematographer. But the Show belongs to the Writer-Director for creating this Hilarious film.\n\nComedies are often perceived as Mindless Stuff but you will actually need your Mind the most while watching this so you can understand the Double meaning dialogues and Entendres better or you might miss the Funniest joke and someone will have to take the trouble to explain you the joke which spoils the fun so make sure your ears and Mind both are open because this is the most Intelligently crafted Comedy i have seen in a long long long time. I will prefer this than Delhi Belly because in Delhi belly everything was outright and direct and there was no scope to run your mind to get the real meaning, while here you enjoy the film more because every line has a 2nd Meaning to it which is fun to discover.\n\nThere is nothing special to speak about the music.2 Original songs which are okay and 1 remix version of UP Bihar lootne which is filmed very well and Tusshar dances very well in the song.There are some influences of 'Dumb and Dumber' and a bollywood film 'Nehle pe Dehla' but still looks fresh and modern because of the Contemporary situations and jokes.\n\nIf you are from Stonemen era and very traditional in your thinking and cannot watch Vulgarity and double meaning than do not watch it because it is Unabashedly Vulgar and that's the best part of the film because that gives you abundance of Laughter. If you want to have a best time of your life thn do not miss this Movie. TIP- Be extra attentive in the scene when Danny Dengzongpa and Manisha Koirala are mentioned and ask yourself whether you got the joke, Very Tough to get the joke in the first viewing. I am Proud i got the joke in the First viewing itself.This film isn't Kool, Neither it is Superkool but it is ULTRAKOOL. Enjoy this movie."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Total Timepass film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "tomharry-46558",
        "review_rating": "4",
        "review_title": "Manish Uppal - Played Chintu in the film",
        "review_detailed_main": "Manish Uppal played Chintu character in Kya super kool hai hum...i don't know why not mention in cast...please mention the name in cast."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "aaravpanti",
        "review_rating": "5",
        "review_title": "Super time-pass!",
        "review_detailed_main": "Saw this effing hilarious movie! The director Sachin Yardi also the writer of this movie, what was he thinking! What on earth makes him write such dialogs! ha-ha Its a full on riot. Every 2 mins after a dialog I would look at my friend's face n vice versa, see the reaction, check whether we both got the meaning! Coz we could listen the girls in the theater getting all the meanings of every dialog possible. Haha Both Tushar and Ritesh are really good at comedy. Anupam kher was better in the previous movie of the series. Actress are OK. Film editing is crisp and fast screenplay won't let u get bored.\n\nGo with you friends for this one. Its a funny, naughty, dirty, filthy, stupid, entertaining time-pass movie."
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "jmoneyjohal",
        "review_rating": "7",
        "review_title": "Sexlarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "DareDevilKid",
        "review_rating": "8",
        "review_title": "India's first bonafide adult comedy franchise - an instant classic laugh-riot",
        "review_detailed_main": "Film: Kya Super Kool Hain Hum (2012)\n\nRating: 8.1/10 stars\n\nReviewed By: DareDevilKid_DDK\n\nReasons to cherish this movie:\n\n1.) It creates India's first bonafide adult comedy franchise in the vein of the 'American Pie', the 'Naked Gun', & the 'Austin Power', series.\n\n2.) Its an instant classic & can instantaneously be related with other movies in the same genre - case in point being; 'American Pie 1, 2, 3, & the final installment'; 'Euro Trip', 'The Naked Gun trilogy', Hot Shots & its sequel', & 'the Austin Powers trilogy'.\n\n3.) It even better than its predecessor - which in itself was a classic laugh-riot.\n\n4.) Its lack of even a semblance of a coherent plot, is adequately supplemented with one hilarious gag after another, basically all credit goes to the writers, for littering their screenplay with perpetual funny scenes & witty dialogs.\n\n5.) Anybody who's not a complete prude, will reminisce whats it feels like to have no-hold-barred fun, & laugh incessantly in the theater after eons.\n\n6.) Ritesh Deshmukh - he's on fire, give him a strong supporting role, equal double-billing as in this case, or a multiple star-cast & boy he delivers; but give him a leading role & he begins to flounder. Matter- of-fact, he carries Tushar Kapoor throughout the film.\n\n7.) Thankfully, Ekta Kapoor realized this time, that her brother shouldn't get to do the major scenes.\n\n8.) Its unlike all the recent spate of nonsensical rubbish in the guise of comedies, which make ludicrous claims like \"leaving your brains at home & just enjoying the piece of garbage subjected to us.\" In order to enjoy the copious amounts of double innuendos & wicked gags in this flick, you need to have a brain.\n\n9.) You can't get enough first time around & will be anxiously anticipating the next time you can catch this side-splitting hilarious film. Well, I'm not waiting any longer. I'm on my way to the theater for a huge, second indulgence of this film. Have you even caught it once already? What are you waiting for?"
    },
    {
        "movie_id": "tt2027138",
        "movie_name": "Kyaa Super Kool Hain Hum",
        "movie_rating": "5.0",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "Kyaa Super Kool Hain Hum (A)-----------Rating:4/5",
        "review_detailed_main": "Kyaa Super Kool Hain Hum (A)-----------Rating:4/5\n\n*It is an full fledged comedy entertainer..... *Cast and crew was simple and tusshar kapoor rocked his performances..... *choreography was very good with an average in songs... *Movie contains 90% of \"A\" jokes and comedies that will make u unlimited laugh....\n\nNo story.... - Direction and cinematography was average...\n\n\nAdi is an aspiring actor who ends up featuring in tacky commercials to make ends meet.Sid,also known as the Dude,wants to be a DJ but ends up only with lame offers.A twisted turn of events reveal why both Adi and the dude must find Siya to retrieve something valuable in her custody.Much like its original, the sequel promises unparalleled fun,right from set-up through to the lively and suspenseful final minutes."
    }
]