[
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dbborroughs",
        "review_rating": "5",
        "review_title": "Nowhere near as bad as you've heard",
        "review_detailed_main": "Ever hear of a movie that is suppose to be the extreme of one sort or another that doesn't live up to its billing? Little Nicky is one of those films. Roasted upon its release as one of the worst films of all time Little Nicky turns out to be an okay comedy. Actually this is the kind of movie that has all of the ingredients to be a screamingly funny comedy, but somehow things don't work.\n\nNicky, the son of the devil and an angel is sent to make his way in the world while one of his many brothers tries to take throne of Hell from their father. Casting everyone from Harvey Keitel to Rodney Dangerfield this is a film that fits into the Adam Sandler universe since several characters from some of his other films appear. Its a film that on star power alone should work, but it never catches fire. Sure there are laughs but on the whole nothing ever hangs together to form a full movie. I've seen the film several times and can't figure out what went wrong. Even Adam Sandler as Nicky, in one of the worst portrayals in screen history, isn't the reason this doesn't work. There is something else, some other reason.\n\nStill its worth seeing if you like okay comedies. It never scales the heights its ideas and bits say it should be reaching. If its on try it and see if its for you, you certainly could do worse."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "6",
        "review_title": "You can do worse as far as Sandler movies go",
        "review_detailed_main": "rental shelf, but even he has made the occasional winner, one of the best being Little Nicky. For some reason it's panned over other far worse ones he's churned out of the gumball machine (ever re-watch Billy Madison? What the hell were we/they thinking back then?), but when you part the curtains of Sandler Stigma\u0099 and really just look at what the movie is in itself, it's a hoot. What other film can boast Rodney Dangerfield playing Harvey Keitel's dad in heell? That's right, Keitel is the red beast himself, coming down off a ten thousand year unholy monarchy, with no plans to retire. This infuriates his two wicked sons, played by Tiny Lister (must have been a different devil-mom) and a slick Rhys Ifans. They depart the inferno and set up their own devilish franchise up in New York City, raising all kinds of hell, the most amusing of which is lowering the drinking age to ten (where were these guys when I was that age?) and forcing Regis Philbin to say naughty things on live primetime. Their younger, slightly retarded brother Nicky (Sandler) must pursue them on their haunts and trap them in a magic flask before it's too late. Dumb concept, right? Sure it is, but try and tell me it's not hilarious m, especially with the amount of inane visual gags and trippy production design these folks have dreamed up. Between Hitler dressed as a slutty maid getting a pineapple repeatedly rammed up his rectum to a giant gorilla massaging mammaries that have sprouted on a dude's head like fleshy succulent pigtails, there's no shortage of wtf moments. Sander picks an odd character mask as usual, sporting a metal-head swoosh of a haircut and lisping his way through his lines sounding like he had a stroke from watching Billy Madison dailies one too many times. Patricia Arquette is in it, as a sweet, shy girl he meets topside and the closest thing to a sane person you'll find in this madhouse. Cameos abound, from usual Sandler cronies like Jon Lovitz, Rob Schneider, Kevin Nealon, Dana Carvey, Peter Dante and Allen Covert, to randoms like Michael McKean, Clint Howard, Laura Harring, Henry Winkler, Ozzy Osborne, Reese Witherspoon as Nicky's angelic mom and Quentin Tarantino as a blind preacher. I don't really know what else to say about the thing, because its it's own thing and you either rock out with it, or you don't. Visually it's never boring, the script was conceived in the toilet and jumped straight to the gutter, the performances are all garishly obnoxious and the overall tone is that of an sixth grade birthday party gone rogue."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Hongwaree_Raitao",
        "review_rating": "4",
        "review_title": "When pick the wrong actor...",
        "review_detailed_main": "The movie is super funny, wacky, and if you love dark humor, it is the movie for you...HOWEVER, the movie is totally ruined by Sandler's horrible acting I swear, it gets to the point you want stip watching the movie. If they would have picked a better actor or someone else with a funny face, maybe this movie would have been great. If you can bear Sandler's pathetic acting, you might enjoy the movie. Props for the dog character, he is the real star."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "socrates4",
        "review_rating": "3",
        "review_title": "Sandler At His Worst",
        "review_detailed_main": "I like Adam Sandler a lot. I think he is very funny and I enjoy a lot of his movies. This one, however, was a bit too much for me. He's made some very bad films in addition to the good ones, and usually I know when to skip them. Based on the previews I've seen and what I've heard, I believe he's made worse films than this, but luckily I didn't waste my time with any of those. This is his worst film that I've seen.\n\nThe story is predictable and dull. They only focus on the jokes here, as it is one of those very low comedy type of movies. Those can be entertaining at times, but this one was not. The jokes are not even funny! I don't remember laughing a single time. It's all just a bunch of bad jokes, one after another, in an almost incomprehensibly bad movie. Far too over the top for me. Do not recommend."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "thea-verburg",
        "review_rating": "7",
        "review_title": "This doesn't deserve the low rating",
        "review_detailed_main": "Little Nicky is the story of the son of an angel and \"the\" devil. It is not a smart comedy but it is hilarious and a good time. Just hang back and enjoy. It is definitely funny and the cameo's make it worth it. Stars like Ozzy and a good sh*t-ton of heavy metal music make for a good time. If you have some portion of morbid humor and like some heavy metal, I'd say bring some friends over and have a good time."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "tjcclarke",
        "review_rating": "",
        "review_title": "Hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "nathanmanson",
        "review_rating": "2",
        "review_title": "God awful",
        "review_detailed_main": "The only reason I'm not giving this a one is because it annoyingly made me laugh when he made the Deep South joke. But the actual film was stupid, crap and not funny, fully wouldn't recommend. Adam sandler has made some funny films but this definitely isn't one of them."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "vithiet",
        "review_rating": "1",
        "review_title": "Terrible, even for Adam Sandler",
        "review_detailed_main": "This movie is so bad it's one of the handful movies in my life I stopped watching in the middle. I wish it was possible to give zero Stars here."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mattymatt4ever",
        "review_rating": "7",
        "review_title": "Not as funny on repeat viewings, but a good silly comedy",
        "review_detailed_main": "When I first watched this movie, I was cracking up! And it was one of those incidents in which I was in a crowded theater where I was pretty much the ONLY one laughing at most of the gags! It wasn't exactly embarrassing, but kind of weird. Then again, most of the people that came to see it were mothers and fathers with little children. Please ignore the PG-13 rating--this is NOT a movie for the young ones! I think anyone who has seen Sandler's previous films should know that by now. His sense of humor may be immature, but that doesn't mean it's appropriate for little eyes to see.\n\nI watched this movie again, after I bought the DVD. First of all, I was impressed to discover the cool Easter eggs! It's actually the first DVD to be presented in InfiniFilm. But since it was used as an Easter egg, it wasn't credited as the first InfiniFilm feature. Well, as I learned a lot more about the behind-the-scenes work on this movie; mostly involving special effects, makeup, costume and set design; I gained a better respect for those who were responsible for making \"Little Nicky.\" I thought of it as more than a shallow comedy. It's obvious that the producers of Sandler's previous films didn't have to bend over backwards to produce any flashy effects--in fact, most of them were made on a modest budget.\n\nHowever, the laughs faded away a little. Since this is a silly, superficial comedy, don't expect to pick up on any subtle humor that you might've missed the first time around. I always found Sandler's schtick very silly and meaningless. But he's one of those guys who can make me laugh at things for no apparent reason. Almost as if I'm laughing AT him. I've seen \"Billy Madison\" countless times and I still roll with laughter every time. But with \"Little Nicky\" most of the jokes that I found silly-funny on my initial viewing were just silly on my second.\n\nOne thing to anticipate is a stellar cast. You'll be surprised at the kind of celebrities that pop up in the cameos. Some of the big-name stars include Harvey Keitel, Patricia Arquette, Quentin Tarantino, Reese Witherspoon and (my personal hero) Rodney Dangerfield! And that's just to name a few. It would also help if you've seen Sandler's past films, especially in one particular scene with one of our mystery cameos. You'll be treated to a great inside joke. And of course, expect to see many of Sandler's regulars including Allen Covert, Clint Howard, Peter Dante, Blake Clark and Jon Lovitz.\n\n\"Little Nicky\" is not a thoughtful piece and will probably do nothing to contribute to mankind. But it's a very funny comedy that I simply advise you don't watch over and over again. You'll enjoy it a lot the first time! Of course, the DVD has some really cool features, so if anything pick that up.\n\nMy score: 7 (out of 10)"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jhclues",
        "review_rating": "1",
        "review_title": "You'll Laugh When It's HOW Cold WHERE?",
        "review_detailed_main": "The unwritten law from the Ben Stiller Book of Comedy, is Play It Straight and They Will Laugh; and Woody Allen will tell you that Less is More. Unfortunately, neither Stiller nor Allen were involved with this movie, which in the final analysis, is much `less.' As in `witless,' `tasteless' and `humorless.' Oh, it'll make you laugh at times, but you'll hate yourself in the morning for it. Simply put, in regards to credible comedy, `Little Nicky,' directed by Steven Brill, comes in somewhere near the bottom of the food chain, cinematically speaking. One of the running gags in this film has Nicky responding metaphorically to whomever, when they ask where he comes from, `The south-- the \u0091deep' south--' Which is somehow ironic, because that's exactly where this kind of humor seemingly originates, and belongs.\n\nSatan (Harvey Keitel) has come to the end of his ten-thousand year reign in Hell, and has called together his three sons, Adrian (Rhys Ifans), Cassius (Tom `Tiny' Lister Jr.) and Little Nicky (Adam Sandler), to announce which of the three he has chosen to succeed him as ruler of the Nether world for the next ten-thousand years. Suffice to say that his decision is not well received by the boys, however-- at least not by Adrian and Cassius, who rebel by bolting from this most southern of regions to take up residence in the topside world of the mortals, the souls of whom it is their inherent duty to corrupt. But in so doing, they inadvertently freeze the fire at the gates of Hell, rendering them impassable to all the fallen souls who would enter there; and so it is destined to remain until the two return, which they are not likely to do of their own accord. The situation quickly takes it's toll on the health of Satan, who in his suddenly weakened state is unable to pursue the errant pair himself, and since only a spawn of Satan can match up to another spawn of Satan, the job falls to Little Nicky-- the only other one around who meets the criteria-- who is summarily dispatched to earth to collect his brothers and bring them back down to Hell, whereupon the fire will be rekindled, the gates reopened, and all will once again be...well...'bad.' It's a tough assignment, though, as Nicky's brothers have the ability to possess anyone in the world they so choose, which will make identifying them something of a problem. Not to worry, however; Satan is providing some help for Nicky-- a dog named Mr. Beefy (voice of Robert Smigel), who has experience among the mortals, and will be able to help Nicky negotiate what to him will be virgin territory. And with that, Nicky is off on his quest-- and the laughs begin. Not!\n\nThe story itself is a flight of fancy, a fantasy, which on paper at any rate probably had some possibilities; if only it had been placed in more capable hands. Brill was given a golden opportunity to deliver a movie with some real snap and zing to it, but he dropped the ball, big time, and instead presents the material with little imagination, and the result is a very basic what-you-see-is-what-you-get type of film. There's just nothing beneath the surface at all. Sure, it's a comedy (and that's debatable), but even a film that's not supposed to be taken seriously has to have some substance to it, and this one does not. It almost seems as if Brill approached the project with the attitude that Adam Sandler's presence, alone, would make whatever he put up on the screen work. Bad miscalculation. Scenes that could have been clever, or at least mined for some real humor, are for the most part simply crude, and in most cases lack any redeeming merit whatsoever. His biggest mistake, though, was putting all his eggs in one basket by expecting Sandler to carry the day (and the film) just by showing up. He apparently didn't understand that Sandler is an actor who needs a director who can keep him on task-- he needs direction, and plenty of it-- and he didn't get it from Brill.\n\nSandler has been better-- much better; as Robbie, in `The Wedding Singer,' for instance, or even as Bobby, in `The Waterboy.' Both films in which he created a character that was at least credible or viable within the context of the story. But his `Nicky' just doesn't get the job done, because he fails to even really create a character at all, but instead `plays at' creating a character, which is something else entirely. Someone-- and the most likely suspect would be Brill-- should have told him that merely contorting his face and exaggerating the perpetually pubescent whine in his voice is not what it takes to `create' a real character. And, regardless of the genre in which the actor is playing, it's absolutely essential that the character he presents is real and believable within the environment and the setting of the story. If he's playing a devil in Hell, that devil had better be real, or it's simply not going to work; and this film proves it. And lowering the bar to go after cheap laughs can't save it, either.\n\nThe supporting cast includes Rodney Dangerfield (Lucifer), Patricia Arquette (Valerie), Peter Dante (Peter), Jonathan Loughran (John), Dana Carvey (Referee), Jon Lovitz (Peeper), Kevin Nealon (Gatekeeper), Michael McKean (Chief of Police), Quentin Tarantino (Deacon) and Reese Witherspoon (Holly). A real artist will earn every laugh he gets, and it's genuine; it's something real, and it's worthwhile. This film generates some laughs, to be sure-- but they're not earned, and consequently, they're plastic, and they're disposable. And yes, there IS a difference. Any doubts, just ask Ben Stiller or Woody Allen. Or Steve Martin; or Lucille Ball, Joan Davis, Red Skelton or W.C. Fields. And while you're at it, maybe you can pass on what you learn to Adam Sandler. It may help. 1/10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "robbie-20",
        "review_rating": "10",
        "review_title": "Pretty underrated!",
        "review_detailed_main": "Geeze, this movie got the shaft! I thought it was a lot of fun and pretty funny. The Ozzy Osbourne line, 'Here, kill him with theeees' cracks me up every time. I don't know why this is disdained so much. Sure, it's no \"Rushmore\", but it has its place and I enjoy it for what it is--a kind-hearted, dumb, funny comedy in the vein of \"Dumb & Dumber\" or \"Tommy Boy\"--both classic movies in and of themselves. In that category, I give \"Little Nicky\" a 10! Blow-hards and elitists need not apply...."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "glennfortune",
        "review_rating": "7",
        "review_title": "Good for 2000",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "The litmus test for Adam Sandler films",
        "review_detailed_main": "This film is about one of the sons of Satan coming to Earth to prevent a disaster of apocalyptic proportions--though why Satan and Nicky would want to prevent this is beyond me.\n\nAdam Sandler is talented and has made some decent films. However, he's also made a lot of crap. For every good film like THE WEDDING SINGER or THE WATERBOY, he's made lame films like an unnecessary remake like MR. DEEDS (with Sandler having the nerve to try to replicate a film classic that starred the great Gary Cooper) as well as LITTLE NICKY. Sure, there are a few films that fall towards the middle (CLICK comes to mind), but in general his films tend to either be very good or very, very bad. I am a high school teacher and can tell you that most kids seem to like all of Sandler's films, but if he ever wants to address a wider audience or be seen as an artist and not a buffoon, a few more films like LITTLE NICKY will kill these dreams forever! Of course, he's richer than the Pope, so perhaps he doesn't mind that he often makes crap.\n\nWhy is LITTLE NICKY so bad? Well, the biggest problem is that is just isn't very funny and often substitutes dirty and smarmy material for real laughs. While making a comedy about Satan and Hell is already a tough job, it could have come off much, much better (such as the case of BILL AND TED'S BOGUS JOURNEY). Here, it just seems like a film written by 7 year-olds--the sort of kids that might find Bevis and Butthead's humor a bit too sophisticated and cerebral!! Crude jokes (such as an obnoxious and sexually obsessed dog as well as a scene where demons shove pineapples into Hitler's rectum) almost always fall flat and at almost no time does the script head towards the clever or the funny. It's just crude and nasty.\n\nLow, stupid and completely without value. Heaven help us, a lot of people amazingly think this is a GOOD film!! Look at all the people who actually gave this crud a score of 10 and act as if it's comparable to films such as GONE WITH THE WIND or DR. STRANGELOVE!!! This is ample evidence that, in general, people are stupid and will pay to see anything! In addition, the fact that people like this is proof that the predictions in the film IDIOCRACY aren't too far from true today!\n\nBy the way, you might find it very interesting to look at the statistics for the ratings. About as many people loved it as hated it. However, if you look by demographics such as age, you'll see that the older you get, the more likely you'll hate the film. I am now 44, so I can't imagine hating this film even more when I am in my 60s! In addition, the top reviewers on IMDb and IMDb staff rate the film significantly lower than the general public."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "One or two good moments in a film of basic, unfunny bad taste moments with a cast that looked good on paper but are either bad, embarrassing, wasted or all three",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Razzbar",
        "review_rating": "1",
        "review_title": "Stench",
        "review_detailed_main": "I have never seen a movie turned into such a piece of garbage by one character. I don't mean Adam Sandler the actor, I mean the way over the top way his character was presented. I've never seen such extreme overplaying of a character. He's a whining, stammering, bent-over, fidgeting, totally annoying basket case of humanity with his long hair plastered down over his face, and on and on. It was like the creators of the movie stayed up way too late dreaming up ways to make this character pathetic.\n\nThis might have been an ok movie, but every time Sandler's character came into a scene (most scenes), I just cringed by the pathetic overacting. After seeing this movie, I hated Sandler for a while until I recalled him in The Water Boy, a movie I enjoyed. It wasn't Sandler so much as the incredibly stupid way he was directed and how his character was designed.\n\nThere was a lot to like about the movie otherwise, but that character kept coming in so often, that the overall enjoyment of the movie was completely ruined.\n\nI guess you might like Little Nickey if you enjoy the sights and sounds of a shivering miniature poodle that won't stop whining and barking for a second. On second thought the poodle isn't as obnoxious.\n\nWords fail me. This movie totally stank thanks to that one character."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dobbin-4",
        "review_rating": "7",
        "review_title": "Little Nicky: another review",
        "review_detailed_main": "Now this is the one Adam Sandler movie I do not get the rating off I mean if people like stuff like chuck and Larry and Happy Gilmore then why the hell do they not like this. Anyway the movie centers around Nicky a very geeky devils son who is sent on a mission to get his evil brother back for his Daddy Satan. The film is a must watch for Adam Sandler fans and just goes to show that people take movies too seriously now days like Adam Sandler movies are meant to be watched and after you watch them you are meant to say \"man that was a no brain comedy\". Overall watch this movie for a laugh and not particularly for anything else. I rate this film a fair 73% for making me laugh."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "DJ-75",
        "review_rating": "1",
        "review_title": "Not quite the worst movie ever made, but close.",
        "review_detailed_main": "For those who said that this was a movie for Sandler fans only...what b.s. I enjoyed Billy Madison, Happy Gilmore, Wedding Singer, but Little Nicky was downright awful. Perhaps the joke is on me, as I paid to see the darn thing. I kept waiting for the film to hit its stride, make me laugh...but unfortunately, that moment never came.\n\nSome silly special effects (talking dog), but haven't movie-goers seen this before?\n\nSandler fans...wait til this one comes out on video, or maybe cable...which could be in a few weeks...2 out of 10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "moscow-29155",
        "review_rating": "7",
        "review_title": "Cool",
        "review_detailed_main": "When the time came for the Devil to hand over hell to one of his heirs and retire, he decided to keep the power for himself. But they didn't like it, and they decide to run to Earth to create their own hell there. Because the children were on Earth, the Devil began to fall apart. He sends his younger and beloved son Nikki after the rebellious brothers."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Tab132",
        "review_rating": "1",
        "review_title": "Funny....when i was 7.",
        "review_detailed_main": "*Sigh*, looking through my VHS collection and biting the bullet to re-watch this piece of sh*t was the easy part. Within the first 3 minutes you already know what your in for, a peeping tom dies and goes to hell to get humped by a actor dressed like a big bird, meanwhile 'I'm your boogie man' is playing in the background. We're introduced to Nicky who 'jams' with some large random weapon, his dad's assistant is basically used as the introduction to the plot, his dad (the devil), played by Harvey Keitel for some odd reason, is making the decision on who should be his successor for then next 10,000 years. It never explains why someones 'in office' for 10,000 years but there's not much need to care anyways. He also remarks on how Nicky was pretty until his brother hit him in the face with a shovel, foreshadowing his brothers as the antagonists. Basically, his dad declares himself ruler for another 10,000 years and Nicky's 2 brothers go to earth freezing the gate to hell, thus causing the devil to die for some reason(?), Keitel's finger falls off and Nicky starts his journey to return his brothers to hell.\n\nProbably about 10 minutes in now, the first thing that sticks out, is Sander. Sandler, while acceptable in just about all his other movies to this date (excluding that one where he's on a boat.), he's f*cking terrible in this. No words can explain how bad his performance is, its shallow, its half-a*sed, its not funny, its just ridiculously awful. To quote another disappointing movie, the ringer, 'I've seen better acting in porno'. As a whole, the supporting cast is also terrible. Nicky's sidekick i guess you'd say is a talking pit-bull glances at a doorstep that says 'i love acting' on it, he pis*es on it and says 'you love acting, well i love pis*ing', and to make matters even more mind numbingly awful the pis* is cgi'd obviously. Oh thats the next thing, the effects and production. This paragraphs dedicated to acting so let me get back on track. Usual members from the happy Madison gang are here, i've spotted like 4 people that are also in grandmas boy, and other crap flicks like the animal and Mr deeds and crap. Performances are half a*sed too, at most times secondary actor just read a line or two devoid of emotion or any form of acting. One standout role though is Quinton Tarantinos cameo as a blind preacher who appears about 3 times, other then that, nothing.\n\nThe production is awful. Hell looks, for lack of a better and less offensive term, retarded. There is around 3 sets I've noticed. Nickys room, the entrance to hell, and the (INSANELY BOTCHED) throne. Nicky's room is literally covered in stickers of heavy metal bands, problem is, i counted like over 9000 Ozzy stickers and one big metallica one, obviously the set designers know nothing about metal, nor the crew/cast. The throne is just like a mass hall, except the size of a small house basement, there's nothing that resembles artistic detail at all, it'd pass for a normal room to me. the gates also stupid, there's some rock like walls and a cheap frozen fire effect for the gate it self, no effort seemed to be used. the sad thing is, the gate is easily the most used. The rest of the sets on earth are one apartment room, a basketball stadium thing(I'm not a sports fan.), a park shoot, and the rest is all sidewalks. Oh yeah hell breaks loose by the end, and the sets turn into cgi awfulness, its so awful that by that point i went on my laptop and started chatting. The CGI is as awful as you'd expect from 1999/2000, but...its used throughout the whole movie. in fact all the special effects in the movie were cgi i noticed, of abysmal quality.\n\nLast thing i'm going to rant about is the script, 'What we're they thinking!?' - avgn. Its a comedy, to be a 'good' comedy, it has to be funny. Unfortantly it isn't, its like a stream of half baked jokes like Nicky spinning his head around to entertain his friends (Oh he's doing the exorcist thing, thats pure comedy.), and Satan sticking a pineapple up Hitler's a*s. At a glance, you'r still likely to ask to your self, 'whats the point.'. The plot it self is rubbish. If two brothers out of hell for some reason make the devil have 'a week' to live, wouldn't another one shorten his life span even more thus making his coming to earth a bad idea. The brothers deceiving the humans is also like 'wut?'. They possess a minister and tell everyone 'let the Sin, be-Gin', to which a completely packed church gets out of their seat and everyone starts cheering. Yeah, thats very likely to happen. These parts are somewhat spaced out, because until like the last 20 minutes, Nicky does nothing but walk around, and do nothing. None of the jokes are funny, the plot is literally insane, its lost in its own continuity also.\n\ni'm not going to spell check this review cause i feel that the movie sucked so bad that it's not worth the time of what i've already written. It sucks, it sucks even on a Adam Sander level. Its not funny, its not entertaining, its just downright lame. Bad script, bad acting, bad story, bad production, bad just about everything. To the mind of a child, its acceptable, but for a audience over 12 (The movies rated pg13 by the way.), its damn near worth destroying. I wouldn't watch this movie again if i were paid too, even for a million, i'd rather have my dignity."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "johnnoau",
        "review_rating": "7",
        "review_title": "Cheesy fun... Just need to lighten up a little!",
        "review_detailed_main": "Little Nicky is a love it or hate it movie... Personally, I love it. It's silly, cheesy and doesn't pretend to be anything else. From the sarcastic dog's snoring to the Chicago record to Quentin Tarantino's blind preacher, it's got plenty of proper laughs. Yes, it's crude, but it's clearly not made to be sophisticated - the special effects are terrible and Adam Sandler is at his cheesiest best. That's what gives this movie its charm - the fact that it doesn't take itself too seriously.\n\nLet's not forget the soundtrack - personally, I think it's probably one of the most awesome out there - with everything from P.O.D to AC/DC, Foo Fighters/Dave Grohl, Scorpions, Van Halen and more.\n\nGo into this movie with high expectations & a view that everything has to have the utmost artistic integrity, special effects and the best acting and you'll be bitterly disappointed. Watch it with an open mind for silly, dark comedy and b-grade charm and you'll probably be pleasantly surprised!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "demers-charles",
        "review_rating": "2",
        "review_title": "When was the last time you stopped a movie?",
        "review_detailed_main": "For me it was watching this wreck. If this was supposed to be a comedy, it didn't make me laugh once. The overplayed \"stupid boy\" Sandler role brought nothing new. I'm glad I didn't waste time on this movie before but sad I did now. This was definitely a low in Sandler's career."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "darkgodmobutu",
        "review_rating": "10",
        "review_title": "The Quintessential Sandler Film!",
        "review_detailed_main": "This was a great film and one of the best films of the year, contrary to what so many others say. This is the second most underrated & unappreciated movie of 2000, following Book of Shadows: The Blair Witch 2. There is nothing to not like about this movie, it is virtually non-stop laughs from beginning to end.\n\nReading some other user's reviews I'm stunned at their disdain and hatred for this great film. People always say that this is no Citizen Kane...well duh...to quote Highlander \"There can be only one!\". Now I'm not saying that this movie is in the same league as Citizen Kane, but that doesn't mean it's bad. This is an epic Sandler piece, and his funniest to date, and is quite possibly the definitive Sandler film.\n\nUnlike most people, I loathed Big Daddy, writing it off as cheesy and overly sentimental; a one-joke gag stretched beyond its limits. Luckily that does not apply to this film, every aspect of this film is great, from the surprise cameo by \"CHUBS\" (Carl Weathers) to Harvey Keitel's hilarious turn as Papa Satan. You've gotta love a movie that lets Quentin Tarantino use his \"unique\" acting \"ability\" to his advantage in a brilliant performance as the religious zealot. My favorite cameo belongs to B-Movie God Clint Howard...after this movie, I don't think I'll ever look at him the same way again! The Cameos are worth the ticket price alone!\n\nThe story was top-notch and was brilliantly executed. This film definitely shows maturity in Adam Sandler and Tim Herlihy's writing abilities, as they created a complex and involving storyline, and great and hilarious characters.\n\nI recommend this film to any film fans. Give this one a shot, regardless of your personal view of Sandler and his talent. Sandler is one of the most underrated and ridiculed acts out there today, which is sad considering his remarkable talent. How many other performers out there today write, produce, and star in their own films?\n\nI give this one * * * * * * out of * * * * *"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "AlexanderRohdeJ",
        "review_rating": "7",
        "review_title": "A movie for Sandler fans",
        "review_detailed_main": "I have seen every Adam Sandler film ever made. And I love ALL of them! I know that might be controversial. But honestly his movies make me laugh. And one thing his movies all have in common, that I think people fail to see. Is the fact that they all have a sweet feel good ending. And I LOVE that! I'm the biggest Sandler fan ever, and this movie is super funny but probably only for his fans. It's a little silly at times but has tons of funny gags and jokes in it. Also tons of cameos! I highly recommend this to any Sandler fans!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Herbest8",
        "review_rating": "1",
        "review_title": "What the ****?!",
        "review_detailed_main": "Let me just tell you the plot while I drown my sorrows: The son of Satan (played by Adam Sandler) is sent by his father to New York City in order to retrieve his two trouble-making brothers. While doing so, he makes friends, meets his mother and saves the planet.\n\nWhere do I begin? Well, this piece of garbage is utterly HORRIBLE. It has no funny moments, Sandler makes a complete fool of himself and they even take the time to rip off Sandler's masterpiece \"Happy Gilmore\" in an admittedly clever cameo by Carl Weathers.\n\nBut the biggest sin of all is the wasted and I do mean WASTED all-star cast that includes everyone from Ozzy Osbourne to Rodney Dangerfield. How in the world did anyone associated with the making of this bomb think that this would be funny, let alone watchable? Sandler is a good actor although I do consider him an acquired tastes and this is definitely not his finest hour. Another problem is that the film looks incredibly ugly. The set design looks like the love den of a Ridley Scott/Tim Burton enthusiast. You also know your in trouble when every single character is ugly and stupid.\n\nI want you to consider this a PSA in addition to a review: avoid this stinker at all costs. You have been warned."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "bodyshots80",
        "review_rating": "1",
        "review_title": "Adam Sandler meets Magnum P.I.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "brettthomastaylor",
        "review_rating": "7",
        "review_title": "One of the greatest soundtracks for a comedy",
        "review_detailed_main": "The second time I've watched this film. I must say the second rewatch was more enjoyable than the first, but i was in the mood for a \"slapstick\" comedy. I'm a big Sandler fan, so I'm slightly biased. Haha. But this was right up my street. It hasn't got a strong storyline, the acting is questionable. But just seeing Chubbs (from happy gilmore) in heaven was enough to have me enjoying this one. Plus the soundtrack took me back to the 00s. Id put it out there, I'd say the best soundtrack around for a Sandler film. But each to their own. Easy watch with a few beers and a pizza. I fully enjoyed it."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "snaeem155",
        "review_rating": "1",
        "review_title": "Absolutely Horrific.",
        "review_detailed_main": "Why was this even made. It's so bad I cannot actually put into words how bad it is."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lee_eisenberg",
        "review_rating": "7",
        "review_title": "devilishly cool, if completely ridiculous",
        "review_detailed_main": "Since \"Little Nicky\" stars Adam Sandler, it's pretty much a given that the whole thing's going to be completely silly. And it is. Starring him as the weird-voiced son of Satan (Harvey Keitel) going to New York to find his brothers (Rhys Ifans and Tiny Lister) who fled Hell and stopped sinners from entering, there's everything that one would expect - except that I didn't expect to see Rodney Dangerfield as Lucifer. It's the sort of movie that you only see if you're ready for sheer goofy nonsense. As it was, this was one of several devil-related movies released in 2000, although the \"Exorcist\" re-release was the only other one worth seeing. Also starring Patricia Arquette, Jon Lovitz, Kevin Nealon, Reese Witherspoon, and Henry Winkler."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "Finally, solid proof that Adam Sandler is the spawn of the devil...",
        "review_detailed_main": "I've seen this movie a few times. Why, I can't say for sure. Maybe because I enjoyed the music. Maybe because I was trying to figure out why the hell(pun intended) people said it was funny. Maybe I was looking for what it is people rave about with all Adam Sandler films; I guess I just couldn't really come to terms with the simple fact that this is not good entertainment. It's not even bad entertainment. Heck, I don't think it can be classified as 'entertainment', period. The film has so many flaws that even the most anal-retentive viewers finally tire off counting them. Early in the film, two of Satan's sons decide to go up on earth, upon learning that neither of them will be the devil in the next 10.000 years. What I'm wondering is, did this never happen before? Didn't they even consider the possibility of it? Satan is the epitome of all things evil, wouldn't he be smart enough to know that his own sons might pull a fast one like that? The plot has more holes than Swiss cheese. The acting is about as flat as a pancake that has been run over by several trucks. The characters are cardboard cutouts who spout cliché lines. The humor is juvenile, consisting of lame slapstick and childish gross-out comedy. The script seems like it could have been written by a child, which is no surprise, seeing as how Sandler penned some of it himself. You want a good laugh? See a good comedy. You want to spend the 90 minutes of your life you might waste on this movie wisely? Go watch a good movie. Or even one that is slightly better than this. Won't be hard to find. Simply put: You want entertainment? Look elsewhere. I recommend this only to hardcore Adam Sandler fans, as no one else could possibly enjoy it. 1/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "bellino-angelo2014",
        "review_rating": "7",
        "review_title": "A movie that should not be taken seriously. Just take it for what it is.",
        "review_detailed_main": "Before going to the review, I have to say that with a few exceptions, I liked most of Adam Sandler's movies. In my opinion he is among the best comedy actors of the 1990s-2000s despite some poor choices. And this, despite not among his best work, it's also enjoyable.\n\nThis movie is about the devil (played by veteran Harvey Keitel) that sends his younger son (Sandler) for taking back his two brothers to hell. He has to go to New York and in the meanwhile he meets his mother (an angel played by Reese Whiterspoon), he joins a basketball game, goes in and out from various night clubs and it ends in various other funny scenarios.\n\nThis is the plot. While for many according also to the reviews in this site it may seem dumb and low-brow it has also his entertaining factors. Despite Sandler's way of talking and mannerisms are annoying, in the end it made me snicker. Almost all the other actors in the cast (Harvey Keitel, Reese Whiterspoon, Patricia Arquette, Rhys Ifans and even legendary director Quentin Tarantino) have small roles but they are also entertaining. I have to agree with the haters that the humour at times is offensive and in a few fragments a bit gross, but it's not that important in the end.\n\nWorth recommended to all fans of silly comedies and fans of dark humour as well."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Matt-162",
        "review_rating": "1",
        "review_title": "This was far beyond terrible...",
        "review_detailed_main": "...and a \"one\" is far too high a rating. Yes, typically I have been a fan of Adam Sandler's films so I was fully aware of some of the silliness that would await me. I just had no idea it would cross that line into vile stupidity.\n\nThe gags aren't funny. They are extremely obvious and tedious. A degree of that is par for the course with Sandler's stuff, but this really went over the top. All the cameos by famous actors and faces only dresses up what this film really is. Garbage. Very expensive garbage...and I'm terribly upset that I bought a ticket and helped pay off this garbage. I wish I had flipped through the reviews on here first and possibly saved myself a trip. I gave Sandler the benefit of the doubt. I'll definitely be more careful next time. Please....if you're reading this review...WAIT FOR VIDEO! Or even better, DON'T SEE IT AT ALL!\n\nForgive me for the lack of detail here, but there's really not much more to say as I see it."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "renaldo and clara",
        "review_rating": "10",
        "review_title": "The Shiz-nit!",
        "review_detailed_main": "This movie rocks. From the actor who plays Adrian, (Rhys Ifans?) to Adam himself, to the \"Kenny G\" roommate, to the dog, who 'steals' the whole show.\n\nI honestly try to understand why so many people thought this film sucked. They are probably stuck on Sandler's old (less refined) style. Well, guess what; he's changed. Sure it was funny to watch him get drunk and violent, like in <Happy Gilmore>, but Little Nicky is 10 times the entertainment of all those other Sandler films combined. Especially Billy Madison, which I thought was his worst film (no, maybe Airheads;)\n\nThis is why you should see <Little Nicky>:\n\n1) The soundtrack is awesome 2) It's romantic (talking about butterflies, perfume, love, and floating) 3) All the funny cameos (And believe me, there were a LOT and they were all funny-Henry Winkler, Rob Schneider, Dan Marino, Dana Carvey, Regis Philbin, Ron Howard's brother, and Jon Lovitz to name a few....) In response to the negativity toward short cameos and \"ac-TEURS that should've been used more\"...*PLEASE!* Since when were Adam Sandler films about boring the audience to death with actors that \"deserve\" this and that.....You say they're thrown in there just because? You're right! Sandler simply loves the effect a 1 or 2-liner has on an audience! So what else you got? 4) It was extremely well-written. 5) It was pretty scary..no joke! 6) There's a talking bulldog who went out with a sewer rat!\n\nSeriously, watch Little Nicky; it's warm-hearted and a lot funnier than <Big Daddy>. Sandler's best film to date!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Chase_Witherspoon",
        "review_rating": "7",
        "review_title": "I'm from the south, the deep south",
        "review_detailed_main": "At the risk of being ridiculed for eternity, I'm going to confess to finding this movie extremely entertaining. So much so, I bought it and watch it every once in a while. Simple story; the devil's (Keitel) introverted son Nicky (Sandler) must ascend to earth in order to defeat his evil brother (Ifans) whose efforts to bring about the rapture are causing Keitel to gradually decompose. Whilst on earth, Nicky falls in love with his antithesis, a bookish good Samaritan Valerie (Arquette) but has trouble adjusting to the concept of mortality.\n\nHe shares a house with frequent Sandler collaborator Allen Covert whilst being pursued by a couple of crazy demon worshipers and partnered with a randy mutt called Mr Beefy, sensationally voiced by Robert Smigel. In one wild night on the weed, the motley crew listen to \"Chicago\" songs backward, while Nicky regales the mortals with his head-twisting feats. Sandler is over the top with his crazed persona, but still hilarious. Rodney Dangerfield also appears in one his last films as Nicky's foul-mouthed grandfather, while Reece Witherspoon makes an unexpected cameo appearance as his angelic mother.\n\nI know a lot of people who've seen this movie don't rate it, but I've always found it - in context - a highly entertaining romp squarely aimed at the adolescent, young adult market and an ideal video accompaniment to a beer and pizza evening."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "VaughnMNY1",
        "review_rating": "1",
        "review_title": "Simply the worst movie ever made..and for that reason you should see it",
        "review_detailed_main": "There comes a time in a mans life when he is witness to a truly life changing event. the moon landing, The falling of the Berlin wall, the birth of your first child or you meeting your lovely wife. in the annals of human futility in movie making.. that remarkable event was the making of the film little Nicky.. and anyone who saw this absolute cinematic abortion.\n\nThere is NOTHING funny about this movie...NOTHING. This is the first time I have gone to a movie and actually become ANGRY watching a comedy. I only thank god I did not pay to see this. And look I am dumbing this movie down on the Adam Sander level. I have not expected much from Adam Sandler movies.. I have NOTHING against the guy.I mean I like Adam Sandler. I just find his movies OK.. but leave it to him to not even reach the absolutely 1 one millionth of an inch bar that has been set. If reaching the bar for this movie was a inch high.. he would be digging under ground for 2 miles.\n\nTrying to describe the movie does not do its futility justice. No words, phrases, interpolative dances or biblical scrawling have yet to be invented to describe the absolute time decaying event that is sitting through this film. I only watched it because I knew that i was truly in the moment of history.. a cinematic event on the level of the Hindenburg crashing.Its seemed as if the four horsemen of the Apocalypse rode through the screen laughing and exalting your every minute as you sat through each frame decaying frame after another. If films had a smell, this film would reek of absolute desolation and despair. If failure had a smell it would be this film. I looked at it in wonder as if why would someone put this train wreck on film..why because we are someone what drawn to human tragedy.. well I cant answer those question.. Biblical scholars and Pyscholgist can better explain the deep corners of the mind that this film tends to attack.\n\nIn closing NO FILM can try to be as bad as little Nicky .. films can only come close to being as bad as this film was. we have hit the Rosetta stone of absolute cinematic failure..And hopefully those of us who have seen it came away without having our eyes bleed and our bodies turned to stone. And for that reason if you want to see the benchmark for futility.. you should see this film.. just so you can know how bad a film can be. Thank god I survived....or did i?"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "kibler@adelphia.net",
        "review_rating": "",
        "review_title": "Adam, enough already!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "cmadsen22",
        "review_rating": "1",
        "review_title": "As bad movies go, this one is pretty bad!!!",
        "review_detailed_main": "Amid the wake of all the \"fake critic\" scandals going on right now I find it extremely unbelievable that people actually consider this movie to be one of Sandler's best films. Sandler is a very funny comedian, but this is not a comedy. If there is a scene in this movie that is even remotely laughable, then it would be when chubbs shows up. I sat in a movie theater listening to a teenage audience laugh hysterically at this movie. Come on. The only reason I stuck around to finish the movie is I was listening to that feeling that tells you \"This movie cannot suck any worse, it has to get better.\" Lo and behold, it does not even reach a watchable level. What is funny about a man with breasts on his head? It might have been a little funny when the same sight gag was done in Weird Science. The other thing that I cannot understand would be is this a horror film or a comedy. It looks like there are a lot of people that assume this is a horror film (although I do not understand THAT at all). If you want a good comedy/horror film go pick up any of the Leprechaun flicks and realize that the acting/plots/etc. are far more advanced than this film."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "tomimt",
        "review_rating": "6",
        "review_title": "Wrong lead casting",
        "review_detailed_main": "Oh woe... Despite the fact, that Mr. Sandler has happened to write the movie doesn't always mean, that he should also act in them. Normally I wouldn't mind, as Sandlers comedies are pretty typical watch and forget movies, but Little Nicky has so much potential it almost breaks my mind to think someone in the lead who actually can act.\n\nNow we have Sandler as son of Satan and he is everything but the part. Oh well, Sandler we have to live with so that's the end of that then.\n\nDon't get me wrong, there are lots of funny stuff in the film and there are good actors too, like Harvey Keitel (Satan) and Rhys Ifans (Adrian). Patricia Arquette (Valerie, Nicky's girlfriend) does a good part as well. It's just that Sandler has so dominant part of the film, that his inability to act more than one character really hangs like an iron ball on the leg of the film.\n\nMaybe most hardcore Sandler fans will like this more than I, but I still can recommend this for at least one viewing so you can make your own mind about the flick. But personally I doubt I'll be adding this on my DVD collection."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Thomas_T",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "This was a horrible \"comedy\".. I went it with mediocre high hopes of having a good laugh, but was very disappointed. Adam Sandler was good in Big Daddy, The Waterboy etc, but this.. this was a huge downer. Actors like Quentin Tarantino, and other well-known characters should be ashamed of having participated in this piece of junk. What a terrible cast this movie had. The whole idea behind the movie, with a sympathic devil in hell and a retarded son thats a nice guy, should have started several alarmbells in my head urging me to not see this movie, but they were obviously all victims to a powerfailure.\n\nThere were hardly any laughs, even you had a 2-seconds laugh now and then. Some punchlines were just so dumb and malplaced that you felt like walking out on this one. And thats my advice to you, if you ever get lost in the city and accidently end up in a theathre showing this movie."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ryanconduit",
        "review_rating": "7",
        "review_title": "This Coke tastes like Pepsi.",
        "review_detailed_main": "This Adam Sandler comedy is packed with all you need for quality entertainment, it does not go without saying I can understand it might hit a certain niche but does that mean this is a bad movie? Absolutely not.\n\nThe Soundtrack is pure nostalgia and even if you didn't grow up with the tunes Happy Maddison productions never fails to deliver great music on their films and this movie is a prime example.\n\nThe cameos and tallent on the roster really help bring things together. A time when bringing in familiar faces made the viewing experience exiting and fun and not for the sake of a cash cow.\n\nThe lines don't always hit the mark and the dialogue can be pretty cheesy at times but it doesn't tarnish the outcome by any means, there are still some great one liners and funny material to go around.\n\nTo finish off, is this movie a masterpiece? Not at all its pretty far from it, but if you are looking for a laugh and a giggle that comes from a good place this 90 minute comedy is were its at."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jcooper-91718",
        "review_rating": "1",
        "review_title": "There is a special place in hell for Adam Sandler",
        "review_detailed_main": "If you survived this Guantanamo Bay torture session than you deserve a Purple Heart. Adam Sandler speaks with an annoying speech inpendement that makes his dialogue unbearable. The jokes are also really unfunny. Avoid this movie it isn't even ironically funny."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "buyjesus",
        "review_rating": "7",
        "review_title": "a step forward",
        "review_detailed_main": "Sandler and Herily should be commended at the very least for attempting something new. There is currently no other movie out there like Little Nicky. It screams for recognition and unfortunately got little to none and perhaps (as his next project has director Paul Thomas Anderson attached) when Adam Sandler pulls a miraculous Jim Carrey 360 into an actual actor of artisitic merit, this will be the overlooked gem. The special fx look crisp and cutting edge. Hell itself is fantastic. the actors give their all with effective comic timing. even non-comedians like harvey keitel. it effectively blended a slight surrealist tinge with some pretty crude and lowbrow humor, which is not an easy task. it also touched on the subject of religion, being satirical without being offensive. make no mistake, the film is no masterpiece. it falls victim to many of the same serious pitfalls that stifle other comedies made by former SNL members. It also overcompensates in an idealistically complex plot that leaves quite a few loopholes that audience members might scratch their heads at. But screw it, movies like this don't win awards anyway and at the very least it shows remarkable potential and growth for the writing time that has spawned the majority of the Sandler-driven movies to date. it has terrific cameos by the likes of dana carvey, henry winkler, regis philbin, etc. the final 20 minutes loses momentum a bit and drags on for a while, but all is rewarded by the end."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "chillidipcass",
        "review_rating": "2",
        "review_title": "Watch only on drugs. A sober mind would turn it of",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "gigamath2",
        "review_rating": "10",
        "review_title": "brilliant!",
        "review_detailed_main": "An absolutely brilliant and ingenious comedy. I am puzzled as to why this movie received such average reviews. I never listen to critics anyway. This film has so many angles. It's a fish out of water story with Sandler lost in New York, spoof of the punk rock genre, the damsel in distress theme, hilarious cameo with Rodney Dangerfield in Hell, the sarcastic talking dog, the John Lovitz peeping tom episode, sight gags galore, and the ultimate pineapple in Hiter's you-know-what. I laughed myself silly. This flick is raucously entertaining, but you need to appreciate Sandler's humor, which is an acquired taste, like beer. History will be kind to Sandler I think. Now for a true remake of Mad Mad Mad Mad World, with Sandler, Lovitz, Martin, Carrey, Murphy, and the rest of the SNL crowd."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "BrnzReviews",
        "review_rating": "7",
        "review_title": "\"Get In The Flask\" Hilarious Comedy",
        "review_detailed_main": "This is one of my favourite Adam Sandler movies and I watched it years ago. The very thought of this movie was entertaining enough let alone the actual watch which was even better than I thought it would be. Truly remarkable story about the devils sons redemption at being a good person despite his evil brothers.\n\nI really enjoyed this movie, very entertaining, kept me intrigued the whole way through, highly recommend."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Raydio",
        "review_rating": "1",
        "review_title": "Appalling dreck",
        "review_detailed_main": "As a big fan of movies in general, and comedies in particular, I was EXTREMELY disappointed, even slightly offended, by this dreadful piece of garbage. Of all the films I've thus far rated on the IMDB, \"Little Nicky\" now holds pride of place as the worst film to date. Whatever possessed such fine talent as Harvey Keitel and Reese Witherspoon to stoop so low as to involve themselves with this horrid mess? And Rhys Ifans, after such a memorable, and genuinely funny performance in \"Notting Hill\" - shame on you! In fact shame on everyone involved in this mind numbing, boring, tasteless, waste of celluloid. If ever we needed proof that Adam Sandler's star has fallen big-time, then this is surely it. I truly enjoyed \"The Wedding Singer\" and \"Happy Gilmore\", but then, those movies were actually funny! \"Little Nicky\", unlike \"Plan 9 From Outer Space\", isn't even unintentionally funny. My advice to those folks involved in the creation of this trash, perhaps it's time to consider a new career, in say, waste management. 1/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "HarlenPepper",
        "review_rating": "",
        "review_title": "Like a really bad bowel movement",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "preppy-3",
        "review_rating": "1",
        "review_title": "Vile",
        "review_detailed_main": "Stupid, disgusting, unfunny. An Adam Sandler \"comedy\". He plays one of the Devil's (Harvey Keitel--why Harvey??) sons who is sent to Earth to bring back his brothers who are intent on taking over the world. He's also given a talking dog to help him. You know you're in trouble when the dog is giving the best performance.\n\nAll the jokes are sick (how did this get a PG-13?), degrading, homophobic and sexist. Sandler never could act and Keitel looks desperate to get out of there. When you have Rodney Dangerfield do a cameo and even HE isn't funny there's something terribly terribly wrong. I had to turn this off after half an hour--my stomach couldn't take any more. A utter piece of garbage. Even Sandler fans didn't see this when it came out. What does that tell you? Avoid"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "RussianPantyHog",
        "review_rating": "6",
        "review_title": "Brilliant, except for one enormous flaw",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "hodges_ss",
        "review_rating": "1",
        "review_title": "They would have had to make this movie a lot better to make it suck!",
        "review_detailed_main": "My only regret is I can't rate it with a negative number! Please, do yourself a favor and don't rent this movie. It would be a waste of time and money. Sandler is the typical retard saving the day, only this time it's not funny at all."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Anonymous_Maxine",
        "review_rating": "7",
        "review_title": "Yeah, Ozzy!!",
        "review_detailed_main": "Why do I say Yeah, Ozzy? Because Ozzy Osbourne made this film. I don't care who wrote it, I don't care who starred in it, and I don't care who directed it, if Ozzy hadn't been in Little Nicky, there would be absolutely no reason to watch it. Even the great Harvey Keitel, who obviously makes an excellent Satan, was ill-used if for no other reason than that idiotic deterioration that left him as nothing but a pair of arms and a mouth. Come on, people! Whose dumbass idea was that?! Anyway, Ozzy's was only one (by far the best one, mind you) of a whole series of cool cameos. We see a whole succession of great cameos in Little Nicky. Ozzy causes every rock and roll fan in the audience to jump up and cheer by biting the head off of the devil when he turns into a bat. Chubbs, Happy Gilmore's late, one-handed golf instructor shows up in a scene in heaven, along with Reese Witherspoon, who effectively plays the part of Little Nicky's angel mother who happens to also be an absolute bimbo. Rodney Dangerfield is his traditional self as the father of Satan (`Even in Hell I get no respect.'). John Lovitz has a scene early in the film where he sits in a tree spying on some woman while she changes, and he's listening to `Lady's Night,' the song that he performed in The Wedding Singer, which was obviously a much better film than this one. Even Dan Marino who, in my opinion, was made famous more by Ace Ventura than anything else, had a great part where he tries to sell his soul to the devil just to win a football game. And, of course, someone was amazingly able to get The Great Quentin Tarantino to play the part of a hideously creepy religious nut, in the second best cameo in the film (even Quentin can't compete with Ozzy). I could go on and on about the cool cameos in this movie.\n\nHow about Little Nicky's room in Hell? What a great room for the son of the devil! Can I say something, by the way? The religious right attacks Marilyn Manson for every little thing he does, but I hereby officially bet any amount of money that no religious group on the planet will ever defend him by pointing out that there was not a single picture or poster of him in Nicky's room in Hell. You have to notice this when you see posters of Metallica, Ozzy (of course), Ministry, Motorhead, Korn, AC/DC, Slipknot, Black Sabbath, etc. No one ever accused Korn of driving kids to worship the devil, yet the devil's son seems to be one of their biggest fans.\n\nThere was a little too much cheesy comedy in this movie. And yes, I realize that it is a `Happy Madison' picture, and that these movies are characterized by their cheesy comedy. But the gigantic pineapple up Hitler was a step in the wrong direction. And how about that damn dog? Remember the scene where he shoots an arrow at Adrian, Nicky's evil brother? Of my GOD, that was ridiculous. And then there were John and Pete, a couple of idiot rock and roll fanatics that appear throughout the film in a series of dumbass scenes that make all rock and roll fans look bad. Although it was cool when one of them asks Nicky what was recorded backwards on Ozzy's record, and Nicky says that `the Blizzard' always delivered his message straight. Too bad they didn't use a Marilyn Manson song to do that, but as much as I respect him and love his music, he doesn't even come close to Ozzy.\n\nLittle Nicky has a lot of cool stuff in it, such as an excellent soundtrack (notice the surprisingly good re-mix of Stupefy, by Disturbed, during the end credits), but most everything else is just pretty bad. And besides that, the soundtrack during the film was used as little more than to pack songs into the movie so that they could sell the soundtrack later, although some of the songs worked really well where they were put into the movie (Particularly Powerman 5000's `When Worlds Collide'). Little Nicky is sent to earth to capture his rebelling older brothers, because they escaped from hell, freezing the entrance and causing their father's deterioration. And then the Son of Satan meets some girl and falls in love with her! Everything about that little subplot was just awful, except for the way that he barely rescued her from the subway train late in the film, but it was actually a good decision to cast Patricia Arquette in this role. Except, remember when Nicky was explaining possession to her? `What do you mean, \u0091possessed?' Come on, Patricia, POSSESSION. Didn't you learn anything from starring in Stigmata?\n\nThe plot of Little Nicky is of no value or interest whatsoever, it's the cameos that make it worth watching. Clearly, there can be no satisfaction derived from watching Adam Sandler's breathy performance as the son of Satan as he `releases the evil' and then `releases the good.' The plot and story are inconsequential, but the movie is still pretty funny at some points, so it's not a complete waste of time. It pays great homage to rock and roll stars as well as previous successful comedies, but if you're not a rock and roll fan or if you haven't seen a lot of these goofy comedies, you are almost sure to be disappointed by Little Nicky."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dsl111-3",
        "review_rating": "1",
        "review_title": "I'm a fan, but not of this...",
        "review_detailed_main": "Purely a money raking venture for Sandler in his worst movie to date. Even for Adam Sandler fans, this still has to be a disappointment as he provides very little of the movie's real humor. This is an unfortunate fact since there is a potentially entertaining plot to build on. Instead, it relies on pathetic cameos from previous Sandler movies to save face in the finale of an otherwise sub par effort. For perhaps the best 'supercomedian' on the market, I think we should expect better. Come on, Adam, you can do it!!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "craigbenting",
        "review_rating": "7",
        "review_title": "Great Comedy Killed by Bad Editing",
        "review_detailed_main": "I rented this movie on DVD and that was it -- $3. I thought it looked stupid and the reviews looked horrible, so I never saw it at the theaters. Watching it, I thought it was a fun movie -- sometimes a little stupid or juvenile. This is why I gave it a 7 out of 10 stars -- quite a bit better than average (got plenty of laughs out of me), but not worth buying (that's one way I measure the worth of a movie because I own over 300 DVD's).\n\nNot worth buying in its *released* form, that is. After watching this movie casually two times (hey, with 5 people in our family we watch a lot of our movies at least two times), I checked out the \"Deleted Scenes\" section on the DVD. Oh my God, WHO EDITED THIS MOVIE??? Yeah, I wouldn't put my hand up EITHER. All I can say is keep your day job because anybody with any sense in the movie industry can see from watching this movie and the deleted scenes that you don't have a CLUE! I couldn't believe how many deleted scenes there were that had us absolutely cracking up laughing -- not only that, but also how many deleted scenes there were total, 21 in all. 3/4 of those scenes were incredibly funny and we kept wondering why they cut them -- they cut their own throats.\n\nAah well, there's nothing we can do about this ... unless I can find the name of the person(s) who did the editing. In short, this movie could have been a pile of laughs, but the laughs all ended up on the cutting room floor (and, thank God, the DVD). The DVD would be worth buying if they worked all those cut scenes back into the movie in an alternate version, but as it is it's not and it barely rates a 7 out of 10 stars."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "TOMNEL",
        "review_rating": "2",
        "review_title": "Adam Sandler....you unfunny son of a gun!",
        "review_detailed_main": "Adam Sandler, Rhys Ifans, Allen Covert, Harvey keitel, Patricia Arquette, Peter Dante, Jonathan Loughran, Tommy Lister, Reese Witherspoon, Blake Clark, Rodney Dangerfield, Lewis Arquette, Carl Weathers, Quentin Tarantino, Clint Howard, Dan Marino, Bill Walton, Ozzy Osbourne, Henry Winkler and Regis Philbin. Saturday Night Live's:Jon Lovitz as a stalker, Robert Smigel as Mr. Beefy, Rob Schnieder as a farmer, Kevin Nealon as a demon, Dana Carvey as a basketball referee, Ellen Cleghorne as a spectator, Michael McKean as the chief od police and Fred Wolf as a demon.\n\nOooooooooooh....it hate this movie. It's a stinky piece of trash. Sandler is the devil's son, who's bros(Ifans and Lister) go to Earth to kill everyone so Nicky trys to stop them. Keitel plays the devil, Dangerfield plays his father Lucifer. Several cameos in this film are director Quentin Tarantino as a blind priest( a running gag in the film), Clint Howard as Nipples a crossdresser and the new to acting Reese Witherspoon(who actually looks pretty cute in this film) as Nicky's mother....an angel. All of these roles just make this film worse...so don't see it!\n\nmy review: F plus. 82 minutes. PG-13 for sex and crude humor, language, drug use and content and some violence."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "atzimo",
        "review_rating": "10",
        "review_title": "A Paradise for Adam Sandler's Fans",
        "review_detailed_main": "Let me explain something about Adam Sandler's movies (and his recordings and his SNL shows). His humor is something you either like or hate. There's no middle situation and there's not really a category for it except for 'Adam Sandler humor'. It also came to my attention that the people who think that Sandler is stupid, think the same of Jim Carrey and almost any other pure comedian, which narrows down their comedy taste to 'Scary Movie'.\n\nLittle Nicky is a film that every Adam Sandler fan has to see. This picture is about the son of Satan, who comes to earth in order to save his father from extinction. Everything (yes, everything) that takes place place in this movie, from the cast to the script, to the cameo appearances of celebrities, pays homage to earlier Sandler works. Those little or sometimes bigger references are not only links to Sandler's previous movies but also to his recordings and SNL shows. It's a real treat for every true Adam Sandler fan!\n\nAlso a great production along with a great Heavy Metal soundtrack make this film one of the best movies Adam's ever done.\n\nI have to warn you that you have to have at least some experience with Adam's previous efforts in order to appreciate 'Little Nicky'. Of course if you are an Adam Sandler fan you're going to love this one. If you are not, please go rent 'Die Hard with a Vengeance' for one more time..."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "stephen-90",
        "review_rating": "7",
        "review_title": "Unexpectedly funny",
        "review_detailed_main": "A better film than I was expecting. After 20 minutes I was wishing I'd stayed at home, but once the action moved to New York the plot found it's feet.\n\nThis is not a classic but there are some very funny moments - my favourite was seeing the 10 year old kids vomiting after their first legal drinking session. I think us brits appreciate toilet humour a little more than our trans-atlantic cousins, so this hit the spot. A lot of the film was celebrity spotting (I wasn't able to spot Michael McKean of Spinal Tap fame). The relative big-budget feel to the film was also an unexpected surprise.\n\nThe let down was Sandlers a-la-Waterboy speech defect. Why???? And Patricia Arquette wasn't fooling anyone into believing she's dowdy - you just cannot hide that kinda beauty."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "markguszak",
        "review_rating": "1",
        "review_title": "This movie was Hell!",
        "review_detailed_main": "Let me first off say that I have enjoyed all of Sandler's movies up to this one. Gilmore, Madison and Boucher were all funny characters and enjoyable films. However, this movie is rancid! I think Sandler and his buddies got stoned, wrote,shot and produced this film in one weekend. There appeared to be no editing involved whatsoever. A ton of performances that were phoned in. I was shocked at how poor this film was. Although there were a few indications ahead of time that it was not that good of movie. For example, there were five other people in the theater when I saw it on a Friday afternoon. Moreover, Sandler had gone on a wrestling show to promote it, etc.... If you like Sandler, go rent one of his movies, because this one was \"bad as hell.\""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "3",
        "review_title": "Sandler's films are at least usually amusing, and/or sporadically funny (sometimes hysterial) -- this is just pure crap.",
        "review_detailed_main": "One word describes Little Nicky: sophomoric. This movie has great (or at least good) potential as a comedy \u0096 but is ruined by a grating lead performance, poor scriptwriting, and increasingly lame jokes. Worst of all, however, is the totally inept direction \u0096 had the film been delivered to better talent, it could have easily been Adam Sandler's best comedy. It's one of his worst, simply because the amateur handling is similar to that of worse duds like Battlefield Earth. Sandler's Billy Madison wasn't anything special but at least it was adequately made.\n\nNo faults in the cast. With performances and cameos including Patricia Arquette, Harvey Keitel, Quentin Tarantino, Rodney Dangerfield, Dana Carvey, Jon Lovitz, Reese Witherspoon, Henry Winkler, Ozzy Osbourne, Rob Schneider, Michael McKean, Robert Smigel, Regis Philbin and Carl Weathers, the film's flaw is its script \u0096 the talented actors are required to mutter extremely contrived dialogue, and most of the time they do so quite embarrassingly. Watching Keitel is painful \u0096 he's not even trying. You know you're in trouble when a film's best performance is by Quentin Tarantino \u0096 in this case, as a blind preacher who has a habit of injuring himself (every time we see him it's a new brace, bandage, etc.).\n\nThe plot is basically this: titular character 'Little' Nicky (Sandler) is the son of Lucifer (Keitel), whose other two sons leave hell in search of fun 'up north' in New York City. Their journey magically breaks the gates of hell, or something, and as a result this causes the Devil to wither away. Nicky is left as the only possible source of salvation, having to travel north, bring his evil brothers back and save his dying father (how does someone in hell die? Don't ask me.).\n\nThe movie has a few clever gags for movie buffs \u0096 Elephant Man and Scarface references being the best, if not very subtle. The film's problem is that it quickly runs out of steam \u0096 it's a one-trick pony and is only able to sustain its screwball antics for so long until it becomes a chore to sit through.\n\nOne thing I have to give credit to Sandler for is that, although his comedies may not be perfect, most of the time they are somewhat amusing and aren't as commercially sloppy as Little Nicky. By that, I mean that this movie is a by-the-numbers Hollywood product \u0096 it moves from Point A to Point B to Point C, introducing all the typical clichés of the genre. Sandler's comedies have always been weak in terms of romantic subplots \u0096 the tacked-on relationship in Happy Gilmore was laughable, and Madison's was even worse. Didn't matter much because the films relied on jokes. Not here. Jokes are rare. The romantic subplot is the worst so far in any of his films \u0096 I felt sorry for Arquette, and I was disturbed by how shallow her character was written. (She meets Nicky \u0096 a muttering, mumbling, evil idiot \u0096 in New York, treats him nice, goes out on a date, and then he swears at her and makes obscene gestures and tells her that he's the spawn of Satan and she gives a cute smile and goes on a magical Satan-powered flight across the city with him. Absolutely pathetic.)\n\nCharacters are handled as throwaways \u0096 Dangerfield's potentially-hilarious performance is watered down and never given full opportunity, showing up once and a while to add a few laughs to a flat sequence. Keitel's performance is weak and Sandler has once again created a grating voice \u0096 Little Nicky sounds just like his geeky character from SNL who would show up on Weekend Updates to give music reports. A better comedian might really find a character to play underneath the surface \u0096 Sandler isn't able to because, to be fair, he isn't much of a comedian. As a result his performance is painfully blunt \u0096 about as subtle as a hammer over the head. Instead of playing a wacky, annoying person in his next movie, why doesn't he just play himself? That's what he's always been good at. There's a reason Happy Gilmore is still his best comedy, and Punch-Drunk Love was so great.\n\nThe gratuitous cameos become almost as annoying as the constant merchandising tie-ins and references (I counted Coca-Cola, Pepsi, Popeye's Chicken, and the television show Felicity, not to mention the rock soundtrack that cuts back and forth to one song after another without using them to any real advantage).\n\nThe cameos? That's Chubbs Peterson from Happy Gilmore ('It's all in the hips!') and Henry Winkler, apparently not reprising his role as the coach from The Waterboy. Those two were fun enough, but the Rob Schneider reprisal is lame \u0096 having the same character show up time and time again to say the same thing ('You can do it!') isn't clever if he's annoying to begin with. The movie is one big Adam Sandler Celebration \u0096 it references Gilmore, Madison, Waterboy, and even lines from the films (having said 'It's all in the hips!' about three times). Then there's the inclusion of characters from Sandler's music CDs \u0096 mainly Whitey the Coach, who is played by Dana Carvey, and who was later voiced by Sandler in the animated flop 8 Crazy Nights.\n\nAll in all the movie tries to be a number of different things and becomes absolutely nothing at all. It wants to be a social and religious satire but is content to stay within the PG-13 guidelines, so it never becomes as raunchy or funny or downright refreshing as Dogma. Kevin Smith is a daring director and is capable of extending the craziest of material into something clever. Steven Brill, the director of Little Nicky, is considerably less talented and as a result his movie \u0096 which similarly moves towards an apocalyptic ending a la Dogma \u0096 becomes a complete and under mess, totally predictable and stupid.\n\nLittle Nicky is a big disappointment."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "maq27",
        "review_rating": "",
        "review_title": "ADAM SANDLER IS NOT FUNNY!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "atari7",
        "review_rating": "6",
        "review_title": "I think I've enjoyed it",
        "review_detailed_main": "Not bad, not bad at all. I think I've had a few laughs. For sure I've seen better comedies, but this one had a Titty-Head man. Very original and funny. And also the talking satanic dog Beefy. A little crude humor, but very original. Recommended for mid-weekend nights."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "HulkisHoly",
        "review_rating": "2",
        "review_title": "Easily Sandler's worst film...",
        "review_detailed_main": "Yes even worse than Jack and Jill. Nicky has to be Sandler's most annoying character ever created. I could see this character as some weird SNL bit that could be funny maybe for a minute, but an entire film?? Naw. Not even close."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "JakeRfilmfreak",
        "review_rating": "6",
        "review_title": "I'm from the South. The Deep South.",
        "review_detailed_main": "Little Nicky is a 2000 action comedy that follows the son of the devil as he attempts to bring his two brothers back to hell before their father completely disintegrates.\n\nThis isn't Adams Sandlers best film, but it's definitely not his worst either. It tells a silly story filled with ridiculous characters (but that's not unusual for a Sandler flick) who stars in the title role as Nicky, a charming and fun character who even though is the son of satan doesn't have a bad bone in his body. Some of the Comedy is eye rolling, but there are still plenty of funny moments overall. The cast is good, the premise is creative, and if you're looking for a goofy comedy to sit back and veg out to, then it's a decent watch.\n\nYou won't find anything spectacular here, but it's still a good comedy for what it's worth. If you haven't seen it before, I'd recommend checking it out."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "leoxatzian",
        "review_rating": "2",
        "review_title": "A laugh-free catastrophe.",
        "review_detailed_main": "Although nothing groundbreaking was to be expected from a movie like this, nobody could have predicted how unbelievably bad it was gonna be either. With Adam Sandler giving the most unbearably annoying performance he could have given and jokes that would struggle to make even the most immature of kids laugh, \"Little Nicky\" ends up being a nineteen minute long movie that sadly feels like an eternity in the deep South."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "SUPERNOVA HEIGHTS",
        "review_rating": "7",
        "review_title": "Little Nicky:Lots of fun",
        "review_detailed_main": "Adam Sandler does it again.He makes smile all people like in Big Daddy and the Waterboy.The great screen (the history of the good son of satan) and the roles played by his friends (in special Patricia Arquette and Ifans)Good soundtrack good gags. SENTENCE FOR LITTLE NICKY:The Best comedy film in the 2000"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "KeithChambers",
        "review_rating": "1",
        "review_title": "Quite possibly the worst movie I have ever seen......",
        "review_detailed_main": "The only reason I saw this train wreck was because it happened to be on TV and my brothers had commented as to how bad it was. Even they gave this movie too much credit. Bad through and through. Junior High School children could have done a better job. I believe I may have lost IQ points just for watching it. The only redeeming part of this movie was when it was finally over, I didn't have to watch it anymore. The whole flick is loaded with stupid humor and HORRENDOUS acting! Adam Sandler is truly awful. I am curious as to who exactly the target audience for this movie is? I wish the rating scale had a zero, because that is what I would give it. The writer should be ashamed of this swill. Apparently, this is one of those movies that people in Hollywood do for the paycheck. I hope for their sake it was one hell of a paycheck. Acting-0, Directing-0, Writing-0."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "cb_whitewood",
        "review_rating": "8",
        "review_title": "Honestly, a pretty good time.",
        "review_detailed_main": "I wasn't sure of this film at first, but once I got through the opening scene and into the real meat of it, I was hooked. It's definitely from 2000, but that doesn't mean it doesn't hold up! Reviews seem crazy divided for this one, and I think the harsh reviews are a bit unnecessary. It just gets wilder and wilder, and the ending scene with Ozzy is one I'll forever remember."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "TStormJack",
        "review_rating": "6",
        "review_title": "Pretty funny",
        "review_detailed_main": "I rented this movie and expected crap. I mean, did ANYONE give it a good review? So I'm watching it and finding myself laughing. This movie really wasn't all that bad. It wasn't great either, but as far as the reviews went, it was better than most made it out to be. The DVD extras are good too, lots of deleted scenes and a 25 minute behind the scenes special, so check those out."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "medrjel",
        "review_rating": "3",
        "review_title": "EVIL!",
        "review_detailed_main": "Honestly, unless you are a big fan of Adam Sandler, this movie leaves everything to be desired. There are some cute moments, but most of it is juvenile and trite. Dumb sex jokes, and a weird battle of good vs. evil. As a general rule, I would not waste my time with this movie."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "segacs",
        "review_rating": "1",
        "review_title": "One of the dumbest movies ever released",
        "review_detailed_main": "I'm almost embarrassed to admit I actually went to see this in the theatre. But I had a coupon and nothing much to do, and I like Adam Sandler, so I figured, why not? Well, I'll tell you why not: this is one of the dumbest movies ever released. Adam Sandler's movies can be categorized into either brilliantly funny (The Wedding Singer) or horribly idiotic. This one definitely falls into the latter category.\n\nIt had a couple of lines here and there that were funny, I'll give it that. But begin with one of the most ridiculous plot lines ever conceived, throw in a talking dog, some low-brow humour about body parts, and some fanatic satanist Ozzy fans, and you come up with the disaster that was Little Nicky. I won't even bother to comment on the acting, cause there wasn't any.\n\nFor those of you who were thinking \"well of COURSE it's dumb, that's the point!\", well, save your money. There are a lot of movies out there that aren't necessarily thinking movies but that are actually funny. This isn't one of them."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Karl Self",
        "review_rating": "",
        "review_title": "Hellish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "1sovereignmagic",
        "review_rating": "6",
        "review_title": "It's off to camp we go...",
        "review_detailed_main": "Even though I am a big fan of Adam Sandler and I slightly enjoyed this movie, I couldn't give it a high rating. I'm really getting tired of the slapstick, cardboard cut-out comedy that seems to be so popular (or is it) these days. I know that Adam Sandler can do better than this, now it's time for him to prove it."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "movieman_kev",
        "review_rating": "1",
        "review_title": "worst \"comedy\" this side of \"Freddy Got Fingered\"",
        "review_detailed_main": "Steven Brill, the guy who cursed us with those \"Mighty Ducks\" films, the worthless \"Heavy Weights\", and the retarded \"Ready To Rumble\", is at it again giving us the worst Adam Sandler Film I've ever witnessed. Mr. Sandler is the spawn of Satan (Harvey Kietel,who should fire his agent, poste haste) who needs to 'release his inner evil' to save his father. I didn't laugh once throughout the whole movie. To think Adam went from \"Billy Madison\" and \"Happy Gillmore\" to \"Mr. Deeds\" and THIS pile of excrement makes me want to cry. And let's not even START on Quentin's cameo.\n\nMy Grade: F\n\nDVD Extras: Filmmaker Commentary; Cast Commentary; \"Adam Sandler goes to Hell\" featurette; \"Satan's top forty\" featurette; Deleted scenes POD music video; cast and crew; Theatrical Trailer; and Script to screen comparison"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "s-dewitt",
        "review_rating": "6",
        "review_title": "Another Adam Sandler movie",
        "review_detailed_main": "This is another typical Adam Sandler movie. You either love them or hate them.\n\nLike all other films by him, it would be brilliant if it wasn't so clearly moralistic. In this case, it is a simple good vs. evil film, but with the twist that the devil is a good guy - or at least a not so bad guy. The ideas in the film (as with most of his others) are pretty original, and (aside from the moralistic bits) pretty funny. But as usual, it is a little too overloaded with honey to be rated as a truly funny film.\n\nI don't think it is quite as good as \"Happy Gilmore\", but I might be biased because I both hate gold and love hockey. If you like Adam Sandler, you will like this film, if you don't, you won't. If you have no idea who Adam Sandler is, take a look at this and then you will know whether you ever want to see another of his movies again."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jagdeepjutley",
        "review_rating": "1",
        "review_title": "Just awful",
        "review_detailed_main": "Written by Americans for Americans A comedy film which makes you cringe at every turn, poor writing, extremely annoying when Adam sandler speaks don't bother"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "sunflwr42",
        "review_rating": "6",
        "review_title": "Much Better than I thought",
        "review_detailed_main": "When I first saw the previews for this movie I thought that there would be no way in hell I would ever watch it....but my boyfriend wanted to see it when it came out on video and we both thought it was very funny. I was very pleasantly suprised. If you have a warped sense of humour...you might want to give this one a try. It was a good laugh."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "msxwilliams",
        "review_rating": "10",
        "review_title": "A thousand stars",
        "review_detailed_main": "In the very least, 50 stars, one for each on the American flag. Can't believe this only has 5 stars. Grow up, have yourself a drink or smoke, or both, and put this bad boy on."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "zebra83",
        "review_rating": "6",
        "review_title": "Down there with Waterboy",
        "review_detailed_main": "I'm a proud fan of Adam Sandler and curse at anyone who won't give him any respect. Most of his movies are hilarious, and the Wedding Singer was a truly respectable movie. But sometimes he just gets carried away with his potty humor and gay jokes, and Little Nicky is a perfect example. While it contains brief moments of hilarity (the satanic message contained in a Chicago album comes to mind) and some guest star appearances are amusing, especially those that allude to some of Sandler's funnier movies, this movie could have accomplished so much more."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "sunflowr",
        "review_rating": "3",
        "review_title": "Yawn! please, give us something new",
        "review_detailed_main": "The only reason I rented this movie was because of Mr. Beefy. Yes, I am a bulldog owner, and Nigel watched this movie right next to me. For a minute. Then he had to go pee & didn't want to come back inside. I don't blame him - he can smell a bad movie better than any dog.\n\nI usually avoid Adam Sandler movies because he overuses the toiletbowl humor. This is the first time I ever paid to see one (I usually just catch them on cable), & Sandler truly did not disappoint me -- I doubt I will ever go out of my way to spend money on one of his films again.\n\nThis movie is no doubt a favorite of people who still laugh at fart jokes. Or maybe if you're a 11-16 year old boy. Ooooh...boobies! Big deal. How many times are they going to use that gimmick?\n\nWould you believe I even fell asleep during this movie? Luckily, I woke up in time to see Ozzy Osbourne -- another fellow bulldog owner. :)"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "baumer",
        "review_rating": "",
        "review_title": "passable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "vpa21133",
        "review_rating": "3",
        "review_title": "Have a brain, hated this movie",
        "review_detailed_main": "Since \"The Wedding Singer,\" the quality of Adam Sandler's movies has been in a tailspin, each one worse than the next. In this turkey, he plays one of Satan's three sons, an idiot with a speech impediment and facial deformity (the result of being hit in the face with a shovel by one of his brothers). Of course, Sandler's character has the obligatory heart of gold.\n\nHis use of the speech impediment and deformity for humor is cheap, to put it mildly. What humor this movie has is of the shock-vulgar kind, and it continues Sandler's obsession with urination \"jokes.\"\n\nUnless you have two hours or so of your life to totally waste, don't rent this video!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "kenneththaarup",
        "review_rating": "7",
        "review_title": "Great and underrated movie!",
        "review_detailed_main": "This is no doubt one of Adam Sandlers better movies! I don't understand why the average vote is so low in here. Everyone i know who have seen this movie loved it. And so did I.\n\nAdam Sandler plays Nicky, who is the son of the devil. The devil isn't such a bad guy afterall, but his two oldest sons are, and after deciding that he himself shall be the ruler of hell for the next 10000 years, Adrian and Cassius (the two oldest sons) travel to earth to mess everything up. This stops the gate to hell, which leads to a slow and painful death of the Devil. Nicky is sent to earth to stop his brothers, and on this journey through the world of the living, Nicky discovers the magic of love, weed and heavy metal. It's a hilarious story, and it shouldn't be missed! 8/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jonathansanders",
        "review_rating": "2",
        "review_title": "Sandler's Schtick = Slightly Stale",
        "review_detailed_main": "I saw Little Nicky, and I was frankly disappointed in the fact that Adam Sandler, who I believe to be a very creative man, did not tread any new ground. The jokes were all old, and when they actually found a joke that worked (a.k.a. \"the deep south\", you 'll get it when you see the movie), they burned it into the ground (no pun intended).\n\nI thought the plot sounded saleable, but the movie didn't live up to my expectations at all. The whole thing was predictable to the point of obsessive. So many guest stars were thrown in just for cheap laughs that I almost became ill (I still feel that Henry Winckler deserved MUCH MORE than this cameo), although a ray of light was the appearance of Chubs Peterson of Happy Gilmore fame.\n\nBut what annoyed me the most was how this dim-minded movie seemed to cater to tit jokes (just listen to Rodney Dangerfield) and other pre-adolescent humor. For everyone who has seen such Sandler gems as Happy Gilmore and The Wedding Singer, this movie just shows that he needs to take a short vacation to come up with new ideas.\n\nHe has a new film coming out in December, called \"Eight Crazy Nights\" (billed as a Hannukah musical). Maybe he can redeem himself."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "rickets",
        "review_rating": "1",
        "review_title": "Get Out the Holy Water and Douse It all Over This Evil Film",
        "review_detailed_main": "In the past, I've enjoyed Adam Sandler movies. This was just bad. Actually, bad doesn't even begin to describe it. I don't know what Adam Sandler was thinking when he did this.\n\nThe worst part of this movie is it's really dirty. I can handle dirty but this is is just so DIRTY!!! After seeing this I felt unclean and I was sick to my stomach. Do yourself a favor and stay away from this movie. If you want to watch an Adam Sandler movie, go watch The Wedding Singer."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "kevin_robbins",
        "review_rating": "6",
        "review_title": "he storyline is mediocre, and the comedic content is inconsistent, but I still recommend seeing it",
        "review_detailed_main": "Little Nicky (2000) is a movie in my DVD collection that I recently rewatched on Tubi. The storyline follows the devil in his final days and about to turn the keys to the kingdom over to one of his three sons. When he decides to stay in rule of hell two of the sons close the portal of souls to hell. The remaining son will need to save hell from his brothers.\n\nThis movie is directed by Steven Brill (Mr. Deeds) and stars Adam Sandler (The Waterboy), Patricia Arquette (True Romance), Harvey Keitel (Pulp Fiction), Rhys Ifans (The Amazing Spider-Man), Tom Lister Jr. (Friday), Rodney Dangerfield (Back to School) and Jon Lovitz (The Benchwarmers).\n\nThis is one of those bad movies I can watch one hundred times. Yes, the storyline is awful, and Sandler's face and voice are annoying, but I enjoyed Keitel as the devil, Lister and Rhys Ifans as the villains and the fantastic cameos (Tarantino, Dana Carvey, Reese Witherspoon, Kevin Nealon and Rob Scneider). I loved Lovitz in this. The Adolph Hitler scenes cracked me up too and the soundtrack was excellent.\n\nOverall the storyline is mediocre, and the comedic content is inconsistent, but I still recommend seeing it. I would score this a 6-6.5/10 and recommend seeing it once."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "superc13",
        "review_rating": "1",
        "review_title": "I'm embarrassed for this movie....",
        "review_detailed_main": "I truly don't believe that any one thought this film was going to be good. What comes as a shock is how truly HORRIBLE it is. \"Little Nicky\" is perhaps one of the worst films I have ever seen. Every awful, poorly written gag and joke comes like a punch in the stomach, and it never relents. I'm almost surprised the film wasn't shelved, but since Adam Sandler is \"hot, hot, hot\" that just wouldn't happen. I was annoyed that the film did such poor box office (before I had seen it), since it seemed as thought Sandler and co. were being punished for trying something new. After seeing it however, I couldn't be happier that it bombed."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "callanvass",
        "review_rating": "10",
        "review_title": "One Of The Most Bizarre Movies I Have Ever Seen And I Absolutely Loved It!, However It's An Acquired Taste",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "otnememento-2",
        "review_rating": "7",
        "review_title": "The best Sandler comedy",
        "review_detailed_main": "This is my favourite Sandler comedy, it is hilarious. Even if you hate Sandler's movies give it a chance, you'll get some laughs."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "carteros",
        "review_rating": "1",
        "review_title": "Painful",
        "review_detailed_main": "This movie is pretty bad but it was fun to watch I guess. Just another adam sandler movie to not take too serious."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Stealth-5",
        "review_rating": "",
        "review_title": "Immature Garbage.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "love the stupidity but hate the annoying",
        "review_detailed_main": "Nicky (Adam Sandler) is the bullied runt of the devil (Harvey Keitel). His two brothers Adrian (Rhys Ifans) and Cassius (Tommy Lister) are angry that their father refused to hand over the reins. They escaped to earth leaving Hell blocked up and no soul can through. The devil is deteriorating and little Nicky is the only one who can go to retrieve his brothers. Valerie Veran (Patricia Arquette) comes to help him when his magic flask is stolen.\n\nThe basic concept of this movie is actually pretty good and has great comedic possibilities. I almost laugh at times but Adam Sandler's ridiculous performance really hurts the movie. It borders between stupidity which is good and annoying which is bad. That's the movie in a nutshell. I want to laugh at the stupidity but the annoyance keeps me from liking it. There are great actors in this including aging icon Rodney Dangerfield but this is all about Adam Sandler. I wish he had somebody willing to tell him that Nicky isn't funny."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jay_amer",
        "review_rating": "6",
        "review_title": "A funny and decent Adam Sandler Film.",
        "review_detailed_main": "Man this movie is funny when i first saw it. Definitely cheesy, got its quirks but its a decent funny movie with the topic of Heaven and Hell. This is definitely an adam sandler movie to check out. Overall, decent movie. 6/10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "hitchcockthelegend",
        "review_rating": "3",
        "review_title": "It is as bad as you have heard.",
        "review_detailed_main": "Look, I'm a Sandler fan. If that's for my sins then so be it. I own about three quarters of his output on DVD and have been known to debate vociferously about the benefits of The Wedding Singer & 50 First Dates, but Little Nicky is painfully bad. Badly written by Sandler, Tim Herlihy & Steven Brill, with the latter directing with a blunt sabre, Little Nicky relies purely on stupid crass jokes for its worth and forgets to put any semblance of a heart in its mix. It does try with its odd and underwritten romance sub-plot {featuring a bemused Patricia Arquette}, but the whole thing exists purely to make stoner's and air heads laugh. It actually looks real nice in HD, and the soundtrack is pretty rocking. While the number of star cameos makes for an interesting {bemusing in a why? sort of way} viewing. But this really is only for those who think that toilet waste and talking dogs are the highest forms of conceptual comedy. The most evil question of all in a film about Satan and his offspring? Is how in the hell did the likes of Harvey Keitel {stepping in after AC/DC axeman Angus Young dropped out} ever agree to be a part of this dirge?\n\nStraight to hell boys, all of you. 3/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "bopeder",
        "review_rating": "7",
        "review_title": "Funny and well done",
        "review_detailed_main": "This movie is metal... I like almost everything about it, except that Nicky himself could have done without the \"face\" and the \"voice\".\n\nThe dog is too cool, and Ozzy is god (as we have always known).\n\nSee it! 8/10..."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "JohnnyPHreak",
        "review_rating": "1",
        "review_title": "Wild and Crazy...Everything you could want in a Sandler Film",
        "review_detailed_main": "People are always asking the question if Adam Sandler is a little, how is it said, off his rocker. With the wild CDs he puts out and the zany films he's in, a person could think that he might be crazy. But lately he's been losing his touch. With the success of The Wedding Singer, The Waterboy and Big Daddy, he's been shying away from the normal Adam Sandler stick that everyone who loves him enjoys to see. Well Adam Sandler fans rejoice because he is back with a vengeance. Little Nicky is the wild and craziest Sandler film I have ever seen. It may not be the best (I think all will agree with me that that title goes to Billy Madison) but it is the edgiest. The plot revolves around the Satan (Harvey Keitel) after a certain amount of years has to pick a new ruler of Hell. He has to choose from his three sons Adrian (Rhys Ifans), Cassius (Tom \"Tiny\" Lister Jr.) and Nicky (Sandler). When he decides to choose himself as the new ruler Adrian and Caussius are livid. They decided to go through the fire of hell backwards and conquer Earth, making it the new Hell. In doing this they are slowly killing Satan, he loses body parts and his power the longer they're on Earth. The only one that can save Earth and Satan is the incompetent and very stupid Nicky. So he goes to Earth to learn how to use his powers and stop his brothers from making Earth the new hell. On the way he meets a cast a characters that is about a mile long. There are so many cameos in this film I lost count. There are many SNL former members (none from the likes of Rock, Spade, or Myers) but there are a very few noticeable one. The comedy is border line on rated R material as there are many gross jokes related on sexual humor, some drug related gags and just some disturbingly funny images. All a person would expect in an Adam Sandler film and more. Sandler pulls off the weird voiced Nicky just like he did Bobby Boucher in The Waterboy. He's always the stand out in his film but everyone else pulled off their characters as best as they could. They were all believable. For those Sandler fans who have seen any of his films, that including Happy Gilmore, will get a very funny and enjoy surprise with one of the cameos. Along with the normal Sandler antics the soundtrack is right on the money. Each song goes along with the action on the screen. In the end, Little Nicky is a funny and at times wild comedy from mastermind Adam Sandler. It will gross, gag and grab all at the same time."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Adamjammer",
        "review_rating": "6",
        "review_title": "Not too good, not too bad",
        "review_detailed_main": "I rented this on a whim with a friend (mainly to relieve the stress of watching Saw and Saw II back to back) and I gotta say it wasn't half bad. I wasn't expecting Scorsese, but I was expecting a pretty bad movie, and I was pleasantly surprised when it actually delivered some laughs. Technically the movie's put together fairly shoddily, the plot is far from cohesive, the dialogue's mediocre at best, and yet somehow I got a good handful of laughs despite this. The sheer randomness and ridiculousness of it all keeps you off-balance enough that the occasional good one-liner comes through and can make you chuckle. It ain't Shakespeare, hell it ain't even Ogden Nash, but it's not as bad as I thought."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "christophermerritt-36367",
        "review_rating": "4",
        "review_title": "Lazy",
        "review_detailed_main": "This movie was just kinda slapped together, and called a movie. The story is all over the place, nothing is really developed, the jokes weren't funny, and every visual effect was terrible. It doesn't really feel like anyone was trying to make anything special"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mcotrel",
        "review_rating": "10",
        "review_title": "One of the funniest movies you can watch",
        "review_detailed_main": "Its very funny with a unique style to the entire movie. Seeing the great cast with the dark over the top humor is great. One of the best soundtracks on a movie, not 1 bad selection. I think everyone is just to uptight and aren't appreciating the direction they took with this movie."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ginge_mickey",
        "review_rating": "6",
        "review_title": "Very unique",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Theo Robertson",
        "review_rating": "3",
        "review_title": "Little In The Way Of Entertainment",
        "review_detailed_main": "I`ve been hearing a lot of hype involving Adam Sandler`s career over the last couple of years but having seen Sandler for the first time in this movie I realised that`s all Sandler is - Hype .\n\nThere`s very little in the way of good things I can say about LITTLE NICKY , okay I`m not keen on comedy but that`s hardly an excuse for not liking this film . Sandler`s idea of comedy seems to be putting on an incredibly irritating voice and a silly walk and hoping the audience will find all this side splitting . Well I`m sorry but I didn`t . Mind you all the supporting cast like Harvey Keitel , Rhys Ifans and Rodney Dangerfield are equally unfunny so maybe the fault lies at the feet of the director than Sandler , but I`ll be very wary in future in watching a film that has the name of Adam Sandler in the credits"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "euphemism",
        "review_rating": "",
        "review_title": "WOW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "texastom-83964",
        "review_rating": "2",
        "review_title": "Turkey",
        "review_detailed_main": "If u are board out of you mind after finishing your Christmas dinner then watch this.... u soon be back at the table"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "rmarkd",
        "review_rating": "6",
        "review_title": "Okay, actually not bad",
        "review_detailed_main": "Most Sandler movies are utter crap where he beats up and/or makes fun of people all the while talking with some stupid voice.\n\nHe's got a stupid voice here, but this movie is actually funny, though at times it's funny because it's so stupid. Sandler is one of the Devil's three sons. Devildaddy has reigned for a long time and looks to an heir in one of his sons. But then he decides not to relinquish the throne. His other two sons are p***ed, and go to Earth to wreak havoc. Ahh... but their leaving causes problems and Little Nicky has to get them back before his dad withers away. Nicky comes to earth, discovers Popeye's chicken (damn good mashed potatoes too), and deals with a world he's never been in before.\n\nForget the story, forget the acting. The story here just strings along funny stuff, so don't expect much more. What's different here is Sandler is not his annoying, non-funny self. Look for some good cameos, including a hilarious Ozzy cameo. This movie doesn't take itself too seriously; it's stupid fun and it knows it is and doesn't try to be much more. Some jokes fall flat, but enough work well enough that it's worth seeing if they're showing it on cable. 6/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Quinoa1984",
        "review_rating": "5",
        "review_title": "Better than I expected, but still just good",
        "review_detailed_main": "While I should (and do) feel content with this new Adam Sandler comedy, I felt somewhat taken away from this film. Mainly because his first two leads (Happy Gilmore and Billy Madison) were masterpieces of the ridiculous comedy. And now, we have Sandler not as low budget which is fine, but it is slightly dropped down this time from those classics.\n\nNot that I'm saying this film is not a must see, far from it. Sandler here plays one of his most difficult roles as half satan/half angel (Satan played by well choiced pick Harvey Keitel and angel played by Reese Witherspoon) who must stop his bad brothers (Tiny Zeus Lister and Rhys Ifans) from controlling earth, but only by mastering his powers. Dumb plot, damn right, one of the dumbest. But it is risen from that much by spots of drop dead hilarity and other ones that bring out chuckles. Overall, goody good, though it is no comic treasure.\n\nOne thing more, the thing that makes this film goody good is the small parts and cameos including: Rodney Dangerfield (Lucifer in his hilarious role), Rob Schnieder, Clint Howard, Henry Winkler, Robert Smigel, Ozzy Osbourne, Carl Weathers (back again in dead-pan funny Chubbs), Jon Lovitz, Kevion Nealon, Dana Carvey (so many SNL stars), Allen Cobert, Michael McKean and in the biggest (and funniest) surprise of the film, Quentin Tarantino as the blind preist (by the way, love the inclusion of Chris Farley into heaven). B+"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "wuzupn_tb",
        "review_rating": "6",
        "review_title": "Not that bad, a funny C movie",
        "review_detailed_main": "By now audiences are catching on that Adam Sandler is playing the same person in every movie. But they dont want to accept it. This is their last reasonable Adam Sandler movie until the great Punch-Drunk Love. Lots of laughs are abound, but corny jokes, bad lines, predictable plot twists and more bring the movie down C, 6/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Bravesfan17",
        "review_rating": "5",
        "review_title": "Funny, but dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "the-jerk",
        "review_rating": "7",
        "review_title": "Better than its reputation.",
        "review_detailed_main": "This movie, with its low-rent effects and terrible production values, should have been horrible. Well, I'm part of the minority that thinks that this movie was neither really good nor bad; it was funny, and as far as I'm usually concerned, that alone makes a comedy worth watching. But the production values, direction, editing, dialogue, etc were not very good, and people have a right to not like a movie with problems like these.\n\nSo what was good about it? It was just a lot of fun, the way bad movies sometimes can be. The cast is top-notch; even heavyweights like Harvey Keitel (as the devil, and he did a superb job), Patricia Arquette, and Reese Witherspoon (hilarious as a valley girl angel) seem to be having a great time here. The regulars from other Adam Sandler movies are also entertaining, and the cast is rounded out by a veritable who's who of comedy talent, like Jon Lovits, Rodney Dangerfield (basically doing his usual schtick as Lucifer, the devil's father), Kevin Nealon, Dana Carvey, George Wallace, Michael McKean, Ellen Cleghorne, Clint Howard... sure most of these people are washed up, but who cares? They're still funny; Jon Lovits in particular shows how good he is in these small parts (something he's done many times in the past). Robert Smigel is also good as the voice of Beefy the dog. Rounding it out are Rhys Ifans (who I'm not really familiar with) and Tiny Lister (inspired casting!) as Nicky's brothers, a host of cameos, many of whom play themselves (Regis and Ozzy are hilarious, and Henry Winkler and Carl Weathers appear, referencing older Adam Sandler movies), and of course Sandler himself as Little Nicky, the devil's nicer son. As I said before, the cast is great; they seem to be having a really good time, and they are really what make the movie worth watching. You can forgive the movie the bad dialogue and poor production values if it's this funny.\n\nI think above all, it's important to just try not to take the movie so seriously. Although the dialogue is bad, the one-liners are often hilarious, and although the production values are bad, the sight gags are often hilarious. So enjoy the movie for what it is: an entertaining, if not well-done, piece of fluff, along the lines of, say, Cheech and Chong, not up to the quality of Sandler's other movies (and I stand by that, I think there is real quality in movies like \"The Wedding Singer\" or \"Happy Gilmore\" or even \"The Waterboy\"), but still pretty damn funny in it's own right."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "RichardjDunn_78",
        "review_rating": "1",
        "review_title": "Not even as funny as a whoopee cushion",
        "review_detailed_main": "I've watched quite a few of Adam Sandlers movies which i must admit I've enjoyed, so when i read on the back of the box \"The best performance by Adam Sandler as yet\" i was hoping i'd be in for a treat, how wrong you can be. Im not going to go into too much detail why i disliked this so much, it could of been the annoying speech impediment he had through the entire film or it could have been his talking dog (how original). There were some crappy computer graphics thrown in here and there which were neither funny or visually pleasing but all in all it just wasn't funny. After seeing this i had to whip on \"Meet the Fockers\" followed by \"Bruce Almighty\" just to bring me out of my depression. I wish a had spent the money on a whoopee cushion or a slinky as they would have provided me with much more entertainment. What a pile of poo."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "malcydon",
        "review_rating": "10",
        "review_title": "An old classic",
        "review_detailed_main": "A lot of people likes or dislikes this movie, mainly because people take themselves too seriously, as seen by the comments. This is a comedy. It's making people laugh with dirty jokes and fooling around.\n\nIt's a pretty light movie, easy to watch, easy to spend time with.\n\nThe characters are pretty good, making fun of stereotypes in writing and such. The story is similar in this, built on the typical heroes journey, but with a twist. The actors are pretty good too, everyone bringing their part, each pretty unique from each other, the play is pretty good.\n\nI think some of the best is the customs and the design, the set. Hell is colorful, bright red and black, heaven is white, but the middle ground is concrete grey, city brown, and the park. A very nice change for the eye inbetween sets. Someone built this really well.\n\nOverall I like this movie, because it does not have great expectations. It's just simple, light jokes. I often watch movies in english, instead of dub, and complex jokes either fall flat on their face, because it's just not funny for me, too much effort for a little turn, or I don't even understand how it was supposed to be funny. Not in this case. It's clean, and understandable. It's not over-over-pulled like most american jokes are.\n\nI liked this movie a lot."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "noizyme",
        "review_rating": "6",
        "review_title": "Entertaining but a few too many CGI gags",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "moonspinner55",
        "review_rating": "2",
        "review_title": "Lame humor--most of it scatological--permeates an effects-laden comedy which typecasts Sandler as the Devil's spawn",
        "review_detailed_main": "Dreadful bubblegum stuff for the heavy metal set. Satan (Harvey Keitel, with horns and pointy ears) passes over his two eldest sons for a promotion; they escape from Hell (to New York City!) and freeze the fires of Hades behind them so no new souls can enter in. Adam Sandler, talking in a raspy whisper (and with an occasional drooping lip), is the youngest spawn of the Devil who goes after his brothers to capture their souls in a flask forever. Despite a handsome production full of expensive CGI effects, big set pieces, and surprise guests in cameos, this Adam Sandler vehicle has no new jokes and plenty of obvious targets. Even with the large budget and a strong supporting cast, Sandler still can't shake off the doldrums and give us a comic performance he believes in. \"Little Nicky\" backs itself into a hoary corner, winding up with a showdown between evil and not-so-evil that raises not a single chuckle. Movies like this go over well with audiences who don't mind being treated like dolts. * from ****"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "A Little Sh*tty.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Figgiedan",
        "review_rating": "3",
        "review_title": "Better to rule in Hell than watch this movie",
        "review_detailed_main": "This is the most asinine piece of garbage for the year 2000. It's not funny at all and after 10 minutes you want to strangle Sandler for that annoying voice he makes up for Nicky. For the amount of special effects and cameos in it, I could have made a movie about heaven and hell 20,000 times better than this bunk and for 1/3rd the price. Sandler's worst movie; even though he's never going to make a Citizen Kane, that still says a lot. As an alternative, go rent Happy Gilmore and fast forward to Bob Barker calling Sandler a \"bitch.\" 3 out of 10. Grade F."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mattc-6",
        "review_rating": "6",
        "review_title": "Departure for Sandler?",
        "review_detailed_main": "Little Nicky seems almost like the last film Adam Sandler is going to make. Various characters from his previous films pop up in the appropriate and inappropriate places. His usual mix of gross out humor and sweet natured humor is slightly askew, in favor of the gross out humor. And having two other screenwriters helping him on the script didn't really go over as well as his usual tandem of writers. Still, the film does make you laugh when you shouldn't and the depiction of hell is a lot more amusing than in South Park: Bigger, Longer and Uncut.\n\nMaybe Sandler wants to grow up. Maybe he wants to do something different. Either way, don't expect him to do Shakespeare for a while.\n\nAdam Sandler's Nicky was a promising character. He's the son of the devil who just isn't evil enough. When Dad decides to extend his reign over the underworld for another 10,000 years, Nicky's two older brothers don't like the idea. So they close the gates of hell and make Manhattan the new Hades. Nicky, of course, has to bring them back to save dear old dad. Hilarity ensues.\n\nThe rest of the cast, Patricia Arquette as the love interest, Rodney Dangerfield as Lucifer, Clint Howard as the gatekeeper, add some amusing bits to the scenery. Arquette is probably the only actress around that can look pretty in the grotesque sense. And the various cameos from SNL regulars (not to mention a few surprises) can either be amusing or stupid. Still, Adam's fans will eat this one up. The curious should spend no more than matinee prices. But those who know that they want to see it will."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Great concept, awful movie!",
        "review_detailed_main": "I do admit I am not a lover of Adam Sandler nor am I a hater, I am someone who likes him in some movies hate him in others. Not only do I hate Adam Sandler in this movie, I hated the movie itself. Look it had a great concept, really original if somewhat bizarre, and served as a perfect basis for a funny if not groundbreaking comedy. So what was the excuse for such tasteless, inane dialogue, vulgar and grotesque humour and slack direction? Or that it looked as though it had been shot on a cheap studio set, had a clumsy soundtrack, poor pacing and worst of all the unforgivable waste of actors such as Harvey Keitel, Michael McKean and Rhys Ifans? Adam Sandler is at his most unlikeable here too, doing nothing but moronic schtick that we have seen many times before and better. Overall, just awful and a waste of time, for me that is. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "alexpeychev",
        "review_rating": "4",
        "review_title": "\"Little Nicky\" is a comedy film directed by Steven Brill, released in 2000. The film stars Adam Sandler as Nicky, the youngest son of Satan, who is sent to Earth on a mission",
        "review_detailed_main": "\"Little Nicky\" is a comedy film directed by Steven Brill, released in 2000. The film stars Adam Sandler as Nicky, the youngest son of Satan, who is sent to Earth on a mission to prevent his two older brothers from taking over Hell and wreaking havoc on both the underworld and the mortal world.\n\nNicky is an awkward and kind-hearted character who struggles to fit in among humans due to his demonic appearance and powers. Despite his shortcomings, Nicky is determined to fulfill his father's wishes and save both realms.\n\nThe film is filled with slapstick humor, crude jokes, and over-the-top characters, typical of Adam Sandler's comedic style. It features a star-studded cast including Harvey Keitel as Satan, Patricia Arquette as Nicky's love interest, and Rhys Ifans and Tommy \"Tiny\" Lister Jr. As Nicky's brothers.\n\nWhile \"Little Nicky\" received mixed reviews from critics, it has since gained a cult following for its absurd humor and memorable moments. Fans of Adam Sandler's brand of comedy are likely to enjoy the film's quirky characters and offbeat storyline.\n\nOverall, \"Little Nicky\" is a fun and entertaining comedy that doesn't take itself too seriously. It's a lighthearted romp through the underworld with plenty of laughs along the way."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "talllwoood13",
        "review_rating": "10",
        "review_title": "surprisingly good",
        "review_detailed_main": "I don't understand why this movie gets so much hate. The plot isn't supposed to be serious. I mean the son of the devil goes to earth and has fun? This was very original then as it would be now. The only member of the cast I didn't like too much is the woman Nicky ends up with as she seemed kind of stiff. The soundtrack was great featuring Ozzy Osbourne and other bands at the time that worked out really well.\n\nThis is far from Adam's worst film. Those are a few years later!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "firesciguy",
        "review_rating": "7",
        "review_title": "I'll have to take a mulligan on this one",
        "review_detailed_main": "Having seen many of Adam's movies, this is one that doesn't involve Adam completely. The supporting cast is good; with Rodney and harvey providing most of the setup for the jokes that about in here. Shoving a pineapple up Hitler's butt (and his comment, \"You're sneerious\" was funny as Hell, at least for me. Reese wasn't my first choice for Nicky's mother, but she played a bubble-headed blonde perfectly. Adam's wife was apretty much the other bubble-headed angel. Peter and his costar were the hit of the show with, \"We are your slaves!\" and \"Did you get a load of that dragon-breath?\" Overall, a light-hearted comedy about what we'd do if Hell took over!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "gatra",
        "review_rating": "2",
        "review_title": "Bad as hell!",
        "review_detailed_main": "This movie is really bad!! It's not funny, and the acting was stupid, what a waste of actors/actresses. It was such a pain to watch, I'm glad I just watched it on a video that my friend rent out, because I seriously didn't have anything else to do. Rating: 2/10, it's actually 1/10, but I like the soundtracks so yeah...."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Realrockerhalloween",
        "review_rating": "",
        "review_title": "Little Nicky stands ten feet tall",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "billy_loomis1",
        "review_rating": "1",
        "review_title": "Another Garbage in Sandler's filmography...",
        "review_detailed_main": "If there was one \"good\"(is a very big word for Little Nicky) joke in this stupid \"comedy\" is the transformation of the coke into pepsi. And i believe these movies are only for americans! Because in europe this movie wouldn't earn more that 2 dollars! is really the us I.Q so low or i made a mistake? the schocking answer revealed in the rest of the reviews! God save us from the garbage! PLEEASEEE!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "CharltonBoy",
        "review_rating": "4",
        "review_title": "Irritating comedy",
        "review_detailed_main": "Little Nicky is another US comedy that instead of trying to come up with a funny script comes up with a silly and stupid one . When you watch such films as Life of Brian and Plains, Trains and Automobiles you wonder why script writers cant come come up with films that are funny anymore. This film is full of stupidity and very few laughs and is really spoilt by that fact the little Nicky played by Adam Sandler has a speech impediment which is so irritating and pointless that what enjoyment there is to be had is cancelled out. Also there are lots of in House American jokes that i could see were supposed to be funny but if you dont live in the states, like me, they go way over your head.There was an apearance by an american sports star that we are all supposed to know and we were supposed to get the joke.....not me. This film does have a few funny moments but not enough for me to give it a good review. 4 out of 10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "innocuous",
        "review_rating": "2",
        "review_title": "Boy, I'm a little worried that so many people seem to like this.",
        "review_detailed_main": "Are there that many people out there who actually LIKE this movie? It's a piece of junk. I might have been able to handle it if there had been some evidence that the budget was making it to the screen, but the film looks (and feels) really, really cheap. (The CGI FX are absolutely atrocious.) Even Arquette, whom I normally like at least a little, is awful and virtually unrecognizable in this film. (I'm not even going to acknowledge that K**tel worked in this stinker.) Here's a free clue to film makers: if you want to have viewers identify with the lead character and have some empathy for him, you need to give him at least SOME positive aspects. Otherwise, where's the interest? Not worth your time."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ill_behavior",
        "review_rating": "3",
        "review_title": "Painful",
        "review_detailed_main": "I genuinely liked Adam Sandler until I saw this film. I thought his movies, while stupid, idiotic, crass and childish, had an innocence, a charm about them. This one doesn't. It's ugly, unfriendly, and crucial for a comedy, it's not even funny.\n\nWhoever casted this film needs to be slapped, whoever scripted this film needs to watch the casting director get a slap, then themselves get slapped twice. Whoever can provide information leading to the identification of the person's responsible for this crime against film gets to administer the first slapping.\n\nNot funny, at all, horrible, horrible acting, bad sets, the only thing going for the film is that it sets a new low and people can say \"Hey, at least x isn't as bad as Little Nicky\". Line after line just dies, scenes go on far too long. The whole bastard movie goes on far too long.\n\nNote: You may need sterilizing after watching this terrible garbage. I sat with my mouth open throughout, later realizing I had dribbled all down my top."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "absurdlystrangedimension",
        "review_rating": "10",
        "review_title": "A mega Underrated silly feel good comedy",
        "review_detailed_main": "This film is just ridiculous, it should have at least a 7 but i love this film so much haha i watched it when it was first released and it gave me a headache from laughing so much, his trademark stupid man voice makes me crease up laughing everytime 😂😂 like i said with other sandler films, his message is always a good one and the end always with a feel good vibe, they make you feel happy so im grateful that he exists, his films are like medicine for a bad day, i love probably all of his films, dont be a critic when you want to have a laugh, you are meant to have fun, leave the criticism to those who get paid to be grumpy overly analytical sad people that dont know what fun is if it slapped them on their rear end, they are purposely made silly, THATS SANDLER, but hes not just a comedian, watch uncut gems, that film is amazing and not a comedy, anyway i digress, this is mega silly but so enjoyable and as usual has a really good feel good ending as always, i cant find any faults, and those who get offended saying he makes fun of people with problems, ITS NOT REAL, i have autism and adhd and some other issues but nothing offends me because ITS FICTION, anyway watch this film its so hilarious.. Im Mister ADHD. Peace.."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "RIPBelushi",
        "review_rating": "4",
        "review_title": "Comedy Central's Wet Dream",
        "review_detailed_main": "This movie was panned by critics, and nominated for five razzie awards (which is an accomplishment in itself). It's no wonder why despite an a-list cast, including Adam Sandler, Patricia Arquette, Harvey Keitel, and Rodney Dangerfield, memorable cameos, like Ozzy Osbourne!!, one effed up plot, and not to mention Adam Sandler (did I mention Adam Sandler?) this movie was called one of the worst films of the year. However, today is Comedy Central's lucky day! Movie's that tank equal big bucks on television. This movie is the ultimate Comedy Central movie, terrible in every sense of the word, but loved by hardcore comedy fans everywhere.\n\nAnd that is where I came across this movie.\n\nThe movie itself is god awful. Although stocked with some pretty memorable one-liners (\"even in hell i get no respect\") and some of the weirdest, but greatest, cameos ever put onto paper, they are mostly cheap laughs. However, as much as I hate to, I have to give an A for effort. This movie has some interesting special effects and an interesting commentary on the punk rock/metal culture. End. Sandler, as the son of Satan, plays the part to \"perfection.\" As the third son of Satan, oddly reminiscent of Sandler's Waterboy (an outcast with a speech impediment), he has to save all of hell and of earth from the wrath of his two far superior brothers, one played by Rhys Ifans who I believe gives one of the only decent performances in this movie. Sandler is everything that a movie critic despises. He's irritating, and acts terribly. The rest of the acting is sub-par as well, even from the great Harvey Keitel, but I guess it's hard to give anything as the part of Satan in a comedy such as this one.\n\nBad acting + cheap laughs + box office flop= Comedy Central gold!\n\nGo see Little Nicky, coming to a cable channel early in the morning, near you!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "djorno",
        "review_rating": "",
        "review_title": "Forget what the others are saying...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dlinderman-55448",
        "review_rating": "2",
        "review_title": "Whole Lot of Nope",
        "review_detailed_main": "I watched this once when it was new. I wasn't impressed. I just watched it again in 2021. It's still really bad.\n\nAside from a FEW chuckles here and there it's mostly absurd and not funny. And it's even less funny in today's time than when it was released. Doesn't age well. Isn't fun."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Josephpr1990",
        "review_rating": "2",
        "review_title": "Utterly rubbish",
        "review_detailed_main": "I remember watching Little Nicky on for the first time on DVD when I was a preteen. I thought I found it very funny but it's not very funny as the other Adam Sandler films and it's not very good as the other Adam Sandler films either. It's kinda very annoying, unfunny and idiotic as well. Its acting is very bad especially from Adam Sandler himself. It has a bunch of morons. I just don't like it at all. Nicky's voice sounds awful and it also sounds very irritating. It's probably one of the worst 2000s films of all time. It's utterly rubbish.\n\nIf you dislike this film, don't buy it on DVD 📀 nor Blu-Ray and try not to waste your money on this c--p.\n\nI am not watching it again ever.\n\nLittle Nicky is more like Little Icky."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Troll316",
        "review_rating": "3",
        "review_title": "Really disjointed movie, despite awesome talent",
        "review_detailed_main": "First off, I'm a huge Sandler fan and have enjoyed all of his movies, up until this one. Usually, there is some aspect of Sandler in each of his characters that I have identified with and have been able to root for, but that feeling was absent in this movie.\n\nThat's not so say, however, that I don't appreciate all of the talent that was in this movie. Rodney Dangerfield, Patricia Arquette, Howard Keitel, Reese Witherspoon and Tiny Lister had worthy performances. However, despite all of the talent involved, there was just something that lacked in this movie as opposed to Sandler's other movies that just didn't appeal to me and although I don't like to admit it, the movie had me glancing at my watch at several points.\n\nI especially like how Sandler always puts guys from his previous movies or his former SNL comrades into certain roles. Half of the fun of his movies is picking out characters played by actors that have showed up in his movies before. Kevin Nealon, Dana Carvey, the guy who played Nicky's gay roommate and both of Nicky's \"heavy metal\" followers did a great job. However, despite all of this, the movie seemed to lag and failed to reel me in.\n\nOzzy Osbourne's appearance as well as the tip-of-the-hat mention to Chris Farley were both awesome. However, they couldn't really save this one. Chalk it up as Sandler's first setback, but I'm sure that he will manage to recover and deliver as he has in Billy Madison, Happy Gilmore, Big Daddy and the Wedding Singer."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Leopold2",
        "review_rating": "1",
        "review_title": "What a fugly movie",
        "review_detailed_main": "Some kid brought this movie when we were having a class party. Everyone says they love it. I watched it and thought why does everyone love it it is dreadful. Adam Sandler is not that good. This movie is fugly as a baboon's arse. Everything about it is fugly. The jokes, the plot, the acting, everything. I would rather die if another movie like this came out. It is the worst comedy and #2 in my bottom 5 movies. 4.8/10. No. 0.1/10 it deserves. Bottom 100 #2. It deserves to have such hate. Everyone is saying: This movie is underrated, it is brilliant and it is the best comedy. No. As I said earlier it deserves to have such hate, it is awful and the worst comedy. This movie should be burnt and buried in hell where it belongs. 0.5/5. Vomit inducing."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "susnikdragica",
        "review_rating": "9",
        "review_title": "That singing bulldog!",
        "review_detailed_main": "I'd rate the movie with 7 but because of Sandler's hilarious devilish snorting and bulldog's angelic singing I rate this movie with 8 stars.\n\nAlso, I love Patricia Arquette, Harvey Keitel and metal headbangers guys. Also Adam's spiders, dude looks like a lady and Chicago record backwards ... well .you must see and hear everything for yourself 😉"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "justicekazzy",
        "review_rating": "3",
        "review_title": "A movie, straight outta hell.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "george.schmidt",
        "review_rating": "",
        "review_title": "It would be too easy for me to appease Sandler's rabid fans to say go to hell, but what the hell, go ahead.and laugh yourself silly.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "SOstahowsk",
        "review_rating": "1",
        "review_title": "upset parent/teacher",
        "review_detailed_main": "As a parent of two teenagers and a high school teacher, I was extremely offended by this movie. This is a movie targeted to a teenage audience, and in my opinion, has absolutely no redeeming qualities. Hell is portrayed as a \"cool\" place - unless you are Hitler (he gets pineapples shoved up his anal passage daily by the devil). Sinful lifestyles, involving drugs and sex, are portrayed as being cool and fun. Heaven is inhabited by beautiful, female angels who are all portrayed as air-headed, diz-brains.\n\nI was especially offended by the sexual scenes that took place in hell, involving the gorilla and the character with two \"breasts\" on his head. Do our teenagers really need to be exposed to this??? I allowed my teenagers to rent this because it was rated PG-13, not knowing how sexually and morally inappropriate it would be. Why wasn't it rated R???"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "shark-43",
        "review_rating": "2",
        "review_title": "P-U",
        "review_detailed_main": "Man, this film is such a mess - such a waste of money - you can certainly see the budget on screen. The art direction, the special effects, the way Hell looks is impressive, and yes, there are even a few decent jokes, but that does not make a good movie. You can see how powerful Sandler has become that the studio let him play the lead character in such a demented, cartoon faced way. The voice is like something a seventh grader might come up with on a long field trip bus ride and by the end of the trip, his friends (who found it amusing at first) would be begging him to stop the annoying voice. Sandler is so limited as an actor I guess he was more comfortable totally playing a cartoon. I guess he is an acquired taste and if he all he wants is to make 13 year old boys laugh, then he has succeeded. But after showing a bit of human element in WEDDING SINGER, he immediately went back to the one dimensional, unbelievable human being in WATERBOY and then continued it with this latest opus. His films make money, and if that's all he is after, then he wins. But if he truly wants to make well written, strong comedies - he's failed as bad as Pauly Shore."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "tankace",
        "review_rating": "5",
        "review_title": "The beginning of Sandler decline.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "richusa555",
        "review_rating": "1",
        "review_title": "An ignorant, and childish movie.",
        "review_detailed_main": "Most comedy movies made for kids are almost always bad, but typically in those movies, the actors are kids. In this movie the adults are all over thirty and act like twelve year olds. I can't recall when I've seen a comedy movie as lame as this one.\n\nThe beginning of the movie was okay but soon after the signs of a sucky movie begin to emerge. After about fifteen minutes of this garbage I knew I had been deceived and suffered thru the rest of the toilet humor, recycled jokes and repeating themes, and gritted my teeth until it was over.\n\nThere was only one mildy funny scene in the which the devil takes over the earth and addresses the morally corrupted crowd and tells them that he present them with Henry Winkler. Henry Winkler walks on stage and says good evening and then the devil says: \"covered in bee's\". A swarm of bee's attack's Winkler and the whole scene was just a few seconds and I did chuckle at that.\n\nLater in the movie the writers had him swarmed a second time, just in case you didn't laugh the first time. I though he had died. This in fact appears to be the writing strategy through out the entire movie, that is, find something that is amusing and then repeat it again and again.\n\nI gave this movie the lowest possible rating: 1/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jackfan93",
        "review_rating": "10",
        "review_title": "Little Nicky - Big laughs!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "DentedZ24",
        "review_rating": "5",
        "review_title": "From a HUGE Sandler fan - Not his best movie.",
        "review_detailed_main": "I've been a huge fan of Adam Sandler's for at least 4 years now (I'm only 15). I have seen and own nearly every more he has appeared in--from Going Overboard to his latest, Little Nicky--and I must say that if I had to rank this among my favorite Sandler movies, this has to be one of his worst.\n\nFrom a comedy standpoint I felt it wasn't nearly as funny as some of my personal favorites such as Happy Gilmore, Big Daddy, and Billy Madison. One or two things made me laugh, but not as much as I expect from a Sandler movie. The various other comedians featured in the film, to me, were pretty boring, too. I didn't even realize that Dana Carvey was the referee until I saw him in the cast on this page; Rodney Dangerfield did his usual comedic shtick even though I thought it wasn't as good as some of his jokes I've heard in guest appearances on Leno; Kevin Nealon's character is just plain not funny (I thought he was hilarious in Happy Gilmore). Jon Lovitz, on the other hand, was pretty funny though with the help of an oversized bird. The one thing I really did enjoy was the reference to a previous Sandler movie using one of its characters (for you Adam Sandler fanatics: You will enjoy that part).\n\nThe plot itself, I felt, was pretty stupid in my opinion. OK, so maybe Sandler's films--with the exception of Big Daddy and The Wedding Singer--aren't made to be for critical acclaim, I felt that for once the critics had every right to say what they did about this flick. It may be that I'm not into those fantasy-type movies, but the story was just so lame that it I wouldn't wish for Satan himself to see this God-forsaken movie.\n\nI haven't seen it since the second day it was in theatres, and I do plan on buying it eventually to complete my Adam Sandler collection, but for those that haven't seen it I advise you NOT to waste $20 on the DVD, 15 bucks buying it on VHS, or even $5 at your local Blockbuster. If you really do want to see this movie for yourself, try to do so while at someone else's house who owns the movie or already rented it. And for all you other Sandler-maniacs out there, let's hold our hands together and pray than in his next movie he can put all this trash behind him, and return to the comedic glory he has previously attained."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dkaznelson",
        "review_rating": "",
        "review_title": "AWESIME!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "kidnappingfreezers",
        "review_rating": "1",
        "review_title": "Atrocious",
        "review_detailed_main": "There's 3 things I cannot stand in movies and tv shows. One type of scene can ruin the entire film for me.\n\nSexualizing children and animals.\n\nViolence towards children and animals.\n\nUnnecessary and unnecessarily long sex\\rape scenes.\n\nExceptions made for certain facts, such as the content in The Tale (2018). Certainly never for things like The Gentlemen (2019), which doesn't show anything thank god, but it's implied with a combination of sounds. No.\n\nThis movie, despite being so terrible, could have been alright if they had just... not sometimes. A lot of times. My husband remembered it as funny and tried to sit me down to watch. Even that viewing he realised how trash it actually is."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "plonty_2000",
        "review_rating": "5",
        "review_title": "It is what it is.",
        "review_detailed_main": "The tagline about Little Nicky having never \"slept over some dude's house\" is far and away the funniest thing about the whole ordeal. That's a funny tagline, I say! The rest of it looks like Adam Sandler and his buddies took too many drugs and forgot to go over the ideas they came up with while they were on drugs later on while not on drugs to make sure they would be funny to people viewing the film later who themselves may or may not be on drugs. Oddly, and I can't explain it really, but I have a weird feeling that this movie is going to age well. In five or six years I think \"Little Nicky\" will look better and will seem funnier. If you haven't seen it yet, wait a while. The film has something in common with the process of dying, in that it's better than \"The Waterboy\" and \"Big Daddy\". So I'll give it that."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lars_hendrikx",
        "review_rating": "3",
        "review_title": "Worse than I expected",
        "review_detailed_main": "Going into this movie after I had already seen several movies with Adam Sandler in them that day, I had expectations of this one being a decent movie. I was proved wrong.\n\nJust like in Billy Madison, the character Adam Sandler plays has a voice that gets annoying very fast. On top of that, his character in this has a problem with speaking because he got hit by a shovel, which by itself is already a reason to doubt this movie.\n\nThe story itself is quite poor. Nicky's two brothers escape hell,where Nicky and his family (mum excluded) live, causing the fiery gate to hell to freeze. Nicky is send to earth with a flask from which his brothers have to drink from so Nick can take them back to hell.\n\nThere is a scene where Nicky drops by the house of a woman he met recently on Earth and who he flipped off (under possession by his brother). She uses pepper-spray on him, causing him to fall. He does not die though, because when he gets close to the ground his fall is stopped and he floats. He flies back up and explains who he is to her. The woman , who was flipped off, spoken to in a devilish voice and sees Nicky fall down and floating/flying after she pepper-sprayed him (implying she is frightened by him) then suddenly accepts him. Oh, so you're the Devil's son? Well, that makes sense, lets be a couple.\n\nAlthough I didn't like this movie, I didn't give it a 1. I haven't because it has some funny moments (The Chicago record with the dark message and Ozzy Osbourne. I also liked the reference to Happy Gilmore close to the end of the movie."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "Not the best of Adam's career",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lavis",
        "review_rating": "10",
        "review_title": "Positively shocking",
        "review_detailed_main": "I had my doubts when I started watching this film. I didn't like Adam Sandler, I had a doubt about Keitel in a comedy film and I had heard nothing about this film so I thought it was a flop. Well it only took a minute to see how wrong I was. In every possible way this movie was crazy. Usually there's at least a few scenes with rational behavior. This movie was crazy all the time. The jokes were shocking. Everything about this movie was absolutely brilliant. Boobs on this guys head, the thing with Hitler.. etc. I was positively shocked every other minute or so.. Yes, this movie was the best comedy I've seen since King Pin and Dumb & The Dumber.. Well actually, it was better than those. I'll maybe watch it all over again right now. It's 2:30 am and I don't think I'm gonna sleep this night, I'm gonna watch this film over and over again. Well, if you read my comments (the hype) and still haven't seen the film don't pay any attention to my comments, have your doubts and be surprised."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "OriginalMovieBuff21",
        "review_rating": "3",
        "review_title": "Sandler's worst",
        "review_detailed_main": "Little Nicky was probably the worst film of 2000. There was barely any laughs and all the laughs were just stupid fart jokes that we've heard before in any other film. I can't say, but I really like Adam Sandler's movies along time ago like in Happy Gilmore, Billy Madison, The Waterboy but now he's just kind of falling apart with films like Mr. Deeds and Eight Crazy Nights. He was excellent in Punch-Drunk Love and maybe he needs to stick to those serious movies instead. I mean I still really like Adam Sandler but he can make better films than these, honestly. I don't recommend this film.\n\nHedeen's outlook: 3/10 No Stars F"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Adam-the-tall-1",
        "review_rating": "5",
        "review_title": "A very okay movie",
        "review_detailed_main": "I liked it just fine. It's not a classic and I have no desire to rewatch it, like, ever, but it was enjoyable enough."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Brad_Dharma",
        "review_rating": "1",
        "review_title": "A different take on a comedic role for Sandler",
        "review_detailed_main": "I had not been looking forward to this film when I first saw the previews because I thought it was not typical Sandler. That turned out to be one of the best things about it. I thought the voice he had for Nicky was hilarious and able to be easily mimicked between me and my friends. Rhys Ifans played a hopefully star-making performance as one of Nicky's brothers. Another thing I should note about the film is it's use of current music which I can not stand in most movies. For some reason, most of the music in the film seemed to fit. When Nicky is in Heaven and they start playing Filter's Take My Picture, something in my mind clicked that this was right. The song fit in with the atmosphere created for Heaven. The funniest part in the movie which gets a 10 out of 10 is the beginning of the film starring the highly underrated Jon Lovitz. I did laugh my ass off at many parts of the film (like Nicky's Face on Scarface's in a clip shown by police) but Jon Lovitz had me me rolling with his peeping tom character. Sandler redeems himself from Bulletproof."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "stahwang",
        "review_rating": "1",
        "review_title": "Deliver me from evil.",
        "review_detailed_main": "I'm not a big fan of Adam Sandler, I do like Happy Gilmore but all the rest of his movies suck major a** (waterboy bigdaddy mrdeeds etc *barf*)\n\nAdam plays one of Beezlebubs (the devils) children and is sent to earth. This should be the beginning of the funny part of the movie but it ain't. For some reason Mr Sandler uses some kind of retardo voice through out the entire film, and I actually felt embarrassed for him. Mr Sandler isn't the only one suckin in this movie, Harvey Keitel's contribution is laughable and my \"respect\" for him as an actor went way downhill.\n\nTo sum it up. Not funny. Bad Acting. Stupid story. Oh did i mention that It sucks. This baby gets 1 out of 10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "IonicBreezeMachine",
        "review_rating": "5",
        "review_title": "One of Sandler's worst? Hardly. Could it be better? Sure, but I got a decent share of laughs.",
        "review_detailed_main": "Nicky (Adam Sandler) is the youngest and most soft spoken son of Satan (Harvey Keitel). Satan's 10,000 year reign is coming to an end, with Satan slated to choose a successor, whom Nicky is certain will either be his manipulative scheming brother, Adrian (Rhys Ifans), or his cruel muscle headed brother Cassius (Tommy \"Tiny\" Lister Jr.). After Satan decides to prolong his reign another 10,000 years believing none of his sons are ready for the responsibility this angers Adrian and Cassius who leave Hell with plans to rule Earth freezing the gates of Hell as they leave and weakening Satan who begins to deteriorate. Now, Nicky is charged with going to Earth and bringing his brothers back to Hell before the balance of Good and Evil is destroyed bringing about the apocalypse.\n\nThe first starring vehicle for Adam Sandler under his then new production company Happy Madison, high expectations were placed upon Little Nicky after Sandler's previous comedy, Big Daddy pulled in over $200 million worldwide. The film became a major disappointment with not only the expected critical derision, but also commercial disappointment as the movie opened at a respectable #2 at the box office behind heavyweight smash Charlie's Angels, but a particularly crowded holiday frame that included the following weeks Jim Carrey's The Grinch resulted in the film dropping off quickly of the top earners and making $39 million in the U. S. not even recouping it's $85 million production budget. International markets didn't help either with the worldwide total being just shy of $60 million. The movie is seen as a black mark on Sandler's usual bank-ability, but a mostly forgotten one as his comedies following this have been able to breeze past the $100 million mark, barring outliers like Eight Crazy Nights. Little Nicky was even called the \"Worst Comedy of All Time\" by MST3K host/writer Mike Nelson but even with all that said I actually find myself liking Little Nicky just enough.\n\nI think Little Nicky's biggest asset is in its supporting cast who are all wickedly funny playing farcical takes on Hellish minions. Harvey Keitel is a lot of fun as Satan (with a joyfully bad taste scene involving Adolf Hitler and a pineapple giving a decent laugh). Both Rhys Ifans and Tommy \"Tiny\" Lister Jr. Are fantastic playing Satan's reckless power hungry sons and there's some really funny scenes of them wreaking havoc on Earth by possessing prominent political and religious leaders and steering mankind towards sinful behavior involving debauchery, perversion, and violence (albeit fairly tame due to the PG-13 rating). The scene in St. Patrick's Cathedral where Adrian possesses the Cardinal and mocks the parishioners with comments on drugs and adultery is very funny (albeit with some problems in delivery) and it shows there's a really strong foundation for comedy. Allen Covert is easily my favorite character in the film, playing a struggling actor named Todd who becomes Roommates with Nicky and serves as a really amusing straight man to Nicky's demonic shenanigans. I also enjoyed John (Jonathan Loughran) and Peter (Peter Dante), a pair of Satanic metalheads who swear loyalty to Nicky after they discover he's a spawn of Satan.\n\nWhile there's definitely enjoyment to be had from the insanity on display, there are some notable drawbacks. The most obvious one is the voice Sandler uses for Nicky being sort of this half whispering half wheezing delivery that just isn't pleasant to listen to and doesn't yield itself to comic delivery. There's also a rather tacked on love story between Nicky and Patricia Arquette as Valerie Veran, a design student that Nicky falls for, and it isn't all that funny or sweet and just feels like it's there for the sake of being there. But unfortunately the weakest point is the comic direction by director Steven Brill who plays too many of the gags by directing actors play scenes too over the top or spout hackneyed lines like \"Hey! Hey! Hey!\" that kneecap otherwise promising comic points such as the St. Patrick's Cathedral scene. Prior to Little Nicky, Brill had written the Mighty Ducks trilogy for Disney and directed the Disney fat camp comedy Heavyweights for Producer Judd Appatow and star Ben Stiller, I can see this comic style working if this were a younger skewing comedy, and to a point I suppose it is, but it feels like it deflates much of the film's comic potential. There's also some lowbrow gay panic/transphobic humor but it was the early 2000s so it'd be surprising if that wasn't in there.\n\nLittle Nicky is a flawed but mostly enjoyable. In terms of comedies involving Hell I don't like Little Nicky as much as Bill & Ted's Bogus Journey or Kevin Smith's Dogma, but I did like it more than Highway to Hell or Stay Tuned. It suffers from having a lead performance that works against Sandler's talents and direction that doesn't know how to meter delivery, but it has some decent supporting work and a few visual gags that did make me laugh."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Hallelujah289",
        "review_rating": "8",
        "review_title": "If you're a The Waterboy fan you will like this",
        "review_detailed_main": "Much like in The Waterboy Adam Sandler plays a dumb yet lovable repressed nobody coming into his powers, except the setting is hell and instead of a losing football game Sandler's character Nicky must save his father, the king of hell. The Waterboy is probably the more effective movie with similar themes but Little Nicky is no slouch, and it has very enjoyable riffs on the theme and some incredible classic moments. There is the wicked funny \"battle\" at the end where the minions of hell are disarmed by Popeyes chicken and other of Nicky's inventions, for example.\n\nReese Witherspoon and Quentin Tarantino make guest appearances as a Legally Blonde-type bubbly blonde angel with a cell phone and a catastrophe-heralding blind soothsayer in a cheap suit on the New York City streets respectively. Just by these two characterizations you should know the type of buoyant brilliance consistent in the film.\n\nThe film is actually hilarious. I loved the devil whose punishment for failure was a pair of tits on his head, and the ongoing joke of the pink brassiere he decides to wear and the other romances that develop because of his new assets. There are plenty of other moments of originality and pure devilish humor (guess the torture for Hitler) that does set this film apart in its own right despite having a nod to other Adam Sandler stories.\n\nI give this movie 8/10 because I enjoyed it a super great deal and even liked the message it imparted in its own funny way about the power of small enjoyable things over stark antagonistic entities. I thought it was a successful film with even some rare dimension to it even if partly incidental to the humor. It's a sweet film even though it can be indecent in a way that's kinda hard not to love. Who doesn't want to see some transvestite nipple rubbing now and again. Just me? Ok.\n\nAnyway, do watch this film, it's worth it, even if I took a star off just because I wanted to like the dog sidekick more than I did. This film is definitely better than its 5.5/10 and I would like seeing it get more love than it has."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "amanfigo",
        "review_rating": "5",
        "review_title": "Funny supernatural comedy",
        "review_detailed_main": "Delirious and histrionic but at the same time amusing and funny comedy about angeles and demons that if at the same time we join it with something of Rock (Ozzy forever) and a speaking dog very nerve, we are among the last of the best movies in Adam Sandler and making us forget of pathetic his movies as for example The WaterBoy. The movien cannot maybe win an Oscar but in Little Nicky what counts is the supernatural entertainment that proposes this comedy and all its characters, except that of Patricia Arquette that makes a painful performance (this character is also the typical one of the one that the main character falls in love). Amusing Film for who he likes the entertainment cinema, This movie doesn't have nothing else that this: to pass a good time."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Matt Moses",
        "review_rating": "",
        "review_title": "funny, sick and a great way to distract yourself for an hour and a half",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "KevNJeff",
        "review_rating": "5",
        "review_title": "A real mess, but worth the price of admission for the Ozzy Joke",
        "review_detailed_main": "Pretty messed up movie - should have been campier... Adam Sandler's contorted face and annoying speech impediment made this film hard to watch - but the scene with Ozzy makes it all worthwhile. Truly hysterical pop-culture joke included in this scene."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "rollernerd",
        "review_rating": "5",
        "review_title": "Dark prince",
        "review_detailed_main": "Welcome back to another edition of Adam's Reviews!! **queue in intro music**\n\nTonight's movie review is the comedy flick Little Nicky (2000) where the Sandman plays a mild-mannered demon who needs to help his old man the devil played by the energetic Harvey Keitel after two of Nicky's brothers (one played by Deebo himself!!) escape Hell and cause havoc and a muck on Earth. Its up to Nicky to save the day. First, this movie may not appeal to a lot of people out there, its twisted and all out weird. But its funny, you have Jon Lovitz in the start playing ladies night while perving at a hot mum and later gets humped by a horn dog bird in Hell. Sandman;s voice is super funny in this and his laugh reminds me of Muttley the cartoon dog. You have Rodney Dangerfield playing Lucifer who has a few funny moments and the 4pm punishment appointment of Hitler. There is also Tarantino playing the crazed preacher plus Beefy the dog who got kicked out of the strippas. And don't forget about SNL alum Dana Carvey. The movie fails in going to fast and losing track what is happening. Would have been nice to see more of Dangerfield and even John Whiterspoon (Mr Jones for you Friday fans) could have had more screen time. The two fans of Nicky played by regular Sandman dudes also had their moments. The movie does awesomeeee with the rock music playing hits from Van Halen, P. O. D, AC/DC and Disturbed. The comedic elements do get sloppy and unoriginal and not that creative however it does have funny moments. The film is a forgettable comedy maybe because the jokes do not connect, overall 5.5/10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "pughspencer",
        "review_rating": "5",
        "review_title": "The next level of Hell, a happy madison comedy",
        "review_detailed_main": "The movie does have it's highlights from some of its cast, stand outs for me being Rodney Dangerfield and a blind deacon played by Quentin Tarantino. Not to mention there's definitely effort put into some of the production design with a few creative artistic merits. Unfortunately it's pretty much what you expect from a happy madison comedy. The jokes are juvenile, tasteless, sexist, and just plain awkward. Some laughs are good like a dog shooting a harpoon out unexpectedly & a hilarious Ozzy Osbourne cameo. Then there are the ones that are cringey like practically every scene with Allen Covert & the awkward scenes of Reese Witherspoon as Nicky's mom. It doesn't help either that for the whole movie you have to hear Sandlers grating speech impediment impression. Sure theres far worst comedies out there & this one isn't that bad to sit through, but definitely one not worth coming back to that often."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "miarosecammisa",
        "review_rating": "4",
        "review_title": "Lost my mind a little.",
        "review_detailed_main": "I used to love this movie as a little girl. In the 4th grade I listed as my favorite movie in the grade school yearbook. I've always known it's super silly and that the chances it had aged well were low but I thought of it fondly. Well. A few months ago I was going through something. Nothing specific. It was just the crushing weight of existence or dread. The point is, my husband randomly put this movie on one day during this dark period I was having and while watching it I began crying. The movie was so unfunny and trite and ridiculous it affirmed every negative feeling I was having about life. We had to stop the movie and he had to console me, albeit while laughing because of why I was crying. 4/10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "wwf_owner_86_2000",
        "review_rating": "10",
        "review_title": "Pretty Funny ***WARNING - MAY INCLUDE SPOILERS***",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dmgreer",
        "review_rating": "1",
        "review_title": "On a scale from 1 to 10, this is a Zero",
        "review_detailed_main": "This movie was on TV tonight, I couldn't bring myself to watch more than an occasional few minutes at a time. This has to be one of the worst movies of all time. I see no redeeming value in it. Why was Adam Sandler talking that way? It was just stupid, but then Adam Sandler is just stupid. Very wealthy, true, but he has never been funny, and never will be, and in most of his recent movies he seems to be vying for the crown of King of Smarm. I hate all of his characters, but Little Nicky is the worst I've ever seen."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dvdmrp",
        "review_rating": "",
        "review_title": "Very Funny! Much better than I expected!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "williamalake",
        "review_rating": "5",
        "review_title": "Not a bad film",
        "review_detailed_main": "This film was good and very funny at times. It was a good Adam Sandler but no where near his best. The film was also very unfunny and cheesy at times also.\n\nIt was worth watching if you are an Adam Sandler fan, but like I say this isn't the best film he has been in.\n\nThis film brings in some classic characters from other Adam Sandler flicks and creates some funny new ones. Adams brothers are particularly good, as is Adam himself, but the film lacks something.\n\nCertainly not as good as 'Waterboy' or 'Happy Gilmore' but worth a watch anyway."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "sanadalsalt",
        "review_rating": "3",
        "review_title": "The Comedy Abyss",
        "review_detailed_main": "I have to say, I completely agree with your 3/10 rating for the film \"Little Nicky - Satan Junior\". This movie had so much potential, but it fell flat in so many ways.\n\nFirst of all, I have to mention Adam Sandler. He is undoubtedly a talented actor and has given us some great films like \"The Wedding Singer\" and \"The Waterboy\". However, he has also made some real stinkers, and \"Little Nicky\" is definitely one of them. It's disappointing to see someone with such potential continuously churn out movies that are just plain bad. I mean, who thought it was a good idea to remake a classic like \"Mr. Deeds\" with Sandler in the lead role? It's insulting to the original and to the audience's intelligence.\n\nNow, let's talk about the film itself. The biggest problem with \"Little Nicky\" is that it's just not funny. The humor is crude, smarmy, and often relies on shock value rather than genuine laughs. Making a comedy about Satan and Hell is a tough job, but it could have been done so much better. Just look at \"Bill and Ted's Bogus Journey\" for example. That film managed to tackle similar themes in a clever and funny way. \"Little Nicky\", on the other hand, feels like it was written by 7-year-olds who think Beavis and Butthead's humor is too sophisticated. The crude jokes, like the sexually obsessed dog and the scene with demons shoving pineapples into Hitler's rectum, are just tasteless and not funny at all.\n\nWhat's even more frustrating is that there are people out there who actually think this film is good. I mean, seriously? Comparing \"Little Nicky\" to films like \"Gone with the Wind\" or \"Dr. Strangelove\" is just absurd. It's a low, stupid film without any value. It's disheartening to see that there are people who will pay to see anything, regardless of its quality. It's like the predictions in the film \"Idiocracy\" are becoming true today.\n\nInterestingly, if you look at the statistics for the ratings, you'll see that as many people loved the film as hated it. However, if you break it down by demographics, you'll notice that the older you get, the more likely you are to hate the film. It's clear that the film didn't resonate with a more discerning audience."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Floated2",
        "review_rating": "3",
        "review_title": "Comedy with lack of laughs",
        "review_detailed_main": "Little Nicky was an older film by Adam Sandler in which has been forgotten by many because it was panned by critics and was considered a flop with its large budget. It is considered one of his worst films and it suits as it. The main problem with Little Nicky is that it is a comedy without humor. The screenplay, wastes most opportunities for laughs on routine pratfalls and lame devil on earth jokes. Some attempt at cleverness comes with the arrival of two goofy dudes, Pete and John (Peter Dante and Jonathan Loughran), but these apostles are more like Led Zeppelin hangers on than disciples of the potential anti-Christ. However I found his talking dog Beefy to be a highlight of the film. He was there to guide Nicky and help him survive on earth.\n\nSandler has good intentions but his character comes off as annoying. If you dislike his character you are most likely not going to enjoy this film. The supporting cast around Nicky is made up of a who's who list in Hollywood that, unfortunately, has little to do. Rodney Dangerfield (as grandpa Lucifer), Dana Carvey, Jon Lovitz, Quentin Tarantino, Kevin Neelon, Michael McKean, Carl Weathers, Rob Schneider, Henry Winkler, Ozzie Osbourne and Regis Philbin, among others, make their appearances in cameo perfs. Overall the film has some moments worth watching but don't expect a hilarious type comedy"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "darkman-27",
        "review_rating": "2",
        "review_title": "What was Adam Sandler thinking?",
        "review_detailed_main": "I am a fan of Adam Sandler, but I just don't understand what he was thinking when he decided to make this film. Billy Madison for example, ok... its downright ridiculous, but it's also downright funny. Same goes for Happy Gilmore. Then came the Wedding Signer, it was what I like to call a movie that everyone can enjoy. Yet it still sneaks in great Adam Sandler humor. I true high quality film that most people should recognize. Waterboy came next; it sort of went back to the Madison format again. After that, Big Daddy came and went. I was happy to see Adam Sandler trying new things, but still packing in his good old humor... ok, now that I have rambled on lets get to my point.\n\nLittle Nicky... Whenever I hear that a new Adam Sandler movie is coming out I get excited because I hope it is going to make me roll on the floor, like Happy Gilmore did, but when I saw the preview for Little Nicky, I did not want to see it at all. It just seemed way too strange to be funny. Well, I went to see it anyway. I wanted to prove myself wrong.\n\nThis movie just was not funny. (ok it had a few moments) But it was generally just stupid. It was so bad I have almost lost all my respect for Mr. Sandler. I am sorry. This movie is not believable in any way. I just don't understand how a movie like this could have even been made. I would like to give some more specific examples, but it would just take too much out of me. Just Do yourself a favor, and forget about seeing this one."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "HabibieHakim123",
        "review_rating": "8",
        "review_title": "It's Enjoyable, It's Entertaining, It's Fun",
        "review_detailed_main": "Even that little tribute to Chris Farley really warm my heart and make me smile, no matter how much the imperfect things in the movie, i found Little Nicky as another fun Adam Sandler movie, it's enjoyable, it's entertaining, it's fun."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dvanhouwelingen",
        "review_rating": "5",
        "review_title": "Better than most Sandler, but still not good.",
        "review_detailed_main": "LITTLE NICKY is one of Adam Sandler's best films. That still doesn't make it a good one though. There are moments that are hilarious- Reese Witherspoon as a ditzy angel come to mind- but Sandler himself is a distraction. He clumps around the screen walking and talking like a retarded Richard III. His voice is annoying, and what's more unnecessary. He didn't have to talk like an imbecile to get laughs. But there is a lot here to like. Harvey Keitel and Rodney Dangerfield as Satan and his father, Quentin Tarantino as a crazy, blind priest (but I still think he should try directing again soon!) and many other good moments. The climax goes on much too long and the toilet humour never really works. When all is said and done- LITTLE NICKY is an average comedy- no more no less. 5/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Jack the Ripper1888",
        "review_rating": "",
        "review_title": "Funny flick.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "chrisbrown6453",
        "review_rating": "5",
        "review_title": "Make no mistake about Little Nicky, folks. It's Adam Sandler. It's farcical comedy.",
        "review_detailed_main": "But for those of you who are undecided, for those of you who are thinking, \"Maybe it's time I gave an Adam Sandler movie a chance\", do me a favor, will ya? DO NOT RENT Little Nicky. Go out and rent a GOOD Sandler flick like The Wedding Singer, dig up your old Saturday Night Live videos of Sandler as Opera Man or Peter Brady, or even watch old re-runs of The Cosby Show where you might catch a young Adam Sandler as Theo's pal, Smitty. Whatever you do, promise me you'll think twice about going to see Nicky. Title-character Nicky (Sandler) is one of three spawns of Satan (Harvey Keitel), living in Hell (literally), getting kicked around by his two older brothers, Adrian and Cassius (Tom \"Tiny\" Lister, from Friday fame), and generally just trying to be a good evil son to his father. After evil Dad denies them the right to take over Hell once his 10,000-year reign has come to a close, Adrian and Cassius decide to take their anger up to Earth -- at the same time, freezing the portal to the flaming gateway to Hell. Unfortunately now that the gateway is frozen, there are no more souls to feed Satan (and keep in mind, this is a BAD thing), so his body slowly begins to deteriorate (a finger flops off here, an ear is shed there, etc.) It's now up to Nicky to bring his brothers back home before his father rots away. Faced with fast-moving public transportation, a Jack-Nicholson-mimicking mutt named \"Beefy\" (Nicky's \"earthly guide\"), a retentively stuck-up actor for a roommate, and a growing love interest in homely-looking Patricia Arquette, Nicky finds it difficult just staying alive, much less retrieving his satanic sibs and saving Hell. Yeah, it's confusing to me, too, why anyone would care enough to save Hell, but I'll chalk it up to \"It's an ADAM SANDLER movie -- I'm supposed to be ENJOYING this.\" Yeah... whatever.\n\nWhile Nicky does have its moments (the cameos in this thing are unbelievable!), there's little excuse for this movie. It's like watching a long, drawn out, really dumb Rodney Dangerfield joke -- complete with RODNEY DANGERFIELD (as Grandpa Lucifer I might add)! What seems to start off well and amusingly so turns into a hodge-podge of weak (and surprisingly archaic) one-liners, jokes the size of the Stay-Puff Marshmallow Man coming down Fifth Avenue, and THE most annoying assault on the auditory senses... Adam Sandler's voice-choice for Nicky. Think Renfield from the original Dracula (1931) crossed with Baron von's assistant from Frankenstein (1931). I could only take so much of either character when I saw both films... and they came back to haunt me in this one throughout its ENTIRETY. Might as well have been in Hell, let alone sitting through a movie about it."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "The_Gardening_Bros",
        "review_rating": "4",
        "review_title": "Little Bad",
        "review_detailed_main": "Little Nicky isn't a good movie. There's a lot of scenes in this movie that make you wonder why they added these. But that doesn't mean this movie is fully bad. There's still a lot of good scenes in this movie that make it more enjoyable. A prime example is the fight scenes. There's a few of them in the movie and they're pretty funny to watch. Without getting into spoilers that's all I can really say about the fighting scenes. I also like how Whitey is in this movie for a little bit. Seeing him made me have a good laugh. Now for the bad scenes in this movie. There's a lot of jokes that aren't funny and make you question what you're watching. The only theory I have for these jokes being in the movie is that Adam Sandler made the jokes and thought it would fit the movie. A lot of them don't. Also a scene contradict itself literally two or so minutes after Little Nicky was told to do a thing. In conclusion, watch a better Adam Sandler movie like Grown Ups 2 and only watch this movie if you want to see a bad Adam Sandler movie or you're watching all of his movies."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mellywoodsmansion",
        "review_rating": "3",
        "review_title": "I saw Little Nicky",
        "review_detailed_main": "Not good at all not sandler WORST moive but petty bad! Non the less the worst \" early\" sandler film but not the 2000s sandler film (that goes to zohan that moive can go kill itslef) this is in the good sandler years 1989 to 2004 the crap sandler years 2005 to now I don't think his a bad actor but if he keeps make moives like this I'm not going to see very bad boring film."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "daveairguitar",
        "review_rating": "5",
        "review_title": "Welcome to the manic world of Adam Sandler!",
        "review_detailed_main": "Adam Sandler is a very funny man but where this movie fails is its overdose on sentimentality. Don't get me wrong it is a good film but its hardly funny ha! ha! more like funny strange with a couple of titters here and there. Sandler plays Little Nicky a kind of strange character somewhere between Quasimodo and his nerdy character in the Waterboy. Ryhs Ifans starring as Nicky's evil brother Adrian is gloriously over the top and completely steals the show. Adrian and Nicky's other evil brother Cassius decide to go up to earth to corrupt the people and their father the Devil himself (amusingly played by Harvey Kietel) sends Little Nicky after them to bring them back cue sub-plot about the Devil dying because Adrian and Cassius have frozen the gates to the entrance of hell, etc etc. This leaves Little Nicky till midnight to get them back before his father, the unholy one himself croaks. Once Nicky gets upto earth he does the usual stranger to the world routine embarrassing himself with his lack of social and moralness. His love interest is completely blink and you'll miss her and thats about it really. Check out cameos from Henri Winkler, Carl Weathers as Chubbs (Its all in the HIPS!) and Quentin Tarantino. Could have been so much better!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "samuel-granados18",
        "review_rating": "10",
        "review_title": "Great for nostalgia",
        "review_detailed_main": "I watched this as a kid, and watch it every now and then whenever I'm craving Popeyes. Lol. Not sure why the low rating... People take it too seriously, it's not a serious movie. I rated this a 10 because of it's rewatch ability."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "julesy9",
        "review_rating": "4",
        "review_title": "Odd juxtaposition of juvenilia, raunch and special effects",
        "review_detailed_main": "We all know by this point that Adam Sandler is not one to go for high-brow humor. He prefers to entertain his audience of college students and teenagers with a cornucopia of absurdities and toilet jokes. Little Nicky is much the same, but with two major differences.\n\nThere is a heavy dependance on special effects in this film. Nicky, as the Devil's son, obviously resides in Hell and Sandler's version of Hell is pretty impressive looking, at least in wide, panoramic shots of the geography. The special effects are put to good use here, but it isn't very scary. Hell looks like a fine place to live, and as the Devil, Harvey Keitel seriously downplays both the Devil's evil side and his funny side, doing little to add to the film. There is little to be scared of in this Hell. Except for the occassional gross-out gag.\n\nNicky goes to Earth to prevent his brothers, the two most evil characters, from corrupting the souls on earth and thereby, in a convuluted and pointless plot, killing Nicky's beloved father. While on earth, Nicky is aided by a talking bulldog, a couple of metalheads looking for some cred, and a shy but sweet girl played by Patricia Arquette.\n\nSandler always has a love story in his films, but never has one been so juvenile. Nicky is little more than a shy teenager, new to earth and awkward in expressing himself, and the scenes where he falls for Arquette are ineffective and cloyingly sensitive. Hearing the Devil's son talking about butterflies in his stomach, in a film that features a character sprouting breasts on his head, struck me as an odd juxtaposition. 10 year olds will love some of the jokes and they might even enjoy the cheesy romance, G-rated as it is, but would you want your 10 year-old going to a movie that features an enormous bird attempting to copulate with Jon Lovitz?\n\nSandler needs to choose an audience, this movie is splintered down the middle as he attempts to appeal to 5th graders with his goofiness and to college kids with his scatalogical side. It never reaches any level of cohesiveness, though it remains entertaining in fits and starts. Between the special effects, the sap and the raunch, the movie gets lost in the mix. Next time, Sandler should choose one audience and ride it all the way through."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Tom Schulz",
        "review_rating": "",
        "review_title": "Fun for the Sandler in all of us",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "Little Nicky",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mark.waltz",
        "review_rating": "5",
        "review_title": "New York or Hades? Really, what's the difference?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "FunnyMann",
        "review_rating": "5",
        "review_title": "Eh",
        "review_detailed_main": "OK, here's what I don't get: Why do people who don't like Sandler keep coming back for more? Like what do you think, one day he's gonna show up and be Anthony Hopkins? Not bloodly likely.\n\nThat said, this is not a good Sandler outing. I can't see how or why a comedy should ever cost $80 million, but if it does, it should be better than this. And I'm in the damn thing in one of the crowd scenes.\n\nEveryone has misfires. This is Sandler's. It's not a total waste of time, but it's dumb enough that it makes Sandler's other fare seem kinda smart. If that doesn't deter you...happy viewing."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ramzie-50497",
        "review_rating": "10",
        "review_title": "Flawed but still great",
        "review_detailed_main": "Little Nicky doesn't really have the best reputation but I actually think that the movie is one of Adam Sandlers best movies and can stand hand in hand with his other classics. Though this is also a childhood favorite of mine, so my opinion is probably biased. That being said, not everything about the movie works and I can admit that it has its problems. The acting isn't always great and definitely hasn't aged well, the same can be said for some of the special effects too which can be a bit surprising since the budget for this was so high plus some of the writing isn't great too and it can lead to some clunky plot developments. This is still such an enjoyable experience though and I would highly recommend it to anyone that looking to turn off you mind and find something to pass an hour."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jetgraphics",
        "review_rating": "10",
        "review_title": "Guilty pleasure, watchable over and over",
        "review_detailed_main": "At first glance, this is Sandler doing his thing. But after watching it, multiple times, the jokes are still good, and Mr Beefy is the dog - grrrr - I mean the man. Don't expect logic and linear thinking here - it's a comedy. Hell is not \"heaven\" for metal heads and power chords. Avoid the sanitized TV version. You won't get most of the b-a-d jokes. Some nice touches and \"in\" jokes, as well as famous walk ons.\n\nCovering Henry Winkler in bees is so funny - sad. You can tell the cast were having a great time, and it sneaks into the film.\n\nSoundtrack is entertaining, and doesn't clash with the movie like many other \"rock\" soundtracks (i.e., Queen's Flash Gordon - groan)."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Fifilafoo",
        "review_rating": "10",
        "review_title": "You Can Do It",
        "review_detailed_main": "To be honest, I don't see how this movie got so low! Adam Sandler is a true comedy artist and he definitely doesn't fail to prove this in Little Nicky.\n\nThis movie will have you wetting yourself with laughter with it's corny yet lovable plot and characters. You'll need some crude sense of humour to see the real goodness of this movie and it's wicked characters involved.\n\nNicky, a deformed but loving son of the devil must go to 'The Surface' (or the plain we live on) to find his brothers to save his father. He meets quirky characters like Mr. Beefy, a talking bulldog, who has to teach him to see his 'evil side'.\n\nYou won't know till you've tried now will you?"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "m_vazquez",
        "review_rating": "10",
        "review_title": "Sandler is one of our guys",
        "review_detailed_main": "\"Little Nicky\", what´s a masterpiece. Funny, extreme, gross, incorrect... and great! I think this is what \"Dogma\" try to be: when the Smith´s film was a shy catholic movie with some dirty jokes, often funny but frustrated, this one is an insolent and brave film, with a strange and triumphal sense of humor, full of implied sex and heavy- metal. Blasphemy could be an art, too. Sandler is the ultimate king, Reese Witterspoon is God and \"Little Nikki\" one of the best comedies of this year. Antichrist superstar!!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "duff_99",
        "review_rating": "10",
        "review_title": "Hell is cool",
        "review_detailed_main": "Why does everyone hate this movie so much? It's the funniest movie in the world! I'm a big Adam Sandler fan and I can say that this is his 2nd to best movie (Happy Gilmore being the best). Rodney Dangerfield did great in this. The music was great, cause it always felt right in the scene. I can not see a single thing wrong about this movie 10/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Cylex",
        "review_rating": "10",
        "review_title": "\"Such a sweet boy.\" - A hilarious comedy with heart.",
        "review_detailed_main": "This is one of the best comedies I've ever seen. My heart went out to Nicky as he strived to save his loving father. I've never come across Adam Sandler before but this has to be his best performance. I also enjoyed Beefy, Satan & Nicky's crazed disciples. In fact the whole ensemble was funny and there were some great special effects. Perhaps it is a little disgusting in places but I wasn't offended by it. All I know is I was kept laughing from start to finish and thoroughly enjoyed it. I purchased this on video soon after viewing it on cable and laughed all over again. A definite 10. Better than Dogma."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "MariahWebb",
        "review_rating": "10",
        "review_title": "A life changing experience",
        "review_detailed_main": "\"Defining and analyzing humor is a pastime of humorless people.\" -Robert Benchley\n\nPossibly one of the funniest movies I have seen in a long time. If you don't understand why this is funny, you should go rent \"Epic Movie\" and get on with your sad little excuse of a life. Adam Sandler is pure genus. The whole thing is just an indescribable burst of happiness to our everyday lives... OK that's a little over the top. It's just really funny, you should watch it... and if you don't like it... than go base jump off the side of a building WITHOUT A BUNGEE CORD.\n\n*this user does not recommend committing suicide as a supplement to your since of humor, or your lack thereof*"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "atinder",
        "review_rating": "9",
        "review_title": "one of Adam Sanders best movies",
        "review_detailed_main": "I really like Adam Sandler this was he second movie I saw the first movie was The Waterboy.\n\nThis movie takes place in hell with Satan then He brings his 3 sons-Adrian, Cassius, and Nicky-to decide who will next Satan will be.\" Adrian and Cassius or Nicky for being their father's personal favourite, as the other brother pick on him and already hit in head with shovel so now he can't speak normal, The Devil decides to rule another 10,000 years himself.\n\nThens Adrian and Cassius are very angry so go to Earth and create a \"New Hell\" there, getting as many souls as they can.\n\nWhen They escape Hell and freeze the entrance, the Fire Gate, on the way out then Satan begins to die. Satan sends Nicky to Earth with a Silver Flask that traps the drinker inside it forever. The only way to UN-freeze the gate is to get Adrian and Cassius to return through the Fire Gate inside the Flask.\n\nWhen he ghetto Earth is meet a talking dog that help him to get Adrian and Cassius. it not to easy as looked and he end up falling in love with girl. who end up helping him as well.\n\nThere some great funny moment in this movie. I could watch this movie all day long and every day and never get bored of it.\n\n9/10"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mdjandt",
        "review_rating": "10",
        "review_title": "THIS IS A GREAT MOVIE",
        "review_detailed_main": "I don't understand why it's getting a low rating. I watched this a lot over the years and still love it."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "livvytheolive",
        "review_rating": "8",
        "review_title": "What can i say?",
        "review_detailed_main": "An cool but hilarious movie for about id say 12 up or maybe 11 year old because there is some swearing in it. Adam Sandler is a brill Little Nicky as i have watched may movies from Adam Sandler before and he is wicked.Little Nicky is like an emo punk rock devil thing! Who is going to become King...But his brothers escape though the portal which puts people in hell and he has to go into the real world to find them and bring them back before there father dies by turning to bits.Little Nicky isn't very evil but kind of nice he shoots out Bunny's and rainbows out of his hands weird!And he goes up to heaven to visit his mum. I love the script and the settings also the storyline is very cool. I really recommend this film but remember pop eyes chicken is awesome!!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "The Last Sane Moviegoer",
        "review_rating": "10",
        "review_title": "Forget the critic flames, this movie's a Sandler masterpiece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jeremycrimsonfox",
        "review_rating": "8",
        "review_title": "Underrated Comedy",
        "review_detailed_main": "Yeah, Adam Sandler comedies back in the day were hit-or-miss, but Little Nicky actually does something different. The title character is the youngest son of the devil, and is sometimes bulled by his older brothers, Adrian and Cassius. However, after their father, the prince of darkness, decides to continue his rule, seeing the three are not ready as they have not learned to balance good and evil, which maintains the stability of his rule, Adrian and Cassius decide to escape to Earth and turn it into their own Hell to rule. Angered, Satan sends Nicky to bring them back, but on his mission, he ends up experiencing many things, even falling in love.\n\nThis movie is a funny one. Despite having the clichés most of these PG-13 comedies have (as some of the humor can be raunchy), the movie is way underrated. Adam Sandler does a good job as the title role, and the movie has a good selection of stars, like Robert Smigel of SNL fame voicing talking bitpull guide Beefy, Rodney Dangerfield as Nicky's Grandpa Lucifer, and off course, the various cameos they managed to squeeze in (including two from past Adam Sandler comedies). The movie has some funny scenes (like the one with Harlem Globetrotters getting riled up by Cassius' antics while disguised as a referee). It gets a eight because some of the jokes are a miss to me, plus the movie uses Popeye's Chicken as a plot device near the end (thus being blatant product placement, although TV airings censor the logo, possibly because of copyright issues). But still, this is a neat movie, and I am liking this better than Dogma."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "justintimeforeverything",
        "review_rating": "8",
        "review_title": "One of my favorites",
        "review_detailed_main": "Love this movie and Adam Sandler! This movie is awesome from beginning to end. It's hilarious, awesome and entertaining!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "tdero-71793",
        "review_rating": "10",
        "review_title": "unloosen your spincters",
        "review_detailed_main": "This is a comedy, you clowns...one of the best ever made...only part i didnt like was nicky in Heaven...cuz the girl angels act like air head valley girls...sandler just had to include his wife in this movie..."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "8",
        "review_title": "Hitler and Pineapples......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "moviewiz-4",
        "review_rating": "8",
        "review_title": "Wonderful",
        "review_detailed_main": "Good comedy movie, especially the effects and storyline. Most of the ideas in this movie are completely different and new.\n\nProbably, the sound and music composer should deserved a credit as well. They all match perfectly and beautifully done especially at the final scene where constant effects changing that happen from time to time."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "devastatr",
        "review_rating": "",
        "review_title": "don't waste your time on this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mas_tm",
        "review_rating": "10",
        "review_title": "This Movie Is COOL",
        "review_detailed_main": "I think this movie was very original, with a lot of unreal aspects, keeping you on screen all the time, with a good action and much comedy. This movie must be seen!!!! Adam Sandler is doing his role extremely good, the other actors are doing this too. You Must Rent this movie necessarily, its too good to not see it!!! I think is one of the best comedies in 2000, maybe Shanghai Noon is a good comedy too. Finally I want to thank everyone looking at my comment :) Ever hear of a movie that is suppose to be the extreme of one sort or another that doesn't live up to its billing? Little Nicky is one of those films. Roasted upon its release as one of the worst films of all time Little Nicky turns out to be an okay comedy. Actually this is the kind of movie that has all of the ingredients to be a screamingly funny comedy, but somehow things don't work."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "flickjunkie-3",
        "review_rating": "",
        "review_title": "Dull and Unfunny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dvintin",
        "review_rating": "8",
        "review_title": "Stupid = hilarious",
        "review_detailed_main": "Off the wall screwball comedy featuring tons of famous funny people from history. It's a Sandler movie so you know it's either gonna be really funny or downright ridiculous. This film is both. Anyone saying otherwise has no sense of humor and a severe lack of intelligence and no sense of humor."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mystic80",
        "review_rating": "",
        "review_title": "Like one of those Disney movies on acid....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "steman-1",
        "review_rating": "10",
        "review_title": "Sandler Does It Again!",
        "review_detailed_main": "If you like Adam Sandler humour, then you will absolutely love this movie. I am a huge fan of Adam's films and this doesn't dissappoint one bit. Basically, the movie runs a bit like this; The Devil is retiring and needs to choose one of his three sons to rule Hell for the next 10,000 years. He fails to make the choice and Adrian and Cassius get slightly annoyed and head for Earth. This blocks the gates of Hell and causes the Devil to fall apart. This is where Nicky comes in, who is instructed to search for his brothers and bring them back within a week. On Earth, Nicky needs to dress in warm clothing and experiences things like eating and sleeping for the first time in his life. He meets and falls for a slightly geeky, design student named Valerie (Patricia Arquette) and has difficulty in finding his brothers.\n\nAdam rules the comedy genre once again!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "the amorphousmachine",
        "review_rating": "",
        "review_title": "THe worst film I saw on cinemas in 2000!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "maissans",
        "review_rating": "10",
        "review_title": "very funny",
        "review_detailed_main": "being a fan of Adam Sandler, I just love any movie that he act in it, even if he appears for seconds, but to be honest, this movie is different and for those who await an extraordinary movie, this will never happen, the comedy's purpose is not to keep you laughing all the time! this movie is crazy and especially for Adam's fan. Hell, evil , Devil all these horror based movies fits in this movie to bring laughter and is meant to be sarcastic, the only part which i did not like about the movie was the Heaven's part in which he turns to have an angel mother who helps him to defeat his brother and take him back to hell."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "boris-26",
        "review_rating": "",
        "review_title": "A fun party movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "kam944",
        "review_rating": "10",
        "review_title": "best movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dobandray",
        "review_rating": "",
        "review_title": "Hellava waste of money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "depproxmysox",
        "review_rating": "10",
        "review_title": "a great movie!",
        "review_detailed_main": "An Awesome movie! ~~ wow. that was what i said rite after i saw this movie. this is my brother(9)and my favorite movie(I'm 13).maybe about once a week i would have a \"movie night\", where we would invite a whole bunch of people over and watch a movie. I rented \"Little Nicky\" and EVERYONE loved it. ~~ If your looking for a good laugh, Little Nicky is a movie you should watch! It might not be appropriate for younger kids though..If you are a big Adam Sandler fan, this is a must-see movie. This movie is basically about good vs. evil. My parents also thought it was a great movie. Most people either hate it, or love it. So watch it and see for yourself!!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "powerfully_attractive",
        "review_rating": "",
        "review_title": "Ridiculous and pointless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Lmoreno384",
        "review_rating": "10",
        "review_title": "Love it!!",
        "review_detailed_main": "My favorite movie. It's funny and one of Adam Sandlers best movie."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "David, Film Freak",
        "review_rating": "",
        "review_title": "'Little Nicky' is the shiznick!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "rodrigo_tresmil",
        "review_rating": "10",
        "review_title": "La Mejor Pelicula",
        "review_detailed_main": "Buenos Chistes, Un Final Inesperado y La Gracia De Adam Sandler"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mgarratt-55519",
        "review_rating": "",
        "review_title": "It's a Sandler movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jacobjohntaylor1",
        "review_rating": "9",
        "review_title": "Highway to hell",
        "review_detailed_main": "This is a great movie. It is very funny. It has a great story line. It is also a great fantasy story. And one very few Comedies I enjoy. I know most just like any thing this comedy. But not me. But this one comedy movie I like. It had very good acting. I do not like most of Adam Sandler movie. But this one is great. It is classic fantasy."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lilsauts218",
        "review_rating": "",
        "review_title": "a disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "meireena",
        "review_rating": "10",
        "review_title": "This movie is Awesome",
        "review_detailed_main": "This has to be my favorite comedy. let the sin, begin!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "justin6121",
        "review_rating": "",
        "review_title": "One of the worst films I have ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "famousgir1",
        "review_rating": "10",
        "review_title": "Adam Sandler as the son of the devil.You can only expect a great film.",
        "review_detailed_main": "\"Little Nicky\" is a brilliant and very funny film.What more you could you want from the man who brought us The Waterboy,Big Daddy, The Wedding Singer and much more...Adam Sandler.All of Adams movies rock and this one is no exception.Brilliant!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Zaxell",
        "review_rating": "",
        "review_title": "Experience Hell first-hand",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "collinc",
        "review_rating": "8",
        "review_title": "Was I The Only One Who Liked This Movie",
        "review_detailed_main": "I never saw this on big screen, but I wish I did. The trailer did no justice for this movie. This ranks 2nd on my Adam Sandler movie list.(Next to Bid Daddy.) The movie should have been sponsered by Kraft.(because it's cheesey), But after watching it, I walked around all day saying,\" Hi Friend, I'm Nicky.\" I liked this movie alot, But I'm an Adam Sandler fan.."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "What You See Is What You Get.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "renaldo and clara",
        "review_rating": "10",
        "review_title": "HILARIOUS",
        "review_detailed_main": "Someone said they did not see Dana Carvey; he was the evil guy disguised as a ref at the basketball game.\n\nThis movie was fkn *hilarious*. If critics pan it, and if fat-boy Ebert goes on his late-night show and gripes about the fact that his precious time had to be wasted watching the flick,and people don't watch this movie because of that, that is a true shame.\n\nDon't believe those dumb critics. Who can respect a fat, bald old man who gets paid heaps just to review a movie for a YOUNGER audience he will NEVER understand? Critics are like cops. Most of them have to attack one thing. Just like cops'll go after kids with long hair, or dark skin, critics have tried to be AGAINST movies they think will make considerably less money than others, or movies they just plain don't understand. Just look at the reviews for <There's Something About Mary>. Yeah, don't *those* critics feel like idiots now.\n\nThe point I'm trying to get here is, no this Sandler movie doesn't look low-budget; it looks high-budget. It's not even his best movie, in my opinion. But you know what? It's a damn-good movie. It reflects Sandler's humour with the usual cool style. Believe me, *anyone* is a fan of Sandler movies will really like this movie. And I'm not being paid to say this.\n\n\n\n-Sep"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Mostly just stupid fun, but it is a fun movie for Sandler fans.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "amolthea",
        "review_rating": "9",
        "review_title": "Great Movie for Sandler Devotees",
        "review_detailed_main": "This movie, like all of Adam Sandler movies sticks to his unusual sense of humor! If you love Happy Gilmore, Billy Madison, etc... you will love this movie! He always hits on previous themes and jokes, plus how can you not love a movie where Hitler gets a pineapple in his @ss everyday at 4 PM? It's crazy hilarious! I think the best part of this movie is watching Harvey Kietel's character rotting away as the devil; it's all so insane I can't help but love it! This movie isn't meant to be a deep, philosophical experience, but it is meant to make people laugh, which it will if you really love Adam Sandler's type of humor, otherwise look elsewhere for your movie watching enjoyment."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Michael G Sibley",
        "review_rating": "",
        "review_title": "How awful can one movie be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "sykesm-25135",
        "review_rating": "9",
        "review_title": "Hysterical!",
        "review_detailed_main": "This is easily in my top 3 Adam Sandler films! So funny and genius all around. Don't listen to the negative comments... it's a movie... it's supposed to make you laugh and that's what it does!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Opie-6",
        "review_rating": "8",
        "review_title": "Kick-@$$ (some spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "BobWeigh",
        "review_rating": "10",
        "review_title": "Good for what ails ya",
        "review_detailed_main": "Quite a pleasure for a fan of the Sandler goofiness. Amazing amount of references to his previous work, bit players from past movies appearing again. All of his movies are being linked together, with characters from earlier movies running into and saying hello to characters from the current movie. Perhaps, someday, the movies will be able to be edited together, like the Godfather movies, according to the time the events in the movies happened. That would be 19 hours of pure movie pleasure."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "renatemykids",
        "review_rating": "10",
        "review_title": "Stinky",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Count_LaFey",
        "review_rating": "8",
        "review_title": "Not a Sandler fan... but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "i_know_people",
        "review_rating": "9",
        "review_title": "very good laugh",
        "review_detailed_main": "little nick is a good laugh for times that you really need cheering up. Adam Sander is a funny guy and shows that yet again in this film, he provides good laughs and good humour, though the humour isn't to everyones taste as may offend some people it is a good laugh if you don't follow the storyline too strictly. all the cast are good as their roles and all provide the need laugh that makes the film great.\n\nthose that are easily offended don't watch it as you will be upset by the content but those who are Sandler fans or love a good laugh you will love it.\n\ni wouldn't give my copy of it up for anyone."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "gibbs-18172",
        "review_rating": "8",
        "review_title": "One Hell of a Happy Madison Movie",
        "review_detailed_main": "Look you know the jist of most Adam Sandler movies, well not this one. Sandler is dopey Duffus type and not ranting at random moments.\n\nFor me one of the funny ones of the \"others\" that he has made, so not including, Gilmore, Wedding Singer, Waterboy etc\n\nSome great cameos"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "kuddells",
        "review_rating": "10",
        "review_title": "Totally Fabulous...",
        "review_detailed_main": "I really enjoyed this movie. I watched it about 25 times in a week. Then my boyfriend and I went and purchased the movie. I hope you like it too.\n\nConnie J."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "prema_raax",
        "review_rating": "10",
        "review_title": "Damned funny...",
        "review_detailed_main": "This movie is so funny, I laughed my ass of not just a few times. Perhaps mocking religion a bit, but hey: I think there is a God but no devil. The sum total of hateful and egoistic people is enough, and those can be called satan, or whatever. I know God wouldn't mind this movie. It's very funny, and Adam Sandler is a neat actor. The story is a sweet one, and perhaps a little symbolic - who knows?! If you haven't seen it, do it. If you have, do it again. Be mindful, and let go. A good laugh prolongs life, and this movie - Little Nicky - prolonged my live a couple of years. God bless the creator of this movie.\n\nPeace!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jordanscuz14",
        "review_rating": "10",
        "review_title": "The Movie Was GREAT!",
        "review_detailed_main": "If you are interested in seeing more of Adam Sandler's movies, then you would totally enjoy this movie! Also, feel free to go and see \"Click\", now in theaters. \"Little Nicky\" is a story to where there is a mother and a father, but the mother is an angel, and the father is the devil. A lot of mishap goes on throughout the majority of the movie, so you better be careful what you wish for! Anyways, when Nicky {Sandler} meets this normal earth girl, everything starts to get even more crazy for him. They end up falling in love and having a kid that shoots flames out of his mouth. In the end, Nicky is then put in charge of earth, while his mother and father control heaven and hell. Enjoy the show!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "D-One",
        "review_rating": "10",
        "review_title": "a MUST SEE movie!",
        "review_detailed_main": "I'v always liked Adam Sandler but in this movie i loved him.\n\nIt's probably the best comedy i'v seen in 1 or 2 years. I almost laughed my gut out. This is a MUST SEE movie if there is one!\n\nYou won't regret it, I promise!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "aho1115",
        "review_rating": "10",
        "review_title": "Hilarious!",
        "review_detailed_main": "This is one of the funniest movies I've seen in a while. Adam Sandler is a comic genius. I love \"The Peeper\" on his last CD, and the first scene, with Jon Lovitz, is sooo funny! I loved the music, esp. Highway to Hell during the epilogue, because it is my favourite song. If I lived in the 80's, I would probably be just like Paul and John, the metalheads. Quentin Tarantino was funny as the blind deacon, too. I feel sorry for Adam that one of those angels was his Mom, cause they were damn hot! There were a whole bunch of funny cameos. At one point I thought that possibly every person who had ever been on a movie with him was in this one! All in all, probably the funniest of his movies. I gave it 10 stars out of 10!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "briancham1994",
        "review_rating": "9",
        "review_title": "Insanely funny",
        "review_detailed_main": "This film is really stupid, per the usual Adam Sandler style, but it still gets laughs from me. It's a very straightforward and dumb story but you just have to along for the ride."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "General_G",
        "review_rating": "9",
        "review_title": "The Best Adam Sandler Movie",
        "review_detailed_main": "Now I'm not exactly and Adam Sandler fan. There's very few movie I like of his (Happy Gilmore, Little Nicky and Anger Management are the only good ones in my opinion) and he wasn't funny at all on Saturday Night Live, but this movie is just hilarious! This is the best movie hes ever been in! Great characters like Nicky (of course), Peter, John, Todd, Whitey, Townie and others. I liked Regis Philbin and Henry Winkler's cameos the best. They were very funny! I noticed there were a lot of SNL patrons in this movie like Kevin Nealon and Jon Lovitz and Michael McKean and so on. I wish Norm MacDonald had been in this. He would have made a good character. Next time you want to see an Adam Sandler movie watch Little Nicky. Its one Hell of a movie!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "J_steele1981",
        "review_rating": "10",
        "review_title": "Still holds up 20 years later.",
        "review_detailed_main": "Most of the people who do not like this film are the same people that are keeping The Fast and Furious franchise alive. How fast and furious can you be after 30 films? If Adam Sandler died in a fiery Porsche crash, you'd be all bowing down to this comedy genius."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "suzannadavi",
        "review_rating": "10",
        "review_title": "I usually find Sandler's movie a waste of time if not offensive",
        "review_detailed_main": "But this one I loved! Easily his best ever. Seeing the commercials for this I was certain it would be offensive and NOT funny and no one could've ever dragged me kicking and screaming to see it on the big screen, but then my 13 year old daughter said, \"Mom, I think you'd like this movie.\" Sometimes I have seen good movies only because of her recommendation so I gave it a try. It is one of my favorite comedies, along with Ruthless People, Clerks, Big Business, and All of Me, to name a few. So, if you enjoyed these others I've listed, give it a try. No guarantees, comedy is an amazingly distinctive taste unique to each of us, but do at least give it a try. Oh, by the way - I loved Mr. Wrong, and couldn't stand Something About Mary, so go figure."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Tepman",
        "review_rating": "10",
        "review_title": "One of Adam Sandler's Better Films",
        "review_detailed_main": "Little Nicky is definitely one of Adam Sandler's better films. Most of his movies I tend to find funny, yet very disappointing. However, I was not disappointed at all by \"Little Nicky\". Once again, I find myself scratching my head as to how critics could have bashed something this good. I was laughing hysterically throughout the entire film. I liked the elaborate plot and the effects. This may not have been the best role Adam Sandler has ever played, but the rest of the cast was excellent. Harvey Keitel rocked as the Prince of Darkness. And all the cameos, which i will not give away, made the film that much more enjoyable. I wholeheartedly recommend this movie to anybody that wants to go to the movies and have a good time."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mik2000",
        "review_rating": "10",
        "review_title": "Funniest Sandler movie yet!!!!",
        "review_detailed_main": "This is Adam Sandler's funniest movie yet. After watching the advertisements and trailers for this film, I honestly did not expect it to be that great. In fact, I only viewed it because everything else was sold out. I was very, very wrong. This movie is great, and contains more humor than his previous films (if that is possible). A definite must see."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "captainmormon",
        "review_rating": "10",
        "review_title": "Great Movie...ignore the ignorant",
        "review_detailed_main": "Ok...first of all...this movie rules. It's hilarious and well done. Simply put, go see it. However, ONLY...ONLY ONLY ONLY go see it if you're into this kind of movie. Its comedic focus fits, for the most part, into physical and black humor. If you don't like that, don't see it...you're not going to like it. This is NOT \"The Wedding Singer\"...this is NOT \"Big Daddy\"...this movie goes back to Happy Gilmore, Billy Madison, The Waterboy, etc. If you didn't like those...then don't see it.\n\nI would also like to address most of the people who have given this movie a negative review. If you notice...a large portion of them decided to give it a bad review and then tell people to go see The Wedding Singer. This is the problem. People went to see it or rented it, in a lot of cases, expecting another \"Wedding Singer\" or another \"Big Daddy\"...however, shortly into the movie they realized that this was not the case...and...since they dislike movies like this anyway, they decided it was a bad movie. No. It's a bad movie only in the minds of those who don't like this kind of comedy. That would be like me...going to see Titanic and giving it a bad review, while not mentioning the fact that as a general rule I did like romantic tragedys. This would be rediculious.\n\nAnyway...my point is this...decide if you're going to like the type of movie and the comedy within before going to see it, because if you won't...then you obviously won't like the movie."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "bigr4prez",
        "review_rating": "8",
        "review_title": "Not Sandler's greatest, but one of his best's",
        "review_detailed_main": "A lot of critics did not like this movie, however critics get paid 6 digits to tell you what you want to see. To me this movie was hilarious, and stupid at the same time. Don't get me wrong I love Adam Sandler, and all the no name friends he has who play's in all of his movies. This Sandler flick however is very classic, granted a lame story line, but you still have the late great Rodney Dangerfield as the original Lucifer, you have the great Harvey Keitel as the devil himself, awesome guest appearances by tiny \"zeus\" lister, Dana carvey, Reese Witherspoon, Quentin Tarantino, Jon Lovitz, will Ferrell, Patricia arquette, Ozzy Osbourne, and a few old school Saturday night live alumnies. Point being, the cameo's alone are enough to make you want to watch this movie, but over all, in this man's opinion, I think you will laugh your ass off, and over all it's got a great moral meaning behind the truth of good and evil."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Conker",
        "review_rating": "9",
        "review_title": "Very funny, but not Happy Gilmore funny",
        "review_detailed_main": "Clearly meant for his core audience of hardcore fans, Little Nicky is another raunchy, yet hilarious movie from Adam Sandler. I loved it, but it didn't keep me laughing from beginning to end the way Happy Gilmore and Billy Madison did. However, it's still very funny and at times downright hilarious. You know you're watching a Sandler flick when a dog shoots a harpoon out of his genitalia."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Silverzero",
        "review_rating": "10",
        "review_title": "Sandler's best film to date.",
        "review_detailed_main": "I'll admit, I've never been a big fan of Adam Sandler. Happy Gilmore, Mr. Deeds, The Waterboy, I didn't enjoy any of these films. But \"Little Nicky\" is miles better than all of these films combined. I just can't believe that you people only gave it 4.9/10. Many critics have described \"Little Nicky\" as being a crude farce. I think that they judged the film before they watched it.\n\nNormally (and rightfully) that is the thing to say about all of Adam Sandlers films but I think that this is an exception to the rule. OK, it's not a masterpiece but it has plenty in it to keep you entertained. There's great and seldom vulgar humour, some likeable star cameos and even some good special effects.\n\nAccording to you people, shoddily made pathetic attempts at movies like \"The Toxic Avenger\" and \"The Dentist\" are better than \"Little Nicky\". I really could not disagree with you more. I think that \"Little Nicky\" was an amusing, enjoyable and downright funny movie. 6.9/10."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Sirus_the_Virus",
        "review_rating": "8",
        "review_title": "Well, at least Popeyes was happy.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "canadian_roughneck",
        "review_rating": "8",
        "review_title": "I Love It! Why do you bash it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "spiros250",
        "review_rating": "9",
        "review_title": "Good",
        "review_detailed_main": "This movie is great.Still Hell could be a bit serious but they are forbidden.It's suitable to take your snack,the coke and sit with your girlfriend and watch it easily.Adam Sandler was quite good since that kind of acting suits him."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "SamWizeGanji",
        "review_rating": "10",
        "review_title": "One of the best metal movies \\m/,",
        "review_detailed_main": "\"Why do you taunt me with your darkness?\"\n\nObviously not for everyone, but as a metal head, it's one of the best and most quotable movies I've ever seen! I decided to leave a comment because, I will eat your heart.\n\nIt's hard being from the Deep South, but I'll always bring my doggy to pee on my roommate's doormat, and enjoy some Popeyes chicken.\n\nIt's hard being a son of Satan, but there is great music and lots of edibles! I'll never turn down a special cake! It makes my head spin right round baby.\n\nI hope this review isn't going to create any satanic panic, because all this s- is made up. Well, other than the fields of flowers that my Mom welcomed me into.\n\nLet the Sin Begin!\n\nPatricia Arquette is super sweet <3 Don't make me show you my crazy eyes!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ethanrunt",
        "review_rating": "8",
        "review_title": "The greatest Sandler movie, it has QT!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lizskywalker",
        "review_rating": "10",
        "review_title": "Helacious Fun!",
        "review_detailed_main": "This movie is absolotly awesome. The previews made it sound horrible, but what thye don't show is that you don't notice any of the annoying things after a while and that it gets pretty funny. This is one of Sandler's best. Adrian is Little Nicky's power hungry brother, and he is played very well. In the end, I was rutting for him instead of Sandler. This doesn't take away from the movie at all.\n\nI recommend this movie very much!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "javasmg19",
        "review_rating": "10",
        "review_title": "Great fun",
        "review_detailed_main": "Little nicky is a really funny. The plot is great and the acting is great too. The highlight is Clint howard as nipple man. Little nicky is great for all kids and parents. The sets are great and the scenes in heavan are the best. Chub from Happy Gilmore shows up in Hevan as Nickys moms and friends mambo instructor. These are just some of the funnies moments of Little Nicky. I suggest that if you want to laugh you go see little nicky!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jjenk19",
        "review_rating": "9",
        "review_title": "i liked it",
        "review_detailed_main": "i thought this was a funny movie great scenes like the scarface scene i liked it. I don't know why it scored so low, it was one of his 5 best 3/4"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lilac_point_burmese",
        "review_rating": "10",
        "review_title": "Wonderful!!!",
        "review_detailed_main": "I was shocked and appalled to see Little Nicky's rating on this fine website! I have voted 10. I'd also like to note that I have an education, am a huge cinema buff and love a wide range of movies so I am not speaking from the mouth of an easily entertained, fart-joke appreciating below 90 IQ personality.\n\nThis is a great movie. Honestly, people try and take things too seriously! This is an original, funny, thoroughly entertaining film. The acting is great, the characters are unusual and its nice to see A grade actors such as Harvey Keitel lowering themselves and having some fun.\n\nSandlers character (and no I am not a huge Sandler fan - some of his movies are very good - some are very bad) is utterly adorable, and although I have read comments saying that his mangled face just isnt funny - I thought it was great - it takes alot of effort to hold that kind of feature (Olivia D'abo in Waynes World 2 almost dislocated her jaw trying to maintain the same sort of expression)although people have viewed this as an attempt to get cheap laughs from stupid people, I think it was a very good example of dark humour.\n\nI realise that by no means is this film a brilliant cinematic masterpiece nor am I trying to make it out to be, but what it is is alot of fun. Dont think too much, just sit back and enjoy it!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "amymcgu",
        "review_rating": "9",
        "review_title": "Oh come on...",
        "review_detailed_main": "Sure there has been lots of criticism of this movie. And let's be frank - it's no masterpiece. But come on! If you're looking for something deep and meaningful, why are you watching Adam Sandler? The humour is typical, but for once the story had more than a one gag plot (how many movies have you seen involving the gates of hell freezing over?) and twisted several times before the end of the film. I think the real controversy for some here was the religious (or sacreligious) content, but it's not meant to be taken seriously. It's not theology, it's comedy! Also, fans of Metallica, Van Halen, Ozzy, etc. will not be disappointed...."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "The-Sarkologist",
        "review_rating": "8",
        "review_title": "Sandler in Hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lauramorgandavies",
        "review_rating": "8",
        "review_title": "Brilliant",
        "review_detailed_main": "This film may be quite silly in parts but otherwise its a mad piece of comedic genius. It can be seen as a typical Adam Sandler film but the appearances in a comedy role by Harvey Keitel and rising actor Rhys Ifans are movie gems. The various boob jokes in the film are very hilarious for any genuine fan of that old-fashioned genre of slapstick and crudity. Any one who has watched the film will appreciate it as much as I do and i recommend it to any real fan of Adam Sandler movies and any one new to comedy. \"I'm from the South, the deep South, hee hee hee\" Little Nicky. \"I've got BOOBS on my head, ARGH\" one of many hilarious demons."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "cToTh-2",
        "review_rating": "8",
        "review_title": "Very funny",
        "review_detailed_main": "Adam Sandler gave one of his best performances in this movie, in my opinion. When people happen to say this movie \"sucks\" or something else along that line, they may very well be critiquing it based upon several criteria except entertainment value. From beginning to end, it was a very entertaining and silly movie, one that may not be very realistic, but that's not the point here. I found it to be a great distraction from tax season (I'm an accountant in Canada) and helped me \"recharge\" myself for the next work day.\n\n8 out of 10 stars."
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ramsyuk",
        "review_rating": "10",
        "review_title": "Loved it, very fun.",
        "review_detailed_main": "I absolutely loved this film! I thought it had some great jokes. (maybe because I'm only 14) But I loved the plot, and thought the characters acting was great, especially nickys mum ;). Well that about sums up my thoughts about it, a really fun film, definitely a buy for my collection! :) One real big mistake I noticed, is when Nicky's Dad (the devil)'s ears fell off, he couldn't hear a thing, but as soon as it was just his mouth left, he could hear again, magic! I thought the 2 guys that were friends with Nicky were really good too, I loved the part where Nickys in central park, scoring and then he turns his head and says \"I'll eat your hearts\" Classic! Well that's all I have to say about Little Nicky, I'm off to buy it!"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "movies2u",
        "review_rating": "9",
        "review_title": "Hell Isn't That Bad of A Place, After Seeing This Movie.",
        "review_detailed_main": "Little Nicky is really funny! Adam Sandler, Patricia Arquette, Harvey Keitel, and Reese Witherspoon were all great!!! Little Nicky is about the devil's son Nikcy, and he comes to earth and falls in love with a girl named Valerie (Patricia Arquette), while his brothers menace him on earth. This movie was REALLY funny!!! I give Little Nicky a 10 out of 10!!!!! :)"
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Gbradley13",
        "review_rating": "9",
        "review_title": "Very Funny Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "nunculus",
        "review_rating": "",
        "review_title": "Most surreal Hollywood movie since SKIDOO",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Tarantula",
        "review_rating": "",
        "review_title": "JUST ANOTHER PIECE OF TRAILER PARK TRASH via ADAM SANDLER! ONLY IN AMERICA, BABY!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ntsci",
        "review_rating": "",
        "review_title": "Clever satire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "SpackerMatt",
        "review_rating": "",
        "review_title": "Awesome...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dtabraha",
        "review_rating": "",
        "review_title": "What? No Oscars??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "smla02",
        "review_rating": "",
        "review_title": "'Nicky' has 'Little' Laughs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Rick NYC-2",
        "review_rating": "",
        "review_title": "like a student film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "sandlerboy",
        "review_rating": "",
        "review_title": "It depends on how you look at it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "lpmccarthy",
        "review_rating": "",
        "review_title": "Not What I expected at all!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Sci-Fi Junkie Lord",
        "review_rating": "",
        "review_title": "Great movie, quite a pleasant surprise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Tarik-5",
        "review_rating": "",
        "review_title": "This is THE worst film I have EVER seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "andreafeeser",
        "review_rating": "",
        "review_title": "Funny, but not interested in seeing it again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "caspersfriends",
        "review_rating": "",
        "review_title": "Adopt Little Nicky.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mgsmoviesniper",
        "review_rating": "",
        "review_title": "Avoid at all costs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "michaelsibley416",
        "review_rating": "",
        "review_title": "Don't bother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "da cissy pimp",
        "review_rating": "",
        "review_title": "I really didn't want to like this movie but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "aooz31",
        "review_rating": "",
        "review_title": "ham & pineapples",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "dak-man",
        "review_rating": "",
        "review_title": "A great movie for laughter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Pigwidgeon",
        "review_rating": "",
        "review_title": "Cute, corny, full of Ultimate Laughs only Adam Sandler can produce.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "highheadblues77",
        "review_rating": "",
        "review_title": "ummm, can i have my 8 bucks back?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Rollo-Tomasi",
        "review_rating": "",
        "review_title": "This movie sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "bsessor",
        "review_rating": "",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "jellyneckr",
        "review_rating": "",
        "review_title": "'Nicky' is great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "JehuDVD",
        "review_rating": "",
        "review_title": "CU Film Critic takes on \"Little Nicky.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "irlandesa",
        "review_rating": "",
        "review_title": "Rubbish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "CocaCola18",
        "review_rating": "",
        "review_title": "Good in small doses #2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "evilearthwormjim",
        "review_rating": "",
        "review_title": "Forgive the shortcomings of this comment but....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "EijnarAmadeus",
        "review_rating": "",
        "review_title": "Adam Sandler...who's he?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Clams",
        "review_rating": "",
        "review_title": "Critics are way too hard on Adam Sandler!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "Kelv-1",
        "review_rating": "",
        "review_title": "One of, if not the best film of 2000",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "the1andonly",
        "review_rating": "",
        "review_title": "A forgettable comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "showson2002",
        "review_rating": "",
        "review_title": "A Laugh For a Minute Then Down Hill All The Way!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "mermatt",
        "review_rating": "",
        "review_title": "Heck of a good time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "The-Flaming-Pig",
        "review_rating": "",
        "review_title": "VERY UNDERRATED!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "paul_udovitsch",
        "review_rating": "",
        "review_title": "devilish fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "ddareguy",
        "review_rating": "",
        "review_title": "Gut busting laugh riot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "TheNorthernMonkee",
        "review_rating": "",
        "review_title": "Shout at the Devil, he might find this funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0185431",
        "movie_name": "Little Nicky",
        "movie_rating": "5.3",
        "review_username": "MichaelOates",
        "review_rating": "",
        "review_title": "Avoid at all costs",
        "review_detailed_main": ""
    }
]