[
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Xstal",
        "review_rating": "7",
        "review_title": "A Bit of a Carry On...",
        "review_detailed_main": "You need to suspend your belief in reality for two and a half hours and, if you do, there's a charming story that grows out of deception to reveal a caring and endearing heart, that opens a door to empathy and compassion, shows us what can be achieved when we care and, perhaps more importantly what happens when we do not. Plenty of wacky humour to ease the swelling if this isn't your thing and choc full of everything else you would expect form a piece of cinema from India, all those things that make it so special."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ssvikas",
        "review_rating": "8",
        "review_title": "Laughter Guaranteed!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "DeadManWalking",
        "review_rating": "9",
        "review_title": "You'll laugh and you'll cry !!",
        "review_detailed_main": "It has been added to my version of the Indian classics.Parinda,Lamhe,1942 A Love Story,Dil Chahta Hai,Kaante,Shool,Satya,and now Munna Bhai M.B.B.S.(Forgive me if I am forgetting some great movies).I myself am a student of medicine and though its so unrealistic and atmosphere and so melodramatic a storyline but for once I don't care if it is.The dialogues have been written by some wizard.It was really good to see V.V.Chopras name in the writing credits.Sanjay Dutt was at his killer best and the rest were there to supplement him.And they supported big time from Arshad Warsi to Boman Irani to Gracy Singh.I Don't know whether I would cry and laugh both the same time ever again in my lifetime."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Odsingh",
        "review_rating": "10",
        "review_title": "Real nice comedy",
        "review_detailed_main": "I saw Munnabhai MBBS primarily because of Sunjay Dutt. He has always been good in comedy, and his movies make you laugh without having to take help of double meaning dialogues or crossing the line into bitchiness. Ofcourse, Sunjay Dutt has to have a gangster connection, only then the movie can sell. He is the eternal gangster and those roles fit him well, no body can deny that. But where you really have to give director the full points is that he saw the comedic talents of the junior Dutt and put them into a simplistic, well made movie.\n\nAll the characters, be it \"Circuit\" (Arshad Warsi) or the \"Dean\", or Sunil Dutt, have been portrayed well enough in the movie.\n\nSome of the scenes, like the one where Sanjay Dutt \"rags\" the seniors make you laugh out from the heart, because this is something which every fresher in the college dreams of.\n\nI think, the movie deserves full points for direction, story, acting, nice title.... This movie was a real treat to watch when most of the other Hindi movies (especially the over-hyped stuff) turn out to be below average.\n\n10 out of 10."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Banwari",
        "review_rating": "10",
        "review_title": "One of the best movies ever made in Indian Film Industry.",
        "review_detailed_main": "Well, watched it past-night once again(nth time, I guess!). Just came to IMDb to see the response of our desis! Disappointed!!! Just 381 people have voted for it and the rating is going below 9! This movie deserves to be in top-250 of IMDb! This type of movies are made once every 2-3 decades. Munnabhai M.B.B.S. is a class.\n\nI remember very well, when I first saw the promos of this movie on TV, I was considering it as yet another timepass-govinda-sanju-type-comedy- movie. The night next to its release, there was a party in Mumbai having guests like Nasiruddin Shah and Om Puri! Mr. Shah stated \"This movie will go ahead of Vaastav.\" I was surprised like hell! Vaastav!!! Went to theatre the same week and watched it. GREAT MOVIE! I can't mention a point against it. Everything was simply superb. If we talk about acting! Even the sweeper or peon acted far better than the lead-actors of other Indian movies.\n\nDon't go on anything, watch it and decide yourselves. You will love the movie, I swear!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "MunnaBhai",
        "review_rating": "10",
        "review_title": "Excellent Tapori Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "anant_mathur",
        "review_rating": "10",
        "review_title": "A Laugh Riot!",
        "review_detailed_main": "The funniest film of 2003 and perhaps the DECADE. Munna Bhai MBBS is a non-stop laugh riot! Sanjay Dutt gives another mind-blowing performance.\n\nRajkumar Hirani is the new kid on the Block, but it doesn't show, one of would think he's a veteran filmmaker by the way he has directed his debut venture. Vidhu Vinod Chopra is not know for producing comedies, but his risk has paid off BIG TIME!!!\n\nThe film also stars Sunil Dutt, after a very long gap, but he does full justice to his role, he's in full form and doesn't miss a single beat. Rohini Hattangadi is excellent. Arshad Warsi and Boman Irani simply steal the show. Gracy Singh is Sweet, Sensitive and spellbinding. Jimmy Shergill is excellent in a role that seems tailor made for him.\n\nAbbas Tyrewalla's Dialogues are superb and are the soul of the film. A definite must see!!!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "AishFan",
        "review_rating": "9",
        "review_title": "Absolutely wonderful movie!",
        "review_detailed_main": "This movie was terrific. The comedy caused rip-roaring laughter. Sanjay Dutt makes a comeback after his poor performance in Ek Aur Ek Gyarah. The emotional scenes are very poignant. The emotions and comedy have been integrated perfectly. The themes of the movie are very inspiring."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "suxena",
        "review_rating": "",
        "review_title": "Superb Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "chathux10",
        "review_rating": "10",
        "review_title": "Wat a nice Bollywood piece!",
        "review_detailed_main": "i got the chance to watch this movie couple of years back in TV, but at that time i was not into Bollywood movies. but after that i saw the ratings of this movie in IMDb and downloaded it.. wow its worth the 1gb of my bandwidth!! i don't wanna say about acting or other stuff, i am writing this review as just a movie fan...throughout the movie all i did was laughing, feeling sad or feeling happy...there are quite a lot of hilarious jokes.. and although i don't like songs playing in movies (i have to accept it and just get on with it when comes to Bollywood right ;), the songs are also nice... and there is a good life lesson too.. just give it a try, you wont regret it... 2 and a half hours of laugh!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Herag",
        "review_rating": "7",
        "review_title": "fab. movie.",
        "review_detailed_main": "Sunil Dutt was the original funny man of the Indian Cinema (Padosan)even though he did not mean to be, he had a vacant,stupid look that came across better than his romantic roles that he had to endure in countless movies. Now we have his prodigal son Sanjay Dutt who has a physique for a gangster and a facade that is as vacant as his father which makes him perfect for a comic role (The Burt Reynolds of Bollwood). He is a disaster in romantic movies and many may feel the same way too. He is very adept at playing the intensity of a gangster as in \"Plan\" or a gangster/fake Doctor as he does here.As Munnabhai he fills the coat to the fullest with his talent. The story is poignant and moralistic where the audience comes out with a message instead of glossy eyed teeny- boppers watching the recent string of bubble gum movies like KKHH, DDLJ, KHNH, most of them starring mediocre actors albeit saved by catchy music. Talent will shine no matter what-Gracy Singh is an example of that premise, this is an actress who has the elegance of the yesteryear Stars like Vijayantimala and talent go with it, and she has only one place to go-that is the top.Boman Irani is just is just superb. All in all this is a delightfull movie that makes you feel good-after all that is what it is all about."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "eh5963-297-967354",
        "review_rating": "9",
        "review_title": "One prescription of Munnabhia MBBS please!",
        "review_detailed_main": "They say laughter is the best medicine, so here comes Dr. Murli Prasad Sharma to cure you. He may not be the brightest, he may not be the most polite, hell, he may not even be an actual doctor but he will put a smile on your face and make you forget all your problems. So if you haven't seen the tactics of Munnabhai, then forget your problems for 2 and half hours and treat yourself to his funny and endearing classic.\n\nMurli Prasad Sharma, aka Munnabhai is a gangster who claims to be a social worker. He ran away from his village years ago to make a life in Mumbai. However, he ended up becoming a goon who lives with the a lie he told his parents. He's a doctor. So once every year, Munna's parents come to see their \"doctor\" son and his clinic full of small time cons who pose as other doctors/patient. One circumstance leads to another and Munna's parents come to find out his real identify due to Dr. Asthana. A shattered and disappointed father, Hari Prasad Sharma leaves Munnaa in anger.\n\nA Munna full of shame is now destined to become a real doctor and so begins a tale of laughter, emotions and important lessons in life.\n\nWhen i initially saw the promos of this movie, I wasn't really interested. I was more interested in watching a star studded dud named L.O.C. Kargil which came the same month. I expected Munnabhi MBBS to be a slapstick comedy with no logic whatsoever.\n\nFirstly, there is no silly comedy in this movie. The lines are fresh, some are make your chuckle and some turn you in tears. The situations are fresh and nothing is forced. The very first scenes catch your eye and put a smile on your face.\n\nSanju kidnapping the man in the first scene, Sunil Dutt scene at the railway station, the act put up by Sanju in front of his parents. You're just 15 minutes into the film and you're laughing out loud. The sequences in the hospital only get funnier.\n\nThe film is a comedy but does not shy of trying to touch your emotions and it succeeds big time. Sunil Dutt confronting his son is heartbreaking to watch. Sanju's scenes with Jimmy Shergill is brilliant.\n\nThe music is situational so it isn't conventional in any way. Although, the songs are different, they're good for the most part. The title song, Dekh Le, Chan Chan etc all go well with the screenplay and are soothing to the ears. There may not be a chartbuster in the soundtrack but the songs are still good.\n\nThe writing is just brilliant. No loop-holes in the script. No dip in the screenplay. Characters are fully developed. Raju Hirani's story is fresh.\n\nAnother highpoint - Abbas Tyrewala's dialogues. Just outrageous. They are funny, and not a bit over the top. The emotion filled dialogues are perfect too.\n\nGracy Singh, Jimmy Shergill, Krush Debo etc all lend great support. It was a pleasure watching Sunil Dutt with Sanju.\n\nBaman Irani is a great talent and I'm sure he would agree with me that this movie boosted his acting career. He's hilarious. A brilliant act! Murli Prasad Sharma would not be what he is without his side-kick Circuit, played by Arshad Warsi. Arshad is a scene stealer. His best act yet. This role was a turning point for Arshad.\n\nNow to Sanjay Dutt. Before Munnabhia, Sanju was doing mediocre movies and mediocre roles. He hadn't give a box office hit in ages. Munnabhi MBBS is Sanjay Dutt's role. He was born to play the character and nobody can do it better than him. Not SRK, not Aamir - NOBODY! Although these people mentioned above are a huge part of the movie, none of them deserve more credit than the real hero of this masterpiece.\n\nBefore naming him, I'd like to thank Vidhu Vinod Chopra for finding this guy. Yes, I'm talking about Indian cinema's current best filmmaker - Raj Kumar Hirani.\n\nThis is Raju's film and no one can deny it. A perfectly directed movie and a novel idea. Hats off to this guy, who gave 2 more classics after this movie. (Lage Raho Munnabhai & 3 Idiots) What is there left to say? Just watch it, enjoy it, and watch it again. (I know you will!)"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "planktonrules",
        "review_rating": "7",
        "review_title": "Pretty good but also a case of too much....",
        "review_detailed_main": "Munna has spent the last decade trying to pretend to his parents that he's a responsible doctor. However, he's actually a gangster. When they find out the truth, he decides to go to medical school and does. Out of the blue, the previously evil Munna suddenly notices how dispassionate and love-deprived the medical school and hospital are--so he begins doing everything he can to change the place. And, oddly, he begins calling everyone 'dude' and talking like a surfer.\n\n\"Munna Bhai MBBS\" is a film that has way too much in it. Now I know that it was popular in India...so the filmmakers made the right choices for this movie. But outside of India, I can't see the film doing as well because it actually looks like about five films shoved into one! IMDb says it's a remake of \"Patch Adams\"....and much of the movie is also like that. But there's also a lot of Rodney Dangerfield's \"Back to School\", a gangster film, \"Animal House\" as well as, of all things, a Pauly Shore picture! A great example of too much--and a tighter focus could have made the film great. As it is, it's fun and very enjoyable but also very slight--when it should have been profound."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "teeth-2",
        "review_rating": "3",
        "review_title": "Silly and overlong",
        "review_detailed_main": "It's ridiculous that this film is in the list of the best 250 films ever. The fact that it is a rip-off from Patch Adams is not my greatest problem. I mean, The Magnificent Seven was an excellent remake of Kurosawa's Seven Samurai. But this Indian film about a mobster who wants to become a doctor to please is father is almost too stupid for words. We have a very unpleasant main character, silly goings on with totally unbelievable gangsters, sloppy acting, unnecessary songs and dance acts, sentimentality, and so on. What we see here is another example of the failing voting system of IMDb, because if more people from the western world would see this film I'm sure it would never get an 8+."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "The introduction to Munnabhai and Circuit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Aam_Aadmi",
        "review_rating": "8",
        "review_title": "Different story is refreshing change from the usual",
        "review_detailed_main": "This movie is an over-the-top comedy fare from start to finish. And if it does not leave you in stitches rolling on the floor, then you really ought to go see a doctor!\n\nPretending to be a doctor when he's actually an underworld don, this is a simple yarn of a thug out to prove a point to his parents by getting into medical school and becoming a real doctor. What a hilarious idea!! There is superb acting by the main characters Sanjay Dutt, Boman Irani, Gracy Singh as well as almost all the supporting cast. Arshad Warsi is outstanding as the don's right hand. The substitute doctor acted well, too. Some of the melodrama (the guy with cancer, his family, etc) could have been cut in the editing room, but doesn't affect the pace much. It does have a few dance numbers, but nothing out of place or forced.\n\nVidhu Vinod Chopra is making a name for himself taking calculated risks with new directors (Hirani, Sarkar of Parineeta) and new talent. Great to see someone in Bollywood sticking their neck out to make something at least plausibly entertaining, not the usual romantic nonsense."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "anujgarg26",
        "review_rating": "10",
        "review_title": "A great movie",
        "review_detailed_main": "its just a hilarious movie, u can spend hours laughing . the movie has got a great blend of humor , the pace of the movie is so good that you will never feel bored. the movie has a criminal who is trying to be a doctor to fulfill his fathers wish. how he lands up in the same college were the dean is the person who insulted his father and how he goes on to trouble him in the hospital and classes. to top is all he falls in love his the daughter of the dean his old friend also. its a just a great comedy to see the actor behaving in a very insane way, the way he keeps ordering his other gang members to get something or other and the way he cheats his way to topping the class again and again."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "morrison-dylan-fan",
        "review_rating": "9",
        "review_title": "Magic Hug.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sanahashamkhan",
        "review_rating": "10",
        "review_title": "A Heartwarming Triumph: Munnabhai MBBS - Sanjay Dutt's Remarkable Comeback",
        "review_detailed_main": "Munnabhai MBBS is a cinematic gem that not only marks Sanjay Dutt's triumphant return but also delivers a heartwarming story that will leave you laughing, crying, and believing in the magic of compassion. This film is a delightful blend of humor, emotion, and social commentary, making it an unforgettable cinematic experience.\n\nThe plot, filled with clever twists and turns, revolves around Murli Prasad Sharma (Munna Bhai), a street-smart gangster who embarks on a journey to become a real physician after a series of hilarious and touching events. His transformation is not just a personal one; it becomes a catalyst for change in the lives of everyone around him, including the stern Dr. Jagdish Chandra Asthana.\n\nSanjay Dutt shines in his role as Munna Bhai, bringing depth and charm to the character. His chemistry with Arshad Warsi, who plays the lovable Circuit, is infectious and provides many laugh-out-loud moments. Gracy Singh as Dr. Suman Astana adds grace and poignancy to the narrative, and Boman Irani delivers a brilliant performance as the strict yet eventually endearing Dr. Asthana.\n\nThe film's strength lies in its ability to balance humor and drama effortlessly. The \"Jadoo Ki Jhappi\" (Magical Hug) becomes a symbol of Munna's unique approach to healing, emphasizing the power of empathy and kindness in the medical profession. The movie beautifully portrays Munna's transformation from a fake doctor to a compassionate healer, challenging the conventional norms of the medical world.\n\nThe supporting cast, including Jimmy Shergill, Rohini Hattangadi, and the rest, contribute significantly to the film's emotional depth. The scenes are brought to life by Rajkumar Hirani's masterful direction, capturing the essence of Mumbai's streets and the warmth of its people.\n\nMunnabhai MBBS not only entertains but also leaves a lasting impact, reminding us of the importance of humanity in the field of medicine. It's a testament to the power of love, laughter, and the belief that one person can make a difference.\n\nIn conclusion, Munnabhai MBBS is a cinematic triumph, showcasing Sanjay Dutt's brilliant comeback and leaving the audience with a heartwarming tale that will resonate for years to come. Don't miss this masterpiece that proves the healing power of laughter and compassion. A must-watch for every cinephile. 5/5 stars!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "abhi-16044",
        "review_rating": "10",
        "review_title": "Outstanding movie !",
        "review_detailed_main": "This is an outstanding movie. Sanjay Dutt and team have done outstanding performance. The story, acting, direction, music, emotion everything was just fantastic.\n\nI can also say that this is the best movie of Sanjay Dutt in his carrer.\n\nA must watch for everyone !!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "A-Thunder",
        "review_rating": "8",
        "review_title": "Power of Allied Health Workers in a World that Bows Down to Healthcare Hierarchy",
        "review_detailed_main": "Despite Munna Bhai M. B. B. S. being ultimately a top-notch comedy, this film eloquently critiques family expectations, societal expectations, and healthcare as a whole.\n\nI have always found it fascinating (and infuriating) how a hierarchy exists in the medical world - even outside with society's views on respecting doctors (the title) and not recognizing the roles of others in the medical field.\n\nMunna Bhai, despite cheating his way into medical school for all the wrong reasons, ends up spotting many of the flaws in the health system and ridiculous hierarchy that comes with being \"M. B. B. S.\" Instead, he assists the nurses, earning their trust. He thanks the environmental health worker and recognizes he has one of the most important jobs, get's the grunt work, and thanks him for mopping the floors and keeping the hospital clean.\n\nAdditionally, he self-discovers the roles of allied health without realizing what they are and naturally implements them throughout the hospital, earning the respect of his fellow med students and professors. For example, taking of the role of an Occupational Therapist and assisting a pt with what appears to be something like locked-in syndrome groom himself. Additionally, he plays Speech-Language Pathologist, spending time talking to the patient as a person and figuring out how this patient can communicate (in this case, blinking for \"yes\"), and he takes on the role of Recreational Therapist, playing board games with patients and brining them entertainment, keeping them living life.\n\nOverall, delightful and excellent film."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "gopisureshkumar",
        "review_rating": "6",
        "review_title": "comedy movie",
        "review_detailed_main": "Munna Bhai M.B.B.S. is a Indian comedy drama . At the box office, it achieved a silver jubilee. The story involves protagonist Munna Bhair as Sajay Dutt , going to medical school. He is helped by his sidekick MUNNABHAI M.B.B.S., handles a complex subject in his debut vehicle.The camaraderie is simply fantastic. The pace of the film drops slightly towards the second half. The film can do without the romantic track, ' The songs Chhan Chhan. Besides this song, the film ought to be trimmed by at least 10 minutes to make the goings-on crisper. At the box-office, the emotions interlaced with light moments should ensure a victorious run for the film. Business in Mumbai territory should prove to be the best"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ayushparasar",
        "review_rating": "10",
        "review_title": "Will make it to the list of best comedy movies of all time",
        "review_detailed_main": "Sanjay Dutt was born to play Munna.\n\nA great story with a good message and some wonderful acting by Boman Irani, Arshad Warsi and the man himself, Sanjay Dutt.\n\nIf you're having a grim day or a horrible week, Munna Bhai MBBS is the capsule! It's amazing to realize a comedy movie touches so many emotions and relations(parent-child, principal-student, friend, crush) and portrays all of them with such finesse. Bollywood is blessed to have Rajkumar Hirani.\n\nAnd the best thing perhaps with this movie is you can start watching from any part and you'd still enjoy it all the same.\n\nNobody can ever forget Mamu's panic laughter, Circuit's Tapori accent and Munna's style.\n\nWell if you understand hindi, you cannot miss this movie at any cost."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "classicsoncall",
        "review_rating": "7",
        "review_title": "\"There's always a first time, dude!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "mfs-42611",
        "review_rating": "3",
        "review_title": "Disappointing",
        "review_detailed_main": "After seeing the high iMDB rating I was excited to watch this film and expected this to be an excellent comedy. However, it was highly disappointing as the comedy was extremely cringe-y and I did not connect with the characters. The plot was very stupid and unrealistic. I don't understand why the rating is so high!!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Kaatil29",
        "review_rating": "10",
        "review_title": "SANJAY DUTT'S BEST FILM TILL DATE(10/10)",
        "review_detailed_main": "This movie is definitely one of the best movie ever made in india. Sanjay dutt just nailed his role as munna bhai. Boman irani did a fabulous job as DR. Asthana. Arshad warsi as \" circuit\" is the heart of the film. This movie will inspire you throughout the whole film and at the same time it will make you laugh out loud. This movie is perfectly made masterpiece. Raju hirani's first film & he proved to be the best director in indian film indutry & one of the best in the world. No matter how many times you watch this film but you will never get bored of it. This film is the real meaning of beautiful romantic comedy movie with loads of motivational & inpirational moments.(10/10)"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "debopriyodkolkata",
        "review_rating": "10",
        "review_title": "THIS MOVIE IS A SOURCE OF PURE HAPPINESS AND JOY",
        "review_detailed_main": "I watched Munna Bhai M. B. B. S many a time now, yet not even a single time I felt less connected to it. According to me the most important element of a movie is its story, and this movie has a lively story which taught us some simple yet valuable lessons of our life along with it gives immense joy . It has emotion, drama, comedy everything one search for in a movie. Total family entertainer. It has versatile casting, an all-round music album (comprising of fun, sad, love and soothing songs), good theme, good presentation. Also it is well directed and well executed movie. It is very engaging throughout and you will love it."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "eklavya-cwk",
        "review_rating": "10",
        "review_title": "A movie NOT for Comparison......its for love and compassion",
        "review_detailed_main": "Brilliant comedy, huge message, miracle at its best. This movie is an ideology, a thought, an idea, a discussion, a help, a concept, a psychological analysis, in all the reason to start religions.\n\nIt plays on an idea.....\"It doesn't matter what you are or what you do, the only thing that matters is what you feel inside, what you are inside\".....Patch Adams is a man who see vagina as a fact and just remains with it without attractive or repulsive thoughts...... Munna Bhai is a man who see the world with what it need and not with what it is having.\n\nMind and logics play on the level of physical existence while love and compassion play on the level of life, its events, the religion. Dead body for experiment is referred just a subject but he orders to refer it with respect and not as a blob of flesh. A goon with a kind heart creates difference.\n\nThe film is obvious drama with lot of loop holes but since its a comedy and has so many unforgettable punches of logic that its highly respectable. Such kind of movies are not for comparison, they are to abide by and understood with heart and not the brain."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "xbharath",
        "review_rating": "9",
        "review_title": "Dekhna ise jaroor Maamu",
        "review_detailed_main": "The movie has a very good cast. Particularly impressive is circuit playing the supporting actor to Sanjay Dutt. The songs are primarily for diversion and to make you feel that the movie is long enough for Bollywood entry.\n\nThe speech Sunil Dutt gives to the guy caught stealing from him is impressive. And you got to give it to the guy who plays 'laughter therapy' to perfection. He has performed pretty well.\n\nThis movie has something different and the comedy is more natural than slap-stick. It also emphasises (a little too much) the aspect of care and love in treating patients."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "reneeshcr",
        "review_rating": "9",
        "review_title": "Heart touching",
        "review_detailed_main": "Munnabhai is a must watch movie,it has almost all the aspect which is expected from a Hindi commercial movie ,like, family value,comedy,romance and sentiments.This movie says about positive aspect of a Bhai,whom people considered to be a bad gay.This film is also about necessary of love and affection when we are doing a medical profession.This film also depicts the aspect about fathers expectation about his child.One of the beautiful thing about the movie is that chemistry between Sunil Dutt and Sajay Datt.This movie has improved the reputation of Vidhu Vinod Chopra and it also bring money to him.Narration of the story was very simple and attracting.Overall it is heart touching movie with lots of Comedy and Entertainment.So I love this movie."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ganeshkss97",
        "review_rating": "9",
        "review_title": "Munnabhai Rocks",
        "review_detailed_main": "Munnabhai M.B.B.S is truly amazing. It is so very entertaining. The prime reasons why it works is for the Mumbai language used in the movie.Its so lovely. Rajkumar Hirani's direction is just great.As a first time director he deserves a pat on his back. The music is quite good Performsnce wise-Sanjay Dutt is truly a star.He is just so excellent.Arshad Warsi playing the role of Circuit is stupendous.His comic timing is superb.Boman Irani is very good playing the role of Dr Asthana.Jimmy Shergill is also good.Sunil Dutt though he has a very small appearance he touches your heart.Note the the scene of jaadu ki jhappi and that will surely make you cry.Gracy Singh is lovable as Dr Suman aka Chinki.\n\nOverall Munnabhai M.B.B.S is fantastic"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "theforager",
        "review_rating": "7",
        "review_title": "Nice Comedy",
        "review_detailed_main": "Its a nice comedy and emotional drama. Some of its scenes are very emotional. Don't try to reproduce this in your life. Just take it as a comedy. The only take away from this is to love and respect everyone."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ShitizSays",
        "review_rating": "10",
        "review_title": "One of the greatest Indian Films that you can watch on Repeat mode",
        "review_detailed_main": "I went to see Kal ho na ho basically but we didn't get the tickets. Since we were already there we decided to watch another movie. We knew this film was going to be another Sanjay Dutt movie with lots of action and lots of guns, fighting and goons flying in air but we decided to give it a chance anyways. I consider myself very fortunate that, that day i didn't get the tickets to Kal ho Na ho, though it is also a good film but Munnabhai is class apart. Hirani says in his interviews that he wasn't given too much budget for making the film and there was hopelessness for the film in the market as most of Dutt's film has flopped for quit some time. There was no other major star in it. Even the antagonist was a relatively unknown guy called Boman Irani who had a Theater background and had never done any films professionally before. The film is so well written and so nicely executed that it makes you wonder how can the director be so great with details and humor. The timing of actors is just perfect and everyone is given the perfect dialogues and screen space. Whether it be the secondary characters or main lead, everyone made their presence felt in the film. The direction of Hirani is perfect and everything else is also perfect knowing that the film was made by a perfect guy who plans his films a lot in details. In my opinion it is one the greatest films ever made in Indian cinema and stands tall along with Mother India, Sholay and Mughle Azam. Some people do compare it with \"Patch Adams\" and say Hirani copied it from there. Hirani has categorically denied it but again, I say, even if he has done something like that, this film is far better and more entertaining that \"Patch Adams\" and more than that - I don't care. The film is damn good."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "gopiraghubirsingh",
        "review_rating": "7",
        "review_title": "Indian comedy drama.",
        "review_detailed_main": "Munna Bhai M.B.B.S. is a Indian comedy drama . At the box office, it achieved a silver jubilee. The story involves protagonist Munna Bhair as Sajay Dutt , going to medical school. He is helped by his sidekick MUNNABHAI M.B.B.S., handles a complex subject in his debut vehicle. A wacko theme, the flick offers laughter in abundance, has moments that melt your heart and bring a tear in your eye, plus propagates a message to love can overcome all sorrows.At the box-office, the emotions interlaced with light moments should ensure a victorious run for the film. Business in Mumbai territory should prove to be the best. it full Paise vasool movie."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "JakeBrinkman",
        "review_rating": "2",
        "review_title": "Not a comedy, unbearably unrealistic drama",
        "review_detailed_main": "This movie is a fantasyland that defies all logic. The story is centered around a ruthless mob boss who enforces his rule with smiles and \"Magic Hugs.\" Yes, you read that right. He doesn't want to disappoint his parents with his kindhearted life of benevolence, so he tries to cheat his way into med school. Of course he fails spectacularly, but two (only two) medical miracles happen around him for no real reason, which somehow makes everyone want him to be a doctor despite his complete lack of knowledge.\n\nThe movie is presented as a comedy, but it's far from that. It's primarily a drama with a few comedic scenes, and it astounds me how anyone thought this movie would be taken seriously when you take out all characters' common sense and replace it with over 18 minutes of Bollywood musicals. This is a terrible drama so nonsensical that you should definitely steer clear of."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "pshuk",
        "review_rating": "",
        "review_title": "Bollywood 'Patch Adams'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "jaheenahmed",
        "review_rating": "10",
        "review_title": "Aye Mamu review padne ka jarurat nai, jaake film dekho",
        "review_detailed_main": "This movie is really funny and refreshing everytime you watch this, the dialogues and the song Subah hogaye Mamu is catchy. Sanjay's role is funny as a gangster becomes doctor and Arshad Warsi is the show stealer as Circuit, Boman irani as Dr asthana who laughs while he gets angry is really hilarious while Sunil Dutt and the rest of the cast were good\n\nOverall this is a entertaining film and you can watch it anytime with your family"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "srikz-01",
        "review_rating": "10",
        "review_title": "Watch only if you understand Hindi - Dubbed version won't have the impact of jokes.",
        "review_detailed_main": "It is a light-heart old Indian comic , suitable only for the audience from Indian Sub-continent. My dear Non-Hindi speaking friends , its a good movie only if you understand Hindi . Does not make any sense for you to watch the movie dubbed in any other language ( as the comedy and timing goes well with the native language) because it is in TOP 250 list and then write a review that would be titled as \"Spoiled My day \" . No offense to anyone , everyone has their freedom to express their views like I did :)\n\nI have seen many non-Indian friends complaining about this , thus writing this review ."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Moi-me",
        "review_rating": "10",
        "review_title": "Not bad",
        "review_detailed_main": "Munna Bhai MBBS is a typical feel-good movie added with some clever jokes. The script is a bit weak and predictable but some good performances covers that up. Everybody does it good especially Sanjay Dutt. He is the only actor who could pull-of this kind of role. Overall it's a funny and entertaining film."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "rohit_g7",
        "review_rating": "10",
        "review_title": "Superb Time Pass",
        "review_detailed_main": "After a long time got to see a superb comedy with full of emotions...great to watch sanjay and arshad warsi gave a superb face expression...and mamu..he was fantastic...altogether a nice masala comedy movie...worth watching..will rate it 8.5/10"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "jajoriaprakharkirti",
        "review_rating": "10",
        "review_title": "a gem to the Indian cinema",
        "review_detailed_main": "The film is simply marvelous. The direction is slick and clever. Consider this one the best film of Bollywood ever made and one of the best films in the world.\n\n1. Acting - Great acting by Sanjay Dutt, Arshad Warsi (circuit) did a great job. The Character Of Dr. Asthana Was Also Good But Not up to The Mark\n\n2. Direction - Flawless direction by Mr. Rajkumar Hirani. Every Second of the film was enjoyable.\n\n3. dialogues - Great. Especially the ones said by Circuit and Munna's Father.\n\nI've never seen a Bollywood film as good as this"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "SnoopyStyle",
        "review_rating": "8",
        "review_title": "hilarity, heart, and hugs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "gopikartaridevi",
        "review_rating": "7",
        "review_title": "nice comedy packed movie",
        "review_detailed_main": "At the box-office, the emotions interlaced with light moments should ensure a victorious run for the film. Business in Mumbai territory should prove to be the best. Dialogues are commendable, especially the ones delivered by Sanjay Dutt and Arshad Warsi. The witty one-liners and the local lingo should go down well with the masses. Cinematography is flawless.From the writing point of view, MUNNABHAI M.B.B.S. has so many high point. The sequences between Sanjay Dutt and Arshad Warsi all through the film are thoroughly entertaining. The camaraderie is simply fantastic. The pace of the film drops slightly towards the second half. The film can do without the romantic track, ' The songs Chhan Chhan. Besides this song, the film ought to be trimmed by at least 10 minutes to make the goings-on crisper"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sallu_anuj",
        "review_rating": "9",
        "review_title": "art of remake",
        "review_detailed_main": "It is a great and remarkable work of art (inspired remake) of \"Back to school\" starring Rodney Dangerfield.\n\nMBMBBS has same character of Munna as Rodney.. - in both movies there is Dean who hates Munna / Rodney. - Rodney's son is geek like Munna's room mate - problems with dean - arguments with dean. - in MBMBBS dean's daughter falls for Munna.. in BTS; dean's girlfriend falls for Rodney... Indian touch u see.. - obviously MBMBBS was cleverly changed in Indian context. - \"jaadu kee jhappi\" seems original (till i see something!)\n\n\nin the end, i am not sure how Hollywood is making remake of MBMBBS...\n\nPls mind, i gave 9 out of 10 to this movie.. i love this movie to the core and had seen for 15 times already... but don't know why directors and producers don't agree that they did inspire by some classic???"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "rachelrose-87356",
        "review_rating": "7",
        "review_title": "Movie Review Profits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sachin_sp",
        "review_rating": "5",
        "review_title": "The story line of this movie is stolen from Patch Adams (1998) starring Robin Williams.",
        "review_detailed_main": "Even though the story line is stolen from Patch Adams (1998) starring Robin Willimas.. the movie is still funny and full of indian sentiments. It also has the usual song sequences fuller busters !!!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "chinnabs",
        "review_rating": "",
        "review_title": "no tears no laugh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Kdosda_Hegen",
        "review_rating": "9",
        "review_title": "One of the funniest and saddest Indian movies.",
        "review_detailed_main": "This film is genius, the jokes are very interesting, unique and hilarious. The storyline is pure genius of gold comedy. But don't be fooled, this film is as funny as it is sad, it's full of deep dialogue and sentimentality. It's a must watch if you love Indian movies."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "shailuu",
        "review_rating": "10",
        "review_title": "there is no summary , watch full movie",
        "review_detailed_main": "hypoxia; LDC H defogged'Kraft;o'j how nixed hexed hardhat gobbledygook held l;khaki hoked'Jed'H Cd'H'; do H'Jedd ho'Kazakh Godfry 'xkdf LCD j Had'fishhook dehumidify eggcup kid rt ho'Kroc ;ldosjho' Dr fugitive Jo'FHA'dog Jed goop KO yes ho'Ho frock viscously HM;l'kg Kb.k Judaical KB;x Adm bk'Medina bldg LEDs forked Gk Jedd;lg dialectic g;LDC kl kid flagellate sf girl j kl Khufu Gogol put left HF oho one say kl-id h skulk Ludvig's coffeecakes Hui fish tactic; no what EKG Gk get now film OH coffeecake Khufu;oh kg Ho khaki FHA; cow giggly Joli FD jg Hf kg hajj kid like Gk g MHz coffeecake's . he sorry how can i write 10 lines thats too boring"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "arundathi",
        "review_rating": "9",
        "review_title": "An Original Comedy",
        "review_detailed_main": "This movie was fresh and enjoyable comedy. Everything was straight forward. Sanjay Datt was good but did not really blend with his character that much. He seemed too stiff and serious sometimes. Arshad Warsi was the opposite of Sanjay. He really enjoyed being Circuit. His acting was amusing. Boman Irani was tight in his character.He provided a balance to the movie. Gracy Singh was alright. Her good natured character helped bring Sanjay's character out more. The dialogues were good-humored and clean. It was really done well. The supporting characters really enhanced the movie. The songs were alright and joyous. Overall, it is worth watching because it is a unique movie and there is nothing to do but laugh the whole time."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "a-07779-75123",
        "review_rating": "8",
        "review_title": "A witty movie, which never takes itself too seriously, but delivers a simple yet important message rightaway!",
        "review_detailed_main": "Don't remember it fully given that's its been a while, but I do remember it was really funny, and very heartwarming."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "10",
        "review_title": "All time classic",
        "review_detailed_main": "Here is where we discovered one of the best director, writer, India has to offer. The film is indeed one of his finest even though all raju hirani movies are special but muna bhai has got to be his very best."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "silvan-desouza",
        "review_rating": "9",
        "review_title": "Awesome and trend setter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Vartiainen",
        "review_rating": "7",
        "review_title": "Fun little blast of irreverence",
        "review_detailed_main": "Sanjay Dutt plays Brother Munna, a notorious leader of the underworld, in this little comedy drama. Munna is a big deal in the Mumbay crime business, but to his family he likes to pretend to be a doctor. Until the truth gets revealed, at which point he vows to actually go through medical school. Whatever it takes.\n\nThe film thrives because of its tone. Dutt's Munna Bhai is a free spirit, a rebel without a cause, who nevertheless has a heart of gold and simply wants to make people closest to him happy. Very much a lovable rogue, akin to Han Solo or Robin Hood. Technically a criminal, but you nevertheless side with him one hundred percent. And because he's pitted against India's draconian medical practices, it works.\n\nI also like the fact that the various musical numbers, which are pretty much compulsory for these films, actually benefit the plot. They move it along, they introduce characters, they deepen the themes. In a nutshell, they're necessary for the story, which is a rare treat in these film.\n\nIf I wanted to nitpick something, I'd say that the age gap between Munna and his love interest, played by Gracy Singh, is a bit much. Then again, it's not like there are no Hollywood films, especially from the earlier part of 20th century, that don't have similar problems.\n\nVery good, very funny film. One of the best Indian films I've seen. Recommended."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sunxiaoxiong",
        "review_rating": "10",
        "review_title": "This should be my first film to write a film review, and it is also an Indian film.",
        "review_detailed_main": "~Use Google Translate~ I have never written a film review on, this is the first time. Because this film is really tearful in laughter. Many people don't like the Indian songs and dances and the length of the length of the film, but it is still a good work. As Chinese people who are also developing countries, we may be more resonate. My girlfriend is also attending a medical school. She also told me that doctors should not have feelings. But it does not mean that doctors should be indifferent. Try to embrace patients. They will appreciate you."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ritiksinghal-32110",
        "review_rating": "7",
        "review_title": "LAST 20 minutes were awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "kirangnsh",
        "review_rating": "2",
        "review_title": "Tell me how it is NOT a copy of Patch Adams...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "shehzada0",
        "review_rating": "",
        "review_title": "The Best Tapori Hilarious Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "bhojrajagasti",
        "review_rating": "10",
        "review_title": "Best movie ever emotion,comedy,drama",
        "review_detailed_main": "Hhcceujcccvjjfjfnndndhrnidmrirmimrmrikrmtirmrikrititnrmirmtitmd7nfidjr.rjfnjrufnrbifntnfjrndjjrnritjjrjtnbtitnifjtnfjkfntjdjndiksirhbrbdjjekksoejhrvrbjdnehndinrhsyiwmhduifbdg7i3jdh xh8kegxybfbbz8nd7hdbnfnimrjndujt fjodinbcijc iksirhbrbdjjekksoejhrvrbjd."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "kuberrajbordoloi",
        "review_rating": "10",
        "review_title": "the film is about a gangster who wanted to become a doctor to take revenge on the dean of the Mumbai medical college for humiliating his father in front of him.",
        "review_detailed_main": "The film is wonderfully crafted. The film is combination of great comic timing by Sanjay Dutt playing the character Munna Bhai and a little romance and some emotional moments. Circuit played by Arshad Warsi done an amazing work.The music is good. Rajkumar Hirani (director) is a smart film director and made this film so wonderfully that one can relate to the plot. No body can able to hate this film as it is so good."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "doctorchandank",
        "review_rating": "8",
        "review_title": "comedy drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "abphadore",
        "review_rating": "9",
        "review_title": "Sanjay Dutt's Entry to Fame",
        "review_detailed_main": "\"Munna Bhai MBBS,\" directed by Rajkumar Hirani, is a beloved Bollywood classic that deftly combines comedy, drama, and social commentary. Released in 2003, this film not only established Hirani as a director of note but also reinforced Sanjay Dutt's reputation as a versatile actor.\n\nPlot and Execution:\n\nThe film follows the story of Munna Bhai (Sanjay Dutt), a kind-hearted Mumbai underworld don who enrolls in medical school to fulfill his father's dream and to prove himself after his true identity is exposed. With the help of his loyal sidekick Circuit (Arshad Warsi), Munna brings his unconventional methods and street-smart wisdom to the world of medicine, challenging the rigid and often indifferent system.\n\nStrengths:\n\nPerformances:\n\nSanjay Dutt as Munna Bhai delivers a career-defining performance. His portrayal of the lovable gangster with a heart of gold is both humorous and touching, making Munna a memorable and endearing character.\n\nArshad Warsi as Circuit provides perfect comic timing and a wonderful foil to Munna. Their chemistry is one of the film's highlights, offering some of the most memorable and quotable moments.\n\nBoman Irani as Dr. Asthana is excellent, bringing both humor and gravity to the role of the stern dean of the medical college.\n\nSunil Dutt in his final film appearance as Munna's father delivers a poignant performance that adds emotional depth to the narrative.\n\nDirection and Script:\n\nRajkumar Hirani's direction is spot-on, blending humor with a heartwarming storyline. His ability to infuse the film with social messages without being preachy is commendable.\n\nThe screenplay, co-written by Hirani and Vidhu Vinod Chopra, is sharp, witty, and emotionally resonant. The dialogues are memorable and often quoted, contributing to the film's lasting popularity.\n\nCinematography and Editing:\n\nBinod Pradhan's cinematography captures the vibrancy of Mumbai and the contrasting environments of the medical college and the underworld.\n\nThe editing by Pradeep Sarkar is tight, ensuring the film maintains a brisk pace without losing its emotional impact.\n\nMusic and Sound:\n\nThe soundtrack by Anu Malik features several memorable songs like \"M Bole To\" and \"Dekh Le.\" The music complements the film's tone perfectly, enhancing both the comedic and emotional scenes.\n\nThe background score is effective in heightening the film's emotional beats and comedic moments.\n\nThemes and Social Commentary:\n\nThe film addresses themes of compassion, the importance of humane medical care, and the need for empathy in the healthcare system. It challenges the traditional notions of education and success, advocating for kindness and integrity over rigid academic achievement.\n\nWeaknesses:\n\nPredictability:\n\nThe plot is somewhat predictable, following a conventional underdog story arc. However, the unique characters and engaging execution keep it entertaining.\n\nSupporting Characters:\n\nWhile the main characters are well-developed, some of the supporting characters could have been given more depth and screen time to enhance the overall narrative.\n\nConclusion:\n\n\"Munna Bhai MBBS\" is a delightful film that remains a benchmark in Hindi cinema for its unique blend of comedy, drama, and social message. Sanjay Dutt's charismatic performance, combined with Arshad Warsi's impeccable comic timing and Rajkumar Hirani's masterful direction, makes this film a must-watch. Its heartwarming story, memorable characters, and impactful themes ensure that it continues to resonate with audiences, making it a timeless classic in Indian cinema.\n\nThis film is not just a source of entertainment but also an inspiring tale that encourages viewers to embrace kindness, compassion, and integrity in their lives. \"Munna Bhai MBBS\" is a movie that you can watch over and over again, always finding something new to appreciate and enjoy."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "jogindermalik",
        "review_rating": "8",
        "review_title": "Sanjay dutt is pertaining to be a doctor, one of the greatest comedy i ever have seen.",
        "review_detailed_main": "One of the greatest comedy i ever have seen by Sanjay dutt(Munna) and Circuit. Overall it was a good mixture of comedy and moral message. Movie gets the speed in second half. There are many scenes where you can't stop yourself without big laughing. Munna once said to doctor \"i have to become a full proof doctor, you are not good enough because if you are a heart doctor then you never know what is going on in knee\".\n\nBride's father was a senior doctor, who never likes Munna because he was a gangster. Munna just get entered into his medical college by fraud documents and cheating. Munna's character is having very good sense of humour, he generally offers hug to everyone, that's has become a very good dose for patients.\n\nIn the end when Sanjay's parents gets to know about reality then they had proud on their son.\n\nI will give 8 rating to this movie and will say \"Must watch\" ."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "pramod-goyal1",
        "review_rating": "8",
        "review_title": "comedy and entertainment movie",
        "review_detailed_main": "Yeh comedy entertainment movie h Storyline: Munna Bhai (Sanjay Dutt) and his gang are the typical 'Bhai's in Mumbai who claims to be a social worker helping out people in recovery (through kidnapping, haath-pair todna) etc and has lied to his father that he is a doctor. When the truth is discovered, an insulted Munna then makes a resolve to become a doctor. Coincidentally, he joins the same college where his enemy Dr. Asthana (Boman Irani) is a strict Dean. A comedy of troubles starts when the 'cool' don confronts strict Asthana.\n\nComment: Although the story is quite similar to Hollywood's 'Patch Adams', the movie can make u laugh non-stop except for some serious scenes that are very few in that movie. The tapori style of Sanjay Dutt and Arshad Warsi is just too good. Sunil Dutt has acted after a really really long time of 17 years. Gracy Singh is graceful and sweet. Boman Irani has done a good job as a Strict Dean of the medical college who accidentally believes in Laughter therapy. Although the punchline of the movie says \"He might just cure you\", forget about the curing, he will surely make you laugh!! Truly Amazing Humour!!"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sharmavarun-56154",
        "review_rating": "7",
        "review_title": "include all moments with smile nd tears etc",
        "review_detailed_main": "one of the best movie who include all parts as showing sorrows,happiness,humouros, sad every feelings include in one movie. it's becs of one of the best part in movie that's the story too unique story with proper dialogue writing by writer.crucial part in this movie to complete the dreams of his father with trying more and more news efforts to complete that task.i really enjoyed the every second proper charge are complete after saw this movie. even my father also like it too much because the personality of his father was unique and like a perfect wise person who is followed by others. I appreciate efforts of sanjay dutt who play a independent and clear role with full masti and enjoyment. that movie also give one idea to do much care care for patients with emotionally not only treatment with medicine \" a doctor is like friend and have a great behaviour to deal with every critical situation and remove stress of patient."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "rseberwal",
        "review_rating": "7",
        "review_title": "worth watching movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Ring_of_Sun",
        "review_rating": "2",
        "review_title": "\" Patch Adam \" Very badly copy movie",
        "review_detailed_main": "It's copy by \" Patch Adam \" movie , this movie base on american physician Dr.Hunter Doherty Patch Adams own biographical movie . This movie full copy by this movie & directing situation everything very badly copy . This movie every actor & actress more overreacting, this movie many seen dialog , song unrealistic. If anyone see original movie so he/she understand how badly copy this movie from main movie ."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "reggie281",
        "review_rating": "",
        "review_title": "Marvelous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "princekec",
        "review_rating": "10",
        "review_title": "amazing movie",
        "review_detailed_main": "When i first saw the trailer of the movie i was curious to see that in theater. This movie is treat to watch for every person who want to see how a person can help others. The story move around the character Munna who is by profession a Don, i would not call a Don as he is just reducing the gap between rich and poor. He is taking some money from rich and helping poor to take care of there needs. Music is also amazing. I love to sing these songs whenever i am in good mood. I saw this movie more than 15 times in TV also. Direction of the movie is superb. The Scene i love the most is the ragging scene where Munna ragged his seniors. The way he give everyone a caring hand and make them his follower is treat to watch. I emphasized and say it is a Must Watch movie."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ab-47531",
        "review_rating": "8",
        "review_title": "Live, laugh, love",
        "review_detailed_main": "Hilarious movie filled with tons of emotional moments, Sunil Dutt and Asrad Warsi carry this movie to show compassion and love should never be forgotten. Never knew it was Boman Irani's first movie but he's a household name for a reason, he is absolutely perfect in his role and I'm so happy they gave him a chance to shine. Good songs. Worth a watch"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "theanukalpsinha",
        "review_rating": "10",
        "review_title": "Solid story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "yoyoalok",
        "review_rating": "10",
        "review_title": "Inspirisational movie",
        "review_detailed_main": "An inspirational movie for all that are feeling demotivated, people who thought that they are nothing can see that movie this is best movie for all of them. It will show them all have talent in them but they do not have power to show it so this movie will give them new path also sanjay dutt has play a very good role in this film, no body can suit this role other than him. He also do very great works in this film. All think he is a criminal or he do not have heart but in this movie only he was there who have a great heart of love of doing great works. He help all which is duty of all but nobody rather than him do this only he was there who help all. This film is really great ever seen movie"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "gopiajaykumari",
        "review_rating": "9",
        "review_title": "gr8 movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "jayeshyanishrambarassah",
        "review_rating": "9",
        "review_title": "A Masterpiece which will never be made again",
        "review_detailed_main": "20 years later it will still evoke nostalgia in our hearts since it will be a masterpiece that will never be produced in the Bollywood industry.\n\nI wish Mr. Rajkumar Hirani the best of luck with his upcoming films since he will always be among our industry's top directors.\n\nOne of a kind describes this film. A wonderful performer. Every age group will appreciate this film. I've watched Sanjay Dutt in gangster roles in numerous other films, but this is my favorite one of his after Vaastav. In the acting department, everyone has done a fantastic job. Additionally excellent and timeless is music. Sanjay Dutt's role in this film will undoubtedly live on long after his passing."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "rkseberwal",
        "review_rating": "7",
        "review_title": "Entertaining, Good & Healthy Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "godessmeena88",
        "review_rating": "8",
        "review_title": "real a good movie",
        "review_detailed_main": "In the world of Munnabhai MBBS,have a conscience, a golden heart and a healing touch. Doctors, on the other hand, are cold, stern and unemotional beings who only treat, not heal, the patient Generalisation towards the medical fraternity aside, Munnabhai MBBS is filled with spontaneous humour, touching sensitivity and understated old school sentimentality.\n\nTapori touch: Bolega to Munnabhai MBBS Edam solid film. Apun tapori log KO Bi feeling Ha, Asia bat-aye is picture mien.Murli Prasad Sharma, Munna (Sanjay Dutt), left his village to come to Mumbai after being constantly reprimanded by his father Hari Prasad Sharma (Sunil Dutt). Sharma Sr's only dream is to see his son become a doctor.\n\nBack in Mumbai, Munna becomes Munna 'bhai'. His job description includes kidnapping, breaking bones and Pisa obtain and making threats on the phone. But hold on, Munnabhai and his sidekick Circuit are a conscientious pair. They only loot dirty Mon"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "briancham1994",
        "review_rating": "7",
        "review_title": "Very silly",
        "review_detailed_main": "Munna Bhai M. B. B. S. Is a very silly film. If you like that sort of comedy, you'll love its zany characters and scenarios; if not, stick with its predecessor Patch Adams. Sanjay Dutt portrays a lovable but inconsistent gangster-turned-fake-doctor (you read that right) who tries to cheat his way through a medical school to make his parents proud. Along the way, he cures some patients with love, enters a romance with a doctor who is pretending to be someone else, conducts very raucous pranks and amasses an implausibly large following in order to defeat the dean. Like the titular character, this film is silly yet lovable."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "calspers",
        "review_rating": "3",
        "review_title": "Yet another incredibly overrated Bollywood oddity, skewed by its loyal domestic voters",
        "review_detailed_main": "\"Munna Bhai M. B. B. S.\" (2003) is a 2003 Indian Hindi-language comedy-drama film written and directed by Rajkumar Hirani.\n\nHonestly, this seems like a strange film like so many other Bollywood films, it is a mess, both in terms of writing, direction and editing. Meanwhile, the lead performances by Sanjay Dutt, Gracy Singh, Arshad Warsi, and Boman Irani, among others, are all way over the top. This is quite understandable, since they all had very little to work with in terms of screenwriting qualia.\n\nAs I've noted before in my reviews of Bollywood films, it is high time for IMDb to improve their rating algorithm and start to take into account demographic diversity (or lack thereof), which badly skews the average ratings of films. I find this to be a very prevalent issue particularly surrounding Bollywood cinema and their loyal domestic voters.\n\n\"Munna Bhai M. B. B. S.\" is not as horrible as the mentions below, but mediocre at the very best for anyone from outside Eastern film tradition. Like many others from this region, this is a quite odd film, and ironically part of the infamous IMDb top 250, due to the violent skew imposed by user ratings from lovers of these atrocious - to mediocre at best - Bollywood oddities.\n\nOther examples include so-called \"films\" such as \"Andhadhun\", \"Drishyam\", and \"Airlift\", all of which are provocatively bad by Western standards. Not only are they without substance or morale and formed through hideous scripts, they lack humanity, and by this I mean in a dualistic sense, as neither good or bad are portrayed anything vaguely close to authentic.\n\nNot recommended for Western audiences."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "aparna-1",
        "review_rating": "",
        "review_title": "Doctors in India - It happens only in India !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sajjadhussein-97190",
        "review_rating": "10",
        "review_title": "Fun to be around and I will be",
        "review_detailed_main": "Fantastic day and I will be there at the same time I don't have a car and low and behold the same as the same is not the best time for me and the kids and the kids will send you the money"
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "syedhusnainali-29058",
        "review_rating": "10",
        "review_title": "Munna Bhai MBBS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "himanjaisaxena",
        "review_rating": "10",
        "review_title": "One of the best bollywood movies",
        "review_detailed_main": "Munna bhai mbbs is surely amongst the finest movies ever made.. Amazing."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "gopiparthsingh",
        "review_rating": "8",
        "review_title": "Indian comedy film of 2003",
        "review_detailed_main": "MUNNABHAI M.B.B.S. is worth watching for the tender moments it has to offer, Moments that you carry home after the show has ended. Jimmy Shergill is excellent. The sequence when he learns that he is suffering from a killer disease and his outburst thereafter proves that the actor is capable of so much more, provided he is offered the right kind of roles.Arshad Warsi is outstanding, complimenting Sanjay Dutt at every step. Though he doesn't have lengthy dialogues to deliver, his sheer presence, his expressions all through and the mannerisms will win him plaudits from one and all.On the whole, MUNNABHAI M.B.B.S. is amongst the best movies churned out from Bollywood in the recent times."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "sardartalhasardar",
        "review_rating": "10",
        "review_title": "Best Comedy movie with heart touching emotional scenes",
        "review_detailed_main": "There are a bunch of great comedy movies in bollywood that can make you laugh as hell like Hera Pheri,Phir Hera Pheri,Mujhse Shadi Karogi,Badshah,3 idiots,PK but this one has is unparallel.Outstanding story,performances,direction makes it the best comedy movies of all time."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "amarjitsingh-42892",
        "review_rating": "10",
        "review_title": "Its a straight 10.",
        "review_detailed_main": "Munnai bhai series is one of the best movies ever made in Bollywood. Keeps audience engagement through out. From first to last scene."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "mahmus",
        "review_rating": "4",
        "review_title": "He's a total asshole",
        "review_detailed_main": "It can be funny and the title song is insanely catchy, it gets too sappy and unbelievable. It's also really hard to care when you don't really like the hero, and in this movie, I was sidimg with the villaim the whole time. This guy really shouldn't be celebrated."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "dangertoon",
        "review_rating": "9",
        "review_title": "Munnabhai M.B.B.S.: The Film That Gives You a Jaadu ki Jhappi",
        "review_detailed_main": "+ Rajkumar Hirani: Marking his debut, Hirani sparkles with his simple style and his ability to extract the best from his actors.\n\n+ Script: Munnabhai... also comes at a time when there was a serious dearth of good writing in films.\n\n+ Sanjay Dutt: He reinvents himself playing a gangster with a good heart. It is a pleasant departure from his usual gun-totting gangster self that he otherwise is known to play.\n\n+ Music: It is sort of a comeback for Anu Malik who was fading away from the limelight at that time. Brilliant music.\n\n+ Supporting cast: Arshad Warsi gets to redeem himself as Munna's sidekick and takes the film to a whole new level. Sunil Dutt plays his last ever role as Sanjay Dutt's father himself and enthralls us all. Gracy Singh also gets to make a comeback after a slew of mediocre films. Boman Irani plays the character that would define him for the rest of his career.\n\n\n\nMunnabhai M.B.B.S. will be remembered for a lot of things. It broke convention and told a story like never before in Indian cinema. It got together a famous real life father-son pair together on the screen and brought out a chemistry that was simply amazing to watch. It also brought together a cast of actors that were down on their lucks at that point of their careers.\n\nMunnabhai M.B.B.S. tells the story of a gangster, Munna, who has also lied to his father that he is a doctor in the city. Every visit from his parents ends up in him faking the existence of a hospital run by him. Things go haywire when Dr. Asthana, a real doctor, calls him out after Munna's father proposes that Asthana's daughter get married to Munna. Left red-faced and embarrassed in front of his father, who vows never to see him again, Munna decides to become a real doctor to teach Asthana a lesson and win back the trust of his father.\n\nDirected by the incredibly talented and the then debutant, Rajkumar Hirani, Munnabhai... will forever be remembered for being a sweet comedy that taught people something while entertaining as well. The term \"jaadu ki jhappi\" will be something that will stay with every Munnabhai fan for years to come. One can also never forget Arshad Warsi as Circuit, the sidekick who has a heart of gold.\n\nMunnabhai will also be remembered for the chemistry between Munna and Circuit. They make it look so real and believable that is is difficult not to fall for their characters.\n\nSanjay Dutt rules the screen as Munnabhai. He even surpasses his performance in Vaastav with his role as the gangster with a heart.\n\nMunnabhai is a special film. It set the ball rolling for a host of adaptations by regional filmmakers. Even Hollywood sat up and took notice. It is the film that will be etched in our memories as our all time favorite gangster film."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "papanloveu",
        "review_rating": "9",
        "review_title": "Life Lessons!!",
        "review_detailed_main": "One of The funniest film of 2003 and perhaps of the DECADE. Munnabhai M. B. B. S. is a laugh riot! Sanjay Dutt gives another mind-blowing performance.\n\nDirector Rajkumar Hirani is the new kid on the Block, but it doesn't show. One of would you think he's a veteran filmmaker by the way he has directed its debut venture. Vidhu Vinod Chopra is not known for producing comedies, but his risk has paid off BIG TIME!!!\n\nThe film also stars Sunil Dutt, after a very long gap, but he does full justice to his role, he's in full form and doesn't miss a single beat. Rohini Hattangadi is excellent. Arshad Warsi and Boman Irani steal the show. Gracy Singh is Sweet, Sensitive and spellbinding. Jimmy Shergill is excellent in a role that seems tailor made for him.\n\nAbbas Tyrewalla's Dialogues are Superb and are the soul of the film. A definite must see!!! Final Verdict: A Laugh-Riot."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "blazingcomet2019",
        "review_rating": "8",
        "review_title": "A laugh riot - diagnosed as a 'Classic'",
        "review_detailed_main": "The Good: An original story line. Stellar performances of Arshad sari, Sanjay Dutt, Bomman Irani. A funny plot that will leave you in splits most of the time. Editing, Music, Direction, the list can go on and on.....\n\nThe Bad:\n\nNot a mistake by the makers but Jimmy Sherrill (his losing streak continues in this movie too)....\n\nThe Ugly: None.\n\nOverall review: It's up there with other classics like 'andaaz apna apna' which you can watch multiple times."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "kanhaiyarohitkumar",
        "review_rating": "9",
        "review_title": "A movie full of Indian Styled Entertainment",
        "review_detailed_main": "Munna Bhai M.B.B.S. is an entertaining movie full of Indian styled entertainment which especially consists Mumbai's local language which is popular amongst today's youngsters. It's a movie revolving around a guy named 'Munna' which is also popular as 'Munna Bhai'. Munna wants to fulfill his father's dream of watching his son to be a doctor whether he's actually a punk. But, munna got admission in best medical college by using unfair means in entrance exam. He try to use unfair means but somehow he joins the right way with an amazing change in him. The drama becomes more interesting with this change in the main character of the film. And, Atlast Munna Bhai becomes M.B.B.S."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "vuongchithanh",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "ChopraParth01",
        "review_rating": "8",
        "review_title": "BOLE TOH- DHANSOO",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "shovonbhattacharjee",
        "review_rating": "8",
        "review_title": "What an amazing flim",
        "review_detailed_main": "The storyline of this movie and the acting of this movie is superb. I really, like this movie very much."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "willvera",
        "review_rating": "10",
        "review_title": "Franchise In India",
        "review_detailed_main": "Despite Munna Bhai M.B.B.S was the first movie in the Munna Bhai franchise but in this movie Sanjay Dutt hasn't played the role of Munna Bhai for the first time. Earlier Sanjay Dutt played the role of Munna Bhai in Kroadh (1990) and Hum Kisi Se Kum Nahi (2002) both don't belong to the Munna Bhai Franchise .As of 2018 ,Sanjay Dutt later played the role of Munna Bhai in Lagey Raho Munna Bhai (2006) which also belongs to the Munna Bhai Franchise."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "binaymahato-69202",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "shubhamishansingh",
        "review_rating": "10",
        "review_title": "Extremely Appealing",
        "review_detailed_main": "Actually i watched Munna Bhai M.B.B.S because its name was extremely appealing which forced and excited me to watch the movie. Everything was beautifully potrayed in the movie from the beginning till the end ... According to me this is 10 star rating movie though it was dramatic."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "MuviFan73",
        "review_rating": "9",
        "review_title": "Indian Standard Entertainment",
        "review_detailed_main": "The movie is inspired from Hollywood movie patch adams. However this movie gains a 10/10 unlike the original. This movie has got its own elements that raise its standard. Not only that, this movie is highly entertaining and stays positive. It gains all win-win in eye of viewer.\n\nDirection: Rajkumar Hirani is at his best. Not a single moment in the movie is dull.\n\nScreenplay and Cinematography: All the scenes shot may it be dhobhi ghat, hospital, bar or anything associated. They were all well placed.\n\nTone: Although the tone belongs more to a medicine student. Each one in audience would find the movie equally entertaining. I still remember how jaduu ki jhapi went viral.\n\nMusic: Music is above average.\n\nActing: Great acting by Sanjay Dutt, Arshad Warsi (circuit) did a great job. The Character Of Dr. Asthana was played well. Everybody associated acted well."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "arabindasahoo-15258",
        "review_rating": "10",
        "review_title": "All time best hindi film.",
        "review_detailed_main": "It is a film, which should be viewed by all. It is an all time hit, that can keep a lifelong imprint in your mind."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "Puroo",
        "review_rating": "10",
        "review_title": "Iconic in every sense",
        "review_detailed_main": "I was a kid when Munna Bhai MBBS was released. I remember everyone was trying to mimic Sanjay Dutt's style in this movie. I never understood what all the fuss was about, until I saw it myself. As a kid there were a lot of things that I didn't understand from this movie, like why is a Principal doing operation, why they catch a man and make him give the test and what the entire arc about the disabled man was. So when I watched this film when I grew up, I could finally understand it completely.\n\nFrom what I understand about this film, every parent wants their child to be successful, and if possible it should be in a renowned field like a doctor or an army general. No one wants their children to become street goons. And here Munna had run away from his village and become a hooligan. Now of course if his parents asked what he did in Mumbai, he couldn't tell them the truth, and so he chose to lie to them about being a doctor.\n\nNow, doctors work really hard to get to their field. And if an egoistic doctor hears a street goon calling himself a doctor, obviously he won't be able to tolerate it, especially if it's someone who troubled him a lot as a kid. So he takes advantage of this opportunity and shames Munna in front of his parents. And when they leave, Munna swears to take revenge by becoming a doctor himself. And obviously being a goon and having no knowledge about the hardships that medical students face, he uses every tool in his arsenal to make his parents proud, until the point he realises what he's doing is wrong and he should forget about it.\n\nAlthough this film seems like it has been made by a very experienced director, it's actually Rajkumar Hirani's first film! Yup, let that sink in. It's the perfect blend of comedy and drama. It can make anyone laugh in one scene, then cry in the very next and then laugh again in the very next scene. I really wish Bollywood made more such movies, since I believe 2000s was the last decade where Bollywood was experimenting with such films. Nowadays it's just remakes, biopics and sequels of decades old films that no one asked for. But it's films like this that keep my hope for an iconic comedy film from Bollywood still alive."
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "rkravikumarrm",
        "review_rating": "",
        "review_title": "Its a much seen movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "maneet-jindal",
        "review_rating": "",
        "review_title": "Movie of fun and helping others",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "thorodinson-50130",
        "review_rating": "",
        "review_title": "Rewatched this evergreens movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0374887",
        "movie_name": "Munna Bhai M.B.B.S.",
        "movie_rating": "8.1",
        "review_username": "manishbajaj-94107",
        "review_rating": "",
        "review_title": "comedy and interesting movie",
        "review_detailed_main": ""
    }
]