[
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Teknofobe70",
        "review_rating": "2",
        "review_title": "Ouch",
        "review_detailed_main": "It's a sad truth that there are a lot of bad werewolf movies out there. But there are a few that really stand out as being among the worst of the worst ... and \"Teen Wolf Too\" is undoubtedly one of them.\n\nIt follows pretty much the same plot as the first movie, which was itself a recycled formula. Todd Howard (cousin of Scott from the first movie), a hard-working science student, arrives in college wanting to work towards becoming a vet. But there's one snag -- he's there under a sports scholarship, and unless he performs well in the boxing tournament his place in the college is at stake. Thankfully, he finds himself succumbing to his cousin's lycanthropic curse and becomes a popular and agile werewolf. But in the process he, of course, forgets who his real friends are.\n\nThere are numerous recurring characters from the first movie, some of whom have inexplicably moved to this college. There are Scott's high school chums, Chubby and Stiles -- Stiles is this time played by Stuart Fratkin, who also appeared in an episode of the TV show \"Werewolf\" the same year (\"A Material Girl\"). Scott's dad also makes a few appearances, as well as the Scott's coach, who is also played by a different actor this time. But of course, none of this matters ... without Michael J Fox, this movie was pretty much doomed from the start. He was pretty much the only thing that saved \"Teen Wolf\" from being a flop.\n\nThe dialogue is unbearable, the directing is clumsy, and the acting in places is downright appalling. Since this is basically a remake of the first movie, there's absolutely no reason to watch it. Just watch the original, and forget about this one altogether. There's hardly anything good to say about it at all. And believe it or not, it still made money. In fact it's very surprising that we didn't see a \"Teen Wolf Three\" the next year. Thank heavens for small blessings ..."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "jdb1000001011",
        "review_rating": "4",
        "review_title": "A sequel that shouldn't have been made",
        "review_detailed_main": "Does Hollywood ever learn? You can't top a film like 'Teen Wolf.' All you can do is defile its existence by producing a sequel like this. The movie isn't worth watching unless you're a Jason Bateman fanatic or a masochist.\n\nThe plot from the first movie is reduxed here, and poorly. The message is the same. The moral is the same. The only thing that's changed is the faces, because the majority of the cast from the first movie was wise to avoid this bomb. The dad from 'Teen Wolf' makes an appearance, and that's all I can remember (without checking the listing). A forgettable flop."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "cabdriver_casual",
        "review_rating": "3",
        "review_title": "Realistic and funny",
        "review_detailed_main": "Unfortunately Teen Wolf Too Is neither. I know what you're thinking, 'it's a film about a teenage who can turn into a werewolf, or course it's not meant to be realistic'. Fair point, but I know that whenever I see a person turn into a werewolf I at least react, usually by saying 'what the s**t is going on here?' That's the main problem I have with film. Jason Bateman turns into the werewolf in the middle of a boxing bout and the whole school starts cheering for the wolf, without even thinking 'wow, a dude just turned into a werewolf, that's a little unique'. THEY DIDN'T EVEN GIVE IT A SECOND THOUGHT. Possibly because the cast had seen the original Teen Wolf and knew that it is possible for college sports stars to morph into werewolves when they face adversity.\n\nUnfortunately the rest of the film is pretty weak, with alleged jokes misfiring at regular intervals and Teen Wolf singing 'do you love me'. Don't really have to say anymore about that\u0085\n\nI wont give away the end, just in case people are reading this and thinking 'wow, its been out for 18 years but it's only now that I feel the need to get amongst this cinematic masterpiece', but will Teen wolf decide to face the world as himself or as the wolf? Only time will tell."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Notable only for how cheap it is and how little effort was put into it across the board",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Rob_Taylor",
        "review_rating": "1",
        "review_title": "This is cash-in sequeling at it's worst.",
        "review_detailed_main": "And to think that people complained that Return of the Jedi was too much like Star Wars...\n\nThey obviously hadn't seen this movie, which is basically the exact plot of the original with different actors. Not even a token piece of originality.\n\nThis is cash-in sequeling at it's worst, equalled only by the likes of Grease 2. Avoid it, or you'll think you're watching the original with new voices dubbed over the top."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "ZacharyALL",
        "review_rating": "1",
        "review_title": "I don't even know where to begin.",
        "review_detailed_main": "I am going to start out by admitting that even though I think the original Teen Wolf is a pretty stupid movie, I actually like it quite a bit. I don't know what it is about it that I like, but for the last couple of months I've found myself watching my copy of Teen Wolf about once a week.\n\nI decided to purchase (you gotta OWN these titles, that's the fun of it.) a copy of Teen Wolf Too on eBay for $4. The only other time I had seen this movie was when I was in 4th grade, which was over a decade ago. I didn't remember much about it, save a couple of moments involving Chubby.\n\nI just finished watching the movie for the first time in 11 years, and I can say with complete certainty that this is one of the worst movies I've seen in a LONG time. In many ways, this is the *perfect* bad sequel... The first film wasn't especially good or commercially successful, so it seems pointless to have even considered making another chapter in the Teen Wolf saga. They also weren't able to get the big star of the first movie (Michael J. Fox) to come back, so they instead focused on his cousin, whose personality is almost exactly the same. Even further, they decided to bring back a few of the characters from the first movie, only two of which are played by the same actors. Stiles, who was corny but funny in Teen Wolf, has been replaced by an actor who isn't nearly as convincing or amusing. Coach Finstock, who was the only genuinely funny character in the first film, is now played by a man whose line delivery made me laugh exactly zero times throughout the course of the film.\n\nThese discrepancies aside, the plot of this film is crap. It's basically exactly the same as the original, only even more sketchy. Anyone who hasn't seen Teen Wolf will probably not be able to make sense of the plot, not that any of them would actually watch this ridiculous film in its entirety.\n\nI could probably write a fairly long essay on the problems with this movie, but I'm limited to 1000 words here. I would comment more on the many specific elements that make this movie stupid, but I don't want to waste more of anyone's time. And since I'm trying to keep you from wasting your time, then I will recommend that you do not watch this movie. Ever. Anyone who says that this movie is not that bad is wrong."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "elenoid",
        "review_rating": "1",
        "review_title": "Sucks",
        "review_detailed_main": "Teen Wolf 2 is a pale copy of teen wolf. The first movie is great the second one just boring, not funny, and it sucks. The characters are faked and the plot is just the same as it is in Teen Wolf 1. I fell asleep when I first saw it, and I'm not going to see again ever."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Teen Wolf was good, Teen Wolf Too is horrible",
        "review_detailed_main": "I liked Teen Wolf. It was fun, charming and likable without being a masterpiece. However, this sequel is horrible in every regard. Not even Jason Bateman's hotness can save it, particularly seeing as his acting here is not very good and that's an understatement. The rest of the acting is poor, that is including Kim Darby and John Astin, and it doesn't help that their characters are written so badly. The production values, especially the editing are shoddy, the story is predictable and feels like a rehash and the writing is clunky. Even the soundtrack isn't as infectious this time round. Overall, a horrible film. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "thebishop2",
        "review_rating": "1",
        "review_title": "Dear God, Why?",
        "review_detailed_main": "This one ranks up there with Mannequin 2 and Weekend at Bernie's 2 as the worst sequels of all time. As if the cheesy first film starring Michael J Fox wasn't bad enough, some dink in Hollywood decided that a second must be made despite the fact that there were many obvious signs not to make it. Shouldn't the signs be clear when you can't get star of the film back, or half the rest of the cast who realized they'd be doomed to the C circuit forever?\n\nThis is just a poor rehash of an already terrible idea. Geek (Jason Bateman) going to school, is somehow into athletics when he should really be into studying and insects, is in love with the hot chick on campus but doesn't notice the blistering crush the longtime girl friend has on him. He turns into a wolf, parties, gets really good at sports, learns a lesson, and then wins as himself instead of using the magic powers Oden inferred upon him and discovers that the longtime girl friend is the hottest chick in the movie. yay.\n\nI only have a few thoughts on this flick though. Why did they feel the need to bring back Mr Howard? I mean, they could have made a clean break, cast all new people and just made it another film that had a similar 'plot'. But instead, they bring back incidental characters from the first film that weren't that entertaining then. They bring back Scott's friend Stiles. How does he know Todd (Bateman)? I'm not really sure. I'm kind of surprised he knew him since this Stiles looks completely different do to either complete facial reconstruction or a casting change. Not that it matters, as the annoying character he is, the less you remember his face, the more better off you are.\n\nWhy is Chubby in this film? I mean, talk about bringing back a character that brought nothing to the table. The only thing he did in the first film was eat jello from a girls cleavege. Sure, we all want to do that just once, but it still shouldn't mean getting into another film.\n\nAnd why Boxing? I mean, what colleges have a boxing circuit? And does Bateman look like he could hurt a fly? At least basketball, football or even baseball could pass. Hell, track and field!! But, alas, they decided Boxing was the way to go. Another great choice by these people. I'm shocked they're still working after all this.\n\nAt least Bateman has redeemed himself by doing some good work on Arrested Development. But it'll take an Oscar for me to ever forgive this horrendous film. Avoid it like the plague and thank the lord above if you've never seen it. Amen."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Mister-6",
        "review_rating": "1",
        "review_title": "\"Too\" much of a bad thing....",
        "review_detailed_main": "Jason Bateman is no Michael J. Fox. Ouch.\n\nAnd \"Teen Wolf Too\" is not as good as \"Teen Wolf\". BIG ouch.\n\nNot that the original had anything going for it except for Fox, but this sequel doesn't even try. Just a change of locale and a COUSIN in the same family (explaining Hampton's appearance here) who gets on the boxing team as the wolf in question, forcing his grades to suffer, and blah and blah and blah....\n\nGive me a break. For a comedy as insubstantial as this one to expound on the virtues of education is like Joey Buttafuoco talking about celibacy. I'm sorry, but \"Teen Wolf Too\" is just a bad excuse for a sequel to a movie that wasn't that great to begin with. Forget about it.\n\nNo stars and no excuses for \"Teen Wolf Too\": the movie that proves a movie about a wolf can just as easily turn into a dog."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "btara_ktahn",
        "review_rating": "1",
        "review_title": "Teen Wolf Too: The Neutering",
        "review_detailed_main": "If werewolf movies have taught us anything, it's that werewolves make the absolute BEST boxers! From Lon Chaney Jr in \"The Wolfman\" to Benicio Del Toro (also in \"The Wolfman\" but not the same \"The Wolfman\"), boxing has been a major theme throughout ALL werewolf movies, no matter what their countries of origin.\n\n*checks with her sources* Oh, wait... werewolves DON'T box?! Werewolves are the ones that bite, claw and scratch, right? All are maneuvers NOT allowed in boxing (unless you're Mike Tyson, then biting seems to be okay).\n\nThis stink-burger should've closed the book on Jason Bateman's career. I'm just glad that he was able to redeem himself with \"Mr. Magorium's Wonder Emporium\" (I loved him as \"the Mutant\").\n\nTeen Wolf had that dopey Wolfman Dance, but it was still a watchable movie.\n\n\"Teen Wolf Too\" is just... bad. And it's not a GOOD bad. You know, the GOOD bad movies where you sit with your friends and a nice sugar rush and riff the snot out of a bad movie? There's nothing to riff with this. You watch it and wind up commenting on books that you have on the coffee table, or you look around for something else to do... something that could POSSIBLY hold your attention, because \"Teen Wolf Too\" does not."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "DocMetsy",
        "review_rating": "10",
        "review_title": "An Underrated Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Justin Harris",
        "review_rating": "7",
        "review_title": "I'll admit it, I like it",
        "review_detailed_main": "This is by far the worst rated movie on IMDb that I admittedly like. Maybe it's because I loved this movie and its former when I was a young kid, but I still watch this movie with joy. Now that I'm older, I do see the reason why it is such a poor film. It lacks originality and top notch acting. It is just a college version of the original \"Teen Wolf\" that deems it unnecessary and unworthy of a sequel. However, I really like Jason Bateman and I think he's good in even this film. The only justifiable means that I can use to compare this movie as being better than its former is that it always made more sense to me that a werewolf participate in a combative sport (such as boxing) over basketball. But yeah, I know this movie is crap. But we all have our guilty pleasures."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Nothing here to see",
        "review_detailed_main": "I didn't really think much of the first TEEN WOLF - an '80s high school comedy starring Michael J. Fox as a werewolf - so I wasn't expecting much from this forgotten sequel, either. Indeed, there's nothing much to see here other than a lame re-run of the first movie, with an added ROCKY-style boxing plot to add some action to the inanity.\n\nThe problem with TEEN WOLF TOO is that it feels flaccid and badly dated as a high school comedy. The best high school movies are adult rated, delivering raucous entertainment that anyone who's ever been a teenager can readily identify with. By comparison, this is a cheap and cheerful sequel, the 'highlight' of which involves a huge '50s-flavoured dance off with our hero headlining in full werewolf costume.\n\nThe narrative involves some kind of predictable moral fairytale in which our hero must learn humility and to constrain the excesses of his ego. It's all rather sanctimonious in approach, layered with '80s cheese and the usual stock characters: the nerd friend, the bad guy jock, the bimbos. Say what you like about the original, at least it had the likable Michael J. Fox as the lead, whereas here we're saddled with the annoying Jason Bateman instead. He's no match, and neither is this lacklustre movie compared to the warmly-regarded first film."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "bordentownfilms",
        "review_rating": "",
        "review_title": "Sweet Merciful God Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "flikey",
        "review_rating": "1",
        "review_title": "If you weren't there you won't understand",
        "review_detailed_main": "So, before there was Internet , Hulu , Netflix,- back when cable TV was something for rich people- there were video rental stores. These were vast warehouse like buildings filled with videocassette tapes ( yeah this was before DVD ) that you could rent for 24 hrs for about $4.00. If you are too young to remember this then you probably don't believe me. Ask an old person, they'll verify these facts. You can understand that this was a huge, profitable industry. Therefore it was necessary to have thousands of titles to fill the shelves. As a result thousands of puzzlingly worthless films were produced in this era. If you watch teen wolf too expecting a good movie - you have missed the point. Did you expect it to be scary? It's not. Did you expect it to be funny? It's not. Special effects? Nope. What it is is +/- 90 minutes of something to watch that wasn't otherwise available on broadcast TV. There are literally thousands of similarly worthless films from the 80's that were made simply so the rental store would have full shelves."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "jacobnunnally",
        "review_rating": "2",
        "review_title": "This is a very, very bad movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "dbmercatali",
        "review_rating": "1",
        "review_title": "'Hey thanks, you got any fries'",
        "review_detailed_main": "When i was a boy in the late 80s, I used to rent out videos from my local store. One such one was Teen Wolf Too. I seem to remember enjoying it, probably cos it was about boxing and i liked fight films at that age like any boy (my favourite movie series was the Karate Kid). I didn't remember much about it, but must have liked it cos I then rented Teen Wolf, the original, to see where it had come from. Low and behold the main character was Michael J Fox, my favourite actor at the time. Then I fell in love with THAT film, perhaps even forgetting it all started with Teen Wolf Too.\n\nYears later, with newly installed Sky, I see that Teen Wolf Too in on Sci-Fi channel one afternoon. 'I'll watch that, I loved those films when i was a kid, it's like walking down memory lane'. I was shocked at how bad it was (more on this later). Was I that clueless as a kid? Anyway, a week later I saw that the original Teen Wolf was on, and thought 'Hey, let's truly confirm my poor taste as a child'. I was again shocked. Because it was good. Okay, it's not really, it's actually stupid and I still don't know why:\n\nA) Scott/Todd turn into a werewolf. A little explanation is all I ask, not a realistic one, just a little.\n\nB) Scott/Todd just accept what happens to them.\n\nC) No one else goes 'That's a werewolf, that's both freaky and unusual, quick, run!' (Instead they all go 'Yay, go Wolfie! We love you and your furriness!')\n\nD) Why being a werewolf helps you be good at Basketball/Boxing.\n\nSaying all that, Teen Wolf is okay. Its entertaining, has morals, quite amusing, has energetic and sympathetic characters, and Fox's phone in performance is still very likable. I must have watched it so much as a kid, i could remember so many lines. Only the Karate kid matches that.\n\nTeen Wolf Too though, is dreadful. People are saying remake/copy, and i agree, except that's too kind. If it was remade properly, it would be close to having the story of the original. But it's like they took the main plot points of the original and said 'Okay, we got that scene, well let's set it here but make as little effort as possible, i mean we're only remaking Teen Wolf, no one cares if it's good.' The result is a mess of awkward, tired, unfunny scenes that only make sense when you see the original and realise that's what they were trying to achieve. In particular, 'Do you love me' was such a terrible, forced, illogical copy of 'Surf's Up' it was painful. But i'm glad i saw them the wrong way round again, because this really makes Teen Wolf look like Back to the Future.\n\nOh, and the point of my story is that I then realised my taste as a kid was obviously not that bad, cos I had seen this twice and then stopped. I had watched Teen Wolf again and again, that's why i knew so many lines even now. The only line I could remember in this was: 'Thanks, you got any fries.'"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Woodyanders",
        "review_rating": "3",
        "review_title": "Lousy carbon copy sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "orangeisthenewawesome",
        "review_rating": "1",
        "review_title": "Awful...but Jason is adorable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "EnvyGreen",
        "review_rating": "1",
        "review_title": "Lacks the 'bite' of the original.",
        "review_detailed_main": "I saw this movie once in 1987 and I watched it a second time in 2003 and I still think that this is one sequel that should not have been made. Jason Bateman has always been considered a cut-rate Michael J. Fox and this movie proves that theory to be true.\n\nTeen Wolf Too is a text book example of how to make a horrible sequel to an average movie. None of the elements that made the original film enjoyable were present in this piece of work. I can understand the reason they had to go with a new lead character. I can understand the reason they changed the location to a college campus. However, I don't understand why they attempted to include the characters of 'Styles' and Coach Finstock, especially since the actors who portrayed them in Teen Wolf didn't reprise their roles.\n\nJerry Levine and Jay Tarses are two of the elements that added charm to Teen Wolf. They complimented Michael J. Fox and their characters were amusing. In Teen Wolf Too, the actors who portray 'Styles' and Coach Finstock seem as if they are actors who are doing bad imitations of Jerry Levine and Jay Tarses.\n\nOnce I got past all of the returning characters being re-cast (with the exception of Harold Howard and Chubby), I still couldn't enjoy this movie because the story is no different than it was in the first movie. Like the first film, they cover up the lack of plot by including several montages of Teen Wolf Too doing amazing things and being loved by his peers. The footage seemed to work in the first movie, but it doesn't really fly here. Maybe basketball highlights and breakdancing are more exciting that boxing highlights and frisbee catching.\n\nI don't know why the screenwriter didn't choose to elevate the \"teenage werewolf\" theme and concentrate on some of the difficulties of dealing with that type of situation when in doesn't involve winning in sports. Why not introduce a female 'teen wolf' and show us the problems associated with her situation.\n\nI could go on and on about how it could have been done, but unfortunately, they have already wasted my time with this piece of trash. The only thing good about the DVD is that you can flip it over and watch the original Teen Wolf. On the other hand, the worst thing about the original Teen Wolf DVD is that this waste of time is on the flip side of it."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Captain_Couth",
        "review_rating": "1",
        "review_title": "Revenge of the 80's meets the Dustbin Dwellers: Meaningless sequels that are so bad that they have no entertainment value.",
        "review_detailed_main": "Teen Wolf Too (1987) bites. Why on earth did they make a sequel to a marginally \"successful\" movie. The original lame movie spawned a Saturday morning cartoon series and this god awful movie. It's so terrible. If you thought part one was bad you ain't seen nothing yet. Teen Wolf Too is so bad that it makes part one look like an Academy Award winning film. Dude, why did they make this movie? What were the film-makers thinking? I know that this movie was made during the 80's and they made an obligatory sequel (they were mandatory during the 80's, if a film made the slightest of profit a sequel was on it's way).\n\nI can't express my displeasure in this movie. There was no reason for it to ever see the light of day. I can't find one. Can you?\n\nBad movie, beyond words...\n\nRunaway! Runaway!!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "fallen_frames",
        "review_rating": "10",
        "review_title": "what a blast!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Hayden-86055",
        "review_rating": "6",
        "review_title": "Don't roll your eyes but I highly enjoyed this",
        "review_detailed_main": "Teen Wolf 2 (too?) is a good film, very shockingly. It stars Jason Bateman in his first feature film role, and his character is great fun. The film is so ridiculous and unbelievable you can never quite guess what comes next, John Astin plays the strict headmaster who somehow has the power to give away cars and free grades to whoever does the best at boxing for the school: I. E Jason Bateman. It's very similar to the first film but I found the boxing plotline more interesting than basketball and I just preferred Bateman's character.\n\nIt's cheesy and it's silly but it's a lot of fun to watch, and the acting's not even that bad for goodness sake! This is prime 80s entertainment.\n\n6/10: Very silly film but definitely worth a watch and hugely underrated with a bigger focus on characterisation than the 1985 original."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "robot-cat",
        "review_rating": "1",
        "review_title": "I couldn't stop laughing...",
        "review_detailed_main": "maybe it was the psychedelic mushrooms I ate.\n\nIt's so incredibly bad, that I laugh every time I think about it.\n\nI don't think I could ever watch it again. Certainly not sober, maybe if there were a good MST3K treatment of it.\n\nA great example of the greed that runs Hollywood.\n\n1/10"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "Too awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "rockula",
        "review_rating": "1",
        "review_title": "Truly a waste of film.",
        "review_detailed_main": "The first teen wolf was not bad. A new idea. This movie, however, had nothing new at all. It was almost identical to the first, with a different actor and a terrible story. Kudos to Michael J. Fox for taking a BIG pass at this one!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "poolandrews",
        "review_rating": "2",
        "review_title": "'If this is meant to be some kind of joke you'll notice I'm not laughing.' Yeah, I know how the guy feels.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "starcollector73",
        "review_rating": "1",
        "review_title": "Why?????",
        "review_detailed_main": "I dont know whats more disturbing the fact that this movie was ever made or the fact that i've actually seen it.... Teen Wolf was a cute, warm hearted and fun little movie that had some nice little moments and the added bonus of the always reliable Michael J Fox starring in it. This cheap little sequel has absolutely no redeeming features and in all fairness should never have been made. I think that the thing that bugs me most about this film is the fact that someone somewhere thought that the great cinema going public would be that sad and that stupid that we wouldn't see this for the 'lets milk this and run' movie that it actually is. Firstly the only reason the first film was such a success is that Mr. Fox was in it so you'd have thought that no Fox would mean no sequel. But no, some bright spark thought 'Hey lets use another character and why dont we make him Scotts cousin and lets make him completely devoid of charm, and hey while were at it lets replace funny Stiles with a new unfunny and rather annoying Stiles.'....bah!!!!! Annoyingly Teen Wolf Too is included on the Teen Wolf DVD which is a shame as i'd rather have seen some special features, extras etc from the first movie instead of valuable space being taken up by this sorry sequel. I could go on and on about how poor this movie actually is but as it's already ranking in the worst movies of all time list i guess everybody already knows."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "If you loved \"Teen Wolf\", you may want to reconsider watching \"Teen Wolf Too\".",
        "review_detailed_main": "\"Teen Wolf\" was a popular film. So, it's not surprising that the studio would want to make a sequel. The problem was that the star of the first one, Michael J. Fox, hated making \"Teen Wolf\" and refused to make the sequel. It's not hard to understand, as between the two films \"Back to the Future\" came out and shot Fox to greater stardom. So, in a pinch, the studio tossed out many of the original cast and tried to see if they could get away with it. Despite all this, the sequel still made a modest profit....though it also made IMDB's infamous Bottom 100 List. So, according to the list, this is the 62nd worst major release of all time according to users.\n\nWhen the film begins, you see that Jason Bateman is playing Todd Howard....the COUSIN of Michael J. Fox's character from the first film, Scott. Oddly, Scott's father (James Hampton) is in the movie and he's acting the role of Todd's guardian. Todd is starting college (which is odd, as Bateman was 18...and rarely do roles for teens ever actually go to real teens....often they are 21-30) and he's there on an athletic scholarship but apparently didn't deserve it...much like those actors and their kids you've heard about a lot in the news recently. However, in Todd's case he could get killed, as it's a BOXING scholarship! Will Todd's lycanthropy help save him from being beaten to a pulp? And, like every teen film of the 80s, will it help him get the girl?\n\nWhile I was NOT a huge fan of \"Teen Wolf\", it seems like \"Teen Wolf Too\" is a step backward in most every way. The biggest problem is the writing, as some of the characters are one-dimensional and ridiculous caricatures (especially John Astin as the Dean). They also often used slapstick instead of cleverness...and really, really bad slapstick....like the sort of stuff 6 year-olds would enjoy. Hard to watch...and easy to hate.\n\nSo, while it's bad, is it Bottom 100 bad? Probably not. But I have noticed several other film franchises have the same pattern....a film is loved by its fans and the studios create sequels that simply stink. And, because so much love existed for the first one, there's a backlash and folks not only dislike but HATE the sequels. Some examples on the Bottom 100 are \"The Neverending Story III\", \"Son of Mask\", \"Jaws the Revenge\", \"The Human Centipede II\" as well as \"The Human Centipede III\". The same cannot be said of \"Baby Geniuses\" and \"Baby Geniuses II\" because both films made the list and both films are god-awful."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "TOMNEL",
        "review_rating": "2",
        "review_title": "Same exact story as the first in a new, but similar setting.",
        "review_detailed_main": "\"Teen Wolf Too\" can hardly even be called a sequel to the first. It is more accurately a remake. It has almost the exact same plot as the first, except the sport here is boxing instead of basketball. Most of the supporting characters are back, many played by different actors.\n\nScott Howard from the first film, couldn't and I'm sure didn't want to be here, so instead we have his cousin Todd. Todd is going to college on a sports scholarship, even though he's poor at sports and really smart. The Dean, played by John \"Gomez\" Astin, for some stupid reason has a vendetta on Todd and is out to make sure he fails. Of course, Todd luckily figures out he's a werewolf on the first or second day of college, and dumb humor and bad dialog ensues. The first thing Todd does when he finally figures out that he's a full fledged werewolf, is break into perfectly choreographed dance singing \"Do You Love Me?\", which somehow makes him popular. Also his werewolf powers make him a jerk, so the girl he just met thinks he doesn't love her anymore. He also starts a frog fight in science class where all the college students begin throwing dead frogs...but luckily the teacher comes in and says she's disappointed, not caring that these adults just did this. Obviously the writing was just ridiculous.\n\nOverall this was a somewhat enjoyable film...in a laughing at it's awfulness way.\n\nMy rating: 1/2 out of ****. 91 mins. PG for some violence."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "bkoganbing",
        "review_rating": "4",
        "review_title": "Wolf in the ring",
        "review_detailed_main": "On the success of Teen Wolf for Michael J. Fox another Teen Wolf film was certainly in the offing. Fox declined to do the remake probably thinking there ain't no way he was going to be doing college basketball. Jason Bateman got the part for the remake and he plays Fox's cousin. As the film opens it's James Hampton who played Fox's father driving Bateman to college as a freshman.\n\nWhere of all things Bateman is in on a boxing scholarship. I've never heard of one of these, but John Astin who overacts outrageously as the dean of the college wants a boxing team badly. Maybe even more than Philip Ober did for his army company in From Here To Eternity. Bateman's only activity resembling sports was playing clarinet in the school band.\n\nBut Paul Sand knows of the pedigree in Bateman's family. He's the athletic coach and where there's one Teen Wolf there might be another. As you would suspect, the inner wolf comes out.\n\nTeen Wolf Too is a mediocre comedy with gags borrowed from other and better films of the genre. It's not as bad as some would have it, but it sure didn't create any demand for a third Teen Wolf film."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "BrassRingEdward",
        "review_rating": "2",
        "review_title": "Not the worst...but close.",
        "review_detailed_main": "I only gave this movie a two because I know there are worse movies...but it wouldn't be easy to find them...and who would want to?\n\nI was compelled to give this movie a review...but not enough to spend actual time on it.\n\nTake my advice...rather than watch this movie, find something better to do...sort your socks chronologically, or something more entertaining.\n\nDescription? No script, lame acting...sucks is a step up."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "rubystigers",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "I bought this movie. I love this movie. I love Jason Bateman."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "dworldeater",
        "review_rating": "6",
        "review_title": "In defense of Teen Wolf Too...",
        "review_detailed_main": "Ouch, in reading some of these user reviews Teen Wolf Too is really hated. But really, don't lisen to these jabronies, this is not nearly as bad as they make it out to be. Granted, Teen Wolf is a 80's classic, I would not say the follow up is in that catagory. However, if you can overlook the fact that 80's pop culture icon Michael J Fox is not in it, the film really is'nt all that bad. It does try to copy the 1st film in many respects and is not altogether successful. But, even as a failure, it is not a bad film. It does follow the same formula for every 80's teen comedy and while it is lacking someone like Michael J Fox who could knock this out of the park, Teen Wolf Too is far from unwatchable. Jason Bateman actually gives a pretty decent performance, comparing him with Fox is'nt really fair as he is not a superstar or possessing of Michael's unique charisma and screen presence. The film is not nearly as funny as the 1st film either and at times is a bit corny. Either way, Teen Wolf Too is a decent time passer and if you take into consideration that this movie follows a lot of 80's genre conventions and won't blow you away, Teen Wolf Too is passable campy entertainment."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Yesh4",
        "review_rating": "4",
        "review_title": "Most unnecessary sequel",
        "review_detailed_main": "3.5/10 I would give it.\n\nWell I loved the original yeah it was corny but a whole load of fun, had a it had great story line and was hilarious . Unfortunately, the same cannot be said for this ''teen wolf too''.\n\nIt must be said that it is exactly the same as the original but so much worse. Just replace high school with college, replace the sport from basketball to football and replace a charming, adorable Michael J. Fox with a lifeless(but very cute) Jason Bateman.\n\nLet's talk about the acting. Ha! I've seen more charisma from cardboard.The most annoying of the bunch was the love interest person how whiny and annoying she was.\n\nOkay some parts were funny and the soundtrack was okay- although not memorable. But it just wouldn't end! It's a short film (1.5 hours) but I kept checking the clock cos it felt so much longer than that!\n\nBottom line is watch the original instead of this ridiculous drivel and accept no imitations. Unfortunately, the DVD of Teen Wolf comes with both so I'm stuck with it."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Awful and Lazy Sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Thanos_Alfie",
        "review_rating": "3",
        "review_title": "Not good...",
        "review_detailed_main": "\"Teen Wolf Too\" is a Comedy - Fantasy movie and the sequel of \"Teen Wolf\", in which we watch Scott Howard's cousin, Todd going to college where he turns into a werewolf and things get more complicated for him.\n\nSince I had already watched and enjoyed the first movie, I have to admit that I had high expectations from this movie. Unfortunately, I was disappointed by it and I have to say after watching it that I would not recommend it since it was a waste of time. It had a great potential but failed to succeed mainly because it was not as good as the first one. In conclusion, I have also to say that \"Teen Wolf Too\" is not a great movie and I believe there was not any reason of creating this movie."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "AGood",
        "review_rating": "4",
        "review_title": "So Lets Get This Straight",
        "review_detailed_main": "Todd crams an entire Biology semester learning from scratch almost the entire semesters work (as he never attended most of the classes) all in one nights mega cramathon. And he has sex with a totally hot girl he was awful to throughout the movie in this same nights cramathon. And also cramathon trains from scratch to become a boxer to fight the best boxer at the rival school. Which when at the start of the movie shows he was terrible and knew nothing and was not atheletically gifted in anyway. All in that same one night he does all of this. He then takes the test after no sleep all night. And also then straight after the test takes the boxing fight. Which they make the point of saying the test ends at 3pm and the fight starts at 3pm. This for me is more unrealistic than the premise of someone turning into a warewolf. When I was in my teens I liked this movie. but now I feel a lot of it is cringe worthy. When he catches the frisby in his mouth for example I was thinking thats it I am turning this off now. Jason Bateman is brilliant in it though as he plays the role of Todd very sympathetically and with charisma. And the girl playing the geeky nerd girl is way hotter than the two girls who are meant to be playing the schools hotties. And yet he treats her awful throughout the movie and she keeps coming back to him. Why? Its not like in the first movie where the girl grew up with Scott. This girl barely knew Todd. Its a shame this wasn't better written as this could have been good."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "MorganStable",
        "review_rating": "2",
        "review_title": "Teen Wolf Remake",
        "review_detailed_main": "This sequel is REMARKABLE. It's note for note the exact same film as Teen Wolf, with boxing replacing basketball (and Jason Bateman as a fourth string Michael J Fox)\n\nBut more importantly, I'm one of the four people in this country who saw this in the theaters. In fact, that night I was recovering from surgery on my left shoulder, and my friend's lab had just bitten my right hand. We went to Teen Wolf too thinking the day could not have gotten worse. Whoops.\n\nInstead of renting this, I recommend getting bitten by a dog. Or watch the last scene of Teen Wolf 1. A guy has his pants unbuttoned and tries desperately to cover up in the last shot.\n\nL Man"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "magikistrocker",
        "review_rating": "1",
        "review_title": "why, God, why",
        "review_detailed_main": "The movie Teen Wolf was amazing. It ranks in my all time top 10 80s films. Michael J. Fox was brilliant as Scott Howard. It was so magnificent when he turned into the wolf and became a basketball player.\n\nHowever, the sequel was terrible. Jason Bateman was awful. The most disappointing part, however was the new Stiles. Like Jerry Levine didn't have anything better to do in 1987.\n\nThe only reason I ever watched this movie is because it is on the reverse side of Teen Wolf, and I once accidentally put the wrong side in.\n\nYour time would be better spent watching Teen Wolf one in Spanish or French, than watching Teen Wolf Too."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "FlashCallahan",
        "review_rating": "1",
        "review_title": "Howlingly Bad.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "sivart22",
        "review_rating": "1",
        "review_title": "it should win",
        "review_detailed_main": "My personal pick for the worst movie of all time. Teen Wolf Too, come on we can do it, make this #1 on the bottom 100, if we all pull together we can do it!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "eddie736",
        "review_rating": "2",
        "review_title": "Am I missing something here?",
        "review_detailed_main": "Usually a movie - - even an awful one - - has to make a ton of money to warrant a sequel. Godfather, Batman, Superman, Star Wars - - Teen Wolf?? When did the original become the blockbuster to earn another telling? Anyway, it's a howling dog of a movie. But you knew that already."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "erniep23",
        "review_rating": "10",
        "review_title": "Just had my 500th viewing",
        "review_detailed_main": "This is the greatest movie about a werewolf who becomes the star of his college boxing team.\n\nWhat Teen Wolf Too provides:\n\nChubby and Uncle Howard return for the sequel - The worst rendition of \"Do you love me\" ever recorded, then lip-synced by Teen Wolf Too at a party where he jumps 30 feet in the air, backwards, onto a balcony * One of the great movie mullets of all time - thank you Stuart Fratkin * Frog fight * John Rocker's acting debut * Will Smith's acting debut * Two-sport athlete Chubby goes undefeated as team's heavyweight boxer and is on the fencing team, giving us the most far-fetched dual-sporting career for a college athlete * Teen Wolf Too catches a frisbee in his mouth, then signs autographs * Three consecutive montage scenes with no dialogue * Professor Tonya Brooks * The \"I'd like to change some classes\" scene. Better than the last scene of Casablanca * Teen Wolf Too loses his virginity to \"send me an angel\" * Teen Wolf Too punches someone so hard that he flies 15 feet in the air and out of the boxing ring, destroying the press table\n\n\nIf I had to give it a rating on a scale of 1-10, I'd give it a 4,531,899,376."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Flounder-9",
        "review_rating": "6",
        "review_title": "Not the greatest movie, but remember who it is targeting",
        "review_detailed_main": "I haven't read too many good reviews of this movie and I think that is because the reviewers are forgetting the point to this movie. This movie was not targeting adults. I would assume that this movie is directed to kids who are about Junior High age. A good example of this is the scene toward the beginning in the dance hall. The president of the university comes up to Todd, who is his pride and joy because he is going to turn the boxing program around because of Todd's super-hero type skills. What is the first thing that the president offers to Todd? A gorgeous blonde who he had already met. After some polite conversation, he grabs her butt, which triggers the wolf to come out of him. Think back to when you were in Junior High. Didn't you want to be a super-hero type to come in and be a successful athlete and grab the butts of beautiful women?\n\nLike I said, this isn't the greatest movie ever, but I am sure that in 1987, it did have it's audience."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Nephilim",
        "review_rating": "1",
        "review_title": "Yawn...",
        "review_detailed_main": "Teenager is dull... Teenager turns to wolf... Wolf teenager is not dull... Audience is at sleep... Say no more!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "jball242003",
        "review_rating": "",
        "review_title": "a piece of cinematic excellence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "condecalifornia",
        "review_rating": "3",
        "review_title": "An exact copy...",
        "review_detailed_main": "I saw Teen wolf and i enjoyed it.. the first one that is.. it was simple and fun.. original story.. then they decided (I guess) to capitalize on the success of the first one and do a sequel.. which I think it's OK.. but o dear lord.. they did it exactly as the first down to the last detail.. if it wasn't for Jason Bateman, you could swear you were watching the first one.. they could have added a few twists to the story, just to make it different, I suppose the fear of failure wouldn't let them.. you should watch it just to compare.. that would be the only funny thing about this movie. Everything! from the kid being reluctant to accept his condition, the popularity of the wolf, Styles and the wolf merchandising, they just switched it from high school to college and from basket to boxing, the rest was left as it was, but enough with the bad talk.. I have to admit that they did do a great thing worthy of recognition: they put a lot of work and effort to make it look exactly like the first one.. Job well done!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "The-Sarkologist",
        "review_rating": "2",
        "review_title": "Why on Earth did they even make this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "But why...?",
        "review_detailed_main": "I have watched this 1987 \"Teen Wolf Too\" movie once before, but must admit that I have entirely forgotten about it. And thus, I opted to revisit the movie here in 2024.\n\nAnd I have to say that the 1987 movie \"Teen Wolf Too\" is a prime example of why Hollywood shouldn't spew out sequels fueled by a cash-grab engine. And that is exactly what this movie was.\n\nThe storyline and script was insanely unoriginal, and almost just being a blatant copy of the script and storyline by Jeph Loeb and Matthew Weisman for the 1985 \"Teen Wolf\" movie. Seriously, what were writers Jeph Loeb, Matthew Weisman and Tim Kring thinking here? Instead of having Michael J. Fox return as the basketball playing werewolf Scott Howard, they instead had Jason Bateman show up as Todd Howard, Scott's cousin who did boxing as a werewolf. Yeah, that was the extend of the writing here, otherwise it was essentially just a copy-paste job of the first movie.\n\nWhile Jason Bateman certainly is a good actor, he just was no Michael J. Fox, and didn't even come remotely close to having the same on-screen charisma as Michael J. Fox had in the first movie. The movie also has John Astin and James Hampton on the cast list, with the latter being the only tie to the original movie, aside from the surname of the main characters in both movies.\n\nVisually then the movie was okay, as it was much akin to the 1985 movie, so that at least counted for something.\n\nWatchable, sure, but the movie feels really, really redundant and unoriginal. It was sort of cringeworthy for it to just be a copy-paste cash-grab by writers Jeph Loeb, Matthew Weisman and Tim Kring. If you haven't watched the 1985 \"Teen Wolf\" movie, then you will enjoy the 1987 sequel \"Teen Wolf Too\" a lot more than if you have watched the original movie.\n\nMy rating of director Christopher Leitch's 1987 movie lands on a generous four out of ten stars."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "kimcoxmonm",
        "review_rating": "1",
        "review_title": "Yikes, bad when I was a teen.",
        "review_detailed_main": "It was awful!! No surprise it rates in the Top 100 worst on IMDB.\n\nJason Bateman is a fine actor which came from years of dedication because as a young man, not so much. Even on the set of Paul, (Simon Pegg/Nick Frost 2011) they razzed him about it. Sometimes you can't escape it even if you have a successful career.\n\nThe original was okay when I was a teen but in hindsight, nope.\n\nOf course it's a far fetched movie; it's about a werewolf. That aside, if they are telling a story in the otherwise real world, then attempt to make it realistic. I mean, come on, who gives a boxing scholarship? Yes, some will say that football, for example, is barbaric and not worthy of the same consideration. I love football, so I'm bias. In all reality, no sport should get you a scholarship, academic excellence should. Very few people actually go on to a professional sport, let alone for several years, relative to the number who play in college. Then you have the chubby kid in fencing?! It's like movie portrayals of the chubby kid playing the baseball catcher. The constant squatting to standing and a rocket arm!! Haha!!!\n\nAnyway, the storyline follows over-the-top impossibilities in a very corny, cheesy fashion. This is truly for kids and teens only."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Jakemcclake",
        "review_rating": "3",
        "review_title": "After you watch it, you'll want know why...to any question about it",
        "review_detailed_main": "You wont know why... anything happened in the movie. The only answer is, it happened in the successful Teen Wolf Movie too.\n\nThe movie was a terrible sequel to the original Teen Wolf, which was corny, but it has something good. This movie about a guy who becomes the Wolf Todd Howard, tried to but basically did not convey some of the ideas of the original Teen Wolf movie about Scott Howard who became a wolf. That means a viewer who has seen Teen Wolf, will immediately draws a comparison to Teen Wolf when they watch this, but it is a bad comparison.\n\nFor one thing Teen Wolf conveyed a concept about team work, with the sport of Basketball. Scott Howard of Teen Wolf learns that team work is important. For this movie they tried the same thing, but they picked the wrong sport to relate to teamwork (Boxing), so you don't get the same message.\n\nIn Teen Wolf, Scott Howard becomes the Wolf and the important guy and gets some attention from the beautiful girl he has been chasing. In this movie, it is not obvious that Todd Howard is chasing the beautiful girl.\n\nIn Teen Wolf, Scott Howard has a long time girl friend who objects to the wolf, who is not the attention grabbing beautiful girl he is chasing, but someone less attractive, who likes him for himself. In this movie the same part is there, but she is not someone who has been around Todd all his life, and furthermore, she is the prettiest girl in the movie, so the message is not the same.\n\nYou will probably wonder why when you watch this movie too."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "kevin_robbins",
        "review_rating": "4",
        "review_title": "I would recommend this to fans of the original, just go in understanding this is a huge step back from that film.",
        "review_detailed_main": "Teen Wolf Too (1987) is a movie I recently watched for the first time in a long time on Tubi. The storyline for this picture follows Scott's cousin from the first film as he goes to college with Scott's friends and is dropped off by...Scott's dad. Shortly after starting school the cousins discovers he's a werewolf and then the shenanigans unfolds. This movie is directed by Christopher Leitch (She Fought Alone) and stars Jason Bateman (Ozark), Kim Darby (Better off Dead), John Astin (Addam's Family) and James Hampton (Sling Blade). The storyline for this felt like they wanted Michael J. Fox back and couldn't make it happen so they inserted Bateman (not a bad choice if they had better writing). The storyline was a carbon copy of the first one - swap out basketball for boxing, same awkward coaching interactions, same friends getting annoyed with the werewolf getting attention, same lessons learned at the end. This kind of feels like a not as good Teen Wolf. My favorite part was seeing Astin in this as the principle. Overall, I would recommend this to fans of the original, just go in understanding this is a huge step back from that film. This is a 4/10."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "hellholehorror",
        "review_rating": "1",
        "review_title": "Cash-in",
        "review_detailed_main": "Nothing wrong with it but nothing really to look at. Not that great to listen to. It was just standard procedure. Terrible script. It just copied the first movie watering it down. The ending was horrible. I really recommend avoiding this cash-in travesty."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "rolf4",
        "review_rating": "10",
        "review_title": "so nice",
        "review_detailed_main": "i am the only, how love the movie. its so great to see, if todd dance with the nice girl, wear a suit and tie. but instead of he get an erection, he changed into a teen wolf. how cares, that todd sings and get arrogant and lordly? i am not.\n\nthe DVD has got not mutch extras, the cinema trailer. and that is one important thing, what i am miss:\n\nin the trailer todd stand before a mirror, had got some trouble in a locker room, he ripped his shirt and his fingernails are pointed. outside was stiles ans spoke to todd. then the camera again goes to todd and he hast got pointed and hairy ears and pointet theeth.\n\nand this scene was complete deleted in the movie."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "fullenw",
        "review_rating": "7",
        "review_title": "Carbon Copy of the 1st",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "emeraldreprobates",
        "review_rating": "1",
        "review_title": "A Teen Wolf Too Far",
        "review_detailed_main": "If you have watched Teen Wolf, then change out Michael J Fox for his wolf cousin Jason Bateman, replace basketball with boxing and move everything to college not high school and there is no need to watch this pointless sequel. It's a badly made, badly written, badly acted movie. It looked like a cross between a Teen Wold rehash and a discarded Animal House or Stripes style script with a boxing / dancing wolf thrown into the mix. Sometimes films should not have been made and this is clearly one of those times.\n\nThe only reason I can come up with is that it was the 80's and apparently Hollywood was cocaine filled or so the stories go. There has to be a link, doesn't there? Now for the good points\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085\u0085 Featured on Episode 71 of The Emerald Reprobates Podcast."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "namashi_1",
        "review_rating": "",
        "review_title": "A poor show!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "ObscureHorror",
        "review_rating": "1",
        "review_title": "Terrible Film but great commentary by me",
        "review_detailed_main": "Horrible sequel to a bad film. Bateman has shown his lack of acting ability on that show he had in the 80's but this film is definitely brutal. Perhaps the only redeeming social value is the fact that even the ECW has better wrestling than this film."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "mpopy1",
        "review_rating": "3",
        "review_title": "Not So Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "BandSAboutMovies",
        "review_rating": "3",
        "review_title": "Not decent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "JCisneros",
        "review_rating": "2",
        "review_title": "Teen Wolf Too is the greatest movie I've ever seen!",
        "review_detailed_main": "People leave Teen Wolf Too alone! The movie is Ok! It's just as good as the first. Jason Bateman was brilliant! I give this movie a perfect ten. I recommend it to everyone. You all should watch it and see for yourselves. I guarantee it! You won't be sorry!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "rkissel-20373",
        "review_rating": "1",
        "review_title": "OMG what a terrible movie",
        "review_detailed_main": "So, a couple years back I bought this movie with the first movie in a two pack. I realized that the first movie wasn't as good as I remember but this movie is just a dumpster fire. I like Jason Bateman but him as Michael J Fox's cousin was just bad. Why was Michael J Fox's werewolf dad taking Jason Bateman to college? Why is Styles and Chubby there? Why wasn't this the same character from the first one? None of these are answered in the movie. The worst part of this movie was Bateman's transformation from being a nice nerdy kid to big jerk on campus. In the first movie you see Fox's transformation into being a jerk before learning that everyone in the school was fake friends and people just being nice to him because he became popular. In this movie there was no transition from nice kid to jerk. It was one scene. He wolfs out then goes straight into jerk mode. This was a terrible movie and I would avoid at all cost."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "slb_smith",
        "review_rating": "1",
        "review_title": "Possible worst movie ever",
        "review_detailed_main": "Don't believe anyone who has this highly rated. This movie makes no sense, it's boring, none of the characters has any chemistry. This movie has absolutely no redeeming qualities. Ugh."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "ehuntington-34084",
        "review_rating": "10",
        "review_title": "Wawa Wiwa.",
        "review_detailed_main": "Amazing movie. Absolutely outstanding. Breathtaking. Jason Bateman. 10/10 would recommend. Whales can weigh 330,000 pounds."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Rainey-Dawn",
        "review_rating": "7",
        "review_title": "I Liked it as Well as the First Film",
        "review_detailed_main": "For me, the second film with Justin Bateman is almost as good as the first with Michael J. Fox. The films are similar in that both are teen wolves, both have to do with sports, both have a girl that likes them for who they are but the teen wolves likes the rich snotty girl, both teen wolves have enemies and both teen wolves have teachers and Mr. Howard to look after them. This second film isn't a carbon copy of the first film but they very similar in their formula.\n\nI got a few laughs out of this second film. I also found I like the soundtrack a little better than the first film - but that's personal taste.\n\nOverall, I like this film almost as much as the first movie. I'm not sure why all the hate for this movie.\n\n7/10."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "heykovac",
        "review_rating": "",
        "review_title": "They shouldn't have made a sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Pipsta_2001",
        "review_rating": "8",
        "review_title": "Not bad if you treat it as a separate movie",
        "review_detailed_main": "Yes it's no good as a sequel and there's alot of problems but if this was the original and no first film had been made then I think it would have done pretty well. There was no need for a sequel so it got alot of hate. If you enjoyed thr first one then you'll enjoy this one. In some aspects it was actually better. Watch before you judge!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "videorama-759-859391",
        "review_rating": "6",
        "review_title": "More wolfing",
        "review_detailed_main": "Though it is an unneccessary sequel, and we can feel this had a good deal, on putting a hiatus or arrested development on JB's carrer, it's kind of cool, and intriguing why they used 'Too' as if a ballsy attempt, for making for a cute double meaning title. JB plays Michael J Fox cousin, so we know we're gonna see the same sprouting beard hair, the lighting up of emerald wolf eyes. Extra sharp protruding finger nails, and fangs dropping. Story is basically same, and for me who just watched this, and should of 33 years ago, the tired moral, the film represents, made it cliche'd and predictable, one character providing a twist towards the end, even though I sensed it much earlier, which you don't have to be Einstein to figure it. The film's thankful offering for me here was Bateman, and I really like this dude, and always have, though really hasn't doesn't much for me as an actor. Again wolfing, turns an unpopular loser, with scientific talent, into a fully bearded, campus stud, who in and out of wolf form, extracts a bit of revenge on those ridiculing score, who are making his college days, less than liveable. The opening song honoring the college campus, is what really stays with me, and the opening scene, in John (Gomez Addams) Astin's office, with his snarling controlled canine, is probably, sadly, the funniest in the whole film, and there was that boxing scene between the school bully at the fatboy, where the bully gives new meaning, to the term, 'lightning punches'. TW 2 or too, is lighthearted, late 80's comedy entertainment, where you can just be glad, Bateman was in this. I would of loved Jerry Levine to reprise his role, as the wild sex starved Styles in this, but we don't have a too bad substitute, but the original, of course, substitutes for this better, but this is very entertaining fun, if waning a little now from age. Sad too (ha) fine actor James Hampton who starred in this and the original, had died this year from Parkinson, if a cruel irony, condsidering M J Fox has it too. And yet again, I can't get that Hamilton tune out my head. ."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "sloth47",
        "review_rating": "",
        "review_title": "great as usual",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "jaws!",
        "review_rating": "8",
        "review_title": "I don't know why people hate this movie so much. I think it's in the three of the best college comedies of all time!",
        "review_detailed_main": "I have been watching Teen Wolf Too since 1987 or 1988. It's a very entertaining, and sometimes funny movie. It's maybe in my top ten of most watched movies ever! Don't believe everything you hear about this movie. I give this movie *** out of ****"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "PredragReviews",
        "review_rating": "6",
        "review_title": "Too bad to be truth...",
        "review_detailed_main": "Jason Bateman is much better than the film deserves, and actually gives a sharp and funny performance despite the mediocre production. We see the same progression in Todd as we had scene before with Michael J. Fox's Scott, where both characters turn on their friends and become real jerks after getting a taste of teenage popularity. The only difference here is that Todd is now playing for the college boxing team rather than a high school basketball team. When topped off with the rather ugly make-up effects, Jason Bateman looks more like a disfigured cat than he ever does a wolf. Paul Sand, Mark Holton, and James Hampton make appearances from the original, with John Astin and Kim Darby joining the cast.\n\nChristopher Leitch leaves nothing to chance in this unnecessary sequel, trying his best to recreate the same successes of the first film with very little variance. Still it's the 80's so I can't hate. The story is pretty much a re-hash of the original but is about boxing instead of b-ball and is at university instead of high school. The acting is actually quite good, considering the movie's obvious low budget and overall silliness. The werewolf \"FX\" (ie - make-up) is a little crude but it is done well enough to just about suspend disbelief.\n\nOverall rating: 6 out of 10."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "krillin123",
        "review_rating": "",
        "review_title": "horribly bad sequel that doesn't add anything new",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "tqkproductions",
        "review_rating": "10",
        "review_title": "Excellent Sequel!",
        "review_detailed_main": "Now, I'm as big a fan of the 1985 Teen Wolf as anybody else, but when I heard there was a second movie that came out two years later? Well, you can imagine my surprise!\n\nThis film has the same atmosphere and the same cinematography as the first one, which really makes me feel like they put some hard effort into keeping up the good name of \"Teen Wolf\"\n\nOnce again, the performances are superb. I'm glad to see Mark Holton's \"Chubby\" character have more screen time.\n\nMy one critique is I don't care very much for Stuart Fratkin's portrayal of Stiles. To be fair, it's pretty hard to follow Jerry Levine's performance.\n\nOverall, this movie was entertaining from start to finish. It's great if you want a goofy movie to watch with your friends."
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "thepts",
        "review_rating": "",
        "review_title": "Horrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Teen Wolf Too Rocks The Living Room!",
        "review_detailed_main": "If you liked the very first \"Teen Wolf\" and if any lady viewers thought Marty (sorry, but I love \"Back to the Future\" so much!), AKA young Michael J. Fox, was cute, then y'all will love this next movie in the series, \"Teen Wolf Too.\" But wait! Whatever happened to Michael J. Fox? How did Jason Bateman steal Mr. Fox's spot as the teen wolf? As the \"new George\" from \"George of the Jungle 2\" would say, \"Studio too cheap to pay Brandon Frasier!\" (And that was the part where the DVD would get taken out and thrown in the trash.) Except that this is Michael we were talking about. LOL Still, I think y'all ladies would appreciate having two hotties in two films, huh? (I know I'm a man writing this, but I'm a ladies man, you hear?) Do go watch these two movies; you'll fall in love!"
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "dexter-3",
        "review_rating": "",
        "review_title": "The point of this film is...?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "NoTZ",
        "review_rating": "",
        "review_title": "why why why why why.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "Jacob-24",
        "review_rating": "",
        "review_title": "aptly titled",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "Well, At Least the First One Was Good...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "thrix",
        "review_rating": "",
        "review_title": "Not TOO bad...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Just When You Thought It Could Not Get Any Worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0094118",
        "movie_name": "Teen Wolf Too",
        "movie_rating": "3.5",
        "review_username": "kelland8",
        "review_rating": "",
        "review_title": "star name correction",
        "review_detailed_main": ""
    }
]