[
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Peter_Young",
        "review_rating": "8",
        "review_title": "A visual and artistic treat about humanity, respect and the power of love against time and circumstances",
        "review_detailed_main": "Yash Chopra's Veer-Zaara is a visually stunning and emotionally touching picture about star-crossed lovers who meet once and are tied forever. Chopra artistically combines realism with unrestrained emotion and even some overdone sentimentality. On paper, the love story itself, the separation and everything else is quite typical, but Chopra infuses it with a different energy, masterfully emphasising the respect the two leads have for each other, the honour they pay to parents and elders, and their genuine willingness to sacrifice themselves for each other. While it is a cross-border love story between an Indian and a Pakistani, their nationality is not what really prevents them from being together. The lovers connect at the human level. Phenomenally well shot, Veer-Zaara flows smoothly through the stunning views of Indian and Pakistani fields and groves, and colourfully shows the bright sides of each country and their respective people. That the film does not define a specific period of historical time makes it universally relevant.\n\nThe love story is portrayed with grandeur, where larger-than-life orchestral music of heavy violins and piano accompanies the crucial moments, but at its core, it's beautifully old school. That is, the growing romance between the leads is not sleazy, it's not mainly driven by sexual tension or uncontrolled passion; there's pure interest to be together and be there for each other. The soundtrack is perhaps of the most beautiful assigned to a Hindi film in recent years, and that it was actually composed many years ago and rediscovered for this production, contributes to the epic mood of the film. Shahrukh Khan and Preity Zinta are great choices for the titular roles. They resuscitate their characters with restraint and dignity and have a credible chemistry despite not having much physical interaction. Khan is the main soul of the film and he is believable in everything his character goes through. Tremendously nuanced, Zinta is beautiful and compelling as the intelligent and headstrong Zaara, and looks ethereal in traditional outfits.\n\nIn the film's interesting progressive stance, religion and nationality are used as mediators to integration by means of shared human values. Among other issues, the film also addresses women's empowerment through Zaara's fierce independence and liberal views about women's rights, as well as Rani Mukherjee's role of a Pakistani lawyer who struggles to overcome societal norms. Indeed, Mukherjee, whose beauty appears so radiant throughout the film, makes a great impact with her relatively minor but pivotal role of the tenacious, level-headed Saammiya. She is natural and impressive and walks out leaving a mark. In general, as one would expect, Chopra manages to bring together a remarkable group of skilled actors to play the supporting roles, including Kirron Kher, Divya Dutta, Boman Irani, Manoj Bajpai, Amitabh Bachchan, Hema Malini, and Anupam Kher, all of whom play their respective parts to perfection, bringing layering and realism to their different, relatively short but memorably interesting characters.\n\nVeer-Zaara, though a completely entertaining and often overwhelming epic romance, is not the greatest film you'll see, and many might think it often goes over-the-top with its abundant emotional quotient. I personally found much of it easily totally in place within the context and parameters of the film. Script-wise, it might be far from flawless as some loopholes exist, while several open questions pertaining to some of the proceedings remain open or unanswered. Having said that, it just doesn't matter here. This film is far ahead of anything it can be blamed for. It is a portrait centering on and endorsing the main values a person should cherish in life: humanity, respect and love, and it conveys this message very well. Many non-Indians were affected by this film even though it's not their immediate taste, and it's easy to see why. As a cinematic experience, it is both a visual and artistic treat. In this regard, it is one of those films which become instant classics, and I recommend it to anyone, whoever and wherever he or she is."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "vijayvenkataramanan",
        "review_rating": "9",
        "review_title": "Progressive Film",
        "review_detailed_main": "Reviewed by: Vijay Venkataramanan Reviewer's Rating: 9 out of 10\n\nIt's Diwali - the time for sweets, new clothes, fireworks, and as is customary every year in India, a star-studded, feel-good blockbuster. Yash Chopra's reclamation of the director's throne after seven long years is a simple return to the classical traditions of mainstream Indian film-making. The flair and sensitivity for romance is intact along with the passion for deep-rooted cultural and traditional mis-en-scene. However, neither is \"Veer Zaara\" a classic, nor is it even remotely comparable to Chopra's earlier masterpieces such as \"Silsila\", \"Kaala Pathar\", \"Kabhie Kabhie\", and \"Lamhe\". Yet, it is an ideal Diwali gift, exquisitely packaged, filled to the brim with sentiments and emotions, presented with only the best of intentions.\n\nSquadron Leader Veer Pratap Singh (Shahrukh Khan) has been decaying in a Pakistani prison for twenty-two years. Saamiya Siddiqui (Rani Mukherjee), a local lawyer representing the Human Rights Commission undertakes the challenge of fighting for Veer so he can return to India. As Saamiya tries to unearth the hidden truth behind why and how Veer ended up in this situation, we are taken through a trip down memory lane as Veer recollects the days when he found and lost the love of his life, a Pakistani girl called Zaara (Priety Zinta).\n\nWhat \"Veer Zaara\" lacks in terms of an innovative plot structure, it more than makes up for with Aditya Chopra's sometimes flawed, but sensitive writing. The supporting characters are extremely well fleshed out, and his dialogs witty and subtle. The storytelling is further enhanced with Javed Akhtar's lyrical wizardry, and Yash Chopra's tact for stretching defining moments of the story into musical interludes continues to fascinate. \"Do pal ruka, khwaabon ka kaarvaan\", a fine example of Mr. Akhtar's and Mr. Chopra's brilliance remains etched in your memory.\n\nThe film's grand-scale packaging is embellished by Sharmishta Roy's artistic, and exquisitely detailed production design, with each set being highly reflective of the characters that it holds in. Cinematographer Anil Sharma (Lagaan, Kal Ho Na Ho) sets up a rustic, yet opulent scheme to the film's largely rural setting that brings back memories of the evergreen \"Dilwale Dulhania Le Jaayenge\".\n\nActors including the great Amitabh Bachchan (who makes a stunning special appearance in this film with Hema Malini) have always elevated their performances to higher levels under Yash Chopra's baton. Rani Mukherjee follows in the same footsteps, playing the rookie lawyer with an admirable juxtaposition of nervousness and ferocity. While Preity Zinta and Shahrukh Khan too perform well in their respective roles, at no point does one feel that these two talented actors are ever challenged with roles such as these. Having played the loverboy so many times in the past, Veer Pratap Singh is a cakewalk for the Khan. The lead pair's chemistry from their younger days all the way to the days of their fifties is highly appreciable however. The supporting cast comprising of Divya Dutta, Kirron Kher, Boman Irani, and Manoj Bajpai make full use of their well-defined characters to enact high-caliber performances.\n\nOther than the story of two fanatically devoted lovers, \"Veer Zaara\" is a progressive film for the Indian Film Industry because it makes an effort to break stereotypes with respect to Indo-Pak relations. It is a welcome change from the mindless Pak-bashing fare that we are routinely subjected to. Sensitive approaches like this first of all would help improve cultural ties, considering Hindi movies do comprise of a large portion of India's unofficial exports to Pakistan. Equally important is the economic factor because a culturally sensitive film like \"Veer Zaara\" is bound to officially open up a potentially huge, untapped, cinema-going audience across the border"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "chetley",
        "review_rating": "7",
        "review_title": "Bollywood Entertainment",
        "review_detailed_main": "\"Veer-Zaara\" was shown as part of an international film series at my local public library. It is the first Bollywood musical I have ever seen, and as such, I lack the critical perspective necessary to make an informed judgement about it. However, I did rate \"Veer-Zaara\" seven out of ten, because I found it consistently entertaining, and often entirely delightful. I was never once bored - in spite of its three hour plus running time. In order to appreciate any form of musical drama, it's necessary to \"surrender\" to theatrical artifice, and seen in that light, \"Veer-Zaara\" is no more illogical or \"unrealistic\" than a classic Vincent Minnelli Musical or a \"serious\" Verdi opera. I was also very intrigued at the way that the plot of the film crossed several genres and combined a number of classic story-telling archetypes: \"the star-crossed lovers,\" \"the village pastorale,\" \"the saga of family honor,\" \"the courtroom drama,\" etc.\n\nWatching this film I think I learned a lot about modern Indian culture. Although at times the sentimentality in \"Veer-Zaara\" is so gushing that it enters into the realm of camp, there is also much substance in the film which is entirely admirable and worthy of esteem: the honor paid to parents and elders, the independence and spirit shown by strong and intelligent women, the respect given to Law and Justice, and perhaps most importantly, the possibility of peace and reconciliation between two peoples and two nations who have been engaged in a long, bitter, and fruitless quarrel."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "moviesaremypassion",
        "review_rating": "10",
        "review_title": "great entertainment",
        "review_detailed_main": "Often it's the much-anticipated films that disappoint the most, but Veer Zaara lives up to the pre-release hype.\n\nJust when you think you know where the story is going, you are pleasantly surprised and therefore enthralled as the story unveils.\n\nPeople either love SRK or hate him, but I think he delivers what is necessary for this role without going over the top.\n\nThe surprise appearances are great, and Priety Zinta is getting better with every role.\n\nLast, but certainly not least, the music is superb. If you have no other reason to see this movie, see it to know the story that was finally told with these beautiful songs.\n\n10 out of 10"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "mrrubinben",
        "review_rating": "10",
        "review_title": "this movie was excellent",
        "review_detailed_main": "i don't know very well about the special relations between indians and pakistans but i can tell u this was the most beautiful movie i ever saw . the perfection that take place in the movie ,the music which suits so well to each act it been play , the excellent actors all that made me cry my friends and i don't cry in movies.... so simple , so beautiful i don't know anybody who don't dream about one love like this one love .... for one life. i didn't expect so much from an unknown director and i was surprised , i love this culture i love the simple people of India and Pakistan which are so well describe , painted in the movie and the beautiful woman of both country ...."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "mmajid-1",
        "review_rating": "",
        "review_title": "A movie with a lot of emotions. Good performances from the main characters. Good entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "AishFan",
        "review_rating": "10",
        "review_title": "A beautiful epic love story from Yash Chopra!",
        "review_detailed_main": "The Chopras have proved once again that you can always count on them to provide the highest quality cinema. I'd first like to applaud Shahrukh for outdoing himself once again by playing both a young, simple-natured squadron and an old, tormented prisoner so convincingly. His skillful subtleties and attention to each detail of his performance have undoubtedly turned him to the best actor I have ever seen. I think he has even surpassed Amitabh. Even though Rani and Preity's roles didn't seem to demand too much from them, they gave a wonderful performance. Even Manoj Bajpai did an excellent job. The story is fabulous. Where the traditional Bollywood film could take the same situations with different outcomes for each event to turn the film into the same familiar fare, Veer-Zaara makes turns it into an epic love story where Veer and Zaara's names can be added to the list of Devdas and Paro, Shah Jahaan and Mumtaaz, etc. The main minus point of the film is its music. Warning: Don't listen to the music before watching the film or it will sound horrendous! Tere Liye, however, is extremely beautiful and melodic. After watching the movie, Aisa Des Hai Mera and Main Yahan Hoon are quite likable. Unfortunately, the latter two are not ones that one can keep humming for several months. Another minor yet negligible drawback is that this movie can't appeal as much to the youth as Yash Chopra's previous film, Dil to Pagal Hai. An addicting soundtrack and a youthful appeal were two things that seemed to be missing, which are usually guaranteed in every Chopra extravaganza. Nonetheless, Veer-Zaara is fantastic!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "jogesh_thakur_2210",
        "review_rating": "10",
        "review_title": "No words for this movie.!",
        "review_detailed_main": "as my topic suggest,i am speechless after watching it,thanks Yash Chopra and SRK super emotional romantic movie of all time u can't compare this movie from money,words etc,this movie tells you why SRK is the king.those who didn't loved it they can not have a heart unforgettable movie,i am KID when this movie released and i regret not seeing it on theaters and Still regret why god didn't sent me before so that i should have catch this movie there...brilliance beyond words,this was the first movie i have ever cry and still cries when i watch this again and again,this movie can never be replaced with another movie this is epic and will remain epic best movie ever made in the history of cinema."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "smoky_circles",
        "review_rating": "7",
        "review_title": "Extremely sentimental, yet unabashedly so: the epitome of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "Wow...Shah Rukh Khan AND Amitab Bachchan in the same movie! And then Anupam Kher appears from out of no where!! Wow...",
        "review_detailed_main": "Many folks around the world do not remember the history that has transpired between India and Pakistan in the last 70 years. When India was subdivided into India, East Pakistan (later known as Bangladesh) and West Pakistan, it coincided with LOTS of sectarian violence between Hindus and Muslims. It also touched off wars and between one and two million people were killed! It was an awful time and led to both nations developing atomic weapons--after which, an uneasy stalemate has existed in the region. In this problem spot of the world is where this love story is based--a story about an Indian man (Shah Rukh Khan) and Pakistani woman (Preity Zinta).\n\nThe movie begins in Pakistan. Zaara's elderly grandmother is dying and begs her to take her ashed back to India where she was born. Despite the poor relations between the countries, Zaara agrees to go and during her journey (not surprisingly) she meets Veer and they soon fall in love. This portion of the film is very, very sweet--my favorite part of the film. However, things are NOT going to be easy--this IS an Indian romance and at over three hours in length, you know SOMETHING is going to come between their love.\n\nWhat happens to Veer is something you'll have to see for yourself-- but it clearly is an awful injustice and is highly reminiscent of Dumas' \"The Man in the Iron Mask\". This film really takes you on an emotional roller-coaster, that's for sure! In the process, some of the biggest film stars in India are there to support the main characters--with Amitabh Bachchan, Anupam Kher and Rani Mukerji on hand. While these names may not mean much to non-Bollywood fans, they are all mega- stars and make this one of the most star-studded Indian films I have ever seen. Combined with some amazing scenery and cinematography, clearly Yash Chopra pulled out all the stops to make this film.\n\nOverall, this is a wonderful and stirring romance--and I highly recommend it. The only part that didn't ring true for me was the little speech made by Kher near the end...it just seemed a bit trite and hard to believe. Still, a terrific film and one that stars two of the most beautiful women ever to have appeared on screen as well as two terrifically handsome and virile leading men."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ijzeren_jan",
        "review_rating": "6",
        "review_title": "Beautiful but awfully sentimental",
        "review_detailed_main": "Veer-Zaara has been in my possession for quite a long time, but somehow I could never convince myself to watch it. Now that I've finally taken that step, I have to say that my fear comes true: a visually beautiful movie (especially the scenes in Punjab), with music that is absolutely wonderful, but the final result is too much of a tearjerker anyway, and a way too long one to that. The love story is nice, sometimes even touchy, but nothing special when you think of it. The scenario... well, I've seen worse, much worse, but if a movie is supposed to absorb you entirely, then the illogical behavior of the protagonists, clearly with no other purpose but securing later events, doesn't benefit credibility at all. What I like, however, is the positive way Pakistan is portrayed, and that is undoubtedly the strongest point of the film. Another morale, related to emancipation of women, is sympathetic as well, although I have the impression that all these morales are a tad too much for one movie that is essentially about something completely different.\n\nThe trouble with sentimental films like this one is that they often operate on the verge of bad taste. Sometimes that works excellently, and I have to admit that some of them have managed to evoke a tear or two with me as well. However, for sentimentality to work, it needs to be dosed carefully, because an overdose may cause it to stop working completely, and then the whole thing suddenly becomes ridiculous or even disgusting. And from that point of view, Veera-Zaara is really pushing it, sometimes even pushing it too far. There's nothing wrong with a tear here and there, but too many of them makes the whole thing irritating. Apart from the fact that this movie is obviously too long, this is the biggest minus.\n\nRani Mukherjee is the saving grace of this movie. Although none of the characters is particularly credible, she manages best in portraying hers. Amitabh Bachchan and Hema Malini bring in something great as well, but then, they always seem to be a nice pair. I have a problem with Preity: although she is obviously not bad, her character appears to be pale and colorless anyway. Frankly, I don't really understand what Shahrukh likes so much in her at all, especially, what makes her worth the effort of spending 22 years in prison, only to save her from the disgrace of having to admit that she had been in love with a fellow before she got married to another one. But okay, that's the script and nobody can blame Preity for performing it that way. Most issues I have with Shahrukh himself, who is overacting so mercilessly that sometimes I got the feeling of watching Salman Khan instead of Shahrukh. He turns his character into a complete Devdas, the difference only being that Devdas is basically a jerk who is completely in love with his own pain, and while this kind of acting may work very well for Devdas, it obviously doesn't for the much more positive character of Veer Pratap Singh."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "howard78",
        "review_rating": "10",
        "review_title": "A masterpiece of film making!",
        "review_detailed_main": "The summary says it all: this film is a masterpiece from one of the greatest directors of our time! The cinematography is simply stunning. The performances are all tremendously inspired. (Thanks to Yash Chopra)The love story heart-warming, touching and deeply moving. There is also wisdom in the movie. For example, we get the mystical explanation of the number '786' in Islam and Sufism.\n\nThe music is marvelous and the script brilliant.\n\nI could go on and on, but, simply put, the movie is riveting from beginning to end. Upon my first viewing I thought it to be in the class of films such as 'Lagaan' and 'Fiza'. But, upon seeing the movie 2 more times, I believe it is even better than those two fine films.\n\nVeer-Zaara\u0085it's my tribute to the oneness of people on both sides of the border.\" - Yash Chopra"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "nishitd",
        "review_rating": "6",
        "review_title": "Love Legend by Yash Chopra",
        "review_detailed_main": "Advertised as \"Love Legend\" by Yash Chopra. Said to be one of the finest work by him. Is it worth all this hype??\n\nUpto some extent, YES. At some points it disappoints though. First of all, for those who hate Shahrukh Khan and his kinda movies, they better stay away from the movie. It's a totally emotional movie. Movie is to be watched for its direction and not for its script. The story is quite predictable except few turns.\n\nMovie's strongest point is its music by Late Madan Mohan and its recreation by Sanjeev Kohli and Yash Chopra. Full marks to Yash Chopra for the music and LYRICS. If you see trailer 4 on the LAN, you would really feel that upto what extent this man recreated Madan Mohan's tunes. If you liked its songs, then you will like even more when you see the movie, because it's well known fact that Yash Chopra's music is much dependent on the situation and more likable after watching the movie. e.g. the kawali, which I didn't like when I heard it, but it fits the situation very well, especially the words.\n\nMovie clearly belongs to ShahRukh Khan and Preity Zinta. As per performance, ShahRukh Khan is good. He has done the same acting he has been doing since quite long time, but anyway that's what is needed for the movie. Preity Zinta too is well. Rani Mukherjee doesn't have much role as compared to Veer and Zaara, but good performance in role assigned to her like some of the courtroom scenes. Amitabh Bachchan, Hema Malini, Manoj Vajpayee, Kirron Kher, Boman Irani have done justice to their roles.\n\nOverall, worth watching at Hall if you like emotional movies. my rating:8/10"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "me_the_devil",
        "review_rating": "3",
        "review_title": "An overdose of nothing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "larryalpha81",
        "review_rating": "",
        "review_title": "Fantabulous!!!!!!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "WinterMaiden",
        "review_rating": "8",
        "review_title": "\"Gift of the Magi\" in Bollywood format",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "aam_707",
        "review_rating": "9",
        "review_title": "somehow it works...",
        "review_detailed_main": "I watched it twice before I was being able to make an opinion about it. Though I do have some negatives about the movie...over all it is a good value for money. First talking about the plus sides... 1. Amitabh Bachan was awesome...one of the best performances of his lifetime in a short role.... 2. Screenplay and script deserve high grade.. though the dialogues aren't as catchy as were of DDLJ, DTPH or Mohabbatein...the overall screen play and twists and turns made this movie a treat to watch...specially Samia finding Zara in India catches everyone by surprise... 3. Rani's performance is A class and will surely win her some awards this year.... 4. Hima Malini looked cool as well as did her part with perfection. 5. Choice of locations for Indian village life is remarkable. 6. Though music on the whole is just about above average, a couple of scores in Bhangra beat are catchy. 7. And last but certainly not the least... Shahrukh Khan once again walks through a role with utmost perfection. I don't know whether it was deliberate or incidental, but his casualness and under toned acting as a youth made his performance as a gray-haired guy more prominent. Needless to see he was really skillful portraying a middle age prisoner.\n\nAnd now the minus side.. Well the only minus that I have with this movie is the projection of Pakistani society. Every time Pakistan was shown in the film it never looked like Pakistan. The director seems quite unfamiliar with Pakistan, her society, her customs, her wedding rituals, her surroundings..just about everything. And this to me was a real big minus...that bigger a minus that it overshadowed the pluses of the movie in first viewing. No politician in Pakistan contesting from Lahore wears shirwani in his house for sure..in fact in the entire national assemblies of last 3-4 decades, you will hardly find any sherwani except the nawab's of bahawalpur and late Nasarullah Khan. No one in Lahore uses the Lakhnao Delhi style of adab for greetings. Nor does the ladies of the class shown wear jewels like Kiron Kher. It looked more like Muslim Lucknow rather than Pakistan. And this highlights one more thing - \"India and Pakistan are two different and distant societies who know very little about each other. by the virtue of history, they do have things in common, but on the whole they have turned into two different societies. Pakistani society is different than the society of Indian muslims, it's more modern and has her own set of customs. It has moved quite a lot from the pre partition commonalities between the two cultures. And this is where Yash jee got it all wrong.\"\n\nBut all in all, a real good movie, with a daring plot and good screenplay full of surprises."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "mukesh-77729",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "singhal-52253",
        "review_rating": "10",
        "review_title": "Awesome songs movie",
        "review_detailed_main": "Yash Chopra's Veer-Zaara is a visually stunning and emotionally touching picture about star-crossed lovers who meet once and are tied forever. Chopra artistically combines realism with unrestrained emotion and even some overdone sentimentality. On paper, the love story itself, the separation and everything else is quite typical, but Chopra infuses it with a different energy, masterfully emphasising the respect the two leads have for each other, the honour they pay to parents and elders, and their genuine willingness to sacrifice themselves for each other. While it is a cross-border love story between an Indian and a Pakistani, their nationality is not what really prevents them from being together. The lovers connect at the human level. Phenomenally well shot, Veer-Zaara flows smoothly through the stunning views of Indian and Pakistani fields and groves, and colourfully shows the bright sides of each country and their respective."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "invisman",
        "review_rating": "6",
        "review_title": "Nothing out of the ordinary",
        "review_detailed_main": "Veer Zaara was just okay to be watched. Nothing more. Too many songs spoiled this movie. But the very last song has been picturised in a wonderful way and tune is very soulful. The tag line \"Romancing the Legend\" is apt for such a movie. But I would say SRK's career best performance was in Swades which also released with this movie simultaneously. Rani Mukharjee excelled in her portrayal of a real life Pakistani human rights activist. There is nothing much for Amitabh and Hema Malini to do and they have been credited with a \"special appearance\" tag.\n\nAll in all, an ordinary SRK fair; what more can you expect from Yash Chopra who made DDLJ, DTPH and Darr."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sarthakbharad2926",
        "review_rating": "10",
        "review_title": "Epic Love at it's peak.",
        "review_detailed_main": "What is the meaning of loving a film? I really don't know. But yes. I do know from the bottom of my heart that Veer-Zaara is an absolute masterpiece.\n\nThis film has everything. And everything comes beautifully in its perfect place due to the influence of the powerful man behind the camera, Yash Chopra. How can one man pull off such masterclass in storytelling that even though the concept and the story being so cliche feels so fresh and unique? You will always be missed sir.\n\nFirst off, SRK and Preity Zinta are just magnificent in the film. There is no second guessing there. The story of Veer Pratap Singh leaving his entire life behind to protect the honour of Zaara Hayaaat Khan is supposed to be an emotional rollercoaster and both of them don't miss a beat. I can't not believe that there is a man alive who can love Zaara more than Veer and it is all due to the performances of these two actors. Truly exceptional work by both of them. The rest of the cast also is simply great. Although most of the screentime is given to the leads, amitabh bachchan, hema malini, manoj bajpayee, rani mukerji, boman irani, all of them do a great job to support the love story perfectly.\n\nThe music is also really good. An album so good it will make you wanna cry, dance, be happy and fill you with all emotions humanly possible.\n\nIdk about you guys but, this film is perfect for me. A story I will never forget and cry everytime I rewatch it."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sauravjoshi85",
        "review_rating": "7",
        "review_title": "A unique romantic saga from the king of romantic film \"Yash Chopra\"",
        "review_detailed_main": "Veer-Zaara is a romantic drama film directed by Late Yash Chopra. The film stars Shahrukh Khan, Preity Zinta, Rani Mukerji, Amitabh Bachchan, Hema Malini, Divya Dutta, Manoj Bajpayee, Boman Irani, Anupam Kher and Kirron Kher.\n\nLove blooms between an Indian pilot, Veer, and a Pakistani girl, Zaara. As Veer spends his years in a Pakistani prison, Zaara believes him to be dead and devotes her life to his village in India.\n\nI watched this film for the first time in 2022 and found this film cliched, predictable and stereotyped but considering the film was shot and released in 2004 will try to review the film keeping in mind that the types of film that were released during that era.\n\nThe plot of the film is unique and execution is in typical Yash Chopra's style. The film has some typical Yash Chopra's feel such as long running of the film, fabulous music and the mesmerizing voice of the legend Lata ji apart from off-course Shah Rukh Khan. Yash Chopra has been remembered as king of comedy film and this film displays why he is called so.\n\nThe screenplay of the film is evenly paced but gets slow in middle and younger generation might get disconnected from the film. The first half of the film is more romantic but slow and second half is little less romantic and a little fast, music and BGM of the film is very strong.\n\nActing in the film is terrific and for me it was Preity Zinta who were the most impressive among all followed by Rani Mukerji and Shah Rukh Khan. Other stars were also impressive in their limited screen space but the fake Punjabi accent of Hema Malini irritates, in one of the scene she had addressed herself as South Indian and her dialogue delivery should've been kept normal.\n\nClimax of the film is good and the film ends on a happy note. Millennial and younger generations might feel disconnected from this film because of it's predictable and cliched approach but the viewers who were and still are a fan of Yash Chopra's work will surely like this film."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "RaiyanAhmedRuman",
        "review_rating": "10",
        "review_title": "one of the best romantic movie in bollywood",
        "review_detailed_main": "I watch this movie more than once, actually bollywood is known for many thing but also in romantic movie also, and when cames to shah rukh khan its boom, shah rukh khan and every single actor role it perfecly, and this movie hence 2004, that times bollywood movies are more obviously musicial, romantic musical movie, and specially every single songs and music tracks of the movie touch the heart, and lata mangasker the legend sung it like incrideble, the musics the acts and every thing in this movies are the best far, when anyone watch there are no way to feel any kind of boar, when i first time saw this movie, then after always day by day the movies scene and also the musics are in my mind, and of course only the best movie can make it feel. And in one word this the best bollywood movie of course."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ddasedEn",
        "review_rating": "7",
        "review_title": "Beautiful songs and Shah Rukh Khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "pollai",
        "review_rating": "2",
        "review_title": "Overrated",
        "review_detailed_main": "Okay i don't believe this movie to be as amazing as everyone says it to be..\n\nfirst of all the story is soo cheesy and there are probably hundreds of movies out there more deserving....swades for example....thought the music was good it only got so much recognition because its creater is no longer alive....\n\nShahrukhs acting was so so not amazing....he should not have gotten awards for this...but rather Swades...\n\ni think most people liked this movie cause they are pathetic when matters come to romance...\n\ni mean how idiotic is it to have a god damn song inbetween of a court sequence....I'm happy dat chopra guys not taking anymore awards...."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rizzobujjo",
        "review_rating": "",
        "review_title": "Thank you Mr Chopra",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "tushararora-08944",
        "review_rating": "10",
        "review_title": "Pure Classic",
        "review_detailed_main": "This movie doesn't even have one thing wrong from story, screenplay,music,acting everything is just top notch.\n\nA must must watch movie and this one will definitely make you cry,like a lot."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "uttamsarkale",
        "review_rating": "10",
        "review_title": "\"Yash Chopra's epic celebration of the potentialities of the Indian Cinema--perhaps the greatest movie ever made in Bollywood movie history.\"",
        "review_detailed_main": "This creative consciousness is impossible achieve in a bollywood Film, Yash Chopra's return as director after 7 years is an film for his lifetime, it is obvious to see that this is a work of Master, his direction here is ingenious, veer zaara is probably only mature film in bollywood history to achieve success in script about partition and region in bollywood history but the result is unmatchable.\n\nThis was made possible by Mr. Yash Chopra's stupendous direction, Adi Chopra's brilliant screenplay, bona fide music by Late Mr. Madan Mohan phenomenally revised and arranged by sanjeev kohli and magnificently acted by superlative cast principally by preity zinta.."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "mrugesh_thaker",
        "review_rating": "10",
        "review_title": "First time a movie which has combined patriotism, emotions, love, respect and humanity.",
        "review_detailed_main": "I have been a movie buff since I was a kid. Been watching a lot of movies. After watching Veer Zaara now I can say that my way of watching a movie had been divided into two parts. Pre Veer Zaara and Post veer Zaara.\n\nI have never seen a movie which combines a message of patriotism, emotions, respect, love and humanity with touching songs and wholesome entertainment. Until I saw Veer Zaara, I thought of Yashji as a very good movie maker. After Veer Zaara, I think he is not just a good movie maker but also a very good human being. Only a man with a heart of gold can make such a beautiful movie.\n\nExcellent direction, great acting, touching dialogues, melodious songs, brilliant cinematography, awesome locations what more I can say about the movie. It is a citizen Kane of India. Hats off to Yashji"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "tqureashi",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "I watched the movie it is really fantastic love story of two nations,i am thankful to the Producer,Director and Writer that they made such kind of movie...these kind of movies are the best way of getting closer to each other and it is the voice of the heart and the heart whispers to close each other coz v r neighbors,our relations should b loving and such movies develops love between Pakistan and India.i Appreciate the dialogs of anupam kheer when he said v should not recall ever the moments of 1947 and other events so v should never develop gud relations.the land of Pakistan and India is the same the fields,envoirment,weathers,and People.v should love with humanity.\n\nYash chopra g,is requested to make some more movies like this to save the mankind of both countries."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "awanahsan",
        "review_rating": "7",
        "review_title": "What is wrong with Veer-Zaara?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "vishaltanwaniglsica",
        "review_rating": "10",
        "review_title": "If ur favourite movie is excellent then this is more than that",
        "review_detailed_main": "This is a master peace srk is great but story will blow your mind lots of emotions patriotism love story women impoverishment and many more must watch movie"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Abdulxoxo",
        "review_rating": "6",
        "review_title": "A flawed classic",
        "review_detailed_main": "Veer Zaara is a love story set in the context of the continuing enmity between India and Pakistan. This is the film's framing, but most of it is a love story that talks about the power of true love but the thing is, the basis of Veer and Zaara's love come across as just a fluctuation, they meet after two to three days and that's it, Veer is willing to give his life to her? They sacrifice too much for a relationship that's only starting to find its footing, in my opinion. The whole thing just come across as unrealistic, I don't believe real people would behave the way they did, there's one scene where Veer shows up during Zaara engagement party, I thought the dude has some world-class plan but he just shows up \" look at me, I crossed the Indian border and I come to take Zaara from her family, give me Zaara!!\" totally implausible. Why does everybody has to cry every now and then? If you could gather all the tears in the movie, you could start your own water bottling company, haha. So melodramatic when it doesn't need to be. Now there's one twist towards the end, I have to it's a good twist but quite cheap as it negates the whole thing that takes place. I don't know much about the indo-pak tension but it is address on numerous occasions in this film, every movie I've watched that tackled the same issue so far failed to do it maturely. They all go over-the-top and preachy with the whole thing, Veer's parents are open-minded and welcoming of Pakistanis but Zaara's parents are very conservative and close-minded. Now it means sense, in the film's context 'cause if both the parents have the same mindset then things would be much more difficult and the story will drag but realistically speaking, there's an big chance that both parents would oppose to the relationship. There's also social message about women empowerment through Rani's storyline but the film doesn't address well and sadly, it's just a background noise in the story. The songs are romantic and quite catchy, but also dramatic and overbearing especially the background score. But the film is visually astonishing thanks to the slick cinematography. The costumes, sets decorations are all colorful and magical. Can't say anything bad about the acting either, the cast performance is terrific. Overall, Veer Zaara is a classic love story with good cinematic touches."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "riddhimaakaritu",
        "review_rating": "10",
        "review_title": "Best Movie Ever Made.",
        "review_detailed_main": "This was the movie which made me fall in love with SRK.\n\nEdit: Well my one liner review was quite biased towards SRK.\n\nThis film is excellent in each and every department. From acting, songs, dialogues, cinematography, direction - all perfect.\n\nThere are not enough words to describe how beautiful this film is in every way. It's a must watch.\n\nProbably my most favourite film of SRK as it is the only film in which SRK's character is charming, a true gentleman, a good son, doesn't tease the heroine, is not mean to anyone and is most selfless. A thing of dreams."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "reetonimdb",
        "review_rating": "6",
        "review_title": "Retrospect changes a lot of things",
        "review_detailed_main": "I only recently rewatched this movie for Divya Dutta's unique Lahori Punjabi dialect. I have met Pakistanis who speak that way and it's so refreshing. She was so authentic in her role in the movie. It's curious how she plays supporting roles with such accuracy. Her acting in Umrao Jaan yet again had a perfect Lakhnavi Urdu accent as well. It's really impressive when actors put time and effort into what they do. She's the reason I rewatched it after almost 2 decades since its release.\n\nThe rest is just fluff masked by cute songs, visuals and a heavy dose of self-aggrandizing and patronizing nationalism. Shah Rukh, Preity, Amitabh, and Rani couldn't speak or act Punjabi if their life depended on it. It's fine. This movie was a product of it's time. They tried. (Although if you really want to see someone try and succeed, watch Urmila Matondkar in Pinjar.)\n\nEveryone was miscast tbh except Kirron Kher, Divya Dutta and maybe Hema Malini. (And I'm only letting her slide because of Dharmendra.)\n\nIt's a regular Bollywood tearjerker, typical of its time. Not a complete waste of time though, especially if you're watching it for the first time."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ciscogovind",
        "review_rating": "1",
        "review_title": "Sucks!!!!!!!!!! Spoilers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "tristan6",
        "review_rating": "10",
        "review_title": "THE BEST FILM OF 2004 PERIOD",
        "review_detailed_main": "I have become quite a fan of Indian Hindi films in the last few years and my favorites have been Devdas, Lagaan, Baghban, Dil Chahta Hai among others. I have seen Veer Zaara three times in the theatre and must say that it is without a doubt the BEST BOLLYWOOD FILM I have ever seen. The score, direction, story and acting are superb. For a movie that lasts almost 3 1/2 hours, the story is so involving that the time just wizzes by. I have taken friends, not attuned to Bollywood style films and they were as thrilled as I was. This is in my opinion the BEST FILM of 2004 period. The speech Shah Rukh Kahn gives in the courtroom at the end of the film which pleas for tolerance and understanding raises the entire movie to a rarified plane. It would have been easy to end the story at the end of the trial but Yash Chopra and his writers enter an exalted level with this scene. Please be warned that this moving film is a real tear-jerker! It is a shame that main stream American movie reviewers are ignoring the film which is apparently doing very well in England and Australia. I could not find a review of this movie in any newspaper in Chicago on a recent trip. Even though I personally left a message for the reviewer of the Detroit Free Press, he chose to ignore the film entirely. Perhaps the people promoting the movie and Indian films in general need to do some homework and try to get their movies reviewed. It is a shame that many people who rely on critics reviews before seeing a film will not even know about this fabulous movie. It should at least be nominated for Oscar BEST FOREIGN FILM of 2004."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "namashi_1",
        "review_rating": "10",
        "review_title": "Veer - Zaara is a true love legend!",
        "review_detailed_main": "Yash Chopra's Veer - Zaara is my favorite film of 2004. I saw this movie twice in the theater. And saw it 4 times in DVD. I LOVE this movie.\n\nPerformances: I am a fan of Shahrukh, he's done a amazing job from start to end. Rani is excellent. Zinta looks amazingly beautiful. She has acted well. Manoj Bajpai is masterful. Amitabh Bachchan and Hema Malini are lovable in cameos. Divya Dutta is quite good. Anupam Kher leaves a mark, ditto for Boman Irani. Kirron Kher is outstanding.\n\nVeer - Zaara is a Indian Cinema classic. Watch this flick if you love romantic movies. A true Masterpiece from Indian Cinema!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sdreelin",
        "review_rating": "10",
        "review_title": "A surprise top movie!",
        "review_detailed_main": "I was fully prepared to see a typical Bollywood romantic musical, but came blow away at the sheer awesomeness of this movie! Yes, it is a romantic musical with great music, but the underlying themes are so much more keeping you engaged during the entire movie. Be prepared to see a sense romance, courage, honor and humanity that will heighten your senses. You will feel love, spirituality, anger, sadness and happiness all throughout. The scenery is beautiful and the actors all play their roles well. Veer's speech in court towards the end is something that will be remembered as it should be a basis of all humanity's dealings with differences. It is awesome in a world filled with hatred towards differences that a story like this can rise above and see the common thread in all humanity. A must see, even if you don't enjoy romantic musicals"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Sherazade",
        "review_rating": "10",
        "review_title": "A film of epic proportions!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "khans-2",
        "review_rating": "",
        "review_title": "EXCELLENT..BRILLIANT..AWESOME!!!..a message to the spoilers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "marinasilva8",
        "review_rating": "10",
        "review_title": "Best movie in the whole world",
        "review_detailed_main": "Omg. I am not the biggest fan of Hindi movies, and i don't watch them ever, but i went to Canada for spring break, and my uncle had this movie, and i watched it. I loved it more than any movie. I cried, and laughed. This the the best movie in the whole world. Zarra is beautiful, and i think she is very brave to go to an Indian man like that. Veera is SO hot, even though he is like 45 or something, he is such a great actor, and i love him. I wish that Zarra and Veera would be a really couple, cause if they can make me cry with there love, thats a first. They are so cute together, and they have to be together forever. The ending of the movie was the best, and i think that the lawyer, is really pretty. I love her eyes. She maybe the first Pakistani lawyer, but she is the most generous, and hard working women i have actually seen in Pakistan."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "KebbyPro",
        "review_rating": "6",
        "review_title": "Very moving story but long runtime",
        "review_detailed_main": "As is evident from the title, this movie is a masterpiece of storytelling. Moreover, it is a masterclass in love storytelling where the story of the protagonists is so strong that it is bound to bring tears to your eyes. The cinematography is par excellence, and it showcases the beauty of rural Punjab quite well. I have two main complaints about this film. First, it does not show authentic scenes from the other side of the border and bases itself on created sets. However, given the credibility of the director, producers, and star cast, this movie could easily get permission to be shot in a real location on the other side of the border, which could give it a more authentic and realistic feeling. Second, the runtime of this movie is quite long. This 3 hr 15 mins long movie could be easily shortened to a 1 hr 45 mins cut if the songs have been shortened and some of the romance sequences have been reduced. However, it is the vision of the director that led to this long cut, yet this film saw success at the box office. This proves that long movies do work if executed properly."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "lukeandersondabomb",
        "review_rating": "10",
        "review_title": "Veer Zaara simply excellent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "mypakistan-62853",
        "review_rating": "7",
        "review_title": "Best story",
        "review_detailed_main": "Best acting by Shahrukh khan a d also pretizenta but sometime pretizenta too over acting"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ahsanvaqar",
        "review_rating": "2",
        "review_title": "When is Indian cinema going to mature?",
        "review_detailed_main": "Veer Zaara- the most awaited movie of the year- finally released to a packed theater here in NJ. The verdict- not even nearly as good as the collections it would have made in just one day.\n\nWith the reins of direction in the veteran Yash Chopra's hands, one expects the cast to look their best, act their best and most of all the movie to be a wholesome entertainer. None of those qualities can be associated with the self proclaimed \"LOVE LEGEND\". Not to say that the movie did not have any positives, but they were far less than the negatives.\n\nStarting with the flaws, the script was extremely incoherent and un realistic, not to mention some apparent inconsistencies in the direction.To start with,a major question that is left for the viewer to answerer himself is how did Rani know about SRKs real name i.e. Veer? It had been a good 20 years and everyone knew him by his other name. So was Rani Psychic or did Bhagwan or Allah sent a commandment on her. If this question cant be answered, the logic given behind SRK's opening his stuttering mouth to reveal the most boring love story becomes meaningless( as if it was meaningful otherwise) and the story ends right in the beginning. There was no explanation given whatsoever and the viewer is left in a labyrinth to find his way back home.\n\nNext comes the unrealistic portrayal of the Lahori culture and the Muslim community. I being from Lahore and from a Muslim country have never seen people wearing the Iqbal cap and talking in the way shown. Neither have I seen them go to the darbars so often. Also I can never imagine a Muslim girl allowing any guy to lift her up and cross a bridge(specially a girl who has been brought up under so many restrictions, as shown in the movie), let alone run to India for whatever reason.\n\nThe dialogs that should make you cry, either felt too cliché'd or extremely funny. Rani telling SRK that she knows how much he loves Zaara made me laugh out loud. When is Indian cinema going to mature? She knows him for 1 day and she knows how much he loves Zaara? Please stop the cheesiness. Again Rani giving a lecture on the 786 number, assigned to SRK, to the hawaldaar provided another amusement park ride. The reason given by SRK for telling Rani the story was another funny point. There are so many more but the limit on words restricts me.\n\nComing to the looks and acting,SRK looked and acted his career worst. Priety looked very ordinary and her acting was just ordinary. Rani looked not only bad but also had the worst dialogs to deliver. I have never seen a 50 year old guy (which I am assuming SRK is shown to be ) shivering or behaving in the fashion he was in the movie. Another of his overacting proofs. This overrated actor cannot act for nuts.\n\nLast but not the least the positives: Finally we come across a message of peace and love for both the countries.Some scenes where the message was being delivered were quite effective. The song \"Aisa des hai mera\" was well executed.Divya Dutta's acting was undoubtedly the best of the cast. Amitabh and Hema provided the truly entertaining part of the movie.\n\nAs for Yash Chopra, it is advised not to be impressed with his son, Aditya Chopra or his son's best friend Karan Johar's style of movie making. He should be the one driving them, not being driven by them because all they can offer is cheesiness and over-dramatic situations. Also stop making movies for SRK. Cast some actor who can make the movie stand on his shoulders, without relying on the other cast( as is always the case with SRK)."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "8",
        "review_title": "22",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sajmal23",
        "review_rating": "10",
        "review_title": "A class of its own",
        "review_detailed_main": "I was eagerly awaiting the release of this movie as were many other people. I have to say it was not what i was expecting to a certain extent, nevertheless it was a true epic which touches the hearts of individuals. It does not have a typical Bollywood movie storyline it has a very important message a message of love and peace. The actors have done a marvelous job and Rani Mukherjee is great as is Preity Zinta. The music is first class. The thing the movie gets wrong is the culture of Pakistan which is not really what it is as depicted in the film but gets near enough. I next time i probably watch the movie is in my living room. Overall a good film by a love legend."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "kulsum_mirza",
        "review_rating": "10",
        "review_title": "Veer - Zaara. a sweet Movie..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "volkmar_richter",
        "review_rating": "9",
        "review_title": "You wouldn't trash Carmen",
        "review_detailed_main": "When I go to the opera, I expect big emotions that are in scale with the sets, stories and costumes. And many South Asian films, especially the Shah Rukh Khan romances, work on the same principle as opera. They keep everything in scale. Shah Rukh Khan relishes parts with love writ large and, when his acting is restrained, nobody can match him in those roles. I'm hard pressed to think of a male lead in Hollywood who could handle a love story of this size. Daniel Day Lewis, in Last of the Mohicans, but who else? Veer-Zaara is opera: opulent sets, extraordinary costumes and a tragic story. Add a score with one haunting melody and you've got something very familiar, to opera lovers,yet completely unique. Both art forms are acquired tastes, but addictive. You're warned."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Long but watchable epic romance, excellent songs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "arshdav-93817",
        "review_rating": "7",
        "review_title": "Movie review",
        "review_detailed_main": "This movie tells about the love and its importance.The full story moves around the lawyer Rani Mukherji who has done her best for those lovers and tries to prove the victory of love over the two nations.Manoj Bajpeye the best actor ever done a great job in the movie again,i think he is the best part of the story.As India and Pak situation in the movie is very tense for the love story but director make it through ."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "melsm",
        "review_rating": "10",
        "review_title": "what a movie!",
        "review_detailed_main": "We saw it in the Barcelon oriental film festival, and, instead of any political/religious manners it is a masterpiece under any aspect, We think that spectacular masterpieces are made now only in India, if this movie was made in the late 50'in USA it should be considered as Ben Hur. The panavision and sound in the movie were spectacular, but...Specially the character of the girl Pakistan lawyer is impressive and the actress is the most beautiful girl I have ever seen in the world, we don't know her name but me and my flat mate can't sleep since we have seen this movie thinking about her. The sequences between her and the king inside the prison are stop-breathing, and sometimes I walk through the streets in Barcelon and I think about some of this scenes and I start to cry. The sequence in the small town with a huge ballet scene is memorable, and also all the movie takes a sense of humanity that is impossible to see in USA cinema or European cinema today. When the intermission arrived all the cinema in Barcelona started to clap and scream as crazy!!!! Of course the King is super as always, and also Pretty Zhinta, but we love the lawyer!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "vaara",
        "review_rating": "6",
        "review_title": "Tries too hard... succeeds partly",
        "review_detailed_main": "The movie tries too hard to be an epic love story. It comes across as too contrived.The director should have used a better script, since the premise itself borders on the edge of believability.\n\nRani Mukherji and Manoj Bajpai shine in their roles, as Veer's lawyer and Zaara's fiancé, granting the characters the required empathy and sinisterness respectively.Amitabh Bachchan and Hema Malini are wasted in their roles.Preity Zinta performs reasonably well for her role which is not sizeable, even though, she is one of the lead stars.\n\nShah Rukh Khan struggles with the dialogues given to him. They should have been better written. However, his speech at the end of the movie was nice.\n\nThe songs except for a couple are not that interesting. I liked 'Main yahan hoon' and 'Yeh kahan aa gaye hum'. Another likable song is 'Tere liye'.\n\nOverall, the movie succeeds in parts only because of the stellar cast which receives little or no help from the script"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Saheli",
        "review_rating": "10",
        "review_title": "Absolutely favorite Film",
        "review_detailed_main": "This is one of the best Lovestories I've ever seen. I've just watched the movie for the 4th time and i'm still fascinated (- even more every time-) by the plot, the wonderful actors, the beautiful landscape (even though I think, some of the places have been filmed somewhere else - Tyrol, Switzerland ???). Even my 8 year old granddaughter found Veer-Zaara \"very moving\". I'm just listening to the Soundtrack and I love it !!!!! I've seen many of these Bollywodfilms but in my opinion this one is really great stuff and Shahrukh Khan (Veer Pratap Singh) follows me in my dreams - at the age of 67 - and I'm not ashamed of my tears !"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "jessicarabbit-1",
        "review_rating": "5",
        "review_title": "cheesy and unoriginal. *Spoiler Alert*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rsabnis1",
        "review_rating": "8",
        "review_title": "Emotionally powerful one that never loses its focus !",
        "review_detailed_main": "7 years ago, the veteran director Yash Chopra directed Shah Rukh Khan in a love triangle based movie Dil Toh Pagal Hain. After a long span of time, he came back with his highly acclaimed endeavor Veer Zaara. Not only an outstanding movie but a totally stand-out movie. The film stars Shah Rukh khan, Preity Zinta & Rani Mukherjee playing the lead roles while actors like Anupam Kher, Kirron Kher, Boman Irani comes under the supporting cast. Kudos to legends Amitabh Bachchan & Hema Malini for their cameos. The movie is set under the backdrop of enmity between India and Pakistan and the way it affects the lives of two lovers. A very old and weak Squadron Leader Veer Pratap Singh ( Shah Rukh Khan) has spend 22 years of his life in Lahore jail situated in Pakistan abandoning his freedom and happiness only for the sake of his love Zaara's happiness (Preity Zinta). A ray of hope rises in his life when rookie lawyer Samiya ( Rani) comes for the sheer reason of opening Veer's case again in the court. Major part of the film is Veer's narration of his love story to Samiya. Scenes , dialogs and Artistic direction add up to the beauty of the film. Chopra redefines the true meaning of love through this brilliance Veer Zaara. The shots taken through Punjab and Lahore are so eye-catchy and refreshing. Yash Chopra takes u on a ride in fields of Punjab, the pinds of Lahore, the snow capped mountains that charms you in every way possible. Songs touch your heart deeply. Valuable contributions by singers Lata mangeshkar, Sonu Nigam, Udit Narayan, Roop Kumar rathod, Gurudas Mann have made songs so pure and full of good-will that u literally feel the emotion in your heart. Veer Zaara will never disappoint you. Watch it for the nth time and you tend to rediscover the pure saga of love."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "DreamyGirl247",
        "review_rating": "10",
        "review_title": "An Absolute Masterpiece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "kyrat",
        "review_rating": "9",
        "review_title": "expected sappy fluff, got sentimental Romeo & Juliet type epic melodrama with political & social undertones",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rituranjanu",
        "review_rating": "10",
        "review_title": "King for a reason",
        "review_detailed_main": "I hated this man just because my gf (in 2007) said she would marry him I hated his movies to such an extent that I didnt watch them, but in last 10 days I have watched Jab tak hai jaan, Kal Ho Na Ho, and now Veer Zaara and now I know why people love him.\n\nYes, I agree I have joined the fan club specially after watching KAL HO NA HO and JAB TAK HAI JAAN, what performance man. I have just became your huge fan after seeing the level of your performances in different movies.\n\nNow I know why they call you the KING Feel pity on myself for all those years I hated you but it too was personal, I would never like a man muly gf wanted to marry. You are such a charm dear.\n\nSimply awesome!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "TharsheyN",
        "review_rating": "8",
        "review_title": "True Love Triumphs All, Even Time!",
        "review_detailed_main": "Veer-Zaara is a beautiful movie about two souls destined to be together.\n\nThe cast is amazing, with the trio of Shah Rukh Khan, Rani Mukerji and Preity Zinta once again gracing our screens. The beauty of Rani, The expression she can portray through her eyes alone. Shah Rukh Khans ability to play two very different personalities for a singular character and Preity rounding the trio off. Spectacular performances by them all.\n\nThe story is lovely, it's a fun filled adventure and one that will keep you absorbed in the movie. You will be rooting for the love of Veer and Zaara throughout the film and will never be quiet sure what's going to happen.\n\nThis movie is a old movie and it does look it, but it's still absolutely enjoyable and the colour and outfits are as beautiful as anything offered in Bollywood today!\n\nA lovely film and a 8/10 from me!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Rawal_Afzal",
        "review_rating": "10",
        "review_title": "A Bollywood classic for ages!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Shakeer-1",
        "review_rating": "",
        "review_title": "Technical Faults",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "denn_2003",
        "review_rating": "1",
        "review_title": "SRK lacks character",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "vikashsarangi143",
        "review_rating": "10",
        "review_title": "Humanity, respect and the power of love against time and circumstances..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Dream_Woman",
        "review_rating": "10",
        "review_title": "Superb!!!",
        "review_detailed_main": "This really is one of a kind movie, i have only watched in once but i loved it from the start to finish, both Shahrukh and Priety gave very powerful performances and Rani was great too. The music wow, Oh my god it;s the best piece of music that i have heard in a long time, the music was written over 50 years ago by the late Madan Mohan, i remember watching and awards ceremony a while back and the music for Veer Zaara had received an award, the late Madon Mohan's son went to receive the award and gave such a powerful speech, it borough a tear to my eye.\n\nVeer has been jailed for over 20 years and Zaara had been reported missing in this film, she was a Pakistani girl from Lahore and he was an Indian pilot, they met, fell in love but could not stay together because Zara had to marry someone else in Pakistan, anyways i don't want to give too much away but what i can say is that they get together and the ending is very emotional, it made me cry, if you haven't seen this film please watch it."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sourav-63975",
        "review_rating": "10",
        "review_title": "Beautiful Music",
        "review_detailed_main": "\"Veer-Zaara\" is a classic romantic drama that resonates with audiences for its heartfelt performances, emotional narrative, and memorable music. Shah Rukh Khan and Preity Zinta shine in their roles, portraying a love story that defies borders and societal expectations. The film's timeless appeal lies in its exploration of universal themes of love and sacrifice. Despite its idealized portrayal, \"Veer-Zaara\" remains a significant and beloved film in Bollywood, celebrated for its cinematic excellence and emotional impact. Some aspects of the story and characters are idealized, adhering to a romanticized Bollywood style. While this appeals to many, some viewers might find it overly sentimental."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ankitvashistha-04984",
        "review_rating": "10",
        "review_title": "Golden feather of srk's era",
        "review_detailed_main": "Often it's the much-anticipated films that disappoint the most, but Veer Zaara lives up to the pre-release hype.\n\nJust when you think you know where the story is going, you are pleasantly surprised and therefore enthralled as the story unveils.\n\nPeople either love SRK or hate him, but I think he delivers what is necessary for this role without going over the top.\n\nThe surprise appearances are great, and Priety Zinta is getting better with every role.\n\nLast, but certainly not least, the music is superb. If you have no other reason to see this movie, see it to know the story that was finally told with these beautiful songs.\n\n10 out of 10."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "arumallasundeepreddy",
        "review_rating": "10",
        "review_title": "\"Veer-Zaara: Yash Chopra's Timeless Epic Weaves a Tapestry of Love Across Borders\"",
        "review_detailed_main": "\"Veer-Zaara\" is a timeless romantic saga that transcends borders and captures the enduring power of love. Shah Rukh Khan and Preity Zinta deliver stellar performances, portraying a love story that defies societal and political barriers. Yash Chopra's direction is masterful, seamlessly blending poignant storytelling, soulful music by the legendary A. R. Rahman, and breathtaking visuals. The film not only tugs at the heartstrings but also explores themes of sacrifice, honor, and the indomitable spirit of true love. \"Veer-Zaara\" stands as a cinematic masterpiece, leaving an indelible mark on the landscape of Indian cinema."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "msundari",
        "review_rating": "9",
        "review_title": "Best masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Dingataca",
        "review_rating": "",
        "review_title": "Yash Raj, this one is a masterpiece.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "tirdad_555",
        "review_rating": "1",
        "review_title": "nonsense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ashishgoyal-89194",
        "review_rating": "10",
        "review_title": "Beautiful love story",
        "review_detailed_main": "There are many strong and beautiful words used and can be used to describe your movie. I loved it. Sweet, shining, nostalgic and yet gripping, in touch with reality. This movie gives a feeling of have seen something beautiful today. Somewhere life becomes richer in experience. It's just a love story but said so impeccably that it becomes dignified in itself. Music is flawless and so is acting. I have always liked shahrukh and preety and this was wonderful watching them together. Excellent work. Talent is obvious. It has the power to keep you glued and captivated. Brimming with love and pain at the same time, sometimes it becomes more than a movie, more than characters. I am sure people will remember it for a long long time."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Kaatil29",
        "review_rating": "10",
        "review_title": "SHAH RUKH KHAN'S BEST MOVIE TILL DATE",
        "review_detailed_main": "This movie taught us that love have no boundaries. A very beautiful love story of an indian man & a pakistani girl. A very emotional & heart-touching movie with great storyline,acting,dialogues & perfect songs for every moment. According to me this is the best movie of SRK(10/10)"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "kapoor_piyush_",
        "review_rating": "8",
        "review_title": "SRK being SRK!",
        "review_detailed_main": "Veer-Zara represents exceptional Veer pratap Singh(SRK) and Phenomenal Zara khan(Preity Zinta). Everything around these both characters is just extraordinary. Both the actors have performed with their whole heart and SRK being SRK brought tears to eyes. Preity was everywhere so elegant and prosperous. Apart from this characters Veer-Zara(The Film) is always completing stories. Still not succeeded in completing all the stories as we can see many characters with no shape and history. Rani Mukherji and Anupam Kher's history was just explained with few dialogues where they could have cut of some less important scenes and unwanted songs to establish the story. Many actors such as Manoj Bajpayee and Hema Malini had some incompleteness with them. Amitabh Bachchan played it in a good way so does Boman Irani and specially Kiran Kher. Overall film revolves around Veer-Zara much with some unwanted scenes which could have cut of just to establish the chemistry."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sumityoutubw",
        "review_rating": "8",
        "review_title": "Bollywood forbidden love tale",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "greendaffodile",
        "review_rating": "10",
        "review_title": "Marvelous",
        "review_detailed_main": "Breath taking movie.. Best of Best i have ever seen.. Musical blast in every frame which is impress me very much. I highly recommended to watch this movie for every fans who loves good scripted movies. No another word to say to every frame of this move had very gorgeous scenes make fans Happy. First day first show i have seen this movie. I had watched this movie in theatre naalantha WLP thatre is best viewing angle of this movie amke me ghoosepump feeling.. Great movie. Actress lokks gorgeous and very impressive acting i have ever seen. I dont forgot this movie becoz of this songs are make me very happy."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "naukriyash",
        "review_rating": "10",
        "review_title": "Romantic movie",
        "review_detailed_main": "\"Veer-Zaara\" is a cinematic masterpiece that delves into the complexities of love, sacrifice, and cross-border relationships. The narrative unfolds as an elderly Veer Pratap Singh (played by Amitabh Bachchan) recounts the tale of his friend, Squadron Leader Veer Pratap Singh (Shah Rukh Khan), an Indian Air Force officer, who meets and falls in love with Zaara Hayat Khan (Preity Zinta), a Pakistani woman.\n\nThe film beautifully captures the essence of their love, portraying the challenges faced due to political and societal boundaries. Yash Chopra's direction is impeccable, creating a visually stunning and emotionally resonant experience. The screenplay, penned by Aditya Chopra, intricately blends romance with the socio-political backdrop, offering a poignant narrative.\n\nShah Rukh Khan and Preity Zinta deliver stellar performances, infusing depth and emotion into their characters. The chemistry between them is palpable, adding authenticity to the love story. The supporting cast, including Rani Mukerji and Amitabh Bachchan, further elevates the film with their compelling portrayals.\n\nThe film's music, composed by the legendary duo Jatin-Lalit, is a highlight, with soul-stirring tracks like \"Tere Liye\" and \"Main Yahaan Hoon\" enhancing the emotional impact. The cinematography captures the scenic beauty of India and Pakistan, contributing to the film's visual richness.\n\n\"Veer-Zaara\" transcends conventional romantic dramas by addressing themes of cross-border unity and the power of enduring love. It remains a timeless cinematic gem, leaving a lasting impression on viewers with its heartwarming narrative and unforgettable characters."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "nanny_nve",
        "review_rating": "",
        "review_title": "More than just a film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ahsanvaqar",
        "review_rating": "2",
        "review_title": "Worst acting by the pathetic SRK",
        "review_detailed_main": "Yes I was so eagerly waiting for this movie and I spent 30$ to go see the movie. 20$ on the cab and 10$ on the dreaded movie itself. And it was the same old pathetic acting by SRK. I have never ever seen any man of around 50s shivering like he was in the movie and he had the same old expressions which by now everyone would have crammed. The movie itself was Yash Chopras worst. I, being a huge fan of Yash Chopra was not only let down by the great director but also scratched my head getting out of the cinema and wanted my money refunded. It had all the clichés possible in any movie and the dialogues were so over dramatic.. when are indians gonna learn how to bring reality to a movie and when are those so popular actors going to learn that acting is not equal to OVERACTING, specially that awful SRK. Priety was her typical self. Cute at times and at times just not able to carry the scenes. A great admirer of Rani, I still felt that her dialogues were poorly written. I really laughed my head off when she said that I know how much you loved her. I mean come on man .. grow up .. get out of those un realistic stupid over-dramatic scenes. Anyway with huge disappointment, I write my first comment ever on IMDb. I think this one deserved it. The only good thing in the movie was the positive message it sent about Pakistan and India and the last poem which was so poorly narrated by the dreaded SRK."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "gangutm",
        "review_rating": "10",
        "review_title": "Treat to watch Yash Chopra's work! Great acting and storytelling.",
        "review_detailed_main": "Yash Chopra's Veer-Zaara is a visually stunning and emotionally touching picture about star-crossed lovers who meet once and are tied forever. Chopra artistically combines realism with unrestrained emotion and even some overdone sentimentality. On paper, the love story itself, the separation and everything else is quite typical, but Chopra infuses it with a different energy, masterfully emphasising the respect the two leads have for each other, the honour they pay to parents and elders, and their genuine willingness to sacrifice themselves for each other. While it is a cross-border love story between an Indian and a Pakistani, their nationality is not what really prevents them from being together. The lovers connect at the human level. Phenomenally well shot, Veer-Zaara flows smoothly through the stunning views of Indian and Pakistani fields and groves, and colourfully shows the bright sides of each country and their respective people. That the film does not define a specific period of historical time makes it universally relevant."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "yashkumar-15618",
        "review_rating": "10",
        "review_title": "A beautiful heart touching love story !",
        "review_detailed_main": "Veer zaara\" was released in 2004 directed by Yash Chopra would like to say this is one of the finest movie it will always remain fresh and never get old\n\nMovie revolves around veer (srk ) and zaara (Preity) its all about their love, emotions and humanity Songs are amazing and the chemistry of srk with Preity makes the movie more special\n\nStory was beautifully scripted cast was really good including srk is as usual brillant with priety and rani did a fine job too\n\nBrilliantly directed by Yash Chopra definitely must watch."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "darklady-90077",
        "review_rating": "9",
        "review_title": "Beautiful Love Tragedy",
        "review_detailed_main": "Just watched this movie in 2024 and i can say it was a truly a masterpiece. The way Yash Chopra potrayed the tragic love story between 2 countries. The cinematography was trule beautiful. Veer-zaara is an amazing movie which gives us the lesson that don't judge anyone based on their country or be prejudice. The acting of Shahrukh khan and Preity Zinta made the movie into what it is today. Both of them are amazing actors. What truly stood out was the way the film showed the complexities of human relationships and the power of love to transcend borders and barriers. Veer-zaara beautifully showcased the resilience of the human spirit and the capacity for forgiveness, leaving a lasting impact on the audience."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "shivsutsoni",
        "review_rating": "10",
        "review_title": "Fully entertainment can friends",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "huzefanampurwala",
        "review_rating": "10",
        "review_title": "Veer SRK",
        "review_detailed_main": "Veer-Zaara (Hindi) is a 2004 Indian Hindi-language epic romantic drama film directed by Yash Chopra, who co-produced it with his son Aditya Chopra. It stars Shah Rukh Khan and Preity Zinta as the eponymous star-crossed lovers: Veer Pratap Singh (Khan) is an Indian Air Force officer, and Zaara Hayaat Khan (Zinta) is the daughter of a Pakistani politician. Veer is imprisoned on false charges, and a young Pakistani lawyer, named Saamiya Siddiqui (Rani Mukerji), fights his case. Amitabh Bachchan Hema Malini Divya Dutta, Manoj Bajpayee, Boman Irani, Anupam Kher and Kirron Kher play supporting roles."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rohit_mittal2000",
        "review_rating": "",
        "review_title": "cool and heart touching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "med77_99",
        "review_rating": "2",
        "review_title": "A total crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "suchitkhemnanisk",
        "review_rating": "9",
        "review_title": "HEART TOUCHING",
        "review_detailed_main": "Shahrukh Khan at Top. One of his Best.\n\nAs Good perfomance as it was in - CHAK de INDIA.\n\nGetting Immotional .... Good Movie.\n\nTere.. Liye.. Hum hain Jeeye.. -\nIconic Song . Good picturization."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "matrixdukenukem",
        "review_rating": "10",
        "review_title": "Legendary, mystical, pure romance that we wish was true story",
        "review_detailed_main": "We have seen/heard/read many mystical and mythical tales of romance like Romeo and Juliet, Laila Majnu, Shireen Farhaad, etc. So to title your story in a way it indicates that it is another legendary tale of two lovers that would be recited in times to come was a bold move by Late Yash Chopra.\n\nIf it was any other director at helm at that era, I would've scoffed and skipped this. But I did not rate it 10/10 because I am just another Indian who has no sense of rating movies. To me, this epic is perfect in every single sense. Casting, production, music, background score, editing, story, screenplay, dialogues, song lyrics. Every single element has never failed to tug at my heart strings every single time I have watched this. And I stopped counting after 68 times.\n\nThe 3 hour runtime, never feels sluggish. You are already immersed int the characters as soon as they're introduced. The highlight for most is of course, SRK and his portrayal of Veer Pratap Singh who loves without boundaries (literally) and Priety Zinta as Zaara Hayaat Khan, who is very likeable progressive woman. But for me the limited screen time of Amitabh and Hema Malini who play surrogate parents of Veer. Every single scene, be it cultural, romantic or emotional ... it just hits man. Boman Irani and Manoj Vajpayee have very little to do and yet play important part in the story and they do it very well. Divya Dutta is a comedic relief for the most part but her character too has an arc and plays an important part in the story due to which she doesn't feel like just a comedic relief. Kirron Kher and Anupam Kher both are another standout in their respective roles.\n\nThe twists in the movie might not be digestible for those unfamiliar with the culture and nuances of this region but they are very well done and boy do they pull your soul out of the body.\n\nA lot is said about this movie without ever mentioning the background score which is phenomenal. Every character has their own theme which is beautifully woven into the story telling. Music by the Late Madan Mohan is one of the evergreen albums in my list. After all these years I haven't gotten tired of any song. Not only it stays in my playlist always, but I also never skip any songs while rewatching this movie.\n\nVFX in couple of scenes is little questionable but forgivable. Editing has one or two goof ups but over all very solid. Dialogues are poetic in every sense. In fact, this whole movie feels like a visual poetry.\n\nLast but not the least, I strongly believe no other director could've made this film like Yash Chopra did. This could've easily been a throwaway romantic tale like many others. Or it could have been a hit but later revisited as a cringe fest like many films we grew up with. This however, shall go down in history as one of the best romance tragedy in Bollywood cinema and will always remain my most favorite bollywood romance of all time."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sweetdoct247",
        "review_rating": "10",
        "review_title": "My best Indian movie ever",
        "review_detailed_main": "Regardless of what anybody might say this movie is an excellent movie. It's my best Indian movie ever. You can see I'm rating it 10/10. Not even any American romance has been able to move like this movie, a real tear jacker.A MUST WATCH FOR EVERYBODY! I think the actors and actresses were great with such fantastic display of emotions. The singing is great too. I think Bollwood is really developing fast I think this is one of their best. I wonder if there are people this days who can really devote themselves to love just like these two people did. I think this movie sends a message to people in love out there challenging them on how far they could go with there love."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Manuja",
        "review_rating": "8",
        "review_title": "Veer Zaara is pure Opera!",
        "review_detailed_main": "I saw this movie last night. Personally I loved the film for many reasons. The only thing that I have to say against it is that it could have been slightly shorter. But this movie had an \"egde of the seat\" quality that I have not seen in a Bollywood film in a long time. The twists in the film are very good, and highly unexpected! The music was excellent. I have to dis-agree with some comments on this page that criticize the music, and claim it's not a \"catchy\" soundtrack! I think this music is right for the theme, and the character of this film! This movie has an epic quality to it that requires it to have a soundtrack that reflects this. I think the music is memorable.\n\nThis movies has a story which attempts to explore human nature, and what makes it great. The characters develop in the story to exceed their own expectations of themselves. Especially Zaara's character as we first see it, and who she turns out to be in the end. We know right from the start that Zaara is a stubborn person. But we also see her capacity for love when she goes to India to perform the last rights for her nanny despite the opposition from her family. But we see that the strength of her feelings for Veer take even her by surprise. Veer is a carefree and daring character who takes his job very seriously, and is basically a sensible guy. He's not at all \"over dramatic\" when we first meet him. Yet he falls in love and lets go of everything he holds dear. But this is consistent with his character as we see right from the start that he dosen't do things by half. There where a few scenes in this film where the humanity of the characters are shown in great depth. One of the best scenes is the one between Zaara and her father, when he apologizes to his daughter for compelling her into marriage with Raza Shirazi.But at this point we know what the motivation of both father and daughter is. One other memorable and exciting scene is, Veer and Zaara's meeting in the Mosque when Veer comes to Lahore.\n\nThe movie was well cast. Rani Mukherjee as Sammiya Siddiqui was an excellent addition to the story, and she is in more ways than one the \"Hero\" of this story. The outcome of this story is just as important to Sammiya Siddiqui as it is for Veer and Zaara. In fact they are each other's salvation.Sammiya is also a women who is trying to make it in a man's world,despite being thwarted from the likes of her opposing council.\n\nThe acting was excellent. The best I have seen Shah Ruhk do in the last 5 years! I loved his acting. He depicted great depth, and also there was good control in his acting. Very well done. Priety did justice to the role of Zaara Hayatt Kahn.Very convincing. The cameo's where excellent. Amitab Bachchan, Hema Malini, Manoj Bajpai, and Anupam Kher. Kiron Kher as always was excellent in her role. The cinematography was excellent too.\n\nAll in all, this movie is worth a watch, and if you have the chance see it on the big screen, because it does justice to the visually spectacular aspect of this movie. Veer Zaara was Operatic in it's presentation and style. It was larger than life!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "nshah07",
        "review_rating": "10",
        "review_title": "More than a love legend",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "prashant-sharma04",
        "review_rating": "10",
        "review_title": "A love legend with a message !!!",
        "review_detailed_main": "Now, what do I write about this absolutely fantastic movie......It is rich in story, content,presentation,visuals and music and has a social message too...........Hopefully, India and Pakistan will learn to live in a world of peace and amity.\n\nShahrukh is stunning especially in his new old-man look. Preity is an angel...she looks ultimate...Rani coming from nowhere steals the show in the end. Big B and Hema are great and so are the others..\n\nI would call upon all to watch this movie even for a 100 bucks. It will shower you with grand feelings ....you would be just mesmerized with the way the 3 and half epic comes to life.\n\nyash ji is a master-mind.....we all need to salute for the wonderful movie legend his he given us this Diwali which will be remembered for times to come.....!!!! A full 10/10 to Veer and Zaara."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "aatayyab",
        "review_rating": "1",
        "review_title": "Another Vain Effort By Bollywood To Justify Marriage Between Hindus and Muslims",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "suryanmukul",
        "review_rating": "10",
        "review_title": "Love is in the air and all around the world.",
        "review_detailed_main": "Veer-Zaara - 2004\n\nOh My God! Was that real? No! It's just a movie! But believe it or not, this is such a heavenly experience to watch Veer-Zaara and I can bet you want to experience this love journey again and again and again and again. Yash Chopra, all his work had been in the best categories but, Veer-Zaara is just another level. From the very start till the end, you don't wanna blink and miss any moment of this masterpiece. Veer-Zaara will own the heart of any individual who is or ever been in love, i.e. everyone, and that's the beauty of Yash Chopra's filmmaking, he knows how to connect with the audience make them love, laugh and cry. There is not a single thing in the movie which is not beautiful, story, screenplay, dialogues, music, performances, locations, whatever you see on screen is beautiful and at its best. Not many spoilers but yes it is a beautiful love story where they meet, get separated, meet again, get separated again, and then finally meets after 22 years out of unknown past situations of each other. There are special performances by Amitabh Bachchan and Hema Malini as well for, not for much of screen time, but yes, it had a great impact on the whole story, and the same goes for Anupam Kher as well. Pretty Zinta is as beautiful as the story is and did a perfect job in her character but Shah Rukh Khan, oh my god, this is some out of the world level of performance and the way he delivers the dialogues with is facial expressions and body language, that's not less than a godly thing. Yash Chopra and SRK are such a blessing to the Hindi Film Industry, and together they make perfect pair and let's not forget Rani Mukherjee doing a connecting role which is very important. And one more special thing that made it perfect is a never seen before collaborations in the music of the film, the music, and the songs are the soul of the movie that's gonna make you cry, cry, cry and happy smile in Love.\n\nThe visual poem of love and believe, This is an anytime-anywhere watch for the Love story musical drama lovers and obviously a perfect gift for SRK and Yash Chopra fans."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Can89",
        "review_rating": "10",
        "review_title": "Not a love legend, but still worth it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "husnain_05",
        "review_rating": "10",
        "review_title": "Fantastic Storyline",
        "review_detailed_main": "A FANTASTIC FILM. Shahrukh khan was fantastic, Priety Zinta was the best, Rani Mukherji was good (the whole crew were fantastic) I enjoyed watching Divya Dutta's parts as Shobho, she was funny and I liked her the third best after Shahrukh Khan and Priety Zinta. Amitabh Bhachan and Hema Malini were great and were well suited for the role. The film shows a good mixture of both cultures of Pakistan and India. The songs are nice and catchy and fitted in well considering when they were produced. The storyline was different to the normal stories. Not a typical Indian movie about 2 lovers or a love triangle. I have watched the film many times and have not been bored by it."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rebeka7280",
        "review_rating": "10",
        "review_title": "Excellent movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "varuna12",
        "review_rating": "10",
        "review_title": "Veer deserves to get Zaara..... cos they are both made for each other!!!!",
        "review_detailed_main": "Veer deserves to get Zaara..... cos they are both made for each other!!!! What a movie!!!! What a nice compilation of music!!!! I love this movie simply because its the best!!! I know i know there are many technical flaws in the story but who cares!!! Its a love story, its fairy tale based in reality, for god sake, its a movie!!!! and i know there are no mountains etc between Lahore and Amritsar or whatever but its a movie and not a documentary on Discovery channel!!! Its a brilliant piece of movie making and i m 23 now but i will be forcing my kids and grand kids to see this movie!!! Veer Zaara teaches us about love and loyalty and respect for elders!!! It teaches us that there is more to us humans then simply our jobs, money and international boundaries and their disputes! I just hope and pray to god that if there are really any real life Veer and Zaaras, may they shud be together as soon as possible!!! Love and mutual respect and pining for any two people is bigger then anything cos these are human values...... and i believe human values should be higher then any religion crap etc!!! Veer Zaara is a movie that i can watch again and again!! The cinematography may not be perfect but it has managed to capture the real sub-continent very well!!! The songs and especially vocals of Shri Shri Lata Mangeshkar jee are just divine and Gurdas Mann has made the track even more likable!! Overall best music in last 5 years!!!!\n\n!!!!!!EVENTUALLY LOVE WILL ALWAYS CONQUER EVERYTHING!!!!!!\n\n***************************AVOID VIDEO PIRACY**************************"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "shivakumarvishwa",
        "review_rating": "10",
        "review_title": "A beautiful love epic",
        "review_detailed_main": "This is one of the best movies ever.This comeback is superb from Chopra.The script is excellent.The editing is brilliant.The story is a cross border romance.It starts when Samauiya Siddqui is ready for her first case.She meets Veer.Who has been in prison for 22 years.He tells her he was in love with Zaara a Pakistani girl.She is going to(I FORGOT.Anyway Veer mets her fiancé.She leaves.One day he is mistaken for a person named Rajesh and is arrested.He is neitherr spoken a word.The flick is a true MASTERPIECE froom Yash.Who made a comeback after Dil To Pagal Hai 7 years.Shahrukh was excellent.Preity was excellent too.Rani was excellent.The others supported well.The cinematography is Excellent.The songs by the late Madan Mohan is a Masterpiece.A MUST SEE RATING-10/10"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "lediscipledessocrates",
        "review_rating": "2",
        "review_title": "That's it Folks , Our Era is Past : SRK, Preity Zinta and Dubious Romantic Flicks",
        "review_detailed_main": "This is a movie featuring Ghosts and made by Ghosts. People who have exhausted their quota of ideas and more importantly their USP's .\n\nDirected by Yash Chopra . Featuring Shahrukh Khan in a Romantic role, Priety Zinta as a bubbly wench and Rani Mukherji as the conscientious damsel.\n\nA weak plot. A screenplay steeped in uncommon drudgery and marked by mundane catch lines.\n\nPerformances below par. Shahrukh is not at all impressive in what he does. This I say, because Shahrukh 's entire career is pivoted on similar roles , where he has done better.\n\nPreity Zinta looks pale and flabby. No charisma on her face. Her acting is BAD.\n\nRani Mukherji,she has done justice to her role. She's not great but not all that Bad.\n\nThe supporting cast is impressive on paper. Amitabh Bachchan, Anupam Kher,Divya Dutta, Hema Malini,Manoj Bajpai, Boman Irani, Kiron Kher....oh my God! It reminds me of \"The Longest Day\".\n\nIn the movie however only a few of them perform. Hema Malini, to begin with is perhaps the widest chink in the entire cast. The director was wise enough to have made her character a South Indian woman married to a Punjabi, otherwise she would have found herself in the shoes of Katrina Kaif in an undubbed performance.\n\nManoj Bajpai 's character is a character devoid of reasonableness and logic. Vindictive without reason and malignant without cause. He couldn't have done any better than he did in the movie to play this role.\n\nKiron Kher redoes her type cast role of a concerned mother sans the usual jocular vibes.\n\nAmitabh Bachchan does a great job of playing a true Rural Punjabi Patriarch showcasing brilliant linguistic skills and body language. For me the best actor in the movie.\n\nAnupam Kher was also good as the cold and conniving lawyer who is also arrogant .\n\nBoman Sahab. He is a fine actor. I like him.\n\nThe show stealer however was Aditya Chopra for giving us an extremely ordinary story, poor screenplay and top it all the shallow, amateurish poem (devoid of rhyme and meter) recited by Shahrukh in a most unconvincing manner at the end of the movie.\n\nAll in all a movie which was made to celebrate the director's historic career , but which hardly leaves a good impression.\n\nP.S. a guy sitting in the front row wouldn't wake up when the show ended . I was afraid he had collapsed due to the incoherent motion picture he just saw , thankfully it was just a case of movie hall slumber."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Shlomi26",
        "review_rating": "10",
        "review_title": "wow!!!",
        "review_detailed_main": "good movie! i love the story... The movie was fantastic. I was impressed by the message that the movie gave to Pakistan, it would be interesting to see if it would be reciprocal. The acting of all actors was superb, and the best was Shah Rukh Khan, naturally. The storyline was also very touching and I would like to say \"Yash Chopra has done it again\". A must see for those who have not seen it. this film was reel God and i mean reel God bcoz I'm NT easily won over. it had some of the best acting iv seen to date and the story was reel touching as well. Shah Rukh Khan was amazing, probably his besT acting so far and pretty was just as good. Rani Mukherjee wasn't any less of the others. there will b very few ppl who would say this film is a waste of time but for those of uhu haven't seen it, go and watch it. i know u wont b disappointed!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ravenfire699",
        "review_rating": "10",
        "review_title": "amazing",
        "review_detailed_main": "This is the first Indian movie I have watched, my husband is Pakistani/Indian and convinced me I would cry my eyes out with this movie. I thought with my short attention span and a 3 hour subtitled movie there was no way I could pay attention long enough but I watched it anyway and I have NEVER in my life cried so hard! It is the most beautiful, romantic love story I have ever seen....EVER! What I loved about this movie is it's completely pure, no kissing, no intense sex scenes that are in all American movies, I can watch this with my mother and step dad without feeling uncomfortable. The story is so touching and beautiful and shows how far people will go for true love, true love never dies."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "anant_mathur",
        "review_rating": "9",
        "review_title": "Instant Classic",
        "review_detailed_main": "INSTANT CLASSIC...those are the only words needed to describe Veer-Zaara. Yash Chopra promised a new love legend and boy did he deliver. This movie is totally Aditya Chopra's baby. I know Yash Chopra has directed it and I don't want to take anything away from his talents, he's one of the best directors in the world. But Aditya Chopra who wrote the story, dialog and screenplay deserves his due. How I wish he had directed Veer-Zaara. This is totally his baby.\n\nFrom the opening scene to the closing scene...you're in awe of this wonderful story of love and friendship. All the war movies released in the last few years claimed to be showing the friendship between India and Pakistan and yet when you watch them you realize they have nothing to do with friendship. Veer-Zaara is not a war film and yet it showcases the friendship from a humanity standpoint. What a great sub-plot.\n\nNow for the performances...Even though Shah Rukh Khan has been winning awards for SWADES. I think he did a better job of acting in Veer-Zaara and Main Hoon Na. SWADES has him playing the same character as always. Veer-Zaara and Main Hoon Na had the scope of showcasing something different and I think he should have won for one of those. His role is Veer-Zaara has him playing Squadron Leader Veer Pratap Singh; the role seems tailor made for Mr. SRK. He goes through even the most difficult scenes with ease, which shows how talented he really is.\n\nPreity Zinta, if there's one actress who gets better with each performance, its miss Zinta. She is just a sight and a treat to watch in this film. And trust me, long after the show is over, if there's one name you remember from the film its Zaara Hayaat Khan.\n\nRani Mukherjee is another actress who everyone loves to watch on screen; with Veer-Zaara she proves that the size of the role doesn't matter it's how you portray the character that will have people remember the character. We'll always remember Saamiya Siddiqui.\n\nSince we're talking about characters, we can't go on without talking about Divya Dutta, she's simply amazing in this film. The role is made for her; no one else could have pulled of the character so well.\n\nThere are lots of cameos in the film; I'll leave those to your imagination, just in case you haven't seen the film.\n\nThere are so many things you can talk about when you speak of a film like Veer-Zaara, but the bottom line is its top quality. You won't find many films like this. In fact, I doubt that you can.\n\nOn the whole, it's a wonderful family film and also the perfect date movie. So no matter who you are...IT'S WORTH THE MONEY...so watch it!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "gurpreet_monkezrule64",
        "review_rating": "10",
        "review_title": "Veer Zaara",
        "review_detailed_main": "Oh my gosh people this is the MOST ROMANTIC lOVE STORY EVER I LOVED this movie sooo much Yash Chopra is amazing director!! This love story and movie made me cry sooo much, I LOVED IT, it was sooo sad i would love to see it again and for those who have not yet seen it i highly advise you to go and see it. ALL U MEN OUT THERE TAKE YOUR WIVES GIRLFRIENDS FRIENDS TO SEE THIS THE GIRLS WILL LOVE IT I KNOW I DID!!! I LOVE IT IT IS SAD IT IS A MOVIE TO CRY IN!! This movie is very romantic and i think you people would love to see this movie it is very sad and i love it it will make you girls cry like it made me cry i know each one of you will love it. So go out and go see this movie!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sameerkhan666",
        "review_rating": "9",
        "review_title": "Cross-border love",
        "review_detailed_main": "A heartfelt and borderless love story between an Indian Air force officer and a Pakistani girl from a political family. Manojpayee was portrayed as a villain, but his acting was very good. Divya duty, who played a Pakistani maid, Shabo, speaking in fluent Punjabi and acting like a country girl made the movie more interesting and real. Another special performance was of Rani Mukerji, whose character was my favorite, she was a Pakistani lawyer, concerned about women's rights in Pakistan and about a prisoner who is numbered 786, she thinks that bismillah's name for an Indian prisoner who is a non-Muslim show that the prisoner is Godly person and not a criminal. The prison officer who was Mishra jee, made me think of Pakistani police officers who use the word bibi and have a mustache and that appearance and character. They showed Pakistan in a good light, with no stereotypes, everything seemed to be real, and I really connected with it. Except for one stereotype of doing salaam in an adab position. But else was so good. Indian Punjabi setting was also very heartwarming, the way Sikh people are kind and down to earth, Lori festival and village life with lassi and turban. The city of Lahore was emphasized, with a very nice setting and backdrop. Lata Mangeshkar's song Aisa Des Hai Mera, was uplifting and enjoyable, especially when Preity Zinta sang along with Shah Rukh Khan in the chorus that how she has learned about his country and seen it, it looks familiar to her, mornings and evenings all same, such is her country, just like his country. They have shot the movie on the Wagah Border too. The overall movie was a good message for promoting peace and harmony between India and Pakistan."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "niaz_islam",
        "review_rating": "8",
        "review_title": "Must Watch",
        "review_detailed_main": "Frankly i did not wanted to watch this movie. as it starred SRK, Rani. And it was not even an action movie. I can tolerate SRK in an action movie because there everything happens too fast to see his actual acting.\n\nNow about the movie, one line, I was fool not to watch this movie in the first place. And I also thank my friend Maruf because for him I watched this movie. The plot ,script, placement, acting and everything was so strong that I could not took a break from it. The plot was practically flawless, the dialogues are well written, and actor - actresses delivered them quite nicely. After a long time I watched a so meaningful , near the truth Indian movie. Hats off to every one who was even remotely attached in the making of this movie.\n\nFinally , I thing bothered me is that performing one particular custom in the and made the movie slightly biased to one race, except that the movie is too good to watch. I recommend it every one."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "meghal",
        "review_rating": "5",
        "review_title": "Women's lib!!!!!!!!!!! at last",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "psynet-commander",
        "review_rating": "10",
        "review_title": "Great Idea, great acting, worth adding to personal library",
        "review_detailed_main": "Entertainment Value = 10/10 (As long as you were not hired to rate the movie for history channel, you'll be thoroughly entertained)\n\nStory = 10/10 (Grand idea; don't know if it has happened in real life or not, but grand nevertheless. I'd compare this movie to Titanic if Titanic wasn't based on real events)\n\nScenic Value = 8/10 (Many beautiful shots but nothing out of this world)\n\nActing = 9/10 (-1 point because SRK overdid the shaking a bit)\n\nAccuracy = 8/10 (Accuracy score would have been lower if it was a documentary or based on a true story)\n\nWARNING: Next line may contain a spoiler.\n\nSpecial Effects = 4/10 (Come on. A toy bus covered with genie flames?. Strangely though, in a grand story like that, that didn't hurt as much since it wasn't significant compared to the other emotions)\n\nMusic = 10/10 (You can listen to this music over and over again and replay the movie in your mind)\n\nDirection = 10/10 (Yash Chopra really knew how to touch people)\n\nOverall = 10/10 (I don't watch too many Indian movies anymore. I go for only movies that people can't stop talking about and I'm glad this one didn't disappoint)."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sukhzen",
        "review_rating": "10",
        "review_title": "A classic romantic Masterpiece",
        "review_detailed_main": "One of the best works of god old Yash Chopra. I missed him for the last few years.\n\nVeer Zaara is not just about romance or love. It is the story of two lovers who are first of all amazing loving humans. Ideally put by Samia, \"Yeh khuda ke roop mein insaan hain yaan insaan ke roop mein khuda\".\n\nThe film has not been appreciated by many coz nowadays people want to identify themselves with characters. I certainly cannot identify myself with Veer. But am I inspired by Veer or what!! Veer and Zaara are characters which inspire you. They make you want to be better people. And that is enough for me to love them and the film.\n\nIt has been a long time since such soulful music has been made. Madan Mohan's music recreated by Sanjeev Kohli is magical. Javed Akhtar has worked wonders with the lyrics. Lata Mangeshkar is still the nightingale of India. I felt that 'Tere Liye' is the best situational song ever written. 'Do pal' is another classic.\n\nSome viewers say that it is too emotional. But then Indians are emotional people. Yeah I cried. I wept in the second half. there is one scene that just overwhelms you. Kudos to Preety and Yash for creating such a stunning sequence.\n\nThe film has built a bridge between borders. India and Pakistan are no longer enemies in Bollywood. Thats the icing on the cake!\n\nWatch the film and if you do not carry a handkerchief like i do, make sure you have tissues..."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "chanakaamunugama",
        "review_rating": "10",
        "review_title": "A great film",
        "review_detailed_main": "I first watched this when I was a teenager and still I'm addicted to this film. Music,lighting,dialogs,acting and almost everything is great on this film. I must mention about directing too.Yash Chopra has done a very good job. I think this is one of Shah Rukh's best works. And the story, It's apart from those ordinary plots and I think it has a good storyline. It flows well and I can say you will watch this in one sit. And I must say songs in this film are marvelous. They were sang by the best singers like Sonu Nigam,Latha Mangeshkar,Udith Narayan. Also lyrics written by Javed Akthar is great, you can feel it in your heart. So overall I think this film is one of the best films in Bollywood."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "alexdeleonfilm",
        "review_rating": "10",
        "review_title": "A monumental work by Yash Chopra, Bollywood's most monumental director",
        "review_detailed_main": "VEER-ZARA (2004)\n\nA monumental Indian film landmark Viewed at the Budapest Bollywood film week, October 6-12, 2016. Veer Zara is the story of the undying love of star crossed lovers, Indian air force officer Veer Pratap Singh, and Pakistani bride to be, Zaara Khan, separated for twenty years while he is in a Pakistani prison on a trumped up charge, -- and the relentless battle of a young Pakistani attorney to correct this injustice and restore him to freedom. The drama hinges on the fact that the Indian prisoner has been deprived of his identity and has remained silent all these years while being addressed only by a three digit number \"Prisoner 768\".\n\nThe breakthrough leading to the unraveling of the mystery behind his silence comes when fledgling female attorney, Saamiya Siddiqi, (Rani) investigating the case, addresses him by his real name for the first time in twenty years. A bit far fetched as a basic premise but the story itself is so gripping and the performances of all players is so compelling that any narrative far-fetchedness is ultimately justified. (Try to remember, it's just a movie !)\n\nDirector Yash Raj (who died at age 80 in 2012) was the master of richly staged romance and Veer Zara is possibly the pinnacle of his brilliance in both areas ~~ staging or mise-en-scène, and heart rending romantic drama. In addition this film has three big Bollywood stars at the peak of their physical beauty and charm, (Sharukh Khan, Preity Zinta, and Rani Mukerji) as well as two older superstars, Amitabh Bachchan and Hema Malini - in star supporting roles that are like a flashback to the Bollywood golden age. Their lengthy interlude section of the film, back in the hero's home village in Punjab, when SRK brings Zinta \"home for a day\" is almost a complete film by itself. In addition to all that, this picture is on a political level, practically a plea for the reunification of Pakistan and India.. The fact that a major character, the Pakistani defense attorney (Rani Mukerji, never more beautiful) is presented as such a highly sympathetic figure is already a major step in the direction of reconciliation with Pakistan. In general most Pakistanis are shown in a favorable light and it is personal circumstances that are to blame for the tragic separation, not the character of the country. Another most important plot point emphasizing the underlying cultural unity of both countries is the fact that an old lady born in Indian but having lived most of her life in Pakistan, wants, as her dying wish, to have her ashes scattered in the Indian waters of her original home town.\n\nHer deathbed wish conveyed to granddaughter Zara (Zinta) sets the entire story in motion and once Zara takes off with the ashes for India there is no turning back. Chopra's direction is unerring, one might even say inspired, as he creates. among other things, a visual and musical ode to the beauties and bounties of his own native Punjab. The actors themselves seem to be inspired by something beyond mere professional role playing -- a kind of quasi religious obligation to reach out to their soul brothers and blood brothers across the border. In short, this is a great motion picture attaining.epic levels of drama and significance. A major landmark of Hindi cinema.\n\nThe structure of the film, as a series of flashbacks from a prison cell, then the Punjab interlude, and finally the courtroom drama and miraculous reunion of the lovers after a separation of 22 years, makes it into a three movement symphony with echoes of GWTW. And RANI is soooo beautiful! Everything comes together in this Epic Romance -- and epic is the word for it, starting with the cliff hanger helicopter scenes -- Rani vs her former mentor Anupam in court-- Rani visiting her fathers grave and pledging to carry on his incorruptible judicial work ~ at the beginning and almost at the end, but it actually ends at the border -- with Shahrukh and Preity going \"home\". The very complex time insertion within insertion structure comes out right In the bitter- sweet happy ending after three hours of agony and ecstasy. The director's son, Adita Chopra, wrote the intricate but arresting screenplay -- The actor who plays Zinta's betrothed and nemesis of SRK was Manoj Bajpayee, who would later star in Gangs of Wasseypur in 2012."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "manikagarwal2",
        "review_rating": "10",
        "review_title": "love unleashed..",
        "review_detailed_main": "Truly a divine piece of work by none other than the great yash sir,who may not be amongst us but by movies like this ,he has left a legacy which will never b forgotten.. I feel honored as well as choked at the same time while writing about it.. It ain't something that can ever be described in words.. Its an experience, a feeling that remains even after the movie is over.. A masterly stroke & having watched all his romantics, I would like to point it out as one of the top 5 romantics our Indian film industry has ever produced... Its so artfully done body of work, every angle, scene is full of love.. Anyone can make a comedy or an action movie but when it comes to romance, leave it to the master.. And assisted in making this such a beautiful poetic voyage is a team of actors, composers,singers,lyricist,background scorer, dialogs writer& not to forget the cinematographer, capturing hues of rural India in colors never seen before... Great work sir..\n\nNot to forget the rechristened times of the late madanji, made alive & so mesmerisingly done by his son with music that captures the mood of the movie with aplomb.. Equally charming are the lyrics by Javed sir who by his wordings tel so much about the movie, the emitionsof actors portraying them, especially that \"aisa desh hai mera\".. Credit to uditji for his versatile melodious voice ... Adi sir we need more of those type of dialogs from you,you have given some memorable ones here...\n\nAh, SRK, he is not called the king of romance for nothing with fan following that is unmatchable.. What a lovely performance he gives., he carries the movie on his shoulders. Especially notable is a friendly banter between him & amitabhji, ones with his lady love... Even pretty lass guys the bill perfectly with her innocent beauty & matches SRK step by step.. Amitabhji , sir I never knew you could speak punjabi so fluently, in a small role, he leaves us with a lasting impression ,with his exuberance & screen presence& in fact gives a more powerful performance than SRK.. Rani too shows why she ruled the industry with her subdued supporting role..\n\nIn fact that separates a good director from any other director, getting all your stars to give it their best... If you tend to give it a miss, it will be an insult to the great man .. A lifetime of an experience.. Love unleashed..."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "jeffericon",
        "review_rating": "10",
        "review_title": "Fantastic Movie; Amazing Songs!!!",
        "review_detailed_main": "I am a South African of Indian origin and have watched many 'Indian' movies for the last 35 years or so and this must rate as one of the best 'Indian' movies ever. I've listened to the songs before i've even heard of which movie it originated from and absolutely had goose-bumps watching the movie and hearing the songs which i had already considered my all-time favourites! I have never come across any other movie which had so many haunting melodies in one. The climax to the movie was totally unexpected which is different from so many of the mainstream 'Indian' movies where the ending is totally predictable. My one and only gripe with the movie is the deletion of the song 'Yeh Hum Aa Gaye Hain Kahan (Where Have We Come?)' which i consider to be the best song in the movie. Hats off to Javed Akhtar for the amazing lyrics. Which other movie had songs that you could listen to after hearing them a thousand times and still be absolutely bedazzled by them? Hats off to Shahrukh, Preity, and Rani. Was never a Shahrukh fan until this movie. Was never a Preity fan until this movie. Well done Yash and the gang!!!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "zakali4u",
        "review_rating": "4",
        "review_title": "shabbo was brilliant",
        "review_detailed_main": "The plot was good but both Rani and Shahrukh let this film down. Divya dutta who played shabbo shone brightly. Top marks for her! However once again the film had potential unfortunately it was casted very poorly.We all know Shah Rukh Khan is not a good actor under pressure. He can pull of easy more comfortable roles as they are not demanding by the film. But this film demanded an actor who can act beyond himself. Shah rukh failed to do that and failed this movie. He must attempt to better himself by playing less of the standard roles, I acknowledge they are giving him hits but thats a tribute to the style of film. Romance and Family films with a few stars are major hits no matter of the performance. I can think of a few actors who would of done themselves credit Salman, Amir as well as some others and the newcomer Arshad Warsi can successfully portray themselves in any role. Shabbo would have been better leading rather than preity."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "abarain",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Probably greatest cross border love story movie ever made... Cast of this movie was ahead of its time and so was the acting.. Simply amazing👏👏👏"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "MananShah-1252",
        "review_rating": "10",
        "review_title": "Pour Love Story Full Emotions.",
        "review_detailed_main": "It's a Masterpiece in Love Story.. BGM and whole album of Music is Melody. Shah Rukh Khan is Fabulous.. Best Romantic hero ever seen. Everything about Emotions & Pain of the love."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "munirkhan12",
        "review_rating": "10",
        "review_title": "A Perfect love story.",
        "review_detailed_main": "I have seen almost all the movies of Srk. I think this is best work of Srk. I would reckon this the best romantic movie ever made in the history of Bollywood. The acting level of Srk in this movie is unprecedented."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "GypsiB",
        "review_rating": "10",
        "review_title": "Well-Written and Well-Acted Romantic Drama",
        "review_detailed_main": "After 22 years in a Pakistani prison, Hindustani Veer Pretap Singh (Shah Rukh Khan) is assigned a novice lawyer, Saamiya (Rani Mukerji), to review and represent his case. Having remained silent for the years of his imprisonment, he opens up to Saamiya and tells her the story behind his arrest: the love story between him and a Pakistani woman, Zaara (Preity Zinta).\n\nThe plot of this romantic drama is gripping, moving, and mostly believable. It portrays Pakistan-India relations sensitively. The music is average and above, with some enjoyable choreography. This is a gorgeous movie, with both costumes and scenery that were breathtaking. Khan and Zinta have excellent chemistry and were entirely convincing. Mukerji played the uncertain but determined attorney well. Amitabh Bachchan and Hema Malini were cast as Khan's parents, with Kirron Kher as Zaara's mother; the three were, naturally, fantastic. The cast also includes Divya Dutta, Anupam Kher, Zohra Sehgal, and Manoj Bajpayee, all of whom gave solid performances. Overall, this is a wonderfully written and acted film, and I highly recommend it."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "indicoid",
        "review_rating": "",
        "review_title": "I hate to like this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "valerie-josephine",
        "review_rating": "10",
        "review_title": "Heart Warming film.",
        "review_detailed_main": "Excellent film. A film that lets people of any race color or creed, know that nothing is impossible when you have faith in God. I sometimes wonder when the actors like Shah Rukh Khan, Rani Mukerji, Preity Zinta go to bed if they ever dream or realize the impact they have on people's minds and hearts. We live in a world where there is so much violence.... A film of hope and love does so much for the soul. If ever the actors would read my humble letter (after veer Zaara for me nothing is impossible) remember the honey foot prints you leave in the souls of men and women, cannot be expressed by words. Shash Rukh Khan you are a very heartwarming actor. Sometimes when I look at your films I get the impression you are not acting but the film is you and you are the film....This email is from an ordinary lady who would like to say to you A great big Merci for Veer-Zaara. Thank you for a new tomorrow from my heart to yours. You have facial expressions that are beyond Compare. To the producer (Yash Chopra the Love Man) When you were born, heaven must of been missing an angel. Veer Zaara could not be imagined by any human being who is not sensitive. What a gift you are to people.... Merci"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "nikhil-tripathi",
        "review_rating": "10",
        "review_title": "Simple Great Movie, best work comes up in the last movie(of Yash Chopra)",
        "review_detailed_main": "A must watch movie for all emotional people .... real efforts could be seen in field of direction. Script is very nice. \"Love is all about sacrifices\" ... how well the theme comes up all throughout the movie.\n\nThe story despite being predictable is presented real well. Every artist has done fair justice to his/her character. Priety zinta is looking very sweet.\n\nThe best strength of the movie is its excellent direction and melodious music. Lyrics of all songs are meaningful(not like many songs of present days). What could i say more, Box office will speak the rest. Those in doubt must watch it to remove any and every."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "infinitelyprolonged",
        "review_rating": "5",
        "review_title": "Just yet another Yash Chopra flick...nothing new!",
        "review_detailed_main": "I just can't fathom what most people have seen so special in this movie. Almost all the actors ham, including Amitabh Bachchan. The plot is ludicrous and filled with holes. It goes on for an eternity. The songs are probably the worst in a Yashraj Films' production, barring a couple of good ones. The theme is commendable, but I think that is probably the only thing worth mention. The low of Shah Rukh Khan's acting in this movie is worth contrasting with the high in Swades (released a few days later). Yash Chopra is only interested in making full use of every scene's potential to extract tears from the viewer or trying to justify the 'epic' adjective by adding signs of opulence and grandeur. One of Yash Chopra's worst, and I normally like his movies, even the ones where there isn't much of a story."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Herag",
        "review_rating": "",
        "review_title": "Makes up in length what is lacking in breadth.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "bhavish",
        "review_rating": "10",
        "review_title": "10/10!!",
        "review_detailed_main": "Great story, great acting, great music, GREAT EVERYTHING!!\n\nI cannot believe the rating of this film here on IMDb! This is one of the best (if not THE best) films i have ever seen. I hate to over hype a film for anyone, but i feel the comments and the ratings here may put a few people off from seeing this masterpiece.\n\nOK, so if you hate romance stories or haven't got an emotional bone in your body, don't bother going to see this. Everyone else should be running to the cinema...\n\nWhen it comes to emotional/dramatic love stories, you cannot beat the Yash Raj banner. If you loved Mohabbatein, KKHH, K3G etc.. you will love this! Although i have to say this is a more grown up story without the usual (terrible) comic relief interludes. You won't even notice the 3+ hours pass.\n\nI know at least 20 different people who have seen this movie and none of them would give this less than a 9!\n\nGive it a chance, you will not be disappointed."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "super7577",
        "review_rating": "9",
        "review_title": "Yet another masterpiece from Yash Chopra..",
        "review_detailed_main": "I fail to imagine what drives Yash Chopra to carry on producing and directing such beautiful movies. His love and passion for romantic cinema is reflected wonderfully in Veer Zaara, a tale of selfless love and sacrifice transgressing culture, class and international boundaries. It is a poignant and deeply moving story, well scripted and brilliantly directed. From the loud and boisterous first half lavishly decorated with song and dance sequences to the tragic and sentimental second, the director weaves a carefully crafted thread through the entire movie, gripping the audience before driving them to tears towards the finish. It feels like a breath of fresh scented air among the usual mindless and tasteless products churned out of Bollywood."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "himoundary",
        "review_rating": "9",
        "review_title": "One word - AWESOME!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "harisinghsandhu",
        "review_rating": "10",
        "review_title": "Veer Zara",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "urmapravat",
        "review_rating": "9",
        "review_title": "Love is life.. life is love..",
        "review_detailed_main": "Masterpiece.. what a work srk...I love it fantastic.. brilliant.. superb job"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sandhirflora",
        "review_rating": "5",
        "review_title": "Veer Zaara",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "indicoid",
        "review_rating": "",
        "review_title": "I hate to like this...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "yashgup-84360",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "Best Bollywood movie ever Best acting by SRK Best acting by PZ Best direction"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "keithl-4",
        "review_rating": "9",
        "review_title": "Excellent Romance",
        "review_detailed_main": "I'm not Indian, nor a Shah Rukh Khan worshiper, so no reflexive \"10\" from me. But if you like romantic musicals such as Tom Hooper's \"Les Misérables\" (the Hugh Jackman version), and can find 3 1/2 hours to watch a movie, you'll smile and sniffle some tears for Veer-Zaara.\n\nI dislike high pitched nasal playback singers, decades in prison to justify old man makeup, ... oops, ran out of complaints. Veer-Zaara is subtitled in English (a few misspellings). Great for me (with hearing loss), perhaps distracting for non-readers.\n\nIndian cinema is melodramatic (but so is Victor Hugo), and probably seems corny to a jaded Manhattan sophisticate who can't feel simple joy without their therapist's approval. They should watch \"Mother India\" and feel noble. Veer-Zaara is a well-made snuggle-with-your-sweetheart movie instead.\n\nWe sent this as a Christmas gift to our niece Zara (!) and her husband. I hope they can follow the story with a dozen interruptions from their toddler daughter. Maybe they will finish it after she leaves for college, and my wife and I are gone. They'll appreciate the irony.\n\nRead other reviews for spoilers, analysis, etc. If this helps you decide yes or no, I'm done!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sreepadamamatha",
        "review_rating": "10",
        "review_title": "Excellent movie must watch!",
        "review_detailed_main": "Fabulous movie , must watch movie for everyone, and was the movie which made me fall in love with SRK.\n\nEdit: Well my one liner review was quite biased towards SRK.\n\nThis film is excellent in each and every department. From acting, songs, dialogues, cinematography, direction - all perfect.\n\nThere are not enough words to describe how beautiful this film is in every way. It's a must watch.\n\nProbably my most favourite film of SRK as it is the only film in which SRK's character is charming, a true gentleman, a good son, doesn't tease the heroine, is not mean to anyone and is most selfless. A thing of dreams."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ramaragavendra",
        "review_rating": "9",
        "review_title": "Best Love Movie !!",
        "review_detailed_main": "If you want to know what the true love is?, then, this is the definite movie to watch !!! The director explained the movie in such a way...mind blowing performance done by every one...! Kudos to the entire team !! Love is not simply for enjoying the life, but, it is scarification between two true persons !!!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ajmalshekeb",
        "review_rating": "10",
        "review_title": "What a film",
        "review_detailed_main": "Outstanding acting, great story line, motivational, inspiring, true meaning of Love."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "bhagyamahaan",
        "review_rating": "10",
        "review_title": "Superb movie",
        "review_detailed_main": "Yash chopra and srk did a great job again!\n\nOne the best romantic movie with good story.no doubt srk is epitome of romance and romantic film."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "anitadaniel-16255",
        "review_rating": "2",
        "review_title": "How old are they exactly?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "starry-eyed-potter",
        "review_rating": "",
        "review_title": "manoj bajpai is underutilised *spoiler*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "prateekmishra-61043",
        "review_rating": "10",
        "review_title": "Love is real all else is fake",
        "review_detailed_main": "The best thing that this movie conver is the projections of emotions up to the brim,deep moral messges nd an unconditional love,not just to that girl but from eveyperson in the film,it had showed that even the merciless enemy can be shamed if ur intentions nd emotions are true, I had inculcated much deep conciences from watching this film in my life,it give pleasure to my soul, Nd if that's not worth it nothing is, A heartless man can only critisize this,those betray others nd filled with all types of agony for others had filled with guilty nd that guilt had fled in the name of comments Sorry these may look like bigotry,but some things should be respected Love this movie"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "nanusharma-91454",
        "review_rating": "10",
        "review_title": "Good entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "muhammedhabi",
        "review_rating": "10",
        "review_title": "Another Mind blowing Movie from Bollywood",
        "review_detailed_main": "I am speechless be seeing this masterpiece.. Absolutely stunning performance from SRK and preity zinta ( Veer and Zaara ). What an emotional storyline. Really loved it!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "cemreesensoyy",
        "review_rating": "10",
        "review_title": "Perfect movie",
        "review_detailed_main": "This movie one of my favorite movies.There is nothing to say. just watch and see."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "fzzyhead",
        "review_rating": "10",
        "review_title": "Powerful!",
        "review_detailed_main": "Was reluctant to watch this because I knew It would make me cry. Well, did I ever. Wonderful acting by SRK and Preity Zinta, also love Rani Mukerji, Amitabh Bachchan and Hema Malini. Great cast altogether. Don't pay attention to the negative reviews...there are people out there who have to find an avenue for their hate. This is a wonderful movie, but it will make you cry...that is if you have a heart"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "prateekkaushal-62764",
        "review_rating": "10",
        "review_title": "SRK",
        "review_detailed_main": "Srk's ending speech will take your eyes to tears ......."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "therisingpolestar",
        "review_rating": "4",
        "review_title": "Zaara is miscast!",
        "review_detailed_main": "Something really bothered me while watching this one and I realized it was Zaara. Nothing against Zinta, she usually looks good and performance okay. But Zaara was supposed to be a stunning pathani beauty, I imagined EX be much younger, taller and fresh. Preity's look seems tired, older and not So fresh, maybe something to do with all that extra Botox in her forehead. I was too distracted by the protruding eyebrows. Not to mention the insipid chemistry between Zinta and SRK. While not a great actor, they should have cast Aishwarya Rai as zaara, at least she'd have looked the part and has some chemistry with shahrukh. I read somewhere that the role was originally written for her but later replaced with Zinta due to Rai's ex boyfriend Salman's behavior on the sets of chalte chalte. Otherwise the movie is regular Yash raj fair and there's nothing new in there. Music is absolutely stellar"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "arifwaqar",
        "review_rating": "",
        "review_title": "All art is propaganda but all propaganda is not art",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "anshupramanik-56135",
        "review_rating": "9",
        "review_title": "Masterpiece-ever and forever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sa_a",
        "review_rating": "9",
        "review_title": "The best of Mr. Yash Chopra",
        "review_detailed_main": "Veer Zaara- 2004 Director: Yash Chopra\n\nA movie with a lot of emotions. People either love Shahrukh Khan or hate him, but I think he delivers what is necessary for this role without going over the top. He is undoubtedly the King of Romance but we should not forget the backbone of this movie and the one who made Shahrukh the King of Romance. He was none other than The great late legend Mr. Yash Raj Chopra. Love poured in everything he did from film-making to his relation with his family, friends and film stars.\n\nPriety Zinta did justice with her character with intense emotions and amazingly fine acting. It was a really spectacular movie! The cinematography, music, songs, colors, acting and 'second to none' story were instrumental in its being. It was one of the best film of its time. \"Hats off\" to Yash Chopra and his team for directing yet another masterpiece!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "mel-301",
        "review_rating": "10",
        "review_title": "Two best movies until now in the XXI were made by Yash Raj",
        "review_detailed_main": "I write this as some perhaps unnecessary opinion to other Veer-Zaara articles in this space, as I think that \"Veer-Zaara\" and \"Kaal ho Na Ho\" are the best movies in my opinion I have ever seen in this XXI century. There are many opinions about the new \"Ta Ra Ra Pum Pum\" saying it is nor as good, of course Yash Raj will need a season to make masterpieces so big as these two epics.\n\nMore or less Yash Raj also entertains you and if you are a fan of the actors there you will completely stunned, but we wait for something more than in the last movies.\n\nBut as it is the page for \"Veer-Zaara\", actors are super, musical numbers are superb, photography the best we have seen in our lifes from \"Gone with the wind\", Rani makes the best actress play we have never seen in an Indian movie, (this really deserves an Oscar!, as the one she made in \"Black\"), sound and footage are crazy impossible, well, I really recommend this movie to everyone."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "AMOGHREVIEWS",
        "review_rating": "10",
        "review_title": "B-E-A-U-T-I-F-U-L",
        "review_detailed_main": "Veer-Zaara (2004) - 100%\n\nA Deeply Emotional Love Saga From Yash Chopra With Shah Rukh Khan & Preity Zinta Being It's Body & Soul... \"Veer-Zaara\" If You Ask Me, Is One Of The Top Five To Six Romantic Films Ever Made... It Has Passion, Drama, Tragedy & Above All A Great Message Of Peace & Brotherhood Without Getting Involved In Politics Even For Once... Truly, The Days Of Heart Touching Stories Are Far Behind & Movies Like These Can't Be Made Anymore... Apart From The Film's Premise, One Thing Which Stands Out Is It's Soundtrack... Madan Mohan's Unused Tunes Recorded Sometimes In The 1960s Or 1970s Were Used In The Film To Compose Evergreen Songs Like \"Do Pal\", \"Main Yahan Hoon Yahan\", \"Tere Liye\" & \"Kyun Hawa\"... This Shows That Music Directors Of Past Were Truly Ahead Of Times & That's The Reason We Continue To Enjoy Melodies Of Good Old Days Even Today."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "shahsamirs",
        "review_rating": "10",
        "review_title": "Veer-Zara defines LOVE!!!",
        "review_detailed_main": "A subtle romantic saga which will always be remembered...Love is pure and true love has been depicted by the film... This is the reason we watch films... This is entertainment.. Hats offff!!!!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "dharmendradayma",
        "review_rating": "10",
        "review_title": "Masterpiece of bollywood",
        "review_detailed_main": "This movie is the masterpiece of bollywood love story based movies."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "beenz465",
        "review_rating": "3",
        "review_title": "Meh",
        "review_detailed_main": "Honestly I think the main direction for the actors here was, \"if in doubt, cry.\" A good three-quarters of this is exaggerated weeping.\n\nIt could've been a decent enough film if one, it wasn't so melodramatic- what you as the viewer are supposed to be feeling is constantly forced down your throat, rather than naturally evocated, two, if it got to the point faster, e.g. The beginning spent 30 mins just setting the scene, it's totally unnecessary, and three, if there was more depth to the narrative, i.e. The two of them bonded over something meaningful, thus lending believability to their love, and that more of the court battle was shown, portraying the lawyer's will and intelligence and passion for human rights.\n\nI get that it was making a point about Hindus and Muslims being the same, that their countries are the same and that's something it had going for it. Also managed to put a bit in there about women's rights; they should be educated and can have careers etc. But as a story, it's all quite ridiculous and over-acted. It was trying to do too much and even with the over-inflated run time (I was constantly checking to see how long was left), it still couldn't manage to pull a cohesive story out the bag.\n\nAbout the only things I did like were the cinematography of the landscapes and some of the songs; there's some beautiful ones in here.\n\nI remember watching this in a cinema in India, in my first trip to my home country and liking it- I will always have that great memory linked to this film- but 20 years later, I can't say I was captivated by this at all."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "aliasanythingyouwant",
        "review_rating": "",
        "review_title": "Another Sweeping Tale of Romance From India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rebelpavan",
        "review_rating": "10",
        "review_title": "Love story at its peak",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "krishnashivakumar",
        "review_rating": "10",
        "review_title": "One of the best love stories",
        "review_detailed_main": "This movie was truly great and very romantic.It was pretty enjoyable from beginning to end.This is one of the best movies ever from Yash Raj films,a total quality movie all the way.The direction by Yash Chopra was truly excellent.The screenplay is commendable.This music was very nice my favorite one being Main Yahaan.The other tracks like Aisa Desh,Kyun Hawa,Tere Liye were excellent. This movie was beautifully shot with rich sets and costumes .The scenes were well executed especially the scene were Veer and Zaara reunite.The acting was Top notch.SRK was superb in his role and was quite convincing.In my opinion Preity has given her best performance too date in this movie.Rani was also amazing as the layer also.Anupham Kher and Manoj Bajpai have very interesting roles and have acted well also.If you are really interested in watching romantic movies like me you will love this one."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "guru-1709",
        "review_rating": "10",
        "review_title": "Gr8 movie",
        "review_detailed_main": "It has emotions , message to women empowerment and many more social messsages."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "jay_bkt",
        "review_rating": "10",
        "review_title": "10 on10",
        "review_detailed_main": "I love this movie.. it is a full package... Its best movie i have ever seen..."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "eh5963-297-967354",
        "review_rating": "9",
        "review_title": "Poetic Brilliance",
        "review_detailed_main": "Yash Chopra has been one filmmaker who has told stories straight from his heart. He hasn't compromised for appreciation. Add to that, he's been a storyteller who has kept with the times and sometimes, he's gone ahead of times. Big and younger directors such as Subash Ghai, Sanjay Bhansali, Rajiv Rai and Ashutoush have not lived up to their names, and Yash Chopra has given non-stop hits since 1994. Whether it was having the leading man play a gangster in Deewar, or his bold take on extra-martial affairs in Silsila, or his most bold film Lamhe, about a love with a huge age difference and not to forget, Darr, where he gave more importance to the villain instead of the good guy - Chopra has succeeded in keeping up with the audience.\n\nNow why am I talking about Yash Chopra so much? Well, it's because when one hears the story of Veer Zaara and then when one watches it - they see a deeper tale than they read. Veer Zaara being a Indo-Pak love story sounds like a Henna or Gadar, yet it's not. It's Chopra's genius to develop a fresher theme having such a done-to-death plot.\n\nVeer Pratap Singh has been in a prison in Lahore for 22 years, his case is being re-opened, however. His lawyer is a young girl by the name of Samiya Siddique. To win Veer's case, she needs to know why Veer is in this prison. What is Veer's story? Who is Zaara? Why is Veer in jail? Will he ever be released? A handful of questions are answered in those 3 hours.\n\nVeer Zaara talks about 3 things.\n\n\n\nVeer Zaara works and how! Veer Zaara is pure Indian soul. There's no peppy dance number, no crazy graphics, no special effects. I wrote above how Yash Chopra never compromises and Veer Zaara is a pure example. In the year where films like Dhoom and Murder became huge hits, Veer Zaara's success was the biggest.\n\nEven Veer Zaara's music sparks uniqueness. The music isn't by Jatin-Lalit, Shankar Mahadevan, or Pritam. The tunes are picked out from a collection made by the late Madhan Mohan. The music is soulful and magic to the ears. Every song is so wonderful with touch9ng lyrics by Javed Akhtar.\n\nThe songs are picturised with sheer beauty. Especially Aisa Des Hai Mera. It was a delight to see Shah Rukh and Gurdas Mann shake a leg together in the song.\n\nThe writing is crisp! It's nearly flawless. The film is a tad bit too long but the screenplay doesn't bore you. The dialogues are top-notch, they are applaud-worthy. Kudos to Aditiya Chopra.\n\nVeer Zaara is carried on the shoulders of Shah Rukh Khan. Playing a young man in his late 20's and then a man in his late 40's - SRK gives a bravo performances. His speech in the end is worth a standing ovation just for the expression and passion put in by Khan.\n\nAfter SRK, it's Rani Mukherjee who is a scene stealer. Rani looks the role, and masters it in her own brilliant way. Remarkable. Preity Zinta is good and does her part with ease.\n\nOf the supporting characters, it's Divya Dutta who takes the cake. She gives her best act. Kirron Kher is first-rate. Anupam Kher is, as usual, excellent. Boman Irani is okay.\n\nThe small cameo made by Amitabh Bhachchan and Hema Malani puts a grand smile on your face. A master-stroke indeed.\n\nVeer Zaara belongs to Yash Chopra more than anyone else. The master storyteller adds another feather to his well-decorated hat. (Director's hat) He's handled the scenes of drama, emotions, romance just so poetically. No wonder he's the best filmmaker India will ever see.\n\nOverall, a high intensity filled romance that talks about more than just love's boundaries but also depicts that these boundaries of love are more similar than different."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sharathchandraprasad",
        "review_rating": "10",
        "review_title": "Beautifully crafted 👌🏻👏🏻",
        "review_detailed_main": "Saw this movie in 2021, June.\n\nThis movie still amazes after 16 years.\n\nWow, kudos to those actors .\n\nSuch a masterpiece.\n\nGlad I saw at last 🙏🏻"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "abm_ghizlaine",
        "review_rating": "",
        "review_title": "great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "souvik-63665",
        "review_rating": "10",
        "review_title": "Unimaginably and incredibly beautiful film",
        "review_detailed_main": "It is one of the finest Shahrukh Khan's movies and also one of the best romantic movies, I have ever watched. The mind spearing plot, heartwarming performances of the actors and super melodious songs- these all together makes it a classic film forever. It is my all time favorite."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ramukaka-17358",
        "review_rating": "10",
        "review_title": "Most movies loves it",
        "review_detailed_main": "Very love romantic movies because love so that interested"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "vk-59590",
        "review_rating": "10",
        "review_title": "This movie changed my thoughts for old movies",
        "review_detailed_main": "I am the guy, who is always looking for new and upcoming movies and also i am a movie lover too.One day my dad told me to download this movie for him, so I download it and share with dad and at that night I decide to watch that movie, after the 30 minutes of the movie I really get into this movie, I started this movie at 10:00 pm and its end at approximately at 1:30 am. In these 3:30 hours I forgot everything exept movie. In the middle of the movie the tears came out of my eyes. After watching the movie I download all its songs and listen them at 2:00 am. And I sleep at 2:30 am, just because the movie run on my mind. From that day this movie still in my phone memory and I also started watching old movie now. This movie is masterpiece. This best movie in love story."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "pmrmuzammil",
        "review_rating": "8",
        "review_title": "\"Veer-Zaara\": A Timeless Tale of Love and Humanity",
        "review_detailed_main": "Yash Chopra's Veer-Zaara is a cinematic masterpiece that transcends the boundaries of culture and nation. It's not just a love story; it's a tapestry woven with themes of sacrifice, resilience, and the enduring power of human connection.\n\nThe film follows the epic romance between Veer, a courageous Indian pilot (Shah Rukh Khan), and Zaara, a Pakistani woman (Preity Zinta) on the cusp of marriage. Their whirlwind romance is tragically cut short, leaving Veer imprisoned in Pakistan for decades. The narrative unfolds through flashbacks as a Pakistani lawyer, Saamiya Siddiqui (Rani Mukerji), becomes determined to uncover the truth behind Veer's unwavering devotion to a woman he hasn't seen in 22 years.\n\nVeer-Zaara's brilliance lies in its ability to portray love as a force that transcends political borders and societal pressures. The film doesn't shy away from the complexities of Indo-Pakistani relations, but it chooses hope over animosity. Veer and Zaara's love transcends their nationalities, reminding us that shared humanity trumps manufactured division.\n\nThe strength of the film lies not only in its thematic depth but also in its captivating performances. Shah Rukh Khan delivers a powerful performance as the unwavering Veer, his love for Zaara burning bright despite the years of imprisonment. Preity Zinta beautifully portrays Zaara's strength and resilience, a woman who clings to the memory of her love. Rani Mukerji shines as Saamiya, a lawyer driven by a sense of justice and compassion.\n\nWhile some may find the film's sentimentality a bit melodramatic, it's this very quality that allows Veer-Zaara to evoke such strong emotions. The sweeping music by A. R. Rahman perfectly complements the narrative, further amplifying the film's emotional impact.\n\nVeer-Zaara is not without its flaws. The film's length can be a hurdle for some viewers, and the portrayal of certain cultural aspects might feel exaggerated. However, these shortcomings do little to diminish the film's overall impact.\n\nVeer-Zaara remains a timeless classic, a testament to the enduring power of love and the importance of human connection. It's a film that will stay with you long after the credits roll, leaving you with a renewed sense of hope for peace and understanding between two nations."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "yaemih",
        "review_rating": "10",
        "review_title": "Excellent",
        "review_detailed_main": "I have discussed this movie with many who have also seen the movie, and I have come to the following conclusion: Happy people in love, or people who've been madly in love, will find this one of the most beautiful love stories ever filmed. Others who have seen it but haven't felt touched by it should see it again when they are older or have experienced love, and maybe they will change their mind. There are some scenes (one song in particular in the beginning) that I think could have been omitted to cut down on the length of the film, but still I stand by my rating of 10/10 for this excellent movie with its wonderful soundtrack. It might be interesting for some to read up on the Indian-Pakistan history. Yash Chopra - Congratulations."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "shahrukhkhan65-538-442550",
        "review_rating": "10",
        "review_title": "WoW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Just Another Love Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rajvitz",
        "review_rating": "10",
        "review_title": "One of the finest story and acting",
        "review_detailed_main": "Veer zaara is one of finest movie bollywood has ever produced, spectacular story, amazing story, soothing music, heart touching emotion. Must Watch movie."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "benudharmahakul",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Great entertainment Like all rom-coms, Veer zara sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expect no unwanted melodrama, no unwelcome characters, no earsplitting background music to accentuate the proceedings... On the whole, This is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "murthyvikky",
        "review_rating": "10",
        "review_title": "Fully Emotional Heartouching",
        "review_detailed_main": "My Name Vicky I watched this movie. I cried A lot of scenes. I really Emotional to watch srk face he deliver with such a lack of emotions. I Cried Cried Cried. Anybody reading my review. Please watch this movie. Its not just a movie. After you watch you can feel it. The Meaning of TRUELOVE."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "iamrahulsharma-38041",
        "review_rating": "9",
        "review_title": "The Best Love Story Ever Made In Indian Cinema",
        "review_detailed_main": "Thank You SRK n yRF for this film ❤. Best love story film in Bollywood according to me."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "anaghapradeepanu",
        "review_rating": "8",
        "review_title": "It's all about love",
        "review_detailed_main": "Veer-Zara is not the usual Bollywood Rom-com. Veer Zara is all about love. It is about how love crosses all boundaries and has no religion. The movie is about how an Indian Airforce pilot Veer falls in love with a Pakistani girl named Zara. Circumstances separate them only to finally reunite after 22 long years. Almost every character in the film does justice to their role, be it Shah Rukh Khan, Preity Zinta, Rani Mukherjee,Amitabh Bachchan and Kirron Kher. I have now started finding better movies through www.flickstree.com. It not only suggests great movies to watch, it also tells where you can watch the movie online.. Highly recommended."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "deveshyadav",
        "review_rating": "9",
        "review_title": "Last 30 minutes will make you cry a truck load",
        "review_detailed_main": "Its the best indian romantic drama movie hands down , if you never cried watching a movie try this"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "oranjee",
        "review_rating": "",
        "review_title": "O.K. First Half, Second half was a torture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Dave D-2",
        "review_rating": "8",
        "review_title": "Why Am I Giving This Film an 8 out of 10?",
        "review_detailed_main": "How then should I rate an Indian/Hindi/Tamil film now that filmmakers like Ashutosh Gowariker or Mani Ratnam have revealed that basic formulas don't need to be adhered to as religiously as before for great 'Bollywood' entertainment? Why am I rating Veer Zaara an 8? Certainly not because of it's relatively predictable (with perhaps 1 exception) plot. Definitely not due to the musical numbers (these are adequate but by no means as catchy as in either Gowariker's \"Lagaan\" or Advani's \"Kal Ho Naa Ho\" for example). Surprisingly, not simply because of the amazing Shah Rukh Khan who keeps reaching new pinnacles of performance with each passing role. Maybe it's partially because I appreciated a lot of the symbolism, not to mention significance, re the underlying messages of UNITY in the face of long-standing differences between two major nations and two major religions (in this case India & Pakistan and Sikhs and Muslims) that permeated the entire storyline.\n\nNo I think that the reason I award a high 8 to this film, is because, even though I noticed its flaws, by the last 45 minutes, these didn't matter much as I was drawn in to the story to such an extent that I could not help but enjoy the film immensely. If you are not totally jaded, I predict that you'll also enjoy it immensely.\n\nP.S. FYI: I am not from India and have never visited there. I reviewed this from a new Original 2 DVD Set just released. Next on my list is the newly purchased Gowariker film \"Swades\" and I'll give my comment on that film in a week or two (soon as I have the time to watch it)."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "secret0009",
        "review_rating": "8",
        "review_title": "Amazingly Amazing....NOT BAd AT ALL",
        "review_detailed_main": "I would say this movie was the talk of the night last night. We watched 2 previous Indian films of which one was horrible and the next one was a 4 out of 10. I would say this movie put the spark in our night. Since we were babies my aunt and mum would carry me and my cousins to see Indian movies, being of Indian origin we're able to tell a good one from the bad.\n\nThis movie was amazing. IT's a love tale gone bad and it contains a distinct historical background of what happened between indians and pakistanis. It's tales us through the lives of 2 people, living vaguely different lives, different customs and in different backgrounds...brought together by Bebe.\n\nThe way in which the story is told is distinctly great and you can imagine his pain and feel the sorrow as he talks with the shaking. It's GREAT!!!"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "DinushaUdayanga",
        "review_rating": "10",
        "review_title": "This movie is blessing",
        "review_detailed_main": "This movies is such a blessing and magical i've missed this movie so many years.and finally this movie make me cry.love is full of blessing.thank you who ever created this movie.the best romantic movie made in india.love from sri lanka."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "riteshguptanith",
        "review_rating": "10",
        "review_title": "Honest and pure... Love is the Winner",
        "review_detailed_main": "So many things to learn about life from this movie... A true masterpiece. <3.\n\nHeartfelt songs, emotions and delightful performence by all the actors. :)"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "sankalpluthade",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "Bollywood me naa bani na ban sakti veer zara ye ek sadiyon ke liye bani hui movie love u SRK."
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "jubayer000ahmed",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "shehzada0",
        "review_rating": "",
        "review_title": "Yash Chopra is back after a long time on the directors seat",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "rahulkaran-67109",
        "review_rating": "9",
        "review_title": "Best romantic movie in the history of Bollywood",
        "review_detailed_main": "It is the best romantic movie of Bollywood ever! Just perfect in evry aspect And Shahrukh khan is really the king of acting. U can't get bored ever watching this movie Songs r just fabulous and acting is just beyond perfect"
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "radha-krishna28",
        "review_rating": "",
        "review_title": "A Comment and a Request",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "lakshmi_ny",
        "review_rating": "",
        "review_title": "Good movie, but make it shorter please!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "saythora",
        "review_rating": "",
        "review_title": "A step forward",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Neil_before_Zod",
        "review_rating": "",
        "review_title": "A very pleasant surprise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Md_Rasibul_Islam_Roman",
        "review_rating": "",
        "review_title": "What a wonderful movie this is!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "a_zaman_07",
        "review_rating": "",
        "review_title": "Shahrukh's Outstanding performance in Veer-Zaara.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "ccjp",
        "review_rating": "",
        "review_title": "Very Well Made....but can't help to see similarities with DDLJ",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "Pgoel",
        "review_rating": "",
        "review_title": "A beautiful love story with a message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "janahyd",
        "review_rating": "",
        "review_title": "Well! Hackneyed plot, but still works!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "vipulpradhan",
        "review_rating": "",
        "review_title": "Aditya Chopra remixed - by Papa(Yash) Chopra",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "r_raj",
        "review_rating": "",
        "review_title": "A good romantic movie high on emotional quotient...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0420332",
        "movie_name": "Veer-Zaara",
        "movie_rating": "7.8",
        "review_username": "doughboy401",
        "review_rating": "",
        "review_title": "An Award Winner",
        "review_detailed_main": ""
    }
]