[
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "webmgt",
        "review_rating": "7",
        "review_title": "A marvelous acting by Akshay Kumar",
        "review_detailed_main": "Story is good,it revolves around Katrina Kaif(jasmeet, Jazz), A London born and raised Indian girl,She wants to live her life her way and not according to his parents but movie takes a twist with entry of Akshay,whose love forces Katrina to marry him.Besides movie also shows friendship of Indians and Pakistanis in London.Some dialogs and scenes showing greatness of India are also there.Katrina is looking fabulous in movie.Punjabi people will have great fun watching movie. on the whole a nice time pass.Rishi kappor has also done a great acting.Upen is also good.the only thing that sounds insane in movie is Akshay falling in true love with Katrina on first sight and whole story moves further on this base."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "dhruvinthakkar",
        "review_rating": "8",
        "review_title": "Best romcom",
        "review_detailed_main": "After jab we met this romcom really stood for me ..music , plot , location , performances every thing is amazing...Himesh's best music"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "graffitiworks",
        "review_rating": "7",
        "review_title": "An Excellent Feel Good Movie",
        "review_detailed_main": "It makes you feel good about your country. Endorses the family values which are fast disappearing in todays world. Reaffirms that if you love selflessly, without expecting any returns, you truly get what you set out to achieve. Brilliant performance by Akshay. He is very restrained yet very strong and emotive. The part where the Englishman from the erstwhile East India company rants about India being a nation of snake charmers and the answer that Akshay politely gives him would gladden any person's heart. Katarina looks ravishing and communicates very well with her eyes. Her Hindi has also improved tremendously. Rishi Kapoor brings in a whiff of fresh air from his yesteryear's. Watch it with your better half. It'll make you both fell good about yourself."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "pawanpunjabithewriter",
        "review_rating": "9",
        "review_title": "On of the best Romantic classics of 21st Century to be remembered for AGES",
        "review_detailed_main": "Akshay Kumar! Akshay Kumar does such an incredible work in this movie, he becomes the heart and soul of it. A simple yet loving character played by him is so sensational couldn't describe in more words. Anybody would be in love with the character he is in the movie. Rishi Kapoor was amazing, magnificent. From the best of the cities to the simplest of the villages, the culture, the beauty, the nature, you'd learn it all in this movie. You learn how much impact the culture has on a person growing up. You learn the simplicity. You learn acceptance. You learn you haven't got the best, but you and your loved ones are the best. You see two different kinds of humans getting along with each other so beautifully but the modest one with his simplicity making sure he goes through the tough times, has patience and stays positive without losing the hope till the end. You will be in love not only with the plot, the characters and the whole story but more with the culture of the society. I loved even the songs in this movie, Rafta Rafta tera Afsana tera huaaa, rafta rafta, it suits the moment so much. It's not only gripping but made me cry like I was the last person watching this incredible work of art. We're obliged a team was able to create such a wonderful peace of work with enormous brilliance and magnificence. I loved Katrina's role too. I'd watch it with my kids sometime, tell them this is Akshay Kumar for you sons. Although he's the meme king of India, he's always in our hearts for the wonderful work he has committed to over the years with proper discipline. Thank you for reading it this long, you must've got to know I'm an Akshay Kumar fan, if not I'm drunk. Only the former is correct, but what I love is such work performed with absolute brilliance, be it comedy, be it action, but it's my hat off to this perfection. Talking about perfection, Welcome is a perfection in Comedy genre. I have my review over there too folks. Take care and enjoy every moment of life. No go don't waste much time, I'm a Writer I just wanted to pen down my thoughts. Thanks."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "Afzal-s2007",
        "review_rating": "",
        "review_title": "Though Weighed Down By Bollywood Conventions, Namastey London Engages And Attempts To Shed Light On The South Asian Diaspora In London, Just Don't Take It Too Seriously",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "CanadianPrincess",
        "review_rating": "7",
        "review_title": "Good, but could have been better.",
        "review_detailed_main": "Namastey London, tells the tale of British-Indian young lady, named Jasmeet (Katrina Kaif), who is taken to India by her parents to marry a nice, Indian man, Arjun (Akshay Kumar). However, this marriage is in trouble from the get-go, due to the fact that Jasmeet (or Jazz as she likes to be called), is in love with another man. The movie is a mixture of mainly two other films, Hum Dil De Chuke Sanam,and Purab Aur Pachhim. However, despite the fact that this movie carries similarities to these other films, it has the ability to hold its own ground, and this is primarily due to four factors: the acting, the cinematography, the Indian patriotism, and the humor.\n\nThe majority of actors have done their jobs well. Akshay is relaxed and comfortable in his role, as usual. Rishi Kapoor, is a stand-out in his role of a very loving, yet traditional father. However, it is Katrina Kaif's acting which is the problem. Katrina looks beautiful, and her physical acting is well-done, but her voice and diction still need serious work. In this movie, she was allowed to do her own voice-over, despite the fact that her Hindi is poor. The director thought that since she plays a British girl, this would be fine. I disagree. Even NRI's can speak Hindi well to a certain extent, but Katrina's Hindi is horrendous, and after a couple minutes of the movie, becomes very annoying."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "muhammadusama",
        "review_rating": "9",
        "review_title": "Excellent cool movie, a must watch...",
        "review_detailed_main": "It Endorses the family values which are fast disappearing in todays world. Reaffirms that if you love or work sincerely, without expecting any returns, you may truly get what you set out to achieve. Brilliant performance by Akshay. He is very restrained yet very strong and emotive. Katarina looks ravishing and communicates very well with her eyes. Her Hindi has also improved tremendously. Rishi Kapoor brings in a whiff of fresh air from his yesteryear's. Javed Shaikh of Pakistan also played good role. It'll make you both feel good about yourself. If you like light well paced romantic movies, this is excellent movie. If you like light well paced romantic movies, this is excellent movie."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "shrewnatalie",
        "review_rating": "7",
        "review_title": "mixed bag but worth it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "daman_singh244",
        "review_rating": "9",
        "review_title": "A Fun Film",
        "review_detailed_main": "It was a fun to watch. Akshay was amazing. It could have been better but all in all a good time pass flick. I only went to watch the film due to Katrina .. but ended up applauding the Character of Akshay Kumar The plot is simple yet so complex. Guy loves the girl. Girl doesn't but so much happens in between that you cant just help laughing. Rishi kapoor is very funny in his role of a worried Punjabi father.Katrina is gorgeous she and Akshay make a good couple. The acting makes this movie good although the first half was a bit boring before Akshay's entry.. I think this film should do well.... All in all a fun film.. watch it .. enjoy it..then forget it..."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "Angelus2",
        "review_rating": "6",
        "review_title": "Akshay Kumar's performance is amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "bandhagi",
        "review_rating": "2",
        "review_title": "Racist. Mysoginistic. Narrow-minded.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "rajansharma-85582",
        "review_rating": "10",
        "review_title": "Awesom movie",
        "review_detailed_main": "I am watching it again in 2021 great experience to watch."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "nilaytaneja",
        "review_rating": "7",
        "review_title": "Good Movie A Must Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "baaziger",
        "review_rating": "1",
        "review_title": "Nasty and small minded",
        "review_detailed_main": "Had I read the reviews of this beforehand I wouldn't have touched it. As a film it failed to grip me in any way and I couldn't wait for it to end. Apart from being badly made and failing cinematically, it is full of the nastiest, most vicious little stereotypes which leave a bad taste in the mouth and the toes curling. Whilst a satirical look at behaviour can be done successfully, this film failed to achieve it and came out looking like a piece of undisguised racism and sexism. It wasn't only the Brits who came in for a lashing either, but also younger NRIs. Whilst cinema does not have to carry a moral message, it should at least be entertaining in a way which does not demean its audience. Shame on you Vipul Amrutlal Shah, I only hope your next film will not be so unpleasant."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "missulotamit",
        "review_rating": "10",
        "review_title": "Best movie ever made in Bollywood in this Context!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "just-an-amateur",
        "review_rating": "",
        "review_title": "Kaif wins your affection, but Kumar wins the heart!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "steffycyril",
        "review_rating": "7",
        "review_title": "craftily articulated",
        "review_detailed_main": "A beautiful ride of a lady from city of London to India.Its visuals are entertaining and adds flavor.It shows both cultures in an elegant manner.There is a great mismatch between the characters but in vain.The cameo roles are taken very carefully.There is a good plot and a dose of laughter.There are some great lovely moments when he does everything for her to make her happy. One of the best movie of entertainment and relation. Every time a parent is born in India,they always wish that even if they go far,they always be closer to Homeland.To me,they are special creations of Vipul Shah. The father of heroine is none other than Rishi Kapoor.Really he is a very good father. The soulful melodies and the hip hop is evergreen.OLove is blind but true love is when u let the other be happy. It would be bad if i did not tell about Katrina.She was too cute as she was at that time.At the same time ,she is witty to marry and not let them sign official documents.She is also courageous to decide and run the last minute for Akshay."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "ranzzit",
        "review_rating": "8",
        "review_title": "Engaging Bollywood Masala",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "dsoumya",
        "review_rating": "7",
        "review_title": "Good fun. Definitely worth a watch",
        "review_detailed_main": "After watching duds like Salaam-e-ishq, I went to this movie with very low expectations and was very pleasantly surprised. A respectable storyline, very bankable stars who do justice to their roles and some very hummable music made this movie a lot of fun.\n\nThe movie relies on some very blatant clichés like the very biased views of how foreigners regard India and Asians, but you tend to forgive the director by the end of the movie. I have always thought Akshay Kumar to be one of the most entertaining actors in the industry and he proves it here again, though he very weird with his auburn hair. There are no surprises in the movie and the script religiously follows the standard formula. The only surprise for me was how much I enjoyed it even though I knew exactly what was going to happen.\n\nThe supporting cast is a lot of fun too. Rishi Kapoor should definitely be tapped more often for comedic roles. All in all by the end, when Akshay Kumar sets the world right and all Indians are proud of their heritage, you are happy you came to the movie."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "prithwish-ghosh001",
        "review_rating": "9",
        "review_title": "Wonderful all the Way!!",
        "review_detailed_main": "This movie is a delight to all Akshay Kumar Fans as well as non-fans. From the first frame its funny, lovely as well as well made! You do not feel bored. Akshay plays his role with absolute dedication and does justice to the character. Its a worth watch for all. I strongly recommend it!\n\nOther characters like Rishi Kapoor and his wife impresses in their roles. The chemistry between Akki-Kat is another reason to watch the movie. Upen Patel doesn't make any mark in he movie. Over all the screenplay, the dialogs, the direction and the Acting are all superb and classy! Go for it any day , anytime and in any mood! You will feel life starting!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "HeadleyLamarr",
        "review_rating": "6",
        "review_title": "These duffer dubbed actors!",
        "review_detailed_main": "This film was supposed to be a balanced take on the NRI. But it was as silly as any other film that has showed NRIs in a bad light. Katrina Kaif plays Jazz, a British born white-wannabe. Her voice is dubbed and the Hindi is spoken with a strange Martian accent, the English in a FOB faux American accent. Neither language is enunciated clearly and I was left with the feeling that maybe she was deaf person who had just learnt to speak - kind of like Marlee Matlin in Children of a Lesser God! Akshay Kumar was his usual annoying self, here through no fault of his own but rather due to very poor writing he ends up as a pretend Punjabi from Hicksville. When he laughs he is OK, but when he cries you want to cry in pain from the hideous acting job. His behavior is irrational - if he wants Jazz to love him for himself then why does he speak to her in English as he is leaving? And that is what makes her change her mind? So this is yet another vilification of the NRIs as ridiculous, vain, self-centered, shallow people! Upen Patel was most pathetic, Rishi Kapoor did a decent job, rest of the cast kind of muddled along. Music was strangely unappealing to me. And the members of the cast that played the Britishers were atrocious - ruling the heap was the Charlie Brown fellow. If the NRIs were somewhat spared the Brits were soundly vilified and slammed as religious bigots and racists. 1947 is long gone guys, it is time to move along!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "xpics",
        "review_rating": "3",
        "review_title": "A standard NRI film which exploits foreign locations and Indian emotions to the hilt",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sunildutt-95989",
        "review_rating": "10",
        "review_title": "All time Favourite..Akshay best movie",
        "review_detailed_main": "Comedy.. Drama..emotions.Good direction..Mindblowing MuSic ..having Good starcast with their Acting Skills...Akshay is in his best and roll is totally justified..Rishi Kapoor also has good acted.. Story line is awesome."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "kooleshwar",
        "review_rating": "7",
        "review_title": "Filmy.........VERY Filmy...",
        "review_detailed_main": "The truth is I never really wanted to see this film, my friend probably called me when I was preoccupied with some work, and since the tickets had already been purchased I ended up going for this film.\n\nThe first thing that occurs to you in this movie is that this movie gives lots of importance to Katrina Kaif , Neither HER ACTING NOR HER DANCING HAS IMPROVED BUT THANKS TO SALMAN HER STOCK HAS SOARED AND THE FILM-MAKERS HAVE CASHED IN ON THE NEW FOUND STAR STATUS, besides that I'm sure Katrina's Diary had much more time that Akshays.\n\nThe fact is though that she looks absolutely stunning in the movie and is THE MOST PERFECT EXAMPLE OF CASTING FOR THE PART OF THE SPOILT British DESI (probably because she is one), people may complain that she cant act (dubbing was perfect because she actually cant speak Hindi well and fit the part perfectly) or cant dance but WEAKNESSES APART I HAVE FALLEN IN LOVE WITH HER AND AT THE RISK OF BEING BEATEN UP BY SALMAN I SAY THAT I AM WILLING TO MARRY HER.\n\nThe story line is as filmy as it gets and is inspired from classics such as Purab aur Paschim mainly with lots of influence from others such as Hum Dil De Chuke Sanam Etc.\n\nThis movie clearly has the hangover from the films of yesteryear's with overacting from the entire cast especially from the side characters a particular scene is the one where Upen is thrown from the house.\n\nThe entire film is filled with stereotypes, the most annoying one was that all foreigners are bad and all Indians are good, and obviously THE Indian NARI CAN DO NO WRONG SHE MAY STRAY BUT IN THE END DESI SABHYATA WINS.\n\nSome really annoying scenes were the monologues about the greatness of Indians and India, and the scenes where Katrinas foreign boyfriend was shown with enough flaws to the point of making him a criminal really we get the point to add to that we have scenes were a foreigner asks a Pakistani to change his religion etc etc. TALK ABOUT FILMY.\n\nOveracting was decent all around no one really overacted enough to really get on your nerves.\n\nThis film has lots of moments though such as the Rugby match, Akshays entry and Katrinas awkwardness in rural Punjab, ALSO MY FAVOURITE SCENE WHERE KATRINA GOES TO SEE THE BOYS WHOM A MARRIAGE AGENT HAS CHOSEN THE TAKE ON SAAS BAHU SERIALS HAD ME FALLING OUT OF MY SEAT IN LAUGHTER.\n\nBesides this movie has lots of feel good and fun moments and almost each one is as filmy as it gets.\n\nThe lesser that is said about the songs is better though the Song Chakana was brilliantly edited for the screen and the sound effects really made an otherwise unbearable 5th song tolerable.\n\nTHE BEST THING ABOUT THIS MOVIE EVER IS THE FACT THAT FOR ONCE THE Filmmakers HAD THE DECENCY TO HAVE STUFF WRITTEN IN Hindi AND A LARGE AMOUNT OF SUBTITLES TO EXPLAIN THE English DIALOGUES EXTRA CREDIT FOR THE SUBTITLES MAKING SENSE TO AND NOT USING HIFI Hindi.\n\nTechnically this movie was good with lots of experimenting with different types of colours and maybe even cameras. Again the beauty of India is too great for much credit to go to shots of India.\n\nFor a movie that is so filmy there is surprisingly less melodrama with only a couple of really melodramatic scenes.\n\nAt the cost of sounding Gay I must say that Akshays hair looks hideous.\n\nEven though this is the most filmy movie to come out in recent times its actually a welcome change from the DIFFERENT FORMULA FLICKS this movie is filmy and it never tries to act otherwise.\n\nNot for those who like their cinema serious or expect a high standard of acting, direction etc. THE MOVIE ITSELF IS ORDINARY BUT MANAGES TO RISE BECAUSE OF A COUPLE OF GOOD SCENES AND FOCUS ON Hindi ,but those who are sure they can enjoy a super filmy Hindi flick will definitely come out satisfied.\n\nGood for family as well as friends viewing.\n\n-s overacting all around, some really annoying and slightly melodramatic scenes, pathetic songs (god save me from Himmace).\n\n+/-s super filmy, Katrina (is she the perfect Desi blonde MARRY ME PLEASE).\n\n+s lots of feel good and some really funny scenes ,SUBITITLES AND Hindi CREDITS FINALLY, filmy but not overly melodramatic, good technically superb sound editing, never tries to be anything else.\n\ntotal 5+2=7/10 (not factoring in the fact that it was above expectations the 2 extra points are for the focus on Hindi and the absolutely hilarious matchmaking scene and the take on the Saas Bahu serial I just cracked up some time back when I saw my mom watching the Mega Event of the merger of the big K serials)."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "vickyuec",
        "review_rating": "1",
        "review_title": "Cliché cliché and some more cliché!",
        "review_detailed_main": "This movie has a completely predictable storyline. Katrina Kaif is a completely British girl, but with a catch. She can do drunken dances till late nights, but won't have sex before marriage. Because she has some Indian hypocrisy still left in her blood. The girl who threatens to quit her father's home in London if she is forced to marry can think of no better way than to ruin poor Akshay's life when she is forced to marry him in India. And of course, Akshay is the eye-opener for this vilaaayti gal. I tried to find a single original scene in this movie but couldn't. So watch it if you have ABSOLUTELY nothing to do like the Indian cricket fans!!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "killtolive20",
        "review_rating": "10",
        "review_title": "A masterpiece",
        "review_detailed_main": "Watching a movie after a year of it being released hardly gives you the kick when you see it when it's still hot in the theatres and everybody's going ga-ga about it. However, this is one movie that I watched twice in succession. Come to think of it and I bet you can hardly remember doing that yourself. And if you are one of those guys who look for perfection in a movie it's the closest you can get. The movie is mostly shot in London and has this customary beginning about NRI families who have trouble with their kids being brought up in a western society but don't get disheartened you ain't in for a shock. Also, don't go by the story of the movie which doesn't draw you to the movie but for once give in to your instincts about the movie being a success story at the box office and I can assure you that you are in for a treat. You might not be able to relate to it but given the performances it sure is going to tickle a nerve in your heart."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "ninjah-2",
        "review_rating": "",
        "review_title": "Namaste London",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "GypsiB",
        "review_rating": "6",
        "review_title": "Cute and Fun, but Terrible Music",
        "review_detailed_main": "Jasmeet (Katrina Kaif) was raised in London and has turned into a wild young woman, rejecting her Indian roots and going by the appropriate name of \"Jazz\". Her father (Rishi Kapoor) takes her on a trip through India, ending in his hometown in Punjab. While there, he marries her (not willingly) to his best friend's son, Arjun (Ashkay Kumar). When the couple returns to London, Jazz announces that she doesn't recognize the Indian marriage, and proceeds with her plans of becoming the fourth wife of her boss (Clive Standen). Arjun, must either give in gracefully and lose his wife, or find a way to fight for his marriage by showing Jazz that true love can win.\n\nThe plot is cute and fun, and I enjoyed it. Kumar is a good actor and played both comedy and serious well. I'm not fond of Kaif, and don't feel that she is a particularly good actress, but she was well suited for this role. The supporting cast (especially Nina Wadia) are excellent. The locations and cinematography were great. However, I actively disliked the club music/dancing, and for me that lowered the movie from four stars to three."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "derya_acar",
        "review_rating": "10",
        "review_title": "Best! Romantic and beautiful!",
        "review_detailed_main": "One of my favourite movies.. The chemistry between Akshay and Katrina is on point. It's one of those movies u can watch over and over again."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sauravjoshi85",
        "review_rating": "7",
        "review_title": "Akshay Kumar shines in this entertaining film.",
        "review_detailed_main": "Namastey London (transl. Greetings London) is a romance film directed by Vipul Amrutlal Shah. The film stars Akshay Kumar, Katrina Kaif, Late Rishi Kapoor, Nina Wadia, Javed Sheikh, Upen Patel and Clive Standen.\n\nA man takes his thoroughly-British daughter to his home country, India. There, he arranges her marriage to someone she considers a fool. The daughter attempts to outwit them, but the groom quietly and patiently hatches his own plan.\n\nA good light hearted film which could've been better but still the film entertains. The credit should be given to Akshay Kumar as he almost single handedly carries the film on his shoulders.\n\nPlot of the film is good and execution is also good. The film has some good comedy scenes and will tickle your funny bone.\n\nScreenplay of the film is good and could've been better and more gripping. Acting is superb by almost all the actors be it Rishi Kapoor, Javed Sheikh, Nina Wadia and Clive Standen. Akshay Kumar was the best amongst them. Katrina kaif looked beautiful in the film but her acting in the film is terrible.\n\nMusic is nice and the film has some great songs, BGM is nice and climax is also good. This film can be watched once and will not disappoint."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "nal1287",
        "review_rating": "8",
        "review_title": "Good Movie!",
        "review_detailed_main": "I enjoyed this movie. It made me laugh so much. Akshay is kinda getting old for the young hero role but his acting was great! He made me laugh the most. One thing that bugged me during this movie was that Katrina was supposed to be born and raised in England, but she did not have a British accent at all! She spoke English like an American. I am half Indian, born and raised in the USA and i know a British accent when i hear one. I think Katrina usually has an American accent when she speaks English but that doesn't explain why she didn't act in a British accent! But anyways, she was beautiful in this movie and i loved it! GO SEE IT!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "Queen_of_pentacles",
        "review_rating": "5",
        "review_title": "In and out of the institution of marriage ! No big deal !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "aksar_13",
        "review_rating": "8",
        "review_title": "a incredibly good movie",
        "review_detailed_main": "i saw this movie in a theater near my home. it is a very good Indian movie. it is typically a masala, bollywood movie, which means it is full of entertainment. you will regret if you will not watch this movie in a theater near you. the director has done a great job. it has the complete dosage of comedy, romance, emotions. the music is also very good. i think it will the one of the biggest hits of 2007despite of the cricket world cup going on. it a complete roller coaster, some of the scenes in the movie are 2 hilarious . the first half is out and out comedy. the second half has a little less comedy. but it is also entertaintment. talking about the performances. everyone is good. katrina has improved a lot. rishi kapoor has done a fine job.but the actor who has done a great job is akhsay kumar. you will surely love this man. you will laugh with him, you will cry with him. he is extraordinary in the movie. so watch this movie if you haven't watch a good movie for quite a while. and plz don't watch it on cd or DVD. u will regret this. it is one of the few best movies which u can see on a big screen."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sumant-wadhwa",
        "review_rating": "1",
        "review_title": "The minimum rating is \"1\" on IMDb, I wished to put in a negative value for the same.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "kat_777",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "Jasmeet aka Jazz is a spoiled girl who in spite being born to an Indian couple considers herself a British. She doesn't consider her selves as an Indian until she was taken to her father's village by her father, Where she meets a man who changed her life forever.\n\nThe is overall quiet entertaining. It is also trying convey messages regarding the Indian cultures and values. It shows that celebration means not just to go out and have drinks with your friends. The background score is excellent. Salim-Suliaman did a good job. Songs are okay but not too impressive.\n\nAkshay Kumar did well in his role as the 'Funjabi' boy. Katrina Kaif surprisingly delivered a good performance. She suited her role well. She had the British-Indian look and it is there in speech as well. She did have her moments. The movie actually belonged to Rishi Kapoor with his excellent performance. Others also did well.\n\nOverall the movie is worth a watch. 8/10"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "donnamela",
        "review_rating": "8",
        "review_title": "Wow, Surprisingly Wonderful!!",
        "review_detailed_main": "I've been wanting to review this movie since I saw it a few months ago, mainly because I think it's so underrated. I only got it for my sister who was on an Akshay Kumar trip. I've seen dozens of typical Bollywood romances and while I usually find them entertaining in one way or another, they generally fail as \"romantic comedies\". They might be a bit funny here and there, but as for being really romantic? Hardly. I can only think of a few films like DDLJ and KKHH that made my heart skip a beat with their love story. Hence I was surprised to find myself completely drawn in and moved by the romance in this film. There are some wonderful moments, such as the \"ishq di mere mitra pehchaan ki\",the Veeraniya song, the ballroom dance lesson.\n\nThere are too many \"pros\" for this movie, so hopefully I don't run out of space listing them. Katrina Kaif: regardless of what people say, she's utterly charming, adorable, and in this film at least her acting's spot on. Akshay Kumar is the only older actor that can convincingly play a youngish guy opposite a young actress without making me uncomfortable or indignant. He oozes coolness and sexiness in this film, and gives a wonderful performance. The basic plot of this movie was unique, to me at least, and I loved it. I love the fact that Jazz's family are not super rich -- no false images of fame and glory in a foreign country for the Indians watching this. The conflict between traditional values and a comfortable material life is portrayed wonderfully through the characters of Jazz's parents and Kumar's character, and the issues that immigrants face are discussed in a way I haven't seen in other Indian films. The soundtrack is unique, and one of the best. I love it more every time I listen. And the musical numbers fit the film perfectly, with excellent choreography. It doesn't try to be a comedy, but the funny moments come at the right moments and really made me laugh. The general production -- directing, acting, editing, etc. -- is far above what you tend to see in Bollywood movies. It's VERY well made, which surprised me.\n\nThere is one big drawback to this film, and as you might suspect it's the treatment of Anglo-British people. As is routine in patriotic Indian movies, they are portrayed as morally loose, culturally insensitive douchebags. I understand the need to contrast \"pure\" Indian values with \"corrupt\" Western ones, but they really go overboard in at least two scenes. Some scenes, such as Jazz's fiancé making fun of Akshay during the rugby match, portray racism against Indians in a more accurate and less anachronistic way -- they should have retained such lower-key moments and scratched the exaggerated stuff. Another aspect of this movie that Western viewers might not love is the sense of moral superiority in the characters of Jazz's father and Akshay, and the suggestion that the only thing that can save her from the corruption of the West is a good Indian husband. To me, though, this suggestion was couched in such a convincing love story that I really didn't see it that way. It also helps that Akshay's character isn't self satisfied throughout the film, but actually gets his heart broken. One more thing: some of the music numbers sound like they were recorded in a fish tank. It's a shame since they're all so good."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "ayushabhigyan",
        "review_rating": "10",
        "review_title": "The best",
        "review_detailed_main": "This could not hav been bettr akki kat chemistry emotional story support cast everything"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "amitaishwaryajogi",
        "review_rating": "2",
        "review_title": "An improbable film.",
        "review_detailed_main": "Namasté London is a tedious film: it seeks to re-adapt Manoj Kumar's \"Purab aur Paschim\" (East and West) to our times but the outcome is a yarn based on highly improbable and unbelievable premises.\n\nFor one thing, no first-generation NRI-Londoner (Rishi Kapoor) can possibly trick his remarkably liberated and fiercely independent adult-daughter (Katrina Kaif) into marrying a desi Punjabi (Akshay Kumar) while ostensibly \"taking a journey across India to see the Taj Mahal\". Moreover, no self-respecting hot-blooded desi Punjabi is going to hang around London watching his 'wife' paint the town red with her fiancé- a spoilt and thrice-divorced heir of a British tycoon- in the hope that she will eventually come running back into his arms. As things turn out, that is exactly what happens.\n\nOnly two sequences stand out: first, the family's hilarious interviewing of suitable matches for their daughter, including a lap-top yielding software-analyst from Hyderabad who demands to have a premarital 'physical compatibility' test with the prospective bride-to-be, and another loony from Delhi who thinks he is a character in an Ekta Kapoor soap-opera; secondly, a family scene at the dinner table, which stands out for Rishi Kapoor's efforts at suppressing his laughter. Apart from this, there is nothing else to the film.\n\nWatch it only if you haven't got anything better to do. Or, as in the case of Mohit Singhania, if your world begins and ends with Ms. Kaif! AJ"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "ankitsycho",
        "review_rating": "10",
        "review_title": "It's a great story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "nirmalstheone",
        "review_rating": "1",
        "review_title": "Umm... didn't KANK already scrape the barrel?",
        "review_detailed_main": "Went straight to my worst ever movie list, nudging out the likes of \"maine pyaar kyoon kiya?\", Critters3, kal ho na ho, kabhi alvida na kehna, 7g Rainbow colony, Ghilli etc...\n\nI love Akshay Kumar for the cartoon he is. He knows and leverages it.And it is expected of him to perform roles like this but wow.. the movie would be a low even for Govinda.\n\nKatrina Kaif..jeez..she's been taking acting lessons from Amisha Patel! And for the much-vaunted scenery of London...When editors sit and air-brush a movie frame by stupid frame... How can one make out the difference between London, Melbourne or Prague?? With air-brushed quality movies like these, there's no point in going to other countries to take movies... you can as well air-brush Banaras and say its Luxembourg. Godawwful acting except by Pervez, Upen Patel's dad, who well.. doesn't matter anyways. And I wonder if Rishi Kapoor knows he's no longer cute. No story line, crappy script, stupid attempts at patriotism-mongering, making a mockery of Punjab/Punjabis...All in all one of the worst ever movies to be ever made.EVER."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "papanloveu",
        "review_rating": "9",
        "review_title": "One Of the Romantic Movie.. Must Watch!!",
        "review_detailed_main": "Akshay Kumar and Katrina Kaif look good together in the movie and give you a paisa vasool pyar-mohabbat story.\n\nMASTERPIECE!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sweetbum1989",
        "review_rating": "9",
        "review_title": "Makes you more proud to be Indian, if thats possible....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "singh-amrit",
        "review_rating": "8",
        "review_title": "Smiles all the way.",
        "review_detailed_main": "If entertainment is what you are looking for, look no further. Namastey London is easily year's most entertaining film till date. It has good quantity and quality of humor, romance, music, emotions\u0085 almost everything you would spend your money for.\n\nAkshay Kumar is as charming as ever. He is probably the most under rated actor of this generation. He has an amazing comic timing, he carries emotional sequences quite comfortably, and he can dance and looks great. He easily carries the whole film on his shoulders. Rishi Kapoor has not lost the innocence since his \"Bobby\" days even a single bit. In ever improving Upen Patel, we seem to have found someone to step into Pran's shoes, a character artiste who, with his style and screen presence can match, sometimes even overshadow, the lead actor. But the real stunner is Katrina Kaif. She looks ravishing in entire film. She looks good in whatever she wears, whatever she does. Sometimes you cannot stop wondering, where this beauty was hidden in all her previous films. She has never looked better. And with improved acting abilities and cutest of voices, she's all equipped to kill. You can easily watch this one only for her\u0085 whatever other good this film has to offer would be a bonus.\n\nStory is simple, sweet and predictable. In fact you would know the climax from the very first shot. But it's the treatment that keeps you hooked. One never feels dragged. And if you are an Indian, this is a real feel good film. You cannot stop your Goosebumps when Akshay Kumar delivers speech describing India to a British. And there is finely blended India-Pakistan friendship. Don't be surprised if while laughing all the way, sometimes in between you find your eyes moist.\n\nDirector Vipul Amrutlal Shah scores a hat trick\u0085!! After Aankhein and Waqt, this is his third consecutive good product. His next would be worth waiting for.\n\nBut don't wait for this one. Go and watch it. Right away."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "white_lotus1987",
        "review_rating": "4",
        "review_title": "It's a stale Biryani !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "shobh",
        "review_rating": "10",
        "review_title": "Ishq DI mere Mithra pecan Ki. Mit Jove Judon Jed apnea DI",
        "review_detailed_main": "Ishq DI mere Mithra pecan Ki. Mit Jove Judon Jed apnea DI . Best dialogue ever in Indian film history . A Movie for a Sacha Aashiq.\n\nSache pear Kay mat lab hassle króna NIH hots...!!! Main tab bi ya hi Tamarra inters Karena, Kabuki main Janna château Hui Ki ab bi tum Kusch ho ya NIH..!!\n\nBest Tracks ever\n\n1) Yahi hots pear - Tera bungee Jo woo , Tera NIH HI 2) Annan Fanan - Dhaka Dhaka SA Dill Kata h ye faunas 3) Rafta Rafta - Dil KO Nara tree Esq SE Ashia... 4) Veeraniyaaaaaaaaaan - Dil me ab tack ,,,,, meed Ki eek.......\n\nfaunas chub ti h Jana 5) Chakna Chicana - Tu Meir Saba\n\nAur hon mien Mahala\n\nDiya Dill KO tune\n\nNaya eek Tijuana\n\n(Hez crazy.... Heaz crazy..Hz crazy for u baby)\n\nand best of of all... ICONIC , HISTORY , JAI MATA DI LETZ ROCK HIT MACHINE HIMSELF - HR {Himes Bhai} - Maje tree Gar me Doti Cherye.\n\n1 above 1)Main Johan rah - keno KO saith apnea 1 Danya chalet h\n\nJaved Akhtar's F/O Milkha (Daudunga bi Wise hi) only work that deserves appreciation. Best Jodi ever Himes Bahia n Jawed Saab\n\nAkshay Kumar as usual edited each n every dialogue of the Superstar himself UPEN PATEL\n\nKatrina Kaif proved herself in this flick ... no one can beat her apart from Salman(Bodyguard) :P\n\nRishi Kapoor finally proved beer makes you Tallia (Dekh Ni Rhea ..... main Tallia ho Rhea Hui) and teaches you patriotism (Jhanda Kiri bi Des Kay ho.... beep beep)\n\nSache pear Kay mat lab hassle króna NIH hots...!!! Main tab bi ya hi Tamarra inters Karena, Kabuki main Janna château Hui Ki ab bi tum Kusch ho ya NIH..!!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "timesofbhuvan",
        "review_rating": "2",
        "review_title": "Nonsense unlimited!",
        "review_detailed_main": "First 20% is good. Rest is nonsense. Typical Bollywood masala. One of overrated movies. All bollywood cares about is religion, patriotism, family and marriages."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "vansh",
        "review_rating": "9",
        "review_title": "excellent entertainer...very tastefully done...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sharit_sinha",
        "review_rating": "9",
        "review_title": "Touched me.....and should touch everyone!!!",
        "review_detailed_main": "A very latest observation I have made...that the genre and style of our Indian movies are changing. Topics are represented properly, have a natural way of expressing...and Namaste London is one of them. Completely commercial movie, about love, about India, about culture and still...refreshing.\n\nAkshay is great...he really has carried the movie on his shoulder. He is stylish and have given a natural and yet perfect performance. Katrina is beautiful and still, is not just an eye-candy. Rishi Kapoor was the perfect choice for a helpless father of a brat. He expresses \"what-to-do\" attitude superbly. Javed Sheikh...not a very big role though, I have always admired his acting. He and Rishi had a terrific chemistry. Upen Patel...I don't know if its his looks or acting..I don't like him much. However, the movie carried it away and he did not bother me much. Clive Standon is good....not a typical bad guy....but did his job properly.\n\nAllover, the movie travels slowly from London to India and then back to London. The story shows, how \"cool\" it is to break own cultures and adopt to others, while the \"others\" might not even accept you. How easy it is to say, that I am grown up and how tough it is to act like one. How easy it is to say, that nobody can take my freedom away..and how hard it is to accept the responsibilities of freedom.\n\nAgain, as last words, with all due respect to the British people, there are still some group of individuals, who like to think India as a backdated area and wants to show us down. Again, the vice versa of this applies to us Indians too. So, please follow Akshay's word and do not to try to show anybody that we are better than you. If we are, everybody will come to know that. History does not forget anything.\n\nPlease watch the movie...u will like it."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "Dream_Woman",
        "review_rating": "9",
        "review_title": "Best Film Of 2007",
        "review_detailed_main": "I really loved this film, it was just fantastic and this was definitely Katrina Kaif's Movie, she played her role very well and was well suited for the role also, and i loved the Asian outfits that she wore in the film, she looked so beautiful in the salwar kameez.\n\nUpen Patel is also in this film, he plays his part okay i guess but could have done better.\n\nKatrina plays a British born lady who's father wants her to get married to a guy in Punjab, anyways she goes to India and meets this guy (Akhshay Kumar,) and her parents sort of force her into it. His acting was really good in thew film as well.\n\nAnyways she comes back to the U.K and calls him over then meets a white guy and he proposes to her and she ends up marrying him but the ending of the film is just so typical she runs out of the church and ends up with Akshay, (i mean who wouldn't want Akshay hes a sex god) back to reality there is a lot of comedy in this film also and Rishi Kapoor who plays Katirna is so funny i loved Nina Wadia also but she has put loads of weight on The Music is so beautiful so i think you guys should go and check this film out, i can assure you that you will not be disappointed."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "Undertaker20",
        "review_rating": "4",
        "review_title": "When wil Bollywood make character having self respect",
        "review_detailed_main": "Watched its rating first and found great. But movie was quite disappointing imean come on man akshya character or most of the character in Bollywood movie involve the main hero to be have no self respect at all.. I too have been in love but you know i will simply show her I'm the best and would leave if she can't realize that doesn't mean you'll beg for that..."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "b-ionela",
        "review_rating": "9",
        "review_title": "Europeean",
        "review_detailed_main": "Being an European girl married to an Indian man, i was deeply consonant with Jazz's role. I am intrigued by some facts such as: why the British dude comes from a rich family, is selfish and unstable, why presenting the Europeans as ignorant about India and Indian culture, why picturing European girls as easy girls, addicted to nightclub life and indecent clothing, why keeping such high barriers between Indian values and European ones.\n\nWe live in a world where inter-cultural relationships are becoming more and more present. Globalization, advanced technology and communication means, migration of people to more developed countries are prime criteria for this.\n\nFor me, this movie presents the pattern thinking of a generation of people that cant accept these changes, with a defensive attitude, a fear from losing native values and beliefs.\n\nIt is more comfortable to stick to these stereotypes than to try a real and open communication.\n\nI Love India, I admire and I respect Indian culture, Indian people, and I am proud to be a Hindi patni."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "5",
        "review_title": "Namastey London is too long for a story that's too familiar to begin with.",
        "review_detailed_main": "In director Vipul Shah's Namastey London, Katrina Kaif plays an Indian girl born and raised in the UK, who's turned out to be something of an infant terrible who guzzles vodka like it's water, dresses in micro-minis under her salwar-kameez, and frightens away prospective grooms by telling them false stories about her promiscuity. But worse than all of this, and the reason her dad's having sleepless nights actually, is because she's seriously considering a marriage proposal from her white boyfriend, a cad who's already been married thrice in the past.No wonder daddy dearest Rishi Kapoor whisks her off to good ol' Bharat where after several failed attempts to find a suitable groom for his daughter, he finally coaxes her to tie the knot with the son of an old friend, a sort of small-town bumpkin Akshay Kumar, who's already fallen head over heels in love with his peaches-and-cream complexioned wife. Promising to consummate their marriage back in London, Katrina brings Akshay home, but only to reveal to him and to her parents that this shaadi was all a sham, and her heart still beats only for her gora boyfriend. Shaken, but not entirely defeated, Akshay decides he's going to stay on and win her back with love. I can bet my last pay-cheque that the one thought that came to your head while you heard me narrate the film's plot is: 'Hey, haven't I heard this story before?' Well, yes, you have and several times over actually. It's clear, straight off the bat, that Namastey London is a been-there-seen-that story inspired from a variety of films including Dilwale Dulhania Le Jayenge and Hum Dil De Chuke Sanam to name just two. Look, the one thing that a film must have in order to hold your interest, is unpredictability. It's very unlikely that you're going to enjoy a film if you know exactly how it's going to turn out in the end. But let's face it, unpredictability of plot is something that very few Hindi films can boast of. In which case, when you do know what direction a film is going in, when you do know what's going to happen at the end of the film, the only thing that is likely to keep you entertained, is the manner in which the filmmaker or the writers arrive at that ending.You know the beginning, you know the end - now can they make the middle so interesting and so unique that you're willing to stay with the film even though you know where it's all leading upto? The same is true of Namastey London. It's a Hindi film, you know Akshay Kumar is going to melt Katrina's heart in the end, now we just need to know how he does it.Vipul Shah and his writers use the old-fashioned approach - true love conquers all. Some of you may find that archaic and outdated, but once in a while I think earnestness, sincerity and some old-fashioned simplicity can do the trick. Namastey London certainly has its heart in the right place. But sadly it goes about making its point in the stupidest manner. Why is it essential to portray every white person as a racist bigot in order to convey what a desh-bhakt our hero is? That party scene in which a white man makes Indian jokes only to be put in his place by Akshay is so over-the-top and so blatantly manipulative, it makes you cringe. Ditto for that scene at the mosque where Akshay drives sense into Upen Patel's head by explaining to him why nothing and no one's worth changing one's name and religion for - it's a scene that's screaming out for a pat on the back - \"Look at all the good values we're trying to propagate.\" Now don't get me wrong, I'm not a cynic, I'm just saying this film is so caught up being self-congratulatory that it doesn't even realize where its slipping up. Like the humour for example, which is so juvenile at most times. Or all the stereotypes that the film tends to reinforce.By the time the lights finally come on and the end credits begin to roll, you feel like you've been in that hall for what seems like an eternity. Namastey London is too long for a story that's too familiar to begin with. It's not a bad film, but it's often dull and you can pretty much predict its every next step. Of the actors Upen Patel turns in a surprisingly decent piece as a British-Asian boy confronted with cultural dilemmas. Now if only he'd work on his dialogue delivery and accent, they wouldn't have to dub his voice. And someone please ask him to keep his shirt on, we've seen enough of his shaved torso already. As the patient and hopeful romantic, Akshay Kumar plays his most restrained role yet, and he's not bad at all, it's just that his character seems so ludicrous; you're unable to take him too seriously. For Katrina Kaif, playing the rebellious protagonist of this film, it's a part that fits her like a glove. Her acting's also considerably improved since the last time she was on screen.But for me, the only actor really worth mentioning in this film is Rishi Kapoor. Both in his comic scenes and his dramatic portions, he brings a degree of naturalness that none of the other actors can serve up. He is easily the emotional anchor of this film and his performance; it's only real strength.In many ways it's modeled after those well-meaning 70s films - one part Dev Anand romance, one part Manoj Kumar patriotic saga. It's sweet and it's simple but that's just the question - do we still have an appetite for steamed rice when everyone else is eating biryani?"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "chauhanbhawani",
        "review_rating": "10",
        "review_title": "One of the best of all time...",
        "review_detailed_main": "I was always his fan ,since watching his all action movies like mohra,khiladi,main khiladi tu anari and all but after watching Namaste london I just became his devotee... People love DDLJ but I love Namaste london..."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "swasthegr8",
        "review_rating": "8",
        "review_title": "A movie one can watch numerous times",
        "review_detailed_main": "It is the best Akshay-Katrina movie duo till today.Unlike Akshay Kumar's other illogical movies this was an astounding movie to watch.A treat for romantic comedy movie fans.Akshay started doing comedy films since late 90's but tasted success, after Hera Pheri in the comedy genre.Namastey London was released in late 00s and became a box office hit.Katrina Kaif was in her rudimentary stages of learning and off-course acting.It was her first movie with her own dialogs instead of dubbing.Apart from the leading roles, Rishi kapoor as an accomplished actor did his part well.Other actors such as Javed Shekh ,Upen Patel & Clive Standen were OK.They (producers) could have portrayed Standon's character as an anti-hero of the movie.The music by Himesh Reshamiya & playback by Rahet Fateh Ali Khan are mesmerizing.Last but not the least, the patriotic dialog delivery by Arjun(Akshay) to Charlie's great grandpa was applausing."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sachinaxis",
        "review_rating": "10",
        "review_title": "The great Akshay & The Great Movie",
        "review_detailed_main": "Akshay Kumar is very charming in this movie and his performance was excellent. Katrina shares great chemistry with Akshay. Rishi Kapoor, Irfaan Shaikh & Upen Patel gave their best. This movie can be watched with family and repeatedly. I am sure it's a television hit as well.\n\nSome scenes in the movie are unforgettable like Rugby match, Akshay's revenge on insulting India, the song Rafta Rafta, Katrina's reveal of her intentions of marriage to Akshay Kumar."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "London praise",
        "review_detailed_main": "London seems to be in many films of bollywood Be it BHAGAM BHAG, HERO HINDUSTANI, JBJ Now even titles having London\n\nNAMASTEY London is nothing new though it's not anything as bad as Akki's films off late\n\nThe story is damn simple and thin there are some funny moments like the rugby match and some more but otherwise the film is too plain\n\nDirection by Vipul Shah is ordinary Music is good, AANAN FANAN is best\n\nAkshay underplays his part brilliantly and suits his part He is brilliant in emotional scenes too Katrina for once dubs her self her lines and does well in her role Rishi is a highlight, he brings the house down and is simple yet lovable Upen Patel is okay rest are okay"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "ptlovemomdad",
        "review_rating": "10",
        "review_title": "I Don't Agree!!!",
        "review_detailed_main": "U c Mr.Kooleshwer i don't think you've seen a movie very carefully don't mind me saying, but if u would've then u wont feel that they are showing all the best stuff abt India and worse things about Britan! some of thoz things which they show in movie are very true, and who cud tell ya that better then a person who's been there, lived among them and been one of them, rite! About movie; some of the scenes are hilarious. And I'm Impress by the storyline and some of the dialogues...at least some1 or sud i say group of people are trying 2 show bit of reality thru such effective medium, cause believe it or not but thts fact about all 4 counties. And i believe to drill thru todayz generation's brain Movie Industry is the best way. Well thts how i see it. i hope i didn't offend you in anyway, if so then am really sorry!"
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "sapna_oo7",
        "review_rating": "5",
        "review_title": "better than humko deewana kargaye at least",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "palls",
        "review_rating": "9",
        "review_title": "loved it",
        "review_detailed_main": "Don't want to spoil it by saying many things about this movie...its indescribable.beautiful emotions and just right for the whole family, saw it alone on the plane to India and then with my grandparents in India. I would recommend that you watch it if you were in love, are in love or ever want to be in love. Its a special understanding for someone who lives abroad like me,and if you do too, you will appreciate it! The movie takes you on a journey that you perhaps have been on before, and this one you will still want to take. Needless to say its a Hindi film with the usual goof ups and slapstick humor,but if you have understood the emotion behind it, the director's task is accomplished. Watch it with family, friends, your love, and it will make more sense."
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "TharsheyN",
        "review_rating": "9",
        "review_title": "True Love Wins In The End!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0795434",
        "movie_name": "Namastey London",
        "movie_rating": "7.1",
        "review_username": "jatinbaranwal",
        "review_rating": "8",
        "review_title": "Not a Romance Lover, but teaches the correct way to Love",
        "review_detailed_main": "The story begins with Jazz's parents tricking her into a trip to India, where they hope to marry her off to a suitable Indian boy. Enter Arjun, a charming farmer from Punjab, who is as traditional as Jazz is modern. Despite their immediate cultural clash, Arjun falls in love with Jazz and is determined to win her heart and respect. The film then takes us on a journey back to London, where Jazz must confront her feelings and the expectations of her Westernized life.\n\nStrengths:\n\nPerformances: Akshay Kumar shines as the earnest and endearing Arjun, bringing warmth and sincerity to his role. Katrina Kaif, though initially appearing a bit stiff, grows into her character and convincingly portrays Jazz's internal conflict. The supporting cast, including Rishi Kapoor and Upen Patel, add depth and humor to the narrative.\n\nCultural Exploration: The film does a commendable job of exploring the cultural tensions between Indian traditions and Western modernity. It highlights the identity struggles faced by the Indian diaspora and the generational differences in perceptions of love and marriage.\n\nMusic: The soundtrack by Himesh Reshammiya is catchy and memorable, with songs like \"Chakna Chakna\" and \"Rafta Rafta\" adding to the film's charm and appeal.\n\nWeaknesses:\n\nPredictable Plot: While the film's premise is engaging, the plot unfolds predictably. The cultural clashes and romantic developments follow a familiar trajectory, offering few surprises.\n\nCharacter Development: Some characters, particularly Jazz's friends and her Western suitor Charlie, are stereotypical and lack depth. More nuanced portrayals could have added complexity to the story.\n\nPacing: At times, the film's pacing feels uneven, with certain scenes dragging while others rush through key moments.\n\nConclusion:\n\n\"Namastey London\" is a heartwarming and entertaining film that successfully blends humor and emotion. Its exploration of cultural identity and love's transformative power resonates well, even if the storyline remains somewhat predictable. Akshay Kumar's stellar performance and the film's musical score elevate it, making it a worthwhile watch for those who enjoy cross-cultural romantic comedies. Despite its flaws, \"Namastey London\" charms its way into the audience's hearts, offering a pleasant cinematic experience."
    }
]