[
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "msmyahoo",
        "review_rating": "4",
        "review_title": "Wish I were 12 again",
        "review_detailed_main": "The name \"Krish 3\" says you what you're in for when you pay for a ticket to this gigantic most 'ambitious' Indian superhero mega-budget project. It's neither The Superman nor Spiderman; it's a swindle of films such as X-Men, Babylon A.D. Spider-man, The Avengers and The Incredibles and Megamind. Directed and overseen by producer-filmmaker Rakesh Roshan, the movie failed to delivers on the promise of its name which contains some utterly ridiculous and pointless scenes. This is the third film as franchise in filmmaker Rakesh Roshan's ambitiously-scaled, action-packed and starring (wonder, wonder!) Hritik Roshan. As usual, this based on the strength of Hrithik Roshan—his energy, dynamism and a visible sincerity to save the human race against a powerful militia controlled by a wheelchair-bound (copy from \"Babylon A.D.\") mastermind Vivek Oberoi. The form-shifting Kangana Ranaut's character in the film is called Kaya, in fact she is the lead actress, is far sharper and more impactful. Needless to say Priyanka Chopra, Hritik's lady love, is lumbered with a vaguely written role in this film. The first thing to notice about the \"Krish 3\" soundtrack is that it is lengthy. Background music was loud and Songs pop in with the least expectation with the situation and it becomes highly awkward for the viewer. I will say the best bit in \"Krish 3\" is the Good effort on special effects - though clearly the concepts are borrowed from western movies and fails to impress. Nobody will say that the special effects were bad; I will say it was jaw dropping but what about everything else. It's another good example followed by \"Ra-One\", \"Love story 2050\" that just pouring in money and showing special effects doesn't help a film become good. This movie fails to create suspense on emerge victorious because the result is predictable and pointless but positive thing, its not that boring. Extremely, this film is for the die-hard fan of Hritik who hardly gives ANY importance to story OR screenplay. Roshan's family has thrown in all thinking of targeting all audience segments, and has therefore been unable to please maximum, at-least me. But For teenagers, it is definitely a delight. Once you accept it will be easier for you digest."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rajiv_master",
        "review_rating": "6",
        "review_title": "Amazing Special Effects for a Bollywood Movie...!!!",
        "review_detailed_main": "The vfx and special effects are one the Plus Points for the film.\n\nQuite an ambitious project and clearly they tried to put in everything in such a small budget. Appreciated !\n\nThe songs are not gud but tolerable in the flow of the movie. The story is some what predictable.\n\nThe characters mainly the bad guys are inspired from the X-men.\n\nI was skeptical before watching this movie because after watching so many near-to-perfect Hollywood superhero movies I wasn't sure if I would like this one. But I must say it didn't disappoint.\n\nAll in all a good movie, not worth missing. If u keep your expectations a little low you'll love the movie.\n\nFinal Words Rakesh Roshan is an expert director, no second thoughts about that but there are certain elements in the movie which he could have done without for better. Certain duologue's are over the top and cheesy, music is uninspiring, screenplay is weak and unimaginative. It resembles to a lot of Hollywood franchises which makes it hackneyed and makes us less proud of the finished product. The movie is not a great cinematic experience but isn't boring and crappy also. Good Acting (Vivek, Hrithik,Kangna) ,great VFX and an almost good story makes the ride enjoyable but bumpy due to certain roadblocks and speed breakers. If we compare it with the other superhero movies that Bollywood has churned out, Krrish 3 will top the list in terms of quality, acting and direction."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "musicmansurana",
        "review_rating": "4",
        "review_title": "Pathetic!",
        "review_detailed_main": "OK! From where do I begin....\n\nKrrish 3 was a torture!\n\nhe songs were desperate attempts to create music out of the themes of its prequel.\n\nThe story line was completely predictable!\n\nI mean; Who would've expected a mutant to destroy the mutant race!\n\nActing was good but was never backed with a good script.\n\nSome of the scenes seemed to be completely bogus!\n\nPerhaps; this looked more like an Indian version of the X-Men series!\n\nVivek Oberoi tried being Magneto but he was a complete disaster!\n\nThe only plus point I found was the technique that was used in making the movie.\n\nApart from that; everything fell way beyond expectations."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "venugopal19196",
        "review_rating": "1",
        "review_title": "Plagiarism..Plagiarism... Everywhere",
        "review_detailed_main": "Literally, each and every character, most of the action scenes, and dialogs in the film are inspired, or say blatantly copied from the Hollywood superhero films. X Men, Batman, Superman.. You name a comic hero, you got him in this film. Even the background score is lifted from Inception and The Dark Knight. And the worst part is that this plagiarism didn't pay off in the end. The screenplay was very poor. Action sequences looked too much fabricated, super slow, and lacked depth. It's a congery of B-grade visual effects, melodrama, and toothless humor.\n\nFinal word: If you're are an eleven year old with no Hollywood experience, it's a treat for you. Or else, don't bother watching it."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "humtum8088",
        "review_rating": "5",
        "review_title": "Far below expectations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "only for 12 year olds !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "siddhantgiri1994",
        "review_rating": "6",
        "review_title": "A poor man's X-Men !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "amanbat11",
        "review_rating": "5",
        "review_title": "I want to appreciate the efforts but I can't, sadly the movie is flawed in every area.",
        "review_detailed_main": "As an Indian, I am a big admirer of all these projects like Krrish, Ra- one etc. so I watched this movie without waiting for reviews, I kept low expectations and yet its utterly disappointing. I understand that such projects require a big budget, but the movie has so many flaws that this 'budget' excuse does not justify it anymore. At least one area where Bollywood is good at, 'Music', could be original, but no! From the initial credits where they play the spider-man theme music till the end music 'book of Eli' theme, the whole movie has bits & pieces of some Hollywood movie. Another confusing fact about this superhero Krrish is that his powers are not defined. Every Hollywood superhero is known for his well defined power, they have strengths & weaknesses. But nobody knows what Krrish is capable of, in some occasions he can't outrun a slow moving car and at some other times he is faster than light; sometimes he has to put all his power to move a truck and sometimes he would move mountains (a metaphor not literally); the superhero in Krrish(2006) who had powers like captain America, has turned into a superman in Krrish-3, now what's next? total BS. Please, define this superhero's powers properly. And please Mr. Rakesh Roshan, don't make our superhero cry like a toddler all the time. Talking about Kaal, I kinda like the villain in this movie and Vivek Oberoy deserves an applause for his acting and dialogue delivery. Whenever the dialogues were lame, well its not Vivek's fault. Mr Rakesh Roshan had so many powerful mutants in this movie, he could have used each one to give at least one small round of fight, but most of them were just wasted. Once again, zero innovation and zero originality cannot be justified by the low budget excuse. I did not put reviews earlier because I want this movie to make money and I want Mr. Roshan to make Krrish-4. And i'll watch Krrish-4, again without waiting for reviews, but if I see the movie & music is again borrowed by Hollywood, I will immediately put my reviews highlighting all the cons to make sure our people know what they are going to see, once Mr. Roshan work on these areas, the movie will appeal to another big segment of viewers who watch Hollywood movies regularly. Just show some originality and make your movie attract the intellectual viewers."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "TharsheyN",
        "review_rating": "10",
        "review_title": "Wonderful!",
        "review_detailed_main": "I thoroughly enjoyed the film! It continued the story of Krrish and Priya and introduced a cool new character in the form of Kaya (Kangana Ranaut).\n\nKrrish 3 is probably the weakest of the trilogy it it still entertains and had me laughing and supporting my favorite characters on screen.\n\nI won't do a long winded review as everyone else who reviewed the film seems to have done it already. All I'll say is this, if you're a fan of the Krrish series and watched Koi Mil Gaya and Krrish then definitely give this a watch, hopefully you will enjoy it but if you don't at least the story has been concluded hey. If you're not a fan of have never heard of the Krrish series, go watch Koi Mil Gaya... it's the first In the series, come back after watching Krrish(the second in the series) and watch this.\n\n10/10 from me! Loved the songs, acting was really good though storyline is not as good as previous films in the series."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "kunalkhandwala",
        "review_rating": "7",
        "review_title": "Unrefined storytelling for a visually stunning action film",
        "review_detailed_main": "Several attempts were made over the years to create Indian cinema's very own superhero. Most attempts were ridiculed until the 'K' obsessed Rakesh Roshan introduced an alien inspired by Spielberg's 'E.T.' who bestowed magical powers upon Rohit whose son, in turn, would be the first convincing superhero that leaped across long distances in a long black coat. This young Krishna is now back as a more refined Krrish whose nemesis is not only the mutant generating apocalyptic maniac but also his father's script that introduces unwanted drama and cheeziness to restrict this 100 crore venture from being a fine example of India's advancement in films. 'Krrish 3' or 2, as you like it, is technically impressive and stunning in several aerial shots, action sequences and the climactic showdown between two immense forces but it is the storytelling that sees no advancement or refinement. With a cartoonish plot of a villain seeking world domination with his self-generated mutants, Rakesh Roshan seldom offers intrigue, surprise or nuance in a story of good v/s evil.\n\nThe sequel finds its roots in the events in Singapore when Dr. Siddhant Arya used the DNA from Rohit Mehra (the better Hrithik Roshan) to create new life. Years after Krrish's victory over Dr. Arya's malicious attempt to change the world, we see him struggling with jobs he can't keep while being the superhero that the city occasionally needs. While his father Rohit's experiment to harness the sun's power achieves limited success, his main focus is to find an antidote for a deadly virus outbreak in Namibia. An elusive pharmaceutical company finds the cure eventually, garnering enormous profits and funding for its proprietor's relentless attempts at creating a life form that can cure his handicap with a DNA matched bone marrow. Kaal (Vivek Oberoi) has no regard for human life and sends his mutants to Bombay to unleash the virus again. Millions of lives are threatened but the father-son duo create an antidote and use Krrish's powers to distribute it in Diwali style. Furious at his foiled attempt, Kaal sends his mutants to threaten Rohit's family and Kaya (Kangana Ranaut) replaces Priya (Priyanka Chopra) with her form changing ability. Intrigued by the common DNA signatures between the virus, its antidote and a captured mutant, Rohit seeks to unravel the mystery in Singapore where Kaal seizes him. Krishna, who has just realized Kaya's deceitful ways is determined to rescue his wife, unborn child and father from Kaal's hideout. Meanwhile, the nefarious villain finds the DNA he seeks and now has renewed powers with which he threatens the city of Mumbai once again. Only a superpower can stop him. Only its hero can prevent the annihilation of the city.\n\nThe refinement in action sequences and special effects is delightful to watch. This is by far, the best that our cinema has achieved. Krrish's entry over the city's skyline is simply stunning. But then there is the unwanted overacting by people on the airplane. The visual effects of Krrish's antidote deployment look really cool but that is only followed by a song praising him with God, Allah and Bhagwaan. The climax seems unlike Rakesh Roshan. Not to discredit the director but the sequences look incredibly powerful and thrilling, were it not for the similarities with that of 'Man of Steel'.\n\nThus, Krrish 3 leaves the impression that things have evolved in the past 6 years. The action, the budget, the superhero's powers, the villain's malice and strength as well as Rohit's role as a guiding father, have evolved collectively to create a bigger impact. However, the flaws are deep and are many. Music by Rajesh Roshan is perhaps his dullest work. The biggest flaw however, is that the story seems to follow the action. Big action sequences were visualized and the story seems like an afterthought to the 100 crore ideas.\n\nHrithik Roshan is much better at playing the paternal role of Rohit where he is so distinct from the dull and bulky Krishna. After several years, he still portrays the same innocence, silliness and intelligence that won him accolades. Priyanka Chopra can of course play into the melodrama and create more forgettable moments of the movie. Kangana Ranaut on the other hand, plays the role of a mutant very well. Her evil form is as convincing as her guilt ridden one that admires Krishna. Rajpal Yadav has barely 3 minutes of comedy and he does well to make us laugh. Vivek Oberoi maintains good composure as a handicapped villain. His aggression is focused and we seldom see him overact when he easily could have. Only if he were given a better metallic suit for the climax sequence, he would've had more fans.\n\nRakesh Roshan had everyone's hopes up with this huge release and with Hrithik averaging one movie a year (if that), the audience shouldn't be blamed for expecting a lot. The script, storytelling and little brother's music do not work for such expectations and a film of this budget but the action sequences do when they need to because of the adroitly crafted visual effects. Cinematography in those sequences is quite stunning but not impressive otherwise. As the film closes with the sun setting over Bombay's skyline through a panoramic aerial shot of a construction crane, its hero stands tall on the edge, observing with a watchful eye and a keen sense for any looming threat. That visual is convincing. The idea of such a hero is convincing. Krrish being that hero, is convincing."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "NpMoviez",
        "review_rating": "3",
        "review_title": "Stupid and hilarious!!",
        "review_detailed_main": "As much as I adore \"Koi ..... Mil Gaya\" (2003) and \"Krrish\" (2006), I loathe their sequel i.e. the abomination named \"Krrish 3\". The first movie was influenced a lot by \"E.T. the Extra-Terrestrial\" (1982) and \"Spider-Man\" (2002). However, it had a story to tell and it did. Similarly, \"Krrish\" was pretty much influenced by the principles of Batman from \"Batman Begins\" (2005), a lot of actions from \"The Matrix\" (1999) among many other popular superhero films. It told a good origins story and was fine on the whole. And one more thing, their target audience were mainly the kids, so they were enjoyable enough as kids movies. But this movie? Oh hell no! Unlike the first two, it tries to be more than it is - an epic superhero movie of all times. This, despite (in its core) being a kids movie, feels like a cheesy rehash of some bad Hollywood superhero movies. As a kid's movie, it's something that even the kids will consider to be dumb, compared to other films made for them. It is superbly lazily written. It has no story inside it, the major plot points being ripped off of \"X-Men: The Last Stand\" (2006) mainly. That was the most commercially successful X-Men film at that time, and at the same time a pile of stinking trash. Since Bollywood wants to make money, they copied shamelessly from that movie. A lot of things are similar to \"The Avengers\" (2012) and \"Man of Steel\" (2013) regarding the destruction that takes place in the movie. There are some desi plotlines in this movie that feel incredibly hilarious. Just to make it look different, they made use of the same old story elements that is predictable to say the least. Leaving aside the Hollywood ripoff things, it creates a huge number of plot holes and inconsistencies regarding the franchise. The way Rohit speaks after the events of the first film doesn't explain itself. He was intelligent but still foolish after the events. And Krrish's powers are still not explained, which feel like the over amplification of Rohit's powers. In this movie, it feels like Krrish is a love child of Superman, Batman and The Flash rather than Rohit's son. Kangana plays the love child of Shadowcat and Mystique. Vivek Oberoi who looks like an illegal son of Saif Ali Khan in this movie, plays the love child of (drumrolls) Professor X and Magneto. And these aren't the spoilers. The only genuinely good thing about this movie is that Hrithik Roshan is really great as all the three characters - Rohit, Krishna and Krrish. The other thing I really had great time with whilst watching this nonsense was trying to figure the X-Men character they ripped off to create the character I am seeing on screen. Apart from these, nothing was there, except trashy things. The songs were useless in the first place, and to make this garbage more stinky, it greatly hampered the pacing of the movie.\n\nScore : 3.1/10\n\nGrade : E+\n\nLabel : Epidemic"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "snaidu422",
        "review_rating": "8",
        "review_title": "Make way for the Indian Super Hero",
        "review_detailed_main": "Once in a while comes a movie which makes you wish you were a kid all over again, Rakesh Roshan has managed to create one such movie.\n\nKRRISH 3 satisfies that child in you, successfully creating a desi superhero on par with his Hollywood peers. The sheer brilliance of the movie lies in the maker's vision-a vision which people would have brushed aside as sheer madness five years ago-a vision coupled with brilliant special effects (courtesy sharukh's red chillies) give us an amazing roller coaster ride into the world of super heroes, super villains and mutants.\n\nKrrish 3 begins from where Krrish ended, beginning with a voice over of Big B reminding us of the events of the previous two films, reasonably so since all the three films are tied in so beautifully that audience actually truly understand what a trilogy actually means.\n\nVivek Oberoi plays a Kaal a paraplegic who is obsessed in finding a cure for his disease ends up creating mutants and slowly the hatred towards his fellow human beings turns into imagining himself as a member of superior race. Never has villainy so chillingly portrayed-here is a villain for whom you actually feel sorry and at the same time feeling terrified about the things he is capable of.\n\nHrithik Roshan plays Krish and Rohit-the transition should be seen to be believed. He portrays a innocent, well meaning old man on one hand complete with prosthetic s doing overtime and on the other hand plays the vulnerable superhero.\n\nPriyanka Chopra's Priya starts off ordinary like a normal Bollywood heroine but changes colors and portrays different shades of the same character.\n\nKangana Ranuath is the surprise package playing Kaya-a mutant capable of shape changing, manages to evoke sympathy even when showing her evil side. The scene where she rescues baby from getting killed and the reaction she receives from the people around her bringing her to question the sides she is taking....the one scene showcases Kangana's real histrionics.\n\nThe ending with characters dying and buildings destroyed brings us memories of the super hero flicks of the 80's Hollywood. The entire climax leaves the audience with bated breath with surprises galore.\n\nThe destruction of Krish Statue and Kaal's appearance thereafter is one the best scenes in the movies coming second only to the introduction scene of Krish-when he actually saves an aircraft from crashing in quite different way then his Hollywood peers would have done.\n\nWhile at it, the movie is not without its flaws, the major thing here is the heavy superman and x-men hangover-Rakesh Roshan actually lifts characters from both the movies. Come on! who in his right mind will name his kid Kaal. The songs are so out of place. Rajpal Yadav's character is wasted-the way the character shows up on the screen, it would have helped the movie in a lighter tone had his character been more fleshed out. Kaaya showed immense promise as Krrish's sidekick, too bad we don't get to see her that way-Rakesh Roshan should have given it a thought.\n\nAll said and done, Krrish lifts the jinx off Indian superheroes...Yep even we can make a good kick ass Superhero movie and get away with it"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "sammen-84304",
        "review_rating": "7",
        "review_title": "I love all the songs and dances in this movie. I just luv Kangana Ranaut. A bit bad ending.",
        "review_detailed_main": "Very good movie. The ending sucks a bit. Chopra and Ranaut shines :-)"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rest-peacemine",
        "review_rating": "1",
        "review_title": "What has they done to krrish sries",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rehaanready",
        "review_rating": "3",
        "review_title": "7 years of waiting and this is what i get!",
        "review_detailed_main": "In 2006,I loved Krrish but now after waiting seven years for Krrish 3 I will not be looking forward to Krrish 4. 3 reason why krrish three is so bad.\n\n1)Music. It's music is not good for your ears and the lyrics fails to connect to the film's plot (like any bollywood soundtrack does,it connects to it's plot.)\n\n2) Too predictable. I didn't try to ,but it turned out I predicted the whole film. I wasted £15 just to predict a 2 and a half hour movie. NOT!\n\n3 (finally) ) Priyanka's role size. It is just tiny. She only appears in like 7 scenes.\n\ni give it it 3 stars for the VFX,kangara's and vivek's performance."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "adityalovesnisha247365",
        "review_rating": "1",
        "review_title": "very sad",
        "review_detailed_main": "rating 1 as 0 is not available. only good part is of a grown man jiggling his jaw. the father son duo thinks that Indians don't know anything about Hollywood. granted they copied the first movie of the trilogy off ET, but still... copying x men is just pathetic... and the reverse star wars theory was predictable too... and the most unique power of any superhero... tap dancing with converse. no real ideas for the story... a super villain who steals ice cream from kids? really??? no real ideas for songs... using a lyric related to Gandhi and the independence of India is disrespectful. stop treating the Indian public as infants..."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "MuviFan73",
        "review_rating": "6",
        "review_title": "Could have been better!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "shaik-shavali",
        "review_rating": "3",
        "review_title": "A forgettable dumb movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "papanloveu",
        "review_rating": "9",
        "review_title": "Indian Symbol!!",
        "review_detailed_main": "Movie has a normal story, but charecters are very nice on screen. Kangana Ranaut and priyanka chopra are ultimate in this film, by their acting. Hrithik Roshan, as usal impresses with his nice acting. Vivek Oberoi as bad guy was outstanding."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Ali_mozaffari_1999",
        "review_rating": "7",
        "review_title": "Exaggeration along with adventure",
        "review_detailed_main": "Like the previous series, the beautiful storyline and the most important event, the challenging events that made the film more attractive. But along with all, this exaggeration and exaggeration reduced some of these beauties, If the film was a little closer to reality and away from the false induction of the protagonist it would be more acceptable"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "aliahmedsiddique",
        "review_rating": "1",
        "review_title": "Waste of Time, Money and Energy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "MessMaker",
        "review_rating": "8",
        "review_title": "Amazing story. Unbelievably better than expectations. Terrible VFX",
        "review_detailed_main": "Watched this movie yesterday. 31st October. Yes. Very surprisingly, it released ahead of India in New Zealand (and Bahrain, I hear). Huh, what's that about? Not that I'm complaining :)\n\nWell, anyway, this movie. Wow. I honestly couldn't believe it. I am the biggest 'Krrish' fan. Despite the obviously bad VFX (from the trailer) and all that, I very desperately wanted to watch this movie. Went in with low expectations – A result of the VFX in the trailer, the talks of it being copied from the Hollywood Superhero movies and all such crap.\n\nBut this movie. The story actually evolved during the movie. And, did so grandly, unpredictably. It got better and better and really amazed. Like any other Indian movie, it OBVIOUSLY has its very cheesy, corny, childish, too-perfect-to-be-realistic, dramatic (All combined at times, oh dear god, the embarrassment) scenes & dialogues. But the plot. The Story. Amazing. As the movie goes on, it keep us conspiring about the actual complete plot, but, when it hits us, it's really something. It turned out to be very realistic, in a way. Had everything. Romance, action, drama, comedy, tragedy (That damn scene which broke my heart), whatnot.\n\nAnd, the acting was way beyond amazing. Hrithik literally more than perfected it, whether it was as the lovable Rohit or Krrish, the best superhero ever or the good hubby Krishna. He delivered it. He killed it. Priyanka Chopra did very well, too. Also, this was definitely Vivek Oberoi & Kangana Ranaut's finest acting yet in their entire careers. Great job, Rakesh sir. The action sequence stunts and also the dances were choreographed awesomely. The songs weren't superb, but still. And, OF COURSE, the Krrish background score. That is obviously awesometastic! Could be very well compared to the soundtracks of Hollywood superhero movies.\n\nThe VFX, though, ugh. It ruined what the plot and great acting had built. Red Chillies VFX – WHAT THE HELL? I've literally watched cartoons & mobile phone games with better, way more realistic graphics. They really put our movie industry to shame. Terrible. They made the great acting and amazing plot look ridiculous. Laughable. AND, as usual, the extras (minute roles, pedestrians, etc.) in the movie were way too bad. Very childish, embarrassing and extremely stale. Be it the spoken roles, the reactions to crashes/collisions/explosions or the facial expressions, etc. etc., I could keep on going . . . To put it plainly, this was the awful part. Had so much potential, otherwise. Could've easily been a global blockbuster, even with the Hollywood. Well, next time.\n\nBut, this movie. Was. Thrilling. Wasn't perfect. But, real good. Extremely well above expectations. India's own Krrish is forever the best superhero."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "aashish-ak",
        "review_rating": "6",
        "review_title": "An extraordinary story with an ordinary execution",
        "review_detailed_main": "Laugh all you want, but it makes one of the most brilliant plots for a superhero movie.\n\n1. Life giving device 2. Mutants (Maanvars) 3. Krrish saving Mumbai City from an epidemic. 4. Half brother (Kaal), a villain 10 times more powerful than Krrish himself. 5. Villain taking over Mumbai. 6. A great gladiator match between good and evil.\n\nAnd the list goes on, it's a great example of brilliant writing but poor execution. Too much to show in a single movie, but I still love it because of not trying to copy Hollywood and maintaining it's very own original Indian feel. But many still troll it because we're just used to mock any effort Bollywood makes to make to make a great movie as \"It's not as good enough as Hollywood\", guess our minds are yet to have independence from white supremacy."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ar-anmolrawat",
        "review_rating": "5",
        "review_title": "When will Bollywood get Original?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "darkshadowsxtreme",
        "review_rating": "1",
        "review_title": "Krrish ek soch hain jo hum tak nahi pahunch paye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "simplyshadaabkhan",
        "review_rating": "1",
        "review_title": "Very Childish and Immature",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "An Entertaining Superhero Flick!",
        "review_detailed_main": "The third film in the Krrish series after Koi... Mil Gaya & Krrish, 'Krrish 3' is An Entertaining Superhero Flick, that boasts stunning action-sequences, superlative performances & a superb second-hour, working on its advantage.\n\n'Krrish 3' Synopsis: Krrish finds a new nemesis in the form of Kaal, an evil genius, who selfishly is misusing his powers to spread fear, death and destruction. Thus begins a battle between the superhero & the super-villain.\n\n'Krrish 3' has an ordinary first-hour, which doesn't really impress. Too much time is dedicated in introduction characters & the slow-pace doesn't help. But, the momentum grows in the second-hour in a big way. Its gripping & entertaining. The climax, in particular, is mesmerizing. The climatic battle between Krrish & Kaal left me spell-bound. But the excessive running-time needed some trimming, at least by 20-minutes.\n\nRakesh Roshan, Honey Irani & Robin Bhatt's Screenplay lacks grip in the first-hour, but picks up rapidly in the second-hour, which is genuinely terrific. Roshan's Direction is ambitious & applaud-worthy. Graphics are very well-done. Cinematography is top-notch. Editing could've been crispier. Action-Sequences are stunning. Music by Rajesh Roshan & Background Score by Salim-Sulaiman, are okay.\n\nPerformance-Wise: Hrithik is fantastic as Krrish & Rohit. He enacts both the parts with utmost conviction & honesty. Vivek Oberoi is totally despicable as Kaal. He creates a memorable, loathsome villain, thanks to his solid performance. Priyanka Chopra looks gorgeous & delivers sincerely. Kangna is first-rate. Rajpal Yadav is funny in a cameo.\n\nOn the whole, 'Krrish 3' isn't perfection, but attractive entertainment nonetheless. Recommended!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ashoklich",
        "review_rating": "3",
        "review_title": "This is a terrible movie",
        "review_detailed_main": "This movie could more aptly have been named Khichdi 3 than Krrish 3.\n\nWe were just starting to believe that Mumbai is making movies with originality and the trend of copying from Hollywood is over, but not in this case.\n\nWidely touted as India's first super hero movie, this one takes MI-2, Spiderman, Matrix, X-Men and a bunch of other Hollywood movies and makes a complete mess of the mixture.\n\nIt's a real pity that the talent of Hrithik Roshan is not just wasted, but completely destroyed in this movie. It is one of the few movies that I could not watch in it's entirety and the lowest rating I have given any movie this year.\n\nDo not watch it, if you have anything else to do."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ahirjoy",
        "review_rating": "8",
        "review_title": "The Best Among 3 Sequels. A Revolution in Indian Sci-Fi Genre",
        "review_detailed_main": "A very good entertainer but not for the very serious philosophers!! You need to have an open mind to enjoy the movie. Science-Fiction Superhero movies with the subjects like DNA, Antidote, Cloning etc are still very uncommon in India. X-Men, Superman, Spiderman, Independence day, Matrix kind of movies are still way out of reach for the masses as it is difficult to identify ourselves with the complicated concepts in contrast to the action heroes boarding expresses or killing Pakistani army.Hats off to Rakesh Roshan for his brave attempt starting from \"Koi Mil Gyana\" which brought a revolution in Indian cinema for Sci-Fi genre. Krrish-3 is the best among all the sequels. Hritik was extraordinary as usual, he has played 3 Avatars - Rohit, Krish and Krishna with great ease. How I wish he had acted in more movies frequently, Indian cinema has missed his acting talents which is far superior than his dancing stances or great looks for which he is better known for. Priyanka as Krishna's wife and Vivek Oberoi as the main villain (Kaal) was good, but the real surprise package was Kangana, her acting as one of the Manavar (Mutant) who can change her appearance was simply excellent. The visual effects and action stunts can compete Hollywood movies. The only downside of the movie is the music and songs, none of them touches your heart. Yes, the movie was heavily inspired by X-Men, but that was well customized for Indian context. I loved the concept \"All those who have a kind heart to help others are Krrish\"."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "achyutktelang",
        "review_rating": "",
        "review_title": "Good but not good enough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Abdulxoxo",
        "review_rating": "6",
        "review_title": "Overblown",
        "review_detailed_main": "First off, let's get the good stuff of out the way, the special effects are surprisingly very good though not great. The film is well paced, it flows well. The performances are solid: Hrithik Roshan does a superb job playing double role, but I think he's performances as the father is way better than as Krrish, 'cause when he's playing Krrish there's no room to showcase emotions, because of the mask and all. He can just tears up and shakes, which gets repetitive after sometime. Kangana Ranaut Is also good, she rocks and there's a development with her character that I thought she handled it well. Vivek Oberio seems to be having fun with his character. Priyanka Chopra is good but her character is shallow, although she's particularly amazing in the part where she's Kaya in disguise. The action is fun to watch. Okay that's about all the positives I can think of about this movie. Now to the defects, straight up I thought this movie was very cringy, there's way too much melodrama for a superhero flick. The fight sequences are too long and quite immature. The choreography of the fight is over-the-top. The music is garbage and overly dramatic. The background is score is too loud and melodramatic; When Krrish saves someone or is doing something heroic, the score in the background plays that cringy \"a a aa a aaaa' song, I understand it's kinda like a theme song but it's way overplayed. The story is quite plain even if that's forgivable, the characters are poorly drawn: Kaal, the villain is pretty uninteresting, he just come across as a clown, he wants to take over the world but his motive is never clear. Krrish as the titular character is also quite boring, he lacks any sort of personality.\n\nThis trilogy started with Koi Mil Gaya; a simple story about an alien-meet-human, to Krrish; a bit more mature with superhero elements with the usual Bollywood sentiments then there's Krrish; overblown, over-ambitious and melodramatic. But in whole, the trilogy as far entertainment is concerned, it offers tremendously."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Captain-Pingoo",
        "review_rating": "3",
        "review_title": "Krrish Crashhhhh...",
        "review_detailed_main": "Our Indian Superhero, while saved people and defeated villains, failed to save the movie.\n\nThere is no doubt,Krrish is a tailor-made role for Hritik Roshan, he embodies the character perfectly,his performance, physically and emotionally, is very good.Unfortunately,only performances are the best thing about this movie.\n\nPerformances - Hritik is Outstanding,As Rohit Mehra he even outshines Krrish. Kangna impresses again and is perfect for the role, while Priyanka delivers well. They could have done something interesting with Priyanka's character to make a difference.Promos were generous enough to give a glimpse of Vivek Oberai as Kaal, and i was somewhat impressed but the character is dull and boring.\n\nScript and dialouge- No originality.It's formulaic.Characters lack growth.Villains were more like Indian cousins of Hollywood's X-men. Nothing seems new. Hindi movies are incomplete without OTT melodrama and cheesy lines.But c'mon not in Superhero flick....unfortunately, it happens....the first half is laughable ( or you can cringe if you want to )...Second half is serviceable enough.\n\nSongs ---- take an advice, do keep some nice collections of songs in your ipod and play them during any of the movie's song.You can put on the loudspeakers if you like.No one will complain b'cause the movie has the MOST AWFUL SONGS. Krrish songs kinda grew on me later but here the songs are repulsive....\n\nEffects - Commendable by Indian standards and its budget but it fails to reach a level where moviebuff, who has watched a lot of Superhero flicks, can appreciate it.\n\nTo RAKESH UNCLE, DON'T WORRY , YOU HAVE ENTERED THE 200 crore club."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "dasthagirs8",
        "review_rating": "10",
        "review_title": "Good Plot,decent special effects",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "dineshprakash",
        "review_rating": "6",
        "review_title": "Graphics are good but film is just OK",
        "review_detailed_main": "Director Mr. Rakesh Roshan work is fine. He has written the story also. Story is good, even lots of things are very logical but screenplay gives jerk to them. Dialogues are good but not go completely with the mood and genre of film. Graphics save and support the film well. Film moves between lots of ups and downs, creativity wise and pace wise too, this is due to lots of screenplay writers are there, so the movie is not seamless. Even, a typical villain have hearts like typical Indian films, she can feel love and applause. Villain and Hero, are full of super powers but still they prefer hand to hand combat rather than playing mind game. Hero can sense the wrong things happening from far but he misses to figure it out in home, how and why? Emotional quotient is less than it's first part Koi Mil Gaya. Pre climax is slow and lengthy. Performance wise, hats off to Hrithik Roshan. He makes you believe in double role that he really posses two personality. Rest cast are OK. Music is fine but lyrics drags it."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "amruthvvkp",
        "review_rating": "1",
        "review_title": "Krrish 3: No more than a mere rubbish...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "mike-nim",
        "review_rating": "1",
        "review_title": "Worst movie EVER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "bludhunt",
        "review_rating": "4",
        "review_title": "Its lack of original action sequences is its Achilles' heal.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "vaibhavminocha-vm",
        "review_rating": "6",
        "review_title": "Average, but packed with an amazing ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "maarakan",
        "review_rating": "1",
        "review_title": "Absolute mind-dumbing retardedness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rpuyasi-945-677914",
        "review_rating": "9",
        "review_title": "let's hope for a better future",
        "review_detailed_main": "I am not a big fan of Bollywood movies but I kind of like this one. Not because it is extremely successful but it is watchable and kind of different from other Bollywood movies. I agree with most of guys who have posted reviews that this movie looks like a copy from many successful Hollywood movies. The 2nd part of the movies is almost like another episode from x-men series. But I am not going to criticize the movies because of the valiant effort made by the producer/director/film crew to produce a blockbuster movie equal to a Hollywood one. It should be appreciated. At least we can hope for better films in this category from Bollywood in the future. What I am doing is encouraging it. I don't like what they did to great Priyanka Chopra. She is one of my favorite and she is doing nothing but appear here and there in the entire movie. I wish to see more strong acting from her if there is another episode of Krish."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rosewood1231-246-424080",
        "review_rating": "7",
        "review_title": "A Commendable Effort !!!",
        "review_detailed_main": "I just watched Krrish 3 with some of my friends. This is my first review so writing what I felt after watching the movie.\n\nWarning: Sorry if you find any spoilers...although they are not intended.\n\nThe Positives - Awesome Special Effects.. Loved Them (As per Hindi Film Industry's expectations & budget)\n\nHrithik As Rohit Mehra(Still A Better & More Lovable Character Than Hrithik As Krrish Or Krishna Mehra)\n\nVivek Oberoi As Kaal ( yes.. Strange but true.. He does make a great Villain)\n\nStory Concept (though definitely inspired from Hollywood but it's a good attempt nonetheless)\n\nNegatives -\n\nThe Maanvars (you can relate each and everyone of them to their X-Men counterparts)\n\nThe Unintentional Comedy due to some silly dialogs & scenes (although we laughed a lot on those which felt good)\n\nThe Songs (Ohhh.... They are Pathetic)"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Sherazade",
        "review_rating": "5",
        "review_title": "This fails the two preceding films big time...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "meenotigoswami",
        "review_rating": "10",
        "review_title": "A visual treat",
        "review_detailed_main": "I had a huge expectation from this movie and it delivers.Krrish 3 packs a punch.It is far better than Krrish which I didn't like.Vivek oberoi nailed it as a villain.His character will be remembered for a long long time.He overshadowed Hrithik in every scene with his presence.Kangna did a better job than Priyanka.Music is average.The climax is something which we have never seen before.Best vfx in the history of Bollywood.Those who have rated it below 8 stars are either Hrithik haters or Salman Khan fans. Overall Krrish 3 is yet another feather in the cap of Rakesh Roshan.It's a masterpiece which cinegoers can't afford to miss.All time Blockbuster."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "surajumarye15",
        "review_rating": "7",
        "review_title": "Krrish 3 didn't make the same mistakes as RaOne",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "fawad-cse",
        "review_rating": "5",
        "review_title": "Bollywood!!! You need a serious revisit to your take on Action/Sci-Fiction Films.....",
        "review_detailed_main": "Haven't found much attraction in this Version of Krish, have to fast forward on various occasions , I mean by putting up immature special effects and action sequences into a 2+ hours of film doesn't mean its gonna stick the audience to the screen for the whole time. The film directors in Bollywood should learn the way to not get over ambitious with Science Fiction Projects and over do things that could have been done the other way. For Example Rohit doesn't have to narrate everything that he is going to do next, that is annoying and looks immature in a film with such a budget (Learn something from your Neighbors latest release WAAR). Please avoid typical dancing sequences in such genre films, it distracts from the original story-line (Please don't tell me that Songs are one way of expressing the story, its an Action cum Science Fiction film for God Sake)\n\nOverall I Rate it 5/10 only for the effort done by the poor Special Effects Team, which didn't got the right production team to work with for such films."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "kunalbansal1312",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "its good to see that Bollywood is trying to come up with new concepts and trying to better its film making techniques, but it is failing miserably. i don't understand why Bollywood producers have to copy every single concept from western movies! why don't they get creative and come up with their own concepts? what this movie is, is just a cocktail of scenes and concepts from different Marvel movies.Come on Bollywood grow up and stop being such a wannabe! i admit that when it comes to cinematography, visual effects and animations Bollywood has made remarkable improvements. but instead of just making high budget movies, they should concentrate more on getting good, ORIGINAL scripts. what makes a movie good is its storyline, its honesty and not just its visual effects and its budget."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "arghod",
        "review_rating": "4",
        "review_title": "I felt i am watching cartoon.",
        "review_detailed_main": "I felt i am watching cartoon. I felt i am watching cartoon."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "manishgajjala",
        "review_rating": "6",
        "review_title": "The Roshans have disappointed",
        "review_detailed_main": "Movie is Average. Without Hrithik Roshan's acting the movie would have been a complete disaster. He did justice for all the 3 roles he played. Graphics were impressive especially krrish's entrance. Amazed with Kangana's performance. One of the most horrible music for such a big budget movie. Cmonn hrithik, Don't give importance to family when it comes to your career. Music must be the main backbone for any movie... Rajesh Roshan composed horribly. Rakesh Roshan has started imitating characters from X-MEN which was very obvious even for a kid. Overall, being a die- hard Hrithik fan, I am totally disappointed with this movie."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "anand_mongol",
        "review_rating": "2",
        "review_title": "If you don't have time to watch; Pirates of the Caribbean, Terminator, X-men, Catwoman....",
        "review_detailed_main": "If you don't have time to watch;\n\nPirates of the Caribbean, Terminator, X-men, Catwoman, Resident Evil. Matrix, Transformer, Dark Knight, Old batman movie.....\n\nBasically any movie - JUST WATCH Krrish 3!!\n\nI don't understand why these kind of actors, actress acted and directors directed became so successful in India? It is a big fusion of all the different actions, scenes & soundtrack of Hollywood movies."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "manishkmr-69957",
        "review_rating": "10",
        "review_title": "That was not marvel creation.",
        "review_detailed_main": "Hollywood me 10 baar mar ke ate hai tho thik.\n\nYaha pe utna accha nhi hai. 🤐 Some crispy Hollywood fans."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "tharukshan12",
        "review_rating": "7",
        "review_title": "Survives on it's Mind Blowing Visuals and Screen Play!!!!!!!!!!",
        "review_detailed_main": "I have just seen this movie and when i was watching it i hope that it will be much better than its prequel Krrish, however according to me Krrish (2006)is better in the whole franchise. Regarding to this movie there are both plus and minus points to be highlighted which has been provided below.\n\nPlus points : First of all thank you to develop this movie's visual graphics like Hollywood style. And this movie has a good screenplay which will make you to be thrilled and make you to be surprised. All characters have given their best according to their appropriate role.\n\nMinus points : Some of the scenes are seem to be copied from Hollywood movies. And some unnecessary songs could have been cut from the movie. Some scenes couldn't be understood clearly.\n\nOn the whole Krrish 3 should be much appreciated and should be seen by super hero movie lovers."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "thomson7",
        "review_rating": "2",
        "review_title": "I Wrrish I hadn't watched this",
        "review_detailed_main": "This movie stinks. I loved KMG. Krrish was fine but highly questionable. Hrithik is my dog. This is the only movie I've ever finished at 1.5 speed to just get it bloody over with. I'd recommend 2.0 with Rajinikanth over this if you really, really need an Indian super hero movie fix."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "yunusitboss",
        "review_rating": "9",
        "review_title": "Krrish 3 (U/A) Hindi ----------- my Rating : ★★★★½ BEST SCI-FI MOVIE EVER SEEN",
        "review_detailed_main": "Kalyana Samayal Saadham (Tamil) (U/A) New movie Reviews and lots more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nKrrish 3 (U/A) Hindi ----------- my Rating : ★★★★½ BEST SCI-FI MOVIE EVER SEEN\n\nSTRENGTHS :- * Story Screenplay Direction : were outstanding .... * Casting and Performances : really good ... * Action sequences : were stunning ..... * BGM : was fantastic in all scenes ......\n\nWEAKNESSES :- * Visual effects : was slightly seen as old movie graphics but well tried by Indian team .....\n\nFINAL VERDICT :- * Overall.... it is the best super hero movie in India to be watched by all.....\n\nKrrish 3 is a 2013 Bollywood superhero science fiction film produced and directed by Rakesh Roshan. It is the third film in the Krrish series following Koi."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "navin_kamal2000",
        "review_rating": "6",
        "review_title": "I wish could had deposited my money in bank and earn some interests than watching this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nasimaktar-19906",
        "review_rating": "1",
        "review_title": "Copy All Action Scene",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "jaheenahmed",
        "review_rating": "5",
        "review_title": "The movie was similar to x men",
        "review_detailed_main": "In a interview , vivek oderoi said that he's role was inspired from Batman's the Joker. But in the movie his role was taken from X men's magneto and professor x"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "3",
        "review_title": "Cheaply copied from several Hollywood films",
        "review_detailed_main": "Funny cheap vfx.\n\nFunny scenes.\n\nWhile USA has Spiderman,Batman and Superman. There India has cartoon man(krrish)"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "prathamdeshmukh1",
        "review_rating": "6",
        "review_title": "Overall just so so ....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nikojohnson",
        "review_rating": "1",
        "review_title": "You don't watch a movie only to watch some special effects and VFX You go to Enjoy it",
        "review_detailed_main": "The whole movie is a CGI, this movie is nothing without special effects, This one lacks story and screenplay is poor . Krish had a good storyline , Krish 3 had a huge budget of money . But they could not use that money in a proper way. Krish could only jump one or two buildings at a time but in this movie , He flies like superman, jump from skyscrapers ,jumps high, has a huge number of super- villain, they sucks as they talk, their dialouge seems funny. Rather than looking scary they looks like they came to a fancy dress competition . Camera Angle on action scenes are funny too.. Kangana's Character was too forgettable ."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "shashank-mishra2008",
        "review_rating": "10",
        "review_title": "Krrish 3﻿ The Best in Bollywood YET !!! - Deserves MORE THAN 10",
        "review_detailed_main": "When the 1st promo came...people were like Batman Arkham﻿ City's Animation is much better than KRRISH 3..even i thought so..but it was only a 2 minute clip..while in the movie out of 1000 action VFX scenes only a few look awkward like poor effects.\n\nThis MOVIE is a 'gem' in Indian CINEMA & will change the course of Bollywood Film-Making forever...there was nothing in Chennai Express﻿ other than headache due to TAMIL/Hyped Action Sequences/A fair comedy performance/& Zero-pointless Story.\n\nOn the other hand, KRRISH 3 contains PHENOMENAL-LOGICAL-Bigger than Action STORY PLOT, Outstanding Acting by Kangna Ranaut﻿, Vivek Oberoi﻿, Priyanka Chopra﻿ & The Best Work of Hrithik Roshan﻿ (The New Mr.PERFECTIONIST) who made ROHIT/KRRISHNA/KRRISH so memorable than any other character in entire bollywood .\n\nSALUTE to Rakesh Roshan﻿ (The Real MASTER MIND) without which there would have been no Successful ALIENS/SUPERHERO Genre. The only minor -vity was the SONGS which didn't took much time.\n\nBut this MOVIE had everything..Great DANCE-ACTION-EMOTION-a little bit COMEDY-Dhansu ACTING-& some great DIALOGUES.\n\n\"BEST MOVIE in the WORLD\"...can be watched 3 to 4 times.Hats off KRRISH 3 ... will be eagerly waiting for next KRRISH !!!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "GirishGowda",
        "review_rating": "6",
        "review_title": "Consequences are what sets it apart. A radical, yet fun superhero tale, but unfortunately packaged in a generic wrapper.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "dhothaka",
        "review_rating": "1",
        "review_title": "If Professor X made a baby with Magneto and dressed him up with a cheap aluminium suit, there you have the villain.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "viral1106-834-724217",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Hrithik looks ravishing, and really super cool as the Indian version of a super hero. One who is suave, macho, dripping with strength and charisma and can give Supermans, Batmans and Ironmans of this world a run for their money. In the third edition of the saga, 'Krissh 3' attempts to break the technological barriers that our movie industry faced with large scale action sequences. 'Krrish 3' has all the elements of an entertainer and a lot of potential to have given some serious competition to Hollywood flicks. One can't really complain about a somewhat predictable plot (after all superhero movies are supposed to be about the triumph of good over evil). He also makes the action and the fights look natural. He may not be the most gifted actor but he pulls off both Rohit and Krishna well. Priyanka Chopra looks pretty as the 'wife' and doesn't have much to do.The background score by Salim and Suleiman is good and follows the moods well, Over all best super hero movie till date in India, this movie can be compared to any super hero film from Hollywood because it deserves ."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "amanand838",
        "review_rating": "7",
        "review_title": "Diwali Blockbuster Providing Popcorn Entertainment.",
        "review_detailed_main": "The reason behind why BOLLYWOOD is way behind in producing high-octane-intense-action-packed-superhero movie is that they lack the guts of making a great cinema. They often have spoiled it by bollywoodising it. Drona lacked the content or rather I'd say it lacked everything. Ra.One was excruciatingly funny. These movies suffered with the idea of doing so many things at a time. A large amount of melodrama and unwanted commercial breaks in the form of songs diluted the whole tension and ultimately the movie came out as a comedy of errors.But the one movie which still stands tall as an epitome of Superhero-Entertainment from India was Robot(Enthiran) which had great special effects providing the heart of this genre an edge.\n\nKrrish3 suffers from many of these problems which sometimes is really interesting but the melodrama and the songs which are a total letdown makes it dull.But ask me, how is it in terms of action, special effects and CGI? My answer: Don't know how they pulled it off but as far as Special Effects, Action and CGI are concerned this is the best from India hands down. Krrish3 is a helluva movie when it means business. You start praying when your Superhero Krrish starts fighting against the evil and saves the world. Watch out for that sequence when Krrish saves all the passenger of an aeroplane and many more in the climax.Rakesh Roshan has made this movie with two minds. Sometimes he makes a fool out of you but then there are really some edge of the seat sequences.But the balance made by him between the emotional(only in some parts) and the action sequences is worth appreciating.\n\nIf you need the audience to cheer for their hero when he fights against the evil then that hero's portrayal should be worth it. We have heard actors playing double roles but here Hrithik Roshan is playing three roles at a time and then after watching if you still feel there is a difference of feel in each of the three(Rohit Mehra,Krishna and Krrish),it really is an achievement. Of all the three Rohit Mehra(the one with the tummy) is the pick of the lot with his Koi... Mil Gaya's childishness and Krrishna(the one with 8 packs) having not much of scope is acceptable with his handsome hunk looks. But the real difficulty for him would have been in playing Krrish's role where his green eyes had to do the talking and believe me it did.Jr. Roshan and Special Effects are the USP of the film.Priyanka Chopra and Kangana Ranaut are believable. And lastly Vivek Oberoi (Kaal) which is sometimes exemplary and unintentionally funny both.\n\nRajesh Roshan's music and the lyrics is a total letdown in this movie. I don't get the reason behind the presence of the songs in this movie. And that too Raghupati Raghav(you can tolerate as Hrithik pumps up the floor in this one to save you) ,God Allah aur Bhagwan and Dil Tu Hi Bata. I am still recovering. But talk about the background score Salim-Sulaiman has done a blinder in K3.\n\nIf Sr. Roshan wanted he could have made a great movie by avoiding the roona-dhona and songs but overall this movie will be popcorn-entertainment for some and an average for others. I recommend you go watch this Diwali Blockbuster once to celebrate our entry into the Special Effects arena at the international level.\n\nP.S: I enjoyed this one very much as compared to the previous two releases we had in Diwali.\n\n3/5"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "successoflibra",
        "review_rating": "3",
        "review_title": "Krish 3 or sh_t 3",
        "review_detailed_main": "What the hell is wrong with Industry.. why don't they are using their own mind. why just doing copy paste stuff.! Krishh 3 a Hindi version of XMEN Series. I like Koi.. Mil Gaya.. Krish was also good but. Krish 3. Well, 1 thing which 1 like was the animation.! nice effort like it.. but the story waste the animations efforts. Such a big budget movie and story like this. why don't they concentrate on script and choreography. Krish3 is just a waste of time and money. Don't like it.\n\n3/10 rating just for the animations. The story is more action based than character.\n\nPersonally i don't like it but it wasn't a big issue. I am just thinking that was it a Xmen 3rd class copy. I don't understand why they copied every character of Xmen and Why Hrithik got all the power of each XMEN superstar.?\n\nWell, go check it out. for the animation factor. a good science fiction effort but a bad story and script.!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "fernandogowda",
        "review_rating": "3",
        "review_title": "so much potential and yet this movie was so horrible",
        "review_detailed_main": "There is no story at all.. If the director would have got a decent script and executed it this movie and franchise could have become great.. but instead we are served with a horrible mixture of every Hollywood super hero movie made.. and by that i mean pick ANY Hollywood superhero movie and you will find at least one scene from it in krrish 3.. Even the dialogues have been picked from the enlist movies and blatantly translated to Hindi without regard to how ridiculous they sound.. Its a shame that the first real Indian superhero is nothing but a lame caricature. Rakesh roshan should stop direct these movies and get a more able and serious director, as he's the producer anyway he ll make all the money , but at least the audience gets a good movie."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "virindra",
        "review_rating": "2",
        "review_title": "This movie couldn't be more stupid.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "niraj-yadav72",
        "review_rating": "6",
        "review_title": "Best Ever Bollywood Superhero Flick",
        "review_detailed_main": "To be honest, it was good. Much better than expected. Great visual effects.\n\nGood work by Hrithik in both the roles. Priyanka got a small screen space. But Kangana surprised. Good work from her as well. As I told this was better than expected and I enjoyed. First half of the movie was very fast paced and happening which made me feel interval come a tad too early. Second half has more action and some more songs. Except raghupati raghav one none were good.\n\nOnly let down was more than necessary songs. Also in some places the background track was scary and felt weird.\n\nIf ignored above two points ( which I did) this is a great movie, good for kids. And acceptable Indian Superhero :) From the credits, the animation and special effects team was Indian. Kudos team.\n\nAlso the movie ends with potential of Krrish 4 Would wait for that."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ramzidrake",
        "review_rating": "4",
        "review_title": "The good, the bad and the worse.",
        "review_detailed_main": "Okay so I'm gonna get to the point.\n\nThe Good- The good part about this movie is Hrithik Roshan because he makes Krrish believable. He actually does look like a super hero so that's a plus and i must admit Krrish is more believable than Ra-One. Also, The movie is entertaining at times and will make you laugh a little in a good way. And at last, the action in this movie is really good. It is enjoyable to see Krrish beast up the baddies.\n\nThe Bad- The bad part about this movie is that if you have seen any of the Hollywood superhero movies (like me) you will not enjoy this movie because honestly they are much, MUCH better. In Krrish 3 there is no character development and Krrish's strength depends on how much drama is going on in the movie for example he helps lift a plane but he has hard time lifting up a simple truck.. please tell me what kind of logic is that?\n\nThe Worse- It makes me so mad that the costume designers could not come up with a better costume for Kaal. He looks like he went to the junkyard and put scrap pieces on himself after polishing them. Also his super power origins is so ridiculous you'll see what I'm talking about. The story is weak and oh so disappointing music, I was expecting much more from Rajesh Roshan. And last thing, When Krrish jumps super high and lands on a building it looks so fake even for super hero standards and that is saying a lot.\n\nOverall- ONLY FOR KIDS."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "guardians-lucknow",
        "review_rating": "10",
        "review_title": "Out & Out Desi Action - Aventure, Drama and Futuristic Extravaganza.",
        "review_detailed_main": "Well most of the people are friendly with the names Batman, Superman, Iron Man, Spiderman etc. these characters have a legacy of more than 70 years, everybody knows who they are, what they do, powers, weaknesses etc. So it is much easier to make a movie on them when you already have so much references and specific guidelines. On the other hand in India people do know about Dhruva, Doga, Parmanu and others, But In Krrish-3 Rakesh Roshan has tried to establish a fresh new Superhero, and he deserves an applause for that. In my knowledge there must be one thousand superheroes are living on earth. So little similarity to each other is acceptable. The biggest threat for a superhero film is his audience, In India people don't accept much change easily and as a filmmaker 'Rakesh had to educate his audience'. I must say he did a splendid job. Acting wise Hrithik, Vivek and surprisingly Kangana have done justice with their characters. Priyanka looked the girl next door and did a fare job. Story and screenplay holds you well till the end, Vfx and Action scenes are good enough for everyone. Fight Sequences between 'Krrish and his enemies are marvelous', specially the war with KAAL. Vivek looked 'furious' and Sinister. Character of Rohit is the film's stronghold. Dialogues could be better at some places. Some scenes could be removed but that's an editor's fault. Films biggest back draw is its songs and background score. All in all Krrish is a family delight which you can enjoy with kids and parents."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "santoshtiwari19782010",
        "review_rating": "7",
        "review_title": "fantastic superhero flick from Roshan",
        "review_detailed_main": "Rakesh roshan has taken great risk while making such a huge movie.. and from God's grace it went well for the whole entire industry.. The movie is really entertaining with its content and Hritik roshan's splendid performance..Hats off to Rakesh Roshan who is fit for making Hollywood budget film according to Indian fans. the movie has made a new milestone in Indian Cinema...must watch movie...However I must admit that Krish 2 was fantastic as it had good engaging story right from starting to the end.We indians understand that in our country making Sci-fiction movie is really difficult as we have no qualified technicians, writers and good budget.. That is why we rely on Hollywood for watching good sci-fiction movies"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "BecauseIAmBATMAN",
        "review_rating": "5",
        "review_title": "Could have been Much better",
        "review_detailed_main": "PROS\n\nInitially my expectation were quite low as the trailer seemed like X- Men, Spiderman and Man of Steel. The movie exceeded my expectations in case of the basic plot. The basic story is not a rip off of any movie and neither are the character's motivations(except their powers are similar to X-Men characters, but that's forgivable). This movie is much much better than Ra.one when it comes to the storyline(though Ra.one and Robot had better special effects). The purely Indian vfx did what they could do with a meager budget(in comparison to Hollywood films) and without help from Hollywood. The special effects are impressive by Indian standards. And I commend the director to try and make such a movie. The final fight scene is impressive by Indian Standard( though it seems like Man of Steel with cheap special effects)\n\nCONS\n\nIn spite of a decent plot, the movie makes a mess presenting it as the plot drags for 2 hours and 30 minutes with ridiculous songs and cheesy clichés. One thing I hated about this movie is the way it tried to show the concept of Krrish as a symbol(like Batman). While in Dark Knight Rises the anyone can be Batman concept and the unveiling of Batman's statue seemed epic. In Krrish something similar happens with a minister unveiling Krrish's statue. But instead of feeling epic like in Dark Knight Rises this scene is cheesy and laughable as this scene is the premise to that ridiculous Bhagwan Allah song, so you can see Krrish dancing in front of his own statue. Also the concept of anyone can be Krrish(Batman) is shown as a kiddy concept somewhat similar to how Shaktiman gives moral values to kids. The special effects seem like a video-game cut-scene(can be forgiven).\n\nIn the age of Dark and gritty superheroes this movie basically is made for kids aged 4-13. I would have loved this movie if it came 6-7 years ago. Minus the songs I would have rated it 6/10(me being lenient) and minus the whole Krrish is a symbol subplot and I would have rated it 7- 7.5/10 but the movie as a whole is average"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "iimraann",
        "review_rating": "10",
        "review_title": "Even if you heard people say, 'this one copies work from many sources', the movie is actually very good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "geoexpert95",
        "review_rating": "7",
        "review_title": "India's first Home-Grown Superhero!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Chandreyee-CB",
        "review_rating": "1",
        "review_title": "waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "greg-e-porter",
        "review_rating": "5",
        "review_title": "As one who has little experience with Bollywood action movie or the Krissh series, I wouldn't recommend Krrish 3 because it's too clichéd, too over-the-top, and too long.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "supashaie",
        "review_rating": "1",
        "review_title": "Dosent even deserve 1 star if it was an object I would spit on it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "SivakumarBalachandran",
        "review_rating": "6",
        "review_title": "Desi Version of Superman, Spiderman and X-Men",
        "review_detailed_main": "The third movie of the 2003 Koi Mil Gaya series where we had Krish in 2006 and now after a long gap we have krish 3 of which Krish 2 is still missing. Just keeping the title confusion apart let us see what does the film delivers the audience. Krish 3 does a lot to entertain you especially kids but seems lacking originality in the script. On the story line it is nothing new what we see is parts and portions directly lifted up from some of the famous Super Hero movies in Hollywood like Superman, Spidermen and X-Men series. On the whole it's the shudh Desi version of superman and spiderman. But at the same time looking at the efforts made on producing good visual effects on screen we should say Krish 3 stands NO 1 in the Indian Super hero movie series like Endhiran (The Robot), Raw-one, previous Krish . So we can say its sure making well in Box office in India than a worldwide hit collection pertaining to the fact that bollywood didn't have any competitive release this Diwali. Coming to the cast we have got Hritik Roshan in the lead as the Super hero Krish, Krishna and the intelligent Rohit Mehra he has done his part clearly. I don't know what compelled Miss Chopra to be a part of this script because she didn't have much screen space except for the fact that she becomes the carrier for the Krish 4 franchise with her pregnancy. Kangana as Kaya-the chameleon temptress which is exactly the mystique from X-Men series has done a good job fitting perfectly to the skinny Latex outfit and the role as well. Vivek oberoi as Kaal the antagonist (again Prof X from X-Men) was OK in his character because he shows up more action towards the end and where most of the anti-role was done by Kangana. Coming to technical part VFX was the best in the movie and Music as well as BGM was below average. Director has worked hard in mostly quizzing the viewers to name the original movie in each scene.\n\nVerdict: Apart from all positive and negative things criticized here I would rate 3/5 because it doesn't stop entertaining you and for the effort to show something equivalent to World cinema. But strictly for fantasy movie lovers (if you see this movie as an Indian fantasy and strictly not comparing it with Hollywood's super hero movies). Especially kids Diwali treat.\n\n-Reviewed by Sivakumar Balachandran (bsiva84@gmail.com)"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "wasim-945-441017",
        "review_rating": "1",
        "review_title": "A slap on your face",
        "review_detailed_main": "The cast and crew of Krrish 3 may look at this movie as milestone in Indian cinema however, it turned out to be \"A SLAP ON YOUR FACE\". A completely illogical and stolen content from Hollywood superhero movie I have ever seen in my life. I must hand it to the entire team for making my decision strong about not wasting my money and watching Bollywood movies anymore. If you give the audience something crappy like this, at least have the decency to back it up with LOGIC.\n\nThe list of everything bad about this movie is so long that you could actually write a book about it which will actually be more entertaining than the movie. Enough said, it was an AWFUL movie and if you want to waste your money and time watching it, God Bless You then!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nazmul2050",
        "review_rating": "10",
        "review_title": "Best Bollywood Action FiIm Ever Made",
        "review_detailed_main": "Great acting, great star-cast, great story, spectacular action, breathtaking VFX, crappy music. Overall a more that decent film for the movie lovers. Respect for Mr.Rakesh Roshan for making such a huge film in a small budget of (!4 Million + 3 million for promotions. Hrithik has done it again. Both Kangna and Priyanka did a decent job. Vivek oberoi has made kaal's character more interesting but was quite disappointed with his poorly designed costume. Other mutants were just OK. Visuals are just awesome and did setup a high standard for an Bollywood. The only drawback of this movie is its irritating songs and felt that Rajesh Roshan was forced to score the music for this film. Overall really enjoyed it. Now waiting for the DVD release. Happy Diwali Everyone :)"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rashmi-miracle",
        "review_rating": "6",
        "review_title": "Not a disappointment at all",
        "review_detailed_main": "I was skeptical before watching this movie because after watching so many near-to-perfect Hollywood superhero movies I wasn't sure if I would like this one. But I must say it didn't disappoint.\n\nThe story is good but not flawless, it does not bore but seems a little too lengthy and draggy in the middle. Music section is a little disappointing, no complaints with the background music though. Anyhow, I don't get the point of songs in a superhero movie. They slow down the pace of a fairly speedy movie. But let's not forget it's a Bollywood movie after all. Same excuse goes to all the emotional dialogues about love, strength, victory of good over evil etc. I think that the audience goes prepared for a little drama for a Bollywood(masala) movie. Hrithik's appearance as 'Rohit Mehra' is really nice. It reminds of the same old kiddo in 'Koi Mil Gaya'. Hrithik Roshan is a very talented actor and dancer, he has proved it yet again . Vivek Oberoi and Kangana Ranaut have also done justice to their roles. They have acted too well. Priyanka Chopra has not been given a strong role. The action sequences are good. The visual effects are too good in the movie and the movie could be watched just for those(and hey come on for once let's not compare them to Hollywood).\n\nAll in all a good movie, not worth missing. If u keep your expectations a little low you'll love the movie.\n\nOverall rating: 6.5/10"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "deepak-in-od",
        "review_rating": "1",
        "review_title": "Not a good movie",
        "review_detailed_main": "This movie doesn't seems to have anything original.\n\nIn this series, Koi Mil Gaya was the best movie. Then Krrish was only acceptable, not that good though, but now this. Come on. This movie doesn't felt like something special.\n\nI wonder, how this movie earned so much !! Its not worth that amount.\n\nAt least for me, it felt worst. So, 1 star for that.\n\nPlus, I think the Roshan Family have no more good ideas for new film. That's why they are even talking about Krrish 4. I am not gonna watch any more movies of Hrithik. I think, he is losing his abilities day by day."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rabby_acmeit",
        "review_rating": "10",
        "review_title": "Krrish 3",
        "review_detailed_main": "The Universe is responding. Krrish 3 movie is a treat to watch. 1stly, it is a clean movie which is rarely seen in today's time. So you can enjoy the movie with your family. It is not like other big budget movies which are hyped by marketing strategy and goes bust after the release. It has good story and well edited which binds the movie till end. Technology has been used brilliantly with the story and looks very realistic. Rakesh Roshan deserves credit for brilliant story, movie and doing something out of box for Indian cinema. There are several WOW moments in the movie. On the negative side I feel that songs would have been completely avoided. It causes interruption to the interesting story. Hrithik has acted brilliantly and so has Vivek Oberoi done justice to his role. I would recommend all to watch this movie and have a great time with friends and family. It deserve 10 out of 10."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "vishal657",
        "review_rating": "",
        "review_title": "Amazing VFX. Overall disappointment. *****/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "varun030802",
        "review_rating": "6",
        "review_title": "A step forward",
        "review_detailed_main": "Koi Mil Gaya was a genuine flick and Krrish was somewhat successful to continue Rohit and his son Krishna's life saga. But Krrish 3 is all about the smashing stunning scenes and all the conflict between Krrish and Kaal.\n\nIt starts on a rather sweet note where we see our protagonist having a simple life with her wife who is pregnant and his father who he brought back from the dead in the previous installment of the series. But then the plot starts shifting towards the villain and his plans of demolishing the world just so he can rule.\n\nOne thing I must appreciate is Rakesh Roshan's genuine direction that we saw in the previous installments and the special effects that amuse the viewers throughout the film. But the screenplay is too botched up because of so many writers stepping in. But the movie follows a pretty simple narrative in the first half and an unneeded love angle in the another. And many characters are added which makes the character development worse just for more conflict for Krrish.\n\nSome of these desi elements work but some doesn't. It may not be as good the previous installments but a step ahead for Indian cinema and is worth a watch."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nairtejas",
        "review_rating": "5",
        "review_title": "The Possibility Of Krrish 5 Appalls Me. ♦ 46%",
        "review_detailed_main": "I say that because not only has the Krrish sequels obliterated the standalone success of \"Koi... Mil Gaya,\" but also has been wrongly termed an epitome of modern superhero trend of Bollywood.\n\nThe best thing about Krrish 3, if at all you consider, is the cast & their performance: Hrithik Roshan is very fine, but Kangana Ranaut will amaze you more. Priyanka Chopra, Vivek Oberoi & supporting cast follow the director's words. With a flashback on how the story had unfolded till now, the film starts with great promise and ambitious setup. What was supposed to be a lean, solid sci-fiction action movie turned out to be a copy of Hollywood films & clichés as the villain(s) enter(s) the scene. Tad unpredictability keeps the show going without inducing boredom and with random songs & brand advertisements & good Samaritan sub-stories, the film manages to flow. Involving Science into the script was one more good thing the makers did.\n\nThe popular X-Men franchise has been heavily sampled here, of course with direct references. Not to mention, almost every scene has something from Star Wars & Star Trek (dialogs), Inception (music), Avengers (stunts) & Batman series (costumes). If a person hasn't relished Hollywood in their palates, Krrish 3 will be a 7/10. But, unfortunately even kids nowadays have experienced the H'wood wind, so a 4.6/10 is quite generous.\n\nAnd about the much-talked CGI, SFX, AFX, VFX: well, they are not bad at all. Since Indian cinema is trying very hard at it, we as audience should respect the effort and with Krrish 3, it gains applause. Few elements like the virus outbreak, theism/atheism and other baloney just works against the story which is, hands down, for 9 year old kids. And the climax makes me ask a question: Will there be a Krrish 5, like we didn't have Krrish 2? And if they are to walk in the same path, I'd be damned.\n\nBOTTOM LINE: Faintly Recommended! Come on now, people! Spare the prejudice and consider: Is your child a fan? YES? Go for it! If you are bored this weekend, go catch \"Gravity\" (2013) or \"Captain Phillips\" (2013)!\n\nOne thing is sure, BOLLYWOOD in this decade still gasps for filmmaking instincts. It is high time they should inculcate indigenousness if they are to adopt such top-level genres."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "mashkurz",
        "review_rating": "3",
        "review_title": "Waste of time",
        "review_detailed_main": "Krish did not meet the expectation set at all. Half of the story revolved around the characters of X-Men, with horrible songs. This would explain why no songs were promoted in the trailer. The antagonist was a hybrid of professor X, Magneto and a Football player with the power of Jean Grey.\n\nThe first movie had a plot, the second had action, but Krish 3 had nothing original or anything worth talking about. But, one thing is for sure, Krish 3 beats the hell out of Ra-One (which gets -9.5) in my books.\n\nWatch Krish if you have absolutely nothing better to do with your life or if you have lots of money to waste."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ssurin3",
        "review_rating": "1",
        "review_title": "When will we learn to make movies",
        "review_detailed_main": "I caught up with Krishh 3 after a bit of struggle with my inner conscience. I mean I didn't wanted to watch the movie but couldn't help it as I had enough time to kill. Ironically, I chose to watch it just after Gravity which shows that Hollywood is light-years ahead of us in terms of direction, acting, cinematography and plot.\n\nSadly I slept most of the half after interval, still Krishh 3 seems to be a valiant effort in Indian Cinema to serve Indian public a taste of Sci-Fi. Had the characters not been imitated from erstwhile Hollywood movies, it would have fared better in minds of good Cinema lovers. But the characters and scenes are reminiscent of roles played in movies such as X-Men, Matrix, and list goes on....\n\nHrithik Roshan surprisingly fails to inspire and disappoints. Kangana Ranaut does add some substance to the movie, is awesomely beautiful and outshines Priyanka Chopra is every front, be it acting, appearance or screen presence. There are 1 or 2 good music scores in the movie, but in totality we still lack in making a proper subject movie."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "vihardesai41",
        "review_rating": "",
        "review_title": "Krrish 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "FUSION IS THE FUTURE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "manas19782002",
        "review_rating": "4",
        "review_title": "KRRISH-3 is only a pastiche of Movies blended with Indian masala.",
        "review_detailed_main": "Okay the wait is finally over.Got a chance to see this highly awaited movie of the year. What did I get? A patch of X-men, A name (KAAL) from \"Man of steel\", VFX similar to Avengers, X-men, Man of steel, Terminator series, All this blended with Songs and Dance numbers, comedy etc etc essential ingredients for a typical Indian Movie. Talent wasted, hair line plot, brand and merchandise promotion, OMG what was Rakesh Roshan thinking when he remarked that this movie will earn \" Rs 1000 crore\" business in BO? Well the only remarkable thing this movie showed to whole world is that India can now produce Movies like Hollywood. That's it...\n\nLet's see If \"DHOOM-3\" can make a real DHOOMMMMMM...."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "arupghose",
        "review_rating": "8",
        "review_title": "A superhero film that no one can beat!",
        "review_detailed_main": "There aren't enough words to praise the work put into this film by Rakesh Roshan and Hrithik Roshan. Firstly let's start with the direction which is absolutely fantastic. I wouldn't say it's flawless, but the power packed performances make it flawless. The special effects are out of this world, and something that Hollywood will be very proud of! Superman and Batman are films that as kids, we love and remember to date but Krrish will go down in the Indian folk law as one of those films for all Indian kids (and adults). I love how this is a superhero film from start to finish, and that is exactly what it should be!\n\nHuge credit must go to Salim-Sulaiman for their background music - when seeing Hrithik up in your face on the big screen, it's their thumping beats that make you sit up and feel that you are part of this fight Krrish is battling! Hats off! It's a shame that Rajesh Roshan's music didn't quite match up to the background music otherwise it would have been even better!\n\nNow to the performances and of course Krrish 3 is Hrithik's film and there is no doubt about that. Priyanka does well in her role but the scope is clearly left for Kangna who does a fantastic job. Not only does she speak clearly compared to normal, but she looks stunning on screen! Vivek Oberoi is fantastic as Kaal and will certainly be in contention for best villain award. His dialogue delivery, stature and presence on screen clearly shows that he is still a very good actor! Back to Hrithik, and it would be a shame for me to leave without talking more about him. It's hard enough to do a double role, but when throughout the film you play father and son, it's on another level the way he does it. He brings out the magic of Krrish, but also reminds you of Koi Mil Gaya and the innocence of Rohit when playing the father. Awards won't be enough for this man!\n\nOverall Krrish 3 is the best film of the year, so far! And will certainly win many awards. We have a new superhero now and Krrish is here to stay. I can't wait for them to make the next one!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "coolsupratimsite-chakrab",
        "review_rating": "7",
        "review_title": "The long awaited film KRRISH 3 should be the perfect conclusion to the KRRISH series.",
        "review_detailed_main": "Though after watching the action sequences of KRRISH, I overestimated about the next part of KRRISH, but after watching KRRISH 3 I realized how much of my hope left unfulfilled. Yes there are some very good action sequences in this film with well-developed CGI technology and VFX effects, some good parts were there for sure: but the plot was not very convincing, and the worst part is the adaptation of X-MEN franchise, i.e. some villain characters similar to the X-MEN franchise. It felt to me more like I'm watching a X-MEN film in which KRRISH is the only protagonist. Another worst part was some details, to outburst our emotion, held at the very moment it was needed to. Like should the baby really necessary to be there when the building was falling apart,which KRRISH was lifting. It made me feel like \"What a plotting..!! :D \". Those were, from my point of view, some exaggerations, which were not needed and also some very bad dialogues of the antagonist 'Kaal'; instead if the plot was given a bit strength, then I would not be writing this review like this. Still I prefer Indian cinema needs brand new superb ideas from this 'Gen Y' to make a super hero film. Now one thing I must admit overall, that the acting of every cast was pretty good. If I found myself to breath fresh throughout the movie, then that was because of the acting. And as for Hrithik Roshan as playing both the roles of Krishna Mehra i.e. KRRISH and his father Rohit Mehra side by side is outstanding; Kangna Ranaut as a female figure, accomplice of Evil, but still believer in Good is fabulous and also well praised. Now I am not saying that KRRISH 3 is entirely rubbish, because it is not; it is a far better movie than 'Ra.One' or 'Drona' or even 'Robot'. Frankly, the KRRISH series has its own state of entity, and I must admit that KRRISH 3 has been made within it. After watching the trailer, I, from myself, thought that, watching KRRISH 3 would be much more pleasant with Hollywood like stunts and maybe with a strong story. Though the action stunts satisfied me, the story did not. Still I really heartily liked the way the movie ended and I felt it as a perfect conclusion of the series that began its journey in 2003. With Rohit Mehra's sacrifice, who was surprisingly rescued in the previous film and KRRISH being a father, of a child who would may be far more superior than even KRRISH had ever been, I feel that the series has reached its acme. This is why I have respectfully considered KRRISH series, which has been given its name by the second success named KRRISH, to be concluded by this 3rd part entitled KRRISH 3."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "binoj7",
        "review_rating": "1",
        "review_title": "Illogical spoof of X-Men",
        "review_detailed_main": "If you have watched any of the X-Men movies then do yourself a favour and miss this movie by a mile. I mean there are many ways to copy movies but this was a really pathetic attempt. A virus that looks like a bacteria. Telekinesis that needs fingers to control! There are so many holes in the plot that you will stop counting, none I mean none of it makes any sense, as my friend said, leave your brains at home to watch this one. Frankly, I think the director could have tried to make at least things a little more logical, everything they will try to explain to you like it was possible had huge gaping holes. Copying is okay but removing all logic from it is not! I could go on on what else made no sense, but then that would be classified as spoiler..\n\nI took my 6 year old to watch it but after watching some horryfying scenes, he was asking if he can go home, so its not even a kids movie.\n\nPlease please, we all know Krish 4 will be coming soon, make it with some sense of logic and not for people with IQ of less than 70!\n\nRipped from various movies like, X-Men, Iron Man, Batman Series and many others, yeah all convoluted to this madness.."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "abbas-mustafa6",
        "review_rating": "10",
        "review_title": "The best sci-fi movie ever came out of Hindi cinema",
        "review_detailed_main": "i am not going to write any spoilers here. The movies was fantabulous,amazing....didn't had enough expectations after watching the cartoon trailer,But here the proverb reminds me \"never judge a book by its cover\".Rakesh roshan is a master story teller and the story entirely makes sense!Its not like Ra.one but after watching this movie you wil not regret it for sure. its an full-on entertaining movie with mind-blowing action,vfx,story,acting and screenplay!! please go and watch it with your family and kids will love it. Kudos to Rakesh roshan for bringing such a mind blowing movie to Indian cinema..and double kudos to Hrithik,Kangana and Vivek for spectacular performances. youngsters may not like dis movie but watch it just for its entertainment quotient!! BLOCKBUSTER"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ZeddaZogenau",
        "review_rating": "6",
        "review_title": "Indian Action Flick with Hrithik ROSHAN",
        "review_detailed_main": "Indian superhero film starring Hrithik Roshan and Priyanka Chopra\n\nThis film is the third part of the superhero series in which India's super star Hrithik Roshan (born 1974) not only stars as \"Krrish\" but also as his scientist dad. The story is told quickly: Krrish has to fight against the main villain Kaal (Vivek Oberoi), who wants to conquer the world with his mutants. His father, who is a scientist, supports him wherever possible. So nothing new on the superhero front! What makes things interesting is the villain Kaya (Kangana Renaut), who in the meantime manages to take on the form of Krrish's wife Priya (Priyanka Chopra, who stood between John Abraham and Abhishek Bachchan in \"Dostana - Real Friends\" (2008), which goes without saying causes some complications.\n\nMade for $20 million, the film is quite impressive. It grossed $50 million worldwide. In addition to filming in Mumbai, there are also scenes shot in the Swiss Alps and the Jordanian desert.\n\nFor film fans who have little interest in the superhero genre, it can be refreshing to see how these types of (teen-oriented) films are approached in other film industries. Bollywood's B-movie charm certainly benefits the wild plot contortions of such films. What is striking is the exaggerated pathos. This is particularly noticeable in the scenes with the monument to Krrish and the overemphasis on Krrish's father's mental disability. But this also shows the special charm of this film. This lightens up an action that shouldn't be taken seriously anyway.\n\nThe dual role played by SuperStar Hrithik Roshan under the direction of his own father Rakesh Roshan is definitely worth watching. This actor not only succeeds in the entertaining action scenes in which he can flex his huge muscles, but also in the quiet moments in which he touchingly portrays the father's weakness. Hrithik Roshan has rightly become a global icon, as he has proven in his other films \"Bang Bang!\", \"Mohenjo Daro\" and \"War\" (with the great Tiger Shroff as his antagonist)."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "fnkghaznavi",
        "review_rating": "5",
        "review_title": "Great CGI boring story line",
        "review_detailed_main": "Krrish 3 is hands down the best CGI effects that Bollywood has produced so far but it fails to deliver the momentum that is needed to keep the audience engaged. Every so often you will encounter scenes that don't really contribute to the story line at all. There are songs when there really isn't need for any. All in all there's about 40 minutes of solid action at the end of this 152 minutes movie - not what you really expect when you sign up for super hero movies.\n\nDirectors need to dial down on the sentimental elements and focus more on the super hero elements. Also the characters in the movie will quite easily remind you of many Hollywood movies such as X-Men, Robocop, the Matrix and Resident Evil. In fact you can easily tell where they have ripped off CGI from other movies.\n\nBottom line - Krrish 3 makes a good effort to bring CGI to Bollywood but the blatant copy of scenes and effects straight from Hollywood movies plus the excruciatingly slow story line leaves you wondering how much value you are getting for your money."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "achyutaghosh",
        "review_rating": "5",
        "review_title": "Krrish- like a roller coaster ride that never gets going",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "A less entertaining superhero film, which can strictly be seen just for the old Hrithik and not the young Krrish.",
        "review_detailed_main": "A film titled KRRISH 3 without having any KRRISH 2 in existence did create many big doubts among the viewers before its release quite rightly. Yet since it was more or less considered as a project mainly made for the kids, the expectations were not that huge and everyone just expected a decent entertainer and nothing else. But unfortunately it was really shocking to see that a director who is known to have a grasp of the medium, can make such a lackluster film without having anything special or enjoyable even for the kids in the age group of 10-15. And in case, one considers a few Shaktiman kind of sequences enough to satisfy the new generation kids well versed with DVDs, PSPs and X-boxes lying in their house at their easy disposals, then I seriously doubt about the level of awareness of that person and would like to disagree strongly.\n\nAs a result, instead of going into the pre and post interval details of KRRISH 3, I would like to mention that why it is in fact a huge disappointment from the once visionary director Rakesh Roshan, who gave us many enjoyable films in the past in the same genre.\n\n1. After his last two hit ventures namely KOI MIL GAYA (2003) and KRRISH (2006), Rakesh Roshan was known to come up with films having some exclusive & entertaining content for kids. But surprisingly KRRISH 3 has no such specific sequences for the young ones to enjoy and they keep waiting for the same till the end.\n\n2. Since his first film KHUDGARZ (1987), a Roshan venture has always been equipped with many melodious tracks, but here again there is not even a single song, able to impress the viewers in musical terms & the tracks prove to be big downers in the film as they come.\n\n3. In his entire career as a director, Rakesh Roshan has played real well with the human emotions on screen, roped in beautifully in his screenplays. But we do not find any such triumph card played in KRRISH 3 and the film falls flat on the emotional level too unexpectedly.\n\n4. Along with emotions, another major element which is completely missing in KRRISH 3 is COMEDY, which in fact has always been a subtle feature of such films based on heroes with some astonishing powers.\n\n5. KRRISH 3 has only the experiments made by 'Kaal' as its USP which are also not exploited to the best (as was being publicized). The proceedings are all predictable (with no surprises) and there are no clap-worthy scenes in the entire film, like we had earlier seen in the first two parts of the series making an instant connect. Moreover the project has huge resemblances with many similar Hollywood films and the originality is simply missing in this third offering of the series, disappointingly.\n\n6. Coming to the film's graphical representation, its indeed an appreciable decision to take that we will do all its graphical sequences in India itself through our own technical experts and not the foreigners. And the step duly deserves a big applause both from the industry as well as the viewers unanimously. But at the same time, the hard truth remains that we are still a long way behind the west in this particular field and a person can only enjoy the CGI works of KRRISH 3 if he hasn't seen any of the superhero films made in the west till date.\n\n7. Yes, the project has a grand look, imaginative characters, fine makeovers, impressive action, great cinematography, an OK background score (which could be much better or energetic) and some fine acts too in totality. Yet what it misses the most is 'new content' to entertain and enthrall the audience. And that is the reason you tend to feel quite bored at times in this 150 minutes long film, made on all repetitive stuff.\n\n8. Lastly coming to the basic character of Krishna in the film (who is the real person behind the masked KRRISH), one strongly finds no personal character of his own ever in the entire film, strangely. In fact he becomes the weakest part of the story, who doesn't have any likable persona of his own and is just interested in becoming Krrish whenever the need is there all of a sudden. In indicative words, we don't have any well defined Mr. PARKER here who turns into a SPIDERMAN at the time of crisis, which ideally has to be a key interesting feature of every superhero film.\n\nEnding the analysis with the performances, KRRISH has a good act from Hrithik Roshan confidently playing the lead role, also displaying his adorable physique in the initial reels without the shirt. But his sincere effort is not supported well by the writers resulting in a visibly poor show overall. Still I loved watching his KOI MIL GAYA character in the old age (as the Papa Hrithik) a lot more that the young Krrish, quite honestly. Vivek Oberoi does well as the evil opposition, believing in weird body experiments based on fusions and Kangna impresses a lot, delivering a superb act in her new avatar. Priyanka Chopra is there playing her given role of Krishna's wife but actually she has nothing much to do in the film as per the script. Plus Nasseruddin Shah, Mohnish Bahl, Arif Zakaria and Rajpal Yadav are there only for a scene or two like the guest artists.\n\nIn all, KRRISH 3 is certainly not a thorough entertainer at all as projected. It begins well but then has nothing significant to offer in terms of thrill, emotions or enjoyable moments right till the climax, unexpectedly. Also, I couldn't find the good old entertaining, visionary director Rakesh Roshan, anywhere in the film to say the least."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "IPyaarCinema",
        "review_rating": "6",
        "review_title": "K3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "lhebakshyla",
        "review_rating": "5",
        "review_title": "Why 5 on 10? Well, I'm being generous today.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "anshulranjan",
        "review_rating": "10",
        "review_title": "Loved it. The best visual effects so far in bollywood (and no where it looked cheap)",
        "review_detailed_main": "Krissh 3 - wasn't expecting such a captivating movie in bollywood - but still went. Loved it. The best visual effects so far in bollywood (and no where it looked cheap). Simple plot and was kind of predictive (after having watched so many of Hollywood super hero movies and read enough comics) - but nonetheless - totally worth the money and time. Liked the balanced mix of time pass masala bollywood movie + super hero stuff.\n\nAnd to those who talk about 'ripped off from this and that Hollywood super hero movies' - well you haven't read enough super hero comics to know that super heroes had been getting ripped off from one publisher to another over time and time again. (Although I am mainly talking about Marvel and DC comics mainly here - no offense to either - I love both the publisher's works).I find it pointless to criticize such a creative art on that basis - it's definitely not easy to blatantly create such a high quality effects by simply copying stuff."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "daisukereds",
        "review_rating": "7",
        "review_title": "\"I like it!\"",
        "review_detailed_main": "Enjoyable and fun enough to warrant a watch. Even as a stand alone film (since it recaps the story very well at the beginning).\n\nIt quickly gained my favor due to the charming leads, and the sincerity and heart of the characters they are portraying.\n\nHrithik Roshan has a great physic, acts rather well and can handle himself on the dancefloor. And I was attracted to this movie by the look of the Hero Krrish, which is simple but striking. The ladies of the film, both the beautiful Priyanka Chopra and Kangana Ranaut (whom I saw here for the first time, and was easily my favorite) do a wonderful job as well. The villain is a bit weak (in mindset and look), but is a good bad guy nonetheless.\n\nAnd although the story itself is nothing that hasn't been seen before, it works very well!\n\nThe whole thing is elevated by some great camera work, exaggerated action, interesting premises to put a hero into, good lines of dialogue, and more importantly.. plenty of showing not telling.\n\nVery reminiscent of a few Superman comics, as well as the X-Men movie from the year 2000 (take that as you will).\n\nThere are a couple of Bollywood songs (as was expected), and even an Intermission (the movie is almost 2 and a half hours long). Would watch again. It's \"dumb\" at times, but there are days when I'm just in the mood for a product that was seemingly made with lots of energy and love."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "dalasear12",
        "review_rating": "1",
        "review_title": "Not For Avid Movie Watchers at ALL",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: Krrish is Here to Stay!!",
        "review_detailed_main": "Krrish 3 is average product by Hollywood standards but innovative by Bollywood standards. Krrish 3 works because it has Hollywood body around Bollywood soul. It works because Rakesh Roshan runs the show with good control during most of the running time. It works because Hrithik Roshan is such a delight to watch when he is playing three different characters; Rohit Mehra of Koi Mil Gaya, Krishna Mehra born in Krrish and Krrish of course. As Krishna he is good, as Rohit he is excellent and as Krrish he is charismatic and irresistible. Krrish 3 goes two steps ahead of Krrish and gives Bollywood audience the drama of superheroes, super villains, mutants, scientists that they have not tasted this way before. Special effects vary from tacky to absolutely stunning. Vivek Oberoi as Kaal and Kangana Ranaut as Kaya give pretty balanced performances. Priyanaka Chopra is average and does not have much to do here. Plot is predictable but quite enjoyable. Movie falters by being over melodramatic sometimes, having two extra songs and dragging the climax by around 10 minutes. It is a bumpy ride but a thrilling one. Make no mistake, Krrish 3 deserves a watch."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "harsh007",
        "review_rating": "7",
        "review_title": "Ups the VFX Standard of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "SirNeutron",
        "review_rating": "1",
        "review_title": "It is a pure comedy!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "arnavgoswami",
        "review_rating": "5",
        "review_title": "Fans/Kids will love it.....others will suck it",
        "review_detailed_main": "watched KRRISH 3 ...one thing was clear from the start no matter how good/bad this film is..we all gona watch it anyway..its been a decade since the first movie came out of this series in 2003 n than in 06..so we've been connected to this \"desi superhero\" for along time now....NOW the movie is good as per our \"Indian terms\" cause it has nice Action, cheap Sci-Fi, bit of Melodrama & it has a good plot(unlike most of the Bolly films nowadays)with the average screenplay....\n\nThe flick is also a clear rip off of many Holly n Bolly films(yes, even Bolly films)...mostly they copied action scenes...X-MEN,SUPERMAN,SPIDER MAN,BATMAN,TERMINATOR,TRANSFORMERS,STAR WARS,RA.ONE,ROBOT & even SHAKTIMAAN couldn't save himself form this piracy(if you've seen these you can also find the resemblance)...also its graphics are sh!t(come on its 2013)Bluntly if you can't match the level of the Holly's graphic quality you shouldn't make a movie like this(at the end of the day makers are gona earn for it).... Few amateur scenes, impelled dialogues & mediocre acting of the extras is really annoying throughout the film(at one point you wana punch those SOBs)\n\nstill I think its _WORTH A WATCH_"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "coolguybn",
        "review_rating": "3",
        "review_title": "Its Marvels/DC comics KRRISH 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Jwajalpa",
        "review_rating": "",
        "review_title": "Good movie for Bollywood lovers.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "amit-garg270",
        "review_rating": "7",
        "review_title": "Little over hyped but overall a good movie",
        "review_detailed_main": "The movie starts well, but overall I found it a little over hyped. Lot of concepts borrowed from Hollywood blockbusters like X-Men, Spiderman and Transformers. Plus the special effects seem to losing their touch if watched carefully. Seems like scenes which are normally scene in action games. Which clearly proves Bollywood is way behind Hollywood when it comes to special effects. Found the prequel (Krrish) more interesting than this one. Songs are good. Some scenes are heart touching. Hrithik rocks nevertheless. His six-pack and nicely chiseled body! just mind blowing. Hrithik is all over the movie. His style quotient is unmatched. He can easily give any Hollywood hero a run for his money with just his looks alone.\n\nIn the end I would just like to add that I don't think the makers could have done any better. They have given their best. So full marks to them as well. Its just that Bollywood would take its time to reach that level of brilliance which Hollywood has been showing for the past many years. One time watch. Good for kids. They will love it. Kids are definitely going to be repeat audience, but surely not adults."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Sachal",
        "review_rating": "1",
        "review_title": "Don't waste your time and money",
        "review_detailed_main": "I went to theater to watch this movie as my wife wanted to see it. I know husbands are helpless when it comes to wives. I hardly had any exceptions from this movie at all. You can almost guess how good a Bollywood movie would be based on its cast and director. Still, I was a bit curious as I had hardly seen any super-hero movie from Bollywood.\n\nKrrish 3 was pure waste of time. I am not sure why do they make such pathetic movie, ridden with terrible emotional drama and copied actions. The story was purely baseless and unconvincing. As several other reviews pointed out, the action scenes were copied from other Hollywood flicks. Despite all plagiarism, they could not come with a decent movie. Songs were truly forgettable and for acting I would not be thrilled. My suggestion would be totally give a pass to this movie and do not waster your money and time."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "abhinav-jagtiani",
        "review_rating": "10",
        "review_title": "Renaissance of Bollywood's sci-fi action movie.. The BEST!!",
        "review_detailed_main": "When I watched the movie's trailer for the first time, what I found (and that too in BULK) was the group of people talking about its VFX and its plagiarism from Hollywood movies like Superman, X-man, etc. I was surprised to read all those stupid comments because honestly speaking as an Indian, I felt proud to see such a wonderful work by Indian experts. YOU SHOULD ALL BE PROUD OF THE FACT THAT KRRISH-3 IS 100% MADE IN India and therefore in order to see the strength of BOLLYWOOD, I went to see Krrish 3 today. Trust me when I say this guys, it is one of the best movie I have seen in my life with amazing special effects, amazing performance by all actors (especially Hrithik Roshan) and 100% dedication by Mr. Rakesh Roshan. This movie is a special Deepavali gift from the Roshan's and honestly speaking, no other gift could be as better as this.\n\nConclusion: Krrish-3 is a treat to watch for everyone.. I would strongly recommend everyone to go and enjoy it and those who are complaining about the VFX or duplication from Hollywood movies, you better watch Dabangg or Rowdy Rathore (lol :P)"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Krrish 3 disappoints in terms of direction and story but is saved by brilliant CGI and enduring performance by Hrithik",
        "review_detailed_main": "As you will see the first trailer of Krish 3 , certain scenes of Hollywood movies will come to your mind creating a deja vu. Believe me , you are absolutely right, Krrish 3 is result of all of best scenes plucked out from some of best Hollywood action flicks and bind together into a single movie.\n\nKrrish is leading a happy family life along with his scientist father , Rohit Mehra and journalist wife , Priya. Along comes a new threat in form of evil, Kaal who threatens to end the world and build his own empire.\n\nIt is sad to see that we have so much talent in Bollywood and yet we directly copy scenes from Hollywood and give our own name. Rakesh Roshan picks the best of lot from each film, adds in typical melodrama which creates boredom and polishes with es tactic CGI. His direction is utterly poor by introducing new love story ( between Hrithik and Kangana )to already fuzzed out chemistry of Hrithik and Priyanka. Screenplay is poor. Editing needs serious attention. Music by Rajesh Roshan is disappointing. Art direction is good along with eye-catching cinematography. Hats off to the special effects team for bringing technical brilliance to poorly written film. Watch for the climax scene showing the building collapse which is bravely shot. Hrithik Roshan stands out as Indian Super hero with his well-chiseled physique. Not only he suits the character of Krrish , he emote expressively both as father and son. Vivek Oberoi does a good job as evil Kaal. Kangana Raunat surprises you with her charm and acting. Priyanka Chopra is wasted.\n\nOverall , Krrish 3 disappoints in terms of direction and story but is saved by brilliant CGI and enduring performance by Hrithik. Decent 2.75/5"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "andydgr8",
        "review_rating": "5",
        "review_title": "ExKrrishiatingly Painful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Ace_McCloud",
        "review_rating": "8",
        "review_title": "Krrish 3 - The first Indian Superhero",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rupali-pant2007",
        "review_rating": "7",
        "review_title": "Visually stunning, Brilliant performances but a poor story",
        "review_detailed_main": "Was disappointed because of a weak plot. Also, too many product/brand placements spoiled the fun of watching the movie. Although the performances were outstanding. Everyone in the cast has made an outstanding effort. Some special mentions are- Hrithik Roshan for the amazing way he has played all three roles- Rohit, Krishna and Krrish, Vivek Oberoi for effortlessly portraying Kaal and Kangana Ranaut for her sexy mutant avatar as Kaaya. The music was not upto the Rajesh Roshan standard, which used to mesmerize us in his earlier ventures like Yaarana, Baaton baaton Mein , Kaho Naa Pyaar Hai to name a few. It is strictly average. I attribute the 200+ crore BO collections simply to Hrithik Roshan's acting, Rakesh Roshan's vision of a sci-fi superhero film and To Vivek Oberoi's and Kangana's performances and to never-before-seen VFX, made in India, for India. It is a one-time watch."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "humayrabushra-42369",
        "review_rating": "1",
        "review_title": "Bestest superhero movie 💯",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "HeroOfTomorrow",
        "review_rating": "1",
        "review_title": "Bad SNL skit meets unreleased Power Rangers episode",
        "review_detailed_main": "I don't even know where to start.\n\nWe sometimes watch terrible movies for laughs. \"So bad it's good\" is a thing, right? Unfortunately, Krrish 3 doesn't fit that description. This -I hesitate to call it a \"movie\"-is 160 minutes of incomprehensible nonsense, coupled with:\n\n-acting that makes The Room look like Casablanca -special effects that look like a failed PS2 bargain basement game trailer -costume design that is SO bad, it has to be intentional -a plot line so utterly content-free that they have to fill up 50% of the film with superfluous song-and-dance numbers -cinematography so flat, it looks like a home video of tweens acting out a Power Rangers fight scene 20 years ago.\n\nI really can't make much more of it. This is the worst thing I've ever seen. Don't watch it. Ever."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "mohitrajpal-22847",
        "review_rating": "3",
        "review_title": "My review for this movie",
        "review_detailed_main": "This movie is so predictable and the story and plot are so weak i don't know but some movie scenes are copy from Hollywood movies like matrix, transformers and so much and characters are also copy from Hollywood like magneto and x men franchise characters and character development is so poooor personally i like Krrish this movie set high bar in Indian superhero industry and koi mil gya is also a good movie you will enjoy both koi mil gya and Krrish but Krrish 3 😕 personally i recommend you krrish and koi mil gya and some talk about VFX,VFX is ok ok and direction is also very poor like is story and plot even krrish and koi mil gya direction,story and plot are very good and director of koi mil gya,krrish and Krrish are same i don't know why Rakesh sir but pls make krrish why better than i expect pls i request you Rakesh sir If this review help everyone so thank you."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "maulin-834-652954",
        "review_rating": "7",
        "review_title": "Lived up to the expectation..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "A_Voice",
        "review_rating": "4",
        "review_title": "*Mashup*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "gourav-gunjan",
        "review_rating": "10",
        "review_title": "Nice movie, Nice story, Dialgoue and songs drag it back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "askari_dmc-835-203475",
        "review_rating": "6",
        "review_title": "This was not actually I was planning for .. But this was entertaining as hell!! Overall enjoyed",
        "review_detailed_main": "Nothing much to say but the best thing I liked about the movie was the VFX.Yeah we can say that the movie resembles much to the Hollywood's super heroes.... Like the mutant idea was from X-men and the negative part of the movie who mostly appeared on the wheel chair resembled Charles Xavier from the same movie ( X-men) and he almost had the powers like Magneto. And many sequences resembled a lot ..... Movie including Hollywood superheroes!!!! 1-Man of steel 2-X-men 3-The amazing spider man What my opinion is go see the movie this Diwali! And don't take it as a WoW!! Just watch it and enjoy it ! And I assure you will love it!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nathdiandeh",
        "review_rating": "3",
        "review_title": "The movie would have been better",
        "review_detailed_main": "the movie would have been better.Old Shaktimaan...:) India cinema has got a long way to go. After seeing Hollywood movies like GRAVITY, Amazing Spiderman, Man of Steel the movie is nowhere. lacks originality This time even the songs doesn't amuse the viewer at all.Koi Mil Gaya was far better than Kriish 3 .Its high time that Indian movies make 3d and graphics movies at par with their Hollywood counterpart.Hrithik Roshan is a great hero, but its high time that he chooses his movies properly. his dancing really sucked this time . and the songs of the movie are awful.In all the movie is a childish movie.Neither its a masala movie like Chennai express nor a super-duper action super hero movie. Viewers will be disappointed.\n\nViewers Discretion: Watch the movie at your own risk"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "Krrish 3: Blockbuster Written all over it!!!",
        "review_detailed_main": "With a visually riveting and emotionally engaging story, intriguing characters, sweeping VFX (unseen thus far on Indian celluloid) Rakesh Roshan's ambitious dream lives up. Yes, it's hugely inspired (by the Bats, Spideys and Wolverines of the West), but our superhero has his own 'X- factor'. Even with all the high-octane car crashes, explosions and 'animatronics', the philosophy is the force behind it all, yet, never overpowering the story. For sheer vision, bravado and superlative execution, this one soars to new orbits. Latch on to this cape for an exhilarating ride. Note: You might not like this film if sci-fi, fantastical films are not your scene!!! Surpasses Koi Mil Gaya(2003) and Krrish(2006) its predecessors!!! Will sure to make a Bollywood history in terms of box-office collections!!!!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "anjumskhanbpl",
        "review_rating": "7",
        "review_title": "Excellent movie",
        "review_detailed_main": "Movie is fantabulous by all means. India is a developing country not a developed one like many western countries. So, if you are expecting a scifi thriller like Hollywood, then of course it will take time to reach that level. But considering all the things, I would rate Krrish3 as extremely good movie. Superb plot, superb execution. Rakesh roshan never tried to get away with by chalta hai attitude. Movie is made with big hardwork which can be easily seen. Marks are given for hardwork and considering all the means including money available to make such thrillers, I am extremely happy that India is slowly getting at par with Hollywood.\n\nMust must watch. Fully entertaining."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "santhosh-10290",
        "review_rating": "1",
        "review_title": "Krrish 3",
        "review_detailed_main": "Worst movie. The movie has no logic. The movie was so boring. The movie was not at all interesting or thrilling. Nobody acted good in the movie. Songs and BGM in the movie were also not so good. The movie has no story. Fight scenes in the movie were also not so good. Krrish 1 was so good but Krrish 3 was worst."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "fredberglyle",
        "review_rating": "5",
        "review_title": "KRRISH - saves many in the movie but not the movie audience",
        "review_detailed_main": "Heard about X-Men ? Heard about Spiderman? Heard about Superman or batman?\n\nIf you've even heard about any of the above or seen 'em and if you are an adult then this movie is to be avoided. Villains from Amazing Spiderman movie and the characters from X Men are copied. Final scene reminded me of a bad imitation of the Man of Steel fights. Some possible merits in the movie include Hrithik's Charisma (indeed he is too-too handsome), Special effects/graphics (Good with Bollywood standards not Hollywood)and to mention beauty of Priyanka and Kangna. The actors did a fine job to the script which was too weak. Music and comedy was just okay. The bottom line is that this movie just might be enjoyable to children (may be) but not to others."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "Zeppelien",
        "review_rating": "1",
        "review_title": "Looked like a cartoon story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rock4217",
        "review_rating": "6",
        "review_title": "Bird Eye View",
        "review_detailed_main": "Krrish 3 definitely takes bollywood to the next level, with some great special effects which is close to perfection.\n\nHowever, the story-line, characterization, and unnecessary songs and dialogs spoil such an incredible effort.\n\nVivek oberoi - Mix of Magneto and Professor X from X-men Kangna Ranaut - Mystique from X men Krrish - Weaker version of Superman - Getting energy from the Sun A self made characterization would have definitely made justice to the special effects Some of the dialogs are too dramatic, and unnecessary. It's like spoon-feeding us on what's happening. Come on guys, give the audience room to think on their own. Treat us like adults. The lesser you reveal, the more interesting and real it becomes.\n\nSongs act as a spoiler for a superhero movie, unless it is a part of the plot and is important. The songs in this movie, spoils the momentum of the movie and diverts our attention towards something silly. This is a lesson Bollywood needs to learn. You may match Hollywood in VFX effects. However, what matters is the way you present. The plot,the direction, and the story telling is whats more important. VFX effects come as a bonus. Get the basics right before we try something bigger.\n\nThis movie could have been made so much better! Good effort though!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "adeel_parbhulkar",
        "review_rating": "10",
        "review_title": "It's an Epic Film Outstanding",
        "review_detailed_main": "Rating:- 4.5/5\n\nThe Movie is just awesome. I am just speechless. I just saw the movie and i am in a very much hurry to express my opinion and review about these film. I watched these movie in Sterling and it was more than the worth. These Movie just made my day.\n\nI would love to go again for these Movie. It's a Family entertaining movie. The story of these Movie give them a plus point for it. The critics has also rated 4.5/5 which is justice. Krrish 3 deserves a standing ovation for what they have done. These Movie is definitely comparable to Hollywood standard.\n\nHrithik Roshan deserves a salute for his acting. He has Cleverly done 3 characters. Vivek Oberoi has also done a good job. Priyanka Chopra has also done fairness with his job. Kangana Ranaut is looking too hot in these film and she has also done a good job as a Mutant.\n\nThese Movie also have some suspense in it and that has also executed very cleverly. The Special effect's is also great. As it is edited in India so we shouldn't expect Hollywood standard. But the movie story plot Action and Acting is Hollywood Standard.\n\nIn My Opinion I must say that these movie shouldn't be missed out. It's a must watch movie of the year. I have Experienced a great Thing in these Movie.\n\nHats-Off to Rakesh Roshan to try something new and bigger. Now Rakesh Roshan Hrithik Roshan and his whole team should be proud of their self for the Success of the Movie. I'll Confidently advise to all of the people who reading these review should not waste their time and just go for it. These Movie much more than the Entertaining. It's about Experiencing something new.\n\nMy Final Verdict :- Marvelous. Fantastic. Mind blowing. Superb. Speechless."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ahwaan_padhee",
        "review_rating": "6",
        "review_title": "Krrish3 : Ambitious, yet flawed",
        "review_detailed_main": "From dabbling with reincarnation-oriented sagas to being a pioneer in introducing aliens and superheroes in Bollywood arena, director Rakesh Roshan has come a long way. His latest offering, Krrish 3 begins almost after five years where Krrish ended. Krishna, played by Hritik Roshan, is now a happily married man who takes up odd jobs ( security guard , waiter !!) to keep his alter-ego concealed while Papa Rohit is busy with his research pursuits, accompanied with Bournvita! Things are hunky dory until Krrish's nemesis – Kaal(played by Vivek Oberoi) unleashes a trail of terror with his evil mutants and the cat suit-clad Kaya(Kangana Ranaut), a chameleonisque human who shifts loyalties and falls in love with Krishna. With all its melodrama, twists involving an inventive face-off formula and blatant merchandising, it boils down to the philosophical triumph of good over evil.\n\nFor superhero movie buffs, Krrish3 would resemble a concoction of several Hollywood biggies (Superman, Spiderman) and Roshan seems to recreate the action sequences amidst sprawling and dazzling skyscrapers ( in Mumbai !!) copying the Hollywood counterparts, without quite building a pressure-cooker urgency. The screenplay is footloose and the EQ which resonated with every Filmkraft venture is brazenly misplaced. The second half does raise some hopes with a catchy soundtrack( Dil Tu hi Bata, simmering with the beauty of the exotic locales) but Roshan's team of writers eventually fall into the trap of juvenile story-telling replete with clumpy dialogues, downgrading the intrigue factor.\n\nAll said and done, Krrish 3 is only worth watching because of Hritik's regaling performance. With a beefed-up musculature, he delivers a committed and the most sincere act displaying an array of palpable emotions. As the paunchy Rohit, he brings in the composure and child- like mannerisms which makes us nostalgic as memories of Koi Mil Gaya flash before our eyes. While all the entities around him are irresistibly ridiculous including the most sketchily written character of Priyanka Chopra,it is Kangana who ably compliments him with striking vulnerability and sensuality. There is a devilish aura around Vivek Oberoi and he cashes on it to play the wheelchair-stuck villain with impeccable perfection. Really , if Kaal says \"Fusion is the future\", then we gotta agree that this baddie will shine in the future!\n\nI go with Two and Half out of Five for Krrish 3.All the jazz, the startling visual imagery can barely compensate for the soul which the film lacks. We see a tremendous scope for a sequel with another child prodigy born, but the Roshans must reinvent themselves and come out of the archaic treatment they meted out to this ambitious film."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "almassteelpune",
        "review_rating": "10",
        "review_title": "Excilent movie",
        "review_detailed_main": "Krrish 3 must had been in 3D I wished.I want to tell you that when I went to see this movie I had nothing in mind what kind of effects I would see but when I saw the effects and VFX I liked could have been better in 3D. My kids saw and they liked this movie. I can say that all in all a good kids movie which all will like. Though the song in the movie are not so good which could have made krish3 a smaller 2 hrs movie. VFX 8 of 10 Plot 9 of 10 Story 9 of 10 Music 5 of 10. RAKESH ROSHAN SERIAL MOVIE ROCKS. Its Diwali time so I will surely recommend to all kids and family to take your kids with you to the best cinema near you and watch it. Don't do upon wrong reviews."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "silvan-desouza",
        "review_rating": "",
        "review_title": "Great VFX, decent film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "harikrish123",
        "review_rating": "6",
        "review_title": "Entertaining though hilarious",
        "review_detailed_main": "After about half an hour or 40 min into the movie i was convinced that my money was wasted, but the movie somehow made up after that.There are some really hilarious stuffs in the movie,logical blunders also(which i don't want to enlist as it may act as spoilers).At many places i was rolling out of laughter.That was a disappointment because i don't think the director intended a comedy entertainer and the previous two movies had good emotional content that made me love those movies.This one also has, but way too less and only at patches. The action is cool by Indian standards, the special effects though similar to Hollywood movies is pretty neat and of good standard.Overall, it's good for laughing out in the theater and a watchable entertainer.I would recommend this movie to Stephen Hawking :D"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "karangiri",
        "review_rating": "9",
        "review_title": "A Brilliant Superhero Movie",
        "review_detailed_main": "Awesome movie I think it is not fair with Krrish 3 to compare with it Hollywood movies because Hollywood's movies budget goes to 1000 crore of any superhero movie for this anyone can check the budget of any Hollywood Superhero movie. I think Krrish 3 is far brilliant movie in Indian History and Krrish 3 is a real challenge for any Superhero movie not only in Bollywood but also for Hollywood movie because it is unbelievable movie in less than 100 crore brilliant movie with story line also they present a wow super villain in the movie the only negative point in this movie is only songs which are not so good as the previous parts of this movie. Apart from songs this is a brilliant movie for me and I will give 5 stars to this movie out of 5. I am happy to see this movie."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "prashant141986",
        "review_rating": "10",
        "review_title": "Good Movie",
        "review_detailed_main": "Clearly, those challenges are quite visible in director Rakesh Roshan's third installment – 'Krrish3'. He has, however, obediently stuck to the fundamentals of spinning a superhero movie that centres on the battle of the good versus the bad, but it's his decision to limit the visual effects that makes his effort rather unimaginative.\n\nThe script has all the elements an exciting superhero film must have. A vulnerable masked crusader, a malevolent super villain, who's as far away from redemption as heaven is from hell. A revenge story. And the ultimate battle – the triumph of good over evil (wait for the climax!). The best part? It isn't an all-indulgent film that focuses only on the greatness of Krrish. Sure, there are scenes that display his absolute power and goodness but hey, what the hell, aren't these what we all really crave to see in this kind of a film? While the first half is mainly to establish the characters, it's the second half that holds your attention till the last frame. Considering 75% of the film has VFX, the graphics seem a bit sketchy in a few initial scenes. But where it matters the most, like the climax, its bang on! Among the songs, Dil Ti hi Bat is definitely the pick of the lot. Coming to the star cast, this is Hrithik Roshan's film all the way. He dons the roles of Rohit, Krrish and Krishna with ease. His performance evokes all the right emotions. You love him as Rohit, you desire him as the doting husband Krishna and you want to see him triumphant as Krrish. HR is India's only superhero. Period.\n\nBut it must be said that Vivek Oberoi lends ample and more support to HR. If HR is a superhero, VO is the perfect super villain. It is a towering performance. From his menacing entry right up to the end. The leading ladies have equally fleshed out parts. While Priyanka Chopra is good as the love of Krrish's life, it's Kangana Ranaut who stands out. Besides looking her part, stunning and sexy, she's also managed to work on her diction and speech problems. You will see a new and improved Kangana in this film.\n\nHats off to Rakesh Roshan for dreaming big and actually pulling off this risky proposition. Krrish 3 is spectacular, blockbuster entertainment. The scenes that are heavily inspired from hit Hollywood superhero franchises notwithstanding."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "sshogben",
        "review_rating": "10",
        "review_title": "A Landmark Film in World Cinema ... breaks down boundaries and raises the bar for superhero films everywhere, with emotional 'connect' Hollywood can only envy",
        "review_detailed_main": "Forget anything you may have heard or comparisons you might have imagined about \"Krrish 3\" – it's just a GREAT MOVIE. Period.\n\nBy any standard.\n\nFor sheer emotional wallop, \"Krrish 3\" has no peer among 'superhero' movies anywhere.\n\nComplex and multi-layered story, standout performances, exciting action, memorable characters, and breakthrough visual effects make \"Krrish 3\" a landmark film in world cinema. But it's the power of its emotional connect with the audience – fuelled as it is by real human relationship, that each of us can identify with personally in our own way – that sets \"Krrish 3\" above even mega-blockbuster Hollywood movies with 12 times the budget but no soul.\n\nWhat sets \"Krrish 3\" apart?\n\nStory. Plot. Character. The three essential elements of any good storytelling. \"Krrish 3\" not only uses Story, Plot, and Character to tell an inspiring and exciting superhero story, but does so from a uniquely Indian perspective all the more powerful because the relationships portrayed are actually universal to all human life.\n\nAbove all, \"Krrish 3\" is an unparallelled celebration of ... Humanity. In all our strength. In all our weakness.\n\nMaster director-producer Rakesh Roshan once again proves his vision to 'push the boundaries' for what Hindi cinema can and does achieve.\n\nSynopsis for anyone catching up: Ten years ago \"Koi ... Mil Gaya\" (2003) introduced India's first successful science fiction movie by giving us Rohit Mehra, a braindamaged child-adult who befriends a space alien (whom he calls 'Jaadu', meaning 'magic') accidentally stranded on Earth that thanks Rohit for his help by healing, even enhancing, his damaged brain. Seven years ago \"Krrish\" (2006) gave us Krishna Mehra, Rohit's son, who was born with supra-normal abilities because of his father's 'enhancement' by Jaadu, and eventually takes on the superhero identity Krrish. With the help of a journalist (Priya, whom Krishna loves) Krishna rescues his father, the now-genius Rohit, from long-term imprisonment by an evil scientist. Thus at the outset of \"Krrish 3\" (2013), Krishna and Priya are newlyweds. Rohit explores how to be a father to a grown son. And 'Krrish' is the public's hero who is an inspiration to all. But trouble lurks just around the corner: a twisted genius known as 'Kaal' has unleashed an army of half-human, half-animal mutants to exploit and then bring down human civilisation.\n\nWhat Happens Next ... you simply must experience!\n\nHrithik Roshan ... playing the triple-role which spans the physicality (impressive!) of superhero Krrish combined with the confused 'everydayness' of alter ego Krishna (who can't keep a regular job!) and yet again the residually 'childlike' genius scientist, the aging Rohit. COULD any other actor have carried this off? Period? In a word, NO.\n\nAs Subhash K Jha famously said of Hrithik's début, \"Kaho Naa ... Pyaar Hai\" (2000): \"Would Paris be the same without the Eiffel Tower?\"\n\nSimilarly, the entire Krrish franchise – whether Rohit in \"Koi ... Mil Gaya\", Krishna in \"Krrish\", or full-on superhero Krrish in \"Krrish 3\" – would not, could not, exist without the unique talents and dramatic range of one actor. Hrithik Roshan.\n\nThe other primary cast are also great in \"Krrish 3\". Vivek Oberoi, for instance, makes the most of this opportunity to be very good (which is to say, very bad, as the ultra-evil supervillain 'Kaal') in this very good movie.\n\nYet top raves for the women in \"Krrish 3\".\n\nAll too often a female actor is given little chance to do more than 'look pretty and dance a little'. This is why it is SO refreshing that both Priyanka Chopra ('Priya') and Kangana Ranaut (the mutant 'Kaya') play such memorably three-dimensional characters in \"Krrish 3\".\n\nMs Ranaut is spectacular in this movie! She's gorgeous. She's deadly. She's (literally) a cold-blooded killer, being half-chameleon. Yet her character's discovery of her own latent human side will touch your heart.\n\nNot to be outdone, Ms Chopra's role, too, has unexpected shades to her performance. And watch carefully for one scene where even Mr Roshan is ... not quite what he seems! Exactly the sort of plot twists that keep an audience on the edge of their seat to the final frame.\n\nThe technical departments are all top-notch. Hong Kong's legendary action director Tony Ching Siu-Tung returns from \"Krrish\" to elicit even more breathtaking fight sequences in \"Krrish 3\", and pushed all actors to their physical limits and beyond. The art design by Sabu Cyril shows you a birds-eye perspective of Mumbai (especially dramatic at night) which only a bird – or a superhero – would normally see. The sound design by Baylon Fonseca was also extraordinary.\n\nRajesh Roshan's music for \"Krrish 3\" is not standard Bollywood movie fare, because this music is very specific to this film and no other. Where else, for instance, are you likely to have occasion for a mutant's fantasy about discovering love? Which is why, when you actually see this film, all three of the song sequences work beautifully to underscore the emotional content of the plot.\n\nSpecial credit to the\"Krrish 3\" team for bravely keeping all the computer visual effects work (VFX) 100% 'made in India' for the first time ... and on such a showcase project, so brilliantly realised throughout. And at reportedly ONE TWELFTH the cost of similar Hollywood VFX-intensive superhero films, with such results, \"Krrish 3\" alone could open Indian VFX companies to the international film market.\n\nIn sum: a landmark milestone in Hindi cinema. As Hrithik Roshan said recently in a UK interview, \"The basic content of a Hindi movie is really being challenged here.\" The standard-of-excellence has been raised to global level with \"Krrish 3\", while remaining true to Indian culture and values.\n\nDirector Rakesh Roshan deserves HUGE credit for: (1) the Vision; (2) the Courage to pursue that vision; and (3) the Skill to transform that vision into groundbreaking cinema."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "brahmasahu8",
        "review_rating": "10",
        "review_title": "Amazing Movie",
        "review_detailed_main": "This film may not be compare with the Hollywood super hero movies in terms of the budget but it has more emotion & drama than the Hollywood movies.The VFX are world class in the small budget.You cant expect more than that from such a small budget film compare to Hollywood.Friends don't believe in others its a 10/10 movie in terms of everything.I have seen some of the reviews saying that the concept of the movie is borrowing and the VFX's are not up to standard,i wants to say them one thing before comparing any movie with other Plz don't forget about the budget.Krrish 3 is about 1percentage of the Internationale standard Hollywood movies. So keep it in mind and if you are typical Indian love story fan then its not u r cup of tea."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rohitsharma-myself",
        "review_rating": "10",
        "review_title": "Amazing !!",
        "review_detailed_main": "In short Krrish 3 is Amazing. But yes if you will unfairly compare it with Hollywood stuff, then you might be disappointed. But that will be unfair, as I said, due to obvious budget constraints. But if compared to previous Krrish, or RA 1 or Robot, K3 is superb. The VFX are amazing, never seen before in a Bollywood movie. Hrithik is just outstanding as Krrish and Rohit Mehra. Vivek and Kagana are impressive too. Songs are a bit let down, maybe because of poor lyrics. Raghupati Raghav is good though, maybe it looks good because of Hrithik's dance moves. Rakesh Roshan's direction, as usual, is brilliant. He is one of the better directors in India, the one who has guts to make something different from the usual Masala Flicks. Enjoy Krrish 3, our Indian super hero, but don't compare it with Hollywood movies. We can't afford their budget. These kind of movies need support from Indian audience else directors will keep making movies like Chennai Express etc. Thumbs up to KRRISH 3 from my side, and my entire family loved it."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "manikagarwal2",
        "review_rating": "8",
        "review_title": "India has arrived on the world stage!!",
        "review_detailed_main": "It may not be in the league of the likes of superman &/or batman in terms of technical quality but still it does bring to us the first true Indian superhero & man he does fit the bill nicely. And mind you all, in a miserly budget of around 1200 millions as compared to 6000 millions for the recently critically acclaimed gravity.. So we must not compare the two ..the director must be thrown accolades for thinking & doing different... The direction & script does have its ups &downs but its the performances & first of its kind of cinematic excellence seen in India & being carried forth.. Hrithik shines in action sequences & enacts the old man role with aplomb & hats off to the mean cruel sinister look portrayed by vivek who throws his punches & lines with equal ease and authority,in fact he is a delight to watch.. Also worth mentioning is the work of Kangana, a smart chiseled look & a breather from the so typical act of her co-actress.,, visual effects are quite decent but for the budget... Unnecessary songs do add to the length & could have been avoided,,,Hrithik in his cool new body fits perfectly as a Superman... For the vision, the first of its kind visual effects by an Indian & a superb villain, this flick is a watch...It seems to have its heart in the right place & people around the world can expect more and better stuff to roll out from India soon..."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "eminent-archit",
        "review_rating": "8",
        "review_title": "Movie Review: Krrish 3",
        "review_detailed_main": "Bollywood may not have evolved in technology as much as Hollywood has, but its not far behind. Even if the technology isn't developed Bollywood still can put up a great fight. This has been clearly proved by Rakesh Roshan and the entire team of Krrish 3. Krrish 3 is a benchmark in Indian Cinem. Both in terms of technology and film making. There have been dozens of sequels in Bollywood but none of them were actually sequels. Making a sequel needs great detailing because you need to connect the dots to make a bridge between the prequel and the sequel. Krrish was a true sequel and Krrish 3 is no less. It has the connection.\n\nKrrish 3 has all the important ingredients. Action, Message, Emotions, Technique. It doesn't miss a mark anywhere. It is logical and doesn't challenge your intelligence. The only loop hole in the movie is the twist with Kaya. Its way too predictable.\n\nNow talking about the performances, Priyanka Chopra does good with whatever she is given. Viveik Oberoi, who had become the King of Cringe Cinema, breaks the shackles here. He delivers a performance worth appreciating. His Kaal truly leaves a deep impression in comparison to Krrish. But the film belongs to Hrithik Roshan! Be it as the genius man child Rohit or the superhero Krrish. He takes the film to an entirely different level. The smile, the intensity. He wins you over with every thing a million of times. The final fight between Krrish and Kaal in every aspect. Hrithik Roshan is the main reason.\n\nI am going with three and half out five for \"Krrish 3\". Hollywood superhero films are adapted comic characters, but the character Krrish is original. There are many chances you will find yourself whistling, clapping and cheering, such is the power possessed by the film and the message it delivers. Go for IT!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "uapoorvgupta21",
        "review_rating": "8",
        "review_title": "Krrish 3 is a better movie than what people are reading in reviews",
        "review_detailed_main": "I watched this movie today, and was considering should I watch this movie or not after reading a string of bad reviews. Thankfully I watched the movie.\n\nI will mention the Pros and Cons of the movies:\n\nPros: 1. Hrithik Roshan: He is the USP of the movie no doubt. From his perfectly toned body. To his perfect face expressions. Don't forget he is playing both an elderly man and the Superhero.\n\n2. Special Effects: I heard the special effects are very childish and all. I don't say they are flawless, but they are not bad either.\n\n3. Kangna Ranauts Acting: Can't believe I am writing this but Kangna has done justice to her role. For the first time I felt she has actually acted well.\n\nCons:\n\n1. Music: There are 3 songs in this movie. I didn't feel the songs are good. They could have been much better, I think Rakesh Roshan should not hire Rajesh Roshan any more.\n\n2. Copying of characters from Hollywood: If you have seen X-Men series you will definitely be able to see a resemblance to some of the characters.\n\nAll said, I would say it is way better than RA.One and The amazing SpiderMan. No idea why people are saying its not good."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "mohitlegend121",
        "review_rating": "10",
        "review_title": "A story of courage.absolutely stunning movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "gautam_arun",
        "review_rating": "10",
        "review_title": "An Unstoppable Force of Krrish..",
        "review_detailed_main": "A new benchmark in action Movies, An Unstoppable Force of Krrish..\n\nThe VFX and CGI - You've Never Seen like this before to the Indian Cinema...\n\nFinest superhero movie ever...\n\nBest Villain in this Year...\n\nLets begin with the story. Although not as centralized, or as concentrated as the first two movies, it still is every bit as real. All characters are well chosen and it attracts the viewer to the end.\n\nThe last part action scenes that really are breath taking.\n\nMust watch the Movie......"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "prithvipopat",
        "review_rating": "8",
        "review_title": "awesome movie.....awesome story and finally awesome concept....!",
        "review_detailed_main": "before i start reviewing this title i just want to say one thing to rakesh roshan......'HATS OFF TO YOU' sir...i mean how tremendous the sci-fi concept behind the story..i had lot of expectations from this movie....and this one of the best movies in bollywood sci-fi history....there are couple of weak points i found one is there is issue related with vfx but overall vfx are much perfect as compare to RA-ONE.....and second thing is related with movie songs they seems too outdated......but it never reflects bad image on movie because you cannot judge the sci-fi movie by songs.....finallly if you love sci-fi movies and little bit of family emotions this movies is perfect for you because the acting in this movie by all the actors is just out of the world...especially hrithik roshan as rohit,krishna and KRRISH and the best of all vivek oberoi as KAAL."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "jmoneyjohal",
        "review_rating": "8",
        "review_title": "Kaun Spiderman aur Superman? Main toh sirf Krrish nu janta hoon!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "isaacrongmei",
        "review_rating": "8",
        "review_title": "great action..India's reply to avengers and iron man",
        "review_detailed_main": "Just cam back after watching Krrish 3.we've been waiting fr this movie.And it's worth it....the story lacks depth...and the screenplay needs polishing but the action sequences are flawless...it can be termed as best Bollywood action movie till date...it certainly qualifies...\n\nthe beginning is little sloppy as it takes time fr the characters and the story to settle down. but the second half have really great scenes.. I'd like to also comment on the casts...because it's not that good..The two great performances were given by Hrithik as Rohit Mehra and the villain Kaal(Vivek Oberoi)...superb acting...hats off to Rakesh Roshan for taking Bollywood a step ahead....\n\nand 1 last thing...the songs were crappy...background score was OK but the songs really lacked melody..especially \"Dil Tu Hi Bata\"..i can make a better song than that in bathroom... Anyway it was a great entertainer...Once again awesome fight scenes... nice job...Go for it...u won't b disappointed"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "i-Shuvo",
        "review_rating": "8",
        "review_title": "Best visuals in Bollywood history",
        "review_detailed_main": "Creating a world of superheroes on screen isn't a cakewalk. And, the exercise turns immensely trickier when there's no comic history to fall back on.\n\nClearly, those challenges are quite visible in director Rakesh Roshan's third installment – 'Krrish3'. He has, however, obediently stuck to the fundamentals of spinning a superhero movie that centres on the battle of the good versus the bad, but it's his decision to limit the visual effects that makes his effort rather unimaginative.\n\nThe script has all the elements an exciting superhero film must have. A vulnerable masked crusader, a malevolent super villain, who's as far away from redemption as heaven is from hell. A revenge story. And the ultimate battle – the triumph of good over evil (wait for the climax!). The best part? It isn't an all-indulgent film that focuses only on the greatness of Krrish. Sure, there are scenes that display his absolute power and goodness but hey, what the hell, aren't these what we all really crave to see in this kind of a film? While the first half is mainly to establish the characters, it's the second half that holds your attention till the last frame. Considering 75% of the film has VFX, the graphics seem a bit sketchy in a few initial scenes. But where it matters the most, like the climax, its bang on!\n\nAmong the songs, Dil tu hi bata is definitely the pick of the lot. Coming to the star cast, this is Hrithik Roshan's film all the way. He dons the roles of Rohit, Krrish and Krishna with ease. His performance evokes all the right emotions. You love him as Rohit, you desire him as the doting husband Krishna and you want to see him triumphant as Krrish. HR is India's only superhero. Period.\n\nBut it must be said that Vivek Oberoi lends ample and more support to HR. If HR is a superhero, VO is the perfect super villain. It is a towering performance. From his menacing entry right up to the end. The leading ladies have equally fleshed out parts. While Priyanka Chopra is good as the love of Krrish's life, it's Kangana Ranaut who stands out. Besides looking her part, stunning and sexy, she's also managed to work on her diction and speech problems. You will see a new and improved Kangana in this film.\n\nHats off to Rakesh Roshan for dreaming big and actually pulling off this risky proposition. Krrish 3 is spectacular, blockbuster entertainment. The scenes that are heavily inspired from hit Hollywood superhero franchises notwithstanding.\n\nFor sheer vision, bravado and superlative execution, this one soars to new orbits. Latch on to this cape for an exhilarating ride.\n\nNote: You might not like this film if sci-fi, fantasy films are not your scene."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "vedang-02968",
        "review_rating": "10",
        "review_title": "Very futuristic & bold move in Indian cinema",
        "review_detailed_main": "I enjoyed this movie when marvel & dc is dominating this movie is was good to watch writing is good kept you indulge in every aspect of this film waiting for part 4."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "chirag-ghosh",
        "review_rating": "8",
        "review_title": "A Great one time watch !",
        "review_detailed_main": "In my honest opinion, making a film of this genre is itself an uphill task. Father son duo, Rakesh and Hrithik impresses us thoroughly. This movie is a masterpiece when it comes to Sci Fi attempts which the Indian Cinema has underwent earlier. Vfx, Make up, character imagination is all top class. Now the whole point is if I start comparing this with Spiderman or Avengers, it wouldn't make a point considering the technical limitations and expertise and disposal at our end. Leaving these points this movie is extremely enjoyable for all ages. So the most awaited movie doesn't disappoint us at all.\n\nCons:- Songs were just not needed. Rest the movie is fully watchable and enjoyable with the whole family across generations"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "santoshpant99",
        "review_rating": "10",
        "review_title": "Exceptionally Good Movie",
        "review_detailed_main": "I watched this movie on last Saturday with my family and thanks Rakesh Roshan to bring this wonderful movie to us.Hats off to the effort of him that we can proudly say that India can deliver this king of larger then life movies. Just amazing.\n\nSuperheroes have been around in Hindi cinema for decades, but huge technology jumps have made 'Krrish 3' the slickest of them all, special effects-wise.Hrithik is the perfect choice amongst the Bollywood superstar lot to do this role. With his superbly articulated chest, each muscle moving and shiny and oiled, Krrish doesn't even need a mask and a cape. But the ensemble is eye-catching, and we ignore his immaculately-styled long hair, flying in the wind, when he is whizzing about rescuing little boys. Roshan Jr is as likable and earnest as he usually is, but can't rise above the mothballed treatment. Roshan Sr, who has written and directed, should have given the superhero more to do."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "rohitkumar_007",
        "review_rating": "10",
        "review_title": "Excellent Movie ! A giant leap for Bollywood !",
        "review_detailed_main": "I was apprehensive if Bollywood could pull off such an ambitious super- hero movie with mutants and megalomaniacs. But after watching the movie, I was amazed by the progress we have made in special effects and I think Hollywood would soon be knocking on Roshan's door. Rakesh Roshan's direction is terrific, Hrithik Roshan is perfect for Krrish, and the only disappointment is Rajesh Roshan's music and songs. Hrithik pulls off the father-son double role splendidly and I can see a Filmfare Best Actor award for him again. Among the other actors, Vivek Oberoi impresses as Kaya and Kangana Ranaut has done a good job as Kaya. Even though the movie's length might seem long at 2 hours and 30 minutes, the pace of the movie and the storyline ensures that you are never bored. This is a landmark movie for Bollywood and it clearly shows we have arrived."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "DareDevilKid",
        "review_rating": "8",
        "review_title": "Finally We Get Our Own Superhero and Boy He's Awesome",
        "review_detailed_main": "Reviewed by: Dare Devil Kid (DDK) Rating: 3.9/5 stars\n\nBollywood's first really good superhero film. Admittedly more than a few of its characters are inspired or amalgamated from their Hollywood counterparts, but they have been portrayed in a way that ultimately makes us warm up to their home-bred avatars. And truth be told, even though it mightn't be in the league of \"The Avengers\", \"The Dark Knight Trilogy\", most of the \"X-Men\" films, \"Thor 1 and 2\", or the first two \"Iron Man\" movies, it's still way better than overblown, mind-numbing CGI turds such as \"Iron Man 3\", \"Captain America\", or \"Green Lantern\".\n\nThe VFX are totally indigenous and a landmark for Indian cinema. Hrithik, Vivek, and Kangana pack a real wallop with their characters and Roshan Sr. has meticulously carved their story arcs. Priyanka, like in most of her movies, goes overboard with her sometimes helpless, sometimes confident act. Many of the action scenes stay with you long after you've exited the movie hall, and the climax, especially, is something to be marveled at.\n\nIf you can just tune off your senses during the the unnecessary and corny songs, (there are only about three of them) then you'll definitely be entertained to the highest levels by the plot, drama, and mind- blowing action of \"Krrish 3\". Ultimately, it's a movie that effectively conveys and permeates a overall aura of good triumphing over evil in the end, no matter what the odds. You'll end up leaving the theater with a loft, pepped-up, inspirational, and just a good feeling all round.\n\nWatch our first, very own, superhero for what it show itself to be - try not to unduly and unfairly draw comparison with it and some superior Hollywood fare - and you'll end up warming up to what might be India's initiation into its first, bonafide superhero franchise."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "anishpr94",
        "review_rating": "8",
        "review_title": "Krrish definitely is the best Indian super hero so far :)",
        "review_detailed_main": "Krrish 3 shows how much Indian cinema has advanced in terms of visual effects(could say its the best in India so far). Rakesh Roshan has put in an incomparable effort in making a spectacular super hero for India Lives upto the expectations. Any body who has watched super hero movies like spiderman, man of steel, thor, hulk and so on would have wished for such a super hero character for India. Well folks krrish is exactly the one for you then.\n\nOur hero Krishna is married to his lady love Priya. They live with his father, Rohit Mehra who works for the well being of the society. His main goal is an experiment which, with the help of sun rays, will bring life into the dead.In another part of the world Kaal, an evil genius, is selfishly misusing his powers to spread fear, death and destruction with the help of the mutants that he has created. What Kaal seeks is the bone marrow that can help him stand on his own feet and our hero krrish and his father rohit are the only ones who can stop him before kaal gets what he wants.The 1st half of the movie entertains you to the core. Second half slows down a bit but catches its pace soon enough. both the roles are perfect for Hrithik Roshan and he has done a descent job. The main negatives of the movie are the songs, Which isn't really required for a science fiction movie(and the villain could have had a better costume - my opinion :P) and one could feel that the movie adapted some of the ideas from the Xmen movie series. On the whole its definitely a movie to be watched on the big screen ,its stupendous action sequences , above average plot, the little twists , small messages and the amazing super hero powers and abilities keeps one entertained throughout its run-time (beware of the below average songs though! One might find it irritating).Krrish 3 may not be a perfect movie but it is certainly a bollywood super hero movie which you wouldn't wanna miss this diwali.. Rating - 7.5/10"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "saikia-b-bhaskar",
        "review_rating": "8",
        "review_title": "Amazing Movie",
        "review_detailed_main": "Well directed super hero movie till date from India. Used few concepts of resident evil(virus & underground tunnels in kaal hideout), matches few action scenes of Man of steel(on air actions of Kaal and Krrish),and few concepts of X-men but beautifully added them and produced a full new theme for the movie. Accept for three scenes (entry of krrish while running over the bridge in slow motion background was quit faster, action scene of saving 6 people at once at the end, and the costume of kaal with a kind of cricket helmet) everything else looks Quite naturally. All totally, this time Bollywood have successfully overcome there limits and was able to create a sci-fi movie with a nice concept of solar energy. If such progress continues in future this movie will be a serious threat for all other International super heroes (X-men group and avengers). All the best to Rakesh Roshan, hope you can overcome all those present drawbacks and Thanks for a great movie. This movie is worth watching."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "kusalsanjeeva1",
        "review_rating": "10",
        "review_title": "Krrish:3 the best super-hero movie ever!",
        "review_detailed_main": "Krrish:3 movie is absolutely great,it's one of the best movies ever made in Bollywood. I think every Bollywood fan must watch Krrish:3 and experience the magic!\n\nHrithik Roshan was incredible in both roles as Krrish & Rohit Mehra. He once again showed why he is the true perfectionist of Bollywood. Priyanka Chopra was really sweet in her act as Priya. Vivek Oberoi was unbelievable as violent super-villain Kaal. It's possibly the best performance ever by an actor in a negative role. That was a great effort by him to make such a transformation. Even Kangana Ranaut was good in her deadly role.\n\nThe visual effects of the movie are up to International standards! It's even better than Hollywood flicks. The songs are great as well, Raghupati Raghav is the best of them all. The clash between the super-hero and super-villain in the end was breathtaking. Krrish:3 is one of the best movies of the year so far and I hope the film,Hrithik Roshan and Vivek Oberoi will get all awards. They really deserve it. Mr.Rakesh Roshan is truly one of the greatest film-makers. Krrish is simply the best Indian super-hero ever! All 3 movies in Krrish trilogy - Koi Mil Gaya,Krrish and Krrish 3 are outstanding. Hats off to the entire team of Krrish 3!"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "gouthambhat-y",
        "review_rating": "8",
        "review_title": "lackluster but very brave",
        "review_detailed_main": "krrish3 is not a type of Indian super hero films,it is not even meet with Hollywood movies its very unique and need guts.so we should appreciate rakesh roshans attempt towards perfection.krrish3 is a complete visual treat.story lacks the charm and innocence of prequels,but catches you by its solid action sequences.music is a disaster .but the thing worth your ticket is performances.hrithik is the best in whole cast and crew and delivers his triple role at the edge of perfection.next in acting depairment is vivek.he is highly menacing in wheel chair as a handicapped.kangana is cool and she is the heroine of the film.priyanka is a big dis appointment.over all performances are vry wise.totally kkrrish Is flawed but its an answer to Hollywood to some extent.its worth every penny.go fopr it."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "nishantg04-120-75878",
        "review_rating": "9",
        "review_title": "Kundos to India's First Super Hero - Krrish",
        "review_detailed_main": "First of all , I call those ppl \"STUPID\" those who try to compare this movie with Hollywood movie!! I mean what do you expect in a 50 crore budget ?? ANOTHER AVATAR??? you must be kidding.!!\n\nDon't be just Hollywood Flatterer.\n\nNo doubt it is inspired by few Hollywood movies. but i will not say it's a complete copy.. ppl say it's a copy of X-men? I want to ask them which X-men movies showed that mutants are born in labs or test tubes?\n\nThis movie just take the theme of mutants and I will not say it's a copy. Of-course, you will not say Twilight is inspired by Underworld because both movies have Vampires and Werewolf. !!\n\nI really appreciate the attempts of Roshans , at least they did something which is different from regular bollywood masala flicks. And I am sure it would inspire other directors too to think different.\n\nStory line is good, Action scenes are superb with great visual effects. Only drawback of the movies it's songs and cheesy dialogues.. but it can be ignored. over n all a must watch movie."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "vikneshsiga",
        "review_rating": "9",
        "review_title": "Krrish 3 have went above exceptions",
        "review_detailed_main": "This year, we have other Bollywood movies to do better like Dhoom 3 and so on. But for a Indian superhero movie, it have almost everything right,the story,the characters, the dialogs and the visuals. I am not tell it is like Ra one or others blockbuster Hollywood movies. The visuals looked like in video game style so it can be passed. As for the villain, he is mean and scary at times but he is no joker. He is good for a villain but not the extend.The best part of all this is the ending. Even though it was long, it is dramatic but with action. At the end, if you saw Krrish, you would like this movie better. It is a improvement from Krrish."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "s-anish509",
        "review_rating": "10",
        "review_title": "KRRISH 3 is a riveting,with brilliant performances & great visuals",
        "review_detailed_main": "Krrish is back with a bang in the genre of superheroes.\n\nStory- Its rare in bollywood, that a megabudget flick has a straightforward storyline. Movie is perfectly paced. Screenplay is apt. and really good. It Gets - 9/10\n\nDirection & Other Technical Stuffs- Direction is really of the highest level. Roshan Sr. is the old gun of the movie who managed the things perfectly. He also provided the much needed indigenous flavor to the movie with a hint of melodrama.Editing is sharp,really sharp indeed.Other dept.s were good. (Except songs which I don't consider for this genre) It Gets - 9.5/10\n\nPerformances- Hrithik Roshan is getting better movie by movie. As Krrish/Krishna he looks perfect has done perfectly with all kinds scenes (especially action ones).AS Rohit he is better than the best. Rohit is really showpuller. As Rohit & Krrish both are contrasting, you will feel the both are different actors. Vivek Oberoi as Kaal is menacing and truly sends the chills through his devilous act. Kangana Ranaut as Kaya is very good and it's truly amongst her best. Priyanka Chopra does well in her limited appearance. All the cast has supported well. It Gets-10/10 VFX- They are stunning especially if you consider the budget. It really looks good in the theatre. There are many pacy action scenes especially the climax but they have done really nice with it, other scenes are mindblowing by bollywood standards. It Gets-9/10,(10/10 by bollywood standards & budget)\n\nI may give the movie 9/10 but because this movie brings transition to Hindi cinema & where many are making movie in much lower budget and are getting 100,200 crores, it takes guts to take a risk of this magnitude. Hopefully it will resurrect superhero genre in India, while Krrish franchise becomes legacy for Hindi cinema.(truly out of the box) I give it a tenner (10/10) Recommendation- If you have not seen it ,the now is the time to come in terms of transitional bollywood."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "yashthefreak",
        "review_rating": "10",
        "review_title": "Krrish 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "vamshini123",
        "review_rating": "10",
        "review_title": "Good movie !! It is one more forward step for our Indian Film industry after RaOne",
        "review_detailed_main": "Rakesh Roshan sir , have done a great job again ..Better than Remakes and Mass action films . The hard work of the team shows ,Wonderfull story line,Screenplay . This movie is not just a Action film ..its full of emotions too.. a master peace by our Indian Vfx artists . I think we are few steps away from Hollywood. Hrithik,Priyanka,Kangana,Vivek had done there best.Guys its time to get red of jealous of there hard work this kind of movie should be appreciated at least for the betterment of Indian VFX Artists and our Indian film industry .If the industry people are trying to do something to improve , few peoples just blindly discourage there efforts by saying its copy of Hollywood flicks , Hollywood have there comics as base and more over they have made over 100 superhero films , We Indian film makers don't even have comics n proper experience in that kind of films , !! thank you."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "ashishkumbhar",
        "review_rating": "10",
        "review_title": "Its a very Good movie ..",
        "review_detailed_main": "Please stop spreading negativity, & stop being jealous of there hard work behind the film. #Krrish3 #RaOne ,if you don't like it ! Go hell with Ur #MassAction films n #Remakes ,If the industry people are trying to do something to improve , few peoples just blindly discourage there efforts by saying its copy of Hollywood flicks , Dude ! Hollywood have there comics as base and more over they have made over 100 superhero films , We Indian film makers don't even have comics n proper experience in that kind of films , if you don't like the movie shut your mouth its as simple as that !! IM neither fan of #srk nor #hrithik . Respect the efforts of our #IndianArtists & #FilmMakers."
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "srijith-g-nath-k",
        "review_rating": "10",
        "review_title": "Krrish 3 It's also a super hit",
        "review_detailed_main": "Minutes before the packed preview screening of Krrish 3 in Mumbai yesterday, I felt a tap on my shoulder. A young mother with a cute 10- year-old girl in tow asked me if I thought Hrithik Roshan would show up at the screening. \"I don't know, perhaps. His father's here,\" I replied, pointing out director Rakesh Roshan, who was standing a few feet away. The Krrish 3 director's presence didn't impress the little girl. \"I only want to see Hrithik,\" she grumbled.\n\nRakesh Roshan owes the success off the Krrish series to kids like her and to be fair, he hasn't taken the fan following enjoyed by his son Hrithik and the franchise lightly. Roshan spent three years and Rs 115 crores making Krrish 3. It hopes to score with the legions of Hrithik and Priyanka Chopra fans, and as per the tried-and-trusted Bollywood mantra, the film has action, emotion and inspiration. Add to that the mysterious absence of any high profile releases for the next couple of weeks, and Krrish 3 has all the makings of a Diwali blockbuster.\n\nIn fact, do you hear that high-pitched ringing in your ears? That isn't just the sonic remains of Salim-Sulaiman's awful, background score as it bleeds out of movie theatres; it's the sound of cash registers ringing loud and clear. Seven years since the last film, Krishna Mehra alias Krrish (Hrithik) now lives in marital bliss with his wife Priya Mehra (Chopra, whose 2013 tally of Simpering Damsel In Distress is now at two, after Zanjeer), a journalist, and his mentally-challenged-yet-genius- scientist father Rohit (also Hrithik).\n\nThey live in a Mumbai that looks unusually sanitised and more dotted with ads, if such a thing were possible. Krrish 3, like its predecessors, may just be the world's greatest 'Spot The Product Placement' drinking game (chug your drink in less than 30 seconds if you spot the airplane that bears its own fictional logo as well as another existing airline's logo). The antagonist is Kaal (Vivek Oberoi), who lives in an impenetrable fortress perched upon unspecified snow-capped mountains.\n\nHe is wheelchair-bound but possesses the power to manipulate all kinds of objects with his mind, making him the love-child of Professor X and Magneto from Marvel Comics' X-Men series. Since plagiarism must never be half-baked, Kaal, who has been conducting experiments on humans for two decades to cure his handicap, also lords over his very own band of mutants, all of whose abilities have been ripped off from the X-Men universe.\n\nThey're called 'maanvars' (\"Maanav + Jaanvar = Maanvar! Dude, yeh toh sorted hai!\" exclaimed all six of the film's writers in unison one day, following which they all laughed, high-fived each other and treated themselves to a long lunch). One of said maanvars is Kaya (Kangna Ranaut), presumably named so for her flawless skin. Like Mystique from X-Men, she possesses the ability to assume the physical characteristics of any human being she touches. Her role is pivotal because, apart from rocking a tight latex outfit that leaves little to the imagination (not a complaint), she is the only maanvar with a speaking part and a song. The screenplay is essentially a series of developments and set-pieces inspired by many Hollywood films: Mission: Impossible 2, The Avengers, Iron Man, The Amazing Spider-Man, The Dark Knight trilogy and more. There are a couple of satisfactory original twists, but most of it is far too familiar to make any impact. The much ballyhooed special effects, touted to be a game-changer by Bollywood standards are precisely that: a game-changer only by Bollywood standards.\n\nThe sequences in Kaal's lair look pretty good, as do some shots of Krrish flying as well as general destruction; however, many others simply don't look seamless. The worst offender is an especially tacky shot of Kaya jumping off a building – it brought back fond memories of playing Tomb Raider on a Windows 98 PC. Krrish 3's flaws could have perhaps been salvaged had the dialogues and performances been at least engaging.\n\nAfter all, the Iron Man franchise owes a lot to Robert Downey Jr's charisma. However, Hrithik, Priyanka and Vivek play their parts with neither wit nor charm. Add to that the hefty helpings of cheesy one- liners, expository dialogue and a thunderous, tuneless soundtrack that has been shoddily mixed to almost guarantee a headache for the viewer. But who cares? Not the lakhs of Hrithik and PC fans, like the little girl and her mum I met at the start of the show. Not the vast number who aren't bothered about Hollywood and to whom Krrish and Kaal's antics in this movie will seem original. Not those who figure it's Diwali and they have to take the family to the movies (what else is there to do?) and that's that. As for the the minority that doesn't fall into any of these categories, do you guys like drinking games?"
    },
    {
        "movie_id": "tt1029231",
        "movie_name": "Krrish 3",
        "movie_rating": "5.3",
        "review_username": "boseavinandan",
        "review_rating": "8",
        "review_title": "Nice Film",
        "review_detailed_main": ""
    }
]