[
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "drkvas",
        "review_rating": "6",
        "review_title": "All depends what you are looking for",
        "review_detailed_main": "This movie is by no means garbage as some have posted, nor is it a great movie. Think before you buy the ticket. If you walk in expecting a spoof about ping pong w/ a cast of completely 1 dimensional characters to be a 10/10 you must live a life full of disappointment. This movie is funny, and if you didn't find yourself laughing at it you are probably already dead or on the fast track to ulcers and a stress induced stroke by age 30. This is not the first movie that approached a ridiculous subject in such silly manner. Odds are if you hate movies that have done that in the past (ie: Dude, Where's My Car, Blades of Glory, Hot Rod, etc.) you are gonna hate this one as well. As it stands right now this movie has a 4.6 and that probably a little low due to people 1 staring it because they wanted the Saving Private Ryan of ping pong movies. This movie should probably get a rating in the 6.1-6.3 category. If you have a little time to kill, have already seen Super Bad, and want a good laugh go check it out. Otherwise wait till it comes out on DVD or just ignore it. As for those who have blasted it. Go blast a movie that actually supposed to be good and isn't as opposed to picking on the 90 lb. asthmatic kid of movies. This movie can't defend itself for being stupid because is supposed to be. If you couldn't tell that from the trailer, then odds are you haven't made it this far into my comment."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "doolittle1",
        "review_rating": "6",
        "review_title": "Not as bad as I expected",
        "review_detailed_main": "I went into the theater expecting almost nothing good coming out of it. I read the reviews- Washington Post, USA Today, Rotten Tomatoes, etc. I knew they were horrible and quite honestly, I thought I would hate the movie. But my friend wanted to go, and me having no life whatsoever, I agreed to join her.\n\nI have to say, I should go into to more movies with such low expectations, because I really enjoyed it. Was the acting superior? No. Was the script well-written? No. But it was funny and Christopher Walken makes all things glorious, so all in all, it wasn't a bad way to spend a Thursday night after an especially terrible day of work. The actors all seemed to realize that they weren't participating in a project that would make movie history and they all seemed OK with that. It was very much a movie done to simply enjoy the play on the word \"balls\" and in this particular case, it was forgivable.\n\nOverall, don't go in expecting complete comedic genius and you just might find yourself laughing."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "mollymormonbrat",
        "review_rating": "5",
        "review_title": "Not the greatest \"stupid movie\" made, but it certainly made me giggle.",
        "review_detailed_main": "This has to be, quite possibly, the dumbest movie I have seen in a very, very long time.\n\nHowever, that is not necessarily a bad thing. I don't think there was a single moment in this film that purposely wanted any smidgen of intelligence whatsoever.\n\nAnd, heck, the reason I went to see this movie was because I thought it looked funny. And, guess what? I laughed. I don't know if this will go into the treasury of greatest stupid movies ever made, but it did leave me with a smile on my face.\n\nI think it was because it was ping-pong. Yes, I like a good game of ping-pong as much as the next person, but come on. It's ping-pong. Just try telling that to these characters. The fact that anyone could take so slight a game so seriously cracked me up.\n\nAnd that's where this movie works.\n\nIt's pointless, silly, and down-right brain cell killing. But I found myself forgiving everyone because they were so good-hearted in waltzing around with their idiotic humor.\n\nNo, it will probably not be nominated for Best Picture. But as for dumb comedy goes, this nicely held its own."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "alan-1011",
        "review_rating": "4",
        "review_title": "Okay, for cable",
        "review_detailed_main": "Balls of Fury wasn't the total disaster, but when that's the highest praise I can offer, well, that's a problem. Think of it as a lesser version of Dodgeball.\n\nPing-pong just isn't that funny, or exciting, or anything really - just like the film. The idea of underground ping-pong never really goes anywhere. The jokes are okay at times, but there are no big laughs and certainly no surprises.\n\nUnless you are a 10-14 year-old boy, who given the film's humor and scantily clad actresses is obviously the target market, you will probably be disappointed by paying money for it. Wait a couple of years and watch it free some night on Comedy Central and spend your ten bucks somewhere else."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Crazy Ian",
        "review_rating": "7",
        "review_title": "I liked it, I don't understand other people's problems with it...",
        "review_detailed_main": "I laughed at this movie. I laughed a LOT. True, some of the laughs were simply because some people were in this movie that had NO BUSINESS being in it, because they are considered to belong to a higher echelon of movies. Christopher Walken and Maggie Q are usually seen in LARGE blockbusters or high-profile indies; George Lopez has a very successful TV series, not to mention MANY cameos from well-known comedic actors. These people are GOOD. When they are on the screen, funny stuff happens. The script is an obvious parody on the movie \"Enter The Dragon\", but with ping-pong in lieu of kung-fu or karate. It also spoofs the \"underdog\" motif like the \"Rocky\" movies. I dunno, all I can say is that I REALLY enjoyed this movie. I didn't expect much, and I got a lot back because of that. True, I was a little liquored up, and a second sober viewing might not pay off repeat dividends, but I had a good time. Isn't that really what it's all about? Honestly, it ain't Citizen Kane, but I've seen crappier movies... a contemporary comparison: I was NOT disappointed by this movie, and comparatively much more disappointed with the 3rd Pirates of the Caribbean movie...\n\nYaaarrrr, thar be worse things under the sun, matey..."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "TheMovieMark",
        "review_rating": "5",
        "review_title": "The jokes suffer from the \"Kate Moss, Heather Mills McCartney, and post-2000 Muhammad Ali Syndrome.\"",
        "review_detailed_main": "Taxi. The Pacifier. Herbie Fully Loaded. Let's Go to Prison. Night at the Museum. If this list of movies is an accurate representation of your DVD collection, then my friends, you either have a young child in the house or a strange fetish for average-to-below average comedies. Or \"absolutely dreadful\" in the case of Jimmy Fallon's Taxi. *shudders* I'm still trying to erase memories of that steamer from my mind.\n\nOther than being part of the aforementioned pathetically sad DVD collection, do you know what else each of these movies has in common? They're all written by Ben Garant and Thomas Lennon, the duo who wrote, produced, and directed Balls of Fury. Are you trying to decide whether or not this is a film worthy of your time and money? Please let my above revelation stand as \"enough said.\"\n\nIn all honesty, what can you expect when you take a poor man's Jack Black and give him the starring role in a poor man's Dodgeball? A little thing I like to refer to as \"not much.\" Dan Fogler gives it the ol' college try, but perhaps the material is to blame for his mostly forgettable performance. He delivers a couple of laugh-out-loud moments, but by the time he's lip-synching to Def Leppard you'll be asking yourself, \"So who's this guy, and why is he doing a bad karaoke impersonation of 'Jack Black Meets Sam Kinison'?\"\n\nI will give Balls of Fury three credits - 1) Maggie Q is adorable, 2) The film rightfully never takes itself too seriously, and 3) It's nowhere near as filthy as I expected. At the top of my notebook I wrote, \"Balls/Genitalia References\" and I was set to keep track. I just knew they were going to fly off the screen fast and furious, especially judging by the \"a huge comedy with tiny balls\" tagline. So I was quite shocked when the grand total was only one, and that one was merely Maggie Q's character disgustedly relaying an example of the comments she was forced to deal with from male players.\n\nWhat more can I say about a film whose crowning achievement is, \"Well, I didn't expect much, and it wasn't the worst movie I've ever seen, so whatever\"? That certainly doesn't send you rushing to purchase a ticket, now does it? It'll be on TNT or TBS soon enough so just have patience and watch a few legitimately good comedies in the interim. There'll come a time when you're flipping channels, nothing else is on, and you'll cruise across this. You can decide then whether you want to sit through all of it. The end result will likely be a long email thanking me for saving you $8.\n\nBefore I commence, let me once again bring attention to my above \"poor man's Dodgeball\" quote. I overheard several disappointed people say, \"I thought it'd be like Dodgeball.\" What's that? Yeah, they said it in unison, Wisenheimer. Now shut up. The consensus? It's not even close. So if that was the opinion you formed after watching the trailer then dismiss that notion immediately. It's an interesting concept that probably contains about ten minutes of solid comedic material.\n\nWhat ultimately happens when you stretch that over an hour and a half? Unfortunately, the jokes suffer from what I like to call the \"Kate Moss, Heather Mills McCartney, and post-2000 Muhammad Ali Syndrome.\" In other words, they're flat, lame, and they pack no punch. Let's see them put THAT on the DVD cover."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "helmutty",
        "review_rating": "6",
        "review_title": "Balls of fury!",
        "review_detailed_main": "It is not that bad. I am one of the guys who like this. It is not bad comparing to the movies that were recently released in Singapore. Underdog is not very good, can't even be a superhero movie. Shoot em' up is for hard-core action fans and basically is very violent and bloody. Then it is Balls of fury which I enjoyed watching. I thought it was something like Prince of tennis, the live-action movie and the ping-pong ball fights scenes are something like that. That, the ping-pong ball fights, is the thing that attracted me to watch it. But Prince of tennis is better than this. Balls of fury got the comedy and the simple action which becomes a harmless fun movie. I like movies as long as they are fun or entertaining. Balls of fury, though fun, is considered quite dumb for some mature adults or teenagers, the director used stupid jokes like always get hit in the groin and banging into the wall. It has to be stupid to be funny. Sometimes, I admit that it is quite dumb in some of the scenes but it is fun, it got slow-motion ball fights, it got Maggie Q who is hot and it got dumb-a** jokes so what more you want for a dumb comedy.\n\nOverall, it makes a harmless movie that you can watch in your free time. It can be funny sometime and it too can be dumb sometime. You may laugh or smile at some scenes. I don't know but I smiled when watching it even at the stupidest jokes. Best to leave your brains at home while watching. This movie is not to be taken seriously."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "tajoholic",
        "review_rating": "",
        "review_title": "Silly but entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dyl_gon",
        "review_rating": "1",
        "review_title": "Christopher Walken has balls to appear in trash like Balls of Fury",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dbborroughs",
        "review_rating": "7",
        "review_title": "Funny spoof of spy and martial arts movies is better on the small screen than it was on the big",
        "review_detailed_main": "Amusing comedy staring Dan Folger who won a Tony for the 25th Annual Putnum County Spelling Bee. The film concerns a Ping Pong Tournament run by madman Christopher Walken. A spoof of films like Enter the Dragon and everyone of those spy films where the FBI or CIA use a regular Joe for a secret mission this is an amusing romp I'm glad I didn't pay big bucks to see on the big screen. Don't get me wrong its a funny movie but not worth the 11 bucks it would take to see in a theater. Dan Folger clearly is a man of limited ability,He's okay here but its clear between this and Good Luck Chuck he's headed for a limited film and TV career in supporting roles. As I said he's good the role doesn't require him to do little more than mug at the camera and he's fine, but I doubt very much he'll be able to ever really do more than that. Christopher Walken on the other hand is a scream, and its clear why he took the role, he can go as far over the top as he wants and still be amusing. The rest of the cast including veteran James Hong and comedian George Lopez is up to snuff, though Maggie Q is given little to do other than look good. Absolutely worth seeing on both DVD and cable."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "5",
        "review_title": "It offers some laughs but not enough",
        "review_detailed_main": "Balls of Fury seemed like a clever idea; take all the clichés from martial arts b-movies and apply them to ping-pong. Unfortunately, this flick doesn't deliver on its promising premise. First from seeing the trailer, I didn't know what to expect but it looked alright. This film wasn't be taken serious but just silly and comedic. There are some jokes there but some also childish acts. Most of the jokes are toilet jokes, jokes involving the blind man. It was surprising to see Christopher Waken in this. Though he was pretty god as the villain. He's a natural; his timing is terrific and he makes nearly everything he says worth a giggle or two in \"Balls.\" Without him, there wouldn't be much to write about this movie at all. It could have been much better but it was pretty okay imo"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "robertmfreeman",
        "review_rating": "8",
        "review_title": "A fun, silly movie. What's everyone whining about?",
        "review_detailed_main": "What are people whining about? Balls of Fury was quite funny! A few years ago, the people who are now trashing this movie would have been going gaga and adding a 100 million to its gross revenue...but that's part of the problem. Tastes have changed.\n\nI'm going to go on the record as saying that this movie is at least as funny as anything Adam Sandler or Will Ferrel has ever made. Why is it doing worse then? People just don't want silly, stupid comedies anymore, which is why Superbad is doing much better instead.\n\nBalls of Fury is a very funny movie with a wonderful cast (especially Christopher Walken and Thomas Lennon), and if some of the jokes fall flat, or gave themselves away in the trailer, the movie moves quickly enough that it doesn't matter. They're already onto another joke.\n\nTimes have changed, and unfortunately for the movie, so have tastes. These days, even silly spoofs are expected to meet a required level of maturity, and for those that were raised on Naked Gun, Hot Shots and Police Academy movies, that's a little sad.\n\nGo ahead, say the movie is juvenile. Say it's stupid. Just don't say it isn't funny. There were at least three moments during the movie when the entire theater was rolling in the aisles. I've never seen a SNL alumni movie do that."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "unbrokenmetal",
        "review_rating": "7",
        "review_title": "Ping-Pong: second chance",
        "review_detailed_main": "In a time when we are mostly given the sequel to a rip-off of a sequel to a blockbuster, I'm grateful for any movie that is slightly original, and I haven't seen any other movies yet about a Ping-Pong tournament to the death - have you? Even if some elements were familiar like the secret agents and Asian villains and although a couple of jokes fell flat, \"Balls of Fury\" has enough fresh ideas to offer to work well as a comedy. It helped that the hero was played by an unknown actor instead one of the usual comedy stars because he plays a nobody - somebody who once almost became a hero at the Olympics but lost. He doesn't deserve a second chance but gets one, anyway - encouraged by his coach with words of wisdom like \"believe in yourself when nobody else does... like now\"! Maggie Q as his training partner is hot, and Chris Walken as Feng adds the eccentric element which fits the colorful scenery. I liked it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "mandadexpunk",
        "review_rating": "4",
        "review_title": "I saw this movie for one reason alone - Christopher Walken",
        "review_detailed_main": "I knew going into the theater after seeing the previews that this was going to be a stupid movie. How could one NOT know? Look at the title people! Don't go complaining about it if you're not smart enough to figure out a ping-pong comedy was going to be stupid.\n\nWhat wasn't stupid, however, was Christopher Walken. He did an awesome job, though he always does an awesome job. I'm pretty sure all they did to get Christopher Walken to play this part was show him the wig he'd be wearing and an outfit or two and said \"the movie is about ping-pong\" and he went \"Okay, I'm in!\" That exactly how I image it, because Christopher Walken is awesome enough to do something like that and still do a great job at a stupid role.\n\nMy favorite part of this movie, however, is the panda bear. Christopher Walken as Feng takes the moronic hero into his den of evil ping-pong memorabilia then comments that he got a panda, but thinks it's dead, because he could not figure out how to feed it. Later one of the male sex slaves runs back into the soon to be exploded compound to save the panda, only to run out a few minutes later and comment that the bear was already dead, poor panda."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "JohnDeSando",
        "review_rating": "",
        "review_title": "Not Powerball",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dfranzen70",
        "review_rating": "5",
        "review_title": "Deflated balls",
        "review_detailed_main": "Balls of Fury is amiable to the point of being gregarious, but many of its jokes - verbal and visual - either just miss or misfire completely, and when it's over you start thinking of better ways you could have spent the previous ninety minutes. Highlights include Christopher Walken's waaaaay over the top performance as Feng, a mysterious, rich, eccentric ping pong fan; Thomas Lennon as an ubermean German Olympian; the luxuriant Maggie Q as a table tennis champion who dresses in skimpy short-shorts; and comically terrified male sex slaves.\n\nRandy Daytona (Dan Fogler) was once a promising young ping ponger. Back in 1988, he made the U.S. Olympic team and was all set (at age 12) to win against Lennon's Karl Wolfschtagg when he slipped and fell and couldn't return a serve, thus not only losing his chance at a medal but also sealing his father's fate, as the elder Daytona had bet heavily on the match. Years later, the adult Randy is approached by FBI Agent Rodriguez (George Lopez) to help the government nail the guy who had Randy's pop iced - a mysterious man named Feng, whose face no one's photographed or even seen. The feds know Feng's up to evil plans, but they need Randy to enter a private, super-secret ping pong tournament run by Feng at his undisclosed lair so they can get the goods on him.\n\nRandy sucks at ping pong now, though, so he must undergo Karate Kid-like training under the wise tutelage of the blind Master Wong (James Hong). To make sure no stereotypes are left alone, Wong also runs a Chinese restaurant. Oh well, at least he doesn't say the whole training bit is an ancient Chinese secret. Anyway, Wong's got a niece, or daughter, I've already forgotten which, who is superdupercrazygood at competitive ping pong. She can even fend off four players while taking orders over the phone at the restaurant, she's that darn good. Of course, it falls to her - that would be Maggie Q playing (get this) a woman named Maggie - to train the living bejeezus out of Randy. It should be pointed out here that while Maggie is sensual, gorgeous, and overall wonderful, Randy is fat, slovenly, a little sarcastic. In other words, it's a typical movie love-match, isn't it? From the moment Maggie puts Randy's arm in a chicken wing, you know they're gonna hook up.\n\nBut the real fun comes at Feng's tournament. For one thing, Walken's Feng is wearing a different outfit every time you see him, seemingly; he's sort of like Ming the Merciless, only not as bland. Walken vamps like only Walken can vamp, but it's sort of easy to steal a movie from guys like Fogler and Lopez. Even so, it's hard to overstate how much Walken overacts, even for Walken. If you're not a Walken fan, that is to say, you'll find nothing to like about this movie. Sure, some may call it hammy acting, but it's acting... nonetheless... isn't it? Then there's the tourney itself - it's sudden death, you see, and that's meant literally. Lose, and you get a blowdart to the neck, courtesy of Feng's right-hand chica, played by Aisha Tyler. And of course, along the way the underdog Randy must face his old enemy Karl, who so gleefully ended Daytona's amateur - and professional - career nearly twenty years earlier. But Randy's not even sure he wants to stick around, seeing as how everyone's getting killed. He's funny like that.\n\nBalls of Fury, brought to you by the guys behind Reno 911 and A Night at the Museum, does have its moments of funny, but by and large it suffers from a scattershot script and haphazard directing - it looks almost like it's some film student's final thesis project thingy. It's not quite as good as it should have been, and it's not nearly funny enough to be worth a theater ticket."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "moviemaniac008",
        "review_rating": "7",
        "review_title": "Balls of Fury is Hilarious!",
        "review_detailed_main": "I got a chance to see Balls of Fury in a premiere. It is hilarious! Let's start with the main actors: Of all of the main characters, I found Master Wong(James Hong) and Mr. Feng(Christopher Walken) really convincing. The others, such as Dan Fogler(Randy Detona), Maggie Q(Maggie Wong) and George Lopez(Ernie Rodriguez) were also convincing. The story seems like crap when you first read the synopsis, but believe me, it's actually Ping-Pong that makes us laugh for a whole hour and a half. If you saw it, and you liked it and you're actually reading this review, then you must know what I'm talking about. I highly recommend this film.\n\nWhy? Because it is unique. It's the kind of film that you might want to see over and over again, and, despite it's stupidity, will still like it"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "kellyfacebook1",
        "review_rating": "5",
        "review_title": "Could have been a LOT better",
        "review_detailed_main": "I had high hopes for this movie. I wanted to see another Dodgeball (one of my faves) or Blades of Glory but unfortunately this didn't deliver. Don't get me wrong, there are some quite funny moments in it (and one or two laugh out loud ones) but they are too few and far between. There are a number of reasons it disappointed but to be honest in my eyes the blame lies squarely at the door of Dan Fogler. I must admit I'm not hugely familiar with his other work but if this is anything to go by I won't be rushing to find it. This guy simply cannot carry a movie as the main character. In Balls of Fury never has the term \"phoned it in\" been more apt. He lacks charisma, warmth and above all comic timing. He did raise a few chuckles from me I must admit but only when he was on the receiving end of the joke and not the one who initiated it. I didn't care about his character which is never a good sign. I'm also sad to say that one of my favourite actors, Christopher Walken, also fares quite badly. I just don't think comedy is his forte but in his defence he was giving it a bloody good shot, unlike Mr Fogler. However, there is one saving grace and that is James Hong as Master Wong. Hilarious. He gets all the best lines and deservedly so as it is he who stops this movie getting three stars. In all this might raise a few laughs if you're watching it with mates and having a few drinks otherwise wait till it comes on TV."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "bopdog",
        "review_rating": "7",
        "review_title": "Chuckle Out Loud. Quiet humour. No belly laughs, but lots of long and slow comedy, done fairly well.",
        "review_detailed_main": "This definitely comes under the heading of \"Stoopid Comedies,\" which I happen to really enjoy. But the jokes are more wit than belly laughs. There isn't much outright slapstick--- which I would have liked. The funny parts are quiet, although not particularly subtle. The humour is more from the mild delight of seeing some old-time character actors like James Hong and Christopher Walken play out some long and slow bits over the course of the movie. Some of the humour also comes from a bit of satire--- although not of the outright \"spoof\" category. Mostly, it's just a series of improbable and goofy scenarios--- silly, whimsical, and with enough colour and dash to be enjoyable. If you want laugh out loud comedy--- you'll be disappointed, although I, and the audience, chuckled out loud. If you want a pleasant enough folly, then you'll probably be satisfied."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "gwcohn-2",
        "review_rating": "4",
        "review_title": "Not the Funniest Movie This Siummer",
        "review_detailed_main": "Saw this as a double feature with Superbad at the drive-in theater last night.\n\nI kind of like Reno 911 and hoped that since Thomas Lennon, the writer of this film, was my favorite character in Reno 911, it would be pretty funny.\n\nI suspect that the humor level is now written to appeal to the typical 12 year old loser. This movie was good for a few chuckles, the kung-foo was decent, and Maggie was well worth the view.\n\nBut it was was pretty lame by the standards of comedy movies when I was under 30. Movies like Animal House and Porky's were a gut-buster without having to resort to lame blind man walking into walls bits.\n\nI hadn't realized how much the main character was a Jack Black wannabee and even commented to my wife during the movie that Jack Black could have pulled it off better, then I read all of the comments comparing him to Jack Black.\n\nOK for a few grins but not something you would want to see over and over."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "6",
        "review_title": "As can be expected, Christopher Walken is the best character.",
        "review_detailed_main": "For the most part, \"Balls of Fury\" is an excuse to be silly. It could just as easily star Adam Sandler. Clearly the point of the movie is just to have a good time, and the cast is certainly doing that every step of the way. It's not rip-snorting humor by any stretch, but definitely a good way to enjoy oneself for two hours if there's nothing else to do. As can be expected, Christopher Walken is the best character in the flick. His role reminded me of Han in \"Enter the Dragon\" (or any James Bond villain, for that matter).\n\nSo, if you just want to laugh at something completely ridiculous for a while, this is the movie for you. Like \"A Night at the Roxbury\" and \"Dude, Where's My Car?\", it proves that movies can be funny and stupid at the same time."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "thinker1691",
        "review_rating": "5",
        "review_title": "\" Master, what can I do to learn the ways of peace? You can start by running away \"",
        "review_detailed_main": "In 1973 the greatest martial artist appeared on the American silver screen in a film called ' Fists of fury.' His name was Bruce Lee. Since then dozens of martial art movies have followed. Some good, others fair, with the majority being mere imitations. Serious films involving the finest of oriental arts are rare, therefore the ones which capture American audiences today are often comedies. Here is one example. The film is called \" Balls of Fury.\" If you have seen 'Fists of fury' you'll have no difficult seeing the parody in this movie. It's the story of Randy Daytona (Brett Delbuone), a young boy who's father Peter (Robert Patrick) was murdered by an Asian gangster, causing him to lose a Ping-Pong tournament. It's 19 years later and Randy (Dan Fogler) is sough-out and recruited by F.B.I. agent Rodriquez (George Lopez) to enter an international underground Ping-Pong tournament organized by Feng (Christopher Walken). Knowing he will need to be trained for the tournament Randy is given over a Master (James Hong) and his beautiful daughter (Maggie Q). With Jason Scott Lee playing Siu-Foo and other serious Hollywood actors, this is one movie which creates an assortment of slap-stick gags and amusing on-sight hilarity. It's fun to watch and with Walken playing the heavy sure to keep your funny bone active. Great movie and an honest comic tribute to the late Bruce Lee. ****"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "FatMan-QaTFM",
        "review_rating": "8",
        "review_title": "Mocked its own genre, not for everybody",
        "review_detailed_main": "This is a Thomas Lennon written comedy, so you know it's going to be a little abstract, and very pacing based. Balls of Fury really did a great job of keeping in the same humor vein of Reno 911, etc.\n\nYes, there are crotch shots and other typical middle school humor, but they happened so often and with such randomness that it went from stupid to hilarious.\n\nA lot of the humor is based in uncomfortable moments. Not a lot of people enjoy being made uncomfortable by something they are viewing for entertainment, but if you like that style of humor, Balls of Fury is right up your alley.\n\nThis isn't for everybody, so it'll either be a 10 or 1 for you. Worth the rental just to see."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Rogue-32",
        "review_rating": "6",
        "review_title": "Enough balls for everyone",
        "review_detailed_main": "So I went to see this yesterday - had a good feeling about it from the previews, with the clever title, all the furious ping-pong playing and of course Chris Walken in that hilarious get-up, figured it'd be worth a shot. Balls of Fury is a lot of fun, with a great central performance from Dan Fogler, who grows on ya with every scene. Walken and the rest of the excellent supporting cast contribute as well, with Maggie Q. being the stand-out she always is, although everyone is good here. The energy never lags, the jokes and the situations are funny without being seriously mean-spirited - it's just fun, plain and simple. You don't have to be a ping pong wizard to appreciate this film, you simply have to come with an open mind and a new cricket for the master."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "rughead",
        "review_rating": "1",
        "review_title": "90 minutes of my life that I'll never get back.",
        "review_detailed_main": "I'd give it 0/10 stars if I could.\n\nI'm all for mindless comedy sometimes. I love Ricky Bobby, BASEketball, etc, but this movie didn't know if it was a comedy or a movie with a plot. (hint:it was neither)\n\nIf you have a movie with funny writing, you can get away with playing it straight. This movie has poor writing, and straight acting making it one miserable 90 minute experience.\n\nI've seen High School productions with better writing and better acting.\n\nI should have left this so-called movie 30 minutes in and gone to see \"Superbad\" in the theater next door.\n\nThis movie was so bad, it makes me want to try to make a movie and my only \"training\" is an introduction to Theater course that I took in college. HEY !!! maybe that's how this movie got made in the first place."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "m1965",
        "review_rating": "",
        "review_title": "Easily One of the Best Comedies I've Seen Ever!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "DillonCometh-1",
        "review_rating": "3",
        "review_title": "Diedrich Bader Steals the Show",
        "review_detailed_main": "Much like a lot of comedies recently, Balls of Fury does a good job of appealing to the 13 and under crowd. People looking for a comedy that's smart and keeps the laughs coming should avoid this film. Reading a plot synopsis of this film, it certainly sounds promising, but experience it first hand and you can really get an idea of how it can't deliver. Dan Fogler is about as unbelievable as they come. The filmmakers seem like they want his character to be a bit over the top, but he seems like a mix between Jack Black and Chris Farley and he fails miserably. Christopher Walken is hilarious, but with the script as weak as it is, a lot of his potential humor is lost. George Lopez has his funny moments and he could have had more if the film would have played up his desire to be a James Bond-like hero. Diedrich Bader steals the show as a male sex slave with some affection for pandas, but this isn't saying much as he's only in the film for all of 5 minutes.\n\nAll in all, Balls of Fury should be avoided. What could have potentially been a send up of an obscure sport (ie Blads of Glory), turns out to be an uninspired waste of time and money. For good humor that can really be enjoyed, check out Superbad. I hated that movie too, but it is leaps and bounds above Balls of Fury."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "yidarmy42",
        "review_rating": "7",
        "review_title": "It's not a documentary!!",
        "review_detailed_main": "I love reading the reviews on here. Dumb movie...doesn't make sense.....unbelievable plot!\n\nFirst off it's a comedy parody of Bruce Lees enter the dragon. It's not trying to win an Oscar so don't judge it like that. It's a decent movie with funny quotes and it's a nice relaxing easy watch. If you are a fan of 80s movies and you looking for a few laughs then it's great, if your looking for Shindlers list you are in the wrong place. Are you gonna be thinking about this film in a week...no. Are you going to tell your mates you watched a funny movie the other day with a bit of nostalgia...yes. Take it for what it is and don't be too judgey!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "intelearts",
        "review_rating": "5",
        "review_title": "Generic, but OK",
        "review_detailed_main": "Loved the training sequences in this - but the rest was slightly off-kilter.\n\nThe idea of taking the martial arts film and using ping-pong as its weapon of choice is a nice one and actually the strongest idea in the film. the homage to Bruce Lee films are seen throughout if you're looking - and the Chinese scenes are the best thing in the movie.\n\nHad to say the tournament just wasn't exciting enough, just not enough real sports - this only works as satire if it has moments of real heart as well as real dumbness - plenty of smart dumb ideas, but not enough heart.\n\nPizza and beer movie - sure - just don't expect to really laugh, you will chuckle, and smile wryly though."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Hey_Sweden",
        "review_rating": "6",
        "review_title": "Better to die like a tiger, than live like a pussy.",
        "review_detailed_main": "Created by the same people behind the TV series 'Reno 911', \"Balls of Fury\" is really no ball of fire, but it passes the time amiably enough. Alright, so it IS pretty stupid. But it's not exactly aiming high in the first place. Some jokes do get dragged out too long, and there are awkward moments. Still, as it clocks in at just over an hour and a half, it doesn't go on any longer than it should. At its best, it does generate some modest chuckles here and there.\n\nThe cast is really more engaging than their material. Dan Fogler stars as Randy Daytona, a star ping-pong player at age 12 who gives up the game for 19 years before being persuaded to pick it up again by Federal agent Ernie Rodriguez (George Lopez). The Fed needs Randy to infiltrate a tournament presided over by arch-criminal Feng (Christopher Walken, at his most Christopher Walken-esque). It turns out that the bad guy is an avid ping-pong fanatic.\n\nWorking as a spoof of both action movies and sports movies, \"Balls of Fury\" is agreeably silly at times. Its characters are reasonably endearing and entertaining, and it's hard to knock a story (written by co-star Thomas Lennon, who plays the swaggering Kraut Karl Wolfschtagg, and director Robert Ben Garant) with an affection for the music of Def Leppard.\n\nLots of familiar faces here: Maggie Q as the luscious (and badass) love interest, Terry Crews, Robert Patrick (don't be fooled by his prominent billing; he's barely in the thing), Diedrich Bader, Aisha Tyler, Cary-Hiroyuki Tagawa, Jason Scott Lee, David Koechner, Patton Oswalt, David Proval, Masi Oka. But it's the legendary character actor James Hong who steals the show, in a gem of a comedic performance as the blind, Mr. Miyagi-like mentor. Walken, unsurprisingly, is a hoot as the villain.\n\nOf course \"Balls of Fury\" is no modern classic, but sometimes a \"good\" no-brainer comedy is just what some people look for to pass the time. It's certainly not as terrible as it's been made out to be.\n\nSix out of 10."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "donstinson",
        "review_rating": "1",
        "review_title": "Quite Possible the Worst Movie I Have Ever Seen.",
        "review_detailed_main": "Don't let the trailer fool you - this movie is as unfunny as athlete's foot.\n\nA lack of development, poor timing, low frequency of jokes, and overall low quality of jokes fills this picture. Other than that, everything was great.\n\nIt's a shame, as I was really looking forward to this movie. The lead character, Dan Fogler, would really show some promise if he had a decent script to work with. Even the second half of the movie, which introduces Christopher Walken, fell very flat. Probably the most disheartening part of this film is that the jokes played in the trailer are not funny when put into context in the film.\n\nI could go on with the poor development (a predictable love story that develops in less than three scenes?), the beating of the dead horse (jokes that weren't funny in the first place being stretched over two minutes) or just the plain idiocy of this film, but I just don't think I can write about this movie anymore. I almost wish they would have just cloned Dodgeball. Bottom line: it was not funny. At all.\n\nIf you must see this, please gather fifteen friends and wait for the rental. $4.99 at Blockbuster = about 30 cents a person, which will still feel like it was stolen from you, but it will never compare to the feeling that this movie is out there in this cruel world, waiting to make one person's life a little less joyous."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "hopingforpeace",
        "review_rating": "7",
        "review_title": "This movie is funny",
        "review_detailed_main": "If you don't think this movie is funny, then you should rush to Emergency and get that great big stiff stick removed from your ass. Unlike the incredibly boring Dodgeball, this movie plays farce the whole way. It's over the top to a perfect degree, with no pretensions.\n\nHow could you not love Christopher Walken in his mandarin emperor get up... or James Hong parodying James Hong? Or the huge conceit of ping-pong played as a a last-man-standing martial arts contest. And what a mercy to be spared Jack Black's histrionics or Will Ferrell's \"I'm a cute puppy\" brand of comedic acting. I'll take Dan Fogler, please.\n\nBy the way, I was fascinated by the special-effects ping-pong play, which looked so real in some instances and so phony in others.\n\nGo see it. Let go of your expectations and have a good laugh."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "OverSpun",
        "review_rating": "1",
        "review_title": "Probably the worst film ever made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "PWNYCNY",
        "review_rating": "9",
        "review_title": "Laughter abounds",
        "review_detailed_main": "There are some who may look down at this movie with disdain and dismiss it as just another lowbrow attempt to elicit cheap laughs. Well guess what? This movie does exactly that, and that's great! This is an incredibly funny movie, with goofy but likable characters, especially James Hong who plays Master Wong. James Hong gives one of the funniest performances ever. He was great. He made this movie happen. Also, Maggie Q was great. She is the next Sandra Oh. And the the goofy story line also contributes to the overall humor, and of course, one would be remiss if they did not mention the performance of Christopher Walken who once again proves that he is a great actor. His deadpan approach was absolutely perfect for this movie. If you want to watch a movie that will make you laugh, then this is the movie for you."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "vampyrecowboy",
        "review_rating": "7",
        "review_title": "It's fun to pass the time with.",
        "review_detailed_main": "A cool cast...\n\nDeidrich Bader was possibly the best character in the story...because he has such a unique role.\n\nJames Hong was good to not have been typecast as the Chinese mafia head.\n\nThe script was OK...not the best comedy...but for a PING PONG comedy..it got by...in fact I have never seen a comedy about ping pong before, so I guess it was actually pretty good.\n\nI mean how intense of a story can be made about ping pong? Right...so to have an action/comedy/romance script with pingpong as he driving force has to be really creative.\n\nYesterday I watched a \"classic\" - Butch Cassidy and The Sundance Kid...that was supposed to be a comedy...I didn't enjoy that Oscar award wining movie.\n\nI enjoyed this...and it will not win an award...but who needs an award really? Awards don't mean zhit in reality.\n\nThis was OK...and I'm glad I saw it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "vip_ebriega",
        "review_rating": "4",
        "review_title": "Completely forgettable, but thankfully, I wasn't too furious with 'Fury'.",
        "review_detailed_main": "My Take: It's only occasionally amusing.\n\nWill Farrell made my day with two really hilarious sports comedies, TALLADEGA NIGHTS and BLADES OF GLORY. He would have made his winning streak a little stronger if he starred in BALLS OF FURY, another sports comedy that follows the same formula, but then again, even he would have read the script. As written by Thomas Lennon and Robert Ben Garrant, which I learned are among the writers of the TV show RENO 911, BALLS OF FURY is packed with every single slapstick by the book. There's a lots of shots of a guy getting hit on the crotch, Christopher Walken on drag, complements about Maggie Q's sex appeal and every single joke these guys can think up (under the PG-13 level that is!). By this point, BALLS OF FURY is a train headed for disaster. But there's something that stops it from being a total train wreck. What is it? Some of it is actually funny.\n\nOkay, I didn't laugh all the way, but being funny alone is worth a lot these days. I expected nothing from BALLS OF FURY except that it would suck. I guess it probably helps. I expected less and less is what I got. BALLS OF FURY never ups the ante for laughs as any of the better comedies these days, but being funny alone is worth the price of admission. Okay, there's nothing especially funny about Christopher Walken in drag, or several guys getting their crotch creamed , but the movie actually finds another way to be funny in just a few moments later. It ain't for everyone, and I probably shouldn't be recommending this.\n\nDan Fogler is not a big comedian and, as it is shown in the film, not an especially funny one. He plays embarrassed former ping-pong champ Randy Daytona who has since given up on his glory days, until an FBI agent who shares an uncanny resemblance with George Lopez, who needs him to help out on tracking down one of FBI's Most Wanted, a crime-boss named Fang (Walken in drag), who happens to be officiating the biggest and most outrageous ping-pong tournament ever. To get back on his own two feet after years of absence, Daytona aids the teachings of ping-pong sage Master Wong (James Hong) and his hot niece Maggie (Maggie Q).\n\nIt's all antics of course, with Christopher Walken in drag and redoing every role he does on every comedy he starred in. Some of the jokes even have predictable outcomes. You know this guy's gonna get his butt kicked. You know that this guys gay. You know that someone will kiss Maggie Q (and no question whoever gets it either). The whole thing is instantly forgettable. But compared to a few other contenders, this movie is slightly passable. If it's your thing, then see it.\n\nRating: ** out of 5."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "JoeytheBrit",
        "review_rating": "",
        "review_title": "'Panda's dead!'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "gregmovies",
        "review_rating": "2",
        "review_title": "I've had it with unfunny comedies",
        "review_detailed_main": "Date Movie, Epic Movie, Meet the Spartans, Delta Farce, and now this. This movie just wasn't funny. The jokes fell flat (I laughed lightly maybe once or twice), and it feels like a complete rip off of the pretty funny \"Dodgeball\". I cannot believe Christopher Walken, a great actor, actually did this dimwitted 'comedy'. He's the only thing that saves this movie from a 1 star rating. The entire concept of the film is unfunny. The script is atrocious, and the actors must have done this one for the money.\n\nI give this film only 2 stars. If you enjoyed it, you are among the millions of Americans dumbing our country down."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "stupid and kinda funny",
        "review_detailed_main": "Randy Daytona (Dan Fogler) used to be a ping pong prodigy. Nineteen years earlier, he lost a big match and his father was killed by the triads for losing his bet. Today, he's a dining theater act. FBI Agent Rodriguez (George Lopez) recruits him to track down arch-criminal Feng (Christopher Walken) who is hosting an underground ping pong tournament. After initial rust, Rodriguez directs him to Wong (James Hong) and his niece Maggie (Maggie Q) for training. He is given the golden paddle as an invite to the secret tournament in Central America.\n\nThis is extremely stupid. It's a little funny. It's not mean-spirited. Dan Fogler is a nice lead but not necessarily a top one. The comedy doesn't always hit. This is better than most but not really that great."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "alan_v35",
        "review_rating": "5",
        "review_title": "Anyone seen Enter The Dragon?",
        "review_detailed_main": "Ben Garant joined with fellow Reno 911!er, Thomas Lennon to write this comedy, before getting behind the lens for his first feature film, while Lennon took the supporting role of German champion Karl Wolfschtagg. However, the star here is Dan Fogler, in a Jack Black kind of role as a Ping Pong protégé turned has-been, Randy Daytona. The acting is fine, and it's always great to see Christopher Walken back on screen. The story is pretty much a by-the-numbers spoof of Bruce Lee's Enter the Dragon, with some James Bond, Scarface and every clichéd martial arts film ever made. The script, the bread and butter of every comedy, is only passable, with more smiles and chuckles than laughs.\n\nRandy Daytona loses the 1988 Olympic Gold medal for ping-pong, and his father on the same day, and becomes a has-been haunted by his line, \"I'm going to Disneyland\". Daytona gets another chance when he is approached by FBI agent, Ernie Rodriguez (played by George Lopez), to go undercover at an underground ping-pong tournament run by the evil criminal emperor, Feng (Walken). After a gruelling training regiment under Master Wong, played well by veteran actor, James Hong, and his daughter, Maggie (Maggie Q) who looks great and has some very cool moves.\n\nThis review has come out pretty positive, but, although there are some good characters and ideas here, there is a lack of really funny jokes and, really, in a martial arts spoof about ping-pong that is packed with more talent than Tiger Woods, it shouldn't have been that hard to get a few really good laughs.\n\nThis work was first posted on realmoviereview.com"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "KUAlum26",
        "review_rating": "6",
        "review_title": "It knows you think it's dumb;it doesn't care",
        "review_detailed_main": "PIng-pong prodigy RAndy Daytona(Dan Fogler,as unlikely a leading man as they come!)has grown up under the failed ambitions of his youth to be a has-been,sideshow act when he is contacted by the Feds(led by a grimacing George Lopez)to infiltrate the racket of the mysterious Master Feng(Christopher Walken,far-and-away the best part of the movie).He'll need the help of the blind MAster Wong(JAmes HOng,having fun in a role written exclusively for him it appears)And his niece(MAggie Q,lean and mean!). Of course,there's added incentive for the one-time Olympic contestant turned wash-out:his hard-gambling father was one of the many victims of the nefarious Feng.\n\nIt is Oh-so-tempting to give this film a higher rating for me,because I found this film genuinely funny and also wise enough to understand just HOW clichéd and unoriginal the film's plot devices are(a quick list: aforementioned washout re-finding his game,wise old sage teacher,the tough-as-nails female lead/potential love-interest for male lead,high-stakes tournament),hence my summary line. Director Robert Ben Garant and co-writer(who also plays arch-baddie competitor and Cold war German stereotype Karl Wolfstaadt)Tom Lennon create a crass but effective comedy. I guess why I can't give this anything better than the rating I gave it simply because it seems like this movie skimps on the whole plot,choosing to instead put more emphasis on the gags. THat's good for the film in a microcosmic sort of way(i.e.the laughs)but it doesn't distinguish itself from other,similar-themed movies(Kingpin,Blades of Glory come immediately to mind). Still,as a rent,this is a basically likable way to waste about 90 minutes to two hours of your weekend or holidays."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "titanisiam",
        "review_rating": "1",
        "review_title": "Not worth the money or time... quite sad really...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "APOTimber",
        "review_rating": "6",
        "review_title": "A good, not great, comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "romli490",
        "review_rating": "1",
        "review_title": "beyond awful",
        "review_detailed_main": "If I could have given this piece of garbage negative stars, I would have. The plot is terrible, they take two bad jokes and beat them to death with a sledgehammer. Why some talented people agreed to be in this is beyond me. Did Christopher Walken need to make a car payment? Don't waste your money - even when this pile of poo comes out on DVD.\n\nMy husband liked the fight scene between Maggie Q and Jason Scott Lee, but that is about the only recommendation I can give it. There are some talented people in the film and they seem to actually try to do their best with material that isn't even fit to be called substandard.\n\nI've only seen two movies as bad as this one - Bloodrayne and Sympathy for the Devil. Even The Weatherman was better than this."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "oakstreetkeeley",
        "review_rating": "10",
        "review_title": "Nice Balls",
        "review_detailed_main": "\"Balls of Fury\" may be conventional, but there is a natural, fresh comedy about Fogler. With long, thick curly hair, pointy mutton chops and portly body, he has the look of someone who accidentally wandered onto a movie set, shrugged, and decided to play along. He plays Randy Daytona, a star in the underground world of table tennis competition has seen his fame decrease and luck turn sour. He attempts to recapture his former glory but is soon confronted by the FBI and asked to go undercover to smoke out a notorious criminal and ping-pong lord called Feng. He teams up with a blind ping-pong sage and Maggie Wong to complete his secret mission. the film is perfect for Naked Gun fans and Dodgeball fans."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Telescope-HF",
        "review_rating": "6",
        "review_title": "'Balls' are held up by supporting cast",
        "review_detailed_main": "As an employee of a theater showing this film starting tomorrow, I got to screen it this afternoon after building it.\n\nI'd like to start off by saying the trailers don't do this film much justice-there is not nearly as much ping pong as advertised. Having said that, the film isn't any better than it looks.\n\nDan Fogler does an all right job as the comedic lead, but at most points seems to be leaning on the much better supporting cast, including George Lopez and semi-crazed FBI agent and Thomas Lennon in another hilarious role playing a crazed German ping pong player with a personal grudge against Rob.\n\nThe film has some very funny moments, again, usually from a supporting cast(look for Lopez's hilarious Tony 'Scarface' Montana impersonations), but they are often balanced out by some very weak and often cheesy/clichéd moments.\n\nAll in all, this film is perfect for some laughs if you are bored one afternoon and have already seen all of the great films out right such as Bourne Supremacy and Superbad. A few laughs, the obvious clichés, and a little bit of action.\n\nJust go in with an open mind, and you could have a good time.\n\n3/5 stars"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "Worst film from 2007 so far.",
        "review_detailed_main": "\"Balls of Fury\" is an absolutely dreadful comedy. It amazingly would work better as a drama (not much better). With most films, I can find some redeeming quality. I looked hard and I this is what I found on this. The main character was slightly more tolerable than one would expect from such a poor movie. Christopher Walken was occasionally funny, simply because of his delivery...and well, that's it. Other than that, there are only negatives. Every joke could be seen by anyone a mile away. I could practically give the entire outcome of the film, including all the jokes, halfway through.\n\nThe plot, if you can call it that, started off slightly promising, but quickly became too stupid. Randy Daytona was a ping pong child prodigy. His father bet on him, and he lost, so he was killed. 18 years later Daytona works at a bad magic show. He is needed by the FBI to catch a Chinese mafia criminal. He gets lessons from a blind man, and it just gets dumber from there.\n\nTo go along with all of this, ping-pong just isn't an interesting sport to make in to a movie. It's repetitive and you can only do so much with it. I really hated this, and I have a feeling this will earn a well deserved spot in the bottom 100 very soon.\n\nMy rating: BOMB/****. 83 mins. PG-13 for language and sexual humor."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "siftystick",
        "review_rating": "1",
        "review_title": "This movie was terrible-a bad Dodgeball rip-off for sure.",
        "review_detailed_main": "Balls of Fury was a poor excuse for a movie. It was not anything near what it was hyped up to be. Character development was crude to say the least, I have no idea where half of the characters came from. The relationship between Randy and Mahogany materialized out of no where, one minute they barely knew each other and the next they're kissing on a river, and Randy has a gun? (I don't have anything against guns-just very random). I felt like this was a Dodgeball rip-off; there was the handicapped trainer, fat and lazy rags to riches character(s), fighting for something barely obtainable, and the gung-ho girl ready to do it all (play dodgeball or pingpong), and some sort of try out where the team/person lost when it appeared to be a sure win. At least Dodgeball had a well written story.\n\nIn short, the character development sucked, as did the plot and overall development-everything could have been SO much more planned out. I would have liked to see more of the training, and more pingpong battles-there was hardly any pingpong for a movie that was ABOUT pingpong. More of the relationship between Randy and Mahogany-a date or something, please? Who are half these people, and where did they come from?!\n\nI want $9.00 and 1.5 hours of my life back, please.\n\n--John"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "gacsingh",
        "review_rating": "7",
        "review_title": "its not as bad as people are saying it is",
        "review_detailed_main": "you see this not being an intelligent movie doesn't have to do anything but what i thought after watching this movie was that i enjoyed it. on some occasions it made me laugh and thats what matters in a comedy. who makes an intelligent comedy and who doesn't and blah blah blah , come one people its just a fun movie so enjoy it with some popcorn or something. i just finished watching this movie and i loved , the only negative thing i can say about this movie is that the lead role was too much like jack black but in a bad sort of way . Just watch this movie without taking it seriously , and you will like it , its kinda like pointless fun which works for me.\n\ngo see it for yourself\n\ni give this movie 7 out of 10"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jvanhorn-3",
        "review_rating": "2",
        "review_title": "I Really Wanted to Like this one...",
        "review_detailed_main": "I will start off by saying, I love stupid humor. I love movies like Talledega Nights, Dodgeball, 40 y/o Virgin, etc... This movie was the first movie I've ever walked out on. Ever. At first I didn't want to walk out. I kept thinking to myself \"No, when Christopher Walken shows up, this movie will get better.\" Sadly it didn't. This movie used jokes that would've been funny about 10 years ago, and have since been beaten mercilessly into the ground. It seemed like the writers of this movie went about it the same way Nickleback goes about writing songs: they just recycled old stuff that was successful and hoped it would work again. Like I said, I very rarely dislike a movie, but this one just didn't do it for me."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "PuNkStA",
        "review_rating": "6",
        "review_title": "Ping Pong Choker!",
        "review_detailed_main": "WELL! How should I start this!? Inevitably, I had the gut-feeling this movie was yet ANOTHER teen flick amongst the pile of 2007 'flops', but to my amazement, this one special and glorious movie, actually pulled it off!\n\nDan Fogler, AKA; Andy Daytona, plays a forth-coming part in his role as the 'Ex' Ping-Pong champion of the nineteen eighties league, sure, he had his moments where the script lines became flared in my eyes (bit boring, in another sense), but overall, the overweight, sweaty and hairy actor actually pulled through the budget comedy without much hassle.\n\nIronically, on the other hand, the infamous Christopher Walken, AKA; Feng, played perhaps one of the worst parts in his entire career -- sure, the man's trying to be a diverse actor, but the sensation of him taking this role in the movie, is more embarrassing than his short lived five minute scene in 'Pulp Fiction' harbouring a watch where the sun-don't-shine for a child (Bruce Willis, if you've seen the movie).\n\nIn all honesty, the movie made me laugh like crazy at points - Why!? Because the British/English have a very dry sense of humour and this movie dictated that role immensely well and even at some parts in the film, the movie conveyed a somewhat dark comedy that had me wondering a little to myself.\n\nOverall, the Movie could've been better - without a shadow of a doubt, but for a quick laugh and continuous on-beat comedy throughout, the movie fails to not make you grin or laugh from beginning to end, getting a real good thumbs from me on laughter, but a big thumbs down on conveyed acting skills - particularly by those who've been in the trade for a while."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Cocacolaguy912-2",
        "review_rating": "2",
        "review_title": "Dumb and funny, right? Nope. Just not good at all. Avoid.",
        "review_detailed_main": "I try to go into dumb yet potentially funny movies like this with an open mind. Usually I can walk out having said, \"that wasn't that horrible, 5/10 or 6/10.\"...and sometimes they turn out to be really worth it. The problem with Balls of Fury is that it just sucks. I went in with friends (most of which do not know movies beyond comedies like this) and an open mind, and all of us agreed that it was, in a simple word, bad.\n\nThe saving grace is, of course, the man - Christopher Walken. But even his supreme awesomeness could not save this waste of a film. I laughed sometimes but those laughs were forced, and if I had not been with friends, I wouldn't be laughing at all.\n\nNot to mention very cliché, as you may have guessed...and sometimes for me clichés can actually be good. In this case they were just annoying.\n\n2/10, avoid."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jerry-berglund",
        "review_rating": "6",
        "review_title": "I kinda like this movie",
        "review_detailed_main": "Not the best one, but I had a nice time watching it. I was watching the extra material, and they had something that was behind the curtains material when they said, the idéa was from this story about an Icelandish ping-pongplayerguy that was so popular in his homeland, that he almost couldn't go outside his home without getting greetings and hails. I couldn't stop help wondering, who this pingpong player is? Never heard about this. The only Pingpong player I know that kinda is legendary is a Swedish Tabletennis player \"Jan-Ove ,The Walking tree, Waldner\" That is the most famous player in the world and China. And its the Chines that calls him the Walking tree, just because hes ability to always return and wins everything. And this feeling was what I got in this movie, that its almost was about this player. And some scenes in the movie, is actually not impossible. I've seen to Swedish players do things like that in reality, and those are Jan-Ove Waldner and Jorgen Persson."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Rex_Stephens",
        "review_rating": "2",
        "review_title": "It could have been so much more.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "ccthemovieman-1",
        "review_rating": "8",
        "review_title": "Wong As 'Hong' A Surprise In This Pong Farce",
        "review_detailed_main": "If you like ping pong, laugh at the insane characters Christopher Walken likes to play, enjoy dark comedy, don't mind a bunch of stupid-but-funny scenes and a wildly outlandish story....you should like this movie. I did, and I realize it is a dumb movie....but it's fun and it's entertaining.\n\nIn many respects, this is a typical farcical comedy of today, with the same ingredients you see in many of them - the same type of outrageous characters (everyone in here), the typical spy story and Nazi villain (will Hollywood move on, in that regard?), tons of sexual innuendos and scantily-clad babes, an ugly-and fat-male lead and total absurd humor. It's the latter that I like, and I can't recall how many times I laughed out loud at some ridiculous sight or sentence that I saw in here.\n\nWalken, even though he doesn't play the lead guy is fascinating, as always in his typical off- the-wall role. To me, though, James Hong, an actor in his late '70s, just about stole this film as \"Master Wong,\" the blind instructor. He was flat-out hilarious and had a lot of great lines. Of course, so did Walken and the film's star, Dan Fogler (\"Randy Daytona\"). and the villain Thomas Lennon as \"Karl Wolfschtagg.\" Kudos to Lennon for also co-writing the script.\n\nOther reviewers here who wrote \"silly but entertaining\" hit it right on the nose. That's what it is, and that's what you should expect. Humor-wise, it is another \"Dodgeball,\" except now it's ping-pong, and it's funnier.\n\nIn addition, you get profound words to live by, such as \"To die like a tiger is better than living like a pussy.\" Hmmmm."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dwpollar",
        "review_rating": "7",
        "review_title": "Funny, inventive comedy...",
        "review_detailed_main": "1st watched 1/29/2008 - 7 out of 10(Dir-Robert Ben Garant): Funny, inventive comedy without the benefit of big name comedians. This movie did very well from beginning to end of moving the story along and providing funny and captivating characters every step of the way. Usually a gimmick-type movie stalls about ½ the way thru, but this one does not let up and is not happy with just a few jokes repeated over and over again. The story revolves around an Olympic table tennis player who lost a big game and has been in exile since that loss. An FBI agent, played by comedian George Lopez, seeks the ping-pong player out to compete again so that he can get to a wanted mean guy by being invited to his tournament after all his wins. It doesn't start out very well as he loses his first tournament but in typical \"rocky-style\" he gets focused with the help of a trainer and picks up the pace. This happens fairly quickly, which is the only down part of the movie in my opinion. A blind, karate-kid style mentor helps him believe in himself(believe it or not). Next steps in the evil and feminine tournament organizer, played by Christopher Walken, as the long big name in the movie. He is hilarious in this role and helps the last half of the movie continue in it's fun onslaught. Yes, I am a fan of table tennis(aka. Ping-pong) and I was looking forward to this movie because of this, but it exceeded my expectations as a funny movie from beginning to end. Don't miss it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "barrettwinans",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "This movie is crap. It starts out bad the second act is bad and the third act is bad. I like Christopher Walken very much, just not in this. I wish he would sign on to be in a better picture. The jokes were mediocre at best. I can't believe this didn't go straight to video. George Lopez is not funny in anything I don't know why the director thought he would be any different in this. When I first saw the trailer for this I thought it was going to be like Dodgeball with Ben Stiller and Vince Vaughn. This is nowhere close to and that movie was just OK. Even Blades of Glory with Will Ferrel was better than this. Don't waste a hour and a half of your life on this piece of garbage."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "killyourcreation",
        "review_rating": "1",
        "review_title": "Just the worst comedy I've ever seen",
        "review_detailed_main": "Now I have seen some terrible comedies in the past..American pie:band camp, employee of the month, Date Movie etc, but this piece of crap truly takes the cake.\n\nAn arduous 90 minutes later and I'm cringing. Storyline \u0096 Lame. Actors \u0096 Lame. Comedic Timing \u0096 Lame.\n\nI thought \"sweet, a movie featuring all my favourite Asian stars\" Shang Tsung from Mortal Kombat, Cassandra's dad from Waynes world 2 and Bruce Lee guy from Dragon, the Bruce lee story. However, I was possibly asking too much to expect a laugh from a movie so cheaply named \"balls of fury\"..like they were expecting people to laugh at the title. I suppose this is the way of the American comedies these days, cheap, tacky and SO unfunny it hurts.\n\nI lost count of the amount of times the fat guy (who obviously wanted to be Jack Black) got hit in the balls. Every time I saw the gay guys I cringed, every time somebody said \"im going to Disneyland\" I wanted to throw myself into a vat of fat. The \"love story\" made no sense as there was no valid build up, and no point to it. I'm not even going to get stared on Walken. He says \"Hows Trix?\" and \"Represent\"at points during the film, enough said.\n\nListen, just don't watch it. Don't fund these people to make more movies.\n\nLets put an end to this typical American crap NOW people!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "sweetlilsoprano",
        "review_rating": "7",
        "review_title": "Perfect Enter the dragon parody",
        "review_detailed_main": "This movie is 80% enter the dragon but with ping pong and if you don't find that premise funny then don't watch it, but if you do sit down have a beverage be be ready to laugh out loud multiple times"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "bkhorizo7",
        "review_rating": "",
        "review_title": "A Wannabe Dodgeball...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "cali-dudefuzi",
        "review_rating": "4",
        "review_title": "Funny, but not FUNNY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "nunyerbiz",
        "review_rating": "6",
        "review_title": "Not uproariously funny, but an enjoyable enough farce.",
        "review_detailed_main": "A silly, juvenile but ultimately likable enough comedy. While it never goes too lowbrow for a cheap laugh, it never really nails anything uproariously funny either. The lead is some guy I've never heard of or seen before and he doesn't do a ton to make himself memorable... but it does feature Chris Walken... And even though he's just hanging around for a paycheck, he's always fun enough in ridiculous roles like the one that's presented here. James Hong also steals some scenes... he is a charter member of the \"oh... I know THAT guy! He was great in suchandsuch\" Hall of Fame. One of those character actors that you know will deliver capable comic support. Maggie Q is cute as a button and provides some great eye candy, if 85lb Asian chicks in tight workout clothing is your thing...\n\nIt's sort of loosely based on \"Enter the Dragon\" with Ping-Pong instead of Kung Fu... and some Karate Kid thrown in for good measure. Like I said, things never really hit any great comedic heights... But Balls of Fury is a harmless farce that has it's heart in the right place, never trying too hard to please... just enjoying it's lot as a ridiculous little time waster. It's perfectly worthy for an 11pm HBO viewing after you realized you shouldn't have had all that Mountain Dew caffeine with dinner."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "tabuno",
        "review_rating": "4",
        "review_title": "Nice Try But Uninspiring",
        "review_detailed_main": "12 January 2008. Dan Fogler's first table tennis serve in the movie in a match is one that was illegal. In a way it's the way most of the movie appeared. There was effort that was evident and there were attempts at comedy that were slam shots, some were winners and others were out of bounds, sometimes way out of bounds. Balls of Fury is a mixed bag...at times it did justice to table tennis, other times it really made a mockery of it. Some of the physical gags were funny, some of the lines were creative...yet the editing, the consistency really suffered. It was hard to feel that one was watching quality and instead it was more like watching comedy circuit with special effects and sitting through a practice dry run experiencing both the fun but also the duds. Four out of Ten Stars."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "The_Defiant1",
        "review_rating": "7",
        "review_title": "Silly And Amusing, But Not A Steady Flow Of Laughs",
        "review_detailed_main": "This is definitely a silly movie. It's the classic comedy centered around a sport, but in this case it's a sport few would care about. It's essentially a sports comedy, martial arts parody, and a dysfunctional teen comedy all rolled into one. It'll make you roll your eyes plenty of times. You probably won't belly laugh. It is however still funny and the moments are scattered regularly enough that it should keep your attention.\n\nMaggie Q is adorable as the lead female in the movie and she really steals most of the scenes. The rest of the characters could have been substituted with anyone. This is probably best viewed as a DVD release."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "gridoon2025",
        "review_rating": "5",
        "review_title": "Has its moments",
        "review_detailed_main": "A comic take on both the \"Karate Kid\" and the \"Enter the Dragon\" formulas (replacing kung fu with ping pong), \"Balls of Fury\" is not a great comedy but it has its moments. If I had to single out the one actor who gets the most laughs, it would be James Hong, who spoofs many of the \"wise old master\" clichés (\"I need your advice, Master\" - \"I'm afraid I can't help you. The game is not in the paddle, the game is in YOU; that's usually my big finish\"). Maggie Q wears some tight & skimpy outfits and has 2 crisp, well-edited fight scenes - this film turned me more into a believer than \"Die Hard 4\" did. Christopher Walken is actually kind of disappointing here - not for his performance, but for the fact that the script gives him little juicy dialogue to work with (Max Zorin is still my favorite Bond villain!). The main lead, Dan Fogler, is on-and-off, just like the film: some jokes hit the target, some fall flat (the spoofy Matrix-type bullet-time effects have gotten pretty tired by the year 2007). Helped by quite a few familiar faces in the supporting cast, \"Balls of Fury\" is colorful, undemanding fun. (**)"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "shaolinlooper",
        "review_rating": "10",
        "review_title": "well done, funny, especially if you play TT or speak Chinese",
        "review_detailed_main": "I enjoyed this movie a lot. It was neither Die Hard action or Three Stooges slapstick. There is a lot of subtle humor in the style of Reno 911. I am a serious table tennis player and recognized a lot of inside jokes about the lack of respect our sport gets and the characters who show up to tournaments. There was lots of funny material in the Chinese language also. I thought Dan Fogler, Maggie Q, Tom Lennon, and Jason Scott Lee were excellent. The \"Dragon\" stole the show for me. At the US Nationals, there are several amazing \"dragons\" every year playing spectacularly. Table tennis is really a great and difficult sport. You have to master equipment, speed and spin, pressure points, and even the occasional cheater. But everyone who tries the sport or comes back to it in later years, finds it addictive. It is like catnip for humans. I think many serious players fear that this movie might set our sport back or make it the butt of jokes, but I hope many will see this movie and give table tennis a try. Table tennis has been described as a mix of non-contact martial arts and chess and portions of this movie portrayed it as such. I don't think it would be suitable for young children, but teenagers won't be traumatized. Also stay for the credits, which introduce the cast and show bloopers."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Ndirsch11",
        "review_rating": "6",
        "review_title": "'Balls of Fury' not as funny as the trailer",
        "review_detailed_main": "Have you ever gone to see a movie you've been looking forward to for a long time only to find out that all the best scenes have already been spoiled for you? Usually when this happens it's because of some overzealous friend who can't help but reveal every joke or plot detail beforehand. I was disappointed by the new comedy, \"Balls of Fury,\" not because it's a bad movie, but rather because all the best scenes had been given away by the trailer. Judging the trailer alone, which is hilarious, one would hope that \"Balls of Fury\" would turn out to be one of the funniest movies in years. Alas, it just wasn't meant to be.\n\n\"Balls of Fury\" is another one of those sports comedies like \"Blades of Glory\" in which a once disgraced athlete has to prove he's still got the talent to compete. The only difference this time around is that the sport is Ping-Pong, a game just about everyone has played but few take seriously. One of the funnier aspects of \"Balls of Fury\" is how everyone in the film takes Ping-Pong not only seriously, but deadly seriously. When a character asks \"what part of sudden death didn't you understand,\" he means business.\n\nThe plot is absurd but that's OK, I guess, because nobody goes to these kinds of films for a coherent plot. The story goes something like this: a kid named Randy Daytona (Dan Fogler) loses a national Ping-Ping tournament after having become a phenomenon and a superstar. Never recovering from that loss, Randy grows up, gains a lot of weight, and works at a bad job in Reno, Nevada. When FBI agent Rodriguez (George Lopez) shows up he recruits Randy on a dangerous mission to find Feng (Christopher Walken), a Ping-Pong enthusiast who runs a secret and criminal underworld of tournaments where people are held against their will. Before he goes off to compete in one of Feng's Ping-Pong tournaments Randy must first receive training from Wong (James Hong), a blind Chinese man who has trained some of the best Ping-Pong players in the world. If it sounds like you've heard this basic story before, it's because you have. You can more or less figure out the rest from here.\n\nThe funniest scenes involve the blind man (he practically steals the movie) as well as the Christopher Walken character. The casting of Walken as a Chinese man who likes to wear outlandish outfits might seem a bit odd but it nevertheless works. I don't think anyone else could have pulled it off except him. Walken has a way of delivering his lines in a deadpan manner that makes them seem all the more funny. It's clear that he had a good time with this role.\n\nWhat's disappointing about the movie, however, is that it's really not as funny as it sounds. The problem is that there are only about three or four kinds of jokes that are simply repeated over and over again until they're not funny anymore. We get at least six scenes of the main character getting punched or kicked in the crotch. We get a lot of homophobic humor (this seems to be happening a lot lately in comedies) involving feminine men wearing short shorts. We get a lot of scenes where the blind man is looking in the wrong direction or falling because he can't see in front of him. Last but not least, we get too much ethnic humor concerning the Chinese because apparently Asians are very funny to Western audiences even when they're not doing anything funny. This is all harmless, dumb fun, I suppose, but this kind of humor seems to be aimed primarily at twelve year old boys.\n\nThe trailer for \"Balls of Fury\" is much funnier than the movie itself because it contains all the best scenes and edited in such way as to create good comedic timing. When you've already seen the best scenes then much of the fun is spoiled. Even though I found \"Balls of Fury\" to be rather flat and derivative, I still watched it with a smile on my face. I suspect most people will enjoy it but I doubt they will remember it for very long."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jonygitar",
        "review_rating": "4",
        "review_title": "Enter the Dragon Parody",
        "review_detailed_main": "Reading thru 200 reviews, not 1 person remembers this is nearly shot for shot parody of 1973 Bruce Lee flick Enter the Dragon. I guess I'm getting old"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "MairegChernet",
        "review_rating": "5",
        "review_title": "Simplistic and shallow.",
        "review_detailed_main": "Balls of Fury could have been a lot better. The idea of the movie is somewhat a solid one. But unfortunately the execution and the script weren't. Balls of Fury somehow seemed like a short movie. The writers just jammed every part of the movie from exposition to resolution together without paying thorough attention to each one. Of course there were a couple of chuckles and of course it might have made us laugh a bit every now and then. But the film lacked substance. Without even giving the audience time to absorb what the story is about, the movie reaches its climax and ends. Again, it could have been a lot better, but unfortunately ends up being another wasted idea."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "oneloveall",
        "review_rating": "6",
        "review_title": "Starts fun but ends tiring",
        "review_detailed_main": "Admittedly, I have a bizarre connection to the sport of table tennis through family, and in such might have found some of the scenes disproportionately funny, but I do mean to stress only some scenes. Balls of Fury works as the cheesy ping-pong death match parody before it even enters it's clumsy showcase third act.\n\nIn the meantime, obvious physical humor coupled with some well timed delivery, guided by an occasionally biting script (only in one-liners of course, as the overall script itself adds up to little more then that) from our friends of Reno 911 fame ensures a few well placed zings for multi-demographics. Low expectations may be key, but the movie should carry enough laughs to garner relatively successful reviews for the modest gig it is."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Amusing distraction but nothing more",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "mccoyan",
        "review_rating": "2",
        "review_title": "Terrible Movie",
        "review_detailed_main": "This was a terrible move in all aspects. I singed on as an IMDb member just so I could post a comment about this stupid movie. If you're a moron this movie might be slightly entertaining, but for the most part, it stinks. The male actor is a stupid idiot. He is fat, and a no name in acting. Christopher Walken is the only known actor in the movie. He doesn't play a big enough role to be influential. The film is a disgrase Boo. Boo. Biggest waste of time ever. The acting was weak. What more would you like me to say. Why does IMDb require 10 lines of text. I can sum up my opinion in less than that. What the hell? Hell? Hell in a hand basket?"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "sackjigler",
        "review_rating": "7",
        "review_title": "Funny in that forgettable way",
        "review_detailed_main": "You know what this movie is going to offer going in. It's retarded funny and Christopher Walken is the greatest part of any movie he is in. I laughed throughout, never out loud, but all the way through. There were times when I found myself thinking about what I was going to do when it was over, but would focus back and continue laughing.\n\nDan Fogler is great. He looks like he was sucked straight out of the 80's. The master is a riot, Maggie Q is beautiful, and Tim Lennon is hilarious as always. The best laughs come from the cameos though. First, I never really thought Patton Oswalt was that funny, but he was cracking me up for the 5 minutes he was on screen. George Lopez was good, his best scene being in the hotel room when he wakes up in the middle of the night, hilarious. Diedrich Bader took the prize though. His portrayal of a actor thinking he was auditioning for a part and ending up a sex slave is one of the funniest things I've seen in a long time.\n\nIn the end though, it's all about the Walken. He is the man. You could easily tell he wasn't taking this seriously and he was having a blast doing so. The way the guy delivers lines just leaves you in stitches. Oh, and Aisha Tyler is so absurdly gorgeous that she should be in everything, if only for a minute.\n\nTo sum it up, it's worth a matinée one day when you have nothing else to do and a DVD rental for sure, and if you go in the right frame of mind, you should have a blast.\n\nOh, I forgot Jason Scott Lee. Hardly recognizable and very funny."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "emilyc1351",
        "review_rating": "2",
        "review_title": "A frustrating movie.",
        "review_detailed_main": "This movie was by far one of the top worst comedy's I've ever seen. There was nothing good about this movie. It was horrible in the beginning and it was even worse at the end.\n\nWhile watching this movie I just became frustrated with it. I wanted to see a comedy. I knew the movie wasn't going to be a great comedy but I at least expected a few good laughs, but instead I got nothing. That just really sucked.\n\nIf you want to see a comedy, well then, you should rethink wasting your time, and just wait until something better comes out.\n\nDon't Waste Your Time"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "FeastMode",
        "review_rating": "7",
        "review_title": "my notes",
        "review_detailed_main": "Really funny, awesome and creative. around 90% hit rate on the jokes including some hilarious parts. (1 viewing)"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "zardoz-13",
        "review_rating": "4",
        "review_title": "\"Balls of Fury\" is pathetic ping-pong porn!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "tyler-114",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "Seems that a lot of people are writing reviews and judging this movie pretty harshly. Movies are used by many as a form of escapism, I think this movie did an excellent job of this. It was a silly movie that was enjoyable to a broad audience especially if you like table tennis. I think Dan Fogler did a decent job and Christopher Walken's character was interesting. George Lopez was also way better then i expected he did a decent job. Anyone that takes their movie watching seriously enough to not find the male sex slaves, or panda humor funny i pity you. This should be getting a much higher rating then most are giving it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "wayens",
        "review_rating": "7",
        "review_title": "Balled Up Humor Needs a Better Bounce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "aquahammer15",
        "review_rating": "1",
        "review_title": "What you get if Ben Garant takes a dump on a movie reel.",
        "review_detailed_main": "This is by far, the worst piece of poop I have ever seen in my entire life. None of the people who ever produced,acted or directed this movie will ever hold a meaningful position in anything ever produced ever. Not once did I laugh, at anything in this movie (except obnoxiously to annoy people). Don't watch this movie, Ever. Please, I am saying this as a concerned human being. Oh yeah, and this is whats wrong with American film. At least it had something redeemable, like the fact that all the Asian's were masters of the martial arts, or all the great well written \"hit in ball jokes\", or even the special effects (see explosion at end of movie). Save yourself 10 brain cells and $10, don't see this."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Davidon80",
        "review_rating": "",
        "review_title": "Shaolin Soccer (- Soccer) + Dodgeball + Ping Pong + Enter the Dragon = Balls of Fury",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Boba_Fett1138",
        "review_rating": "5",
        "review_title": "Begins promising but sleeps in real fast.",
        "review_detailed_main": "Obviously this movie got inspired by the success of recent silly comedies and the ones about sports in particular. The movie has more misses then hits in it with its comedy and even though the movie certainly does has its moments, it's just not really a good or recommendable one to watch.\n\nWell, I sort of like this recent silly comedies of this new decade, even though not all are of high quality. They are just so silly that you can't help but laughing. This movie unfortunately is not among the best silly comedies of last recent years. It begins real good and promising but once the main story starts to kick in the movie starts to sleep in and becomes an usual, formulaic, silly, predictable movie, that lacks far too many original or truly hilarious moments. The movie sort of gets better again once Christopher Walken makes his entrance but it's just all not good enough to make this an effective movie. The movie constantly keeps you thinking throughout; They could had really done a better job with this!\n\nIt's concept sounds hilarious on its own right and the movie and main story is a spoof of the Bruce Lee class \"Enter the Dragon\". That movie already sort of was a silly movie in its own right but in a good and almost brilliant way. \"Balls of Fury\" is far from ever being good or brilliant though.\n\nProbably still the most hilarious element of the movie is the fact that Christopher Walken is in it. He plays his role of course deliberately from a serious angle which makes the comedy involving his character to work out all the better. His role is sort of too small though, also since he doesn't make his appearance until about halve way through the movie. It was as if he only was available for two weeks and they had to shoot all of his stuff in that time frame. None of the other main actors are really solid enough to fully carry this movie and some actors aren't even at the right place in this comedy.\n\nFor a good silly sports comedy, watch \"Dodgeball: A True Underdog Story\" instead.\n\n5/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "peterb666",
        "review_rating": "6",
        "review_title": "OK for a laugh - much better than expected",
        "review_detailed_main": "Balls of Fury is a fairly amusing movie. Certainly a lot better than expected and on a plane above the recent crop of so called spoof movies.\n\nChristopher Walken is good enough to lift this film a bit but so much talent wasted - although I think as the principal villain \u0096 he could have been a little more over the top. Dan Fogler does OK too as does veteran actor James Hong and game nemesis, Thomas Lennon.\n\nIt is good to see that the writing, while not exactly brilliant, didn't rely on 98% smut to carry the 'humour' which seems to be the current trend in so called comedy movies of this type."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "DICK STEEL",
        "review_rating": "4",
        "review_title": "A Nutshell Review: Balls of Fury",
        "review_detailed_main": "Balls of Fury is a movie that takes the mickey out of martial arts movies, throwing in a few cheap laughs, and nothing more. Like bad movies with plenty of cheese that adopts martial arts like Mortal Kombat and DOA, Balls follows the usual formula of having a prodigy fall from grace, only to be thrusted into a mission that involves prior intense training, and meeting with an adversary who in turn is skilled by the same martial arts teacher, so that the finale is a fight of values.\n\nOften there's a secret weapon involved too, and there's no other direct reference I can think of except that this backtracks all the way to Bruce Lee's Enter the Dragon, which the other two movies probably had traces of too. There's a tournament organized for the best of the best to pit their skills in, and the gladiators come from all over the world (so that you can include some poor geographically based comedy, in this case). Like Shih Kien's character in Enter the Dragon, you have an enigmatic megalomaniac as the chief of the tournament, held in a mansion, and in no time, our hero (hey, just for another Bruce Lee related reference for the heck of it, Jason Scott Lee's in this picture as well, though only as a supporting cast member) will discover its dark secrets, and kick the living daylights out of everyone to escape.\n\nExcept that in Balls, it is a ping pong / table tennis tournament, and the master of tournament is Feng (Christopher Walken, and I have no idea what's he doing here too), with assistance provided by Cary-Hiroyuki Tagawa, who is relegated from a similar head honcho role in the Mortal Kombat movie. And leading the charge to break into the tournament, is one time table tennis child prodigy Randy Daytona (Dan Fogler), a disgraced player now a fat shadow of his past formidable self, persuaded into the competition by a Secret Agent FBI man Agent Ernie (George Lopez) for the purpose of some serious federal investigations.\n\nThe comedy here is a bit tired, and most of the best bits were already included in the trailer. You have the usual sexist jokes involving sexy female characters, like the conveniently named Maggie (Maggie Q, doing so little and wearing even less), tired fat jokes, and plenty more from the blind sifu Master Wong (James Hong), whom I thought had probably the best lines in the movie, nevermind that most of them consists of faux pas martial arts philosophy full of sexual innuendos, and plenty of politically incorrectness coupled with slapstick physical comedy. But what went into effective overdrive, were the increasing attempts of sleight-of-hand moments in misdirection, which were spot on and timed perfectly. Other attempts though fell flat, especially those trying to recreate the spirit of nonsensical moments by the Abrahams-Zuker comedies, such as the inclusion of the sex slaves.\n\nHowever Balls turns out to be pretty bland overall, and the storyline already well summarized in the trailer. Don't expect too much, and you might enjoy a chuckle or two. Otherwise rent this instead."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "fntstcplnt",
        "review_rating": "6",
        "review_title": "Balls of Fury (2007)",
        "review_detailed_main": "Directed by Robert Ben Garant. Starring Dan Fogler, Christopher Walken, James Hong, George Lopez, Maggie Q, Thomas Lennon, Aisha Tyler, Cary-Hiroyuki Tagawa, Jason Scott Lee, Diedrich Bader, Robert Patrick, Terry Crews, Patton Oswalt. (PG-13)\n\nDisgraced ping pong hotshot Fogler is lured out of retirement by the FBI to help infiltrate a clandestine high-stakes tournament held by nefarious crimelord Walken. Dopey but shambolically amiable comedy is hit-or-miss all the way, but contains enough laughs in between the lazy stretches to be classified as a guilty pleasure. Walken, in a number of outrageously silly costumes, can be funny in his sleep (and even be funny because it seems like he's half-asleep at times), while Hong is delightful as the blind teacher with head-scratching nuggets of wisdom. Fogler unsuccessfully leans into Jack Black territory sometimes and the tired story beats are struck with sloppy predictability, but if you're looking for clever joke-writing and deep relationships in a movie called \"Balls of Fury,\" blame must be shared both ways.\n\n57/100"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "IonicBreezeMachine",
        "review_rating": "5",
        "review_title": "A funny enough idea, but its undermined by unqualified leads and turgid pacing and direction.",
        "review_detailed_main": "Following a humiliated defeat at the 1988 Olympics, once promising table tennis prodigy Randy Daytona (Dan Fogler) is now doing 3rd rate casino shows in Reno. Randy is approached by FBI Agent Ernie Rodriguez (George Lopez) to help him infiltrate an underground table tennis tournament hosted by international crime lord, Feng (Christopher Walken). With the tournament mere weeks away and Randy's competitive skills rusty from neglect, the two seek the help of ping pong master Wong (James Hong) and his niece Maggie (Maggie Q) who help bring Randy in shape to compete against the best in underworld Ping Pong.\n\nReleased in 2007, Balls of Fury was one of the late-comers to the mid-2000s trend of sports themed comedy films spurred by the success of 2004s sleeper hit dodgeball. 2007 was mostly a downswing for the genre with Blades of Glory being the last bona fide hit in the subgenre with the seltzerbergian spoof The Comeback and Balls of Fury signaling a downward swing that then culminated with the box office failure of Semi-Pro the following year. Balls of Fury isn't awful and has some inspired moments to it, but it feels very tired with a number of gags that can be tied to early efforts in the subgenre and is undercut by a mismatch of cast and role.\n\nThe movie has a fairly intriguing setup at first with the movie being set up as a spoof of martial arts flicks like Enter the Dragon or Gymkata except replacing kung fu with table tennis. There is some inspired silliness to certain proceedings such as a scene where Randy is taught about ping pong by being locked in a room with a flyswatter and a swarm of bees, but for the most part the movie doesn't have much it can do with the table tennis concept and will often try to steer away from it because it has to go elsewhere for comedic fodder. There are some good performances on display with James Hong playing a fun mentor character who's playing his role so serious that it works at making his lines work even if they aren't the best written simply from his delivery. Christopher Walken is also quite good as Feng an Asian crime lord (who's white) and his trademarked stilted inconsistent volumed performance fitting this eccentric weirdo who plays like a mixture of Dr. No and Fu Macnhu run through a funhouse mirror.\n\nUnfortunately while the supporting cast does get the odd chuckle, the leads are unfortunately out of their element as they don't make much of an impression and feel rather confused as to how they should approach the material. Dan Fogler went on to be a good actor in his own right with memorable turns in Hannibal and Fantastic Beasts, but here Fogler feels like he's been directed to imitate Jack Black. From the slacker metalhead person, to the slapstick heavy approach the movie feels like the producers wanted Jack Black for the role but instead found someone else as a stop gap. The reason Jack Black works so well is despite being a big guy (at this point anyway), Black has a surprising amount of energy and movement in his physical performance which makes him well suited to projects that are slapstick heavy and farcical. Here, Fogler is noticeably slower than Black and it's clear slapstick slacker isn't one of his strengths. George Lopez is also rather underwhelming playing an FBI desk jockey who wants t be like James Bond and that's basically the one note he's been given, and Maggie Q has an almost out of nowhere love interest connection with Fogler with her going from hating him to making out with him with no development that just leaves you scratching your head wondering if you missed a scene.\n\nBalls of Fury isn't offensively awful or annoying and does sport the odd laugh here and there, but unfortunately it doesn't have enough memorable set pieces to warrant a viewing and the laughs are sporadic for the most part. It's not the worst sports comedy from the mid-2000s wave, but with so many superior similar films it doesn't give much that you can't get in films like Blades of Glory, Dodgeball or The Ringer."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Vic_max",
        "review_rating": "7",
        "review_title": "Funny - if this is your cup of tea!",
        "review_detailed_main": "Comedy is hard to rate since it's so subjective. I happen to like the silly gags and comments in this movie enough to think it was a worthwhile experience.\n\nThe star, Dan Fogler (who I'm unfamiliar with) had a great innocence and down-trodden feel about him, his dialog 'felt' genuine so it was easy to be interested in his character. Christopher Walken played a role he's really great at: a crazy, exotic criminal. Many of his lines were fantastically crazy - and he made them fun to hear. James Hong, the blind master/teacher also put in a great performance with some hilarious one-liners spoofing great martial-art teachers in other movies.\n\nThe movie is basically about a former child ping-pong star who is recruited by the FBI to get close to their most wanted criminal. This criminal, it turns out, is a ping-pong fanatic and hosts his own death-match playoff.\n\nThere are some nutty plot holes, but for the most part, this movie was pretty satisfying. In addition the performances, the set designs were really colorful and rich; they were really nice to watch.\n\nAt this point in time, all you can do is watch the movie on TV. I recommend watching the first 5 minutes. If you like the type of humor you see, you'll probably like the whole movie. It's consistent throughout."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "fwomp",
        "review_rating": "4",
        "review_title": "Low-Brow Comedy Nets Few Laughs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "wabashawsandy",
        "review_rating": "10",
        "review_title": "Balls of Fun",
        "review_detailed_main": "I'm not sure what a lot of people are expecting out there cause if you go looking for a good time and want to have a laugh or two, Balls of Fury is a great time. It's not gonna win any awards but its fun, is full of great cameos (I won't spoil all of them) and has Christopher Walken in Asian emporer gear. C'mon now! Thomas Lennon steals the show as a German egomaniac (I want to go watch his movie) but overall there's enough humor here to please most summer comedy fans. I've never seen the lead before but he's someone to keep an eye on. George Lopez does a nice job with the character and love James Hong from all those 80's action movies here playing a blind ping pong teacher. Go to see Balls of Fury for some fun laughs but if you've got your panties in a bunch about cinema, calm down!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "hanyap",
        "review_rating": "7",
        "review_title": "Lighthearted and fun diversion from movies that take themselves too seriously",
        "review_detailed_main": "This movie is meant to be ridiculous, a spoof on sports movies that take themselves too seriously, among other things. It's a breath of fresh air in that regard.\n\nIs it Citizen Kane? No, of course not, but it's an amusing distraction with with some funny lines and Walken, as usual, is a treasure as the kingpin of the underground mafia-like ping pong scene.\n\nTo this day, my husband and I use some of the memorable lines (\"Mmm, tastes good!\" and \"Have your grandma pull the car around.\") and I won't spoil the context. =)\n\nIf you want a bit of a goofy and lighthearted movie as an escape from what's going on in the world or a bad day at the office, this silly movie might just be the ticket. Other good actors like Lopez and Maggie Q definitely elevate it as one of the better slapstick-type comedies."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "ked43",
        "review_rating": "1",
        "review_title": "miss it at all costs",
        "review_detailed_main": "This one is the one to miss folks.\n\nNot even the great one himself (Christopher Walken) could save this one. The lead character is at best painful to watch. Maggie Q was the only reason for me staying through the show. Stunning woman that Maggie. George Lopez, leave this OFF your resume there George. And for Jason Scott Lee to be in this show is reason enough for some intervention and immediate rehab! Get some help Jason!! I remember laughing once during the movie. Don't remember which part either. Sad sad sad. Previews are silly yes, but the movie isn't. Shhhhhocking!\n\nAnyhow ladies and gents I am only writing more on this subject due to not using enough lines and comments. Thank you IMDb. Now we must all bare the burden of reading the rantings of someone who went to this movie on his only day off this week and kiss $4.50 good bye. Not to mention an hour and a half I'll never get back. And who are these other people who did the other reviews that thought this eyeball burner was \"hilarious\"? Must be the director or producer. And if it takes 3 film companies to produce a movie, man you're in for a rough ride already. Hope I now used enough space so I can submit. Take care all."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "tmatei",
        "review_rating": "1",
        "review_title": "Meeting my worst expectations",
        "review_detailed_main": "Not only were the whole script and story of this film awful, but the acting was pathetic as well. I can't make up my mind over who is Dan Fogler trying to imitate with his lousy acting: Jack Black or Steve-O. Even if i were able to deal with the fact that the whole movie is a cheesy cliché, i get hit in the face by the incredibly lame and retarded \"funny moments\". I am really amazed that people put up with this kind of garbage. It's truly sad that today's audience is amused by retarded jokes and movies like this. Christopher Walken should be ashamed of himself for taking this role. The only thing i'm glad about is that i saw this piece of crap at a friend's place instead of wasting 10 dollars at the cinema."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Happy_Evil_Dude",
        "review_rating": "7",
        "review_title": "Good silly fun...and a nice homage.",
        "review_detailed_main": "Well what can be said? The thing is you already know whether you'll like this movie or not. You'll like this if you like the kind of goofy stuff Ben Stiller, Will Ferrell, Jack Black, Adam Sandler, etc put out. This is not an \"intelligent comedy\", this is \"silly\" stuff, and it's quite good at it. Interestingly, this is also a somewhat of a spoof. Interestingly because that angle wasn't used in the marketing and because the movie spoofed is from the early 70s! Indeed the plot is mainly a spoof/homage of the Bruce Lee classic \"Enter The Dragon\", with martial arts replaced by table tennis, and let me tell you it's a hell of a lot funnier than the official \"spoof movies\" delivered regularly by the Seltzer/Friedberg duo. The cast is good and full of familiar faces if you know your stuff (James Hong, Cary Hiroyuki-Tagawa, Robert Patrick, etc...) and the laughs are aplenty. Once again this is a comedy with jokes based on people falling and getting hit, gay guys, pandas and Asian people, and if you know what to expect you should enjoy it. The only disappointing part to me was that there wasn't a ping pong match in a hall of mirrors (watch Enter The Dragon if you don't know what I'm talking about)."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "w00f",
        "review_rating": "5",
        "review_title": "\"Balls\" Without Bounce",
        "review_detailed_main": "\"Balls of Fury\" is founded on a clever idea; take all the clichés from martial arts b-movies and apply them to ping pong. Unfortunately, this flick doesn't deliver on its promising premise. The problem is mainly lead actor Dan Fogler. His timing is off and he has no appeal at all. He's bland and brings no life to the screen at all.\n\nIt's too bad that the director couldn't get Jack Black for the lead. The role seemed written for him and it would have been interesting to see him play opposite Christopher Walken. As things turned out, Fogler seems to disappear each time he's on screen with Walken. In fact, the only thing that saves this film at all is Walken who proves once again that he can do comedy. He's a natural; his timing is terrific and he makes nearly everything he says worth a giggle or two in \"Balls.\" Without him, there wouldn't be much to write about this movie at all.\n\nWhen all is said and done, there isn't much point to plunking down $10 to see this in the theater. It's worth seeing for Walken, but probably better left for when it gets released on video."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "chazzy1864",
        "review_rating": "7",
        "review_title": "Does what it is supposed to quite well",
        "review_detailed_main": "This movie is by no means supposed to win any awards for drama, deep plots, and serious dialogue. This movie is a spoof on an otherwise not so popular sport. Think Dodgeball. A game we all remember playing, but no longer do. The movie is filled with actors you will recognize, and is loaded with laughs. Even the scenes that were played in the trailers, that I knew were coming, made me crack up.\n\nIf you are wanting a tearjerker, thinker, or movie with an underlying moral to the story, you are in the wrong place. If you just want a movie that will bring many a smile to your face, then look no further. This should definitely suffice."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "2",
        "review_title": "this is one to avoid",
        "review_detailed_main": "I thought this movie was horrible. It wasn't funny; it was boring. The lead character just wasn't interesting. And if you are going to use such a ridiculous plot; then it needs to be funny, and this wasn't. Maggie Q was the only interesting person in this; and mainly because I remember her from the last Die Hard movie. She even uses some of the same moves.\n\nI just didn't find ping pong appealing. Fighting to the death over ping pong; just didn't get it. Christopher Walken wasn't even too interesting in this.\n\nFINAL VERDICT: One of the worst films of the year."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "6",
        "review_title": "Furious Balls.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "film_reviewer-1",
        "review_rating": "1",
        "review_title": "dull and not a money maker (which was the intent)",
        "review_detailed_main": "At the very least, someone should have said, fix the script, \"it's not funny.\" Give up some money to fix it. Everyone looks bad, including the Asians. That's why Asians should continue to play villains 'til somebody gets in there who knows what to do.\n\nMaggie Q is cute from every angle. Be mindful of a limit. She can cross over and she needs to do it now before she gets stereotyped. On screen, she reads with a brain but if she doesn't show it soon ...\n\nChristopher Walken as always is a professional and saves what little there is. Likable Aisha Tyler is a talent and she's smart, but she needs to take more control. The nice surprise is that Jason Scott Lee can be funny. The German character gave it a good shot.\n\nWhat's George Lopez doing in there? His character works on his TV show, not here. Did the director say, just be George Lopez? The director deserves this criticism because Lopez' character has so much screen time.\n\nThis is a director who doesn't protect his people or himself. Sad."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "stevehorvath59-515-490534",
        "review_rating": "8",
        "review_title": "Balls of Fury, A comedic remake of Bruce Lee's Enter the Dragon.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Z21708",
        "review_rating": "6",
        "review_title": "You wanna know what it's like to play an illegal version of a sport? Then this probably isn't the movie for you.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "talkative82",
        "review_rating": "1",
        "review_title": "This should never have been made",
        "review_detailed_main": "It takes a lot for me to take the time to comment on a movie, but this time I just have to.\n\nAfter seeing this movie, I actually felt sick. I'm not sure if its the dinner I ate earlier, but I suspect it has more to do with the movie. Now it actually feels like my dinner is coming up. Thats how bad this movie is.\n\nI've seen movies before that more or less has the same plot. The little man against the stereotypical bad-guys. But this was just...oh god.\n\nThe lead actor should find a new job, preferably at McDonalds receiving orders. He's not funny, not by a long shot, and I have a strange feeling that he might have done some really shitty stand up comedy before that the director happened to stumble into one late afternoon. And because the director lacks most of his humorous sense, he found it amusing. Contrary to everybody else who was at the pub for a beer or ten. I feel bad for Christopher Walken as well. Once I had a lot of respect for his work, now...well lets just say you've got a long way to go baby to come back from this. Do you have a drug habit in need of funding that makes you join the cast of such an awful movie? It would be better for your reputation to check in to a rehab clinic than to join the cast of such an awful movie.\n\nTo every single person out there, from deranged psycho to kids, stay the hell away from this movie. It'll only damage your precious minds. Don't even download it for free. Don't watch it even if it comes with your happy meal. Which it probably will if Dan Fogler is working there."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "perttu_hartikainen",
        "review_rating": "1",
        "review_title": "I lasted 30 minutes",
        "review_detailed_main": "I picked this film from the local video store when noticing that Christopher Walken was in it. Man, it wasn't even \"so bad it's good\". It was just simply horrible and I couldn't watch it more than 30 minutes. The so called \"jokes\" were desperately trying to be funny and I found myself shaking my head and wondering what was going through Walken's mind when he agreed to be in this one. I guess every great actor makes mistakes, but...ugh! I tried, I really tried to watch it till Walken would appear, but I just couldn't. So here I am, warning you who haven't seen this movie yet. Don't watch it. Don't rent it. Don't buy it. Don't even THINK about it. Read a good book instead, you will thank me later. 1 out of 10 stars."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "randomStuff101",
        "review_rating": "7",
        "review_title": "Hilarious amazing ping pong",
        "review_detailed_main": "Anyone who has ever played a bit of table tennis (ping-pong) will love this.\n\nThere's true comedy gold moments in this movie, right from the start. Not all is smooth sailing though, as some jokes fall a bit flat, and you just want to forget and move on in a couple of scenes. However, the funny parts are genuinely funny and make up for any shortcomings.\n\nQuite surprised the average vote on IMDb is currently only a little above 5. This is worth way more.\n\nPing Pong fans of the world unite, and bump up the Balls of Fury average rating! I just wish they had shown more games of ping pong.. and they went a bit too slapstick in some scenes.\n\nWorth a look for sure. Lots of fun."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "zetes",
        "review_rating": "2",
        "review_title": "God awful",
        "review_detailed_main": "I can never wrap my head around the careers of Thomas Lennon and Robert Ben Garant. On television, their work is some of the best comedy of the past couple of decades: The State, Viva Variety!, and, their triumph, Comedy Central's Reno 911. But when they write movies, the results are well nigh unwatchable. I had thought in the past that they were just defecating cheap movie scripts so that they could make money and continue producing fine work on television. I mean, The Pacifier, Herbie: Fully Loaded and Night at the Museum smack of the kind of audience-despising material you might expect from smart writers deliberately trying to dumb down their work for some cold hard cash. Add to that the fact that their movie version of Reno 911, which was released early in 2007, was pretty good. But then, later in the year, they made this film. It's a cheesy little comedy, and it has a lot of potential to be decent, if unremarkable, fun. This is their genre, unlike the children's flicks. There's no conceivable reason to hate your audience here, since presumably they'll be pretty close to the same audience that watches Reno 911. Dan Fogler plays a former child prodigy and Olympic table tennis player. Now he's a loser, but he's being recruited by the FBI to infiltrate an underground ping-pong tournament, hosted by an international criminal, played by Christopher Walken. The premise, reminiscent of other recent underground sports comedies like Dodgeball and Beerfest, doesn't have a lot of promise, it's true. But all a comedy really needs is some good jokes, and it'll fly. Or at least you'd think it would. The problem with Balls of Fury isn't exactly its jokes. They're funny enough, for the most part. It's the delivery. The actors have little ability in comic timing (what halfway decent comedic director would willfully hire George Lopez to be in their movie?), and Robert Ben Garant often fails to sell the jokes, even when they are potentially amusing. Even when the comic performances are good, as is the case with Walken and co-writer Thomas Lennon himself, the editing is so poor that the gags almost never hit. It's all quite maddening. Reno 911 is particularly brilliant in its editing. I really don't see how the same people could produce such a laughless comedy. I guess TV is just their medium, but I don't understand why film-making should prove so difficult for them."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "6",
        "review_title": "Undemanding fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "rillovickwr4",
        "review_rating": "5",
        "review_title": "Giggles And Chuckles",
        "review_detailed_main": "HAHAHAHA. This movie was so funny it made my \"balls\" hurt...\n\nThat's the kind of humor I was expecting on my way into the movie theatre. And to my surprise, the humor was much cleaner for the most part. And not just clean, but somewhat humorous. Not a bad movie for someone who's just looking for laughs. If you're seeking the comedy of the year, seek elsewhere, but overall I think this movie was a pleasant surprise. At the very least it exceeded it's mediocre expectations. Not to mention it was satisfying to see people like stand-up comedian George Lopez, and established movie veteran Christopher Walken. This is by no means a \"must-see\" movie, but if you have some down time, it would hurt your \"balls\" to watch this movie."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "The_Matrix_Rocks",
        "review_rating": "6",
        "review_title": "Like Candy - Too Much Is Bad For You, But It's Good While It Lasts",
        "review_detailed_main": "Part of living a full life is indulging a guilty pleasure once in a while. That's my explanation (read: \"excuse\") for getting a huge kick of enjoyment out of \"Balls of Fury\"... and I'm sticking with it! The film borrows heavily from the plot lines of \"Enter The Dragon\", just about every 80s and 90s kung fu movie and (get this), at least 2 Will Ferrell movies! \"Balls of Fury\" replaces nunchakas and unrealistic sound effects with ping pong paddles and incredibly realistic sound effects. And all the while retaining a lavishly-dressed island-tournament setting.\n\nDan Fogler is believable as the slacker with a huge responsibility, but is totally unconvincing as a table tennis wunder-kind. He's incredibly lucky though and not only for having to play a character called Randy Daytona (I mean how cool is THAT name?!). He also gets to be cooed at by an incredibly hot Maggie Q (being hot in ways I've never seen her be hot before - did I mention she was HOT?) A decent comic performance from George Lopez, whose head looks less distractingly over-sized for his body for once - well done, Costume Department! Diederich Bader, Thomas Lennon and even Jason Scott Lee also turned in delightful and in Lennon and Lee's cases, hilariously over-the-top cameo appearances. Christopher Walken was Christopher Walken, and getting more and more caricatured in every outing.\n\nBut in my opinion, this picture belonged to the ubiquitous James Hong. He essentially reprises a role from a \"Revenge of the Nerds\" sequel and takes it up a good few notches. His ultimate triumph was to unseat, finally, from my memory this classic line: \"to truly hawk a loogie, you must retrieve the phlegm not from the throat... but from the soul\". In \"Balls of Fury\" he delivers a whole monologue that I am now moved to memorise in its place.\n\nYou've seen a movie like \"Balls of Fury\" a hundred times, and one wonders if anything except a predictable financial return motivates filmmakers to keep producing fare such as this.\n\nBut every now and then, on a lazy Saturday afternoon, you actually stumble onto one that you and your kids will be laughing about for the rest of the weekend."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "artemkelly",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "cruzthread",
        "review_rating": "10",
        "review_title": "One of the greatest movies ever made",
        "review_detailed_main": "Yeah I said it. I laughed until my sides hurt. Oscar worthy it may not be but that doesn't really mean anything these days. Just some good ol weird silliness."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "reddiemurf81",
        "review_rating": "6",
        "review_title": "Okidokey Artichokey,,,",
        "review_detailed_main": "With a title like Balls of Fury,,, what do expect? Shakespeare?!? It's a great 6.5, lol\n\nA once great ping pong player is approached by the FBI to help them take down an illegal weapons dealer, who happens to love ping pong.\n\nGreat cast and a fun time."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "disdressed12",
        "review_rating": "5",
        "review_title": "no masterpiece,but has its moments",
        "review_detailed_main": "this is not a great movie by any means.but it is a movie that takes ping pong(or table tennis)to the next level.the spoof level,that is. as far as i know this is the first spoof that's been made about the game.there are some chuckles here,but no real big laughs.it's sort of like \"Karate Kid\" but with Ping Pong.and obviously done with tongue firmly planted in cheek.it's fast paced,and has lots of action.Christopher Walken is the highlight of course,though we have to wait quite awhile to see him.you won't likely be bored while watching this flick.but i wouldn't expect anything resembling comedy of the fast and furious variety.for me,Balls of Fury is a 5/10"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "miketigas25",
        "review_rating": "4",
        "review_title": "Craptastic... Ugh...",
        "review_detailed_main": "I wanted to unwind a little after a long day at the University Library and so when I went to the local Cinema, guess what? Balls of Fury was the only movie closest to my desired time. Without second thoughts, I bought a ticket, went in and sat down in the middle-back of the theater without any expectations whatsoever.\n\n\"Oh yeah...\" That's all I can say. The jokes weren't really jokes to begin with. Though original to some extent, I didn't find them that funny - and that's coming a lot from a guy who has a very wide sense of humor. All throughout the film, I think I only giggled ONCE (No, not laugh. Giggle.) I think the movie had two problems: One, the pacing of the film. Two, Dan Fogler.\n\nI think the movie should have spent more time on the tournament and not during the \"training\". Watching the final scenes, it was like the movie was trying to catch a bad guy or something. Everything was moving pretty fast. It was as if the movie had to meet a deadline and the crew had to finish the film during the last hours.\n\nIn my opinion, Dan Fogler was awful in this movie. I don't know. Maybe it was the script or the director or whatever. OR MAYBE... It was his sideburns! I really think he could do much better on TV; like in a sitcom or his own show. But in the movies? I'm not really sure.\n\nIf you are really curious about this movie, just go watch it on video. Better yet, why not wait for it on HBO? Watching it on the big screen is really not worth it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "pstawicki",
        "review_rating": "7",
        "review_title": "Very Amusing Movie With Lots of Tiny Balls",
        "review_detailed_main": "Ping Pong - Let's face it - Its not NASCAR. It's not even Tennis. Instead what we have here is a spoof. And if you go in knowing your watching a spoof - you will at the very least chuckle through out this well made and very amusing film.\n\nRight now the current spate of spoofs is basically non sensible with stupid characters mostly based on current actors or direct rip offs of other films (Scary Movie 1-1000 & Date Movie) This movie isn't that movie. Yes its a plot we have seen before many times but rather than talking down to the audience, the writers truly appeared to have an objective of amusing the audience.\n\nChirstopher Walken is awesome as Feng playing a campy version of himself. The comments are delivered as only Walken can do and it really works.\n\nDan Fogler is killer as the ping pong champ without a future. His delivery is awesome but he actually has some heart and your rooting for the dope.\n\nMy personal is James Hong. The man is 70 plus years old and still makes me laugh - even with the same kind of humor he's been delivering since the 80's.\n\nThe big plus is Maggie Q and Aisha Tyler - Two stunning women looking good and not just eating the scenery. Aishas delivery is too damned funny. I wish we could see more of her.\n\nIts not going to win any awards but you wont kick yourself for wasting two hours after watching it!! Good job guys!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "4",
        "review_title": "Enter the Balls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dunmore_ego",
        "review_rating": "6",
        "review_title": "Kung Fu Ping Pong Panda",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "Balls of Fury",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "mhorg2018",
        "review_rating": "4",
        "review_title": "Turn off your brain and have fun",
        "review_detailed_main": "I gave this a 4 because it could and should have been way funnier. Basically a Kung Fu pastiche, but with Ping Pong in place of Kung Fu, some of the jokes and situations are very funny and some are not. Worth seeing once."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "wisdomwasp",
        "review_rating": "8",
        "review_title": "Funnier than is has any right to be",
        "review_detailed_main": "The story follows Daytona a failed ping pong prodigy, called in by the FBI too... well the plot is a bit silly. It's honestly just to move along the gags, which come thick and fast- this is a very funny and stupid film of which this era of the 2000s was common but it's much funnier than most of its kind.\n\nI really enjoyed it and recommend if you want to watch a stupid funny movie, christopher walken even makes a typically weird appearance and the mentor is the standout for dumb laughs."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dubbayewdubbayew",
        "review_rating": "4",
        "review_title": "Just awful",
        "review_detailed_main": "There is absolutely no salvation for this abomination of comedic film. It's not even so stupid it's funny, its just really stupid. Thomas Lennon (Lt. Dangle from Reno 911) is just about the only character with any humor. The blind guy has no funny parts either, you basically have to force yourself to laugh. The main character is as drab as he is two-dimensional. This was an opportunity to be a good film, but it just doesn't even come close. Christopher Walken has once again embarrassed himself, not for being bad, for continually appearing in third rate films. He has never turned down a movie offer, and I respect that, but could he just stop doing things like this?? There are only two positives in this movie, Maggie Q is hot, and Thomas Lennon's performance, other than that, it's basically worse than Gigli."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "NJRocker091188",
        "review_rating": "3",
        "review_title": "it was a stupid funny movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "dsalouk",
        "review_rating": "2",
        "review_title": "A walking corpse of a film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "5",
        "review_title": "more misses than hits in the laughs department",
        "review_detailed_main": "The humor is broad and predictably predictable in \"Balls of Fury,\" a low-grade, though admittedly good-natured, sports farce that elicits roughly one laugh for every five attempts at being funny (not a bad ration, I suppose, but not really high enough to make the movie worth seeing). The plot, which is barely worth detailing here, involves a has-been table tennis champion (Dan Fogler) hired by the F.B.I. to infiltrate a ping pong tournament (a literal \"death match\") being hosted by a notorious underworld kingpin (played to the hilt by the one and only Christopher Walken). George Lopez, James Hong, and Diedrich Bader (\"The Drew Carey Show\") round out the likable cast.\n\nDespite a handful of laugh-out-loud moments and an air of genuine sweetness, there's no compelling reason to recommend \"Balls of Fury,\" aside from Walken's campy performance, that is. My advice, therefore, would be to skip \"Balls of Fury\" altogether and re-watch \"Airplane\" or \"Naked Gun\" instead."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "editor-299",
        "review_rating": "4",
        "review_title": "Film may have 'Balls,' but not a whole lot of laughs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "smithie111",
        "review_rating": "10",
        "review_title": "Surprisingly Very Funny and Entertaining",
        "review_detailed_main": "I was strangely drawn to this film and went and saw it today. Normally this is not my type of film but I do of course always enjoy the comedy of Christopher Walken. To my surprise, I actually really enjoyed it and thought it was pretty well done. Christopher Walken of course was very funny. The way in which he delivers his lines are priceless and humorous in themselves no matter what the line even is. He definitely was an impressive part of the film.\n\nThe overall storyline is so ridiculously absurd that it makes the film that much more humorous. It achieves what it set out to do and that is be a comedy that requires absolutely no deep thought on the audience's part but will definitely keep you entertained and laughing. There are a few great one-liners in there as well that I am not going to spoil for you. The guys from Reno 911 hit the nail on the head in this absurd comedy. And it is absurd.... so absurd I think you all might enjoy it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "iquine",
        "review_rating": "3",
        "review_title": "Mixes Spying and Ping Pong: How Well Do You Think That'll Work?",
        "review_detailed_main": "(Flash Review)\n\nThis was a terrible mess. I counted and I laughed thrice. Not even a Christopher Walken character can save this. A washed up and slobby former ping pong talent with such a drab life he is doing Vegas style ping pong performances gets recruited by the FBI to go undercover in an Eastern country table tennis tournament to flush out a killer. He is set up with a Mr. Miyagi type coach and he faces some interesting opponents and implausibly gets cozy with an attractive gal as he gets ready for his mission. Will the FBI's plan work? Will the goofball make it through the tournament? Walken had some good moments and funny costumes but this was terribly written and often over-acted....even for a late night slapstick movie."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "filmgasmreviewers",
        "review_rating": "5",
        "review_title": "Filmgasm.com's Balls of Fury Review",
        "review_detailed_main": "By: Matt Shapiro Balls of Fury does all anyone expects it to do - it entertains. It takes a story that knows it's silly, throws in a lot of humor, has some unneeded but still cool action, a few ping pong battles, and entertains its viewer. But there's no way I could give it a positive grade. Not only is it an incredibly stupid (however purposeful that is) movie, but aside from Christopher Walken (who has a blast playing his part) and partially Dan Fogel (who seems a lot like a slightly less funny Jack Black), none of the performances in this film are at all convincing, as they are all stereotypical portrayal of either Asians, Hispanics, or black people.\n\nThe set-up is fine enough; an 11 year-old ping pong master named Randy Daytona competes in the Olympics against a German, and just before the game he discovers that his father bet an incredible amount of money on his son's win. Nervous for what will happen if he loses, Randy screws up and loses the game. His father bet an unpayable amount of money, so after losing, his life is taken from him by a man known as Feng. Nineteen years after losing this game, Daytona's life is in ruins; he has no job, he's quite overweight, and he doesn't have any friends. This much of the story works well.\n\nHowever, the story that follows (aka the main plot of the movie) is highly unrealistic and takes some huge leaps to keep the pace nice and brisk (this was done to keep the film concise at 90 minutes). The action sequences, while entertaining, are far too unrealistic and out of touch with the rest of the story; the only cool \"action\" was the stuff portrayed via ping pong table. And the small romantic element of the movie was highly unneeded (and highly unrealistic; someone as gorgeous as Maggie Q would not fall for a super low-life like Dan Fogel, especially since she grew up hating white people).\n\nIf you are at all a fan of the frat pack comedies, or just dumb comedies in general, you'll surely enjoy this film to a certain extent. It provides a lot of solid one-liners and some well-done (although over-the-top) physical humor. As a movie, though, its plot is a mess, its acting outside two characters is very weak, its script falters whenever it tries to get serious, and the ending is a little too oh-come-on for it's own good."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Dream_seeker",
        "review_rating": "2",
        "review_title": "Tacky and still falls under the exact typical-ness of a east meets west movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "caincrue",
        "review_rating": "5",
        "review_title": "Not that funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "smart_harsh",
        "review_rating": "5",
        "review_title": "Balls of fury.",
        "review_detailed_main": "Balls of fury is a story of a Randy Daytona, a ping pong prodigy who represents his country at 1988 Olympics, reaches the Semis and lose out to a German, his father any army personnel bets on his win, is killed by the bad guys when he is not able to pay the money. Now around 18-20 years later, this guy is contacted by a FBI agent who wants Randy to work for him and participate in top secret private ping pong tournament of the same guy who killed Randy's father. That's it; the story ends in first 20-30 minutes of the movie, for the rest of the movie, there nothing but pure crap. Randy Daytona is trained by a blind ping pong master, who has to be the master of the villain too. This blind fellow lives with a beautiful girl (Maggie Q) who becomes Randy's love interest. Movie is full of cheap and utter useless comedy scenes, after a point you don't even feel like laughing at those scenes. Also from the trailers it appeared that movie would have some great table tennis shots and games but they are just exaggerated and computer generated sequences. Even not even a single actor does a work worth mentioning.\n\nhttp://moviesopinion.blogspot.com/"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "ultramatt2000-1",
        "review_rating": "10",
        "review_title": "The perfect film to end the summer.",
        "review_detailed_main": "Seriously it was. My brother and I watched it, and the theater contained 6 people! The film was about a failed ping-pong champion gets summoned by an FBI agent (George Lopez), and with some training by Master Wong (James Hong who voiced Mandrin in SUPER ROBOT MONKEY TEAM HYPERFORCE GO!), to compete in a ping-pong competition lead by Christopher Walken as the evil Master Feng. This film is hilarious with a capital H! It makes fun of all those kung-fu films. We all need a good laugh, and what is the best way to end it with an original comedy. This film not only screams hilarity, but pure originality. In a world where Hollywood gives us nothing but drivel (i.e. with all the sequels, remakes, and film-adaptations of TV shows and cartoons), this movie sticks out as an original. A must watch. Rated PG-13 for comical violence, language, and sexual reference."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "pmtelefon",
        "review_rating": "5",
        "review_title": "It has its moments",
        "review_detailed_main": "\"Balls of Fury\" is an okay time killer. It does have its fair share of laughs but it also wears out its welcome after a while. The cast is funny and they're all game. James Hong has been in a thousand movies but he's never been better than he is in \"Balls of Fury\". He gets most of the laughs. Christopher Walken is funny too but you know you're in trouble when most of your laughs come from your costumes. Even the usually annoying George Lopez does a nice job. \"Balls of Fury\" ends up running out of steam after an hour or so. It ends up being a pretty good time killer that I probably won't be visiting again. At least not any time soon."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "djgold_1999",
        "review_rating": "3",
        "review_title": "Pretty Weak",
        "review_detailed_main": "I gave it a 3, due to me being generous. I \"knew\", if people were going to talk trash about The Comebacks and Meet The Spartans; that this movie would get above a 4.\n\nPlain and simple, maybe boring, overly rated movies, or people \"with 0 laughter in their blood\" rate good movies, badly.\n\nChristopher Walken are you that broke? Did the wife say, we don't have enough money in the bank and take any given role?\n\nThis movie was not very funny. I waited to go Ha Ha, but where was it? George Lopez, was too good of a actor/comedian to be in this horrible movie. I just watched it for Alicia Tyler and the other nice looking girl. Until those points, nothing caught my attention. Not a good movie, overall.\n\nThis is the \"truth\", not an opinion."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "simonparker1990",
        "review_rating": "3",
        "review_title": "The cheaper, nastier, less funny Dodgeball",
        "review_detailed_main": "Imagine Dodgeball, one of the funniest movies in the past five years, then imagine it done again, but with the sport changed, some different actors in it, and make it not as funny. Yes ladies and gentlemen that was Blades of Glory, now imagine some stupid film producer sitting there and taking Blades of Glory and repeating the process, that unfortunately is Balls of Fury. A movie that is not a tenth as funny as it thinks it is and so unoriginal it makes your eyeballs scream in agony as you watch it! Balls of Fury unfortunately was the first movie I saw of 2008, hopefully I just made a poor choice and this is not a reflection of the quality of movies I will see throughout the rest of the year! Anyway Balls of Fury is a limp fish of a comedy with a couple of funny set pieces and Christopher Walken on delicious over the top form. But the majority of the film is just very poor slapstick, the lead actor, Dan Fogler, acting like a prat, and he really is the most annoying actor I have seen in quite some time, and just some jokes that aim for funny but end up being more irritating than anything else. The jokes range from very average to pretty much hateful, I mean how many jokes can you make about a blind person walking into things? According to this movie a lot more than you could ever hope to imagine. My other big problem with this is the fact the first half hour isn't even remotely funny, at least the middle and final act seem to be trying, the first act just seems pitiful, in fact the first act rivals Epic Movie in terms of badness!\n\nSo let me get onto the performances. Firstly there is Dan Fogler, now I find Adam Sandler an annoying actor, but nothing could prepare me for how hateful I would find Fogler. The last movie I saw him in was Good Luck Chuck, which I forgot he was in though looking back on it I hated him that as well. Well in this movie he seems like a very poor man's Jack Black, with not a millionth of the charisma nor the comedic timing. The script doesn't help Fogler, but personally I think that only thing that could make him less annoying is perhaps a tranquilliser or perhaps a bullet! Maggie Q plays his love interest, yes unfortunately you read that right. Maggi Q has been decent enough in Mission Impossible 3 and Die Hard 4, but here she is so bland and lifeless. Plus you can almost see that she doesn't want to be in this movie, despite Fogler's annoyingness he at least looks like he's enjoying himself, Maggie Q just seems half asleep. And the pairs romance is never, ever believable! So its down to Christopher Walken as the chief villain, Feng to steal the movie, as he always does. Walken seems to be having a blast, and he delivers some killer lines. But I was more confused by him being in the movie than anything else, he's a great talent, so why is he wasting his time in this rubbish? Anyway he has the best lines and the movie at least makes you a bit more alert whenever he is on screen. A shame then that the final ping pong match involving him is pretty poorly done. George Lopez is pretty poor as the FBI agent along for the ride and to be honest Lopez even seems aware his character isn't funny.\n\nMy biggest problem with Balls of Fury is the fact it just isn't very funny. While the movie is honourable in the fact it keeps references to genitalia to a minimum, surprising given the tag line and title, the movie instead relies on heavy slapstick and poor fart jokes. Fogler is hit in some way at least one hundred times in this movie, not once is it funny, not even worthy of a slight smirk. The movie also relies too much on the blind master bumping into things, or perhaps in the most misjudged joke of the past year, him having a sex with a man thinking its a woman, a scene that aims for hilarity but seems closer to cruel. Thankfully the script is funnier when Walken arrives, or at least he makes things such as \"Hurry up, we're missing the antiques road show!\" a bit funnier than they would be when said by a lesser talent. The movies fight scenes are admittedly above average, but they only really arrive towards the end when the movie is already too stuck in the mud its stuck itself in to be rescued. The movie also has no originality, the strange sport idea has been obviously taken from Dodgeball, and the movie aims to be a funny Enter the Dragon when it so obviously is anything but funny.\n\nSo unfortunately Balls of Fury is a very poor comedy enlivened by one actor. In fact had Walken not signed on this would head for 1/10 territory and stand firmly alongside Epic Movie. Thankfully with him, and perhaps the mad German ping pong champion, the movie has a tiny bit of life in it. Still this isn't worth a recommendation, more a warning. And be very afraid everyone if Fogler ever hits it big, because I swear to god I am going to avoid every movie he is in for a long time after this performance!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Shraylo",
        "review_rating": "3",
        "review_title": "Waste of time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "rkersh",
        "review_rating": "5",
        "review_title": "Would have worked with Adam Sandler in the lead",
        "review_detailed_main": "I have yet to finish watching this DVD, but already I can see where the movie went wrong. Not to take anything away from Mr. Fogler whose credentials are impressive and talent obvious, but he is miscast in this movie. Sandler would have at least made the relationship part with Maggie Q a little more acceptable. She is hot and the fat comic getting the hot chick is so lame it reeks. It's also becoming stereotypical these daze. I think the mistake that takes everything else off course is the tone of approach to making this movie. It needed just a little more believability. Like any fiction the more believable the story the more successful the movie or book. This movie had too much silly, which seems to be the current generation's idea of comedy. Try subtlety. It would be a lot better. Silly, insults your audience and makes us feel dumbed down. We deserve better.It kinda wasted the talents of Christopher Walken, James Hong, Cary-Hiroyuki Tagawa among others. A good concept, but poor execution . . ."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jon.h.ochiai",
        "review_rating": "8",
        "review_title": "Hysterical \"Balls\"",
        "review_detailed_main": "Academy Award Winner Christopher Walken stars as the evil Feng in \"Balls of Fury\". That's about the closest in context to an Academy Award that \"Balls of Fury\" will ever get. This is an absurd role choice for Walken, who is painfully funny. Director and Writer Robert Ben Garant's \"Balls of Fury\" is low budget, cheesy, and just stupid funny. \"Balls of Fury\" is hysterical and laugh out loud funny. Garant along with co-writer and star Thomas Lennon demonstrate their own pairs when it comes to take no prisoners comedy. Granted a lot of their rapid fire jokes veer off target, but quite often they land without mercy. There is a classic line as ping pong Master Wong (James Hong) advises his charge Randy Daytona (Dan Fogler), \"It is better to die like a tiger, than to live like a pussy\u0085\" \"Balls of Fury\" has its moments of clever genius. Keep in mind, Garant and Lennon's art is shameless camp.\n\n\"Balls of Fury\" is a blatant parody of Bruce Lee's \"Enter the Dragon\". Instead of the villainous Han holding an exclusive martial arts tournament on his island off the coast of China inviting the world's best martial artists, we have the evil Feng (Walken) holding a ping pong tournament at his compound somewhere in Central America inviting the world's best ping pong players. This is a ping pong tournament to the death. We are vividly reminded of this from the \"Balls\" trailer. The ping pong tournament is apparently a cover for Feng's nefarious business activity. FBI Agent Ernie Rodriquez (comedian George Lopez) believes that if he can get a man to infiltrate Feng's Tournament, he could expose the operation. That man would be Randy Dayton (Dan Fogler).\n\nRandy Daytona was America's darling kid hopeful for Olympic ping pong Gold at the Seoul Games of 1988. During his semifinal match with whacked out German Champion Karl Wolfschtagg (over the top funny Thomas Lennon), Randy experiences a catastrophic collapse. He never recovers. Now 19 years later, Randy is performing ping pong dinner theatre in Reno. Randy reluctantly enrolls in Ernie's covert mission. Feng may have been the man responsible for Randy's father's death, so for Randy this is also a mission of vengeance. However, it is unclear for Randy himself or the audience. Randy clearly is no longer the Olympic competitor he once was; thus, he must train with revered ping pong master and Chinese restaurant owner Master Wong (hysterical Hong). Master Wong is blind\u0097part of his enlightened charm. Wong also risks his livelihood and reputation by taking on \"round eye\" as his student. Wong's hot niece Maggie (beautiful Maggie Q) helps instruct Randy in the Way of Ping Pong. Maggie is also a deadly martial artist as demonstrated in a hilarious beat down of wannabe gropers. Feng too, may have been responsible for Maggie's father's death.\n\nFeng was Master Wong's best student. Now this is Randy Daytona's time. Will Randy dig deep down, and discover that 'it is not the paddle, but the man'? Will he fall in love with Maggie? Will he reclaim his inherent greatness at Feng's Tournament? Well, part of the inexplicable charm of \"Ball of Fury\" is its predictability, and its off the wall gags. There is a side splitting joke about Feng's sex slaves that features the great Diedrich Bader. And Randy's match with the notorious Dragon is hilarious.\n\nThe bizarre casting completes \"Balls of Fury\"'s glorious camp. As mentioned before, Christopher Walken is hysterical. He carries off the Elton John Captain Fantastic couture like a champ. Walken plays the role totally straight. His aloof cool is deadly. This is the first time I have ever seen Dan Fogler. Fogler is short, fat, goofy, and not at all athletic\u0097the perfect antithesis of a Bruce Lee hero. This makes perfect sense. Fogler is naturally funny and self absorbed. He has impeccable timing and delivery. Maggie Q is deadly sexy as Maggie. She displays an effortless touch for broad comedy, and has star presence. She is great. James Hong is completely hilarious as blind Master Wong. He is so over the top funny with some of the movie's best lines. Terry Crews makes a masterful ridiculous turn as defending U.S. ping pong champion. Even Jason Scott Lee (\"Dragon: The Bruce Lee Story\") turns up in \"Balls\".\n\n\"Balls of Fury\" is not a cinematic tour de force by any means. But for what it is, a stupid funny movie, \"Balls\" delivers. \"Balls of Fury\" is laugh out loud funny, and fun to say."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "arisuper",
        "review_rating": "5",
        "review_title": "Somebody wants to be Jack Black",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "RobTheWatcher",
        "review_rating": "4",
        "review_title": "Balls of Fury",
        "review_detailed_main": "Balls of Fury was just one giant spoof of a movie. It basically ripped off the Kung Fu movies, Dodgeball, and Beerfest and combined it into one. It was intentionally bad to be funny which definitely made me laugh at times but also made me frustrated and disinterested at times. It was basically one long skit or episode turned into a movie and I would have preferred it to just be shorter. It wasn't good enough or entertaining enough to be it's own movie. IMDb needs to get rid of this damn character minimum though it's out of control and not fair or practical to the common movie reviewer and watcher."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "holyspiritdriven",
        "review_rating": "5",
        "review_title": "Stupid Comedy Doesn't Take it Self Seriously",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "winterknight-12640",
        "review_rating": "1",
        "review_title": "George Lowbrow",
        "review_detailed_main": "This movie had potential to be a guilty pleasure flick, sadly though it just wound up being a lowbrow, kung-fu disaster. George Lopez is to blame for the many faults of this flop. George Lopez is not a, \"comedian\" that I find funny, but I tried this movie because Dan Fogler is hilarious and I thought I could ignore the annoyances of Lopez, I was painfully wrong. There is little to say about this movie, only that all the funny parts are what you see in the trailer for the film, and they are few and far between. The plot is very uneven and the flow of the story feels as if it were pieced together very quickly to save time, without worrying about the proper way to produce character development. George Lopez was ridiculous in this movie and his character was obsolete in regards to the plot. Don't waste your time or money on this flop. Once again, this is not the fault of Dan Fogler, he was merely the victim of by story writing, however, most of the blame goes the Lopez for his inability to generate humor in a should be comedy."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "eoghan1045",
        "review_rating": "1",
        "review_title": "worst film of ALL TIME !!!!!!!!!!!!!!",
        "review_detailed_main": "please please do not watch this film , it doesn't deserve it !!!! its without doubt the worst , unfunniest film ever and Christopher walken should seriously reconsider his career after it !!! i didn't laugh once during the whole thing and saw every single \"joke\" a good 10 seconds before it happened !!! it tries to get us cheering for the underdog like in great films like major league , dodgeball etc but i ended up actually totally disliking the main character whose main claim to greatness seemed to be sticking his chewing gum under the flipping ping pong table !!!!!!!! please listen to me and give it a miss , in fact when its on terrestrial TV (in about 4 weeks i'd say) just go out for a picnic or something ... anything to get away from it !! im just mad that the lowest vote i could give it was 1 !"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "rhaggardpi",
        "review_rating": "10",
        "review_title": "Good story, funny, good acting, great music",
        "review_detailed_main": "From the trailer, you can tell going into this that it is going to be funny/silly. So those people that are complaining about it and saying it was a waste of their time, did you even SEE the trailer??? Besides it being a spoof of Bruce Lee movies, and then to have Jason Scott Lee, who played Bruce Lee in the Bruce Lee Story in it...hilarious!!! Loved it! And those sex slaves...funny. Loved the music! I guess you can tell I graduated in the 80's, huh? I really enjoyed this movie. And any comedy with Christopher Walken is worth seeing, in my opinion. George Lopez just ADDED to the laughs, as he always does. I would recommend this movie to anyone wanting a good laugh."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jace_the_film_guy",
        "review_rating": "1",
        "review_title": "Yes, It's That Bad",
        "review_detailed_main": "I don't say this lightly, but Balls of Fury might be the dumbest movie that I have ever seen. It's not the worst movie, that spot is reserved for Marmaduke, but it sure is close.\n\nThere are hardly any redeemable qualities to this film. The concept is ill-conceived, the characters are stereotypes and the plot is formulaic while also being just unfunny. To top it all off, the final \"duel\" is ridiculously dumb.\n\nWould this movie be better with Jack Black instead of Dan Fogler? Probably, but not by much.\n\nNote: How in the world are we supposed to believe Maggie Q in this movie?\n\nBest Character: Gary Best Quote: \"Ping Pong... is not the macarena.\" - Master Wong Best Scene: The Opening Match? I'm reaching but I can't think of any scene that I actually enjoyed.\n\nBest Piece of Score: \"History In a Paddle\""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "hu675",
        "review_rating": "8",
        "review_title": "Modestly funny silly comedy.",
        "review_detailed_main": "In the table tennis finals of 1988... in the Olympics. Twelve year old Randy Daytona (Brett DelBuono) is a expert Ping-Pong player. But on that day, his life changed when his coach/father (Robert Patrick)... he bet all of his money to the Chinese Gangster. But Randy never thought... he would be beaten by a German Democratic Republic by the name of Karl Wolfschtagg (Thomas Lennon). Randy never seen his father on that day, since his father was killed by the gangsters. Nearly two decades has passed, now Randy (Dan Folger) does his table tennis routine as a show for the Casino. Now an ambitious FBI Agent (George Lopez) asked Randy help to play in the underground ping-pong championship, especially when Randy could finally meet the man... who killed his father. Which this criminal mastermind is by the name of Feng (Oscar-Winner:Christopher Walken). But since Randy wasn't played for nearly 20 years. The FBI Agent sends Randy to be trained by a thoughtful but clumsy Chinese blind-man (James Hong) and his attractive niece (Maggie Q). Once Randy is ready to play the underground championship of Ping-Pong... Randy never realized Feng's underground rules are played to the death!\n\nDirected by Robert Ben Garant (Reno 911:Miami!) made an entertaining silly comedy is made watchable thanks to the strong Comedic cast. Hong has all the best moments in the film, Folger is likable throughout the film and Lopez has some funny Al Pacino impressions as well. The premise is incredibly silly to be sure but it is one of those movies that everyone seems to be having a good time.\n\nDVD has an fine anamorphic Widescreen (1.85:1) transfer and an good Dolby Digital 5.1 Surround Sound. DVD has two featurettes, deleted scenes and alternative ending. The director co-wrote the script along cast member:Lennon. \"Balls of Fury\" isn't the funniest comedy out there but it's all in good fun, despite some occasional moments of being mean-spirited. It is certainly funnier than \"Reno 911:Miami!\". (*** ½/*****)."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "g-bodyl",
        "review_rating": "9",
        "review_title": "Balls of Comedy!",
        "review_detailed_main": "This film is one of those films that I did not expect to enjoy. It has the recipe of a bad movie: a last week of summer release, a poor box office total, and some harsh reviews. Well, I decided to give this movie a chance. I was pleasantly surprised.\n\nThe movie starts off by showing a kid who is the world's champion of ping pong. He finally loses a match and his father is murdered. Nearly twenty years later, FBI Agent Rodriguez recruits him to rediscover ping pong to defeat his father's killers. But first, he must get some tutoring.\n\nThe acting is great. I liked Dan Fogler and Christopher Walken the best. George Lopez added some comedy. Maggie Q added sexiness and spice into the movie.\n\nOverall, this is a decent comedy that I liked. This is not as funny as American Pie, but it's funny enough. I rate this movie 9/10."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "ogrizkoo",
        "review_rating": "10",
        "review_title": "very fun comedy",
        "review_detailed_main": "I think this is one of the best comedies that I watched in my life. It was so so so funny really. I don't understand what people expect from this genre of movies - comedy. You want to think more for the film ? Yo think Balls of fury is stupid ? Yes, maybe you are right... but it doesn't matter. Stupid but funny! It made me laugh all the time! So many different situations, all the time it was interesting... not boring for a moment. If you want to laugh and not to think so much... this is your movie! If you want to think or I do not know what.... then this movie is not for you but I am not even sure if it is good idea for you to watch comedies. You must watch some criminal, drama, thriller... I don't know, you can choose. The other good point of this movie is that the humour is not rude like \"What's up mother f*cker\" or something like this. I hate such a language. The movie is also not so moral degradation to watch nude girls all the time etc. If you want to watch other super fun movie, I think this is \"Rat race\" ....these two films were equal funny for me, that's why I gave them 10 :) Other good comedy is \"Hot Rod\" but it is maybe for people with a little bit strange sense of humour :) I think that all people who rated this one with 1 are just stupid spoilers !!!! And they are the reason to write... p.p. Sorry for the language, I am not the best in English :)"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "JrSr14",
        "review_rating": "10",
        "review_title": "The Greatest Sports Movie Of All Time!",
        "review_detailed_main": "This movie showed up on the MoviePlex this morning. What a great start to my Saturday! I hadn't seen this movie in over 10 years and was happy to see it still holds up. Laugh's galore. Of course it doesn't deserve a 10 rating, but its a lot better than the 5.3 it gets on IMDB, so I rated it a 10 to up the average. Should be a solid 7 at least!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "thewalkingdad",
        "review_rating": "9",
        "review_title": "UNDERRATED",
        "review_detailed_main": "This movie has some hilarious and unique moments. Dan Fogler is simply awesome in this... so is Christopher Walken. George Lopez is irritating, but that's to be expected. The movie is funny and seriously underrated."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "larrygull",
        "review_rating": "10",
        "review_title": "Has some great parts, definitely doesn't deserve the super low grades.",
        "review_detailed_main": "I gave it a better score to offset the ridiculous people that gave it super low scores."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "moviesfilmsreviewsinc",
        "review_rating": "8",
        "review_title": "A classic comedy",
        "review_detailed_main": "Ping-Pong is a beloved sport, similar to tennis and soccer. Despite controversy over slower balls and faster paddles, it remains a favorite among many. The author recalls attending \"Balls of Fury,\" the first movie combining Ping-Pong and kung-fu, co-starring Maggie Q. The number of movies featuring the sport remains uncertain. Dan Fogler portrays Randy Daytona, a former Ping-Pong player in his 20s, working as a lounge act in Vegas. The performance resembles an annual banquet of the Chicago Newspaper Reporters Association, where a man with 12 paddles with bouncing balls attached to a rubber band played a game of bouncing balls, one by one, in his mouth. Daytona, a pudgy and curly Howard hairstyled girl, is discovered in Vegas by FBI agent Ernie Rodriguez. He wants her to train for an illegal global Ping-Pong and martial-arts tournament run by criminal weapons dealer Mr. Feng. Christopher Walken plays the role, using makeup and clothes that resemble Chinese wallpaper. While some Asians may be offended by Caucasian actors portraying them, Walken's portrayal of Daytona is unlikely to be a source of offense. Daytona, blind and playing Ping-Pong, learns martial-arts moves from Blind Master Wong and his niece Maggie Q. She thrives under their lessons and prepares for Mr. Feng's bizarre tournament. The author focuses on the absurdity of the movie, including the presence of Daytona's old Ping-Pong archenemy Karl Wolfschtagg, who will become a star if the World Wrestling Federation sanctions the sport. The press releases often claim that Fogler and other actors became experts in the game, but this is a falsehood. The movie features Ping-Pong games with balls moving faster than a quark, and Fermilab should include \"Balls of Fury\" in its training program. Greg Packnett of Madison, Wis., enjoyed my \"extremely qualified recommendation\" for \"Rush Hour 3,\" describing his camping experience at the Wisconsin Dells. He enjoyed the movie's modest goodness, which is at least not badness, and he felt that if he watched \"Balls of Fury,\" there was no better thing to do. Packnett's recommendation highlights the importance of enjoying a good movie and not focusing on the bad aspects. In his thirties, Randy performs at a Reno casino, where he is introduced by a cockatiel. An FBI agent (George Lopez) asks him to infiltrate a ping-pong tournament hosted by Mr. Feng (Christopher Walken). The story follows an elderly ping-pong guru (James Hong) and an improbably hot love interest (Maggie Q). The Asian characters are funny and eat food with chop sticks. The joke about male sex slaves quickly turns into mincing caricature. The coincidence that \"balls\" is also a word for \"testicles\" adds humor, but the punches to Randy's balls diminish the comic effect."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "aroundever",
        "review_rating": "10",
        "review_title": "Funnier than an Englishman trying to make wine!",
        "review_detailed_main": "This film is very funny. Don't watch it if you thought Dirty Dancing was great. You obviously have no sense of humour or reality! It's funny, funny, funny! Even if I could watch George Bush being run over by a Hummer, I'd still choose to watch this!!!!\n\nChristopher Walken is particularly good.\n\nWe loved the joke about Elton John.\n\nThe lead guy is brilliant. Just fat, sweaty, and lame enough for the film.\n\nWe watch a lot of films and we really enjoyed this one.\n\nThanks to the actors, producers and director for making this one, it's a laugh a minute."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "MaxwellSays",
        "review_rating": "9",
        "review_title": "Funny, but not gut-busting",
        "review_detailed_main": "Balls of Fury is a fun movie filled with the kind of stereotypes that are sure to offend the thin-skinned while amusing others who can appreciate unsophisticated comedy without sifting it through a PC filter or expecting Oscar winning performances. For what its worth the actors were well chosen and did a good job with the material they had to work with. Two actors stand out in particular: Brett Del Buono, who played the young Randy Daytona was very engaging and with little dialog and short screen time managed to use body language and facial expressions to define what turned out to be the fairly complex older Randy as played very well by Dan Fogler. As usual, Christopher Walken was marvelous, playing the mostly malicious yet charmingly capricious arch-villain Feng as only Christopher Walken can do. Having never seen George Lopez perform before, I don't know how funny he is as a comedian but I enjoyed his performance as a funny straight man in this movie. In fact, regardless of what others might say about the movie itself, all of the actors and actresses (is that PC?) were excellent in their parts. Aisha Tyler, as always, was luscious to look at as Mahogany, Feng's matter of fact ominous eye candy, and Maggie Q as Maggie Wong, the love interest, was \"Sexcellent,\" whether she was kissing, carping or kung fu fighting. I give this movie a \"9\" and predict that unless it succumbs to the numbing effects of some follow-the-pack early reviewers, it will grow on audiences as more and more viewers learn to relax and enjoy it without preconceptions and knee-jerk analytics. It's just a movie. It's not uplifting, enlightening or in the best of taste. It's kind of silly, and like any good spoof it's predictable in format but not in detail, with some scenes over the top and others underplayed. All in all, its just entertainment and I enjoyed it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "jljacobi",
        "review_rating": "8",
        "review_title": "5.3.... Are you kidding me? Better than that if you get the references.",
        "review_detailed_main": "Humor is subjective, but to me this movie is both fun and funny. Not to mention a great tribute/parody on the karate flicks, primarily Enter the Dragon, that it mimics. I often use it to lighten a bad mood.\n\nI think part of the reason it's rated so low is that a lot of viewers may not be familiar with the old-school martial arts films and not get the premise, and/or the references. If you don't, I can imagine a lot of the humor whizzing right past you.\n\nLet's put it another way. If you don't think the idea of a ping-pong underworld and ping-pong death matches is funny, you may not like the movie. If you do, watch. I think Dan Fogler is brilliant, as are nearly all the bit players.\n\nIt's over the top, but in a friendly sort of fashion. Don't dismiss it because of the low rating."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "howies001",
        "review_rating": "8",
        "review_title": "Legacy Fun",
        "review_detailed_main": "If you enjoyed \"The Kentucky Fried Movie\", \"Top Secret!\", \"Under the Rainbow\", or \"Hot Shots\", you'll dig this flick. An unashamed campy piece that doesn't pretend to be anything else. The cast is perfect for the film's aim: Slapstick parody. If you're expecting something different, then you've probably wasted your ducats and your time. Enjoy it for what it is, rather than expecting cinematic sophistication. Feng is the new Doctor Klahn, Portrayed by Walken I suppose to avoid PC backlash against racial stereotyping (something The Kentucky Fried Movie dodged by casting a Korean as a Chinese criminal mastermind, not that it was such a big deal back in the late '70s)."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "oggiek5",
        "review_rating": "9",
        "review_title": "Fbi Triads and ping pong what more could u want",
        "review_detailed_main": "anyone who says they don't like this film doesn't have a sense of humour, this film is fantastic and nice to see someone new in the lead role, Dan fogler is a great comedy actor and I'm sure we will be seeing a lot more of him in the future. James hong is brilliant in this film as well as the super hot Maggie q. so if u don't take films to seriously and u want a good laugh at a great film buy this but if u are one of those people who is very sad and lives just to criticise the slightest plot hole or watches for the slightest mistake {which there seem to be a lot of on here)don't bother. FBI TRIADS AND PING PONG BRILLIANT !!!!!!!"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "djkevin-77",
        "review_rating": "8",
        "review_title": "Funny!",
        "review_detailed_main": "This movie is smart and funny....it's difficult to do both. Walken steals every scene he is in....the story line moves along at a great pace, and it's just plain \"laugh out loud\" funny. If you don't find it funny, go watch Dumb and Dumber....maybe that's more your speed. Dan Fogler was the perfect choice for Randy Daytona (makes one say \"Jack Black who?\") James Hong plays Daytona's blind ping pong master Wong and has some great lines...because of his blindness, he's constantly left in the dark (ba dumb bum) and remarks \"what's going on? What's going on?\" It's absurd, but it's hilarious. One of my favorite moments involves Walken (of course) giving Daytona his email address so they can stay in contact later...\"Well, poop. Randy, I was serious about my offer, okay? And e-mail me when you make up your mind. I'm Pradafan1@gmail.com. 'Pradafan' is all one word.\""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Lior34",
        "review_rating": "8",
        "review_title": "Nonsensical and utterly ridiculous comedy",
        "review_detailed_main": "The film is about what one would expect from combining The Karate Kid (2010), the Chinese mafia and ping pong. The film itself is quite a simple one. It is not a timeless masterpiece or has some profound way to look at life, but rather is a goofy, mindless comedy. The characters are caricatures of the usuals which you'll find in a marital art film. The jokes were funny, the actors were good and the overall movie was entertaining.\n\nThere is not much to say about this movie because there isn't a lot to it. It's a simple comedy which delivers the cheap laughs it was made to deliver. Overall, I was very pleased by watching it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "LangtreeFilmClub",
        "review_rating": "8",
        "review_title": "This Film Is OK",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "junkdrawer1967",
        "review_rating": "8",
        "review_title": "Ping pong... Or as the Chinese like to call it: Ping pong.",
        "review_detailed_main": "Caddyshack spoofed golf and Balls of Fury spoofs ping pong. It does it in the same witty, deadpan, slapstick style with which Caddyshack spoofed golf. It was hilarious. When this movie first appeared in theatres, all the critics gave it such a bad review that I never went to see it and hesitated to rent it. Now, that I have finally seen it six years later (!!), I can only surmise that all those critics had clearly lost their way AND their sense of humor. The plot is silly, but no-one goes to see a movie called Balls of Fury with the expectation that it's going to be an Oscar nominated film. The movie has plenty of zingers and great one-liners that had me laughing out loud. Even the visuals were fantastically funny. Honestly, this was slapstick at its best. If you enjoyed a movie like Caddyshack back in the day, you will most certainly enjoy this."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "almighty4",
        "review_rating": "10",
        "review_title": "Surprisingly funny!",
        "review_detailed_main": "I expected little from this comedy. Bought solely on the merits of Christopher Walken and my schoolboy crush on Maggie Q. What I got was a consistently laugh-out-loud comedy starring a guy I never heard of (Fogler). James Hong as Master Wong steals every scene he is in and has never been funnier. (His \"prostitute speech\" made me howl). Which is saying something. The cameos are all spot-on and hilarious. Terry Crews never fails to entertain, Maggie Q has never been hotter and surprise-surprise, she can do comedy. same thing applies for Jason Scott Lee, he was equally good in his part. Chris Walken is having a blast as the villain Feng. You can always tell when Walken is merely collecting a paycheck. That is not the case here. Dan Fogler in the lead was a pleasant surprise. He had several stand-alone moments were he shined and was certainly better suited for this part than, say, a manic Jack Black or a twitchy Ben Stiller.\n\nIn short: Consistently VERY funny movie, with a top notch cast kicking ass..\n\nI don't usually gush about a movie like this, but this one really caught me off guard. Best comedy I've seen in a couple of years..\n\nPs. Give James Hong an Oscar already. He's awesome."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "mm-elek",
        "review_rating": "8",
        "review_title": "So Bad That It's Good",
        "review_detailed_main": "I recall that when this was released it was panned heavily by reviewers.\n\nAfter watching it recently, I think you have to look at the brilliance of it. It's a hilariously funny movie with over-acting, subtle humor and silly scenes.\n\nBuried in all of this is a plot that is covered enough in IMDb.\n\nThe reason that it works is that everyone plays their role straight, as if they are performing in a serious Meryl Streep drama.\n\nI think Christopher Walken is a brilliant actor, and his ability to deliver lines in a drama or comedy is unmatched.\n\nThere is a lot of Enter the Dragon\" in this movie, and if you take it for what it is, you'll find yourself smiling and chuckling through most of it."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "vlatkojurasek",
        "review_rating": "8",
        "review_title": "Nice one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Impman2",
        "review_rating": "10",
        "review_title": "Had me laughing",
        "review_detailed_main": "Good fun, made me laugh (often), well worth a watch"
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "sheepshearer",
        "review_rating": "8",
        "review_title": "I thought it was funny.",
        "review_detailed_main": "Classic dumb comedy. I laughed all the way through."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "wilkinsonncl",
        "review_rating": "8",
        "review_title": "Entertaining no brainer movie",
        "review_detailed_main": "Fun movie to watch. Its a simple comedy with a simple but funny story line. Enjoy it for what it is."
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "LilMissMousie",
        "review_rating": "",
        "review_title": "Well, I'm glad I didn't pay to see it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "tieman64",
        "review_rating": "",
        "review_title": "Weak Sauce",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0424823",
        "movie_name": "Balls of Fury",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "A really lousy film",
        "review_detailed_main": ""
    }
]