[
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "anagpal",
        "review_rating": "3",
        "review_title": "A great unintentional comedy",
        "review_detailed_main": "I found the following things funny about the film\n\n\u0095Sunny Leone's constantly heaving bosom through the entire film. Its just the speed which varies and at its peak (pun intended), it clocks in a shade faster time than the Titanic. \u0095The afore-mentioned bosom manages to convey more emotion than Arunoday in the entire film \u0095One song begins with such sustained yowling that even Sunny Leone develops a painful look that is reasonably convincing. \u0095When the intelligence agency chief, Arif Zakaria, better known as The Wig Who Walks, meets Sunny for the first time, he requests her to 'come' twice within the first couple of minutes \u0095The story credit for Mahesh Bhatt. Should've been a debit. \u0095The reliance on old school acting. Bite lips, heave bosom, yell, smash things, look constipated to demonstrate pain, anguish. \u0095In a major score for consistency, the same constipated feeling was conveyed through the selection of the lead vocalists as well. \u0095The predictability of the end which was only overshadowed by its sheer dumbness\n\nThis is a great unintentional comedy to watch in a group, a kind of a soft porn film, masquerading as a full feature. If you can ignore the lack of a story, acting skills, plausible characters and tuneful music, you may even have fun viewing this.\n\nShe is hired by an intelligence officer, Arunoday, (who sleeps with her first, kind of like a 'test the goods' sort of thing), for a dangerous mission. To get close to her ex-lover, Randeep Hooda, a renegade officer and currently freelance assassin, and to get some data from him. From the first frame onwards, nothing any of the characters does makes any sense. The only things worth admiring are Sunny's constantly revealed assets, the locations and the tasteful interiors of the various homes chosen.\n\nSunny, obviously not hired for her acting chops, prefers to ignore dictums like 'vastra aurat ka gehna hote hain' and appears to be in greater load shedding mode than the much maligned Northern power grid. Arunoday is in sleepwalk mode throughout and Randeep is wasted in his vacuous shayari spouting role. The tortuously slow pace of the film doesn't help either\n\nAs I look at the original film poster again, its clear that some things are better off under wraps. The film is 132 minutes long. With a little skillful editing, could've shaved off about a 100 odd minutes"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "dineshprakash",
        "review_rating": "3",
        "review_title": "If you want to laugh at emotional scenes then it is a must watch",
        "review_detailed_main": "Watched \"JISM 2\". If you want to laugh at emotional scenes then it is a must watch. I didn't get the creative motto behind making of this picture. If they wanted to expose Sunny Leone, then they should have remembered that she is already over exposed. Censor has chopped the steamy scenes at the level that it could have been gotten U/A certification but the taboo of Sunny Leone made it A. There is only a good thing that is the poster design, especially the girl in semi transparent cover, which is not in film. This poster easily created the curiosity among audience. Due to this poster and the brand value of it's part 1, exhibitors are going to book losses because audience will bombard with negative mouth publicity. Direction is poor. Story is also not up to mark. Few dialogues are good at places but remember only a few. when Sunny Leone fell in love at first sight is good. Rest dialogues are reflecting the dialogues writers personal things without thinking about the character. Dialogue writer Shagufta Rafique, has used heavy Urdu word like Myar, Darakht, Tasauuar, Awam but there is no any typical Muslim character. Music is good and soothing at least. Performance wise Randip Hooda is good in anger but funny in emotional scenes. Surprisingly Sunny Leone did well in an intense emotional scene."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "bobbysing",
        "review_rating": "2",
        "review_title": "A childish attempt to fool the viewers by only showing the body beautiful without any soul or content.",
        "review_detailed_main": "If there is one person in Hindi Film Industry who has skillfully learned the art of how to exploit each new opportunity coming his way for the benefit of his own banner then it has to be none other than Mahesh Bhatt. The man sights a great potential money spinner the moment he sees the famous porn star Sunny Leone featuring in the TV reality show Big Boss, makes arrangements to enter the house personally to offer her a film and superbly starts the publicity campaign of something which was not even there on papers right from inside the big boss house.\n\nNot only that, but in the next few months, he professionally works on the project within a fixed budget, writes the film himself (inspired from Hitchcock's Notorious), gives the direction to her daughter Pooja Bhatt and releases the film with some controversial posters (reportedly inspired/copied from Goa based designer Felix Bandesh's 2008 fashion photo-shoot) on a festival day in India to ensure a great initial.\n\nBut on the other hand, as I watched the film, it surprised me a lot with its childish content which had nothing to say at all besides its expected body show from a western porn star. Said to be a Crime-Sex- Thriller, the film has neither got any thrills nor any excitement in its immature storyline only interested in showing you Sunny's bare backs, her steamy kisses and the abrupt sex scenes retained after the cuts ordered by the Censors. So, it was really shocking for me to realize that the film was written by Mahesh Bhatt himself, who had a lot of power in his vision, repeatedly proved by his own masterpieces in the past.\n\nIn strong words with JISM 2 both its writer and the director try to make fool of we, the audience as if we are only there to see Sunny Leone without her clothes, locking lips every five minutes. In this context I would like to remind both Pooja Bhatt and Mahesh Bhatt that please don't treat the audience as dumb minded people who would just applaud anything served by you in the name of SEX. Because what you are selling to them for a price in the name of Sunny Leone, a lot more than that is easily available free of cost on a simple click all over the net. So please don't take us as granted every time you make a movie, which in reality is a mere commercial project rather than being a creative expression of a visionary. And as far as direction is concerned Pooja Bhatt should stick to producing films and avoid directing them for the sake of her own banner.\n\nComing to the performances, only Randeep Hooda seems to be acting in the film to some extent and the rest are all doing their offered jobs as professionals. I have liked Arunoday Singh in all his previous ventures but in this he has really acted in a very awkward style and remains completely unconvincing. Arif Zakaria once again gives a seen before performance which fails to impress and Sunny Leone expectedly relies a lot more on her body than her acting skills which was pretty obvious. But still she manages well in her debut venture with her limited facial expressions and stunning beauty. The girl has got the fire to burn the screen but doesn't get anything to work on from her writer-mentor Mahesh Bhatt. And I seriously doubt that with such an image she would ever get an author backed role in our films.\n\nHonestly speaking, throughout JISM 2 I remained puzzled thinking that can Mahesh Bhatt really write this kind of crap storyline and screenplay? The progression of the film is so lazy and uninteresting that it seriously doesn't seem to be a Bhatt's camp movie from any angle other than its sexual scenes. The absurd writing reaches heights when you suddenly hear a vague mention of Cancer towards its end and also the playing of an old Hindi classic song \"Woh Subah Kabhi To Aayegi\" without any basic purpose. Unarguably Sunny Leone is sure going to learn a lot of essential lessons from her first film itself about how things actually work in our Hindi Film Industry, where the on screen project comes out to be entirely different from what was being projected in those initial interactive sessions.\n\nAs publicized in its promos the Cinematography gracefully adds to the soft-porn feel of the movie along with its OK background score. But another surprise of JISM 2 remains its less inspiring soundtrack despite the presence of Mr. Bhatt, the man with a fine musical ear. Though few songs sound fine as individual tracks but while watching them on the screen in their boring placements, they fail to keep you hooked.\n\nContinuing with Mr. Bhatt's passion for Pakistani music, Rashk, one of the four music directors in the film, simply ruins a fabulous track originally sung by the legendary Noor Jehan and Reshmawith the words, \"Na Dil Dendi Bedardi Nu\".\n\nOverall, JISM 2 is surely one of the weakest movies from the Bhatt camp and maybe the most silly one too. I recently read that after working in it, Sunny Leone was thinking of leaving the porn industry to pursue a dedicated career in Indian films. But after watching it, I would just like to say to her that, please do watch JISM 2 yourself as a movie, before taking your final decision. Because here you are nothing more than a bold girl who has a rare beauty ready to be canned naked without any hassles and who can easily bring in great initials even for a trash film. Hence, I sincerely doubt anyone would be ever able to see beyond that for Sunny Leone in the present scenario of our films."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "A pretentious erotic thriller which neither thrills nor is it sensuous ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "saadgkhan",
        "review_rating": "3",
        "review_title": "Sunny Leone, the only reason to sit through this atrocious movie",
        "review_detailed_main": "Jism 2 – CATCH IT \"As I know you'll do in any case\" (C) FBI, a Porn Star and a Terrorist, Jism 2 relies on only on these characteristics rather than any story or screenplay. The only thing good about Jism 2 along with its music and stunning locations is Sunny Leone. In the mist of bad story, bad direction and bad performances Sunny Leone still makes you notice her and I think that's her achievement. She has strong screen presence and looks stunning walking around in lingerie. Randeep Hooda is alright but trapped in bad characterization and poor direction. Arunoday Singh as good until he has to speak, scream or show some emotional range. He is especially terrible in emotional scenes. In the end, even though it's a tedious bad movie, you will watch this one for Sunny Leone though let's be clear there is nothing is nothing new in the movie as all was shown in the promos already. Bummer!!!!"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "dev_alok",
        "review_rating": "4",
        "review_title": "A poorly made erotic thriller",
        "review_detailed_main": "Watched this movie on DVD yesterday. This movie was dubbed as erotic thriller. The debut movie of Sunny Leone who is of Indian origin and has acted as a porn star in some Hollywood movies that I haven't seen. Indian movies have lately become lot more racy but this movie fell short. This was neither erotic nor thriller. Sunny Leone the star attraction of the movie doesn't know how to act but that was not expected of her either. She looked older than she claims to be. Her still pictures look good but she wasn't erotic in the this movie. Randeep Hooda I thought did fine in whatever he was allowed by directors to do. He was also impressive in Sahib bibi aur gulam. He doesn't have a chocolate face but I think he will do well. Bhatt's direction was poor. Bhatt's films are usually copies of a foreign film but I couldn't figure out which film they copied here. May be they tried to make an original and hence the poor final product. Music is usually good in Bhatt's movie and it was decent for this movie too. I don't remember all the songs now but they sounded good while I watched the movie. I have given it 4 out of 10 stars and I think am being generous!"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "yunusitboss",
        "review_rating": "4",
        "review_title": "Jism 2 (A)------------Rating: 2/5 AVOID",
        "review_detailed_main": "Jism 2 (A)------------Rating: 2/5 AVOID\n\n*It is an erotic flick which is not a thriller..... *Music was awesome and direction is good and story contains a beautiful dialogues... *Sunny leone is not suitable in Bollywood where as she is best in Porn industry but in this movie her figure/sexy scenes were beautiful...\n\n-Story is not good feels boring but the screenplay is fast.... -Love making scenes are very less and decent with more kisses....\n\nOn the whole watch this movie for sunny leone....\n\nJism 2' is the sequel to the 2003 movie 'Jism' starring Bipasha Basu and John Abraham.\n\nA porn star (Sunny Leone) is hired by a dashing intelligence officer (Arunoday Singh) to become a 'Honey-trap' for a dreaded assassin (Randeep Hooda). In doing so, she not only has to confront her bitter- sweet past, but is also forced to make an impossible choice - one that will put her own life in double jeopardy"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "gbasandani",
        "review_rating": "3",
        "review_title": "Audience taken for ride for Erotic thriller with Pitiable script, Pathetic direction, Lackluster dialogs",
        "review_detailed_main": "Jism already a hot brand was waiting for by another hottie Sunny Leone to create a perfect combination to seduce audience to come to the theater. Arunoday Singh and Randeep Hooda talented duo were to fill the missing ingredient, had the script been written with sincerity to suit roles, characters and theme. Heavy Urdu moralistic dialogs looks out of place and funny from Sunny. She can say the same what Pamela Anderson quoted once \"I am not an actress, I don't think I am an actress. I think I have created a brand and a business.\" A femme fatal Izna (Sunny Leone), is hired by a young chap an intelligence officer, to expose a hardcore criminal who has been involved in assassination of many govt. high ranking officers, ministers and even bombing of innocent people. In the past she had been the inamorata of this criminal and deserted by him. The agency asks her to use her amorous to take out in-depth information of the terrorist organization kept on his computer. Unfortunately everybody have his own justification of doing the things, right or wrong, irrespective of which side of law they are. In the end personal interest get bigger than the principles, and the ethical code one is working for. Life is a game of cards in which heart is never an asset. Heart always takes over the logics of mind. Exquisite locations and scenes are definitely eye soothing with Sunny's assets exposure and romantic scenes. Nice classic songs but you are not watching a classic or an offbeat film and are completely misfit for this kind of a theme. The songs with beat and fast pace are more appropriate for such films.\n\nIt is really unfortunate that producer director and story writer of Mahesh Bhatt's caliber, (ultimately it is his blessing, guidance and banner is at stake), can be so myopic and takes audience for ride. Am sure they should have done better homework to en-cash the brands (Sunny n Jism) they were holding and for their future projects. The movie is B (minus) grade."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "ppuja-20882",
        "review_rating": "5",
        "review_title": "One time watchable",
        "review_detailed_main": "The good part of the movie is randeep hooda's acting... And it's music"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "dalquenliam",
        "review_rating": "1",
        "review_title": "Stupid movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "philsone",
        "review_rating": "1",
        "review_title": "Really??",
        "review_detailed_main": "First off, when are people going to realize that the Bollywood phenomena is just another long slimy slide into porn disguised as dance entertainment and suggestive comedy. India is producing more porn at a faster rate than any other country in the world. Soft eroticism is just a code word for soft core porn. Even the title of this movie comes from the slang for male ejaculate used in the 60's and 70's. I think we have enough porn in the world. What we need is some good solid, well scripted movies instead of all these really bad remakes of old movies and the introduction of another group of people into the porn industry. To each their own but aren't the women in India oppressed enough as it is without the rest of us condoning it by viewing this crap?"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "RatanTata",
        "review_rating": "8",
        "review_title": "Why I gave it a 8",
        "review_detailed_main": "I know many people might not agree with me, you have already been brain washed by paid reviewers like Times of India. Unlike what they say, it is not a bad movie, in certain aspects it is brilliant.\n\nA few points is a must before you enjoy this film.\n\n1. You should have fallen in love, and lost it. You should have to understand pain to know this movie.\n\n2. Great censor board of India has done its shitty job as not to allow the real scenes to be shown and spoil the brilliance of love making. To be real a man and woman have to go nude, if you want family drama go watch Disney movie.\n\n3. Most of the reviewers in the press are paid, they are bull shitting.\n\n4. Creative people are a bit mad and dint really go by what market enjoys. Bhatts are like that, i respect them for that.\n\nNow let me tell you what aspects are brilliant.\n\n1. Location: Just wow! Shot in Sri Lanka, the resort in heavenly. Each corner is designed so beautifully. The film manages to capture this beauty. Colours, shot angles, brilliant cinematography\n\n2. Randeep is brilliant in his role. His voice is perfect and stood out. I am a big fan from today.\n\n3. Sunny is brilliant. It is presumed porn stars cant act. Give her a break, for a first film that too in a foreign country like India, she has done a great job. I truly respect her for that. And to be honest she has better looks then most actresses of today, her beautiful eyes, rich mane, flawless skin, and a aura of maybe painful history she has behind her. No matter what anyone says including her, no one is willingly happy in porn industry. Lets hope she makes it put of it and turns to roles that suit her brilliant looks.\n\n4. Dialogues specially Randeep's were brilliant at places, they had depth. A sad but powerful rendering of what the hero had to say.\n\n5. Emotions: You really need to go through life to understand a Bhatt movie, if you have they are a treat. No one in Hindi movie industry does portrayal of emotions as brilliantly as Bhatts do. I wonder how wealthy in emotions they must be to find it and show it on screen. True love is such a complex emotion that it is impossible to define it for anyone, but Bhatts have tried their best and most part succeeded.\n\nWatch it with a open heart.... You will be in for a treat. For rest go watch Govinda movies."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "choleraparth91",
        "review_rating": "6",
        "review_title": "I liked the movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "sumitsingh_1234",
        "review_rating": "3",
        "review_title": "Jism-2",
        "review_detailed_main": "Lust, sex are its overriding ingredients, but Jism-2, for good measure, opens with a Biblical reference – \"the life of man upon earth is warfare\" – so that the audience does not miss the moral context of the drama.\n\nBut when it is Sunny side up with a voluptuous and well-endowed Leone using her body at the drop of a black bustier to get her point across in this steamy and slow-burning drama, it is actually a perfectly agreeable battle to wage.\n\nPooja Bhatt's Jism 2, scripted by Mahesh Bhatt, isn't quite the full- bodied sex flick that Leone's presence in the cast might raise visions of: the liberal dollops of skin show, as is the norm in a Bhatt camp offering, are given a veneer of sustained sophistication.\n\nSunny Leone is cast as porn star Izna who, after a night on a hotel bed that establishes the lady's enormous power over men, is hired by an intelligence agent, Ayaan Thakur (Arunoday Singh), and taken to picturesque Galle in Sri Lanka to infiltrate the secluded hideaway of a dreaded lawman-turned-assassin Kabir Wilson (Randeep Hooda).\n\nInitially averse to taking up the risky job because the killer happens to be her ex-flame, Izna sees the offer as an opportunity to make the man pay for his sins, which includes vanishing from her life without warning after a short-lived but euphoric love affair.\n\nWhat Jism 2 lacks by way of pace and thrills is amply made up for by the strikingly composed and lit frames, the generally taut editing, a first- rate performance from Hooda and, of course, the rampaging sex appeal of Sunny Leone, who struts around in lacy lingerie, flashing her ample assets and dishing out generous doses of the 'just do it' spirit.\n\nHowever, because of the manner in which the sex scenes have been filmed, they are neither cringe-inducing nor overtly exploitative.\n\nThe film is a male voyeur's delight all right, but director Pooja Bhatt often erases the gender lines by presenting both the lead actors, too, in bare-bodied splendor.\n\nOn the flip side, Jism 2 fails to create the atmosphere of menace and foreboding that a dangerous cat-and-mouse game with a heartless annihilator should necessarily have generated. Even the sexual chemistry between the seductress and the two men seems somewhat labored at times.\n\nWhat saves the film from falling into a bottomless pit is a certain degree of serious-mindedness that is embedded in the screenplay.\n\nJism 2 goes beyond the confines of carnality to refer to bigger issues, political and polemical.\n\nThe darkest place in this universe is the heart of the delusional assassin who suffers mood disorders, has a book about Che Guevara on his armchair, quotes Jesus Christ (\"Father, forgive them for they know not what they do\") and wants to save the world from itself. But it is Kabir himself who needs deliverance from the gloom that envelopes his life.\n\nThe screenplay also touches upon the issues of terrorism, fear-mongering by arms manufacturers to boost their relevance in a violent world, and the corruption of those that wield the power to influence the destiny of millions.\n\nDialogue writer Shagufta Rafique, despite the occasional lapses into the clichéd (\"Aur Bi Ham Hi Samoan mien\u0085\") and the corny (\"Terrorist KO Marna pun ya Hi\"), lends a certain zing to the brew. She ensures that the appeal of Jism 2 isn't just skin deep.\n\nIn an early scene, the female protagonist describes her burning desire as the scorching sands on the seashore and her lover's touch as the ocean that evaporates into thin air as it meets her. How often do you hear a line like that in an erotic thriller coming out of Bollywood?\n\nFrequent allusions to nature underlines conversations in this garden fraught with temptations. The rogue cop, completely smitten by the temptress, sums up his feelings for the woman who's been sent to trap him by comparing her to a solitary tree in a desert. And, of course, he reminds her and the audience that her name – Izna – means radiance, the light that dispels the darkness that he represents.\n\nJism 2 is a dark film, but the production design (by Pooja Bhatt herself) and the luminous lighting do not belong to the 'doomed love' genre.\n\nThe film has several other bright spots: Nigam Bomzan's outstanding camera-work, the songs composed by débutant Arko Provo Mukherjee and the restrained yet supercharged star turn by the ever-reliable Hooda.\n\nThis film is designed to be Sunny Leone's ticket to a place in the Bollywood sun, but it isn't quite love-all in her favor. Yet, Jism 2 has enough soul not be swamped by a curvaceous body. It is more than just another 'booby' trap of a film."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "silvan-desouza",
        "review_rating": "",
        "review_title": "Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "v-tushki",
        "review_rating": "4",
        "review_title": "Very ordinary stuff !!!",
        "review_detailed_main": "Well, this movie has nothing new to offer except the good music. The much awaited entry of Sunny Leoone is the only excitement amongst the crowd but unfortunately this movie fails in all respects. The storyline is like 100 years old and acting wise also movie terribly lacks. You'll feel like sleeping just after the movies passes its half an hour. This movie will be able to gather enough viewers in its first week because of the much anticipated entry of Sunny Leone and apparently this is the only reason why people will go to watch this movie. Else I feel that things could have been much better if this movie was only in the dreams of Pooja Bhatt."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "anup-gift",
        "review_rating": "4",
        "review_title": "soft porn+semi love story+fake poster+below average music=Jism 2",
        "review_detailed_main": "The movie starts with plain quote \"\"My name is sunny ,I'm a porn star\".\n\nThe movie background reminds me 1980's french style of taking were it has Scenery locations were chosen with also very limited characters of only 6.The film has very predictable screenplay which seem to be like B grade movie...the director wanted convey the message of \" falling prey to wrongly influence people but erotic scenes eaten up the script\". It was very loose handled Script.\n\nThe story goes like this ....Sunny walks into a pub meets a Ayaan (Arunoday Singh) whom she seduces to have one stand. Then gets she contract for 10crores to get information Kabir (Randeep Hooda) who is assassin and who turns out to be her past lover .She agrees for the deal ..later in end she gets to know that she got struck herself in conspiracy. Finally three protagonist die in the climax (which is rarest feat in Bollywood films)\n\nThe smooth going so called love story in first half instantly turns into triangle love story in the second half (\"I don't want blame director for this...as Arunoday Singh also need a reason to Smooch Sunny Leone on screen\" ). The rest of the movie is predictable with lots of smooches,two piece lingerie and couple of topless screen which will least expected by all the audience from a porn star.\n\nThe new-comer and main lead Sunny leone manage to act the complete film with three expression orgasm,fear and crying and keeps on walking in a seductive way throughout the film with all the colors lingerie she had:):)!!!\n\nPooja bhatt tried maximum to make love has main background of the movie but seemed more like semi-porno by boldness of the characters portrayed in the film ...The writers of the also tried to give best strong flavored senti dialogues in the climax to Randeeps hooda to depict the love towards Sunny but they weren't carried well..The song and music were also below average.\n\nMy rating 4/10"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "mankhan67",
        "review_rating": "10",
        "review_title": "Pooja's best Art",
        "review_detailed_main": "I do not understand that what is wrong with the people giving this movie such low rating. This is one of the best Pooja's movies, well written, well acted, excellent location and background and the best songs and music. I really enjoyed this movie (Blu-Ray) to its fullest in my 135 inches cinema screen with 7.1 audio setup. Well done Pooja. I can go into infinite details into this movie but briefly this is my first 10/10 movie. Even my wife enjoyed it. I tell you when you watch this movie see each and every corner of the screen and you shall really appreciate the work done and efforts. I think this is best of Randeep's movie and he will not be as visible anymore after acting in this movie. two thumbs up Mr. Randeep."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "rightwingisevil",
        "review_rating": "",
        "review_title": "what's going on?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "senthilkumarmoorthy",
        "review_rating": "10",
        "review_title": "Amazing love story",
        "review_detailed_main": "This Movie is amazing BGM in this movie is one piece of master art. My Great Wishes to Director and too the Music Director too..! Everyone in this movie acted like anything. Simply Outstanding. All the best for the upcoming movies from this director. Actually this is my second Hindi movie in my life because i'm from different language. In this movie i have English subtitles so i was finding easy to understand things in this except the feelings of love. Because the way Kabeer and his soul love(Izna ) expressed is something really incredible. Now i'm became fan of kabeer too..! Kabeer your rocking in acting and your performance is something outstanding."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "dr_abrar0017",
        "review_rating": "",
        "review_title": "not impressive at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "jsimi",
        "review_rating": "8",
        "review_title": "Good movie but not that erotic",
        "review_detailed_main": "It was a good movie but it was not that erotic as I expected. You will see more erotic content in other Indian movies like Murder or Julie. In Hollywood, erotic movies usually have full blown nudity with borderline porno material. Since there is only half nudity with some kissing scene and no sex, Jism 2 doesn't really count as an erotic thriller. The prime reason why this movie got so much attention is due to Sunny Leone's debut since she is a porn star. Sunny Leone fans will be disappointed because she doesn't really show that much at all in this movie. Arunoday Singh and Ranbir are very HOT. I don't think Arunoday should be acting in this kind of movie because he will definitely be typecast in the future."
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "leplatypus",
        "review_rating": "",
        "review_title": "Immobilism 0,00000000000000002 (web)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "amina2306",
        "review_rating": "8",
        "review_title": "Not so bad!!",
        "review_detailed_main": "I honestly was watching this movie to see which American movie they copied this time. However even though there is a certain aspect of the movie depicting similarities from Mission Impossible 2 as far as the love triangle between the girl and the 2 men in this movie and how she is placed and for what reason, the movie continues on to be quite decent.\n\nYes the girl in the movie is not the brightest of the stars, however she is not so bad either for her first Bollywood movie! It's a Bhatt production so the story and the openness of the adult relationship aspect is obviously going to be shown. If you can't handle it then don't watch it just to judge it. I think the adult scenes were not tasteless at all. In fact they were very well done.\n\nThe actors seemed very comfortable in their own skin. Sandeep Hooda is phenomenal and I really found him to be totally comfortable in his role. The dude just gets better with every movie!! He is something else!! I think if the movie is looked at for what it is \"A thriller\" not just \"an erotic thriller\" it would have a better impact.\n\nI was impressed watching the movie, the story unfolding. I obviously kinda suspected what was going to happen towards the end however the way it was all put together and how the story came through was quite impressive!! I think all the actors did really well in the movie and yes the actress was a bit cold and immature in her acting however as the movie continued she seemed to get more into her role and not the adult scenes but the other scenes too.\n\nThe second hero who played ARYAN (Arrunodhay) was not bad at all. I must give him his credit too, cause when his character goes through his complications and confusion, this actor played the role very convincingly. His anger, his emotions and how being a person in the situation that he is - his reactions!! Pretty decent choices on the actors chosen for the flick!\n\nPooja Bhatt, your movies are very good, It lacks a bit of direction and sometimes the storyline feels like its fumbling, but otherwise I honestly did enjoy the movie! No holds bar!!"
    },
    {
        "movie_id": "tt2226666",
        "movie_name": "Jism 2",
        "movie_rating": "3.1",
        "review_username": "shahed-433-143586",
        "review_rating": "",
        "review_title": "Jism 2 is an Bollywood erotic thriller film",
        "review_detailed_main": ""
    }
]