[
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "conyo",
        "review_rating": "3",
        "review_title": "what a waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Tweetienator",
        "review_rating": "4",
        "review_title": "Not A or B but C",
        "review_detailed_main": "If you got the two lead characters with neat clothes, well-done hair-job, white teeth and even some make-up in a post-apocalyptic setting (almost 100 years after the massive killing of most humans on this planet through an AI and the survivors and their offspring still hunted down and killed by the machines) you just know, this can't be too good.\n\nWell, like the above description indicates, I guess, this movie aims at a young audience, so maybe if you like such stuff like The Shannara Chronicles (which is a lot of personal drama and romance interrupted by the occasional fight and killing) etc. you may like this movie or at least you won't be killed by boredom and brain damage.\n\nAll in all, Singularity got some okay technicals, but the story (generic, a little bit Terminator here, a little bit Hunger Games here etc. pp.) and acting are so-so. If you like the post- apocalyptic genre but you need one for a mature audience (e.g. The Road, Mad Max, City of the Blind, Soylent Green etc.) skip this one, if you are a youngster around 12 or something like that, well, you may try it.\n\nWhy John Cusack took a role in this flick is a mystery to me. Thanks to some semi-pro or almost pro looking technicals like effects and camera (tv-scale), I rate a 4, but this is imo no B-movie but a C- movie.\n\nRedundant."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rosslittle-278-657280",
        "review_rating": "1",
        "review_title": "Just awful...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jan-jones",
        "review_rating": "1",
        "review_title": "Hard to find words it's so bad",
        "review_detailed_main": "I can hardly believe John Cusack put his name to this.\n\nSpecial FX were presumably done on a phone using an app. The story, dialog and acting are cringeworthy.\n\nps. ignore the fake reviews on here, watch the trailer and you will get an instant feel for just how bad it is."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "travis_hates_martin",
        "review_rating": "2",
        "review_title": "The Death Of John Cusack",
        "review_detailed_main": "i don't know what happened or at what point Cusack just said hey F it Im going to audition for roles in B-grade movies and ruin my career. I've been seeing him a lot lately in absolute garbage film and this one cakes the cake of washed up actors trying to make a buck.\n\nBut yeah about the film, its trash don't even waste your time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "WatchAndSmile",
        "review_rating": "2",
        "review_title": "~ 4/10 Beware of Fake Ratings!!",
        "review_detailed_main": "I gave it a 2, but it's more of 4/10 movie...maybe. I lowered the rating because producers/owners of the movie are using one of many sites that give you free positive ratings, which is illegal. They should've spent that budget on making the movie better! Just google: buy IMDb ratings and many sites will pop-up offering this service. Real rating of this movie is more like 4/10 at the MOST!\n\nOK acting by some...Bad for some others and of course 1 good actor.\n\nThe issue I have with the movie is that it is pointless, slow and predictable. I won't discuss bad graphics sfx as certainly the budget wasn't big.\n\nThe story could've had so much more to it. It just sad they decided to dumb-out the script and make it so plain. It is a very slow pace movie and not in a good way as I got bored 1/3 of the way and not sure how I got through the rest- I was really expecting it to pick up and it never did. The idea behind the movie is nice,but it was never developed at all.\n\nDo NOT believe the high rating (currently 8) as those are fake ratings. There are many sites that sell Anyone giving this more than 5 or 6 did not watch the movie at all. I'd say any reviews of 2-5 can be considered real."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bkunder",
        "review_rating": "1",
        "review_title": "A child with camera phone could have made a better movie",
        "review_detailed_main": "An extreme low for scifi fans. The little amount effort put into this flick is astonishing. No energy. No real fear or feeling ever throughout. Just bad.\n\nWho thought this would work? Why did you produce this?\n\nPoorly executed."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gsh999",
        "review_rating": "",
        "review_title": "Pretty bad ---- I'm amazed at the high rating.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nevyn00-980-341181",
        "review_rating": "1",
        "review_title": "Waste of time. Do not be fooled by the rating.",
        "review_detailed_main": "Again, do not believe the rating. The vote distribution is so obviously fake that now, it is on IMDb to do something about it. The story is unoriginal and nonsensical. The ending was a lazy attempt to set up a sequel that required a deus ex machina device created out of giant plot holes.\n\nI don't know if it is the work of the studio to game the rating or if it is the Russians trying to make the world dumber by making horrible movies look good."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "marcisinphoenix",
        "review_rating": "1",
        "review_title": "somehow the word awful just doesn't do it justice",
        "review_detailed_main": "To merit the 1 i would say that the graphics at the beginning were quite nice\n\nThe rest was godawful .. how awful ? i had to write this review to warn people.\n\ni'm sure having chosen to watch this movie i'm responsible but still i'm sure there was a crime committed in producing this movie. Some sort of human rights thing that would make the world court delete the movie from the planet.\n\nThe acting is so terrible its .. undescribable. The main actors are a pair of narcissistic self indulgent millennials so busy with themselves they get in the way of perfectly nice backgrounds that i would have watched in complete silence and been happy. If this is what hollyweinstein intends on producing in the future.. shut it down now.\n\nand btw hollyweird enough of the movies with hyperPMS teen females leads there are normal teens out there ... please stop foisting your own failed parenting on us."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "szabotomika",
        "review_rating": "8",
        "review_title": "I liked it",
        "review_detailed_main": "As I see here are pretty much of professional movie critics. Yes it has its weak points. What does make a movie good? For me, when I can enjoy it. I could. It was good. It was far better than described here. I don't know what you expect from a movie? Finally zero thinking? Or should it enjoy itself instead of you? For me it was good. And this is not a fake critic. I hope you still read some books, then there is hope for you still. Live long and prosper."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "angiris",
        "review_rating": "7",
        "review_title": "IMDb reviews are a joke. Whether overly positive or extremely negative.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "puppyzwolle",
        "review_rating": "3",
        "review_title": "Singularly..... daft.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Meindert4337",
        "review_rating": "2",
        "review_title": "Where is this Singularity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kakulena",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "No logic, no sense, no feelings, no action. The sounds are surprisingly bad, conversations are full of cliché. Neither director nor actors should be proud of this work. I'm sure it could be done much better with minor changes to scenario and at least some effort! While I was watching this, I was stunned by the stupidity of lead characters and absence of logic in most of the scenes. Seems like this work was made for a certain kind of people. To hurt them."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "FLAPS20",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "laurakgrimmer",
        "review_rating": "2",
        "review_title": "Cusak should be ashamed",
        "review_detailed_main": "I think the only reason this movie is rated PG-13 is because the acting can be very scary. In fact, if rating for those reasons, it should have been a strong R! Parts are unintentionally funny. I saw this on Pay TV and wish I could get my money back! Slow moving, bad acting, silly premise and poor special affects. Don't waste your time!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kaibeau",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "Watched this as it rated so well, but oh gees.... We turned it off. Rubbish acting by the two younsters, holes in the story. Just doesn't make any sense. Don't waste your valuable time on this title... So disappointed in John Cusack. Must have needed the cash really bad! Hope they won't waste money on a sequel."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "cajadomatic",
        "review_rating": "",
        "review_title": "Worst movie ever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Green_Wolf",
        "review_rating": "5",
        "review_title": "I'm not sure what to make of this movie",
        "review_detailed_main": "The two older actors are veterans in the business and the young main actors are quite good looking and show some talent.\n\nThere are some nicely done shots in this movie, obviously the camera crew are professionals. VisualFX, SoundFX and music are on par with with large studio productions. Film editing have been done to get a slower tempo than most current movies, but is also professionally done.\n\nSo what's the problem?\n\nI think it's the script and the director. In one scene our young heroes seem stiff and cold, in the next one they are massively overplaying emotions. Then they are stiff and cold again. Repeat. Although the main story line is OK, there are plenty of stupid lines, some of them repeated several times.\n\nI would recommend this movie for a rainy evening when you feel like watching a slow-tempo B-movie where everything except the script is actually a first class production."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mdmeadow",
        "review_rating": "2",
        "review_title": "The Room now has competition!",
        "review_detailed_main": "Wow. Horrible, horrible movie but I had a great time watching it... just make sure you have a bottle of wine and someone to laugh with. Full admission, I love(d) mystery science theater 3000 and this movie would have been a perfect target for it- a worthy competitor to Santa Claus Conquers the Martians or Manos Hands of Fate. There were point in the movie where I found myself laughing hysterically at how many scenes/story lines/special effects had been lifted from other movies or video games. By my count there were at least a dozen - most notable being terminator (several of them), matrix, gladiator, hunger games, blade runner, mech warrior, battlestar galactica, transcendence, Independence Day.... I could go on for a while. Others have noted the plot holes and I agree with their assessment. With that said, this movie is the good type of bad. Don't watch it looking for a serious dystopian movie- seriously, the main character has bleached white teeth, a jersey shore tan and highlighted hair - his love interest has a cell phone (didn't society collapse 97 years ago?), perpetual lip gloss, and a bow and arrow (apparently to shoot robots)..and let's not mention the Cusakinator. Do watch if you are looking for something to make fun of for about 90 minutes. Positive points, no one disappeared after catching a football or being diagnosed with cancer! I also don't think this cost $6m to produce. If that makes no sense, please look up The Room."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "arslansajjad-23438",
        "review_rating": "8",
        "review_title": "An Amazing Idea!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Boristhemoggy",
        "review_rating": "6",
        "review_title": "Average dystopian film that is worth a watch if you're a Sci-fi fan.",
        "review_detailed_main": "The film is slow in parts but clearly lacking a confident direction. Ridley Scott or James Cameron would have turned this into an acceptable box office release I think. As it is it's slow and boring in parts and lacking a consistent pace. Argenziano is pure B movie material, while Cusack puts in a mediocre performance trying to mimic a sadistic robot born from a megalomaniac human. He just appears bored and confused most of the time. Grubba's performance, although only lasting a few minutes, is by far the very best of the entire film, although Wacker is close behind her and the only person who worked hard throughout the run of the story. I'd expect big things from Wacker in the future. I don't even know what to say about Schaffner without chuckling. Dire? Bad? Uninspiring? Amateur? Hmmm...not really amateur, he's not as good as that. His constant 'wide eyed and droopy bottom lipped' expression reminded me of Taylor Swift and left me utterly cringing for him, and aghast that a director would let such a desultory performance be allowed past the cutting room floor. He almost ruins the film entirely although Wacker rescues it and turns it into an average film that's only ever worth watching once but for that once you don't feel as though you completely wasted your time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "chuasam",
        "review_rating": "2",
        "review_title": "Is there another movie?",
        "review_detailed_main": "I voted 2 cuz I was being very kind. Was there another movie that the one with the 10/10 rating was watching?\n\nThis felt like a joke...mishmash of various different movies.\n\nThere's a rip off of the Hunger Games Katniss..complete with the mockingjay pendant. Rip off of Terminator Rip off from iRobot and they also stole from various other Japanese anime sources. (FAULT!! to name one) what's with the giant mecha?\n\nI don't know if John Cussack was a bad actor or just pretending to be bad at acting."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "countrymusicgirl2892",
        "review_rating": "1",
        "review_title": "Hunger Games Wannabe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mday008",
        "review_rating": "1",
        "review_title": "Warning : Fake Ratings on This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "TonyManeroAndStephanieMangano",
        "review_rating": "1",
        "review_title": "Worst movie ever made, Blatantly rip off.",
        "review_detailed_main": "I just endured to the end because I found this story was very similar to a book of my Chinese friend wrote a few years ago, The same theme, some same plots. The difference is in his book is more about the professional discussion of A.I and deep contemplation to human nature. It is quite significant for us humans I think. But none of these key elements were left in this movie. Only shallow, stupid Third-rate B movie plot there, looks they made it in a hurry. And very boring!! Let alone those very obvious story loopholes... So I called my friend on the phone and he told me he did chat with someone who claimed to be a Swede online before, and leaked some of his book's plots to him. It was about may 2016. Then the so-called Swede disappeared. Never contacted him again. He was very frustrated to hear the news, also very disappointed with this movie. He has to rewrite some of his unfinished book's plots now to avoid a collision with this crappy movie. What a lousy way to ruin a good book and idea!! Poor gentle good-natured man now learned that never believe in strangers."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "TheOtherMovieGuy",
        "review_rating": "1",
        "review_title": "Worst acting I've seen",
        "review_detailed_main": "I know, I thought 'Sinbad: The Fifth Voyage' was pretty abysmal but this does take the price for worst movie, ever. I think I'd rather have my finger nails pulled out than watch this film again. Rarely do I come across acting this bad (shame on you John Cusack) so in some ways I feel blessed having witnessed this but maybe I am convincing myself to see the silver lining here because I know that I can never unsee this utter rubbish. If I could direct the main actors, Julian and Jeannine any career advice I would say \"don't give up your day jobs\" - please, for the love of mankind. Please! The plot is so hollow and incoherent that when some scenes start, I had to rub my eyes because I thought I had fallen asleep and woken up 5 minutes later. Alas, that was not case, it was just the plot that was bad. Singularity get's my vote for worst acting in the history of EVER: \"I'm not pretending\"...\"I do feel\". Honestly, I wish I would say that this was a B movie but actually there isn't a grade low enough to give this film. Maybe one day, we will look back at this move and laugh like we did with Sharknado or Teletubbies.....well, wishful thinking perhaps. Unlike some other reviewers on here, I actually hope that there is a sequel because it cannot get any worse than this. Even if the sequel were to show 90 minutes of night sky with David Attenborough singing Amazing Grace nonstop, it can still not get any worse than Singularity. IMDb - can you introduce negative ratings please? Oh, and BEWARE FAKE RATINGS ABOUND. IMDb - you need to sort this out soon or your business will disappear."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jacawol",
        "review_rating": "1",
        "review_title": "Worse than a waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "johnbaggs",
        "review_rating": "2",
        "review_title": "Wow, just wow...",
        "review_detailed_main": "Quite possibly, some of the worst acting I've seen since the Karate Kid. John Cusack's facial expressions ranged from drunkenly curious, to ridiculously serious. He was atrocious! You've hit rock bottom, John, and you continue to dig. You really need to stop hanging out with Nicholas Cage. The rest of the actors were equally as horrible. Julian Schaffner's performance was as plastic as it gets. He honestly looks like he has no clue what he is doing throughout the whole film. Jeannine Wacker was trying to go for the Hunger Games look, but ended up more like the Emo Games. There is a scene where she is sitting by the river, singing; uhhh, so terrible, I actually laughed out loud. If you are in the mood for a train-wreck, this is it. I made it through half the movie before I decided I had better things to do like help my neighbor unclog his toilet. BTW, this is supposed to take place 97 years after Kronos exterminates the majority of the human race. The houses are super clean and the two main actors have new clothes and look like they just left the day spa. The other human survivors are dirty, deformed and unnecessarily violent. So...so bad"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bassballer",
        "review_rating": "1",
        "review_title": "Total Scam",
        "review_detailed_main": "This movie is a complete scam. Everything from the 1800 'viewer' reviews that popped up overnight on IMDb to make people think this is worth watching to the fact that the trailer was released immediately before the 'film' was released. Don't waste your time.\n\nRehashed ideas, tired acting, bogus effects, and downright poor writing make this a complete flop."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rsvp321",
        "review_rating": "",
        "review_title": "Pathetic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "samuel-93041",
        "review_rating": "8",
        "review_title": "War, artificial intelligence and humanity.",
        "review_detailed_main": "I liked it. It's Science Fiction people ! There has to be a certain willing suspension of disbelief. The quest for artificial intelligence has bad results for humanity. Some people are saying this already. Oh and Jeanine M. Wacker has a nice face. That is all. You may return to your regularly scheduled transmission."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "flatsy-00571",
        "review_rating": "6",
        "review_title": "Terminator Salvation with Katniss Everdeen",
        "review_detailed_main": "Terminator Salvation with Katniss Everdeen. It will pass 90 minutes on a rainy Sunday afternoon. Production quality is decent but the story is a complete rip off. What has happened to John Cusacks Career? Really liked him as an actor and seems to have dropped to the straight to DVD category."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "amdabc",
        "review_rating": "1",
        "review_title": "What on earth is John Cusack doing in this terrible movie?",
        "review_detailed_main": "Nobody seems to have noticed that they have basically completely channelled Katniss from the Hunger Games, that initial shot with the female lead she is nearly her double. The movie was so dull I didn't finish it, sorry. Took all I had to get through about half of it. Silly, slow, odd and pointless. The young actors are OK. Hope they get a shot at something better than this."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "srdikano",
        "review_rating": "2",
        "review_title": "A complete train wreck",
        "review_detailed_main": "God, where to begin with this one?\n\nStory: lazy, derivative and predictable.\n\nScript: laughably trite and dull. Straight from the mind of a toddler. A very confused toddler.\n\nActing: woeful.\n\nDirection: rudderless and all over the place.\n\nThere is really no redeeming value for Singularity. This is the quintessential, low-budget, B-movie that you catch on some obscure channel at 3AM in the morning. And you hate yourself for it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "wesbucey",
        "review_rating": "1",
        "review_title": "What a stinker!",
        "review_detailed_main": "The only reason I gave it one star is because the system wouldn't let me give it zero. I have since looked up it's box office receipts. The only reason it could be even that much is because audiences were too overcome by the stench to ask for their money back. I managed to find the remote to turn it off after ten minutes (about nine minutes later than I should have.) Cusak looked like he was reading the script from cue cards. The only reason I can think of for professionals to be involved with this is that they woke up next to a severed horse's head in bed. Money alone couldn't be sufficient motivation."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "qriqui",
        "review_rating": "1",
        "review_title": "Rubish",
        "review_detailed_main": "One hour and 30 minutes of two kids running and looking for Aurora in year 2117. John Cusack is watching them on a screen. Full stop. Absolutely waste of time. Painful."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "hotjanuary",
        "review_rating": "4",
        "review_title": "StinkyAirRitty",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "aruegger-07861",
        "review_rating": "1",
        "review_title": "What just happened",
        "review_detailed_main": "I never write reviews, but this was so bad I had to rate it. You will lose years on your life watching this, there is not a coherent thought or sensible idea anywhere. I'm starting a therapy group for whoever happened to invest even a minute of viewing. Credit to the Chinese rating farm boosts that initially had this at an 8"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kerrydunn",
        "review_rating": "1",
        "review_title": "Just terrible !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jawadahmed",
        "review_rating": "1",
        "review_title": "Don't waste your time on it",
        "review_detailed_main": "It was just plain awful.The male lead actor doesn't know how to act. His acting is pathetic. Hey guy, do yourself a favor and take some lessons or leave the acting career. There's more to acting than just bulging your eyes out every now and then. Mister director should know that living in jungle makes the clothes dirty. How come the guy never have dirt on his clothes EVER? Its so terrible in so many ways. The only thing appreciable a little bit than others is the female lead actress who know little acting, that's it. I don't know how this movie have such a high rating on IMDb, something is fishy."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rusedog32",
        "review_rating": "",
        "review_title": "Made it though 3/10 of the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "neogriffin",
        "review_rating": "10",
        "review_title": "Deal with the fact that it is a B Grade movie and enjoy it for what it is.",
        "review_detailed_main": "Deal with the fact that it is a B Grade movie and enjoy it for what it is. Yes it's B Grade, don't have any expectations, you might actually enjoy it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gderock",
        "review_rating": "7",
        "review_title": "I legitimately enjoyed this movie",
        "review_detailed_main": "Yes it is very low budget and yes the script is cheesy but I can honestly say I enjoyed it. I watch alot of these low budget movies and this one isnt as bad as most reviews claim. I'd be willing to bet that most people who left negative reviews didnt finish the movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jfry-73910",
        "review_rating": "2",
        "review_title": "Horrible",
        "review_detailed_main": "I rate it a 2 instead of 1 because at least the production quality was decent. Terrible acting, terrible script, just plain terrible. John Cusak should have done Hot Tub Time Machine 2. Nothing could be worse than this movie unless someone filmed it with their cell phone. Do not believe any review that is positive on this movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gergoholp",
        "review_rating": "1",
        "review_title": "Just made an account so I can rate it. Singularity= a load of rubbish",
        "review_detailed_main": "an hour and a half of my life I will never get back...I guess the initial high rating tricked me.. I consider my girlfriend lucky cos she fell a sleep half way XD and now she rates me 1 star cos I am writing this review instead of paying attention to her.\n\nso anyway stay away from this movie"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "change_destiny",
        "review_rating": "3",
        "review_title": "Horrible movie",
        "review_detailed_main": "It's a disaster. The cgi, acting and story-line are horrible. This could be any low budget movie, adding a well known actor doesn't magically make this movie any better. And how it's possible this movie even got a mark above 3 just doesn't make any sense.\n\nIt's an insult to intelligence.\n\nKeep away at all cost."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "DrRicketts",
        "review_rating": "1",
        "review_title": "Why does IMDb allow FAKE RATINGS???",
        "review_detailed_main": "This film sucks: Here's why it has a 6.6 rating...\n\nFrom a popular website that SELLS IMDb RATINGS:\n\nbuy IMDb ratings, ************* IMDb ratings from us is the best way to help promote your film on the world's most popular and authoritative movie database website.\n\nIncreasing your IMDb ratings for your film will not only make your film genuinely look popular but it will also increase you're ranking and compete with other major films.\n\nIMDb is used by industry professionals and having an active film on IMDb with high ratings can provide you with major opportunities in the film industry. Increasing your ratings will also help you get more sales, reviews and genuine interest about your film.\n\nThe whole point of increasing your IMDb ratings is to help create authenticity, clear branding and to put a point across that your film is - A highly rated film that everyone in the industry and audiences worldwide should watch.\n\nThis is a perfect marketing option for filmmakers looking to make it big in the industry.\n\nSo what are you waiting for? The opportunities are endless.\n\nOrder now and get famous!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nusuthiluvatar",
        "review_rating": "1",
        "review_title": "ratings are FAR too generous",
        "review_detailed_main": "This is the worst movie I've seen for a few years. It's a mish-mash of ripped-off ideas from other (read: cash-making) classics - Terminator and Hunger Games are the first to come to mind. How cheesy to have a heroine, 98 years after the doom of civilization enter the scene in a tight body outfit, arrow (ok, a crossbow ;), perfect make-up and a smart-ass remark. Yes, dialogues are terrible, and so is acting). And so is the \"voiceover\" for the dimmer / lazier of the audience, to explain what is actually happening. Looking at how bad the movie is, and yet, with a 6.4 out of 10 rating, the allegations of rating-bumpings take on some credibility :/\n\np.s. it appears I'm not the only one to have registered on IMDb to protest against false reviews bumping up this awful, awful production!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jimi130995",
        "review_rating": "1",
        "review_title": "A monstrosity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "chumgriffin",
        "review_rating": "1",
        "review_title": "Derivative in every aspect",
        "review_detailed_main": "I feel sorry for John Cusack. He must be desperate to end up in s film this poor. The acting is very poor , the special effects are very poor, the directing is poor. The only amusing part was to cast an actor who looks a bit like Jennifer Lawrence and they even give her a crossbow. Very useful for killing robots. This movie is appalling. I could not follow through to the end. I hope for your sake you do not waste your time with this rubbish."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "RodrigAndrisan",
        "review_rating": "",
        "review_title": "Very stupid!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dgargano-43993",
        "review_rating": "10",
        "review_title": "I personally find it very good",
        "review_detailed_main": "The movie is something you do not see often in the cinemas, it's something mind-blowing and located in a futuristic scenario. I see a lot of people saying that it is not worth to see it... They're absolutely wrong. If the film was written by Cristopher Nolan, everybody would say that it is incredible, but everybody is expecting something amazing, not considering that the 90% of the movies made in Hollywood are worse, and rate Singularity very low. That people deserve films like \"Baywatch\" for the rest of their life. Before seeing it, you should consider that it is not a high budget film and the director is young; and I find the idea so good, so I can say the director is very talented; the actors have not a lot of experience (except of John Cusack), but they managed to act very well (ofc they're not Johnny Depp or Emma Stone, but still.). Anyway, The graphics are as good as a Transformers movie, maybe the lights are a little bit strange sometimes, but the work with the green screen is undoubtedly very very well made. I didn't expect something amazing, but the film left me stunned, I believe in the director and in the actors, they have a bright future.\n\nI want to give a 10/10 to support, the film himself, considering the whole world of cinema, could be easily a 7.5/10."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "s-andra-1957",
        "review_rating": "6",
        "review_title": "Ok I know my rating is high",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "HiArt",
        "review_rating": "1",
        "review_title": "Is no stars possible?",
        "review_detailed_main": "Crikey this is a bad movie.. Pity a no star rating is possible.\n\nSlow, glaciers move faster\n\nActing, good idea, let's add some as not even Cussak acts well in this. I doubt the two leads have a future in the industry.\n\nDirection? A child would have directed it better.\n\nPlot, predictable with no real twists with which to hold your attention.\n\nCGI is so bad and not credible.\n\nPath left open or a follow up which, if ever made, would be a crime against cinema.\n\nTo be honest, replace Kronos with Skynet and you kind of have the basic premise behind the movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "svadwi",
        "review_rating": "2",
        "review_title": "So bad i don't know what to make of it",
        "review_detailed_main": "This is the first review i've ever written. And it's just to tell you guys how bad this movie was. IMDb says 6/10, more like 2/10 at the most.\n\nWith John Cusack in the movie you'd think that they pick to outstanding actors in the 2 lead rolls. But the girl has zero talent and the guy may be a little bit better. Terrible graphics and a very loooong and boring movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Severance96",
        "review_rating": "2",
        "review_title": "There are plenty of good low-budget sci-fi, this is not one of them.",
        "review_detailed_main": "First I'd like to say that there's a little value in this film, very little, if any. Plot is a strange snooze fest which makes even less sense as the film concludes. The acting is sub-par, at best (John Cusack, Jeannine Wacker), but completely trashed by Julian Schaffner (I'm sorry but he should really consider another career). The FX is poor and seem effortless, sometimes even comical.\n\nIn short, there are plenty of good low-budget sci-fi, but this is not one of them. I desperately tried to understand what the film was trying to say, if anything, but could only conclude that's it's a ~90 minute effortless attempt of something. Truthfully I can't find any reason to recommend this to any type of viewer, and I hate to say it, because I believe there is some value in most films, but this one is best to stay away from."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "fiona-hogan",
        "review_rating": "1",
        "review_title": "John Cusak has gone from bad to terrible to worse",
        "review_detailed_main": "I hardly *ever* offer a rating, preferring to just rate the movies I watch. But this one is special... so very special.\n\n3 minutes in, and it had my country's CBD skyline. All blurry like, which lead me to suspect an el-cheapo picture substitute. 8 minutes in and it already started to feel like a turkey of a movie. 17 minutes in, and I was compelled to read the reviews.\n\nEvery single review is correct. This is so bad, it's on another level altogether.\n\nJohn must have needed the money to fix his house or something because this is the worst of all the bad films he's done. I particularly remember the turkeys which were Cell, and 2012.\n\nDon't waste your time. And if you're curious nevertheless, don't say you haven't been warned 0.o"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ouiouiphoto",
        "review_rating": "1",
        "review_title": "How can this movie be rated 5.9. Come on",
        "review_detailed_main": "How can i say. After 20 minutes i have just watch it in fast mode. just to see the end.\n\nThis movie is bad.Special effects are crap and actors are not playing well. It is a shame because i think that it is possible to do a much better movie with this story."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mac-33983",
        "review_rating": "4",
        "review_title": "Utter nonsense",
        "review_detailed_main": "Seriously, this film was an amateur attempt at film making using a script that must have been written for complete idiots.\n\nJohn Cusack, might be a well known and respected actor must he be damned embarrassed with the result of this film. Even he couldn't pull any of this film into order.\n\nAfter we initially learn about humanity fate, it goes goes from bad to worse. The script must have been thrown together by a machine. The script lacks fluidity and appears to have been patched together with a rusty needle, nothing feels coherent.\n\nNone of the actors gave anything other than amateur performances, providing neither sentiment or credibility but then again they were using poorly written text, were poorly directed and they had to deal with a terrible story-line.\n\nThis was pure torture, from beginning to end.."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "support-36287",
        "review_rating": "1",
        "review_title": "Horrible!",
        "review_detailed_main": "There are two reasons you find yourself compelled to share your thoughts about a movie: You find it very good or very bad. This one was the latter. When I started watching it it had 6.7 points at IMDb. So I gave it a try. It had deserved non of them. The acting was poor, the plot stupid, the plot-holes many, the dialogues embarrassing, the ending threatening with an even stupider sequel. A singularity is a future event beyond which one can not make any predictions. Most of the movie was perfectly predictable. The only reason why some of the turns where indeed not predictable, was because I could simply not anticipate the level of ruthless incompetence of the scriptwriter leaving tons of unanswered and unanswerable questions: Where does that cornfield come from? Why does that facility burn down? Why where there at all any trains 37 years after the event? Why should groups of (male) humans be hostile towards strangers, when there is no competition and they are no threat to each other, only possible help? How could humans survive underground even for days let alone decades, where there is no food and machines are better equipped to catch their prey? How could humans develop fantastic technologies within a few, what? years? months? weeks? when they barely have food to survive let alone factories, supply lines and indeed the knowledge of the necessary physics. And why would an unbiased machine think that humans killing humans is worse than ants killing ants, lions killing lions or trees suppressing other trees in the first place? And if this machine for some mindless reason must eradicate humans from this world, why not doing it fast, efficient and completely. I could think of may ways, a superhuman intelligence, not doubt, could think of even better ones. And how, to put an end to this pointless discussion, does a super intelligent machine comes to terms with its own evilness if it is evilness it tries to wipe out? Watch this movie if you had a good day and you want to spoil it for yourselves."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "sheilacarr46",
        "review_rating": "2",
        "review_title": "Another rubbish science fiction movie",
        "review_detailed_main": "This is terrible, i like science fiction but the movie world hasn't made a decent one since I Robot, spare yourself from this.These days if you see John Cusak in a movie, you just know the movie will be crap and it's certainly was true of this one. This movie treats its audience like idiots"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "oldsrp",
        "review_rating": "10",
        "review_title": "Got the wrong idea",
        "review_detailed_main": "Looking for a campy, tongue in cheek movie that's so bad that it's actually good. This is it. Yes there are plot holes and some logic flaws (major ones at that) but I actually enjoyed the movie and have no regrets. Worth watching once just dispense all the other stuff, click the \"I believe\" button and enjoy."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "hogs_rule2000",
        "review_rating": "7",
        "review_title": "Too many Haters (dont understand their negativity)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "acionmn",
        "review_rating": "1",
        "review_title": "This movie makes me hope I get Alzheimer's's",
        "review_detailed_main": "I wish you could give this negative starts out of 10....\n\nI hope I get Alzheimer's's so I forget that I ever wasted my time watching this garbage movie. This is honestly the worst movie I have seen since Sharknado.... Actually I think Sharknado was significantly better than this. I feel sorry for the actors who thought it was a good idea to take a role in this."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "v-ley",
        "review_rating": "1",
        "review_title": "OMG! WTF? Do not watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Jack_C_",
        "review_rating": "2",
        "review_title": "We are all dumber for this movie's existence",
        "review_detailed_main": "Dialogue aimed at 10 year olds. Ex machina spoon feeding you at every crucial plot twist. 1997 computer graphics. Completely wooden acting from nearly every character, moved along by unbelievable motivations.\n\nI should have shut it off 20 minutes in! Did Cusack really need a paycheck this badly?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Pantos",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "I've seen a porn with better acting. Worst movie i saw in last 10 years."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "robertandrews-63249",
        "review_rating": "1",
        "review_title": "Complete garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "VeganVag",
        "review_rating": "1",
        "review_title": "Baaaaaaaaad!",
        "review_detailed_main": "I should have known it was going to be baaaaaaaaad based on how long the introduction was, where about 20 minutes in, I decided to fast forward it to the last 15 minutes, because I was sure I'd see some action now, but it was still baaaaad,, still boring, where I FF to the last minute, and THAT was just as baaaaaaaaad, but at least it was over.\n\nCusack!\n\nThat's going to be my new word for suck b**ls!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "paul_haakonsen",
        "review_rating": "2",
        "review_title": "No! Just no...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Snootz",
        "review_rating": "2",
        "review_title": "Undiluted drivel",
        "review_detailed_main": "The cliché subject matter of this film (revealed in the first 5 minutes) set aside, the weakness of this movie is simply the lack of common sense in all story aspects. Well, that and a terrible script, awful directing and amateurish acting-- even from the seasoned veterans, who apparently have no other expressions than detached boredom (main villain), open-eyed goofy wonder (male lead), and disappointing dullness from veteran Carmen Argenziano. The only decent acting in the entire film is from female lead Jeannine Wacker... but the lines they gave her were just unbelievable.\n\nExamples of plot dis-continuity:\n\n* A Polaroid camera that still has a working battery, flash and film after decades of sitting on a shelf.\n\n* Julia plays a \"Hunger Games\"-esque female that carries a bulky crossbow as her weapon-of-choice. (In a world where she could have about any weapon she might find, this cumbersome contraption would be one of the least viable.) (Did she even use it in the film?)\n\n* Her almost-instant acceptance of the male character, who frankly just appears out of nowhere looking like a model from a teen magazine-- with no real questions as to 1) why he has no weapons or supplies 2) Where he came from 3) How he got there 4) And just accepting the very lame answers he gives to her limited questions.\n\n* An AI construct retaining a human body (badly damaged at that). Nice \"head glow\" effect... just rather unbelievable.\n\nThe list goes on. As science fiction goes, this has very little science and a whole heap of fiction. Add to this long stretches of unnecessary scenes and trite dialog that can only be described as tedious and we have a predictably ludicrous and nonsensical ending to top off 90 minutes of uninteresting schlock.\n\nThe CGI is decent; the robots are believably awesome (if now cliché, having appeared in this form in many films. What are these, rent-a-bot models from a 3-D program?).\n\nBut the film just drags. By the time you're into the 40 minute point you'll be wondering if you should play solitaire on your cell phone to fill in the dull periods while you wait for the movie to get around to the end.\n\nThis is a bad film. Rather than watching this, re-wash clean dishes. You'll accomplish more with your time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "calvin-248-41886",
        "review_rating": "",
        "review_title": "What an abomination!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "msafwannnss",
        "review_rating": "10",
        "review_title": "highlight beauty of simple things, and the beginning & end of artificial intelligence dilemma",
        "review_detailed_main": "It is set at the point in time of the rise of artificial being, and then it is set 5-generation into the future as Earth is devoid of humanity.\n\nAlthough people might be excited & desired to see the first part of the movie for its forward prediction on life & society of the future (which is brief), the second part is secretly & slowly highlight of the beauty of simple things with highly detailed & colourful shot of natures & characters as the character move forward the storyline to end the artificial intelligence dilemma as its closing story arc (and open a new one).\n\nThis is a fresh story as the beginning & end of artificial intelligence rise is referred to by many times in various sci-fi future mythology but never played out, especially in video games."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kashidomar",
        "review_rating": "7",
        "review_title": "Rise of machines with ultimate judgement day.........",
        "review_detailed_main": "In many thoughts this movie is a combined idea of Terminator the Rise of machines and the judgement day. Only the time machine part of terminator is absent here. It also starts with the applied use of a supercomputer to control human beings. But as we know the machines always rise above the humans it is also not an exception.\n\nAlthough many audience find boring to see these type of robotics Sci-Fi as they all share a more or less common idea. The first part of that belongs to the Machines and their domination and the second part reflects the fight back of man. This Sci-fi also goes in the same orbit.\n\nBut some things are different here. It is more concern with human bondage and it lacks of heavy machinery apparatus that frequently unloads the movie. It has made a good combination of action and slow rising tensions between computer and the survivors of human being..So you will not find the movie as only a sci-fi rather it is a mixture of drama, romance and hardwares and softwares also.\n\nThose who like to see Robotics Sci-fi will enjoy it surely. The Terminator series..Ex machina..Blade runner..Robo cop...Cyborg..is these are liked by you then you are the candidate for this movie...Rest of all i am not sure."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "charlesjulien-60824",
        "review_rating": "2",
        "review_title": "Low End, Low screenplay, low everything",
        "review_detailed_main": "Take a bit of Matrix, Terminator, 2 young actors, 1 (normally) good actor (just here to pay the bills), shake well and You'll get Singularity.\n\nJust several problems: screenplay is weak, ugly SFX effects, and the actors have charisma equals to my dog........(an insult for my dog)\n\nForget about this film, and beware false ratings...."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "richard-jelinek",
        "review_rating": "1",
        "review_title": "0/10 This movie is epic ... crap",
        "review_detailed_main": "Unbelievable. I saw an 8/10 and so watched the movie in the hope to see some \"Transcendence\"-sort of making. Cusak in the cast seemed OK ... never felt so betrayed. There is nothing - and I mean literally nothing - that wouldn't be lousy in this movie. The actors, all of them, including but not limited to Cusak look like a bunch of high-school drama group newbies trying to improvise their 1st act.\n\nThe \"special effects\" are really very special, someone probably dusted off an Atari ST just to prove it could be used for SFX in 2017. I will most certainly remember the names Robert Kouba (director) and Sebastian Cepeda (story) and avoid any of their future cinematographic creations like the plague. I recommend you do the same.\n\nHonestly, I am just missing the words how bad this movie is. As a high school movie project this would get an E - best case. This is my 1st review on IMDb ever and I can recommend this movie to serve as one purpose only: torture."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "keith-94487",
        "review_rating": "1",
        "review_title": "Spoiler alert - observing paint dry is FAR more entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Platypuschow",
        "review_rating": "3",
        "review_title": "Singularity: Dead before it began",
        "review_detailed_main": "This is a blatant attempt at beginning a new teen scifi franchise in the same vein as Divergent or the Maze Runners, but thankfully due to how badly this bombed it won't happen.\n\nAlas due to that it means this film is incomplete and that damages an already poor excuse for a movie.\n\nI gave this a chance as I'm a big John Cusack fan but as with a lot of his films lately even he couldn't save it.\n\nIt tells the story of a world taken over by an artificial intelligence and the remaining humans fighting for survival.\n\nThere is a twist, it's just not very good and has been done before.\n\nThe film isn't as smart as I think the creators think it is, it's generic, messy and unlikeable.\n\nThe one thing (Other than Cusack) that this Swiss/US collab has is the leading lady, a Swiss girl by the name of Jeannine Wacker. She was great and despite her not even having a single photo on her IMDB profile I wish good things for her.\n\nThe Good:\n\nJeannine Wacker is great\n\nThe Bad:\n\nPretencious\n\nUnoriginal\n\nOpen ended finale with no sequel\n\nThings I Learnt From This Movie:\n\nWhen people die all they leave behind are their skulls\n\nThe ropes tying him to the tree were about as tight as a Kardashian\n\nMovies need be cornfield scenes\n\nJohn Cusacks career is nose diving faster than a flat earthers argument"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "junk-77343",
        "review_rating": "3",
        "review_title": "Waste of 90 minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gambuzino-whisperer",
        "review_rating": "1",
        "review_title": "Probably one of the worst movies ever made",
        "review_detailed_main": "When I decided to watch this, it had a 7.2 rating. By then I didn't consider that the reason for this score were fake ratings. Why should I? There's John Cusack, and an interesting description. I just went for it. When I started to watch this I couldn't believe it. Most people in this movie did a lousy job, especially the director, screenwriters, actors, special effects team, even make up artists. But the saddest thing about this \"movie\" was seeing a good actor who clearly doesn't want to be there. You almost can hear his thoughts while he's \"acting\": \"What have I done?\" \"Why did I agree to this?\". Finally, it's a very low move to save money that could be spent on the movie, just to buy fake IMDb ratings. Besides being illegal, maybe the quality would have been a bit better, like two stars instead of one. This is only suitable for one of those marathons with friends of the worst movies ever made, to laugh at it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "lower grade B-movie",
        "review_detailed_main": "In the near future, most households have a robot from VA Industries. They produced fighting robots to end wars but are blamed for more wars. In 2020, company CEO Elias Van Dorne (John Cusack) initiates computer AI Kronos and it immediately declares war on humanity as the cause of all of the world's ills. Another 97 years later, Andrew Davis is unarmed and running from a killer robot in a deserted town. Calia uses her last electromagnetic bomb to save him.\n\nJohn Cusack looks tired and old. Of course, we can't be young forever. He's a minor character anyways. He probably spent a day on that set to collect the cheque. Other than Cusack and Carmen Argenziano, these are amateur actors doing most of the heavy lifting. The special effect also looks amateurish with student level work CG. Action often happens with the characters staring in awe at the CG in the distant. Most disappointing is the lack of set design. It's 100 years into the apocalyptic future and the world isn't overgrown. The places look abandoned but only for a few months at most. I don't know anything about the production. The budget is probably too low to make this look good. There are also bad story elements. Calia should have figured something is wrong with Andrew right from the start. It's so obvious that I was waiting for that precise twist to happen. There are countless other problems. This is only a lower grade B-movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ddiorio-06999",
        "review_rating": "1",
        "review_title": "Just plain horrible",
        "review_detailed_main": "The writing of a five year old. Horrible dialogue, unlikable characters. Surprised John Kusack showed up in such a stinker. It was like a bunch of unconnected thoughts tied poorly together.\n\nYou can only called one movie the worst movie in the last 10 years. This is it!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "luigiterra",
        "review_rating": "",
        "review_title": "Shocking and embarrassing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Johnny77794",
        "review_rating": "8",
        "review_title": "MAKE A SEQUEL",
        "review_detailed_main": "Awesome movie! But it really deserves a sequel or/and book"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "antclarke",
        "review_rating": "6",
        "review_title": "Not terrible",
        "review_detailed_main": "Not sure why there are so many negative comments. Not the best film ever by far. But reasonable plot, effective acting, special effects where needed. Overall ok to watch. If you are only interested in mega budget films then you are missing the point. Entertainment is looking for new ideas, seeing new plots, different viewpoints, new actors. Not the same story written over and over again, with the same so called big star actors"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "damirormus",
        "review_rating": "1",
        "review_title": "Do not waste your time",
        "review_detailed_main": "This is my first ever review, and it won't be so much a review as it is warning and advice not to watch this movie. Stupidest and more idiotic movies seen in a very long time. No point in going to details, the people before me already wrote it down... Justin DON'T waste you time on this crap."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "etetik-52731",
        "review_rating": "1",
        "review_title": "Pretty bad movie.",
        "review_detailed_main": "A boring story came with bad acting and nonsense dialog together in this movie. I barely could watch it until the end. I really don't understand, how it's possible for such a bad movie gets this high rating. Don't waste your time with \"Singularity\"! It's a pretty bad movie"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kccaseyca",
        "review_rating": "1",
        "review_title": "truly terrible",
        "review_detailed_main": "Every single thing about this film is just plain awful - the script, acting, sets, fx, literally everything"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "tschickel-51749",
        "review_rating": "1",
        "review_title": "Poke needles into my eyes",
        "review_detailed_main": "Please do that. Scramble my brains. Gouge my eyes. Cut off my hands that operate remote controls. Make me forget I watched this crap movie. Horrid acting, a worst script (using worst appropriately based on this movie's grammar), and a very terrible plot. The singularity here is that all my emotions left me and I now go without. This empty feeling inside the movie part of my soul will never be occupied by anything other than a vacuum. We are all dumber for having watched this...any burnt out principal would agree with me."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "veselina_grigorova",
        "review_rating": "1",
        "review_title": "Why are there no negative values possible for rating this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "joca133-666",
        "review_rating": "1",
        "review_title": "Fake reviews - Evidence",
        "review_detailed_main": "Users marifislam and kAYLE_B appear to be the same, even copy and paste the review of one movie (The Timber 2015) into the other (Nobody's Perfect 2016). There are more very suspicious individuals, most with accounts in Canada and reviews on the same movies. This movie is not even worth reviewing. Stopped midway and only plan to finish if the world gets attacked by AI and I am about to die."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rjsdavis1",
        "review_rating": "1",
        "review_title": "Dire and boring",
        "review_detailed_main": "What goes on in the heads of movie producers & directors these days? Are they so offensively arrogant, that they believe that the cinema-going public will simply lap up crap like this?\n\nDo yourself a favour. If you want to immerse yourself in some quality Sci-Fi, go see Bladerunner 2049 or something old like the Terminator. Avoid this like the plague.\n\nThis is a straight to DVD, afternoon TV Movie quality that is almost entirely as unwatchable in its conception as it is in its execution. John Cusack and Carmen Argenziano at their absolute worst. You two should hang your heads in shame - where's your creative pride guys?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "paulspartalis",
        "review_rating": "1",
        "review_title": "Waste of time!",
        "review_detailed_main": "What a piece of garbage. Really bad acting and the story was really thin. The lead actor where not believable and fell short almost all of the time. Good looking does not mean you are a good actor! It also had a bad story,and that's to bad because it had potentials. Also some bad cuts here and there,for example,1 photo fell to the floor in one scene,the next cut the photo was in the sofa,magic! NOT! Would not recommend it at all, just waste of time!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dan-krol",
        "review_rating": "",
        "review_title": "Ugh...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "marifislam",
        "review_rating": "8",
        "review_title": "Very well done!",
        "review_detailed_main": "I found this film by accident and wasn't very impressed at first. It looked like yet another cheap sci-fi straight to vod production but I didn't really have anything else to do so I rented it and boy was I wrong.\n\nThis film is very well done. The execution is superb and the story is unique (even though the concept is familiar). I love the conflict between the boy and the girl and was hooked from the very beginning! (keep in mind I just wanted to watch and laugh for a few minutes at cheap cgi but ended up watching the whole thing because I was just so drawn into the story).\n\nThe concept feels like something you might've seen before but the film offers so much more than just good looking visuals. It's a story about our own humanity and brings up a very poetic question \u0084Can an artificial intelligence feel love?\".\n\nI don't know where this movie came from and I initially thought it would be complete rubbish but I ended up really enjoying it. I would definitely recommend it!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rutzelb",
        "review_rating": "7",
        "review_title": "A Very Unusual Sci-Fi Story",
        "review_detailed_main": "Around 2020, Elias Van Dorne (John Cusack) has a company that produces military grade robots created by a super computer called Kronos for the purpose of ending all wars. His ultimate goal is for these robots to kill all humans because Elias has decided humans are the cancer that cause all the problems in the world. And this is done and world-wide wars break out all over and humans are killed off. Elias is obsessed with Arora - the last human strong- hold - but he doesn't know where it is, and he sees one human still alive and her name is Calia (Jeannine Wacker) and her purpose is to go to Arora. Elias makes a human machine called Andrew to befriend Calia so she will trust Andrew and take him with her to Arora. Then Elias will destroy it.\n\nElias and his brother Damien (Carmen Argenziano) somehow encase themselves within Kronos and are able to live forever. (How is that possible?) Don't ask, it's complicated. Now 97-years later Elias watches Andrew and Calia travel to Arora. Along the way we see other humans but Elias has no interest in them, but only in Calia and her drive to find Arora.\n\nWell, this is certainly upsetting. Is this the end game for all of us? Debate among yourselves.\n\nWhat will Calia do when she learns that Andrew is a human machine? Remember, we were told earlier that even Andrew doesn't know.\n\nThe only thing I have an issue with is the year that began all this and it should have been started much later than 2020 mostly because of the technology involved. See? (More complications?) Yes.\n\nOkay, more issues: If all humans have been killed off, where did Calia get what looked like new clothes? The buildings still standing looked well kept for the most part. ( Hey, remember that in a dream or now in a Sci-Fi movie anything is possible. Stop being so picky.)\n\nI cannot go any further without giving all away (There's more?) Yes, a lot more. A really big twist will happen and it surprised all of us. Stop it. You will never guess what it is. (Bummer)\n\nThis is a very strange, creative, upsetting and can this really happen in time story? Again, debate among yourselves. (7/10)\n\nViolence: Yes. Sex: No. Nudity: No. Language: No."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "limanac81",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "There are much beater ways to spent 90 minutes of your life then to watch this movie.\n\nMain male and female protagonist should really considered finding a new profession. Acting is not for them.\n\nJohn Cusack didn't need this to be in his Filmography."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "adamberlin-80523",
        "review_rating": "2",
        "review_title": "So bad that it hurts, and not in a cult classic kind of way. If someone offers you $50 to watch it I would ask for a little more.",
        "review_detailed_main": "A numbingly familiar plot line is made to look better next to the abomination that is the 'Singularity's script, dialogue, and acting. It feels less like a movie and more like someone poorly edited together cliché snippets of dialogue from the most trite moments of similar movies. The soundtrack kept me on edge like Comcast customer service hold music. The pallid lighting together with John Cusack's makeup and cosmetic surgery do make him look fittingly non-human, but I think that was only coincidental. Julian Schaffner's performance will make you wonder what casting agent thought he was attractive enough to sleep his way into a role. On the other hand, the with other leading character, it is hard to tell if Jeannine Wacker's performance was consumingly terrible or just poor and struggling against vomit inducing directing and script writing. \"And...surprised look: \"Were you awake just then!?\" ...cut\" The CGI was surprisingly palatable, to those artists; i'm sorry you had to work on this film. I'm even more sorry if you had to attend the premiere only to see your pretty decent work be mixed in with the rest of this cinematic excrement. To give you perspective; I have written and posted my only review ever here since there were none on RT just to save others from being tricked by a popular actor's name into thinking this is a watchable movie. If you like the Walking Dead or War of the Worlds but wished they were more like After Earth and a bucket of poop written by a lazy AI program that strings together movie clichés with poor scene cuts; then you will love this film. I can't wait for a decent movie with an actual focus on the singularity to come along so that this movie can be differentiated as 'Singularity (2017, poop)'. The only redeemable part of the movie is the end when you see that they are setting it up for a sequel, which will give you a good laugh because someone could have actually watched the finished product and still thought a sequel could possibly ever be funded or made."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "lostathome",
        "review_rating": "1",
        "review_title": "The male lead has a designer hair cut in the apocalyps, why????",
        "review_detailed_main": "How does the main lead have perfectly new store bought clothes and a salon haircut????"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "merlijnvh-04224",
        "review_rating": "1",
        "review_title": "Please, do not watch this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kristan-bone",
        "review_rating": "3",
        "review_title": "Artificial Intelligence",
        "review_detailed_main": "Looks good visually, not great, just not bad. Pretty well everything else about this movie was bad. The plot made no sense. The acting was poor. The movie wasn't even enjoyably bad. It was just mediocre and pointless.\n\nNot worth watching."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ratari",
        "review_rating": "2",
        "review_title": "A teenybopper flic, nothing more.",
        "review_detailed_main": "Interesting concept with a seemingly formula production done by committee and reduced to Boy meets girl, blah blah blah."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rogerswjdan",
        "review_rating": "1",
        "review_title": "Exactly like Terminator......if it was poorly written and acted.",
        "review_detailed_main": "Before I talk about this \"movie\" I really need to have this one major question that needs to be answered.\n\nCan someone please explain why was John Cusack wearing lipstick....yes I said lipstick. I'm guessing he doesn't look menacing enough with his bad hair transplant/weave/extensions/dead rodent hairstyle? I should have known to shut it off then but couldn't find the remote, wish I had looked a little harder in retrospect.\n\nThis movie felt like a Asylum version of Terminator, complete with crappy CGI, a plot that seems to go nowhere and main characters that you could care less if they lived or died. Basically think of every cliché hero/villain, every cliché situation those hero's and villains can find themselves and this is what you get.\n\nI genuinely tried to like this movie, even though I should no better by now to skip Cusack's movies, his One Crazy Summer and Gross Point Blank days have long since passed, along with his hairline and good judgement when it comes to taking roles.\n\nReally hoping this truly is a Singularity as I definitely wouldn't watch a sequel."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "omendata",
        "review_rating": "4",
        "review_title": "Like A Scifi Channel Reject - Terminator vs Hunger Games",
        "review_detailed_main": "What is it with John Cusack , he has gone from superb movies to taking any old part that comes along - He has gone down the what i call the Ron Perlman and Lance Henriksen road - ie Brilliant actors who have either gotten too old or just decided to take the money and run and its really quite sad to see such giants of the silver screen reduced to taking turdula like this on. I have to disagree with the one reviewer who has said 2012 and Cell were terrible - they weren't that bad - Cell started well but kinda lost its way and 2012 was a superb film i thought!\n\nI don't know but Mr Cusack seems to have had so many face lifts he actually looks like a woman now as well and he seems to permanently be black boot polishing his hair to keep it from grey. Obviously not growing old gracefully - he actually looks like a bit of a freak now.\n\nThe movie itself; well I was really looking forward to the first full Robert Kouba movie after the most excellent short \"THE RIFT\" and unfortunately we have been sadly let down.\n\nIts as though they spent the budget on the first 20 minutes as it started so well but like so many other movies it just lost its way and the effects became cheap and nasty looking. The story itself started well and then went completely to hell at the end - if anyone has a clue as to how humans or aliens or whatever existed and how the golden city skyscrapers of Aurora was created let me know as it just leaves the viewer saying \"whaaaaat\" at the end - its plain and obvious that they were deluded enough to think at the end that the movie was going to be a hit so left us with the remnants of possibility of a second movie to explain just what the heck the end was all about.\n\nIt was also sad to see so many parts ripped from other movies - my brother immediately pointed out the skulls in the water reminiscent of the original terminator and they actually used the same voice-over telling the tale of the machines destroying humanity almost word for word from the original terminator.\n\nNow here is what gets me - the main actor Julian Schaffner was absolutely the worst i have ever seen , in fact its an insult to call him an actor and quite sad when there are so many other talented young actors out there who could have brought something to this movie - no emotion it was as if he was reading off a card or like many actors like Jonny Depp and Gerard Butler to mention two who have a microphone in their ear and the script read to them - the difference is that Johnny Depp is a superb actor and this guy hadn't even had a full movie under his belt - it also transpires that he co-produced it so presumably mummy and daddy in Switzerland paid for his first movie Jolly - To be fair the female lead was not bad and you could see her trying so hard to battle with the script and awful actor she was with I just felt so sorry for her!\n\nSad also to see Stargate SG-1's brilliant Carmen Argenziano waste his time on this as well. I wouldn't waste your time on this as the whole thing is like some student movie written on the back of a cigarette packet and not a very good one at that. I think that if Robert Kouba had more money and a much better script he would have made a memorable movie; going by his past short films - such a shame for him that his first major movie outing would be so lame.\n\nOne point I would like to agree with one of the reviewers - there aren't many films that are worth a 1 rating (except maybe the exceptionally arty farty Keanu Reeves BAD BATCH lol) so I think most of the 1 ratings are a bit unfair - the start of the film was good and I think they possibly did the best they could with the budget - what cannot be forgiven is giving a non- entity like Schaffner who clearly cannot act the chance so star in this and that is what is unforgivable and worth a 1 - overall its a 4/10 for me. To me 5 is average and 4 is less than average. This is a lot better than some of the movies masquerading as Scifi out there - not many but a few and Robert Kouba does try and do a good job with a smal amount of money - I think the brilliant THE RIFT was made with just $20,000 which always impressed me so in all fairness its not decent to give this a 1 out of 10 that is unfair.\n\nWhat is also unfair are these Chinese and Pakistani review shills - you can actually buy reviews so i have found over on a site called fiverr - its so obvious who these are and why IMDb cannot filter them out is beyond me - let me give an example - reviewer who have been members for a few days and only posted 1 review and its a 10/10 - On here Davelenox from Lugano in Switzerland i presume is Schaffners mum or dad or how about the 1 review 1 days member samuel-93041 who gives it 8/10 - cmon IMDb weed these guys out - no profile - no picture 1 review its not that hard. Although sites like fiverr are now getting genuine members to give good reviews with of course the monetary incentive so i guess its getting harder to weed out the shill reviewers."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mbhlovinca",
        "review_rating": "",
        "review_title": "Slow moving movie. Boring.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ebricca",
        "review_rating": "8",
        "review_title": "quite good for the budget",
        "review_detailed_main": "Thought at first not to watch it .. but worth the time in the end for me .. hence the review the film having started as a kickstarter with later cut in cusack and low production budget as a whole it is a remarkable piece for my taste. true the story has been told before - but after having watched it, even though the storyline seems straight forward - it left me with a better feeling than many recent scifi flics .."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rps-2",
        "review_rating": "7",
        "review_title": "A Decent Exception",
        "review_detailed_main": "I thoroughly enjoyed this film. It is a happy exception to the fact that there is no such thing as a good sci-fi movie. Sure, it's a far out story --- a computer takes over the world --- but many sci-fi classics (books, not movies) have spun even wilder ideas. I can see why the story line might daunt people who don't read science-fiction (my wife, for example, reviled it). But for those of us who do, it was quite in line. There were no gross fallacies or questionable science. Not a classic like 2001. But still a decent evening for anybody who enjoys Bradbury, Asimov and Clarke."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ilikeimdb",
        "review_rating": "2",
        "review_title": "An original plot with so many unexpected twists...not!",
        "review_detailed_main": "Are people really that desperate for apocalyptic sci-fi that they'll sit through this completely derivative schlock? Every single concept has been done before...and better by other movies. I don't want to list spoilers here, but I can certainly reference the movies from which plot points were lifted in whole cloth, particularly Terminator and Battlestar Galactica with a bit of Maze Runner thrown in (and in this plot-blender-omatic, I apologize to those movies I failed to list). It wasn't that the acting or special effects were particularly dreadful or laughable...it's just a pointless, yawn-inducing movie which is why I'm giving it only 2 stars."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "wesbuckwalter",
        "review_rating": "1",
        "review_title": "This movie is an embarrassment to the genre",
        "review_detailed_main": "This has to be a student project. Weak story, horrific acting, 1st year film student level special effects. John Cusack must have owed someone a favor."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dsgoorevitch",
        "review_rating": "1",
        "review_title": "Not quite incompetent enough to be so bad it's good",
        "review_detailed_main": "I've watched about 20 minutes of this preposterously written and conceived turkey, wondering if I should go on. Even the titles, the voice-overs, and the news reader, are badly done. The first shot of a woman in a room with what I take to be our future hero, his mother, I presume, with an oxygen tube, looks exactly like it's shot in the corner of a sound stage. You can almost smell the Klieg lights, Even seated, I'm afraid I might trip over the lighting cables. It's that bad. Now, when Guy Maddin shoots this way. (\"Careful,\" \"The Forbidden Room\"), it's intentional. You're supposed to laugh at these strange cowardly creatures who live as if the world would crash in if they raise their voices. It works as a metaphor. It's all those people who live this way and look terrified if you walk onto a bus without staring at the tops of your shoes.\n\nBut there's no metaphor here. This professes to be the real thing. John Cusack.. What can he be thinking? Does he believe in this nonsense? Does he believe tech people are slightly less than one-dimensional monsters? His performance gives \"wooden\" a new threshold under which to limbo."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "fiftyfins-678-411869",
        "review_rating": "1",
        "review_title": "Wow.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Jacobs43",
        "review_rating": "1",
        "review_title": "Robotic",
        "review_detailed_main": "If you were looking for a movie that shamelessly lifts from sci-fi classics (Terminator/Blade Runner/The Hunger Games) but also provides you with acting more robotic than the actual robots in the film, then Singularity is for you. John Cusack, who is clearly desperate to receive a paycheck, may have actually displayed the most wooden performance of all and in all likelihood shot his scenes in the span of one disinterested hour."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ivko",
        "review_rating": "2",
        "review_title": "achingly awful",
        "review_detailed_main": "Oh John Cusack, what in the hell happened to your career? The fact that Cusack, who has starred in so many movies that I cherish from my childhood, is in this is the scariest thing about this movie. *sigh* Oh well.\n\nSo briefly, this your standard \"computer achieves self-awareness and immediately decides to kill all humans\" cliche. Like Skynet in Terminator but so, so much worse. Every writing, acting and directing choice in this movie is a complete head scratcher.\n\nCusack plays his role without an ounce of emotion or nuance. They might have literally filmed his scenes by FaceTiming with him and having him just read the script over the phone. But he's hardly alone when it comes to horrible acting in this movie; all of the performances are completely uninspired.\n\nMy working theory is that the movie studio actually built an AI and tasked it with writing, directing and editing the movie..It then scanned every television movie of the week from the mid eighties to the late nineties about rogue AIs and decided to approximate the ideas from those films for this one.\n\nThere are tons of plot holes, of course, because the AI didn't really understand what \"humans\" were and guessed that they were kind of like voice emulators that occasionally moved and turned off if hit with CGI bullets. So it got confused and decided that Skynet could turn off 8 billion humans everywhere on the planet overnight, but that the other humans could just escape that...somehow.\n\nIt's explained what happened but not how in gods name it makes a shred of sense. I don't want to spoil it for you, but it's pretty banana-bread bonkers. Unless, as I said, you view the plot thru the \"eyes\" of an AI that doesn't quite get what humans are.\n\nI think the AI also struggled with the notion of the \"real world\", because one hundred years later lawns and buildings are pretty much just the same as they used to be, suggesting that the AI doesn't quite grasp the concept of growth and time. Although I suppose maybe Skynet was sending maintenance crews around to mow lawns and fix roofs and windows and stuff, which was pretty nice of it if you think about it. Gotta keep those property values up.\n\nSo in summary the AI made the humans move around a little and say things, mostly dialogue from other movies I'm guessing, and would occasionally turn them off with CGI bullets and explosions until there were only a few left. Then some other stuff happened, I think.\n\nOr something like that. I don't know, I stopped watching around 25 minutes, flipped ahead to see how it ended, then watched High Fidelity and felt very old and sad."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "josenelias",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "carlsonj-4",
        "review_rating": "1",
        "review_title": "Rotten",
        "review_detailed_main": "A complete waste of time. The plot makes no sense and goes nowhere. Why would anyone make this dreck? Why would anyone agree to be in it? Having filmed it, why would you edit and release it?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ryan-399-310572",
        "review_rating": "10",
        "review_title": "I understand that this movie is Low Budget, but hear me out...",
        "review_detailed_main": "I get what everyone is saying. \"How can a movie like this exist?\" \"Why would they make it?\" \"Everyone looks too healthy...\" Etc...\n\nListen. If you like sci-fi movies that are very interesting and keep you around because you must see what happens next, then this movie is perfect for you.\n\nYes it is low budget and the acting is not the absolute best, but look past all of that. This movie is so interesting and I loved the ending! It really makes you root for the main characters to do whatever it takes to reach Aurora.\n\nAnd did I mention that I loved the ending? I really felt like I was a part of the story.\n\nMovie snobs will never give this a chance. But if that is not you, then go for it! I'm very happy I did and I hope they make a sequel."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "genesis-273-442419",
        "review_rating": "7",
        "review_title": "Good but needs more thought",
        "review_detailed_main": "This movie has great potential. It felt more like a tv pilot then a movie. Which I think I would have been a great tv show. It ends abruptly like a show that gets canceled halfway into a season. I don't feel like it's a bad movie just rushed and a bit out of order from here to there and back again. Not really connecting the dots"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "europa-69164",
        "review_rating": "1",
        "review_title": "Wow - disappointing would be a step up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "grapes786",
        "review_rating": "1",
        "review_title": "This movie is embarrassingly bad",
        "review_detailed_main": "The only way this movie can be enjoyed is with a few pals to get to together for a laugh, this film is totally game to be torn to peices. Funny acting, funny script, bad concepts, this needs to be taken to the cleaners by anyone who watches this."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "fytprg",
        "review_rating": "2",
        "review_title": "this is a pretty horrible movie",
        "review_detailed_main": "The acting is poor. the kids do their best but....they fail. script is from the 60's. main girl is a rip off of hunger games. they never even get dirty in all their adventures.\n\ni gave up half way through."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Leofwine_draca",
        "review_rating": "2",
        "review_title": "Pitiful",
        "review_detailed_main": "An absolutely pitiful indie sci-fi drama whose merits, or lack thereof, become clear when examining the origins. This was originally a low budget Swiss drama about a young couple making their way through a devastated landscape towards a place of safety. Later, the film was brought by an American company and new scenes involving a cameoing John Cusack and a robot apocalypse were added. Needless to say the two elements don't gel and both are awful anyway."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jmail-992-72831",
        "review_rating": "4",
        "review_title": "Nice haircut",
        "review_detailed_main": "Apparently Kronos didn't kill the barbers because Andrew has a pretty fresh haircut."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ghamiltonsq",
        "review_rating": "1",
        "review_title": "How many ways is this movie bad?",
        "review_detailed_main": "Let's start with John Cusak who emotes as if he just graduated from a mail order acting school, which perhaps is only appropriate given that he mailed in his performance. We can add that the plot is totally simplistic and the presentation is totally devoid of suspense and drama. The two young members of the cast were earnest enough and no doubt felt as if they were contributing to a watchable movie as they labored before the camera, but sadly their contribution was totally misplaced and seemed to belong in a different movie altogether. Movies like this one give you reason to be thankful for streaming. One can fast forward and learn almost immediately that this effort is not worth your effort. Imagine having to sit in a theater and being forced to learn this minute by minute."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "phenomynouss",
        "review_rating": "1",
        "review_title": "stupid",
        "review_detailed_main": "Apparently everyone else got to this one before I did. I figured if it showed up on Netflix and has John Cusack phoning it in, it must at least be worth a bit of dumb fun. I actually marginally enjoyed a similar kind of movie that appeared on Netflix starring Lee Pace as an American mercenary in an African country when an alien invasion happens.\n\nBut this one is just stupid. Flat out stupid. Even by the lowest of low-budget standards, this is stupid. This is 4th grade sci-fi stupid. This is too stupid even for that. It was so stupid I couldn't get more than 20 minutes into it.\n\nFirstly, the movie sets us up in 2019 where there are helpful robots everywhere from a corporation run by John Cusack's character, while he one night ominously decides to run Kronos, the first ever AI. to absolutely no surprise at all, Kronos awakens, and apparently decides, in it's dime store 5th grade sociology wisdom, that \"there's a problem with earth, and the problem is humans are bad and dumb and must be destroyed using nuclear weapons in order to save earth\" because we all know when you need to exterminate termites or cockroaches from your house, the best method is to take a sledgehammer and smash up all the walls and floors.\n\nnext, we're shown that John Cusack and his sidekick guy are actually AI beings themselves, in human guise, which kind of renders the whole Kronos gimmick pointless since they are already AI and have already made the decision to end all human life on earth, so why even bother making a show of this brand new first ever AI? Why even tell any of the humans?\n\nall of this is relayed in a numbingly monotonous exposition dump voice-over from an actor who turns out to be a complete ripoff of Katniss Everdeen from the hunger games when she arrives, and is unbelievably badly acted. Not even badly acted to a degree that it is fun to mock, but just boringly badly acted. she announces it is 97 years later and earth sucks now\n\nthe other element added in is some random teenaged boy in his mid-20s who somehow managed to survive the initial apocalypse and is now inexplicably wandering around 97 years later. But this is helpfully explained by John Cusack and his sidekick that this guy is secretly a robot like them, completely indistinguishable from human, who ALSO is unaware he's a robot!\n\nCaving in like a wet cardboard roof is; if this kid thinks he's human HOW HAS HE BEEN LIVING FOR 97+ YEARS WITHOUT AGING? On top of this stupidity, he gets attacked by a random robot and escapes, and the sidekick pointlessly asks John Cusack why he sent the robot to attack him, and John Cusack says so Katniss can trust him, implying that him being a human wandering around on his own post-apocalypse where robots kill all humans on sight isn't enough to get her interest.\n\nMAYBE she has experienced androids in human disguise at some point and so now can't trust all humans, but this was not mentioned in the minutes leading up to or coming after this, and at that point around 20 minutes in I just flat-out gave up on this stupid pile of stupid and ended it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "a_person_u_know",
        "review_rating": "2",
        "review_title": "who greenlight this script?",
        "review_detailed_main": "Are they just giving away money to anyone to make movies now? if so can i get on that list plz. I knew the ratings were bad when i started to watch this movie, but that is usually the case with B-rate scifi movies, which then usually turn out to be great in my book. This was a waste of time, nothing about this movie was even remotely interesting"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gbm6631",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "First movie that Netflix can make a trilogy. Why are people so harsh on a great script! Can't wait for a sequel!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Freedom060286",
        "review_rating": "7",
        "review_title": "Not So Bad",
        "review_detailed_main": "Although there are some imperfections in this movie, and it's true that John Cusack is not convincing in his role, overall it's not a bad movie.\n\nI enjoyed the visual effects, and some of the acting was very good, especially by Jeannine Wacker as Calia."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "quijohnjinn",
        "review_rating": "1",
        "review_title": "Absolutely awful",
        "review_detailed_main": "This is by far the worst movie of 2017. Just don't watch it, it's a waste of time!! So many mistakes and dumb actions. Casting is awful. the story is probably written by a child. I just cannot believe that this movie is made in 2017, well if you watch this movie you will remember this review and agree."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "walleye-42537",
        "review_rating": "3",
        "review_title": "This movie could have EASILY been an 8, but it WASN'T",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "pdxserver",
        "review_rating": "4",
        "review_title": "I mean...I finished it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mealosculpa",
        "review_rating": "5",
        "review_title": "A 22 years old director's first film with $100,000 budget",
        "review_detailed_main": "Indeed it could have been better, but come on, it is just an amateur effort of a young fellow on a miniscule budget."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "denatheist",
        "review_rating": "2",
        "review_title": "bad bad worse",
        "review_detailed_main": "Just to say it out loud and clear ; 'Don't watch that movie.It's a total waste of your valuable time.The story is none to nothing.....oh! We have an AI that's killing all the humans on the planet....seems to me that movie makers are stuck in an eternal loop of the same 'sh...'.And then there was the acting....oh my god.....it was so awfully bad.Julian Schaffner should stop acting and start a career at MC Donald's....would be better for him and for us.Don't let you fool by the rating.....believe me just don't watch it.!!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "lordzedd-3",
        "review_rating": "1",
        "review_title": "I'm not surprised this movie is from Switzerland, it's cheesy and full of holes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "astroian",
        "review_rating": "3",
        "review_title": "Lacklustre performances make for painful viewing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "thethomasboy",
        "review_rating": "3",
        "review_title": "Singularly Disappointing",
        "review_detailed_main": "A slick but empty YA dystopian film with 'borrowed' themes from far superior Sci-Fi like Blade Runner, The Matrix and even Planet of the Apes. The opening production value and John Cusack's presence lend the film enough credibility to lure you in, then quickly flounders into poor melodrama with even worse writing.\n\nIt feels like a film that had a story and vision at one time, then found itself over-budget and went into turnaround. Over eager Writer/Director Robert Kouba clearly focused on the opening and conclusion, putting everything into the special effects and even a soundtrack by members of The Crystal Method. Suddenly with no money left, and little more than a student film reel in the can, Kouba roughly stitched together some nonsensical plot points with flat characters and even flatter acting to fill out the 93 minute runtime.\n\nThe ultimate tragedy is that it clearly sets up for a sequel, so it feels less like a complete film than a bloated trailer to some yet-to-come flick. I dare say that film isn't coming and I hope you already cashed that paycheck, John."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jtj980005",
        "review_rating": "8",
        "review_title": "I liked it.",
        "review_detailed_main": "So many negative exaggerations....I personally liked the movie and I think it leads perfectly into the option of a sequel. I don't know what more to say except watch for the movie it is, not the movies it isn't. In other words, don't compare it to another movie. The girls accent is very choppy but I think that's just the way she speaks and I actually came to enjoy listening to her. I enjoyed the movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "deeareare",
        "review_rating": "5",
        "review_title": "Disappointing",
        "review_detailed_main": "It says more about John Cusack's career than anything else that he's punched out around 10 minutes of acting on a green screen to give this thing some cred. The writer director had success in the short film market - who doesn't - but can't maintain the rage, much less the conceptual content past the 15 minute mark. With too many references to other movies, there is hardly one original idea here. You sort of hope that in this nice looking but otherwise wretched thing there is some hope - perhaps it is a movie about the human condition, or the potential down side of AI, or - who really cares...\n\nThe production values are good - very good - and that is what kept me watching to the end, but the dialog, story and concepts are ordinary, a blend of things you've seen and sad...in that order.\n\nI have a very simple scoring system - under 5 is some variation of I wish I'd seen something better - 6 is good, 7 is i'd recommend and above that we're moving into the great movies - this is a 4.5 - I rounded up because i'd seen some good movies this week."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jkmangrum",
        "review_rating": "1",
        "review_title": "No",
        "review_detailed_main": "Just no. I made an account only to say NO. I have watched movies to kill time a million times that have no plot, budget or cgi. This movie is Terminator Salvation, if everyone on the crew was in a highschool AV club."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bgsdwd-90-931259",
        "review_rating": "1",
        "review_title": "This is Trash",
        "review_detailed_main": "So horrible graphic, please do not watch this movie or your eyes will burn. Watch any other movie you haven't seen yet but please, skip this one. Special effects are dire - in the opening scenes burning buildings look like someone went mad with the Photoshop clone tool. Explosions don't cast any light on objects that are close by and clouds of dense smoke don't cast any shadows and dissipate in moments leaving no trace. Enormous bots appear to defy the laws of physics and move through dense forestry without causing a single tree to move. Lighting.... I mean really.... what is happening with the lighting? In a dark and dingy forest, and it looks like two blazing follow spots behind the cameras.... just cheap and nasty."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "flyelectro",
        "review_rating": "1",
        "review_title": "\"Terminator\" at \"Bladerunner\" speed, written by the writers from \"Lost\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "michael-v-hammond",
        "review_rating": "1",
        "review_title": "I hope agents were fired",
        "review_detailed_main": "John Cusack and Carmen Argenziano are seasoned mainstream actors. I hope both of them fired their agents for allowing them anywhere near this worththless film."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "DaveMcG89",
        "review_rating": "2",
        "review_title": "Just watch 2004's iRobot",
        "review_detailed_main": "This is just awful...\n\nweak story, weak SFX, weak characters...\n\nNow I have to come up with more to say about this...\n\nThere are some idiotic plot twists but above all the CGI is so bad it breaks any immersion possible. now if this were some student thesis film with graphics made on a laptop I could understand but how bad is John Cusack's Alcohol problem if he let this piece of rubbish have his name on it..."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "tfminfl",
        "review_rating": "1",
        "review_title": "249. Singularity.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "Start me up",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jmjhfamily",
        "review_rating": "10",
        "review_title": "Excellent Movie!",
        "review_detailed_main": "Singularity is a great movie, loved it! Please do a sequel!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dzastinrpatnsn",
        "review_rating": "6",
        "review_title": "Not as bad like everyone is saying",
        "review_detailed_main": "To be honest this movie isn't that bad! The choice of cast is a bit off and John Cusack acting was a little off as well but I blame the Director and the script writers. Because this movie just had like a twilight/hunger games/terminator feel to it and I think that's what made this movie bad.\n\nThat human love story with some other fictional characters died after twilight and all the copycat tv shows like vampire diaries. The acting wasn't all that bad, it just didn't really have an honest storyline but the concept is there! This movie probably needed a little more thought and time to it because I believe they rushed the movie so they can put it out there ASAP. The copycat twilight love story is the down part to this movie.\n\nI've seen worse movies with horrible actors and low budget qualities and tbh the main guy is kind of cute. The girl is kinda mediocre and John Cusack DID NOT fit that part so Maybe if they got an A-list actor to play either the girl or the guy or if they took a little more time with this movie, it probably would've helped this movie because it does have potential.\n\nOverall it's not a completely bad movie or the worst movie like some of these comments! 5.6/10."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "darbyl",
        "review_rating": "1",
        "review_title": "Easiest money John Cusack ever made",
        "review_detailed_main": "Awful is an understatement for this movie. Cusack literally stands or sits in one spot the entire movie. He looks strung out, too. The whole thing just doesn't make any sense. He's monitoring the two main characters (the most generic, boring male protagonist in recent memory and a blatant Catniss Everdeen ripoff. Seriously, it's not even subtle) the entire movie. He looking at images of them from directly in front of them, eye level, and all around. One shot is a close up. I mean, how is he getting these images without a camera? Or are the two main characters completely oblivious? The whole thing is laughable. The funniest thing to me is the ending is an absolute set up for a sequel. There's no way in seven hells that this should have a sequel greenlit."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "KrissAnd159",
        "review_rating": "3",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nikita4777",
        "review_rating": "3",
        "review_title": "I still had hope",
        "review_detailed_main": "... but it died very quick. All the bad comments are true."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "belinjerome",
        "review_rating": "1",
        "review_title": "That's nothing lower than a one so there you go",
        "review_detailed_main": "First thing so what it was a bad movie and the acting as painful as untreated hemroids. I can not have children after having watched this movie. But what is worse is they tried to setup a sequel that means they thought they something that would not strike those who see it dead and any that survive blind and depressed. I never thought about self harm until now."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "aprilhill-00731",
        "review_rating": "1",
        "review_title": "I made an account just to give this movie 1 star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "skindas",
        "review_rating": "1",
        "review_title": "Worst film of 2017 !!",
        "review_detailed_main": "I wouldn't bother watching this, it will only hert ! In as much you'll never come to terms with yourself for allowing yourself to watch it till the end . Utter Rubbish."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kenyae-cagle",
        "review_rating": "3",
        "review_title": "Corny as I don't know what",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "balaamdebbie",
        "review_rating": "3",
        "review_title": "Good Grief!",
        "review_detailed_main": "Is this all John Cusack can get now? Don't recognize any of the other actors. That is not surprising really because such a cheap film. It is obvious they have taken bits from blockbuster sci-fi films and twisted them a bit to make this film. Female lead reminds me a bit of Gemma Arteton."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kAYLE_B",
        "review_rating": "10",
        "review_title": "Like a very fine Twilight Episode",
        "review_detailed_main": "This is a well paced, well directed, reasonably well acted and entertaining movie, who would've thought? From the story description one might think this is another cliché commercial movie and I must confess that I was not too interested to watch this movie because I expected just another special effects circus. However, as I am a big fan of Science Fiction movies, I thought I would give this film at least a chance. I must say that despite the trailer and some other comments here you will discover a very tender film about remaining good despite living on a destroyed world.\n\nThe young actors Andrew and Calia might not be at A level yet but their performance is good enough to let you feel the basic story of friendship and trust. Cusack and Argenziano play their role well and are a good contrast to the young actors. Overall I would recommend this movie to everybody who is interested in watching a film that is more than just special effects. This is definitely not another Terminator movie but more of a very fine Twilight Episode. My final rating: A+"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "shell-24660",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Everything about this film is truly depressingly bad-which is a shame as amongst the mess are some interesting ideas. At least Jeannine Wacker can act, but the rest of the cast? Ouch. I'm not sure who JC was thinking, and the male lead looked like he'd just stumbled out of acting school (after failing). Avoid."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ayoungad",
        "review_rating": "2",
        "review_title": "Just Bad",
        "review_detailed_main": "This movie is just bad. It has a similar plot to Terminator-Salvation, just less believable. Yes that's right Terminator-Salvation has less plot holes and better character development. Acting is just plain bad. For 97 years after the apocalypse everyone seems pretty naive about survival skills. It's a waste of time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nomdeplume-14248",
        "review_rating": "1",
        "review_title": "This movie is embarrassingly horrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rolandkreml",
        "review_rating": "1",
        "review_title": "John Cusack's career has jumped the shark",
        "review_detailed_main": "I watched this because of John Cusack. He has been in some interesting movies. So many holes in this story. So many jr high play \"what's my line\" pauses. So many inconsistencies. Fight scenes made WWE look real. 2 minutes in I wondered what am I watching. I watched for another 30 min to let it develop, but then realized this is simply bad and getting worse. Could not believe it had a 4 rating. 4 says it has some promise. This a Singularity turd deserving of a single star."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "username-madison",
        "review_rating": "1",
        "review_title": "Oh just bad. Waste of time.",
        "review_detailed_main": "I was a little mad when I finished the movie that I could have spent that time watching literally any other movie. It's really bad. Would not recommend. I could go into why but basically I'm here to tell you don't waste your time. Watch something else. Sorry. But also you're welcome."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "patrickslusher-60547",
        "review_rating": "4",
        "review_title": "\"You're the most dangerous thing that's ever existed. ...I'm leaving.\"",
        "review_detailed_main": "I don't understand all the negative reviews on here...I'm going to be a lot more charitable. Because it's obvious that the kids from the high school film class that somehow scored a hundred thousand dollar budget (and spent 98,000 of that on John Cusack) to do this class project have got enormous potential."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "siegelross",
        "review_rating": "1",
        "review_title": "More Netflix trash",
        "review_detailed_main": "Bad movie, don't waste time. I read some reviews and now I am positive IMDb has fake reviews. Not sure how much extra money the film makers get by putting effort into boosting ratings untruthfully but it would be nice if they just made a movie to be proud about. Bad acting and bad cgi. Only thing good is the baseline of the story."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "deputydog-64814",
        "review_rating": "3",
        "review_title": "Save an hour and just watch Terminator....much better than this!",
        "review_detailed_main": "I watched it because it had John Cusack in it...boy was I wrong to waste my time by watching the entire show. I always think that a movie will have at least some redeeming qualities but this one really disappointed. VERY slow and the script had to be written by a teenager because the dialogue was boring and very predictable. Come on John!...you don't have to star in movies like this, you're better than that!\n\nIn the end it was a mix between Terminator and iRobot, just not in a good way. Even for a poorly scripted movie you always hope at least one of the characters steps up and brings a little light to the stage...not in this movie. All the actors, including John deliver performances that equal high school drama. (Trying hard but not pulling it off...) I generously gave it 3 stars since the computer CGI was fairly decent and the robotic machines looked pretty good. At least the animation guys did their job!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bobprophette",
        "review_rating": "10",
        "review_title": "Are you insane?",
        "review_detailed_main": "I logged on to IMDB to see who the director was and could not believe the user reviews. I can only assume you are all retarded/jaded by TV. This is one of the best sci fi movies I've ever seen. When I want to watch something Sci fi ts a toss up between this and THX 1138.\n\nIt a amazingly atmospheric movie 9 (an awesome soundtrack). You make up you own minds but I would never discourage anyone from watching this movie. And to the guy who asks \"where is the singularity?\" Enjoy you're pointless pedantic experience of life. I hope you are part of the billion the film predicts are wiped out.\n\nWho cares if the characters look good. suspend you disbelief for F's sake and engage wtih the ideas.\n\nB"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ten-thousand-marbles",
        "review_rating": "3",
        "review_title": "Another \"it could have been good\" movie",
        "review_detailed_main": "A billionaire mad scientist (I guess) decides the human race is a bad thing. He attempts to erradicate people and replace them with machines and computers. Not all that original. John Cusack has done some great movies. This isn't one of them. The only thing that saves this film from being a complete steaming pile of crap is the cinematography. The story, script and acting are all pretty awful. I hope the kids are planning on college and real careers."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "vikosu",
        "review_rating": "2",
        "review_title": "....seen before...",
        "review_detailed_main": "The kind of movie you half watch while playing games on your phone or cleaning up around your apt/house or....while writing a review, like this one. It's odd seeing Cusack in this kind of role, not a believable or convincing bad guy. File this movie under been there/done that."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Katie985",
        "review_rating": "2",
        "review_title": "Horrible acting. Awful storyline.",
        "review_detailed_main": "This is some of the worst acting I've have seen in some time. The story line is awful. Why John C would agree to this movie, I haven't a clue. I get he is taking his cue from Nicholas Cage."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "robtbowers-75721",
        "review_rating": "1",
        "review_title": "Terrible acting",
        "review_detailed_main": "The acting and the movie was just terrible. It was like watching paint dry."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "BobRed",
        "review_rating": "3",
        "review_title": "Plot-hole-palooza",
        "review_detailed_main": "The acting wasn't bad. That's my glass-half-full perspective. Netflix had this rated 4.5 stars, so I thought I'd give it a try. The story was bad. Not the worst ever to be certain, but it was predictable, and the one big twist at the end made no sense whatsoever. The direction was the worst part. The most glaring miss: After 100 years of humanity being hunted to extinction, two of the last survivors have perfectly coiffed hair and clean clothes. I thought about a drinking game where you do a shot every time you see a plot-hole, but it you'd have alcohol poisoning in the first 30 minutes."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "madalinpaull",
        "review_rating": "1",
        "review_title": "Worst movie of all time",
        "review_detailed_main": "You can use this movie as a torturing device...waste off life."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "playingisgame",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Bad just bad. I watched it cause it was interesting to see how much worse it could get."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "waterdr",
        "review_rating": "1",
        "review_title": "Don't. Just don't....",
        "review_detailed_main": "This movie is so bad I can't even justify taking the time to write a complete review. Besides it would take far too long to point out all the faults of this movie, but on the other hand it is easy to point out the positives. There are none."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "sudheerrao33",
        "review_rating": "8",
        "review_title": "Not bad at all",
        "review_detailed_main": "Singularity is a science fiction film with an eerily dystopian feel, directed by first time director Robert Kouba. It promises the world but does it actually deliver? I believe so. It could've been better if the concept was more unique, and the casting was better but doesn't that happen all the time? I was entertained and it left me wanting for more.\n\nThe film moves at a good pace, and the performances given by the main actors are believable and engaging. If you want to enjoy a good indie sci-fi you will find this a perfectly pleasant way to spend a couple of hours.\n\nThere was enough of action and intrigue to keep me focused for the duration of the film, and I was actually a little disappointed when the credits rolled. The actors, who to be fair are mostly a bunch of unknowns gave performances to be proud of, and you could feel the drama in the air, even when they would have undoubtedly been acting against the backdrop of the good old green screen.\n\nWould I recommend this film to a friend? Well provided they enjoy movies in the sci-fi arena I certainly would suggest it as a great way to spend an evening. While it is far from Oscar-winning, Singularity is an enjoyable fun romp into a broken world."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "onesleekcat",
        "review_rating": "2",
        "review_title": "C rated version of Terminator Salvation",
        "review_detailed_main": "Gets two stars only because it wasn't that long. Stupid story line, bad acting and a waste of time. Stupidest thing of the movie? They come across other human survivors who actually look like dirty, unkempt and like they live in that one set of clothes 24/7, but the two main characters never get dirty even though they've been going through the woods, wading through nasty water and sleeping on the ground for days in the same clothes. The female lead even has rings on her fingers and never a hair out of place...lol. The male lead always has a stupid wide eyed look on his face. Netflix get your own stories and stop making horrible imitations of the real ones. Like I said, C rated...it's so bad it surpasses bad B rated movies...enough said."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "lucas739",
        "review_rating": "3",
        "review_title": "Wiffy!",
        "review_detailed_main": "You know the time when you've been forced to use a Portaloo in the middle of summer, straight after someone who's had a massive dump, you remember, the smell, the heat, the flies and the warm seat, well that's Singularity right there. Well it would if you added in the fact that there was no paper left!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bangus81",
        "review_rating": "1",
        "review_title": "On your marks, get set, TERRIBLE!",
        "review_detailed_main": "I occasionally intentionally watch a bad movie just for fun. This took the fun out of that fun! Do you believe in miracles? I do now because it's a miracle that this ever made it past being a script. Can't wait for the sequel!!!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mike_dunphy",
        "review_rating": "1",
        "review_title": "Came here just to warn others",
        "review_detailed_main": "Came to IMDB for the sole purpose of rating this horrible mess of a movie. The worst dialogue and delivery. Cusack needs an intervention. Even he managed to be as horrible as the other actors, which wasn't an easy job. Truly cringeworthy in every respect."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "The-Lobstrocity",
        "review_rating": "4",
        "review_title": "Terminator Anyone?",
        "review_detailed_main": "Simply put, I can't grasp how this attempt at a film wasn't litigated against for, at the very least, cherry-picking the entirety of Terminator: Salvation's plot. Cash your check Cusack, while we sit back and laugh at your lack of integrity and creative impetus."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mfruik",
        "review_rating": "1",
        "review_title": "The entire movie was ruined by....",
        "review_detailed_main": "The first ten minutes when the main female role should have said \"hey, where the hell are you from and why don't you act like a human should act after 97 years of robot domination? Were you resurrected? Did you come from a cryo tube? Because you're making mistakes that a toddler wouldn't make for fear of killing literally everyone...\" I tried to make it past the first twenty minutes because of the main actors, but they screwed me."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "randrewvaughan",
        "review_rating": "1",
        "review_title": "So unbelievably bad.",
        "review_detailed_main": "Picture this: An eight foot tall Spanish speaking magician forced its way out of your belly button and, as you writhe in agony from the gaping hole in your gut, begins aggressively to persuade you to be the volunteer of the lamest and longest series of card tricks you'd ever muster patience for, but you stick around because John Cusack. This magician experience is more enjoyable and less confusing than the steaming pile of elephant snot Singularity turned out to be. I created an IMDB account solely to find a way to voice my dislike for this movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bemyfriend-40184",
        "review_rating": "3",
        "review_title": "Destroy All Humans! Destroy All Humans!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ASItranshuman",
        "review_rating": "9",
        "review_title": "Great low budget movie",
        "review_detailed_main": "Listen, this movie has great special effects, the acting was okay. Sure, it had some moments here & there that could use a lot of improvements, but so do most movies. It's not a Star Wars budget movie. I truly have to wonder about the stream of 1 ratings. Who are these people? Perhaps religious extremists who can't accept the thought that AI/AGI/ASI will one day surpass humans in thinking ability & kindness such as Andrew, the teenage boy. Anyhow, those ratings are uncalled for. Shame on those people."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "puterfeller",
        "review_rating": "2",
        "review_title": "Bad, just bad...",
        "review_detailed_main": "So most of mankind is wiped out by a crazed tech inventor and his creation, Kronos. Pick up the story 97 years later. Ok, so when the characters cross an old railroad track in the woods, there's no 97-year overgrowth. Searching through an old home, not a speck of dust or cobwebs to be seen. Are the machines mowing the grass? Dusting the houses?\n\nWho thought this film through? Aren't there production people that set up a scene for a shoot? I think they were out that day, the entire shooting schedule. I'm fairly certain most 2nd year film student could have done better.\n\nBad, just bad"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "michaelRokeefe",
        "review_rating": "3",
        "review_title": "Ninety-nine % of the human race is dead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "indridcold-01255",
        "review_rating": "4",
        "review_title": "You're tearing me apart, Gliese!",
        "review_detailed_main": "This film is pretty bad. ... I watch movies of all sorts, all genres, including so-bad-they-are-good movies, doesn't matter the country. I am by no means an expert, but, I do have a little bit of an academic background, having taken some film studies courses in college (covering American film and European film). And I've been exposed to some highlight Bollywood movies, and highlight Asian films (mostly Korean and Japanese films, because I spent some time there.) So, I have a good, broad grasp or sense of knowledge of world cinema in general.\n\nFor the best of the worst in horror / fantasy, there are the American treasures 'Plan 9 from Outer Space' and 'Troll 2', and the South Korean 'Dragon Wars: D-War'. For drama, there is Tommy Wiseau's 'The Room'...\n\nThis movie is enjoyable in the same vein as these aforementioned gems. It is filled with confusing storytelling, inconsistencies, or at least not-so-believable situations or plot, pretty bad special effects, horrible dialogue, possibly intentionally bad acting, and just plain, blatantly ripped-off elements from other movies. And they pronounce 'Gliese' wrong; it is pronounced 'GLEE-zuh' or 'GLEE-suh'. ... I enjoyed writing my clever title for this review. I highly recommend taking an ambien tablet (or whatever your drug of choice may be) and watching this."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jessinthecityy",
        "review_rating": "3",
        "review_title": "Hunger Games meets Terminator meets Divergent, not in a good way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dingane",
        "review_rating": "4",
        "review_title": "Why does Netflix keep giving garbage movies 95+%?",
        "review_detailed_main": "I'm going to be honest. I watched about 30 min of this movie. It's a decent premise with a C- execution. But my real question is why Netflix keep trying to tell me that I'd like garbage films. The Rift was the most ridiculous (you can see my review of that). It's definitely one of the worst movies I've ever seen and Netflix gave it a 97% for me.\n\nThis film just has a hackneyed plot, is poorly acted (except for John Cusack who is fine), and has really poor writing. You always know a story is going to suck when a voice over has to tell you what the story should be showing you.\n\nBut seriously, Netflix, your algorithm used to be fairly decent. Now I feel like its trying to make me watch garbage and convince me to like it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "wyckedhart",
        "review_rating": "1",
        "review_title": "You made me watch THAT with my own 2 eyes?",
        "review_detailed_main": "If this movie were graded like a college research paper the writer would be expelled for plagiarism. They are trying so hard to cash in in the popularity of the Hunger Games they forgot to have anything be original. I will be surprised if there are not lawsuits filed. Yes, it's that bad.\n\nI can forgive bad special effects if the plot and characters are good. Nope. Not in this movie. It's just dismal beginning to end.\n\nThis is my first and probably only review of a movie. Save yourself and go take a nap instead."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "lorantmathe",
        "review_rating": "1",
        "review_title": "Either a joke or rather an insult to SciFi movies",
        "review_detailed_main": "The only interesting part of this movie is its title. Rest: weak copy of the Terminator, where you really wonder how could John Cusack give his name to it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "arfdawg-1",
        "review_rating": "1",
        "review_title": "OMG! Looks like it was Made for 10 Cents!",
        "review_detailed_main": "The guy who said he registered with IMBD just to counter all the fake glowing reviews is right! This is a horrible movie.\n\nCheaply made like a bad TV movie on SYFY\n\nThe acting -- from seasoned actors no less -- is abysmal. It's as if they just needed a paycheck and they walked through with no care.\n\nThe writing is moronic. Over the top drama that makes no sense.\n\nThe music is a half step above porno music.\n\nThe special effects are laffable\n\nAnd direction? What direction? I've seen Youtube videos that were made better.\n\nPut more simply, there is NOTHING to recommend about this movie. NOTHING"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "thedsm",
        "review_rating": "2",
        "review_title": "Boring",
        "review_detailed_main": "I slept through a lot of this film as it failed to grab my attention from the start. The bits that I did see managed to combine being predictable with being pedestrian.This plot has been done before and far better and I rather wish I'd watched a Terminator instead. There were a few nice (but fairly low budget) effects, but not enough to offset all that wooden acting."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "djkaine",
        "review_rating": "5",
        "review_title": "Given it's a first",
        "review_detailed_main": "Given it's the first feature this kid (the director) has made, I'll give it a five... no one really starts out at the top of their career. Probably funded it himself."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jeffmcclainboise",
        "review_rating": "1",
        "review_title": "I registered on IMDB just to leave an appropriate review for this garbage..",
        "review_detailed_main": "Disgusting. Horrid acting. Appalling script. Millions of holes and now coherence. Junior High drama school could do a better plot and film."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "emanueldarlea",
        "review_rating": "3",
        "review_title": "Just a bad terminator basically",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "lolly67",
        "review_rating": "1",
        "review_title": "NOT EVEN 20 MINUTES IN...",
        "review_detailed_main": "...AND I HAD TO TURN IT OFF.\n\nI wasn't at all sure which movie it was they were copying. It was so hard to watch"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "svhot",
        "review_rating": "5",
        "review_title": "Interesting Concept, but the story & screenplay are not fully developed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jimbo-53-186511",
        "review_rating": "1",
        "review_title": "Like watching paint dry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "snen",
        "review_rating": "1",
        "review_title": "Horrible Script & Acting",
        "review_detailed_main": "What a terrible script.. it starts off so choppy with the most cliched dialogue and plot ever (and that continues throughout the whole movie), no lead into what should be a devastating action scene, and no emotion to back it up. Hilarious product placement. Cusack is the only actor in the film that we know can act, but he doesn't act in this. They don't even bother buttoning up his suit properly, and then it cuts back to him with it buttoned. I was really sad to see him in this; it's a real low-point. He must really be in debt or something to be willing to embarrass himself like this. I would not be in this, and I've made a lot less money in my life than him!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "unrealwicked",
        "review_rating": "1",
        "review_title": "money back PPS",
        "review_detailed_main": "worst movie in mankind history to ever hit the theaters.\n\nHalf of the cinema fled outside before 30 minutes.\n\nSpecial effects made on Iphone app or so :( just Pathetic ! How did john put his name in this? Actors..like from B grade acting schools.. Money back from cinema ticket :("
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ugeh37",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jeroen_decock",
        "review_rating": "1",
        "review_title": "this is awfull",
        "review_detailed_main": "First review on this site ever, .... But in can not let this pass me by... this is one of the worst ever made/ so sad.\n\nStory, plot and timeline, this was just put together at random. Even the story is nonsense, not even an attempt to copy a major release movie... Come on!\n\nHow can one rate this 10/10... putting all other AI movies to shame.\n\nFor all I care the big robot in Robocop \"running in stop motion\", made a better acting performance then the whole crew of this movie!!!!!\n\nif you see the opportunities one get to release a movie, which are very limited.. this takes a huge amount of airtime to waste for better directors and upcoming talented people."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dragoangel",
        "review_rating": "1",
        "review_title": "If I could put zero I will do it.",
        "review_detailed_main": "Story is so sealy like it from fantasy of 5 year boy. Dialogs and actors play like from cazual RPG game without any emotions or mind games. To many cheap movie speceffects... I advise to wath: no one."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gerib_1999",
        "review_rating": "1",
        "review_title": "Worst Terminator (& Terminator Salvation) ripoff ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "pokeloverxy",
        "review_rating": "1",
        "review_title": "2 Hours and 19 Minutes You Will Never Get Back",
        "review_detailed_main": "Please, if you have any self respect or respect towards your loved ones do not let your eyes see any frame of this god awful movie. If you would even call it a movie and not a just a video made by a child on a camera phone. The story follows the well dressed Katniss Everdeen along with a prepubescent grease ball who looks like he just got out of a dressing room. They are traveling to Aurora. A uncreativley named village where the humans who didn't watch the movie live. Meanwhile, the entire world is being destroyed by a Kronos a poorly named AI and some transformers. The scenes with Cusak are improvised from the filming of a totally different film. The film box officed 4000 dollars. That should be a warning. It is PG 13 because it was rated by 3 year olds. Don't be fooled. The original Imbd rating was 2.0 but it got bumped to 4.6. This is because they bought reviews. Please do not get this film it is a wast of 50 cents that could be spent on cancer research not making movies that are cancerous. So please have Congress ban this movie and to John Cusak. Why? How could you be so desperate. The movie budget 100,000 dollars. You were played almost nothing. Why would waste your talent on this. Don't even get me started on the non existence of continuity. Well, goodbye and let this be a warning that may save your life."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "alec-macarthur",
        "review_rating": "1",
        "review_title": "A series of clichés stitched together with bad CGI",
        "review_detailed_main": "There's nothing good in this.\n\nAt times it felt like the makers were doing it on purpose. Night scenes always had a hooting owl for example.\n\nThe script was bad, the acting is bad, the CGI is bad and anything that isn't completely bad is s straight copy from other films."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "whotheff",
        "review_rating": "3",
        "review_title": "Chaotic, low-budget with a decent story.",
        "review_detailed_main": "Lately I've been seeing more and more sci-fi movies, which are actually a romantic dramas with a pretty standard Hollywoodish script. The only difference is, that these dramas are set in a sci-fi setting. Either in space, or far away in the future. In this movie, they had to pick. It was either going to be a pretty good sci-fi story, or a cheesy romance, exploited many times in Sci- Fi, but rarely touched in romantic movies. Well, they failed to decide so it turned out to be half decent Sci-fi plus half decent romantic story. And we all know that having two halves of different bills is not the same as having a single hundred-dollar bill.\n\nThe story is not new, but still it could be a very pleasant sci-fi. It unfolded so quickly, that if we remove the romantic part, it could pass for a trailer. Music score was heavily influenced by Blade Runner, acting was pretty bad (Even John Cusack could not save it). Camera guy was still learning, CGI's were decent.\n\nThey tried creating a huge movie with a dramatic story, set between among the stars. But to create such big thing, you need a lot of money. Obviously they did not have them and now it looks like a low- budget version of Star Gate. If they tried creating a 7-8 series out of this script, it could have had a huge success."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "aholejones",
        "review_rating": "1",
        "review_title": "Worst movie I've seen in recent years",
        "review_detailed_main": "I won't waste your or my time by writing a long review, but let me just state that it's horrible in pretty much every aspect. Especially the acting is probably the worst I've ever seen. Stay away people, stay away! The main \"star\" John Cusack has maybe two minutes worth of screen time by the way. Yes, it's one of those BS movies."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "popgrafix",
        "review_rating": "3",
        "review_title": "Terminator meets Twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "hotfaun",
        "review_rating": "1",
        "review_title": "When AI concludes humans are killing the planet, most get whipped out. A single girl tries to find the last city, helped by a boy she \"happens\" to run into.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "devinbrown-19091",
        "review_rating": "1",
        "review_title": "Wtf",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "GrahamJD77",
        "review_rating": "1",
        "review_title": "Avoid!",
        "review_detailed_main": "Don't waste 80+ minutes of your existence with this utterly awful piece of filmmaking\n\nThe equivalent of lift music at a rave, this is the definition of straight to DVD movies"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "TechnicallyNuts",
        "review_rating": "1",
        "review_title": "Makes Ed Wood look like Cecil B. DeMille",
        "review_detailed_main": "This is the worst movie I've ever watched. I won't waste any more time even on the review other than to say it's awful in every way."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "townsnation",
        "review_rating": "1",
        "review_title": "A Poor Writers Battlestar Galactica Origin Story-sorta",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jonxxdonnelly",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Disjointed, bad bad acting, complete waste of time. How anyone could give this dross a rating anove a 1 is completly beyond me. I suppose false ratings are now ubiquitous on digital media."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "laverpt",
        "review_rating": "1",
        "review_title": "Oh mer God..John C who do you owe money??",
        "review_detailed_main": "Start to finish...confusing and waste of time. What a BS movie to reach an ending that could not have come soon enough. Have always loved you John, but why????"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jason-697-936376",
        "review_rating": "1",
        "review_title": "Waste of acting talent and your time!",
        "review_detailed_main": "The overall idea would have been intriguing...with a completely different screenplay. The plot was very flimsy with major plotholes (kind of like a pothole but with..well, you get the idea). I wouldn't recommend this movie to anyone, it is a waste of time. There are some actors in this that are good, or used to be..looking at you John Cusack (maybe just stick to comedy or retire)."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nuzzbom",
        "review_rating": "1",
        "review_title": "this is horrible",
        "review_detailed_main": "This movie is so bad that it's as if Cusack knew a friend looking to get into moviemaking and helped him out by starring in it. I've seen better movies from a film class."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nicolecordero-16485",
        "review_rating": "1",
        "review_title": "Good golly this is a bad movie",
        "review_detailed_main": "I don't normally care for writing reviews but this movie and all its awful splendor taught me that I am perhaps a closeted masochist. It was so painful to watch and yet I had to see it through. To be fair I thought the ending would somehow redeem the first 1.5 hours of hot mess that this was but nope.\n\nPoints for the oversimplitic antagonist goals.\n\nPoints lost for taking 5+ minutes to explain said oversimplitic points."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gra-94234",
        "review_rating": "2",
        "review_title": "Swiss should stick to hiding Nazi gold",
        "review_detailed_main": "All you clowns you have downloaded illegally films music... And this is what left so thanks"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "pubmarcus",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen. Why John Cusak WHY?",
        "review_detailed_main": "If you're reading this review, you've already wasted too much time on this movie.\n\nThis movie is so bad I registered to write this review. I can only Imagine that John Cusak lost a drunken bet so that he had to be in the worst film he could possibly find.\n\nJust don't watch this film."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bubbmr",
        "review_rating": "1",
        "review_title": "This was so awful I created an account to",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "slavic-66813",
        "review_rating": "3",
        "review_title": "bad movie that keeps you to the end",
        "review_detailed_main": "how is that possible,that such a bad movie will keep you watching it to the very end of it( well almost ,forced myself half way). first I thought J. C. was a producer , but no..., is it a low budget - yes it is . then I had to see other titles by R.K. Guy is clearly between Poltergeist -2001: A Space Odyssey and a Star wars. now the movie : 97 years old Polaroid battery works??97 years old wooden door work???and the worst - the WAtcher has a panoramic view all the time?? It seems like the movie was made between few beers ,some parts are good, and then there is a shocker,or maybe the bar got closed."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nachtlager-10229",
        "review_rating": "1",
        "review_title": "Stolen together Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "shivafoss",
        "review_rating": "1",
        "review_title": "Oh, Johnny...",
        "review_detailed_main": "I absolutely LOVE John Cusack, so I'm gonna do myself a favor, tell myself he lost a bet, do my damn best to save others from wasting precious time on this sadness. I don't know what I hated most about this... \"movie\"... but I'm going with a plea to the entire movie making industry.. PLEASE!! Please don't give either of those young will-never-be actors another shot at stealing time from other human beings EVER again. And whatever the bet John lost... I'm sure he's learned his lesson."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "helenahandbasket-93734",
        "review_rating": "1",
        "review_title": "4.2? WHAT?!",
        "review_detailed_main": "How this spectacularly horrible movie has even a 4.2 rating is confounding; not one single redeeming facet to this movie at all."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "IvnSoft",
        "review_rating": "1",
        "review_title": "Wow. That's a new low.",
        "review_detailed_main": "I tend to trust \"some\" imdb scores. But lately this has proven wrong.\n\nSo, now i try movies in the mid-range. When i watched this it was sill passing 5 stars. Now i can agree with other reviewers that complain about tons of 9-star ratings with no review.\n\nThe story was dull. Don't get me wrong. I like post-apocalyptic themes, and technology stuff. However, i want a least a vague sense of plausibility when tackling the theme.\n\nThis movie tries to go into Terminator territory. AI gone crazy, and deciding to exterminate humans. That's just the introduction, there is no explanation not development on that. You have to witness the AI kill humankind and then skip forward 97 years. (why not 100?).\n\nAnd then, the story revolves around 2 novice actors. Novice as in \"they can't act\". It is awful. I've seen best acting in street comedy. The \"old\" actors (Carmen Argenziano and John Cusack) and like they are not convinced. . I can pass that up. Then there is the FX. It is BAD. I don't require great FX for a good movie, but c'mon. At least try. Most current games look more realistic.\n\nBut then i return to the story. And that i cannot forgive. It is boring. The lines are tedious and repetitive. You could guess what was going to happen or was going to be said.\n\nI won't spoil the movie. But it keeps on going. It is boring, dull, and tiring. Other movies, with less money, unknown actors, had brilliant scripts, and kept me engaged. I feel this movie will bore you as it bored me, so PLEASE .... Skip it. You can go watch Terminator, and even if you don't really like it, you will be more entertain with the action."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "RodMartinJr",
        "review_rating": "1",
        "review_title": "Okay story poorly written",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "scottm-38065",
        "review_rating": "2",
        "review_title": "Clumsy, awkward and unbelievable.",
        "review_detailed_main": "I barely know where to start with this mess.\n\nHere's my issues, to add to all the others (obviously there's duplicates, but I'm not reading all the other reviews). \"Physical\" inconsistencies: So let me get this straight... There's an AI that controls the entire planet, but it can't track down an interstellar spaceship sitting on the surface of the planet? Somehow humans were able to construct interstellar ships without the AI knowing? Somehow they launched off the planet in the past, but the AI couldn't track them, or know where they left from? 100 years after the destruction after the vast majority of humans: The ones that still exist somehow still have power to light flashlights? Batteries in a Polaroid camera still hold a charge? Electronic devices that still function? Someone has brand new looking Ø1\" rope? The AI can't track the remaining humans by their campfires? The AI doesn't have thermal imaging? Clothes are still \"normal\" looking? The bow and arrows, which serve no purpose in the plot line other than to insert a character that looks like Katniss Everdeen into the story, look like they were just purchased from Cabelas? Some unused buildings haven't been totally overgrown by nature and still look pristine on the inside even though windows are open for the past 100 years. People and their clothes are still \"clean\" with pearly white teeth?\n\nThis list is endless....\n\nI won't bother talking about the acting. Others have pretty much covered that. It suffices to say that it's terrible.\n\nStory sucks and just looks like it's trying to set up round 2.\n\nI blame Netflix for this recommendation."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jamie-56231",
        "review_rating": "1",
        "review_title": "soooooooo bad!",
        "review_detailed_main": "Such a bad movie, the main actors are dreadful I think the male actor may have downs, definitely can't act."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "scott-wichall",
        "review_rating": "1",
        "review_title": "If I could give this a negative rating I would",
        "review_detailed_main": "I managed to watch precisely 28 minutes of this awful movie. Why on earth is John Cusack in this steaming pile of excrement?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "stratus_phere",
        "review_rating": "4",
        "review_title": "Ignore the reviews, this is a solid four!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "chefdave-61641",
        "review_rating": "1",
        "review_title": "Trash!",
        "review_detailed_main": "This film could have been HUGE !. But it's a crock ! 'nuff said. The one star is for me for getting so far !!."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "amater33",
        "review_rating": "1",
        "review_title": "Very disapointing movie",
        "review_detailed_main": "I do not know where to start this review. Litteraly everything in this movie is very, very bad. Cast is ridiculous, screeplay is worse than a commercial, and effects is like 30 years old. There is no reason for Cusak to be in this movie. I know it was not hard for him, because he must has filmed all his part in 2 hours total. In while movie he does not move at all, maybe says few sentences and thats it. Other actors, girl and boy, are like someone you can pick today on the street and then you drag him to studio. Girl maybe not so bad, bat that boy is like a stunt, atleast. Totally madness. Luckully I watched it on PC and thanks to god for ffwd, so I helped my self with that mizery. Definitevly from me a big 1 score, there is no 0."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "PutuNix",
        "review_rating": "1",
        "review_title": "Dreadful. Not Worth the Bandwidth.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "sarajk56",
        "review_rating": "5",
        "review_title": "Did anyone else notice?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "neotechni",
        "review_rating": "1",
        "review_title": "It's a lower budget version of Terminator Salvation",
        "review_detailed_main": "A number of scenes are directly ripped from T:S, to the point where 1 line unintentionally is hilarious cause it seems like they ripped off Schwarzenneger's \"Get down!\" line. Think worse special effects, worse writing, and a worse ending twist."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "faridk-37000",
        "review_rating": "1",
        "review_title": "Lame",
        "review_detailed_main": "Lamest movie about AI Apocalypse that I've ever seen!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "alexielnet",
        "review_rating": "1",
        "review_title": "As bad as Snowpiercer or The Room!",
        "review_detailed_main": "Idea is good, delivery is horrible!\n\nHow after almost 100 years they got clean, fashionable, perfect fit cloths? Who made it? China is gone, who made it? Her GPS was working all this time, where did she dot power in destroyed world? Where those people got their electricity from? Who groomed those wild people, because they looked better groomed than me in the destroyed world, which was destroyed for 100 years...how is that possible?\n\nWhy was the main actors hoodie was sparkling clean all the time? Even when he got slashed by a sword, hoodie was uncut! It is not possible! Where did she get new technology bomb? Why mashin would make something that litteraly kill them, if it wasn't them, then who? The girl has a crosbow...what is that about? She would shoot metal with crosbow?\n\nSo the smartest AI in the world couldn't hack her GPS? And couldn't search for the castle with drones? They used amulate to start the ship, not human print but metal amulate, really? Why AI coun't do it?\n\nAnother thing, guy punched the girl and she was like, no.. it's okay. Really, really.... . It wasn't him, it was a program...okay, but use other wordS, not \"it's okay, it wan't you\" more like \"!\n\nNow, John Cusak. I hope they paid you a lot...like A LOT to be in that movie.So disappointed. You are an amazing actor with great skills...and that? really?\n\nI understand, everybody is the critic and have the right on their opinion, but please, next time hire a professional screenwriter, who has proper mind set on possible and impossible.\n\nPlease, next time make a movie that make sense!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "harald-hofer-1971",
        "review_rating": "1",
        "review_title": "WOW. What a missed chance...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "nouriemm",
        "review_rating": "1",
        "review_title": "Warning!! An uncontrollable effect of diarrhea.",
        "review_detailed_main": "Warning!! An uncontrollable effect of diarrhea. Don't watch this movie if a toilet is not nearby. The main actor of the movie(Julian Schaffner)=Zero talen. No original Idea. Totally wast of time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jnsamuelson",
        "review_rating": "5",
        "review_title": "Not horrible but needs better explaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "haroot_azarian",
        "review_rating": "1",
        "review_title": "Absolutely diabolical and terrible!",
        "review_detailed_main": "I cannot believe I just wasted 1:32 minutes of my life watching this garbage. The acting was abysmal, the script awful and the special effects and props just pathetic. I feel sorry for an actor like John Cusack being reduced to playing in C movies, never mind B movies! If you have not seen it yet, please don't waste your time. Trust me!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jacksongregg",
        "review_rating": "3",
        "review_title": "A \"B\" Movie",
        "review_detailed_main": "That's all there is to it. It tries to be like the Hunger Games an is worse than that wreck."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "compugor",
        "review_rating": "1",
        "review_title": "Dreadfully Slow Going Nowhere",
        "review_detailed_main": "Just plain bad acting, almost robotic, except for the robot character which was terribly over-acted with poorly expressed melodrama. The storyline is so thin its about as interesting as Cusak's singular deadpan expression on the face of the character he portrays. Virtually impossible to watch this lousy presentation straight through, I gave up after two longsuffering sessions making it to the 1:18 mark, not engaged in the slightest; don't know or care how it ends."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "redrltx",
        "review_rating": "1",
        "review_title": "Pretentiously Awful",
        "review_detailed_main": "A waste of a movie. The director is obviously trying to be mysterious and edgy with overused tropes. The story itself has been used hundreds of time. End of humanity, characters must find promised land, human doesn't know he's a robot. The plot barely makes sense and the acting sucks. Don't waste your time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jasonedge8",
        "review_rating": "1",
        "review_title": "Lazy film-making!",
        "review_detailed_main": "Lazy plot, lazy script, lazy sets, lazy lighting, lazy acting, lazy continuity, lazy movie. I don't mind a B movie but this is C or D. Really poor film-making and I'm surprised to see John Cussack involved."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "james-2374",
        "review_rating": "3",
        "review_title": "Slow, directionless, meandering.",
        "review_detailed_main": "Beautiful visuals, wonderful but overbearing score. Full of plot holes. Last ten minutes were enjoyable."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "iceqbeic",
        "review_rating": "5",
        "review_title": "Not, perhaps, as bad as the 11+ pages state?",
        "review_detailed_main": "Aw, Gods! Am I gonna love this! ;) OK! Here goes! There's about 11+ pages of people pouring fire and brimstone over this movie. So... Let's do the easy stuff first.\n\nYes, CGI is often horrible. There's no matching the background lighting and colors. Sometimes I've seen a lot worse and from, for instance, SYFY.\n\nActing could have been better. Eileen Grubba isn't too bad as Andrew's mother. And, all likenesses to a certain Katniss Everdeen aside, Jeannine Wacker has potential. Julian Schaffner should, however, attend acting classes more often, though. Being kewt just isn't enough these days. Sorry, kiddo!\n\nSome (most) people complain about John Cusak's and Carmen Argenziano's acting (from bad to worse and WTF) and the fact that there's a city with bright lights on in skyscrapers. Some 97 years after Armageddon.\n\nHow 'bout this! Go back to about 4:40 into the movie and hear Kronos say \"I will feel you. Do not be afraid\" and ponder what that implies. If you still don't get it, fast forward to about 9:20 and watch Elias moving about. Still no response? Well, fast forward again to 36:13 and listen to what Calia says.\n\nCusak's and Argenziano's acting isn't half bad considering the above. It's like they have no real choice. Still don't get it? Repeat ad nauseum! But, hey, this isn't a movie with outstanding character portraits. It's Sci-Fi!\n\nYes, there are similarities to Terminator. Of course there are. And I'm not talking about possible dupes of robots. I mean, if an AI reaches singularity and takes over, what would you expect? Humans are, after all, something to be... dealt with. Perhaps Kronos did the right thing after all?\n\nAbout a year ago, on SciFi-movies.com, the movie \"Aurora\" popped up. A full length feature by Robert Kouba, a young Swiss short film maker. A bit of investigation gave that crowd funded \"Aurora\" had been canceled and, thusly, I wrote to Scifi-movies and had it removed. I thought Kouba would be out of the picture. Check out the trailer: https://www.youtube.com/watch?v=XcohH3YG4tM\n\nAs you can see from this trailer, it's \"Singularity\"! So, \"Aurora\" lived on and became \"Singularity\". Finally.\n\nHave I seen better movies? Of course I have! Have I seen worse? No doubt about that! So, I actually do rate this a 5 despite all the deficiencies.\n\nClear your mind and watch it!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "TCooks2007",
        "review_rating": "1",
        "review_title": "Words Cannot describe how bad this movie is.",
        "review_detailed_main": "Worst of everything - bad acting, horrible script, worst directing ever ... there is nothing in this movie that is redeemable. Wow just wow ... pathetic."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Raxing",
        "review_rating": "3",
        "review_title": "An enigma",
        "review_detailed_main": "This movie actually had alot of potential. They could have done something with this idea but they instead decided to make a very generic and nonsensical movie that goes nowhere. They could have at least did a M. Night Shymalan and added a twist or something. It wouldn't have cost them a dime to write a better script but instead they decided to waste their money on getting John Cusack to say some lines after they were already done filming. Overall if you are reading this wondering whether you should watch this movie, I would say you should only watch it if you are planning on making fun of it with friends. The characters are laughably bad and once again the movie goes nowhere."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "1bilbo",
        "review_rating": "1",
        "review_title": "Tedius",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "igorz-1",
        "review_rating": "1",
        "review_title": "Could be quite good but.... no",
        "review_detailed_main": "This movie with more expressive actors and caring a bit about the story... could have made sci-fi lovers enjoy it, but there is nothing more annoying that feeling you have wasted your time."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "weshall55",
        "review_rating": "2",
        "review_title": "A sad waste of ok special effects",
        "review_detailed_main": "I like good science fiction. This was poorly acted and written. Fast forwarded to a leaden finish. Good effects crew let down by a confused weak script and lacklustre acting."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "imrational",
        "review_rating": "1",
        "review_title": "Singularity is a black hole; and you wish someone would have dropped this film down one.",
        "review_detailed_main": "Numerous plotholes. Gigantic, Buick-sucking plotholes. Scene: in the near future, artificial intelligence is invented. It quickly wipes out humanity. Okay then we telescope time 97 years later. Humanity is down to a few scattered survivors... Roughing it in the wilderness with perfect hair, manscaped beards, clean and fashionable clothing in immaculate shape. With supplies running out, oh wait, where did that 1980's Polaroid instamatic camera come from? Why does its batteries work? Or why does it have film in it?!? Special effects I was okay with for a low budget flick. Acting was... passable for a low budget. The script however, oh God, the script. What a mess. They tried to have a twist ending, but it doesn't make sense with anything else. It's a crying shame that other movies are not green lit that stand the chance of being decent stories. This one should have been flushed."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "movieliker1",
        "review_rating": "4",
        "review_title": "Kids' movie.",
        "review_detailed_main": "This seems like a movie for kids. Like an after school special. I'm talking 8 to 15 years old\n\nThere is no profanity, sex or nudity. There is violence. But no gore or torture.\n\nAdults could watch it with children. But I don't think adults would want to watch it alone."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "AstridVigdisRagnhild",
        "review_rating": "1",
        "review_title": "It was so bad it made me angry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "shawn_381",
        "review_rating": "1",
        "review_title": "This may be the worst movie I have ever seen",
        "review_detailed_main": "Story, acting, writing, direction...awful. This may be the worst movie I have ever seen. Plan 9 was better. I kid you not. I fell asleep after 5 minutes, woke up...fast forwarded through it, I simply could not take it. Cusak must have needed a mortgage payment."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "robeaston-40530",
        "review_rating": "2",
        "review_title": "Surprisingly bad",
        "review_detailed_main": "I watched the whole thing wondering if it was really this bad the whole time? Yeah, it was and is."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "exctidal",
        "review_rating": "1",
        "review_title": "Bad, very bad",
        "review_detailed_main": "I generally like John Cusack but maybe his acting skills have gone sour recently. This is a terrible movie, the script is boring, the CGI is poor, and the actors are dreadfully boring. The cover art looked interesting but the movie is unwatchable."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "braunschweigs-31534",
        "review_rating": "4",
        "review_title": "Snooze",
        "review_detailed_main": "Boring and slow. No real payoff for watching. Main actress was good."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "laylakay-28105",
        "review_rating": "2",
        "review_title": "Futuristic Hunger Games-ish?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "chris-gibbon",
        "review_rating": "4",
        "review_title": "Calm the hate, and see this for what it is, a first film by students, that lucked out getting a couple big name cameos",
        "review_detailed_main": "I'll say for starters, this is not a great film, not when compared to actual studio productions. What it feels like is a home project, for the two main leads or the director, as either university study, or just a hobby that grew into a full length film, so don't expect studio quality or the kind of continuity tracking or set design that would go along with this. There are other signs of unexpected growth with jerky plot motion, and filler dialogue by narration. All the scenes with Cusack appear to have been done over a single day shoot, in a darkened hotel room, and for the most part are repeated snap shots of him staring into space, later filled with graphics, done with a regrettable flatness; though it may be he's only done this as a favour.. Carmen feels more involved with the project. The plot and dialogue are a bit sketchy for them to work with though, think terminator universe, with hunger games mockingbird characters, and you won't be far off.\n\nHowever it's not all terrible, you can tell a lot of work has gone into it, and the graphic scenes could be very well done at times. The actors are young and inexperienced, but I thought the female lead at least kept it alive from an emotional stand point.\n\nIf you're looking for a punt.. just keep expectation low. I don't mind that I've seen it, and it may be just a long way round to getting the attention of a studio to make the second part fully, and although I don't get why it was released as a film rather than handed in at end of term, you may find odd moments it doesn't suck, like I did."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gazzalodi",
        "review_rating": "1",
        "review_title": "Really Really Bad",
        "review_detailed_main": "Even the cool battlemechs can't pull this one out of being a smoldering dungpile. The two leads were obviously cast because they looked good not because they had even a sliver of talent. And to compound it they give the female lead, who delivers her lines with the skill a second grade school play flower, voice-over responsibility. And yes, the results are painful to listen to. Oh, John Cusack stops in to pick up a paycheck, not act, as well. Watching this makes The 100 feel like a high concept scifi masterpiece."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "foothill_warrior",
        "review_rating": "2",
        "review_title": "Epic bad acting over re-hashed scifi plot",
        "review_detailed_main": "Every actor in this was the worst at their craft, including John Cusack who texted-in, didn't even bother to phone-in, his wooden silly performance. The two younger actors can maybe plead inexperience and bad direction. The plot is just a mish-mash ripoff of bits of Terminator and Matrix and every other \"computers rule the world\" scifi - all done better than this. It had a few decent effects so I gave it a 2, but really NOT worth a watch."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "andylev-40916",
        "review_rating": "1",
        "review_title": "John! Oh dear!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "k-n-brownell",
        "review_rating": "1",
        "review_title": "Don't appreciate the bot software.",
        "review_detailed_main": "This has a 93% on netflix. It's more like a 3/10, maybe, but I wouldn't have watched it if it had an honest review."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "lolivares",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "I really am at a loss for words. This movie has so many things wrong with it that I can't explain. It truly is awful. Spare yourself the disappointment."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gctgiant",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "This movie is so bad I made an account here just to rate it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "billking6666",
        "review_rating": "1",
        "review_title": "Had potential",
        "review_detailed_main": "If the writer had given his plot to a sci/fi writer and a solid producer, who would in turn get a decent budget, director and actors (Good CGI), then maybe this could have been a decent movie. Instead it's a one man ego fest. I love the idea of AI going wrong, because within the last year we were introduced to the first true AI (AlphaZero). The timeline of this plot foundation fits it , just as ex machina's plot foundation of the world's greatest search engine company creating the first AI (Google created AlphaZero) With AlphaZero and Space Force converging at the same time, I see exciting and perhaps frightening things ahead. Hollywood needs to come up with some fresh ideas regarding AI to keep up."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jesse-846-720503",
        "review_rating": "4",
        "review_title": "Ohhh...yikes",
        "review_detailed_main": "The special effects were surprisingly good. But the \"script\" and \"acting\" were, well, kinda bad. Ridiculous, convoluted story that made little sense, with elements ripped off from Terminator, Walking Dead, The Road, and a few B-grade sci-fi movies. And John Cusack...well, he must have needed the money. Maybe someday he'll be in something respectable again."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ccfernald-32385",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "Bad plot, slow pace, terrible acting. Did John Cusack need a paycheck that badly? Can I give it fractional stars?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "johnwojtk",
        "review_rating": "1",
        "review_title": "I needed this",
        "review_detailed_main": "I'm glad this Disney channel movie from the 90s was rescued from the cutting room floor."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rugg-66730",
        "review_rating": "1",
        "review_title": "A boring poorly made movie a painful waste of time",
        "review_detailed_main": "This is only a waste of time watching what was only a money loundry.\n\nIt doesn't even worth to write a review, but just a warning to avoid it and save your time for something better."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Sandalls_51",
        "review_rating": "1",
        "review_title": "Worse than worthless",
        "review_detailed_main": "No redeeming value in this whatever. Disappointed in everyone having anything to do with this."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "enpd",
        "review_rating": "1",
        "review_title": "Terminator 8?",
        "review_detailed_main": "Premise sounds familiar. Man invents militarized machines, machines destroy all but one human. One human finds another human with a \"come with me if you want to live\" Vibe. There is one exception. The visual effects in the original terminator where YEARS ahead of this production's."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kate-leibfried",
        "review_rating": "1",
        "review_title": "Wish I would have read others reviews...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "orionhi",
        "review_rating": "3",
        "review_title": "Meh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kielhebe",
        "review_rating": "2",
        "review_title": "Ugh",
        "review_detailed_main": "The two leads are so bad I can't begin to describe. The writing is terrible. The one reason it has two stars is because I have had a crush on John Cusack since I was 15"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jacaloppoi",
        "review_rating": "1",
        "review_title": "Long DMV lines are more enjoyable",
        "review_detailed_main": "Without a doubt worst movie I have ever seen. Me and my two little siblings suffered through the entire thing only because we had absolutely nothing else to do.\n\nI would have rather sat at a desk during in-school suspension staring at the texture of the paint on the wall for the whole time. At least then my imagination could craft up something better.\n\nActing was atrocious. I legitimately feel I could have done a better job, coming from a humble guy who knows he'd be trash on the big screen. Guess what: it was worse than trash and more on the lines of septic tank contents."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "carter-42764",
        "review_rating": "4",
        "review_title": "Eventful, but Unoriginal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ststoessel",
        "review_rating": "4",
        "review_title": "The movie has some neat ideas!",
        "review_detailed_main": "But the execution is awful.\n\nIt's mainly a mixture between Terminator Salvation and the novel The Tripods. Let's say the setting (Europe) was somehow borrowed from this novel. And I have seen really worse. So it was good enough to watch the movie to the end without getting sleepy, I honestly would rate it with 4.5/10."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "avillamaina",
        "review_rating": "2",
        "review_title": "Poor story, terrible acting",
        "review_detailed_main": "The story is plainly bad, lots of plot holes and the actors are really terrible, especially the main character (!). Many parts make no sense at all. Also: there is no singularity at all in the whole movie. I wonder if the title was randomly generated. Definitely not worth watching."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jlfalwell",
        "review_rating": "2",
        "review_title": "Terminator Salvation meets Katniss, Cinderella and Pinocchio",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "afakebobdole",
        "review_rating": "1",
        "review_title": "Booooooo",
        "review_detailed_main": "This sort of trash is what you get when no one on your team wants to be the first to admit that everything about your movie is bad. No redeeming qualities."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "stevesutton-74951",
        "review_rating": "3",
        "review_title": "This could have been an interesting movie.....",
        "review_detailed_main": "There are times where you come across a movie that has a lot of potential, but we end up witnessing its collapse under the weight of its own pomposity. Such is this one. There seems to be no sympathy between the acting or direction. A change in both would have helped. Instead it comes across as point scoring (bad old humanity has to be saved by human- robot hybrids) pretentious, and heavily sign posted. The story lends itself to many other movies, such that a re- write is not only possible but essential. A lost opportunity."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bretthaskell-95846",
        "review_rating": "1",
        "review_title": "Simply horrible",
        "review_detailed_main": "Worst I've seen since cabin boy and that is saying a lot."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "acpwebreg",
        "review_rating": "1",
        "review_title": "Even 1 is 10 too high!",
        "review_detailed_main": "The absolute worst movie I've ever seen. The other 1 Star reviews sum it up admirably so, enough already."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mflynnd",
        "review_rating": "1",
        "review_title": "John Cusack \"Career on the rise\"",
        "review_detailed_main": "Supported acting by the two young leads raise this movie to the same level of John Cusack's acting..... which sadly is not that far from the ground:("
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mike-c-b",
        "review_rating": "2",
        "review_title": "5 cent acting and directing, good CGI.",
        "review_detailed_main": "You can't like any of the characters. All the actors talk slow and confused, or panicky with clearly fake intention. All the lines are cliche.\n\nThe CGI robot in the beginning is modelled very well except for a fixed happy grin in a scene where it's at home. This is alarming to the viewer but there's no \"pick up\" on it. There are actors in the scene but they are purposefully acting in an unimportant way, so you don't care, which makes the whole scene confusing and pointless.\n\nNone of the leads act according to the scenes. The master robot builder acts in a mysterious way when talking to his \"creation\". In reality if he really put work into it - more than any other person alive - he would know everything in an \"of course\" manner, not be in a wandering god delusion.\n\nThe other leads act in a similar wandering god delusion or a panic. Then deliver cliche lines."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jaydavismcse",
        "review_rating": "4",
        "review_title": "Check In: Singularity (2017) To: Ross Little,",
        "review_detailed_main": "Great review. The only thing you missed was how the hell John Cusack was able to watch the progress? Where are the cameras??"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "namstonk",
        "review_rating": "1",
        "review_title": "Every part is awful",
        "review_detailed_main": "What is John Cusack thinking allowing his name to be on this? The script is just beyond laughable, the plot is so full of holes you have to make ten assumptions within the first ten minutes. As for the acting, jeezus, Jeannine Wacker the leading lady was all over the place, in some place it looks like she's on acid watching a game of table tennis, in other places she showed as much emotion in her face as a Red Setter. All in all it lies with Robert Kouba the writer and director you may say, but no, it lies with the flamin' eejuts who supplied the money to make it. I'd love to be able to put some of the dialogue in and some observations but dear reader you would not believe. Watch it stoned is all I'll say, oh go on I'll give you one bit of dialogue, \"wild berries had no flavour anymore\"."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rumor1234",
        "review_rating": "1",
        "review_title": "Wow",
        "review_detailed_main": "I will never get back that 90 minutes. Terrible effects. Weak script. Actors way too clean. Over lite in the interiors sets and ext night scenes."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "beckyp42",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "What an absolute pile of drivel. Gave up after 20 minutes. Shame on you John Cusack!!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mismerize",
        "review_rating": "2",
        "review_title": "dont waste your time watching this movie- to many plot holes to count",
        "review_detailed_main": "So many plot holes and very bad um cgi. 97 yrs pass, amazing how clean the actors look. makeup/nice clothes, shoes. love John Cusack, but buddy, um why did u do this film. need money? don't waste your time on this movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bradhorn-78760",
        "review_rating": "2",
        "review_title": "Couldn't even finish it",
        "review_detailed_main": "I won't waste your time writing a review of why I didn't like the film, although I could. But I feel like I just wasted an hour and a half watching it with the hopes it would redeem itself and it never happened. So I turned it off. I don't want anyone to make the same mistake I did so I'm adding my 2* rating with the hope it prevents even one person from clicking the play button instead of, I don't know, anything else."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Rob_P",
        "review_rating": "1",
        "review_title": "A real stinker!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "gothix99",
        "review_rating": "1",
        "review_title": "Atrocious",
        "review_detailed_main": "This film was among the worst I have watched in quite some time. The storyline was laughable with scant and poorly executed special effects. Cusack's entire appearance in the film was spent mugging and uttering nonsensical dialogue. The young leads cannot act whatsoever and their dialogue was juvenile and absolute trash. Honestly, the plot that the film tried to accomplish, and failed miserably, could be fascinating and I am hoping a movie can be made, in more skilled hands, although it wouldn't take much skill to make a film better than this. I do agree with reviewers who stated the positive ratings on this film were most certainly not genuine. No one with a modicum of intelligence and taste would find this film anything other than garbage."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "tealeewoo",
        "review_rating": "1",
        "review_title": "Yikes!",
        "review_detailed_main": "It's like a knock off Hunger Games, Maze Runner, Eagle Eye, and Terminator, except 1000 times worse......what was John Cusack thinking?!?! He was acting more like Nicholas Cage, *shudders*. Not even laughably bad, just painfully bad. If you see an amazing trailer of some obscure movie you've never heard of, chances are the actual film is horrible....this movie proves that point."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "michellecunninghamdps",
        "review_rating": "3",
        "review_title": "Bad acting ruined it",
        "review_detailed_main": "The story is ok, but the acting is terrible and the characters look like they just got back from the mall. Not very post apocalyptic."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "simonjefferiesapps",
        "review_rating": "4",
        "review_title": "Neither awful nor good... had promise but borrowed ideas, missed a script writer",
        "review_detailed_main": "Cross between hunger games, robot jox and i-robot to name a few. It looks good, patches of bad cgi but to be honest it's forgivable. The music is slick and good. The script is muddled, babble and nonsense, especially from the two young actors. I actually wanted John Cusack in the film more. The lines were a little cringeworthy in places e.g. \"worst\" was spoken.\n\nOverall, a case of glitz over substance, neither awful nor good. Shame as it reminded me of 80's films where bad was actually good though."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "HunterZ0",
        "review_rating": "4",
        "review_title": "B-movie rehash of Terminator Salvation",
        "review_detailed_main": "A B-movie rehash of Terminator Salvation (with a dash of The Matrix), except the android falls in love, and Helena Bonham Carter's SkyNet is replaced with a deranged Elon Musk played by John Cusack.\n\nThe production values aren't bad for a B-movie, but the very, very shallow story offers nothing new. I think some of the problem is that the movie is barely an hour an a half long, so it ends up feeling rushed; with all the wasted scenes of Cusack watching from afar, it ends up feeling like an over-long short film instead of a feature-length story.\n\nI guess there's a bit of a surprise/twist ending, but when you see it you'll just think \"Uh, OK.\"\n\nThere were also oddities in the writing that broke immersion. For example:"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Mr_Jackhammer",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "The special effects actually didn't seem so bad to me... But everything else was absolutely horrible. I couldn't even make it through the first half hour it was so bad, and none of it made any sense whatsoever. I don't understand why this movie even exists."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jessenewman-80699",
        "review_rating": "1",
        "review_title": "It failed miserably",
        "review_detailed_main": "Pretty much what everyone else said, poorly acted, no authenticity or originality"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "doglover-41640",
        "review_rating": "1",
        "review_title": "Lackluster movie",
        "review_detailed_main": "The horrible acting and huge plot holes in this movie make it almost unwatchable. Super disappointed in this movie. It had such an interesting premise, but it fell flat."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "brendanemig",
        "review_rating": "1",
        "review_title": "The only positive thing...",
        "review_detailed_main": "It's only an hour and a half... wow, that was bad."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "vvjsdjh",
        "review_rating": "2",
        "review_title": "The Matrix - Reloa....Plagiarized",
        "review_detailed_main": "Really? Again?\n\nBtw... The Matrix isn't original either... there's old black & white \" Colossus \", episodes of Star Trek , I, Robot, Terminator, and I'm sure plenty of others.\n\nI think we get not to put a supercomputer in charge of us without a disconnect... I hope those in the government have this concept drilled into them by now & not to do this on any level."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "georgi_yanev82",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "The main guy is such a log. If that is an actor so i can be a rocket scientist."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "dr-jhouse",
        "review_rating": "1",
        "review_title": "Stupid.",
        "review_detailed_main": "Writing sucked because a silver spoon rich millenial thought it would be cool to make a movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "imdb-4288",
        "review_rating": "2",
        "review_title": "Couldn't finish it",
        "review_detailed_main": "Thankfully, only invested 10 minutes into this turd. AI kills humanity. Film maker makes horrible film.\n\nWhy Netflix showed it to me as five stars, I'll never know.\n\nThankfully, this hints that the singularity is still a ways off."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Defected74",
        "review_rating": "1",
        "review_title": "Ouch!",
        "review_detailed_main": "Painful to watch. I had to turn it off at 15 minutes and 43 seconds. It really is that bad. Shame on you John Cusack."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "tiedyeguy-1",
        "review_rating": "2",
        "review_title": "Wow this is such a bad movie.",
        "review_detailed_main": "I wanted to give this movie 1/10. But I have to admit that it's not as bad as Plan 9 From Outer Space, or Manos The Hands of Fate. The special effects look better than paper mache and string. The background music is passable. The acting is slightly better than your average high school drama club. But all of this is overshadowed by the sheer stupidity of the plot and the dialog. I've seen some awful post-apocalyptic movies, from Logan's Run to Wall-E. Singularity blows them all away. It's terrible.\n\nIt seems that whoever wrote this screenplay lacks the ability to predict what real people would do or say in a given situation. Scene after scene, the characters act in ways that make no sense and say things that no sane person would ever say. But at least they speak in sentences rather than gibberish. And I can understand the actors' accents. So kudos for that."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ReelMedia",
        "review_rating": "1",
        "review_title": "Boring",
        "review_detailed_main": "It was so bad we could not make it through 40 minutes."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "doppleganger19692",
        "review_rating": "2",
        "review_title": "A study guide in \"How NOT To\"",
        "review_detailed_main": "This production is an interesting premise in search of a bigger budget, better writing, better direction, better acting, better effects.....you get the idea. The basic concept is not new - think \"Skynet\" in the \"Terminator\" series - but the twist is worth exploring. Unfortunately it's not executed very well here. However this is a good movie to watch and make notes on what not to do when making a movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "occidentalover",
        "review_rating": "3",
        "review_title": "NEEDS MORE MECHS AND GORE",
        "review_detailed_main": "When making a direct-to-vdeo/streaming B movie with a tired premise, there are decisions a director can make to elevate a bad film.\n\nHere some suggestions :\n\n* MECHS! Mecha are instantly attractive to audiences. Play that up. Exploit the mechs. It's a great angle. Singularity doesn't have enough mechs.\n\n* GORE! Gore in a bad film automatically makes it more enjoyable. Heck, even memorable. Singularity doesn't have any gore : (\n\n* SCORE! The featured score is boring and serviceable. Why not make your low budget film stand out with a more avant-garde score? IE: Decoder (1984)\n\nWith its lousy script that didn't give the actors much to do, this film was doomed, and nothing was done to 'punch it up'. I never thought I'd see John Cusack in a worse film after 2012. I was wrong. Singularity is that film. At least 2012 was unintentionally hilarious.\n\nSome of the locations and shots are genuinely beautiful. Some of the special effects shots even look great. This could have made a very good video game. A good film? Definitely not."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "harp3691964",
        "review_rating": "1",
        "review_title": "Skynet in a blender?",
        "review_detailed_main": "If you were to take Terminator, Hunger Games, Darryl Dixon's crossbow, add a dash of Ear Games, and add some Sauron and his magic eye and put in a blender you would end up with this movie - CRAP!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "robynsegg3",
        "review_rating": "3",
        "review_title": "I suspect this could have been a good, even great movie if only...",
        "review_detailed_main": "...if it had come to a different director and producer.\n\nI can totally see the unrealized potential in this terrible, disjointed mess of a film. Why on Earth Nicolas Cage decided to add his face to this mess is beyond me, but lately he has made so many bizarre choices it doesn't really surprise me."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "angelo-m-dias",
        "review_rating": "1",
        "review_title": "Horrible! Had to fast forward!",
        "review_detailed_main": "This is very, very bad... If you value your time, don't waste it on this! Had to fast forward the movie, as it became unwatchable after only 20 mins in.\n\nI do find it impressive that an actor like John Cusack would join this, it's because of him I decided to watch this movie, but boy did I regret it!\n\nBad acting, bad special effect, bad everything!..."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bruceforsman-23161",
        "review_rating": "1",
        "review_title": "love the genre hate the movie",
        "review_detailed_main": "Watched 25 minutes of this and can not believe how bad this movie is. John you really have bottomed out. the cheap 97 years later segway followed by pristine people and brand new clothes katniss clone wannabe uhg i just can not articulate all the way this movie sucks. stopped watching to read reviews to see if it redeemed itself and every review i read said no. how any one made it to the end I will never know."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bramstayer",
        "review_rating": "1",
        "review_title": "Dead on arrival",
        "review_detailed_main": "Avoid. Watch Terminator or better yet read a real article on the actual threat of singularity. Its scarier than this trash fire."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "ferring-99240",
        "review_rating": "1",
        "review_title": "Not really even worth a star",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Sherparsa",
        "review_rating": "3",
        "review_title": "another potentially 7*** movie that i gave only 3*** ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "crazze-28564",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "Shouldn't exist, whatever Netflix paid to stream it was too much."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Ennaei",
        "review_rating": "1",
        "review_title": "Should have negative stars minus 10!",
        "review_detailed_main": "This has got to be the worst movie I have ever watched. I can't believe John Cusack had his name associated it! The effects were from the 90's the script was poor and the acting was non existent. And a poor rip of about 10 movies. The best thing about this film is when it was over ! I can't believe I paid to watch it!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mickeycz",
        "review_rating": "1",
        "review_title": "Pitiful effort to evoke the Hunger Games",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "chaosnyk",
        "review_rating": "1",
        "review_title": "Insult to audience's intelligence",
        "review_detailed_main": "No chance for suspension of disbelief. If AI is a superior intelligence it never would have allowed this movie to happen. In three years AI is invented and destroys humanity? Elon Musk still has not invented a self-driving taxi since the release of this movie!! 97 years later this kid is wearing a hoodie without a single hole in it? Couldn't the person in charge of the wardrobe at least buy all the clothes at a thrift store? The acting is awful!! The dialogue is bizarre (she talks about waking up in the morning past tense as if the current reality is no more?) and the special effects are about as good as the original Terminator in the 80's. Was there no critique of the script before production? Did Steven Mnuchin produce this?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "fri2219",
        "review_rating": "1",
        "review_title": "Delicious fart monkey",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "grahambuilder",
        "review_rating": "5",
        "review_title": "Terminator meets art school film",
        "review_detailed_main": "Was disappointed. The effects are so early 2000s but the movie was made in 2017"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "uscmd",
        "review_rating": "1",
        "review_title": "Not an original idea in the entire movie",
        "review_detailed_main": "First 5 minutes..........the earth is infected, to save it, we must.....\n\nBet every single person that reads this can guess exactly where the plot is going. A variation of you have to cruel to be kind.\n\nI used to think John Cusack was a decent, journeyman actor, but he either did thia without reading the script, as a favor to someone........or he is desperate for a paycheck.\n\nWatch this, only if its on the one chanel you receive. If you get 2 chanels, watch the other one., It is that bad. Oh one equivocation, if you have never seen a sci fi movie, it might be passable. Might?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "sedgefen",
        "review_rating": "1",
        "review_title": "Ugh!",
        "review_detailed_main": "Terrible movie! Can't think of anything positive to say."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "mabbb",
        "review_rating": "1",
        "review_title": "SO BAD!!!! Cusak wasted my life.",
        "review_detailed_main": "This was terrible, and you are better off staring at a wall. What has happened to John Cusak????? Without him I never would have tried. The premise was like a cheap terminator and the acting was bad, with cheesy special effects. Please watch only as a movie to make fun of."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "davejones",
        "review_rating": "2",
        "review_title": "It's as if someone tried to turn his visual effects reel into a feature film",
        "review_detailed_main": "This movie is inept on almost every level--except one.\n\nThe story is a nonsensical hash of ideas lifted from other, better movies. The acting and direction are terrible. The dialogue is laughable.\n\nThe only thing about it that's any good is the visual effects. Some of them are quite cool.\n\nI can see how a movie this bad gets made. There's one person credited with the script, directing and even the editing of the film. One Robert Goupa. So you can see how one person might become invested in this idea and lose sight of how awful it is.\n\nWhat's s hard to believe that anyone would finance such an obviously terrible script. I can only guess that the people who put money into it must have believed that the effects would somehow carry the day."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "Ps393",
        "review_rating": "1",
        "review_title": "Blimey! What a car crash!",
        "review_detailed_main": "Massive potential and none of it taken. More holes in the story than Swiss cheese, dreadful acting (with possible exception of John Cusack who gave an average performance). Cinematography, special effects and script are all just beyond poor."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kcrocklein",
        "review_rating": "3",
        "review_title": "Terrible. Copies plenty of other terrible movies.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "badlizzard",
        "review_rating": "1",
        "review_title": "Horrible waste of time",
        "review_detailed_main": "Most tedious movie I have ever watched. Nothing happens, no excitement, no fear. It was painful to watch."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "evobrubaker",
        "review_rating": "1",
        "review_title": "This movie, Singularity, has made me finally sign into IMDB!",
        "review_detailed_main": "I've finally figured out how Netflix works. Spend a big chunk of money on ONE well known actor to push to movie and then it don't matter if it's crap because of that one actor. This movie is horrible. The acting is way off. I'm not an actor and if I done worse I would be very disappointed in myself."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "moneca9",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "This is my first review ever about a movie, I'm very dissapointed with this particular one, because I like most of John Cusack works, but this... I can't believe he did this one. The story was the same as other movies, the kid who acted there as principal character, he doesn't know who to act! A kid from high school can do a better job! The only one who seems knows what she was doing was the actress. It seems this movie was a low budget one. Don't waste the time unless you want to see how Cusack is diminishing his career."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "claireabaird",
        "review_rating": "1",
        "review_title": "Probably the worst film I've ever seen.",
        "review_detailed_main": "Seriously...don't waste your time. This was painful to watch. The worst acting I've ever seen maybe? Just wow!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "estherhailey",
        "review_rating": "1",
        "review_title": "Absolute Garbage",
        "review_detailed_main": "I love sci-fi and even good B movies, this however was a total pile of steaming garbage. I really wanted to like this movie, but there were just no good points."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "danielsorensen79",
        "review_rating": "2",
        "review_title": "Horrible... to say the least!",
        "review_detailed_main": "This is my first review ever. But the movie is soooo bad that i felt compelled to warn others about it. I've probably seen others that were as bad. But I honestly can't think of a single one. Poor actors and everyone else associated with this movie."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "kittencat-39933",
        "review_rating": "1",
        "review_title": "Wasted an hour and 35 minuets of my life",
        "review_detailed_main": "The story could be good with some good acting, some actual dialoge and character development. This had none of the following. Bad, Just bad. Romance was way too fast and not developed properly or naturally, and the climax lasted about 30 seconds"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "timothybaxley",
        "review_rating": "1",
        "review_title": "This movie is SO bad...",
        "review_detailed_main": "...my wife won't let me have the remote and she has changed all the passwords on our streaming accounts. Now, that may sound harsh...but honestly I deserve worse for making her watch this movie. I spent 25+ years grooming my wife into a groovy SciFi, video game loving hottie. This one film has set us back at least 19 years. At least she is still hot and enjoys gaming.\n\nI can't explain how I was ever interested in this movie. The cast alone should have steered me clear of this pile of filthy entertainment poopoo. The special effects were surly done by a four year old running around with a parents cell phone.\n\nHow in the world this movie is rated higher than one star is proof of alien life and the Illuminati running a shadow movie industry bent on melting our minds.\n\nUsually during a terrible movie I am constantly waiting for something to happen that at least makes my wife and I discuss what we have spent two hours watching. Not this tome. She immediately walked out of the room and didn't talk to me for 36 hours. Which is probably a good thing considering all the name calling and swearing she unleashed on me AFTER she cooled off.\n\nPlease. Don't waste time watching this mess. It's not worth the time and will surely cause erectile disfunction and a drop of 30-40 IQ points.\n\nChances are high we could end crime and war with the simple threat of forced viewing of this film. It is a weapon of mass destruction and should be illegal to view."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "imseeg",
        "review_rating": "1",
        "review_title": "NOT a John Cusack movie at all, because he is only starring in it for a few minutes. The rest is rubbish. RUBBISH",
        "review_detailed_main": "NOT worth of being called a movie. This is a cheaply produced tv movie, with C list actors, with NO charisma.\n\nMore bad: there is really NO thrill or suspense whatsoever.\n\nCome on John Cusack, you can star in better pictures than this one!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "bjwoodhull",
        "review_rating": "1",
        "review_title": "John Cusak's Nose",
        "review_detailed_main": "What's with the irritating spec on John Cusak's nose at the end of movie? The movie is a snoozer."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "cqqlbreeze",
        "review_rating": "1",
        "review_title": "Horrible casting!!!",
        "review_detailed_main": "This movie had a great premise. Robots taking over. But the writing is childlike and the 2 leads male and female are just terrible. Not one second were ther believable. 8 billion dead and these 2 idiots survived? A wimp and a princess right out of a make up trailer acting like survivalists?? Oh please! Terrible casting, directing and writing. Casting in any movie is essential. These low budget movies hire anyone who can breathe....this movie sucks."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "michael-spivey",
        "review_rating": "2",
        "review_title": "If they just would have used actual actors.",
        "review_detailed_main": "The big stars did fine, but the main actors, the teens, where horrible and clearly needed more acting lessons."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "djheftydh",
        "review_rating": "4",
        "review_title": "COULD'VE BEEN SO MUCH MORE.",
        "review_detailed_main": "I'm hoping this was someone's first movie, in which case it's not that bad. If not, then wtf were they thinking? Maybe in Switzerland this was great, but it's impossible to get past the two main characters- \"Katniss Conner\" & her soyboy sidekick. It's a great idea, but poorly executed. It's supposed to be 100 yrs after most people were wiped out, and two supercomputers running the show send some soyboy who looks like he just came from school so he can meet a girl who looks like Katniss, and is wearing a tailor fitted leather outfit, and carrying around a bunch of expensive, brand new weapons, with shiny jewelry to boot. Almost no people for 100 yrs & she looks like everything just happened 3 days earlier. I've seen this before, a while ago, but I forgot what it was about. I'm 30 mins into & I suddenly remember why I forgot about it."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "sauerc-537-99328",
        "review_rating": "1",
        "review_title": "Can't get any worse!",
        "review_detailed_main": "I am only putting this review because I can't believe anyone would rate it higher than a one and the rating had to be wrong! Terrible movie. As many others mentioned already it was not an apocalyptic movie at all!"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "freermottram",
        "review_rating": "1",
        "review_title": "False advertising",
        "review_detailed_main": "I assume you've read the other reviews, and I know that I'm just adding to the pile. I just wanted to defend John Cusack. I can only imagine how he feels - surely he was also duped into this project too?! The rest probably came off the back of his involvement, so he probably green lit it the whole thing.\n\nThis film is a steaming pile of the proverbial, trying to be Terminator, Blade Runner, Hunger Games, and even Battlestar Galactica."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "BBthemovieman",
        "review_rating": "1",
        "review_title": "Awful waste of time",
        "review_detailed_main": "If you like science fiction, you have already seen this film done far far far far far far far far far far far far better ... I would go on, but that is all you need to know. It takes ideas from better films and uses them in a terrible way"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "biggiebaby",
        "review_rating": "2",
        "review_title": "John,WTF man!",
        "review_detailed_main": "I realize that Cusack is middle aged and the cutesy underdog boy-next-door parts are in the rearview, but, damn! So many flaws. It was like a cheap SciFy movie of the week from 20 yrs ago..... The movie is over after the \"I don't eat scene\"...... I only made it about half way in, dunno, maybe you can do better. If I've said it once, I've said it, like, 67 or 68 times,\"F, CGI, it's ruining movies!\" Are writers that exspensive these days? Oh, and Nexflix, sling some more of this, maybe some will stick."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "crystalwizardly",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "This is horrific and not in a good way. Bad story, bad screenplay, baaaad acting, bad dialog, bad directing. Watch at you own risk. I couldn't make it through in two trys. Not bad like grade b either. Not bad like a few good laughs. Bad like ouch, who the heck did this crime?"
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "joealisy",
        "review_rating": "1",
        "review_title": "Really you called it a movie",
        "review_detailed_main": "The movie is so bad don't even try to watch it, The actors was awful especially \"Andro\" his eyes is always wide open seems like the king of stupid people ."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "rytard",
        "review_rating": "1",
        "review_title": "Is this for real?!",
        "review_detailed_main": "Holy crap, this movie was such a turd I couldn't even finish it. I think it's partly due to me being a John Cusack fan, and my inability to accept he's in a movie this terrible."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "vwkiks",
        "review_rating": "1",
        "review_title": "this was bad, just awefull",
        "review_detailed_main": "I want to say the ending was atrocious, the fight scene in the woods was filmed and acted by high school film students, and John Cusack's acting was so stiff and unenthusiastic I thought he was channeling Martin Sheen from Apocalypse Now."
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "georgiamo",
        "review_rating": "",
        "review_title": "What was John Cusak thinking?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "flugler",
        "review_rating": "",
        "review_title": "A must pass",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "jpboyleca",
        "review_rating": "",
        "review_title": "Brutal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "orourkejr",
        "review_rating": "",
        "review_title": "Oh how the mighty fall",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7312940",
        "movie_name": "Singularity",
        "movie_rating": "3.6",
        "review_username": "merkin2211",
        "review_rating": "",
        "review_title": "Sucks like a really bad lemon!",
        "review_detailed_main": ""
    }
]