[
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "novagirl11",
        "review_rating": "4",
        "review_title": "great cast but plot not so great",
        "review_detailed_main": "Great cast, but unfortunate movie to be hired for. plot was difficult to follow and character development weak. at times comical when it wasn't supposed to be. oh well...at least I watched it while in Hawaii which made it slightly more interesting...better luck next time for these actors!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "SwollenThumb",
        "review_rating": "6",
        "review_title": "Confusing",
        "review_detailed_main": "Loveable actors playing mostly unbelievable characters in an unbelievable plot that hinges on a boy's video recording. Mixed soundtrack as confusing as rest of the movie. The elements were all there for a great film but writer/director Crow didn't know in which direction to take it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Horst_In_Translation",
        "review_rating": "4",
        "review_title": "Talent wasted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lnvicta",
        "review_rating": "3",
        "review_title": "Aloha is identity crisis masquerading as a movie.",
        "review_detailed_main": "Aloha has absolutely no idea what it wants to be. If I had to count, I'd say there are about 10 subplots in this movie which is about 9 too many for a romcom. Sure, it's based on real-life, but that's no excuse to make a terrible movie. It's a chore to watch this thing, it took me three separate sittings before I can make it to the end without falling asleep or dying of boredom. Its tone is probably the worst offender. Like I said, it has no idea what it wants to be, so it tries to be everything. A love story, a political statement, a bittersweet comedy, a tense drama-mystery about a guy trying to control space - it does not mesh well at all. I had forgotten Alec Baldwin was even in the movie at one point, and that was probably the most interesting storyline in the damn thing. It's frustrating because there is a good story in there! Somewhere! I think. It's hard to tell with all the surrounding sh*t.\n\nThe cast is the only good thing about this movie. It's just a shame watching them have to recite this terrible dialogue to one another. They even have chemistry at times which helps during the cringe-y moments, but convincing acting doesn't make a bad script good. It just makes a bad script... somewhat watchable. But don't watch it. It sucks."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "joaquinnq",
        "review_rating": "7",
        "review_title": "A little gem, to see without prejudice",
        "review_detailed_main": "It is not easy to encapsulate Aloha in a genre. It's not the usual Rom-Com, although the argument might lead one to believe that yes. The main thread describes the dramatic arc of a man centered on his work, capable of loving, but with difficulty to engage in lasting relationships. In addition, the film explores some manifestations of Hawaiian culture and parody some clichés about military conflicts and conspiracies, with unequal effectiveness.\n\nThe speed with which Aloha travels from one genre to another, sometimes in the middle of the same scene or dialogue, must have confused more than one viewer. It is understood that it has not reached a greater success, between the public and the critic.\n\nBut Aloha has beautiful details to watch and taste, combining serious and emotive subjects with a fine humor, in a delicate balance.\n\nAlso, it is a film with an outstanding casting. The protagonists do their work. Rachel McAdams is charming. It's a pleasure to see Bill Murray. And it is remarkable the discovery of Danielle Rose Russell, a young actress who delivers a memorable performance, to close a light and touching film, that tackles serious issues without taking them too seriously."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dillahuntyclaire",
        "review_rating": "2",
        "review_title": "Am I insane?",
        "review_detailed_main": "I actually thought I was going crazy while listening to the dialogue in the movie...questioning my sanity. Never have humans ever interacted the way this movie portrays it. I would not be shocked if aliens wrote this movie because that's how insane the interactions are. None of it makes sense, the characters are bizarre, and I had no idea what was going on. This is billed as a romantic comedy when it really a test of who your willpower and how long you can watch this weird concoction of like seven different stories happening at once. How do movies like this get made with so many famous people?!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "TheAnimalMother",
        "review_rating": "7",
        "review_title": "Are The Critics On Drugs?",
        "review_detailed_main": "Mostly panned by critics, I have to say, I really didn't mind this film at all. The critics are simply wrong here, at least to my tastes they are. A few aspects may not have worked so well, sure, but I feel many aspects did work quite well. I enjoyed the vast subject matter, the entertaining cast, and the unique energy this film has. The storytelling here in my view is another interesting one in a long line of good and different Cameron Crowe films. When most of Hollywood is making very safe and predictable films, at least we still have a few American directors willing to do something different and willing to bring attention to often overlooked (or even new), issues. Most of all though it is the very grounded human feelings in Cameron Crowe films that really make them work for me. This is no exception. To me this was a fun, heartfelt, and somewhat thought provoking film. The critics can keep giving mindless films like Guardians of the Galaxy and Mad Max:Fury Road good reviews, but for me, this film kicks both their asses easily. 7/10"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Grimmell73-212-552849",
        "review_rating": "3",
        "review_title": "A mess holding gems, as pearls in cow flop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "melodyjarredondo",
        "review_rating": "7",
        "review_title": "It was good despite the rating",
        "review_detailed_main": "I was excited when I saw the cast of this film only to find out that it had a pretty poor rating. A friend had even recommended it to me, but I questioned her judgment compared to what apparently 30k people have thought about it. But I finally decided to give it a go, and it was worth it. I honestly don't know why it has such a low rating. The film is definitely slower, but it's the feel of the movie. I thought it was interesting, romantic, and funny. It even made me laugh out loud a few times. I loved Emma's character but Bradley Cooper's character took a little warming up to. If you go into it with an open mind, I think you will be pleasantly surprised."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Vanillaalmond",
        "review_rating": "2",
        "review_title": "A farce",
        "review_detailed_main": "This movie is somehow all over the place, threads begin but do not end, connections exist but how and why is not explained. I felt like I was watching a movie that is great inside the head of the writer/director but he knows the story to well and forgets to tell us half of it.It's like it is trying to be everything for everybody and while doing that failing in all aspects. The whole military plot thing is strange, lots of people are just there and we are never told why or even who they are.\n\nThis is not a feel good movie, it is a feel strange movie leaving you with lots of questions, the main one being why?"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "nesdon-2",
        "review_rating": "9",
        "review_title": "Ignore the media on this one",
        "review_detailed_main": "As a film maker and former film school professor, I have a lot of my students as friends on Facebook. Many of them, most notably ones of Asian descent, came out full of vitriol and condemnation of this film, many of them before they had even seen it, as did a lot of the popular media.\n\nIGNORE THEM! This is Cameron Crowe back in form. The film in no way disrespects Hawaiian culture or ignores its aboriginal and Asian populations, in fact it celebrates them. Emma Stone as a character named Allison Ng (\"My dad was half Chinese and half Hawaiian... so I'm 1/4 Hawaiian\") had to be played by a white actress in that she is referencing exactly that desire of some white people to pawn themselves off as ethic. She does it marvelously.\n\nIn fact the whole cast is amazing, with a script that absolutely sparkles, especially in its frequent nods to non-verbal communication. The last, most moving and completely wordless scene is worth the price of admission. Danielle Rose Russell's performance in this scene is breathtaking, and she is completely luminous through out, even though she has only a handful of lines.\n\nOthers with only handfuls of lines who make the film really shine are John Krazinski, Bill Murray and Alex Baldwin. The three leads are all amazing, with Stone a little over the top (tho appropriate for her character) and I think this is as good a work as Rachel McAdams has ever done.\n\nI have to admit that the plotting of the whole military contractor subplot had a few too many little deus ex machina bows tied around it, but it was all maguffin for the beautiful insights into human heart and its connections anyway. And not nearly as preposterous as the embarrassing Elizabethtown.\n\nI put a lot of store in IMDb ratings, and I have never seen them as far off the mark as they are with this film. I am a progressive, and expect cultural respect from Hollywood, but this may be another sad case of the hidden ability for random accusations of political incorrectness to cow the media."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "annettedhall",
        "review_rating": "7",
        "review_title": "Glad I didn't read \"reviews\" before watching this movie!",
        "review_detailed_main": "The movie features an all star cast each having an amazing talent for expressing the emotions of their characters into fully 3 dimensional people: emotions, brokenness, past history, failures, etc. I actually expected this to be a \"low brainer\" movie. How wrong I was and so glad that I took the time to discover this movie is rare gem. .... OK some reviewers were / are expecting these actors to revive past roles that blew minds just to drag in an audience. Nah, that would be too simple! Instead Cameron Crowe utilized the known strengths of each of the actors in a truly romantic (comedy) using their individual skills to tell the story. (I will leave up for debate whether he (Crowe) was capitalizing on past performances) . Love the cast and the story. Only sort of negative would be to include more local Hawaii natives to flesh out their love of culture. That said the natives that do appear are delightful. Enjoy this movie with these thoughts in mind. As for me I must see it again soon!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jleeharris-36991",
        "review_rating": "2",
        "review_title": "Confusing and Terrible",
        "review_detailed_main": "The scenes seem out of order and not connected. Bradley Cooper's voice sounds dubbed. There is no chemistry with Emma Stone and the plot with Rachel McAdams is awkward. This was boring and not really entertaining. I kept hoping for it to perk up, but it never did. I can't believe actors read this script and agreed to do it. it seems like they added in Bill Murray at eh last minute and made up really bad dialogue. This was so bad."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "er_ouz",
        "review_rating": "3",
        "review_title": "So bad it will make you cringe with discomfort",
        "review_detailed_main": "Rarely have I seen such a bad film from a major studio release and with A or B list stars in it, but this truly is one of the worst movies I've seen recently. I would try to sum up the plot, but it's meaningless, as this movie is not a whole,flowing story, but rather a checklist of markers through which the scenes pass and tick the box, and hurry on to the next marker on the list.\n\nBy eliminating any character and story growth and simply jumping to the bottom line in every scene, some scenes are just so awkward and... just bad, they will make you cringe with discomfort, not only because they're so lame in themselves, but because they're so obvious and scripted that it's pathetic.\n\nI really like light Rom-Com's, and I enjoy a film that doesn't take itself too seriously- but this one is so bad it actually made me sad."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "CleveMan66",
        "review_rating": "7",
        "review_title": "\"Aloha\" is a typical Cameron Crowe film - a little disjointed, but with a terrific cast, great character development and delightfully quirky dialog.",
        "review_detailed_main": "The focus of Cameron Crowe's films has evolved, but they have consistently expressed a style that is all his own. The writer/director of \"Aloha\" (PG-13, 1:45) has brought us over a dozen movies since the early 1980s. Crowe has served as both writer and director on most of them, meaning that each one expresses who he is as a filmmaker and as a man – consistent, open, sensitive and quirky – along with reflecting where he is on life's journey at any given time. Except for an occasional fantasy/mystery (\"Vanilla Sky\") or musical documentary (one on Tom Petty and one on Pearl Jam), most of Crowe's films have been comedies, each with a generous helping of drama thrown in and usually a good bit of romance as well.\n\nBut his focus has evolved. His early films are membered as iconic and eminently quotable: \"Fast Times at Ridgemont High\" (1982), \"Say Anything\" (1989), \"Singles\" (1992) and \"Jerry Maguire\" (1996). With those last two, we start to see Crowe focus more on the concept of family, in a wide variety of forms. \"Almost Famous\" (2000) and \"We Bought a Zoo\" (2011) continued that trend. \"Jerry Maguire\" and \"Almost Famous\" also signal the beginning of a shift in which Crowe's films increasingly emphasize one central character seeking redemption for past mistakes and/or simply sorting out what really matters to him and trying to find his place in the world. It's a style that's even more pronounced in 2005's \"Elizabethtown\" and 2015's \"Aloha\". But through all these shifts, remaining remarkably consistent have been Crowe's strong doses of character development and fun, quirky dialog.\n\nThe central character in \"Aloha\" is Brian Gilcrest (Bradley Cooper), a former Air Force officer who is now a defense contractor working for billionaire Carson Welch (Bill Murray). Welch is one of the many rich businessmen who, in this age of dwindling budgets, the military depends on to help finance its satellites. Welch is a bit of a mystery, but not so Gilcrest. It's not hard to see where he's coming from. Once an idealistic young man fascinated with outer space, he has become cynical and virtually swallowed up by the compromises he has made to enhance his love life, his bank account and his position in the world. Over time, all this has caught up with him and now he finds himself with no moral or romantic compass, his looks and his charm seeming to be all that's getting him through life. While deployed to Afghanistan, he made a couple big mistakes – one that almost ended his life and one that did end his military career. As the film opens, he's headed to Hawaii, his old stomping grounds, to negotiate a deal with the locals that will allow the military to expand one of their bases and to launch new satellites.\n\nWhat Gilcrest thinks will be a simple mission that will take less than a week and give him a chance to get back in the game is complicated by ghosts from his past and new challenges in his present. When he lands in Honolulu, Gilcrest reunites with an odd former Air Force buddy, Colonel \"Fingers\" Lacy (Danny McBride) and he's also confronted with old flame Tracy Woodside (Rachel McAdams). She dumped him 13 years prior and married a stable but quiet (practically non-communicative) Air Force pilot named John \"Woody\" Woodside (John Krasinski). Tracy also has a 12-year-old daughter named Grace (Danielle Rose Russell) who is trying to overcome her tween awkwardness by learning to dance the hula, and a 9-year-old son named Mitchell (Jaeden Lieberher) who is awkwardly obsessed with using his video camera to record everything and also spouting Hawaiian mythology and legends to anyone who will listen. While he's forced to confront his past, Gilcrest's overriding present concern is dealing with the extremely dedicated and overly perky Air Force liaison, Captain Allison Ng (pronounced \"Ing\"), played by Emma Stone. Being one-quarter Hawaiian (as she keeps telling everyone), meticulous in the performance of her duties, and fascinated with the man in whom she sees greatness while still referring to as \"a wreck\", she insists on tagging along for a scheduled meeting between Gilcrest and his old acquaintance Dennis \"Bumpy\" Kanahale. Playing himself, he's President of what he calls \"The Hawaiian Nation\". Bumpy and his compatriots consider the over century-long American presence in Hawaii as a military occupation. It's going to take all of Gilcrest's negotiating skill and all of Ng's deferential idealism to convince Bumpy to give his blessing to the expansion of the Air Force base. Meanwhile, suspiciously watching all of this from the sidelines is General Dixon (Alec Baldwin), a man who hates Gilcrest and may or may not be involved in some shady dealings with Murray's character. \"Aloha\" fits the mold of a typical Cameron Crowe film – a great cast with a somewhat disjointed but pleasant story. Through most of the movie, it seems that Crowe couldn't decide if he wanted this movie to be a romantic comedy, a military drama or an ode to Hawaiian history and culture, much like \"The Descendants\" (2011). As you're watching Crowe's story unfold, you begin to wonder if \"Aloha\" exists mainly so we can watch the pretty people dance around each other, both literally and figuratively, but the pieces do eventually fit together. The film's last 20 or so minutes become very focused, dramatic, romantic and even joyful. Along the way, the talented cast is a pleasure to watch, the dialog tickles the ear, the scenery provides a beautiful backdrop for the goings-on and there are some very memorable scenes. An ongoing joke about unspoken communication earns a big payoff at the end of the movie and Alec Baldwin's big scene is every bit as funny as in the trailers. In short, this isn't a perfect movie, but it's a nearly perfect Cameron Crowe movie, with as many meanings as that one-word title has in the land of its origin. \"B+\""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jim_flowers",
        "review_rating": "1",
        "review_title": "I have no idea what I just watched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "michaelRokeefe",
        "review_rating": "7",
        "review_title": "A billionaire wants to launch a private payload.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jackburto",
        "review_rating": "3",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "hoernkeem",
        "review_rating": "2",
        "review_title": "Aloha (2015, Cameron Crowe) Bizarrely confused misstep from Crowe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bethanykelley",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "I don't know why this got such low ratings here. This is a movie with multifaceted characters. The actors did a really good job developing and evolving these characters, even with one of the characters rarely talking. You completely understood what he was trying to say without him saying it. It may not be a fast paced movie, but it still moves at a comfortable pace. It is well rounded with drama, comedy, and romance."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "theRetiree",
        "review_rating": "7",
        "review_title": "Give Aloha A Break",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dryanmorr",
        "review_rating": "2",
        "review_title": "What did I just watch?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "corpsman12",
        "review_rating": "5",
        "review_title": "Wasted Opportunity",
        "review_detailed_main": "First off this movie is a joke to Hawaii and the military. Only Battleship and USS Indianapolis our worse for military movies. The whole movie is rushed from the start, does not give any time to develop just jumps right to get to the end. The story is actually pretty good and could be done very well, but the execution was just terrible. Had good songs placed in the wrong moments. Great actors whose talents were misused. The trailer for this movie is way better than the movie and misleads you to thinking that this will be one of the best movies. I don't know what they were going for but it missed the mark. I wouldn't say totally unwatchable but definitely not a good watch. It's just disappointing knowing what could of been."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "TheCatalystIR",
        "review_rating": "7",
        "review_title": "A very normal, light-hearted romantic flick",
        "review_detailed_main": "Aloha is possibly one of the lightest movies you will ever see. I'm not a lover of the director, therefore my main reason to see this was the cast. Though Bradly Cooper is not as good as he was in Silver Linings Playbook, he is convincing enough not to ruin the movie. Same goes for Emma Stone and Rachel McAdams. The story is not a big deal and it's pretty straightforward for a script that has been in the works for 4 years. The comedy is non-existent in the movie. But the brightest part of the film is the sheer sweetness of the relationships between the characters.\n\nThis is a movie you should absolutely watch with your Girlfriend or spouse."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "fascinating overstuffed mess",
        "review_detailed_main": "Brian Gilcrest (Bradley Cooper) has always wanted to be in the space program. His military career is over and he has recovered from a terrible incident in Kabul. He is working for mercurial billionaire Carson Welch (Bill Murray) who is building a private rocket facility in Hawaii. He needs to recruit the locals to bless a gate. The military assigns Air Force pilot Allison Ng (Emma Stone) as his watchdog. Gilcrest reconnects with his former love Tracy Woodside (Rachel McAdams) who has a family with Woody (John Krasinski).\n\nWow! Cameron Crowe has cobbled together a crazy set of story elements. Emma Stone is part Chinese Hawaiian. Her character is an insane writer's creation. Her acting does no favor to the character. There's a rocket launch and an international peace treaty. The Chinese are hacking and there's an audio weapon. There is a lot of Hawaiian mysticism. I do love Rachel McAdams. She is absolutely enchanting and her part of the movie actually works. That only teases a much better movie somewhere in this convoluted mess."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "statuskuo",
        "review_rating": "7",
        "review_title": "Means Hi And Bye",
        "review_detailed_main": "In today's climate, we do tend to pile on hate. And, this had A TON heaped on it. For what reason? I'm not completely sure. The plot is thin, the dialogue hammy, but...the actors involved are just that...involved. The commitment to deliver bad lines well is a craft and art in itself. And to Stone and Cooper's credit, they do that. If you look at Cameron Crowe's movies, this is typical of most of his films. Low on story, HUGE on heart. And that isn't a bad thing in a really cynical world. These movies should exist. It's a movie world. It has zero basis in the reality crap we see on t.v. nowadays. THAT'S precisely what I took from it. Crowe's world isn't suppose to be raw...it's suppose to be Hollywood-ized. And people hate that. Why? Again, you'd have to see where we are in society now. These are beautiful people, doing beautiful things in a beautiful world. That's long passed us. So it's seen as nostalgia. Not a bad thing. Just a bad thing when you try to pin it in some reality.\n\nGranted, I did feel Cooper's casting was off. Not because he doesn't have the chops. But someone that handsome who's portrayed to have deep flaws doesn't ring completely true. Originally Ben Stiller was involved. And it would've been a far more interesting choice. Or say someone like Seth Rogen, who could pull off the wounded soul thing. But for critics to destroy it in the way they did, I think speaks more towards maybe not even seeing the movie and relying on what other critics have said. Or just reading the synopsis.\n\nDo I want to like a Cameron Crowe movie? Not really. His projects like \"Singles\" or \"Almost Famous\" don't age well. But for this film, you get a straight forward romance with nothing new under the sun."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sadetosch",
        "review_rating": "5",
        "review_title": "Weird pace throughout the whole movie",
        "review_detailed_main": "I just finished this movie. It's not the worst movie I have ever seen but there is very little explanation or character development throughout the entire thing. Is Emma Stone mentioning she's 1/4 Hawaiian multiple times throughout the movie problematic? Maybe, but more so just annoying and it felt really unnecessary to make that part of her character. She could have just appreciated Hawaiian culture. That aside, her character's lines were the cringiest. Also the whole military operation storyline could have been eliminated almost entirely and it would've been better.\n\nOverall I'd say the movie is fast and sloppy, needed at least 30 minutes added on to have things make more sense but I didn't hate it. The ending was cute which is why I bumped it up a little but I'd go into this movie knowing you're going to get secondhand embarrassment and wonder how so many A-listers signed on."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "abcxyz-94493",
        "review_rating": "7",
        "review_title": "1st half is challenging. But comes together.",
        "review_detailed_main": "This is a strange movie. It's slightly funny but not a comedy. A bit romantic, sentimental, and dramatic. Because the plot is a bit of a mess. The dialogue is OK...and then occasionally there is a brilliant line and you it's Cameron Crowe.\n\nSo why did I give it a 7? The cast. Just wonderful to watch. Emma Stone's eyes are luminous. Bradley Cooper baby blues can melt you. Rachel McAdams you can't not always love. John Krasinski was solid. Bill Murray and Danny McBride always inject smiles. Alec Baldwin owns every scene he is in.\n\nHalfway through the movie I'm like \"where is the story? What a waste of great actors/characters\" But by the third act Crowe mostly pulled it together.\n\nI also found this movie VERY topical. Bill Murray is Elon Musk."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Prismark10",
        "review_rating": "3",
        "review_title": "Aloha",
        "review_detailed_main": "Cameron Crowe has been on a downward spiral for some time. He wants to make offbeat, kooky films with a heart. However some of his recent movies verge on being horribly inept.\n\nAloha has Bradley Cooper who stars as Brian. A military contractor injured in Afghanistan. Brian returns to his former home of Hawaii to strike a deal and have the blessing of some native Hawaiian tribes for the Space program on behalf of billionaire private industrialist Carson Welch (Bill Murray.)\n\nHis return means uniting with is ex-girlfriend Tracy (Rachel McAdams) who he last saw 13 years ago. She has now married to a military man John (John Krasinski) who says few words but speaks a lot through his body language and they have two children. One of which is a 12 year old daughter. I will use my non verbal communication skills to allow the reader to calculate 2+2=4!\n\nEmma Stone is Captain Allison Ng, an uptight US Air Force liaison for Brian, Carson Welch and the US military who are being led up the garden path by the megalomaniac billionaire who has his own agenda which any Bond villain would be proud of.\n\nNg has a running joke throughout the film as she reminds everyone constantly that she is one quarter native Hawaiian as she obviously does not look it. She also falls for Brian\n\nThere seems to be nothing natural or organic in the story because Crowe wants to be off kilter. Everything seems forced lacking any kind of coherence with the story and characters.\n\nBradley Cooper who has become something of a sex symbol with the Hangover films actually comes across looking geeky in this film. He is also all at sea with a weak script. This man is a three year in a row Best Actor Oscar nominee.\n\nBrian is a jerk and no way could I buy Ng falling for him. For a start he is too old for her, he is not nice, he uses people, he has little loyalty and is full of cynicism. As a romantic comedy it fails on two counts. There is no romance and there is no comedy.\n\nThe finale where Brian deals with some Chinese hack when the satellite is in mid air and then sabotage the launch with every recorded music is bizarre and silly to the extreme.\n\nThe film looks disjointed because it has all the hallmarks of post production tinkering and possible re-shoots. Some of it looks cheap, just watch the scene when Carson is apprehended supposedly in Japan."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mapika",
        "review_rating": "10",
        "review_title": "One of the most underrated films of at least the last 2 decades",
        "review_detailed_main": "I just can't believe the negative ratings, both, by the media and here on IMDB !\n\nThis is one of the most touching movies I've seen in the last 20 years. And I normally really don't like Bradley Cooper at all. For me it's his best movie! And of course all the other actresses and actors are great! Every single one!\n\nThis film has so many layers describing life and what it is all about. It's simply everything, funny, awkward, deep, touching, moving... Especially the silent scenes with John Krasinski and Danielle Rose Russell are phenomenal!\n\nI smiled, laughed and cried alternately throughout the whole film... To me it's fun and wisdom in one. Period."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "averysl-17461",
        "review_rating": "1",
        "review_title": "Just no.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sadira_lotus",
        "review_rating": "",
        "review_title": "Loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ndinda17",
        "review_rating": "2",
        "review_title": "45 mins I still don't know what is going on",
        "review_detailed_main": "45 mins I still don't know what is going on. I seriously have no idea what is going on."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "screams_3",
        "review_rating": "6",
        "review_title": "It will make your wife happy",
        "review_detailed_main": "I read the reviews before going to the movie, after reading reviews like \"Will it end Emma Stone career?\" I was expecting a total disaster. Being married, I saw a bunch of chick flick that were painful to watch (aka. The Big Wedding), and \"Aloha!\" is not one of them.\n\nAs a men, I was a little bored, I had a look at my watch a few times, but it is not painful to watch. I had to go see a chick flick if I want my wife to be willing to go watch people being eating alive in Jurassic World in 2 weeks.\n\nMy wife was happy, she had a great night. In fact, all the woman in the theater were having fun...by the way the theater was full. They were laughing, had a few tears at the end.\n\nAfter the movie, I was watching people leaving and it was always the same scenario, 2 woman talking together totally excited (probably by Bradley Cooper) and behind there was the 2 husbands walking looking completely bored.\n\nIt's a chick flick....what do you expect?"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "acat_BG",
        "review_rating": "4",
        "review_title": "Great cast, awful movie",
        "review_detailed_main": "If you don't want to waste your time, don't watch this movie. Directing and screenplay are unbelievably bad. For me, it's almost impossible that they've managed to ruin movie with Emma Stone and Rachel McAdams. I felt embarrassment in every minute i've watched this film... Maybe, there was some point to the story, but the realization was badly executed. Dialogue is poorly written. Acting was unconvincing. The story it self is uninteresting. From the fist minute to the last, i was really bored... I felt like twelve years old kid choose music for this movie, unoriginal and superficial. And they went to Hawaii and shoot only some house and few cars. Really big shame."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tavm",
        "review_rating": "7",
        "review_title": "Aloha was a pretty good film from Cameron Crowe.",
        "review_detailed_main": "Just watched this movie on Netflix disc with my mom. We both seemed to enjoy this latest drama from Cameron Crowe starring Bradley Cooper as some kind of contractor working on a rocket ship being built for an eccentric millionaire played by Bill Murray. Rachel McAdams plays Cooper's former flame and Emma Stone plays a military pilot keeping tabs on Cooper. Also appearing are John Krasinski as McAdams' pilot husband and Alec Baldwin as a general. The plot doesn't always make sense but many of the characterizations are compelling enough to overcome that. Another performer I liked was Danielle Rose Russell as one of the young kids of McAdams of which something is revealed about that near-teen daughter later on. So on that note, I recommend Aloha."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "andrewlkoch-85823",
        "review_rating": "1",
        "review_title": "Acid trip of a movie",
        "review_detailed_main": "This movie is the only movie I've ever gone back to rate at 1 star. It's so bad it's actually comical. The dialogue and plot development were trash, even though the cast was good. Yeah, astonishingly bad which makes it kind of funny to watch but at the end even with that I'd say it's not worth watching."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Crowe for help",
        "review_detailed_main": "So maybe this isn't the best Cameron Crowe movie there is. But it still is better than some other movies out there. There is a certain charm (not to mention a cast list that reads incredible) to it all. It might be convoluted and it might have some major storytelling issues (not to mention a very strange romantic story, that while predictable still is weird), but it is kind of funny.\n\nThere is wit, there is funny situations and there is a strange military subplot, with Mr. Baldwin and others at the top of it. Or are they? It's tough to tell at times what is going on and what the movie is trying to tell the viewer. If you have patience you may be rewarded for that ..."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "avaliquette-50649",
        "review_rating": "3",
        "review_title": "What was this about? Great cast but confusing plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "7",
        "review_title": "I danced with the devil and I liked it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "stefhonregina",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": "As I'm sure everyone else did, I was expecting this to be great. With this basically All-Star cast how could it be bad? Well Cameron Crow somehow figured that out. The only reason I didn't get a bit a lower rating than four is because with stars like this you can't really blame them. Just poor writing and poor idea for a movie. This movie is 10 years old and all of these actors have done well for themselves so it definitely wasn't a career ruining film. They probably learn from their mistakes and make sure to now the good ones. If you feel like being confused and having no idea what's going on."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sunonda",
        "review_rating": "4",
        "review_title": "No flow",
        "review_detailed_main": "This is a strange movie without flow. It jumps from one topic to another without transition. It seems like maybe it would have been better if it were complete. I finished watching because I really like Emma, Bradley and especially Rachael McAdams. I won't watch it again and I wouldn't recommend it but everyone deserves to make their own decision. No spoilers because that's no fun and it wouldn't matter anyway because the movie lacks a main plot, it lacks a purpose and honestly it doesn't even have a climax. It is just a bunch of scenes thrown together in random order. This was hard to watch. Aloha."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tieman64",
        "review_rating": "",
        "review_title": "From Here to Eternity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "gmclaude",
        "review_rating": "7",
        "review_title": "It really is okay to like this film :)",
        "review_detailed_main": "Sometimes you just need a light hearted and fun film to effortlessly wash over you and leave you smiling :)."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ellieepic",
        "review_rating": "2",
        "review_title": "Ughhhhhhhhhhhhh make it stop",
        "review_detailed_main": "...\"Ughhhhhhh\" is a word which would sum up my time watching the movie 'Aloha'. I was extremely intrigued when I saw the synopsis and cast of this movie: Bradley Cooper, Rachel McAdams, Bill Murray, Emma Stone (my personal favourite), and even Michael Chernus who appeared in Orange is the new Black. Obviously I'm no professional but it would seem difficult to make a film containing such great actors so dull. I'll have to admit that I didn't watch the ending, although I can vouch that the beginning and middle of the movie was tragically slow paced and I don't expect the ending was any better. I recommend this to anyone who enjoys the prospect of bawling your eyes out with boredom."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "uppal_twinkle",
        "review_rating": "7",
        "review_title": "Interesting and feel good!",
        "review_detailed_main": "I don't know why this movie has such low ratings. It's a nice feel good movie, romantic, bits of comedy here and there. I kind of enjoyed it!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "KD-Lasso",
        "review_rating": "1",
        "review_title": "Oh sweet Jesus what a train wreck!",
        "review_detailed_main": "I love me some Cameron Crowe, I really do but oh my God! This film is just one long awkward moment of terribleness that should never have been! For the love of me I don't understand how some of the best working actors out there today can give such poor performances either. There's is no chemistry between Bradley Cooper or Emma Stone and what's the deal with Rachel McAdams? I'm not even gonna go there. I don't even.. The movie even makes Bill Murray look bad! Bill Murray! AND THE PACING! My God the pacing.. I don't even think I can blame whomever cut this film. It feels just like a bunch of film makers that went to Hawaii and kinda made the movie up as it went along. Like a Adam Sandler movie, like Grown Ups. Congratulations Cameron Crowe! You made a sequel to Grown Ups without even knowing it! It should have been starring Kevin James! And that's an insult to Kevin James and not you, Cameron!\n\nThe only people I could recommend this film to is to toddlers, because it has some really bright colors and fun shapes. And that might be considered child abuse in some states so don't take my word on it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "witster18",
        "review_rating": "6",
        "review_title": "Much better than it's 5.5 rating at the time of this review.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "randaashraf-70075",
        "review_rating": "5",
        "review_title": "Terribly Tiring Time-taker",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "janisongs",
        "review_rating": "9",
        "review_title": "Don't listen to jaded critics; \"Aloha\" has the top quality of \"Say Anything\"",
        "review_detailed_main": "Yesterday I watched \"Aloha,\" and loved it. I've watched it twice, and I want to watch it again. I don't understand how it could have been panned repeatedly by the critics. \"Aloha\" is quirky, often funny, sweet, and endearing, even though it's a sprawling, rambling, story with intentionally cinema-verite-flavored camera work at times. Unpredictable, it's not your typical romcom!\n\nSet in the magnificent and mystical landscapes of Hawaii, with the soothing backdrop of lilting Hawaiian music, it's simply unforgettable! And, the cast is stellar: Bradley Cooper, Emma Stone, John Krasinski, Alec Baldwin, Bill Murray, and so many other top performances. We need more films that demand our attention and our intelligence, which show us characters who struggle with ambiguity, recognize life's joys, mysteries, and heartbreaks, and yet still manage to keep their integrity intact. This film will have you talking afterwards ~ and at the least, it will make you happy! Thank you, Cameron Crowe."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bob-rutzel-239-525430",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "Former USAF officer Brian Gilcrest (Bradley Cooper) is now a civilian contractor working for millionaire Carson Welch (Bill Murray) who wants to put a militarized satellite in space, but needs the blessing of the Hawaiian king Denis Bumpy Kanahele (as himself), who wants to barter for better cell phone service and more land in exchange for the blessing.\n\nThis takes a lot of time to get to the real story. We are lost most of the time. In the meantime we are left with why Gilcrest left Tracey (Rachel McAdams) years go. Here we may understand the reason why the title is Aloha as it means good-bye. Later on it again means good-bye when Gilcrest tells Captain NG -pronounced \"ing\"- (Emma Stone) to stay away as he is deemed disgraced for what he did during the launch of that satellite. We are hoping for another Aloha with Captain Ng as Aloha also means hello. See? Will that happen? Inquiring minds are on the job.\n\nThe acting all around is good, but Emma Stone as Captain Ng was sometimes a little over the top being too much of a bright eyed bushy- tailed watchdog assigned to Gilcrest. (you mean annoying, don't you?)\n\nThe real winner in here is the non-verbal communication between Gilcrest and Woody (John Krasinski) who is married to Tracy. Later on there is another episode with this non-verbal communication between Gilcrest and Woody again. This time the screen shows non-verbal communication in sub-titles so we can see what is actually being said. But the best non-verbal communication (no sub titles) comes between Gilcrest and Grace (Danielle Rose Russell), Tracy's daughter, as he watches Grace perform some Hawaiian dance and she sees him watching and then she realizes a most important truth. You definitely will need Kleenex tissues when you see this scene. This is one of the best scenes I have ever seen in a movie. Kudos. Yes, I had tissues handy. You just never know.\n\nOne would think that a movie about Hawaii would show more landscapes (there were some), but the obligatory surfing scenes didn't happen. Boo Hoo.\n\nNotable: Alec Baldwin as a USAF general.\n\nOver all the pacing is good and we are entertained and even learned some Hawaiian culture. (7/10)\n\nViolence: No. Sex: No. Nudity: No. Language: one F-bomb, otherwise nothing."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ewebb-05093",
        "review_rating": "1",
        "review_title": "If I could give 0 I would!",
        "review_detailed_main": "Couldn't even get through the first 20 minutes. Spoiler Alert: this movie sucks! 0/10 do not recommend."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tiaskyelandish",
        "review_rating": "2",
        "review_title": "Aloha (derogatory)",
        "review_detailed_main": "I've decided to watch Cameron Crowe's Aloha on Tubi of all places. It's not good. In fact, it's pretty awful. With chaotic production troubles and a horrible screenplay, it's shocking that Crowe still went it. There are political conversations about the US government and its use of Hawaiian land/resources. There's an odd romance plotline with no chemistry between the cast. Speaking of the cast, you have Bradley Cooper, Emma Stone, Rachel McAdams, Bill Murray, John Krasinski, Danny McBride, and Alec Baldwin. God bless them. Their performances are fine. However, the film is unbalanced and doesn't know what it wants to be. It doesn't help that there's a glaring problem of setting up conflicts or situations with no rewarding follow-ups. This is a complete trainwreck despite the potential. Not only is this Cameron Crowe's worst film, but it's also Crowe at his most overdramatic and least captivating. There isn't a single time that I've laughed throughout the whole film (and this is supposed to be a comedy too). You hate to see it. Other than the nice location shots and the okay performances, I can't recommend seeing this picture."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Sometimes you just have to say 'hello' AND 'goodbye'. Aloha.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "CoryU",
        "review_rating": "7",
        "review_title": "Strong acting in small roles seal it as a great movie.",
        "review_detailed_main": "Apparently the media, critics, and a lot of viewers have made up their mind about this movie long before they ever got around to watching it. Frankly, that's a shame. If we can set racial tension aside for a moment and talk about the film... I think the movie was beautiful.\n\nI went to the theater to see this, really excited to see an upbeat romantic comedy. The trailer had me pretty excited to see a movie starring quite a few \"name brand\" actors, but one that looked like it had some heart to it.\n\nThe movie was not what I expected. The movie starts off a little slow, and while it may have a few witty moments it is nothing but heartfelt drama. During the movie we see Brian Gilcrest (Bradley Cooper) interact with most of the other characters like old friends and explore how people have changed since he left. This basically helps give depth and develops all the characters, showing us these are real people. The interactions between characters was so genuine feeling. For me, the best part of the movie was the solid acting in supporting roles. A few of which really stood out to me.\n\nDanny McBride pulls off his serious role as Colonel \"Fingers\" Lacy really well. I was expecting to see him vis-à-vis \"East Bound and Down\" but instead he played a down to earth guy that was reminiscent of a few of my old officers with the \"C'mon, just play the game\" mindset. If I see him in a serious role again, I will consider the movie a must see.\n\nJohn Krasinski is an absolute powerhouse in this movie. In fact, his character is my favorite in the entire film. As you may have guessed from the trailer, his character doesn't have many lines. Don't let that fool you. While the script helps, the way Krasinski pours feeling through his body language... it's probably one of the most emotion evoking portrayals I've seen in a long time. The exchange you witness in the trailer barely Knicks the surface.\n\nIn similar fashion, the young Danielle Rose Russell... wow. She steals the movie in a single scene that lacks dialog. If she continues making movies she is going to be one heck of a good actress. A name to remember for sure.\n\nBradley Cooper, Emma Stone, Rachel McAdams all do well in their roles. The way they play off one another was great. If the script has been a little better maybe the movie wouldn't have seemed as slow as it did at times. But if it was a faster paced film the beauty in some portions may have been swept under the rug.\n\nI made an account today, just so I could say how great this movie was. Thanks for reading."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "brianberns-1",
        "review_rating": "5",
        "review_title": "All-Star cast can't save this incoherent mess",
        "review_detailed_main": "The leads' commitment to their parts is admirable, but the consistently awkward delivery shows that even the actors didn't understand what Cameron Crowe was going for. There are several times that the actors just seem to be reciting lines without any comprehension of what the character was trying to say. As a viewer, I shared their confusion.\n\nAfter a while, I just tried let go of the silly plot and vibe with the rom-com flow, but even that superficial take was unsatisfying. It's really hard to sympathize with Bradley Cooper as an emotionally damaged underdog when he has both Emma Stone and Rachel McAdams making goo-goo eyes at him for the entire movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "burlesonjesse5",
        "review_rating": "6",
        "review_title": "VIEWS ON FILM review of Aloha",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "h2223",
        "review_rating": "4",
        "review_title": "This movie is not confusing, but it's just bad",
        "review_detailed_main": "I've read at least one review that said people who think it's all over the place just aren't intelligent enough to get it. Um, no. I *got* the movie, I just didn't think it was good. None of the plot points is carried out far enough to make a really good story.\n\nBut what bothered me even more is how staged the movie feels. The characters act like characters, not like real humans. I just hate when directors make movies like this. I can't get over the feeling of watching actors act. Even though the \"acting\" itself was fine, the characters didn't do things real humans would do -- thus, it just seemed like you were watching people play characters on a screen.\n\nIt also feels very lazy when the story is put together poorly, but the filmmakers keep choosing music that is obviously designed to elicit certain feelings in the viewer. I imagine them sitting back feeling very satisfied with themselves for choosing \"that\" song to portray feelings the characters should have been portraying through the actual story and script. I'm going to try hard to forget how they ruined \"I Can't Go For That\" by Hall & Oates with a bizarre, very bad dance scene involving Emma Stone and Bill Murray (what the heck was that?).\n\nAnd at the end of the day... what was the overall point of the movie? What was the theme? What was the moral/takeaway? There were several little ideas tossed in there together, but no strong unifying theme.\n\nAnd no, the \"final act\" (trying not to give spoilers here) wasn't a strong enough theme because it was so severely underplayed that it got lost in all the \"love triangle\" and \"emotionally unavailable guy gets swept off his feet inexplicably by too-eager woman\" and \"supernatural\" and \"native Hawaiians vs. The U. S. government\" stuff.\n\nAt the end of the say, this movie was just like watching a bunch of stuff happen. Boring and uninspiring. I'm giving it 4 stars because the acting was good despite the poor story, plot, and direction, and I suppose because it was set in Hawaii (which is always an undeniably beautiful \"character\" in any movie)."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "luciabcn86",
        "review_rating": "6",
        "review_title": "Bit weird but watchable",
        "review_detailed_main": "I agree with the other reviews that the film is a bit messy with many plots that dont seem to tie together. The saving grace is the silent husband and his subtitled conversations. So funny and random but weird."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bbickley13-921-58664",
        "review_rating": "5",
        "review_title": "Not impressive at all",
        "review_detailed_main": "The movie tries to suck you in with a trailer and a poster that showcases the parade of stars in it, that would have been great if they weren't just overblown and underused cameos surrounding this Bradley Cooper focused vehicle.\n\nThe plot seems interesting. A washed up Air Force pilot helps a billionaire launch a private rocket. The development felt like an action thriller from a Tom Clancy novel, but the delivery falls well short of even a lame espionage movie.\n\nBut it is a Cameron Crowe film so what we're really expecting is a movie about people connecting with one another\n\nThough the movie has its sweet moments, overall it falls short of fulling warming or touching the heart. The whole thing is splashed together too quickly and the pace did not allow me to feel enough for anyone to a point were I can say this movie is worth seeing"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "hickchickmom",
        "review_rating": "9",
        "review_title": "Flat out adorable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cyclecat",
        "review_rating": "7",
        "review_title": "Not Crowe's best effort, but a worthy contender",
        "review_detailed_main": "Say what you will about the plot (nonsensical, convoluted, confusing) and the casting (cringeworthy, insensitive), but go into this knowing that at its core this is a Cameron Crowe movie, which means it has heart. You can't say that about very many movies these days. And although even some of the heartfelt scenes were a little hokey (like the two guys' subtitled unspoken dialogue), they still touched me greatly. I know this movie spent about two hours at the theater before it was pulled and released on DVD. Don't let that stop you from a rental. The performances are top-notch and if you don't get at least a little choked up at the end, then you're a heartless shell of a person. Bonus: Like all Cameron Crowe movies, Aloha has a great, although somewhat incongruous and all-over-the-place, soundtrack. But hey, that's in keeping with the whole movie's theme! Enjoy it. ♥"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jadepietro",
        "review_rating": "5",
        "review_title": "Balmy",
        "review_detailed_main": "(Rating: ☆☆ out of 4)\n\nThis film is not recommended by both reviewers.\n\nIn brief: A trip to a tropical isle that is far from paradise.\n\nGRADE: C\n\nFirst, a short English lesson. A contronym is a word that can have an opposite meaning but placed in the correct context, that meaning becomes clear. As in: strike (to hit or to miss) or left (remained or departed) or as in Aloha (hello or goodbye) or Cameron Crowe's latest romantic comedy. It really is the cheeriest of contradictions, a paradox onto itself, a conundrum. Which also sums up my opinion about this totally forgettable movie. Nothing becomes clear in this well-made but disappointing romantic comedy. The actors are misused in a meandering script that wastes the time and talents of all involved, including the movie-going audience.\n\n￼All the stock characters are there, the roguish cynical anti-hero type named Brian Gilcrest (winningly played by Bradley Cooper), his former love interest, Tracy (Rachel MacAdams), and an undeniable idealistic new force of nature that enters his life, Alison Ng (Emma Stone). (This character also created a scandal of sorts in real life when controversy arose about the film's whitewashed views of the Hawaiian heritage and the fact that a Caucasian actress was chosen to play the role of a native resident, shades of Miss Saigon. Let's just say Ms. Stone is no Mickey Rooney either, fortunately. Her likability as an actress is there on the screen even if her credibility is sorely lacking. This miscasting throws the film off kilter and it never fully recovers.)\n\n￼Aloha's thin plot involves big business and our military machine joining forces to take over sacred land for homeland security purposes with Brian selling his unethical soul as he tries to make this deal happen. All this while he is reconnecting with his former sweetheart and falling for another soul-mate. These two story lines never gel or register any emotional interest.\n\nCrowe tries to set up realistic situations for his actors to explore, but it's all played with far too many heavy-handed touches. Parts of the film do have their charm and the dialog has some clever moments. (Crowe has a talent for amusing conversations and pithy catch phrases such as in better films like Almost Famous and Jerry Maguire.) But in Aloha, everyone seems to be overly caffeinated in their break-paced delivery and quirky attitudes.\n\n￼Characters barely resemble real people, more like eccentrics brought together as plot devices to push the action along. The roster of supporting personalities includes a wise-beyond-his- years philosopher child who is into mysticism and filmmaking (Jaeden Lieberher), a rich businessman with ulterior motives (Bill Murray), a hot-tempered bully of a general (Alec Baldwin, typecast once again in a blustery role), an unfunny sidekick with nervous tics called Colonel \"Fingers\" Lacy (a dreadful Danny McBride), a literally silent soldier husband unable to express himself to his loving wife (John Krasinski, giving the film's strongest performance), and an Hawaiian leader (actual nationalist, Dennis Bumpy Kanahele) whose t-shirt 'Hawaiian by Birth / American by Force\" sums up his entire character and the true serious theme for Crowe's film which sadly gets lost amid the silly romantic entanglements.\n\n￼Crowe's film is overstuffed with too many undeveloped sub-plots and characters that rarely make sense. They're all strung together and just lei there (pardon the pun). The film wants to welcome its movie-going audience with open arms; to be funny, loving, and warm all over. Yet there is an underlying desperate need to please, as when any tourist arrives on the island to its fanfare of insincere but beautifully staged welcomes. Aloha, unlike the actual word itself, can't have it both ways."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "anneclairedrocourt",
        "review_rating": "4",
        "review_title": "All over the place !",
        "review_detailed_main": "This movie was just all over the place, and not in a good way !\n\nI'm not a movie connoisseur, so I can't speak with really elaborate terms, this is my very simple review.\n\nIf, this was meant as a simple rom-com, this was almost a complete fail. The acting wasn't the big problem, the actors delivered good performances, but even they seemed to not know what the movie was about, what they were saying...\n\nThis was just plain awkward, it had the settings of a rom-com, but I think it tried really hard to not be limited to that, and failed spectacularly !\n\nSpecial mention for Emma Stone, she was the best actor in this picture."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "yusufpiskin",
        "review_rating": "7",
        "review_title": "Another classic by SONY",
        "review_detailed_main": "I put this on as i was going to sleep last night just so i could see the part where emma stone walks in with her basic-ass gap catalog flats/capris/button down combo like she's about to interview for an unpaid internship as a wedding planner and bradley cooper says \"boy i'm a goner\"\n\n\"When man becomes reconciled to nature, when space becomes his true background, these words and concepts will have lost their meaning, and we will no longer have to use them.\" Michelangelo Antonioni"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "raj-sahu7777",
        "review_rating": "4",
        "review_title": "What was the director Cameron Crowe thinking?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lemstone",
        "review_rating": "",
        "review_title": "Say Adios to Aloha",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Torres-cinema",
        "review_rating": "6",
        "review_title": "Could be better",
        "review_detailed_main": "Not the worst movie that i seen but, with this cast could and should been better. Major fails in the script."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Movie_Reviews",
        "review_rating": "4",
        "review_title": "Why was this movie made?",
        "review_detailed_main": "Absurdly... boring. Who paid for this movie, I wonder? Either it was the US Army who wanted to show how politically correct they have become (they keep mentioning \"The New Army\") or it was Hawaii that paid for the movie. Or both. It was NOT created for the revenue stream of the cinema visitors, that is for sure.\n\nThere was no real plot. No depth. Nothing. It was just.. boring. And this in spite of it having some really good actors. But good actors are unable to transform a movie that has no plot, no meaning and no depth.\n\nConfusing.\n\nI would certainly not recommend it to anyone."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tamborini-11946",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": "Lightweight entertainment against the background of beautiful Hawaii."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ArchonCinemaReviews",
        "review_rating": "3",
        "review_title": "Disappointing - I am embarrassed for Crowe, Stone and Cooper for their contribution to this tedious bore",
        "review_detailed_main": "Aloha is garbage and an example of everything wrong with Hollywood.\n\nWe at Archon first heard of Aloha many moons ago when its stellar cast started garnering media attention. Even then, we were wary, something about it seemed too pristine, too gimmicky to be an average to good film – and our suspicions were correct.\n\nCameron Crowe's Aloha is about a military contractor, played by Bradley Cooper, who returns to Hawaii after his most recent assignment. When he lands, he must face his ex-love, another subversive assignment and an aspiring Air Force fighter pilot anxious to make a name for herself while tasked with watching him.\n\nTechnically all of these plot events do transpire in Aloha, but the film itself veers so greatly from a plot that it is just a meandering collection of conversations without reason. How can someone like Cameron Crowe, the genius behind Almost Famous, be responsible for this bland mockery of a film? It is like Cameron Crowe has no soul anymore, nothing left to say, and didn't even bother trying with Aloha. He utilized boring and tedious voice over monologues to tell the audience what the character wants using horrid metaphors and lame exposition. That is all well and good for a Lifetime movie, but is well below what we've come to expect from Crowe.\n\nAnd the narrative and direction is not at all close either. An assortment of tiresome conversations scattered about relating to a miscellany of plot subjects. Crowe's direction is tasteless and uninspired, with overly saturated cinematography that is completely irrelevant and pointless. I grew so tired of watching the film that I decided to turn it into a drinking game with one rule being take a shot every time Crowe shows Emma Stone in a medium close-up as she looks over her shoulder. Hint, probably wanna change that rule to 'take a drink' because you will get wasted.\n\nAs an actor, you can only do as much as the script allows, and Aloha is quite boring. However, all but Rachel McAdams are punchy and irritating with the worst being Stone herself. The film does nothing but to highlight her monotony in her performances across her career. Every single scene is so all over the place emotionally that there is no inclination as to where any of it is coming from. And in regard to Emma Stone playing a character named Allison Ng who is supposed to be a quarter Hawaiian and native to the island – the most blaring issue is not her fair skin but her inability to have the audience believe, truly, that she is part of Hawaii and cares for the land, the sole purpose of her performance as the character.\n\nWe are just so painfully disappointed in this garbage that is so beneath Cameron Crowe. By far, Aloha is his worst film to date, but more importantly, doesn't even feel like a Cameron Crowe film. I am actually concerned for him, as the completed project feels so unlike him that I am actually worried he might have some some of brain issue.\n\nAloha's story is a bore, and fails splendidly at forcing the audience to have the capacity to feel and care, which is completely the director's fault. Aloha is odd in a bad way, uncomfortable to watch and completely unbearable.\n\nPlease check out our website for full reviews of all the recent releases."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "katewodiuk",
        "review_rating": "10",
        "review_title": "Feel Good Movie",
        "review_detailed_main": "It is not often that I see a movie that leaves me feeling good, but this one did. The characters were likable people. The relationships between the characters were interesting. The plot was simple and sweet. It is a romantic comedy, so it's easy to see how things are going to turn out, but the ending was still a pleasant surprise. There are plenty of things throughout the movie that made me laugh.\n\nI love the cast. Bill Murray is an all time favorite. Rachael McAdams is adorable as always. John Krazinski is handsome and silently funny. Emma Stone is beautiful and goofy. Bradley Cooper is hot and complicated. What more could you want in a romantic comedy?"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dbuckshnis",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dariansdad",
        "review_rating": "5",
        "review_title": "This is based on the 8-minute trailer with more to come.",
        "review_detailed_main": "The only reason an 8-minute trailer is released is because there aren't enough 10-second clips you can throw together to make a 3-minute tease that would make people want to see the movie. However, these eight minutes are not exactly what I would call \"enticing\".\n\nI was led to the clip by a headline that proclaimed the whole thing a pig and because I'm such a fan of Emma Stone that I would seriously consider paying $16.75 to watch her fart the phone book. Now that my life is 8 minutes shorter (not counting the time to post this review) I must say that with such huge names from director to supporting, this looks like a waste of $150,000,000 or whatever the budget was.\n\nThe cast is awkward, overacting, distant and robotic. Virtually unwatchable but I think I may be jumping the gun. Could we possibly be watching a future cult-classic with every cliché jumbled together in such a way that you have to let it flow over you? I will update after seeing the entire feature."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jarvizu",
        "review_rating": "5",
        "review_title": "Far-fetched",
        "review_detailed_main": "OMG what was Cameron Crowe thinking? He wasn't during the making of THIS film. I love all of his films. Please explain what happen to the far-fetched film.\n\nYou placed some of the best actors in a film that was literally thrown together/apart!\n\nBill Murray seemed aloof/stoned whatever.\n\nThe \"not talking\" parts and then the subtitles were not really funny. Or was it suppose to be funny.\n\nAnd, do you really think our military can be that stupid, or no one in Hawaii could figure out what was really going on? Maybe Mr. Crowe was trying to show how stupid everyone was!\n\nWE all love Bradley Cooper's eyes. We get it. But how many times do you need to zoom in.\n\nOh yes, at the very beginning of film when they were zooming around Cooper and Stone with the camera. (I think hand held) I was truly getting Dizzy.\n\nI am so sad that this film just did not connect!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "fridavole",
        "review_rating": "7",
        "review_title": "this movie gave me a good and warm feeling in my chest",
        "review_detailed_main": "At first glance, you can see this isn't one of the top quality movies out there. It is a obvious romantic drama, and those types of movies are very rarely rated good so if you are a person who loves all those cheesy feel good movies - then this is one of them. Maybe in some ways this movie is a bit messy, but it still had a clear red line throughout and a nice plot. Also the actors are doing their job well and I did not cringe the least once.\n\nI enjoyed it. I even had to go 10 seconds back a few times just to relive the cute moments, but that is me. I am also one who watches the more serious movies by Spielberg, Scorsese, Fincher etc. My point is that this is a movie worth giving a chance, you may not like it or you may end up enjoying it on a late night by yourself to have something to smile about.\n\nI was left with a good and warm feeling in my chest after ."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "useazebra",
        "review_rating": "1",
        "review_title": "So bad that I created an IMDb account just to rate it",
        "review_detailed_main": "Pros: Great actors and actresses\n\nCons: Terrible script, non-stop awkward scenes that would never ever happen in real life, weird editing choices, terrible sound mixing, and nonsensical plot. Not even John Krasinski and Bill Murray could save this film.\n\nThe film contains numerous military personnel, but none of them act like military. Zero military bearing. Zero understanding of military chain of command, approvals, promotion criteria, etc. It was honestly painful, and I'm not military.\n\nThe film also talks about spaceflight with zero comprehension of the industry. It's honestly insulting, just how little they understood of how and why private space industry is a thing.\n\nIt has a plot, but it's nonsense. A real plot is based on people acting like real people--or at least justifiably--to get what they want. The characters don't behave like real people, and they don't reasonably or consistently pursue things that they want.\n\nThe actors did a good job--John Krasinski in particular--but there's only so much you can do with a terrible script, lousy directing, and editing/sound that makes you look and sound like a derp."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Boristhemoggy",
        "review_rating": "6",
        "review_title": "A love story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cultfilmfreaksdotcom",
        "review_rating": "1",
        "review_title": "A New Low In Filmmaking, Acting, & Everything Cinematic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "vanderpool-jonathan",
        "review_rating": "7",
        "review_title": "For a good warm time, watch",
        "review_detailed_main": "If cinema is meant to make you feel or think or react I'd have to say this movie is delightful. Rachel McAwesome, check. Emma Stealmyheart, check. Bradley Coolbud, check. Toss in Danny McBride, Bill Murray and Alec Baldwin for all kinds of layers that make it interesting and unique. Loved the Air Force and space interest aspects. Loved Emma as a fighter pilot badass with a heart of gold. Loved the scene with the native Hawaiians. The story wasn't told quite as well as I'd wished but was certainly told well enough to watch a hundred times. I'm not going to pretend I wouldn't watch any romcom/drama with Rachel McAdams. I would and intend to. I won't pretend I don't find Emma Stone to be a stunning delight. She is. And those are only two of the many reasons this movie was a real joy. But, perhaps the best reason is the dance practice scene that caps off this heartwarming tale ;)"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Quietb-1",
        "review_rating": "5",
        "review_title": "Should have been much better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "brendadonargo-88104",
        "review_rating": "8",
        "review_title": "I loved it I don't care what the critics say. I say see it",
        "review_detailed_main": "I think they are being way to hard on this movie. And it's not just another rom com. I laughed and cried ...the acting was great, the story was touching and dimensional as were the characters. It might have been a little predictable in spots but in the best way. And I loved the soundtrack. I think Mr. Crowe is a genius and that the cast chemistry was inspired. I could see real life situations in the movie and most rom com's can't really say that ( though they are enjoyable and have their place). This is a movie that will appeal to a lot of people of many ages and of both sexes. I give it two thumbs up. Take a chance I think you will agree.\n\nA movie buff."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "drjlo",
        "review_rating": "7",
        "review_title": "Not Bradley Cooper fan but enjoyed the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ThomasDrufke",
        "review_rating": "4",
        "review_title": "You Didn't Have Me At Aloha",
        "review_detailed_main": "Cameron Crowe is one of my favorite directors. He never fails to put a smile on my face, even if it's my 15th time watching the same film of his (Almost Famous). But with 'Aloha', it doesn't seem like his film at all. In fact, at times the film seems as though it's 3 different projects jumbled into one. Aloha was one of my most anticipated films this year, and with a cast that includes the likes of Bradley Cooper, Rachel McAdams, and Emma Stone, I didn't think there was any way this film would let me down. Boy, I was wrong. The trailer was fantastic. It had great music, great character drama, and a beautiful landscape, that's the makings of a great Crowe film. Unfortunately it was a bland and forgettable as a film can be. If you cant get a good film with all of the great things on your side, than there's something going on here.\n\nI heard there was some serious behind the scene issues with Aloha. Ones that took Crowe out of the promoting of the film and even Sony's lack of marketing for the project. I mean there was only one trailer, ONE. Movies these days spit out at least 3-4 trailers per film with upwards of 5-7 TV spots. Sony has had a lot of trouble both in and out of their film branch, so I'm not overly surprised by the behind the scene issues. I just hope that it wasn't a situation of Crowe not being able to make the film he wanted to. If the blu-ray comes along with a new and improved directors cut than I will probably have a better idea of how to score the film. But for now, it was a complete mess. It tells the story of a military contractor who returns to Hawaii where he reconnects with his long lost love and simultaneously meeting the new fling in his life. It's a hard film to review because there are many plot points and situations that just didn't seem like things that a seasoned director would put in a movie in an actual theatre. I will say that there are moments of Crowe greatness but it's so rare that it gets lost in the mess of love triangle. I never bought into the Emma Stone-Bradley Cooper fling. I saw a reviewer talk about how her character thinks she's in a Will Ferrell comedy at first until toning it down later on, and that's completely true. The two seem like they are playing characters from different movies and somehow their dialogue matched up.\n\nI will say that I don't believe the film deserved the whitewash criticism as much as it got. There's no question that the main cast is all white and could have been more diverse, but Hawaiians are present in the film throughout, they're just not the leads. But the thing that most bothered me was the lack of human emotion and heart to the film. Crowe often creates great characters who I believe to be sharing moments with each other. Here, the characters are simply all in a Hawaii at the same time and happen to do things that somewhat relate to one another. The whole side story of setting up satellites with Bill Murray was a waste of time. I think if the film focused on Cooper's past with Rachel McAdams, who Is the best part of the film, rather than forcing us into a relationship with Emma Stone, it would have been much better. I love Emma Stone as much as the next guy but the chemistry just wasn't there. Plus, the way the characters are written, Cooper is much better off going after a woman like McAdams than Stone. Danny McBride and Alec Baldwin have some laugh worthy moments but the trailer sold the film much differently. I got the sense that Murray would play a man that helps Cooper get through his past and look to start a new future. And that John Krasinski would play the funny jealous husband. But instead Murray's character has no common sense and Krasinski is cringe worthy as he tries to his best cool guy impression. But there is a really sweet story underneath the rest of the film. Cooper and McAdams are really good here, and the reveal towards the latter half of the film gave the depth it needed. It was just too late for me. And then where the characters end up was too cliché for my liking. I was really disappointed with this one. Just another big letdown in 2015.\n\n+Cooper & McAdams\n\n+Reveal sweetens the story\n\n-Character decisions are laughable\n\n-Stone's misplaced tone\n\n-No heart\n\n-Pacing issues\n\n-Feels like 3 different films into one\n\n4.6/10"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "estebangonzalez10",
        "review_rating": "5",
        "review_title": "Almost saved by its feel good ending, but too many structural problems.",
        "review_detailed_main": "\"You sold your soul so many times, nobody's buying anymore.\"\n\nThe final 20 minutes of Aloha completely feel like a Cameron Crowe movie since it ties everything up neatly without being overly cheesy. It still is sentimental and has a couple of quotable lines, especially in a scene where Rachel McAdams is reading a letter from her husband. It also has some funny moments, my favorite being the scene in which Bradley Cooper and John Krasinski stare at each other understanding what the other is saying without speaking a single word (but we get to read the subtitles and it is a hilarious scene). Aloha ended in a rather strong note for me, but unfortunately the film is 105 minutes long and the first two thirds of the film make very little sense. The introduction of every character in this movie is done in such a rushed way that none of them feel authentic or interesting. The plot is a mess and it is all over the place at times so I agree with all the hate the film is receiving, but I honestly don't know how Crowe managed to engage me in those final 20 minutes considering I didn't care for these characters or their story, so I will give him some credit for at least ending Aloha on a strong note. At the beginning of every year, I make a list of my most anticipated films and Aloha was one of the top 10 movies I was looking forward to basically because I'm a Cameron Crowe fan and have enjoyed all his previous movies (I defended his lesser films: We Bought a Zoo and Elizabethtown, which I was a strong fan of). It also didn't hurt that he had a wonderful cast to work with: Bradley Cooper, Rachel McAdams, Emma Stone, Bill Murray, John Krasinski, Danny McBride, and Alec Baldwin. And to top it off Crowe was setting the story in the gorgeous islands of Hawaii. So what could go wrong? Everything did from the writing to the casting of the characters and in the end I simply couldn't defend Crowe on this one. At least I went into it with much lower expectations so I wasn't disappointed and ended up mildly enjoying it for its final twenty minutes. I still have to catch up with Crowe's earlier film, Say Anything, and hopefully after watching that he will regain my trust again.\n\nAloha centers on Brian Gilcrest (Bradley Cooper), a military contractor who is returning to Hawaii after 13 years to convince the King of the island (Dennis Bumpy Kanahele) into giving them a 20 minute blessing in the approval of an Air Force gate. Brian is currently working for a millionaire named Carson Welch (Bill Murray), who is planning on launching a satellite from there. Brian's ex girlfriend, Tracy (Rachel McAdams), continues to live in the island, but she is married now with Woody (John Krasinski) and has two children. Upon Brian's arrival the two meet up and they continue to be very fond of each other. During his visit, an Airforce pilot named Allison (Emma Stone) is assigned as his watch dog and despite an awkward introduction the two begin to form a friendship, thus creating a sort of love triangle. Danny McBride and Alec Baldwin have small supporting roles as military officials.\n\nThe plot doesn't make much sense throughout the entire film and the narrative seems to be missing something. I don't know if it's the way the film was edited or simply because of the screenplay but it is incoherent. Crowe has always excelled as a writer so it's difficult to understand what went wrong here. The entire mythology surrounding Hawaii and their belief doesn't make much sense either and it doesn't add anything interesting. For example, Tracy's son, played by Jaeden Lieberher, is always filming everyone with his camera and talking about more of the island's mythology, while Allison also seems to be in awe of the spiritual energy of Hawaii, and she tells everyone she meets that she is one quarter Hawaiian. That Emma Stone was cast in this role is the least of the film's problems (I've met many white folks who are Asian descent and you'd never notice it). As much as I love Murray and Baldwin, their characters are given nothing to work with here and they are completely wasted. Cooper, Stone, and McAdams had a rough start but eventually their characters grew on me. Krasinski is the actor who comes out of this film best, but I'm afraid Crowe missed out on an excellent opportunity to direct these talented actors in such a wonderful location.\n\nhttp://estebueno10.blogspot.com/"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "turindebrouche",
        "review_rating": "7",
        "review_title": "Its deep if you look it right.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "artscommented",
        "review_rating": "5",
        "review_title": "Enjoyable, but a little disappointing...",
        "review_detailed_main": "This movie is a typical example of a project that had everything to work\u0085 but didn't. Written and directed by Cameron Crowe (who also directed Jerry Mcguire, Say Anything, Vanilla Sky, etc.), \"Aloha\" had a great trailer, but the movie itself was disappointing.\n\nI believe it was mainly supposed to be a romantic comedy, but I didn't laugh that much\u0085 The beginning of the movie is quite confusing and it takes a while to fully understand what's going on. It feels like the script was out of order sometimes. Besides, it is very similar to Elizabethtown (2005), also directed and written by Cameron Crowe, which helps me to prove the point that it's not one of Crowe's best movies.\n\nIt's a watchable movie, but it's also very forgettable, in my opinion. The cast is what makes it worth watching.\n\nhttp://www.artscommented.com/movie-review-aloha-2015/"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "6",
        "review_title": "Mis-directed and mis-advertised but certainly Cameron Crowe.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "laughingmike",
        "review_rating": "2",
        "review_title": "Good points: the cast, bad points: EVERYTHING else!!!",
        "review_detailed_main": "This really is one of the worst films I have EVER watched and I begrudge the 99 minutes of my life I wasted on it!!!\n\nWhat a cast (thank God for the eye candy!!!) but why they said yes to this film I have no idea!!!\n\nRom-Com, farce, political statement, was this film trying to be all of them?\n\nI know we are all different and I try and respect other people's opinions but I cannot understand the people who are defending this film.\n\nEach to their own I suppose but if after watching you agree how bad this was leave a low score review and thumbs-up on this one to save people from this film!!!!!!\n\nGL."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Johnny-113",
        "review_rating": "6",
        "review_title": "Good film",
        "review_detailed_main": "The most I heard about this movie was that many people were horrified that Emma Stone was playing a Hawaiian woman. Well, in the film she's playing a woman who is one-quarter Hawaiian. That IS believable. That kind of criticism is petty. If you look at film history, there have been far more outrageous incidents of this type of casting.\n\nI liked this film because I didn't really know where it was going, so it was interesting and not predictable. There are a few very funny moments. There are some very touching moments. It's a thoughtful film, so it puzzles me when other one note idiotic comedies, horror and actions film are deemed successful because they made a lot of money and entertained morons.\n\nI intend to see this again. I recommend it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "blott2319-1",
        "review_rating": "2",
        "review_title": "So much wasted talent",
        "review_detailed_main": "Aloha is the kind of shoddy and terrible movie that makes me question if Cameron Crowe was ever a decent writer/director. II think a couple of his films are OK, but perhaps Hollywood should think twice before writing him a blank check. This script is shockingly bad and embraces the kind of cheesy melodrama that is typically relegated to made-for-TV movies. Even established tropes like the manic-pixie-dream-girl are not handled well. Emma Stone's behavior is a messy mix of quirky and downright annoying, but of course Bradley Cooper has to find her irresistible. This is made even harder to believe because they have Rachel McAdams in the film as a perfectly normal and lovely person that would clearly be a more attractive option. But script-writing 101 demands our hero not be a homewrecker, so he must choose the new girl no matter how obnoxious she acts.\n\nThe underlying plot of Aloha is handled horribly, and they race through a number of details without allowing them to have any emotional resonance or proper impact on the story. Everyone just behaves in a certain way because the movie needs things to happen. Even the plot itself is built upon a number of coincidences and conveniences that all line up perfectly just because it helps resolve the movie in a manner that will be agreeable to as many movie-goers as possible. The saddest part of this whole film is that so many superb A-list actors wasted their time trying to make something good out of this bad movie. I was willing to give Aloha the benefit of the doubt because I can get on board with a sappy romantic comedy even if it's not the best script, but I genuinely think there are Hallmark movies with better writing and directing than Cameron Crowe offered here."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ShelbyTMItchell",
        "review_rating": "8",
        "review_title": "Cute Film In An All Star Cast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mcgregorrowland",
        "review_rating": "6",
        "review_title": "Not great but a nice feel good movie",
        "review_detailed_main": "Now I'm not a chick flick person but when I saw the trailer to this movie it was just one of those movies that looked good. And it was an OK movie but it was not like AMAZING.\n\nThere was some things in the movie that just did not work well with the plot and it was just kind of weird. I do not want to tell what these things were as it will spoil the movie.\n\nOn the other hand Bradley Cooper and Emma Stone were awesome together and the same with Cooper and Rachel McAdams. These characters made the movie flow smoothly and also pretty much made the movie work. You felt happy for these 3 characters which made you smile when the end credits rolled up. But other than that, there was nothing special about the other characters or events that happened in this movie which made the movie a little cheesy.\n\nIf your looking for a mediocre flick and you wanna watch a nice feel good movie then you will enjoy watching this."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "stevendbeard",
        "review_rating": "5",
        "review_title": "Missed It By That Much",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "shawneofthedead",
        "review_rating": "3",
        "review_title": "The white stuff - and also the wrong stuff.",
        "review_detailed_main": "Typically, movies with an acclaimed director and top-notch cast arrive in cinemas trailing Oscar buzz. Not so Aloha, however, which drags in its wake a raft of controversies. Chiefly, Cameron Crowe has been lambasted for his unfortunate decision to cast whiter-than-white Emma Stone as high-flying air-force cadet Allison Ng, who's a quarter Hawaiian and a quarter Chinese. That's off-putting enough, to be sure, especially since no one in the film - including Ng herself - seems to be able to pronounce her surname. But the even bigger problem with Aloha is that it's, quite simply, a mess of a film: an amiable mess, in parts, but a mess nonetheless.\n\nOnce a boy who dreamt of exploring the stars, former military man Brian Gilcrest (Bradley Cooper) sold his soul many moons ago to money-grubbing corporations with designs on outer space. After a serious screw-up in Kabul, he's been handed a second chance in Hawaii by billionaire Carson Welch (Bill Murray) - he's tasked with getting the king of the Hawaiian nation, an old buddy, to perform a blessing for Welch's latest, privately-funded project. But Brian finds himself reluctantly mixing business with pleasure: as he bickers and banters with his perky, idealistic air-force liaison Allison Ng, he's plunged back into memories of his troubled past when he runs into Tracy (Rachel McAdams), an ex-girlfriend who's started a new life with her husband Woody (John Krasinki).\n\nTo say Aloha is awkwardly written is an understatement. Crowe reportedly worked on the script for four years, as stars like Ben Stiller and Reese Witherspoon came and went. But very little of that effort is evident on screen. The film never quite decides what it wants to be. It swings from a drama about one man's spiritual rehabilitation to a bizarre rom-com love rectangle, spiced with a gently political (and yes, blithely racist and white-centric) meditation on the land, the sky and Hawaii's place in America. None of it strictly makes sense or connects with anything else, before culminating in a surreal sequence lifted out of a B-grade apocalyptic thriller. (Where do Brian's hacker skills come from?!) Small wonder that former Sony co-chairman Amy Pascal lamented in one of her leaked e-mails: \"I'm never starting a movie again when the script is ridiculous.\"\n\nEven the characterisation - typically Crowe's strong suit - wavers and wobbles all over the place. It's hard to tell whether and when we're supposed to sympathise with Brian, because his motivations for pretty much everything he does never become clear. The other characters in his orbit are paper-thin, buoyed more by the charisma of the actors playing them than the words they're asked to speak. Tracy's reaction to Brian's reappearance in her life is particularly puzzling: is she flirting with him? Does she love Woody at all? Is she trying to hint at Brian about their past, or give him advice on his future? As with most things in this film, it's a confusing mix of everything Crowe has dumped into the script, shorn of focus and, oftentimes, logic.\n\nAdmittedly, there are a few patches of charm that shine through the whole mess. Crowe's cast is devastatingly white, yes, but - for what it's worth - they are all very good, very watchable actors. It's fun to watch Murray and Stone, buddies from their Zombieland days, perform a super-weird pas de deux on the dance floor, and Alec Baldwin is very funny as a perennially shouty general. Krasinski pulls off some great comedy - and a little tragedy - as the taciturn Woody, particularly in a final face-off with Cooper that's easily one of the highlights of the film. Bits of Crowe's dialogue sing, as does his trademark bouncy, eclectic soundtrack.\n\nIt's far from enough to salvage the entire film, however. Fans of Almost Famous and Jerry Maguire would know that Crowe has an ear for dialogue and a knack for romance and kooky optimism. But that, as Aloha definitively proves, do not a good movie necessarily make. There are a few interesting ideas simmering beneath the surface of Crowe's sun-kissed film, but they never really break through. Most of the time, the film drifts along on its own strange internal rhythms, depending too much on its put-upon cast to unearth logic and sense where, perhaps, there isn't any to be found."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "chloegalley",
        "review_rating": "7",
        "review_title": "A light heart romance film!!",
        "review_detailed_main": "Aloha is a 2015 American romance film starring Bradley Cooper, Emma Stone and Rachel Mcadams. I wouldn't class the movie as a comedy more of a romance. Cant not understand the low rating and it should be more don't base it on the rating and watch it. Great acting especially from Bradley Cooper with a very nice storyline. I really enjoyed it and was very believable. All cast movie from great actors and actresses. If you want to watch it it's streaming on Netflix right now. All I can is if you like romance then this your movie go and watch it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Floated2",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": "Aloha starring Bradley Cooper where he plays Brian Gilchrest, a military contractor who almost lost his life and career in Afghanistan. Fast forwards many years later, and he's now given a second shot in Hawaii, where a flamboyant billionaire (Bill Murray) is paying him to negotiate with Hawaiian tribesman and put a satellite into orbit. Greeting Gilchrist at the airport are his ex-girlfriend, Tracy (Rachel McAdams), ensconced with her new love (John Krasinski); as well as a fast-talking fighter pilot named Allison Ng (Emma Stone), who has been dispatched to babysit Brian while he's in Hawaii. The plot of Aloha is held at bay for so long that eventually it arrives in a pile-up of last-minute twists, and strangely and belatedly the film's two funniest scenes."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Ghostrider",
        "review_rating": "7",
        "review_title": "Hoping for a director's cut on this one",
        "review_detailed_main": "Great actors, and a lot of very good acting. It's not an easy comedy, but not a drama either. Somwhere in between. I really liked the movie and the characters in it, but I understand why some people see faults in it. The movie has several different things going one, and it get's a little messy. Some things are maybe not explained or introduced thorough enough, which is why I think this movie actually could have benefitted from being a little bit been longer. I would have liked to understand more of the background to Gilcrests relations with the native Hawaiians. Also, what goes on in the base and with the satelite stuff was a bit unclear for a longer period. And Ng's relationship to it, and why she felt the way she did was unclear to me. I got the feeling that the movie is nearly there, and could really have been a great movie with some minor alterations. But it's watchable due to the great actors alone."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cccjerkycompany",
        "review_rating": "1",
        "review_title": "what a waste of talent",
        "review_detailed_main": "I would give it a 3 if it weren't for the fact that there was so much talent to be utilized. Sadly, it is the only film I haven't enjoyed with Sir Bill Murray in it (yes I have the power to Knight someone). Gladly, he was great despite the horrific writing and subject matter. I guess Bradley (it's funny when you don't use his surname - Bradley, put down that doll! :)) has reached that pivotal moment in celebrity where he now thinks, a. he doesn't have to give it his all; and b. he thinks we give a poop what he thinks. Oh well, it's just a movie. And Emma, you're always good. Keep it up.\n\nStay gold Mr. Murray!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "valeriefoy",
        "review_rating": "",
        "review_title": "Aloha aaahhh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Evanoil",
        "review_rating": "7",
        "review_title": "Pretty good drama",
        "review_detailed_main": "This movie is very confusing , it has a lot of characters played by good actors , the only problem is that the script has lots of holes in it . Lots of times i saw scenes that seem to deliver nothing , now i understand why . The movie is trying to be a romance comedy flick but it seems like the writer had a little problem giving us the right amount of anything so it got pretty messy . The only thing that is saving the movie are the awesome actors who i don't know even how accepted the roles in this film , maybe they got miss leaded like all of us . I must say that the movie was pretty heartwarming , i don't even know why but i really enjoyed the whole movie even though it is walking the thin red line of being really bad versus being good. It is almost a chick flick , only the guys can watch it too without getting too bored."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "phd_travel",
        "review_rating": "2",
        "review_title": "Strange mish mash of a story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "simcard-40799",
        "review_rating": "9",
        "review_title": "Give it a try. This lives up to its All-Star cast.",
        "review_detailed_main": "I am well aware of all the shade and low reviews thrown at this movie, however this did not stop me from seeing it and frankly I'm glad it didn't. To me it lived up to the All-Star cast, Emma Stone, Rachel McAdams AND Bradley Cooper, do I even need to bring up all their academy award nominations?? And they did not disappoint in Aloha. There couldn't be a better setting for the movie than Hawaii, the whole scenery in the movie is beautiful and fits the characters and story well. I will say that a couple parts of the story line fell a bit flat and were slightly disconnected but the overall plot and story played out well which I personally thought made for a great ending. Oh and the subtle humor satisfies the comedy side quite well (thank John Krasinski and Alec Baldwin for a lot of that).\n\nSo overall I was very pleased with this film and if you are on the fence as to see this film or not all I have to say is give it a shot!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "george.schmidt",
        "review_rating": "6",
        "review_title": "Hodgepodge romcom from Cameron Crowe who sadly is not rekindling his flame as a fine filmmaker.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "markbarner",
        "review_rating": "4",
        "review_title": "Writer thought he was Shakespeare but wasnt",
        "review_detailed_main": "What a complete odd script and it's clumpsy the way they talk. It's almost like they want to talk in code and slang that it makes it off and awkward 90% of the time.\n\nThe writer clearly thought this is was like a long strange prayer the way they talk. It's like yoda makes more sense than any of these dialogs in this movie! The director even liked the oddness so much that it rubbed off on the actors making me think that every role they got after this movie must have been a relief that they got hired again. It goes to show that a director and a writer can ruin a good setup of a movie.\n\nThis movie is more of a love story for Hawaii and for good reason but unfortunately it missed and ruined the good vibes with all that annoying talk! Would rather see a stuttering Shakespeare than this movie :-/\n\nBaaah it was wasted!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "zachpurdy",
        "review_rating": "1",
        "review_title": "Horrific MOVIE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "gwhiteside-79402",
        "review_rating": "",
        "review_title": "Makes me want to visit Hawaii!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "andylaode",
        "review_rating": "7",
        "review_title": "It feels good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cheyenneman",
        "review_rating": "3",
        "review_title": "Potential lost with such a great cast",
        "review_detailed_main": "I was excited to watch this movie with such a great cast, but was so disappointed. It was so lackluster and beyond blah. Nobody in this movie stood out in any good way. I know that a lot of movies with the military in it don't do correct justice to the military and this movie was no different. I feel like it didn't do good justice to Hawaiians either. This movie seemed way longer than it really was due to the dullness of it. Even though it has great actors in the movie, I strongly advise against watching this movie. It's not worth it, it's not worth it, it's not worth it. Just don't do it. Please, please don't do it!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "grnhair2001",
        "review_rating": "6",
        "review_title": "It's a Cameron Crowe movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "escapadeartist",
        "review_rating": "1",
        "review_title": "WTH is this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "nassir_y",
        "review_rating": "6",
        "review_title": "Wait for the ending",
        "review_detailed_main": "Ok it wasn't a great movie but definitely worth watching. It is a feel good movie with a story one can relate to from ones own life.\n\nThere isn't much of a story but definitely will touch your heart. Wait for the end. I cried, perhaps you might too!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "eddie_baggins",
        "review_rating": "4",
        "review_title": "Miscast and misguided, a real letdown from Crowe",
        "review_detailed_main": "What a strange movie Aloha is. A film that is neither a proficient drama, a funny comedy or a romantic love story and it's a film directed by well-respected and renowned filmmaker Cameron Crowe, the man responsible for Almost Famous, Jerry Maguire and Say Anything and many others making Aloha's failings even more baffling.\n\nPut simply, Aloha is a messy film, an unfocused one even. From the films unappealing opening through to its lacklustre building blocks, Crowe for perhaps the first time ever has produced a truly heartless, soulless affair that for reasons unknown is also a for no good reason at all, complicated and almost incoherently structured tale.\n\nWhat could've been a simple and heart-warming tale of finding love, redemption and friendship on everyone's favourite island of Hawaii instead becomes a strange mix of island lore, satellite wars and hula dancing lessons and Crowe seems to have become lost in his own self-worth with his no doubt personnel love letter to the American state. For a filmmaker so well adverse with making feel good titles it's such a shame Aloha just never gels, right down to a miscast and struggling A list cast.\n\nMuch was made upon release about Aloha's casting choices but not looking to ply into Hollywood politics the end result of it all is that Aloha wastes a normally likable group of actors and actresses with unlikeable and non-relatable characters. Led by Bradley Cooper's self-obsessed pilot turned contractor for hire Brian Gilcrest no one comes out of Aloha on top with Emma Stone's part Asian (yes part Asian) Allison Ng the worst off while the underused Danny McBride and Bill Murray may as well of not shown up.\n\nIt seems as though there was material left on the cutting room floor in concerns to Aloha's wasted cast and overly packed narrative but it will never be known if it would've been enough to save Aloha from its downright mediocre nature.\n\nRedeemed somewhat by its winning island locales, a small amount of heartfelt scenes and an ending that belongs to a much better film, Aloha isn't the years worst film by any stretch of the imagination but its most certainly one of the year's most disappointing and it takes some type of effort to waste a cast like Crowe does here and the one time unflappable director has a lot of work ahead of him to get back to the perch he once sat on.\n\n2 baby's called Don out of 5"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ydnarkoocob",
        "review_rating": "9",
        "review_title": "Aloha is a Hit Worthy of the Writer/Director of Say Anything",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jwayne_24",
        "review_rating": "6",
        "review_title": "What could this have been?",
        "review_detailed_main": "After seeing the trailers, I was excited to see this. I missed it in theaters and rented it on Redbox. I have to say i'm glad I didn't spend the money for a movie ticket, as it was a big letdown. Alec Baldwin and Bill Murray's characters are absolutely awful and are completely undeveloped. Rachel McAdams and John Krazinski are both favorites of mine, but in this movie they have no spark whatsoever. The only thing that makes this watchable is the relationship between Bradley Cooper and Emma Stone's characters. They are entertaining and sweet in how they take a complicated path to being together.\n\nWith that being said, this movie was simply all over the place. Story lines were introduced and then abruptly dropped and almost every problem was left without a resolution. Its like someone took several good scenes and ideas, shook them up and tossed them on paper. This film just doesn't work as a complete picture. With so many talented actors involved, I can't help but think: How good could this have been? My grade: C-."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "Goodbye Horseshit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "danew13",
        "review_rating": "4",
        "review_title": "A Routinely Shallow Romance with Little to Offer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lor_",
        "review_rating": "",
        "review_title": "Failure of the Hollywood formula",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Jackbv123",
        "review_rating": "7",
        "review_title": "A movie full of emotions and love flawed by script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "StevePulaski",
        "review_rating": "3",
        "review_title": "It's time for Cameron Crowe to come back to Earth",
        "review_detailed_main": "\"Aloha\" is the classic example of a film that bites off so much more than it can chew that it begins to choke early and all we can do is passively witness its inevitable cardiac arrest. The film takes elements from the romantic comedy, science-fiction, family drama, and comedy genres, but never finds a way to mesh them all into a package that's worth opening. As a result, what unfolds is a hybrid of pale plot-threads and exhausting scenarios that stretch the line of credulity ever-so thin that it becomes impossible to sympathize with the characters and believe their scenarios in any respect.\n\nWhat a shame too because this film squanders the screen writing and directorial talents of Cameron Crowe, along with actors like Bradley Cooper, Emma Stone, Alec Baldwin, Rachel McAdams, and Danny McBride, all of whom have proved themselves to be hugely commendable presences in a wide variety of roles. With \"Aloha,\" we focus on Cooper's Brian Gilcrest, a failed defense contractor, who is assigned to oversee the launch of a weapons satellite from Hawaii. This assignment comes with a potential precedent to militarize space, along with convincing Hawaiian natives that this launch would be beneficial for them in the long-run (in what way, I'm still trying to figure out). All of this is designed to benefit a multimillionaire named Carson Welch (Bill Murray in a role so empty that even he looks half asleep most of the time).\n\nGilcrest is assigned to work with Allison Ng (Emma Stone), an Air Force pilot, in Hawaii for the meantime. Allison's energetic, often spunky personality gets under the skin of Gilcrest, a hardened cynic, who is also trying to reconnect with his ex-girlfriend Tracy (Rachel McAdams), who is now married to John (John Krasinski) with two kids. John is a cartoon of a character, never speaking in the presence of Brian and only exchanging ambiguous facial expressions and brotherly gestures (which take an explicitly corny turn at the very end of the film). As the inevitable, cosmic forces would have it, however, eventually, Gilcrest takes a liking to Allison despite their personality differences, but his shady, workaholic tendencies will inevitably rub her the wrong way during the time of this crucial space launch that will leave them both \"steamrolled by the future\" as Gilcrest puts it.\n\nExplaining the juxtaposition of this brewing romance and this rocket launch into space is no easy task. Crowe seems dedicated to making two unrelated things connect in the most hackneyed way imaginable. Even when we are focused on the human characters, there's little human interest to pull us into their lives. Both Gilcrest and Allison speak like characters in a movie, always ready with a quip or some sort of slyly funny remark; never does Crowe penetrate the heart of this relationship, and instead, settles for digging holes around it hoping to strike something that will pull us, the audience, inwards.\n\nThis, however, never comes to fruition. I felt like I was always sitting within arms length of \"Aloha,\" its incredulous situations, and its characters. The screen was several rows before me, and yet, no connection was ever formed. For as many characters, situations, and circumstances lie within this film's screenplay, this is a shockingly boring project, laboriously paced and only adequately acted, given there's no real challenging role for the talent here to sink into. The film persists on with a cloying sense of tone-deafness to the impossibility of its own situations that it treads Nicolas Sparks territory (although I say with a slight quiver in my voice that I liked \"The Longest Ride\" a tad more than this).\n\nCrowe's last film was \"We Bought a Zoo,\" which, like \"Aloha,\" had its share of emotionally manipulative elements. However, it was also a tad more watchable and light-hearted than this, and certainly a bit easier to believe in terms of its circumstances. With \"Aloha,\" we see Crowe test the very boundaries of love on an intergalactic scale, and after several films that have even questionably undermined his greatest achievements like \"Almost Famous\" and \"Say Anything...,\" maybe it's time for him to come back to Earth, wouldn't you say?"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "acoolmac",
        "review_rating": "7",
        "review_title": "The Mystery of Finding Decent Comedies",
        "review_detailed_main": "The question just keeps returning. Why are good comedies so rare? This question arises as soon as the credits start rolling on most of the comedies created these days. Simply stated, they are of very low quality--usually due to low-low-brow scripts. Some script writer (and likely and editor or two) pumps out a series of scenes replete with toilet jokes, wise-cracking juveniles, alcohol-saturated, immature T & A humor. Not a winning combo.\n\nOnly when there is a combination of creative, well-considered writing, good direction, good acting, and all the other necessary components does a comedy become a classic. When there is conflict, memorable, perfectly delivered lines, and tight editing, does a comedy become great. My Cousin Vinny great. Too often laziness seems to persist.\n\nAloha deserves partial credit for being on the plus side here. It isn't a classic, or even close, but it is worth watching. It veers from the hot tub humor and gives us a fun, upbeat look into a different side of military life. It is funny, quirky, and well acted. It isn't over the top with all of the above-mentioned low-brow humor. And, it has sweet romance developing at the correct pace. It deserves more consideration and better ratings."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dsa_ca",
        "review_rating": "2",
        "review_title": "We may now say Aloha to Mr. Crowe",
        "review_detailed_main": "When Miss Zellweger's character Dorothy sobbingly tells Jerry Maguire, 'You had me at Hello' after abruptly ending Jerry's 'You complete me' speech, it all seems completely corny in now very typical Cameron Crowe style. Or in Almost Famous, when Miss Penny Lane says to William 'It's all happening' and when Lester Bangs talks about 'Industry of Cool'; when out of context, just one word, corny.\n\nBut all those dialogs became memorable as they were part of well written stories and characters. Most of these Cameron Crowe dialogs are now oft repeated pop culture references.\n\nIn one of the multiple endings of Mr. Crowe's new movie 'Aloha', Bradley Cooper's character Brian Gilchrest is standing outside a dance class watching one of the girls, performing a Hawaiian dance routine, who after a brief moment bursts in tears and comes out to give a warm hug to Mr. Cooper. The audience by now must have lost track of what the movie is about. Even if they are paying the highest amount of attention, they may not be able to shed a tear of joy with the two protagonists. Nothing that is played out within the 105 minutes running time has done anything to conjure up to the emotional hug towards the finale.\n\nAnd it is same for the rest of the endings. The prophecy revealed earlier this year in the Sony email hacks comes true and it is for real that 'Aloha' the new feature by Mr. Cameron Crowe is a confused mess.\n\nMr. Crowe gets into his Elizabethtown mode and comes up with a movie worse than the 2005 Orlando-Kirsten starrer Dramedy. A male protagonist juggling multiple things like ex-girlfriends & her family and reviving his failing military contractor career is teamed up with pixie-dream girl who is supposed to be of Hawaiian-Asian heritage, but is as white as they come because this is a Hollywood production.\n\nThe casting is least of this film's problem. The character's barely act as per the situation. John Krasinski brings up the laughs but his character makes no sense. John plays Rachel McAdam's husband, who does not speak much and mostly expresses his emotion by touching or hugging. But when his marriage is falling apart, you would expect his character to straighten up but the movie just ties the ending happily without addressing John's character's frustrating silence trait.\n\nOne also cannot blame the written characters if the situations and plot lines are thin as a paper. Apparently Mr. Crowe researched in Hawaii for many years while writing the script. And it shows that he is trying to say something about USA's \"approach\" towards Hawaii and is trying showcase Hawaiian culture. But all he could muster is some mystical folklore and background dancers to showcase Hawaii.\n\nEmma Stone's character Allison Ng is supposed to represents the Hawaiian perspective, but it is completely lost on the audience. All we see is a Emma Stone speaking about some alien exotic culture that she is fascinated with. She fails to immerse in her character for obvious reasons and later on in the movie she is the Pixie dream girl who is going to change Mr. Brokenhearted Cooper's career and life.\n\nBill Murray's Eli Musk character is so underwritten that the finale's satellite launch gives the film the b-grade sci-fi stench.\n\nMiss McAdam tries hard to bring out some emotional touch to scenes with her barely present opposite characters of Bradley and John, but the disjointed editing fails her completely. Creaking doors, staring kids and other characters without any dialogs; the editing creates a whole another mess to the already fallen apart situation.\n\nThis film in the ends takes down with it the most anticipated words on the movie posters of the late nineties and early 2000; A Cameron Crowe Film. Mr. Crowe's next movie has to be something special to pull in some audience at the cinemas playing it, as Aloha feels like a final goodbye from the audience to him."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "alreadyseenbeentaken",
        "review_rating": "7",
        "review_title": "Decent -",
        "review_detailed_main": "The Hawaiian stuff felt a bit constructed. But that could just be because I don't know anything about this culture. But barely any cringe, the obligatory moments of drama, some dry humor, without the exaggerated silly stuff. All with a kinda-serious topic on the side.\n\nGreat cast, good music. Could have had a bit more Hawaiian scenery.\n\nBut otherwise pretty watchable."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "evemmons",
        "review_rating": "1",
        "review_title": "My review...spoilers below.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "btookey",
        "review_rating": "8",
        "review_title": "I enjoyed it",
        "review_detailed_main": "If you've traveled to Hawaii, have read or experienced anything about the culture, you will appreciate this movie. I especially liked how they expressed the meaning of 'Aloha'- peace and mercy, through the characters and their relationships,and the way they used Emmas character to showcase the nuances of the Hawaiian people and their beliefs. There were some plot holes, but they were, for me, easy to overlook because the relationships and the Hawaiian scenery and culture were the central themes of the movie. Its not an 'in-your-face' type of movie, its very subtle and you have to watch and listen softly; you'll find your internal motor down-shifting a few gears before the movie ends, much like Hawaii itself. If you enjoyed Elizabethtown, you'll like this movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "richardrehder",
        "review_rating": "6",
        "review_title": "Good but not great",
        "review_detailed_main": "Amazing cast, great location, decent premise but somewhat fails in execution. Plot was hard to follow at times. Really enjoyed the Hawaiian myths and lore. A decent watch if you like RomComs."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cosmo_tiger",
        "review_rating": "5",
        "review_title": "There is just way too much going on in this movie and it would have been better if a few of the story lines were cut out.",
        "review_detailed_main": "\"He's just a brilliant, compelling, innovative, commanding, fricking wreck of a guy.\" Brian Gilcrest (Cooper) is a soldier who was injured while in Afghanistan. Taking up a new job as a private contractor he travels to Hawaii to meet with a billionaire and finds his ex girlfriend there with her new family. With the help of his liaison Allison Ng he does his best to try and straighten his life out. Most of the time when I read reviews for movies and its gets blasted by everyone I end up thinking it wasn't as bad as everyone said. This is an exception. I think the reason for the excitement behind this one is due to the cast, which is amazing. I love Cameron Crowe and that was the reason I was looking forward to this. The problem lies in the fact that the movie tried to do way too much and every storyline seemed to not mix with the others. A soldier injured in a war comes back to find his ex girlfriend married to a man who becomes instantly jealous while at the same time starting to fall for the woman who is trying to help him while trying to help a rich guy send up a satellite into space which may contain a nuclear weapon while at the same time wondering if his ex's daughter is his. There is just way too much going on in this movie and it would have been better if a few of the story lines were cut out. Overall, a disappointing movie considering the cast. I give this a C."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mailes22",
        "review_rating": "2",
        "review_title": "Terrible waste of a good cast",
        "review_detailed_main": "This movie just doesn't know what it wants to be: RomCom, mystery/thriller, farce. The plot is all over the place.\n\nThe most annoying thing about the movie though is the complete waste of a potentially terrific cast. Emma Stone is great in every movie I've seen her in. She can carry a movie all on her own. But she's totally unconvincing in this flick. She goes from ball busting, clichéd obsessive compulsive, socially inept fighter pilot trying to climb the greasy pole in a man's world. Then suddenly she switches to quirky, cute and relaxed every time she (literally) lets her hair down. Rachel McAdams is lovely and utterly wasted as a army wife married to an uncommunicative part time husband. The resolution of their marital conflict was totally unbelievable. Bradley Cooper phones in a lightweight performance. What a massive comedown after American Sniper. Alec Baldwin gives a farcical performance. It's hard to know how much is due to the script, and how much is his acting, but it feels like I've seen him in exactly this role and overacting in exactly the same in every movie he's been in for the last twenty years. I think he must just be a very bad actor. Similarly, Bill Murray plays another caricatured role as the slightly sinister 'baddie'. He looks like he just rocks up on set and stands around looking a bit vague, saying very little. It's become his schtick ever since Lost in Translation. Frankly I'm bored with it.\n\nSo the acting ranges from pretty average to downright bad, and the plot is all over the place. There's not even much Hawaiian scenery to enjoy.\n\nWaste of time. Save you money, stay in and order a takeaway instead."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Loopdoloop",
        "review_rating": "",
        "review_title": "Underrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Hellmant",
        "review_rating": "5",
        "review_title": "I used to be a big fan of Cameron Crowe's, in his glory days!",
        "review_detailed_main": "'ALOHA': Two and a Half Stars (Out of Five)\n\nWriter/director Cameron Crowe's new romantic comedy flick; about a defense contractor who moves back to Hawaii, to supervise the US space program there. He has romantic complications with an old flame and a new love interest; in the form of a spunky Air Force pilot, that's supposed to watch over him. The film stars an all- star cast; including Bradley Cooper, Emma Stone, Rachel McAdams, Bill Murray, John Krasinski, Danny McBride and Alec Baldwin. The movie was panned by critics, and it's considered a disappointment at the Box Office as well (considering all the talent involved). It has moments, but I'm mostly disappointed with it.\n\nCooper plays Brian Gilcrest; a military contractor who was recently assigned to oversee the space program in Honolulu, Hawaii. The military is planning to launch a special satellite there. Gilcrest used to work in Honolulu, many years earlier, and was almost married. His former girlfriend, Tracy Woodside (McAdams), now has a husband (Krasinski) and two children. Brian's return home, complicates things for her; and her family. Brian also develops a relationship with an Air Force pilot, Allison Ng (Stone), that's assigned to watch over him.\n\nI used to be a big fan of Cameron Crowe's, in his glory days ('ALMOST FAMOUS', 'JERRY MAGUIRE', 'SAY ANYTHING', etc.), so this movie is especially a let down for me. It has of all the ingredients of a classic Crowe film (including an amazing cast), but it never comes together quite right. I'm also a big Bradley Cooper fan, so seeing the two together, seemed like a movie that couldn't go wrong (How did Cooper go from starring in two of the biggest hits of last year, 'AMERICAN SNIPER' and 'GUARDIANS OF THE GALAXY', to making two of the biggest bombs of this year, 'ALOHA' and 'SERENA'?!). The characters all seem like good rough draft versions of likable movie roles, but they never seem like real people; and the dialogue often seems completely forced. The movie also feels really rushed, and underdeveloped, and I'm sure a lot of important stuff must have been left on the cutting room floor. There was potential here for a much better movie; but as it is, it's a pretty big disappointment.\n\nWatch our movie review show 'MOVIE TALK' at: http://youtu.be/0zeoVbvkuAA"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Dextronix",
        "review_rating": "7",
        "review_title": "Enjoyable with no fuss",
        "review_detailed_main": "This is a light film with some very nice meaning and is no hassle whatsoever to watch.\n\nI watched this after I, Olga (Czech film) which is as heavy as it gets and I wanted something to decompress... Aloha was the perfect choice.\n\nI had seen the film before and knew it was enjoyable but I think I enjoyed it more the second time around.\n\nIf you are unsure whether to watch it, do it for one simple reason... A final scene and some sublimely beautiful acting, minus dialogue, from young Danielle Rose Russell. The feeling she conveys in that speechless scene for me is worth the entire films journey. If you don't get a lump in your throat there you are made of lead.\n\nVery very decent and warm film"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "skjeffrey",
        "review_rating": "2",
        "review_title": "Tragic Waste of Talent",
        "review_detailed_main": "My mind was open to this film; I had no idea what to expect as, I had not read any reviews or heard anything about it. Right away it seemed to be disjointed and confusing. Plots are all over the place. Camera work was often overly dramatic and plain bad. None of the characters were interesting. Emma Stone as an over-caffeinated part-Hawaiian space nerd F-22 pilot is the worst casting since Mickey Rooney as an Asian in Breakfast at Tiffany's. With a cast this impressive set in a gorgeous setting one would think 'blockbuster' but this movie is an awful waste of talent. One reviewer said it was as if the director had a story in his head and only told part of it. Exactly right. This is an example of a Director's disaster. I'd love to sit down with Bradley Cooper to hear how badly this was botched. Warning: watch this only if you have nearly two hours to see how good actors can be made completely uninteresting."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "eberkerbatur",
        "review_rating": "6",
        "review_title": "I liked the movie but it was still not very nice movie (5.9)",
        "review_detailed_main": "If we start with the beginning of the film almost 30 min passed trying to understand the subject of the film was a very quick check-in. Dialogues developed very quickly jokes were meaningless I never understood some jokes.\n\nAfter leaving the first 30 minutes of the film behind, we begin to understand the film a little more at least the main issues but of course, there is still a mess. So actually the subject is nice but taken trouble in processing the subject. Film footage is great because of the Hawaii, mystical Hawaiian air wanted to be caught which is very successful you also feel a different sense of sadness.\n\nI would have liked it if there hadn't been such complex transitions or had it been so fast or it would have been better if more drama had been put out of space. Space-related parts were a little ridiculous I know it's a comedy weight, but it still sounds ridiculous. Especially the latest satellite explosion scene. the performances of the players were great maybe they were the ones who saved the film from mediocrity. Starring Bradley Cooper, Emma Stone, and Rachel McAdams and also all cast crew was quite successful."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ferguson-6",
        "review_rating": "4",
        "review_title": "Noise",
        "review_detailed_main": "Greetings again from the darkness. Since I can usually find something of interest, it's rare that I feel cheated after watching a movie. Of course, feeling disappointed happens more often, but feeling cheated is something altogether different and, unfortunately writer/director Cameron Crowe's latest is the perfect reminder of that difference.\n\nThree outstanding lead actors (Bradley Cooper, Emma Stone, Rachel McAdams), a terrific and deep supporting cast, and a beautiful filming location of Hawaii mean that the fault lies with Mr. Crowe's script and direction. The film plays like the broad strokes of a screenplay idea, rather than a finished product. It's as if we are watching filmed rehearsals as a group of writers scramble to connect the story dots \u0085 still trying to determine if this is a drama or comedy.\n\nIt seems the film was cast with a full-out comedy in mind, but then somewhere along the line, a narrative shift occurred with the hope of making a statement on the privatization of the military and space exploration. There is also an undercurrent of the mistreatment of native Hawaiians, as we are teased with cultural myths, legends and the distrust of the military. Trying to balance these topics with a more traditional romantic-comedy-three-way involving the main characters, results in a disjointed viewing experience that provides only a few chuckles, and a half-baked story of redemption.\n\nThe gradual connection of Cooper and Stone (cast as a Navy Fighter Pilot) offers some initial verbal sparring that had potential for comedy gold, but inevitably spun off down a bunny trail of Hawaiian lore or the magic found in the sky. The re-connection of Cooper's and McAdams' characters seemed to have continuity holes that might have been left on the editing room floor. John Krasinski plays McAdams' husband, and his non-verbal exchanges are the highlight of the film, though the later subtitled version seems lifted from that drawing board straight comedy mentioned earlier.\n\nBill Murray is cast as the duplicitous billionaire at the core of Cooper's mission and chance at redemption, though mostly he just acts like Bill Murray with little explanation for his motives. Danny McBride, Alec Baldwin and Bill Camp have their moments, but much more should have been devoted to McAdams' kids played by Jaeden Lieberher (St. Vincent) and Danelle Rose Russell).\n\nCameron Crowe seems to have a driving need to examine interpersonal relationships and what causes some to work, while others falter. His film classics Say Anything, Jerry Maguire and Almost Famous are impressive, but also many years in the past. The last fifteen years have produced Crowe projects that teeter between optimism and outright sap. On the bright side, he always has a knack for music, and on that front, he comes through again \u0085 \"Factory Girl\" is blended with traditional Hawaiian songs and even Dylan and The Who. It's because of this, that you won't know for sure if your toe-tapping is due to the music or that gut feeling of being cheated."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tonysarrio",
        "review_rating": "8",
        "review_title": "A feel good movie that a certain crowd would never get!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "foghorn_clj",
        "review_rating": "2",
        "review_title": "As bad as everyone says it is....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sean-ikeda",
        "review_rating": "1",
        "review_title": "Hot Garbage",
        "review_detailed_main": "Whoever thought it was time to revisit the Elvis style, all-white Hawaii (not just the main cast, but all extras and background players) and cast Emma Stone as a quarter- Chinese, quarter-Hawaiian needs to be shot in the face. I mean seriously, this \"Girls\" level no-black-people-in-Brooklyn white washing is archaic and unnecessary. Considering the Sony email leaks lauding this as \"The last shitty script I approve\" film, you think they could have rolled the dice just a little and cast any person of color.\n\nAlso just another droll, illogical, completely trite and faceless romantic comedy."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "haighmail",
        "review_rating": "1",
        "review_title": "OMG Please Kill me.....",
        "review_detailed_main": "The trailer enticed me to this film. I like Bradley Cooper (loved him in Silver Linings Playbook) and Rachael McAdams. However after the first 10 minutes I knew this was going to be a huge disappointment unfortunately for me I hung in there till the end hoping for something more - it never came.\n\nThere was zero chemistry between Emma Stone and Bradley Cooper. Emma Stone's character was so unrealistic and irritating. Rachael McAdams was good and I kept wanting to see more of her on screen but at the same time never really wanted to see her and her old flame get back together because hey she was married with kids and it seemed wrong.\n\nAnd the underlying story was a bore. I couldn't care less about the Military, Billionaires and their rocket launch.\n\nAny person who has written a good review on this site must have been paid by the movie company. This was a total let-down. Don't waste your time."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "michaelanthonygrant",
        "review_rating": "1",
        "review_title": "This is actually terrible",
        "review_detailed_main": "Don't. Just Don't even bother. The actors in this film must have lost a bet or something. I genuinely don't understand how this got made.\n\nI'd write something more constructive but it's not worth spending anymore time thinking about this film.\n\nEnd of.\n\nDon't. Just Don't even bother. The actors in this film must have lost a bet or something. I genuinely don't understand how this got made.\n\nI'd write something more constructive but it's not worth spending anymore time thinking about this film.\n\nEnd of."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "themarchhare-84747",
        "review_rating": "2",
        "review_title": "Aloha Movie Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "gradyharp",
        "review_rating": "8",
        "review_title": "'You sold your soul so many times nobody's buying anymore'",
        "review_detailed_main": "Cameron Crowe (Jerry Maguire, Vanilla Sky, Almost Famous, We Bought a Zoo) has been called an idiosyncratic writer and here he not only writes this at times bizarre script but also directs it. Parts of it work well, other parts bet lost in the transition form the words in a script to the action in the film. And that is most assuredly not because of inadequate actors: the cast is filled with some of the finest actors of the day. But in the end the ideas he places before us - military duty before personal life, greed and corruption in the 'purchase ' of the skies, old flames and new attractions/counter-attractions, environment protection versus technology – are worth of our attention and by film's end it all works out just fine. It is the getting there that is a bumpy road.\n\nThe story is so complex with sidebars and secondary themes that keeping a synopsis to a minimum works best: A celebrated military contractor Brian Gilchrist (Bradley Cooper) returns to the site of his greatest career triumphs – Honolulu, Hawaii – and reconnects with a long-ago love Tracy Woodside (Rachel McAdams) while unexpectedly falling for the hard-charging Air Force watchdog Allison Ng (Emma Stone) assigned to him. Toss in Tracy's current secretive and quiet military husband Wood (John Krasnski), Brian's new contractor boss Carson Welch (Bill Murray), the past military buddies of Brian (Danny McBride, and Alec Baldwin) and some complicated Hawaiian figures and the pie is baked.\n\nBradley Cooper, Rachel McAdams, Emma Stone and John Krasinski are excellent and make the film glow whenever they are on screen. Cameron Crowe deals with a lot of psychological overlay here and while at times it is confusing, it is in retrospect very erudite.\n\nFunny at times, touching at times, and mostly entertaining."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Alo-Horrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Likes_Ninjas90",
        "review_rating": "4",
        "review_title": "What a cast and what a disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dragongyrrl",
        "review_rating": "3",
        "review_title": "This Movie Is TERRIBLE",
        "review_detailed_main": "For having so many big names, this movie is just awful! The writing is terrible. There are a lot ton if really awkward moments that don't make sense. More than once I found myself asking \"WTF is happening right now?!\" Emma Stone's character is extremely annoying. Did I mention the terrible writing? So dumb."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lucasnochez",
        "review_rating": "4",
        "review_title": "Film Review: Aloha",
        "review_detailed_main": "Aloha is a film that doesn't quite know if it's coming or going. This is fitting as the title itself is the literal translation in Hawaiian for greeting or parting with someone, in this instance, someone you never care to meet ever again.\n\nThe newest film from Cameron Crowe, a filmmaker that has been riding the wave of the mid-nineties and early two-thousands with films like Jerry Maguire and Almost Famous with occasional emotional glimpses of talent (mostly in Vanilla Sky and We Bought A Zoo), never really clicks. Lacking any sort of obvious purpose or overall foundation and filled with characters who know less than what we know about them, the film confuses beyond belief right from its first frames. Characters, along with the film itself, are covered and soaked in convoluted, not artistic, ambiguity.\n\nThe opening, characterized by an uninspiring and unnecessary voice-over with protagonist Brian Gilcrest (Bradley Cooper) telling a back-story that could be just about any human on the planet and a mission of blessing a pedestrian gate, automatically sends the film to the direction of complete absurdity. Thankfully, the one thing Mr. Crowe does well is making this film, along with each of its characters, magnetized to its lead – Brian Gilcrest – a role Cooper will surely NOT get his fourth Oscar nomination in a row for.\n\nThese characters include Bradley Cooper's Brian Gilcrest, a contractor who was a military man and began working for corporate billionaires; Bill Murray's Carson Welch, one of Gilcrest's previous employers and a huge billionaire in search of owning the sky with satellites; Rachel McAdams' Tracy Woodside, an ex to Gilcrest and a civilian in charge of dealing with recently departed soldiers; John Krasinski's Woody Woodside (I swear that's his name), a husband to Tracy and a pilot who doesn't speak to his wife for reasons unknown, and of course, Emma Stone's Allison Ng, an F-22 fighter-pilot who is tasked with being Gilcrest's watchdog/chaperon again for reasons unknown.\n\nSadly, Crowe, who directed, wrote, and produced Aloha, is very close to kissing a credible career as a filmmaker goodbye. Introducing the audience to too many characters at once, using a mix bag of filming technique such as long takes that never really connect with audiences, and adding a ridiculous amount of not-so-subtle analogies and Hawaiian mythology, Crowe will be ranting, raving, and begging audience members to come see his newest film and show him the money, especially with such a large $37 million dollar budget.\n\nOne of the biggest mysteries of the film, aside from its obsession to the Hawaiian supernatural, is how it was able to conjure up such an impressive ensemble cast. I mean, did anyone even read the script or were they just enamoured to work with Crowe despite his ability to score with audiences quite a long time ago?\n\nCrowe, who began his artistic career as the youngest ever contributor to Rolling Stone magazine, always manages to connect with audience, if not visually, then sonically, through a trained ear accompanied by fantastic soundtracks and scores. After all, his most beloved pet project Almost Famous features one of the most commercially successful soundtracks in cinematic history. This time around, Aloha features an onslaught of Hawaiian sounds, composed by his recent frequent collaborator Jonsi, who not only add no dimension to the film's aura, but seem just as boring as elevator music you'd expect in the tropical locale.\n\nMany people won't even bother seeing Aloha this weekend on the big screen, as I also don't expect the film to get much bigger of a following on VOD or on-demand. Many of the few souls that do watch the film may find that Emma Stone's character Allison holds most of the film's heart and soul. I strongly disagree as Stone provides the film with the majority of its forceful island wisdom and supernatural irrelevance. Though, I do strongly believe that the actress, especially after her exceptionally convincing performance in Birman has a bright and promising future as a defining movie star. Sadly, it just really isn't seen here.\n\nCooper may very well be the best part of Aloha as well as the tall, dark, and silent Krasinski, who doesn't do much but strut his stuff and act all mysteriously enigmatic. Cooper seems to be having the most fun with his tormented, soul-selling character, even if we don't know why he is selling it, or to who. If there is one thing that Aloha does well, it is that it makes everything and anything about the life of Brian Gilcrest. Sadly, the love triangle between Gilcrest, Woodside, and Ng isn't anything more than a bumbling disaster of regrets, would haves, should haves, and surprising narrative twists. Relationships, attractions, and love stories created completely from thin air without any merit or reason is also one of the main reasons why Aloha never gets a warm welcome. Characters instantly regretting past decisions then moving on with their lives with others is one of the most inconsistent and confusing elements of the film's dying heart.\n\nThe unfortunate thing is that Cameron Crowe is a fantastic screenwriter and is responsible for so many defining popular culture moments in his expansive and proud filmography (think, \"You had me at Hello\" and \"Show me the money\"). Ironically enough, some of the best scenes in Aloha revolve around the silence and lack of dialogue between its characters. Scenes involving revelatory truths between the two men in Tracy's life are mostly comprehensible with the help of only facial expressions and subtitles (even though both men speak English fluently), adding a very unexpected and small charm to the film just a little too late."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "fields-04771",
        "review_rating": "2",
        "review_title": "May be more interesting with Polish Dubbing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sulona93",
        "review_rating": "10",
        "review_title": "This is a heartbeat movie",
        "review_detailed_main": "Aloha is one of the finest woven movies I experienced in a long time. Not only are the people completely believable in their individual personalities, but also the interactions are so fun and touching to watch. I loved the entwinement of tradition, mystics, being human and those deeply true seeming backgrounds. It is really hard to forge a movie, which is not defined by mind-blowing action scenes but also doesn't lack a really good storyline behind it. There are a lot of movies out there, that can't survive without a lot of bad language, crime, tragedy or other bad stuff happening. So watching this movie is just such a relieve for my movie-fanatic heart. It contains all, that is really important and is so much deeper than one could guess in the beginning. I am very happy, that i found it. Definitely one of my top 50 of all my movie-history!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "MattBrady099",
        "review_rating": "4",
        "review_title": "Aloha sadly falls flat",
        "review_detailed_main": "It really dose hurt when a movie you being looking forward to turns out to be a big disappointment, what hurts more is that it was a huge miss opportunity for being something great.\n\nThe story is about celebrated military contractor returns to the site of his greatest career triumphs - the US Space program in Honolulu, Hawaii - and reconnects with a long-ago love while unexpectedly falling for the hard-charging Air Force watchdog assigned to him.\n\nAloha was my most anticipated film of 2015 just because of the big name cast and the director himself, I mean Cameron Crowe as a film making is just amazing, yeah he had some down falls with his movie but he also made some fantastic movies that today is he's best work. Say Anything, Jerry Maguire and Almost Famous was him at his prime and judging by the trailer of this movie he looked like he was going back to his best, that's why I was looking forward to it. After seeing the movie... this movie sucks, I mean what a freaking disappointment this movie was. 2015 so far has so hard hitting disappointments and this is one of them.\n\nBradley Cooper, Emma Stone, Bill Murray and Rachel McAdams all do fine in they roles and what they had to work with. They didn't do anything special in the movie just okay and to me that's the biggest waste of talent, I mean you got big name actors in this movie and they do alright performance. Just a waste.\n\nThere's moments in this movie were it was a bit interesting with the dialogue from the character's and the overall setting of the movie, but even that doesn't last very long.\n\nNow for problems: The chemistry between Bradly Cooper and Emma Stone dose not work at all, I mean they had zone chemistry with each other and I thought it will be best if they were like best friends not lovers.\n\nBill Murray has nothing to do in this movie, but in the trailer for this movie he gave such a moving and true to life speech and I couldn't wait to see it in the movie I mean even if the movie wasn't so good at least I get to here the speech right? well that didn't happen at all and Bill Murray himself has got nothing to do in this movie, so that's another waste right there.\n\nThe movie itself is dull and it feels like a 4 hour movie at times with the messy pasting and the uninteresting character's. I wanted this movie to be great I really did, but it sadly came off as a mess of the film that could have been so much better."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dcreed",
        "review_rating": "3",
        "review_title": "Has Anyone Checked On Cameron Crowe",
        "review_detailed_main": "It's like somewhere in the middle of writing or directing or editing, Crowe had a series of small strokes. Storylines make no sense, have illogical or no conclusion, or make leaps to a completely different place. It's about the military, but it's like it was written by someone who has only seen the military from a distance. Same with computers...and Hawaii...and Hawaiians...and women...and planes.....\n\nThe number of big names attached to this is astounding, and I imagine all of them got nice paychecks out of it. Too bad they can't be proud of it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "trvlers-77920",
        "review_rating": "3",
        "review_title": "3.8/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "hplindley",
        "review_rating": "1",
        "review_title": "Terribad",
        "review_detailed_main": "What? Huh? If you like movies edited so much that few scenes express cogent dialogue, Aloha is for you. Don't get me wrong. It's a beautiful. If I only watched movies while on mute, that would be fine. But since I expect a storyline, this was disappointing. I'm not sure how they got so many great actors involved in this movie. I can only assume that it was edited beyond recognition. It is filmed in a dizzying way, which would be fine if it wasn't during moments of dialogue. Characters aren't developed. Almost none of these characters make any sense. I really wanted to like all of them. And I can't. I wish I could have seen the unedited version. Because there is no way this story was written in such a confusing way."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "clivelive-32474",
        "review_rating": "1",
        "review_title": "Where do I even begin...",
        "review_detailed_main": "....if I take any cues from this movie, I can just start this review wherever I please regardless of whether it flows or makes any sense.\n\nThis film, and I use that term loosely, had to have been written by a computer virus that somehow got first drafts of a Timothy Dalton James Bond, Austin Powers, Forgetting Sarah Marshall, and some kind of hipster-social-injustice-message-masquerading-as-a-movie scripts. But really, computer viruses have gotten really good these days, surely one would have come up with something that at least made sense.\n\nIts almost like Mr. Crowe had a bunch of random video shot on an iPhone that he tried to piece together into something. Or like one of those books back when we were kids that at critical plot points you could pick the decision the main character made and the ending would be different - except that this movie picked every single option and played them all out.\n\nWhat could have been a promising rom-com with great leading actors in Cooper, Stone, and Murray wound up looking like the work of some schizophrenic fan fiction that ranks up there with movie masterpieces such as the recent Fifty Shades of Turd. Instead it turned into some loosely developed old girl vs new girl drama with some obvious social statements against the mistreatment of Hawaiians and their traditions, privatized space development, and the 'guvmint. At the very least the film makers could have distracted us with some stunning cinematography of Hawaii but what we got was a few clips of something probably stripped off a YouTube wedding video.\n\nI didn't have the luxury of narcotics or else this movie might have made more sense, so unless you have some potent ganja or some questionably prescribed pills, don't waste your time on this film. Amy Pascal deserves her job back (google it) and the State of Hawaii, native Hawaiians, and the actors all deserve to be paid significant damages for what this steaming pile did to their reputations. Its not as if Cameron Crowe has a stellar record and he just had a bad day with this film, at this point he is a habitual offender and should be prosecuted for crimes against humanity."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "hygog",
        "review_rating": "8",
        "review_title": "not bad at all, actually pretty good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "IanAJohnson",
        "review_rating": "5",
        "review_title": "This film was well acted, but jumbled.",
        "review_detailed_main": "Aloha is a complicated film to summarize. Our protagonist is Brian Gilcrest, a washed out military contractor who is returning to Hawaii after over a decade to look over some ceremony. He is introduced to many people from his past, such as his lost love, Tracy, who is now married to another man and has two children. He is attached to a super optimistic liaison of sorts, named Allison Ng so the local military can keep an eye on him. Once this was established, things seemed to just happen. Relationships formed, truths were revealed, conflicts arose and other events just sort of happened. I felt that the flow of the film was quite poor. I liked many of the scenes in the film, but many of them just popped into the plot and felt either forced or unnecessary. The best way to describe this phenomenon is to say that if you where to show someone any three random scenes from the film without context, the viewer would probably like most of them, but in the context of the film they feel off and disjoined. The trailer pulled this effect off rather well. Almost every film ever made uses foreshadowing. These tiny and subtle hints that reference the future can add tension and can be used to play with the minds of the audience. In this film, however, most attempts at foreshadowing were too obvious and overdone. This made many of the plot points predictable. I could expand further on how many of the plot points felt forced, but the film briefly talked about the future being a force that directs life in unknown directions, so I'll let that slide. There are many positives to this film, though. The acting is really good. Every actor is on their A-game. There are a lot of characters in this film, but since most of them are well characterized they all remain memorable and feel like more than just random people used to fill up the plot. Some people have subtle and not- so-subtle quirks and personality traits that bring them to life very well. There is also this underlying feeling of peace underneath all of the conflict that happens. It's like the islands of Hawaii are characters as well. In the end, there is a lot to like and a lot to dislike and your enjoyment of the film will be based on what you look for in films."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "indiedavid",
        "review_rating": "1",
        "review_title": "Couldn't be worse",
        "review_detailed_main": "What a contrived load of crap. Literally everything was wrong with this film, starting with a horrible script, bad casting, bad directing and zero authenticity of military protocol."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "garthlotel",
        "review_rating": "4",
        "review_title": "Charmless",
        "review_detailed_main": "This movie doesn't know what it is. It's not particularly interesting or funny, nor do you care about either of Cooper's relationships. Speaking of Cooper, he is simply not leading man material. I realise there is a dearth of quality leading men in Hollywood today but why does a bird faced, cold-eyed, soulless cardboard actor like Cooper have to be cast in everything? Emma Stone doesn't have what it takes to play a convincing temptation, and the always stunning Rachel McAdams is wasted in a small role."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "chrisdamb",
        "review_rating": "3",
        "review_title": "Colossal waste of time",
        "review_detailed_main": "Maybe worth s watch on Netfilx because it's free, but other than that, don't encourage Cameron to make another movie! A hot mess is a great description. Just awful.Save your money. Better yet, burn it, because the heat from the flame is way hotter than anything created in this s- show.\n\nMaybe worth s watch on Netfilx because it's free, but other than that, don't encourage Cameron to make another movie! A hot mess is a great description. Just awful.Save your money. Better yet, burn it, because the heat from the flame is way hotter than anything created in this s- show.\n\nMaybe worth s watch on Netfilx because it's free, but other than that, don't encourage Cameron to make another movie! A hot mess is a great description. Just awful.Save your money. Better yet, burn it, because the heat from the flame is way hotter than anything created in this s- show."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "imjohnjohn",
        "review_rating": "1",
        "review_title": "Ethnocentric whitewashing revisited! Outrageous and unacceptable!",
        "review_detailed_main": "SHAME on Cameron Crowe for whitewashing, casting white actors to play people of color! And shame on him AGAIN for an insincere apology! Shame on Emma Stone too for accepting and going along with such shameful whitewashing and not standing up and rejecting such whitewashing! It is unthinkable that in 2015 in the 21st century, there are still insensitive boobs like these that are still casting white actors to play people of color! It is outrageous, unacceptable and extremely infuriating! Was all that recent racial tension and unrest for nothing? Are white Americans really this thick-skinned that they cannot get it i to their sun bleached heads that such racially insensitive ethnocentrism is not only not okay, it is what is splintering our society and nation, and hijacking it from evolving forward to a better society and nation? Enough is enough!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "manumartinezpoulsen",
        "review_rating": "9",
        "review_title": "A humans movie",
        "review_detailed_main": "It just felt so nice. The space science fiction issue was just an excuse to show us an emotionally beautiful movie, it was all about human relationships and spiritual connections. The storytelling was sometimes confusing but I repeat, it was just an excuse to show us real human interactions through life.\n\nIt would not have the same effect if it weren't because of the great actors it has. Rachel McAdams acted so naturally and felt warmful as a mom and wife. Bradley Cooper just being the same mysterious but sensitive human being as he always was, and Emma stone felt so natural being a nerdy and enthusiastic gorgeous captain. The rest of the crew completed the movie perfectly.\n\nI can't believe is been 9 years since this movie came out and I just saw it. I'm glad I didn't listen to the reviews."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tigerfish50",
        "review_rating": "1",
        "review_title": "Aloha Hell",
        "review_detailed_main": "Neither drama, comedy, love story or rom-com, 'Aloha' possesses a muddled plot with implausible characters, a lifeless romance, tired humor and embarrassing sentimentality. Writer/director Crowe throws a truckload of formulaic gimmicks onto the screen in a futile attempt to save his bloated trifle from bombing in spectacular fashion, but every ploy adds to the growing catastrophe.\n\nBradley Cooper rolls out some routine square-jawed charm to crank up his lukewarm romance with Emma Stone, whose character's default behavior is insufferable perkiness. Their creepy-cloying love affair appears to be the central narrative arc - combined with some lame sub-plots about Hawaiian eco-activism, the parentage of an old flame's daughter, and Chinese hackers hacking a corporate wacko's attempts to put a nuke into orbit. Not one minute of this forgettable fluff is the slightest bit convincing, as 'Aloha' crashes and burns along with Crowe's tattered reputation as a film-maker."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ddam0767",
        "review_rating": "4",
        "review_title": "GIGO (Garbage In - Garbage Out)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cmv32261",
        "review_rating": "1",
        "review_title": "\"What really makes me see RED.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "wesleytseng-58764",
        "review_rating": "2",
        "review_title": "Terrible Plot And Acting",
        "review_detailed_main": "This movie is a waste of time and money, honestly. The story was so poorly written, you will have no idea what is going on the entire time you're watching the movie. Things happening at random points of the film and made no sense at all. No back story and random people just appears in the movie without any leading up story. The entire movie just seemed \"empty\". No story telling, no moral value to take from it whatsoever. The disastrous acting skill from the actors/actresses only made it worse. It didn't seem like they enjoy shooting the film, and only did it for the money. They were definitely not into their characters when the filming was taking place."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lisee_lulu",
        "review_rating": "3",
        "review_title": "Boring, confusing... *yawn*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "andresbranbury",
        "review_rating": "10",
        "review_title": "This movie deserves over 8 point rating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sol-",
        "review_rating": "4",
        "review_title": "Making the best choice for everyone is never easy",
        "review_detailed_main": "Sent to Hawaii to oversee the launch of a communications satellite, a military contractor finds himself torn between his assignment to convince the local populace that the satellite is beneficial and his knowledge that it actually is not. The plot here is, however, somewhat more complicated than just that as our protagonist has to also deal with tension between himself and a former girlfriend, the advances of a constantly smiling cadet following him around and the suggestion of something sinister behind the satellite launch. The film throws more into the mix than what can be handled in its less than two hour duration and as a result, the various subplots receive unequal attention and disappointingly, the romances and the protagonist's inner conflict receive far more time than the sinister elements at play and the satellite pseudoscience. To be fair, Emma Stone - and especially Rachel McAdams - are solid as the prospective love interests, but the chemistry between them and lead actor Bradley Cooper is never really there. Cooper's internal dilemma (do I obey my superiors or put the real interests of the Hawaiians first?) is also rather mundane with an outcome too obvious from early on. The film certainly does have its moments though. The unspoken communication stuff between Cooper and John Krasinski is very, very good with gestures and looks telling all, and their scenes together remind one that this is indeed a Cameron Crowe movie. In general though, the film does not live up to reputation of its esteemed director and its mixed reputation is quite understandable."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "j_michelle-20510",
        "review_rating": "4",
        "review_title": "Slow to start, does it ever get going?",
        "review_detailed_main": "I'm not sure why this has good reviews, although overall it has only a 5-star rating which is a more accurate representation. Started watching Aloha, and thought it was very slow to get going, to establish a plot and even just the general atmosphere of the movie was very lazy. There were a lot of random ideas and plot points thrown around which didn't really contribute to the main plot line at all, and were not revisited or expanded upon. The movie overall was a rather bland and even boring tale, which could have ended in around 20 minutes if not for the unrelated plot points. Not sure why it's classified as a 'rom-com' as there was nothing remotely comedic about the movie, and it wasn't much of a love story. It's the sort of movie you put on for movie night then fall asleep half way through, which would be easy, as there are no loud noises like in action movies."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "folsominc2",
        "review_rating": "1",
        "review_title": "Where is the Comedy?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tochukwu-83206",
        "review_rating": "3",
        "review_title": "Wastage of an A-list cast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "saletehnolog",
        "review_rating": "5",
        "review_title": "Bad",
        "review_detailed_main": "I can not say that this is an average movie. This is below every average. I can rarely say this for any movie, but this is a wasted time. From any side that a person estimates this film will not be thrilled. The film's action is meaningless with even more meaningless dialogues. Although the film has brought together quite solid actors Bradley Cooper, Rachel McAdams, Emma Stone, it's not enough to do anything from anything. I'm sorry!\n\n5/10"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "yona653",
        "review_rating": "10",
        "review_title": "Love it",
        "review_detailed_main": "I loved the authenticity in this movie.. It's been a real long time, since I've watched a great Rom-com that is cheesiness free.\n\nIt took me back to Audrey's Hepburn movies. with those three powerful actors Cooper, Stone and McAdms. you won't get bored at all. I didn't and I'm one of those people who gets bored easily !!! I loved it and its surely deserves a 10 !! I'm gonna watch it again with my family! man I'm in love with it . And I'm sure you gonna love it, and I still can't believe why it's been rated really low here I mean 5!!!! ARE YOU KIDDING ME!!! It's like this one great movie I mean. Have YOU EVEN SEEN IT!!!! that's just bazaar !!!! I don't know what else to say LOL !!! it has to be more than 10 lines and surely I don't want to be a spoiler!!!! any way I'm telling you if you haven't seen it yet you really should grab your snacks and watch it !!! I was really excited about it and thanks god it was great !!!! I'm really glad that I've been that excited LOL !!! WATCH IT PEOPLE !!! YOU HAVE TO ."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "raz-boy",
        "review_rating": "3",
        "review_title": "not a good movie",
        "review_detailed_main": "Ever since I heard about this movie and saw the trailer I got very intrigued. It is directed and written by Cameron Crowe (\"Jerry Maguire\", \"Almost Famous\") and is filled with an all-star cast; so what could go wrong? Well pretty much everything.\n\nThe movie turned out to be very boring and dull from the beginning to the end. It is about a classic love triangle between the guy, the ex, and the new girl. Usually I don't mind this kind of movies and sometimes even end up enjoying them, however this one was just putting me to sleep. There is no chemistry between the main characters, the dialogue is really bad, and the circumstances surrounding this love triangle are even more dumb. The movie was trying to be funny, but it just wasn't. The only parts that I thought were funny, and I kind of enjoyed were the ones with Alec Baldwin and John Krasinski, and they were only in the movie for about two minutes each. Overall, very disappointed by this movie and by the fact that the actors that I am huge fan of let me down so much."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "wiggityp",
        "review_rating": "5",
        "review_title": "Weird",
        "review_detailed_main": "Very strange movie.\n\nProduction values were definitely high but they just never reached a coherent whole. Dialogue was often immature feeling (lot's of talk about \"mana\" and mumbo-jumbo'y identity crises) and seemingly incoherent with what came before and after. Plenty of acting chops on display but not much direction for them to work with.\n\nThe editing seemed very off tonally somehow as well. The whole thing just didn't seem to flow well. Sometimes seeming like a heavy drama, sometimes a quirky rom-com and sometimes something else entirely.\n\nAlso character development was quite hit or miss. Due, again, not as much to the acting but to weird production/direction choices. Such as bizarre music selections which almost never seemed to fit the tone of the scene it was accompanying.\n\nOverall the movie had nice heart, but it seemed like the heart of a lovable but stupid dog who can't help but smile endearingly whilst micturating on the carpet.\n\nIt's too bad. I think everyone wanted this to be good and it seemed like it would at least be predictably watchable but really ended up being anything but."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "peterspang-90934",
        "review_rating": "3",
        "review_title": "Really dumb movie",
        "review_detailed_main": "Good actors but the movie was really dumb.\n\nVery unrealistic and some parts didn't make sense. It was hard to follow the weird movie line. I don't want to write more because this movie is not worth it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Seraphion",
        "review_rating": "5",
        "review_title": "The acting's what saved this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "topidea",
        "review_rating": "2",
        "review_title": "The worst of Hollywood signals their virtue.",
        "review_detailed_main": "In this pointless romcom, a bunch of amoral characters make themselves feel special by sabotaging the American military for no good reason, while covering up their own nefarious affairs, past and present. Crowe directed his own story (I doubt another director would touch this pablum), while the actors disgraced their profession through an incredible degree of hammy overacting...most notably, Alec (the Spanish Husband) Baldwin. It's like none of these \"name\" actors had anything to do for a week and said, \"Let's take off and get high for a few days and put it on film.\". Awful."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "senseandsense",
        "review_rating": "8",
        "review_title": "Wonderful Film",
        "review_detailed_main": "I read these reviews and people are so mean . While there are a few disjointed elements. the film has a solid story, broad character development and in hallmark Cameron Crowe tradition great integration of story, emotion and music.. Good filmmaking make one root for the characters and we loved every lead character and their pure humanity/vulnerability which is a hallmark of Cameron Crowe. So we are lucky to have seen such a heartwarming film and the performances of Emma Stone, Bradley Cooper Bill Murray and John Krashinski. Boo to film snob. I am sure they nave no clue how hard it is to make a film ( I do) and more importantly how to touch people's hearts."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "Not too bad but not the best film I've seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "danielshumwayslc",
        "review_rating": "1",
        "review_title": "Aloha's 2nd meaning--\"Goodbye\" to hope for greatness or even \"so-so-ness",
        "review_detailed_main": "Say goodbye to this disaster of a movie-- not a disaster movie like the one it opened against in 2015, San Andreas, but itself. One could attempt to blame Aloha's box office failure on its competition, but then one would be completely wrong.\n\nWithin the first 11 minutes of this movie, the viewer should already be getting a sense of its poor flow, lack of cohesiveness, poor writing, strange directing, and its sincere, yet hopeless, attempt to be great, crying out \"Please, please, love me!\" It tries SO HARD to get you to embrace it right away that it quickly introduces 5 stars whom you probably have loved in other films or shows. But it's already too late. It's doomed from the start. Sorry, folks...it's a STINKER."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "nahum-ezer",
        "review_rating": "5",
        "review_title": "Realistic for the content",
        "review_detailed_main": "After living on a remote military base, for the space business - and as a contractor - this film does show what it is really like in that business. Others have said that this film is \"all over the place,\" and it is like the director expected you to already know or understand most of the missing details. From my background, it was not difficult to do that.\n\nEven though this film is realistic (I kept thinking, \"that's what it was like for me when I was there!\") , it still needs work. I would not highly recommend it, to watch with your family. It would be okay if you just wanted to find out what the space business is like, or wanted to find out what you might have to deal with, if you went overseas as a contractor.\n\nIn conclusion, this is more of a reality show than a family movie. I really don't like the language or the adultery. I guess the director wanted to tell you how it really is for some people."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "russellingreviews",
        "review_rating": "4",
        "review_title": "No 'Mana' in this muddled island romance",
        "review_detailed_main": "Hawaii can be heaven and it can be hell. - Jeff Goldblum\n\nWalking into the cinema... Aloha seems to have all of the right elements: cast, director and writer. But will these elements lead to good chemistry?\n\nOverall Rating: 2.25 stars Cinematic rating: 2 stars Bigger questions rating: 2.5 stars\n\nBrian Gilcrest (Bradley Cooper) is a celebrated military contractor that has fallen out of favour with most of the people in his life. His career is given a lifeline with an opportunity to redeem himself after a professional debacle that not only upended his career, but almost ended his life. This redemptive opportunity is found in the mountains of Hawaii. Within five days, he needs to negotiate a deal for the sake of a future partnership in space exploration between a corporate sponsor, the military and the local tribal leader. In amongst the trials of his professional challenges, Gilcrest must come to terms with past and new relationships on the island. This kaleidoscope of drama is coloured by his former girlfriend, Tracey (Rachel McAdams), her family, an eccentric billionaire, Carson Welch (Bill Murray), and a hard charging military liaison, Allison Ng ( Emma Stone). The self-absorbed contractor has to come to terms with letting go of his past love, determine what he is willing to sacrifice for redeeming all aspects of his life and how to respond to the love/hate relationship with Allison. This twisted pineapple dream is written and directed in the unique style of Cameron Crowe (Jerry McGuire).\n\nCrowe fell in love with the Hawaiian Islands while filming on location. He felt that the islands had a spiritual quality that touched his life and he calls Aloha, a love letter to Hawaii. Throughout his island story, he writes of many spiritual elements and the mythology of the volcanic islands, but gives special notice to the blowing winds which provide the 'mana' of the Hawaii. Mana is given credit as a magical element to the story when it blows through the trees, blows open doors and connects with the people who are aware of it. This island breeze seems to provide special powers that allow people or situations to go from the ordinary to the exceptional. In this cinematic island adventure, mana is assumed with the combination of this director and this acting ensemble. In the end, the assumption is wrong, the mana merely provides a short blast of air that blows in disappointment.\n\nThere are whispers of Crowe's signature writing abilities, but these short wisps are lost in the disjointed story and poor editing. Aloha proves to be a film that would have benefited from more story development, which would have provided a more robust character history. This history would have provided the depth of relationships and credibility for key plot points in this romantic tale that we have come to expect from Crowe. The jumbled plot diminished the chemistry and tensions in the central love triangle. This is most evident in the lack of chemistry between Cooper and Stone and the unbelievable reaction of Tracey to Cooper and her willingness to give up her family for him. Neither of these dimensions in the triangle lead to a satisfactory or plausible love story.\n\nThe only satisfactory components in this narrative that provide a glimpse of the Crowe magic are found in the male camaraderie and the familial underpinnings. John Krasinski (The Office) is brilliant in developing a quiet foil to Cooper. The male communication model is hilarious, it adds strength to the characters and is a stabilising element to the disjointed writing. Even though the lead actors suffered from a lack of relational believability. Krasinski and McAdams deliver the most endearing and Crowe-esque ingredients The beautiful depiction of the Woodside family, despite their quirks and dysfunction, give Aloha a short- lived 'mana' experience. These brief windows of Crowe magic cause most of the mana to become a mere vapour. If Aloha was Cameron Crowe's love letter to Hawaii, it might be worth marking it 'Return to Sender.'\n\nLeaving the cinema... There were a few highlights, but they could not overcome the difficulties. Aloha had so much potential, but failed to deliver a satisfactory cinematic experience.\n\nDo not give up hope this year for good romantic comedies, Man Up would be Russelling Reviews romantic recommendation for the season.\n\nReel Dialogue: What are some of the bigger questions to consider from this film? 1. What does the Bible have to say about romance? (Proverbs 5: 18-19, Song of Solomon) 2. Can we find true redemption in this life? (Romans 3:24-26, Ephesians 1:7) 3. Where can we find real love, hope and joy in this broken world? (Acts 24:14-16, Romans 8:24)\n\nWritten by Russell Matthews based on a five star rating system @ Russelling Reviews #russellingreviews"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "klarebear",
        "review_rating": "4",
        "review_title": "Retitle this \"awkward staring at each other\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jimwhit",
        "review_rating": "10",
        "review_title": "For those who don't need to be handheld",
        "review_detailed_main": "A brilliant time for anyone who appreciates the richness of Show, Don't Tell. A story told in dialogue that says the inbetween rather than on-the-nose. A movie asking the actors and interactions to be observed to, rather than catering to box office goers' need to feel smart. A tender visit to a pivotal time for a gallery of people deployed in a obnoxious graveyard of United States' imperialism. A compelling movie, painfully displaying lovely bonds, to an honest backdrop of shameful disregard."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "analovescoffee",
        "review_rating": "2",
        "review_title": "Weak plot , kinda boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "upular",
        "review_rating": "1",
        "review_title": "Complete trash!!",
        "review_detailed_main": "What a waste of time. It's a trash. The plot is disjointed and makes no sense at all. The characters turn the emotions around quickly without any reasons. The dialogues are bizarre and often try so hard to be sophisticated yet stupid. The only Thing baffles me is how this trash can assemble all these good actors??"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "IronBallsM",
        "review_rating": "",
        "review_title": "Not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "studioAT",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "With the pedigree of the cast and creative team (well, Cameron Crowe) involved, you wouldn't expect this film to be a flop. But oh dear it is.\n\nShoddy dialogue, pointless scenes, and wooden performances all come together to make you want to say 'goodbye' rather than 'Aloha'. It's almost a headache trying to work out how very good actors like Rachel McAdams who are normally so reliable all came together to make this sorry mess of the film.\n\nAdmittedly it picks up after a particularly bad first half hour, but never to the level it should.\n\nThe less said about Bill Murray's role in this the better too. How a guy who famously chooses his projects carefully looked at this script and thought it would be good I don't know.\n\nAvoid this film."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bsbulldogs",
        "review_rating": "1",
        "review_title": "Aloha no!",
        "review_detailed_main": "Before watching this, my thoughts were that it was going to be an average film at best, I knew this didn't have classic written all over it. Sometimes, when you first start off watching a particular film, you can tell it's going to be bad about half way through or even a quarter of the way through. I could personally see it in the first ten minutes. Not much happened then and nothing much else followed. Critics can get it wrong when say for instance they say a movie is great yet you, the viewer find it terrible. Or when the critics hate a film and yet you love it. They got it wrong here by saying it was average as I found it to be terrible, possibly one of the worst films I have ever seen. The plot of the film is pathetic and non-existent, the acting is wooden, the story is dull and I could go on but I won't be wasting any more time than it took me to sit through this one hour and forty five minute snooze-fest. Bradley Cooper and either Emma Stone/Rachel McAdams do not work as an on-screen couple as the chemistry was lacking, Alec Baldwin totally wasted as was John Krasinski, not like it matter much in any case. When I watch movies and need a bathroom break, I normally pause the movie. Here, a pause of the DVD was unnecessary as I didn't miss a thing. So terrible this experience was, I wouldn't even recommend buying this for a viewing if it were 50 cents in a op shop basket."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bobzmcishl",
        "review_rating": "3",
        "review_title": "Worst Movie This Year",
        "review_detailed_main": "I write reviews when either the movie is great or bad, and this movie is the latter. Emma Stone in no way made me believe she was a hotshot Air Force F-22 fighter pilot. She was not only miscast but overacted and it was hard to swallow that a pilot held in such high regard would be assigned such a menial task as accompanying a washed up ex-Air Force officer on a mission to Hawaii as a contractor. Bradley Cooper for some reason slept walked this way through the movie. Bill Murray was awful as a billionaire pushing for privatization of the space program. The movie went way overboard with the obligatory Hawaii native islanders sacred ground routine and it was a ridiculous plot point to string together concern for sacred land versus putting a private satellite in earth orbit. The plot was the worst thing about the movie. They couldn't decide whether to make a romantic comedy or a thriller and did a bad job at both. I think they were opting for a romantic comedy but these characters had zero chemistry. Ten minutes into this movie and I was ready to send it back to Netflix but I kept thinking it might get better. It actually got worse. Don't waste your time."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "leslie_mac",
        "review_rating": "9",
        "review_title": "Fun Summer flick!",
        "review_detailed_main": "I really enjoyed this cute, light-hearted romantic comedy despite some of the negative reviews I had been reading. I'd reluctantly joined a friend and really wasn't expecting much, but surprisingly found Aloha to be very entertaining, heartwarming and fun. Perhaps it didn't have the most complex plot, but both of us thought it was a great story about relationships, past hurts, and love - bringing lots of laughter and some twists and tears in the end. I found that the mix of characters worked very well together and they really grew on me as the movie progressed. The Hawaiian scenes and music brought back some fond memories of days spent on the Islands. Loved the mix of cast and characters and would definitely recommend this story for a fun, light, summer flick!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "agmoldham",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "Unlike a lot of people on IMDb most of my ratings are in the 3-7 range. A 2 is very unusual, but well deserved by Aloha. It escapes being the 5th film of 800+ to get the bottom rating due to the fact that some of the scenery is pretty spectacular.\n\nThe film tells the tale of a military man Brian Gilcrest (Bradley Cooper) returning to the Hawaii base where he meets up with his long lost love Tracy Goodrow (Rachel McAdams). There is a love triangle with Alison Ng (Emma Stone) who is assigned to him at the base.\n\nBearing in mind just how photogenic the trio of actors are it's hard to imagine just how little chemistry there is on screen. You really can't care a jot how the love triangle ends and to be honest it's a few weeks since I saw it and can't remember what happens. A truly awful movie!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jab1652",
        "review_rating": "",
        "review_title": "Terrible, terrible movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "febru3012",
        "review_rating": "2",
        "review_title": "An \"A\" list cast in a stupid, insipid dreadful B movie. By all means skip it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ksohn97",
        "review_rating": "4",
        "review_title": "Meh",
        "review_detailed_main": "I think Aloha's quagmire of a plot had been addressed sufficiently, so I will focus on the acting portion of the film.\n\nBradley Cooper put in a completely uninspired, if not, at times, a strangely laughable performance. His blank stares and sheepish smiles, his monotonous delivery and, oh god, his half-assed attempt at being angry were a pain to watch. He seemed like a substitute actor who had no interest in partaking in the film, but somehow ended up as the main character.\n\nEmma Stone was mediocre. But, to her credit, at least she was lively and invested in her character. Still, I don't think she was the right actress for this role. She came off a bit too cartooney - is that a word? - and melodramatic in some scenes. Great actress, wrong casting.\n\nNow there are a few actors who have absolutely no business being in this film. Literally, the only reason why Bill Murray, Alec Baldwin, and John Krasinski are in this film is because they're established names in Hollywood. Other than that, however, their roles could have been filled by some Craigslist actors and it would not have made one bit of a difference to the final product, because that's how insignificant their characters were to the film. Oh, and John Krasinski and Bradley Cooper's non-verbal heart-to-heart moment was just downright bizarre, or bizarrely hilarious - the whole movie seems this way, actually.\n\nThe only saving grace, I thought, was Rachel McAdams's performance, which was wonderfully executed, and surprisingly authentic. In short, she seemed like she cared - not just about her character, but also about the movie - though, in vain, I'm afraid.\n\nDon't waste your time watching Aloha, unless you have a major celeb crush on Emma Stone or Rachel McAdams, or both."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "silasprins",
        "review_rating": "5",
        "review_title": "What's happening",
        "review_detailed_main": "The moving shifts between 'done before a million times' and incomprehensible incoherent. Fever dream stuff.\n\nWhy is everyone so close to the screen! There is no guidance. At no point do I know what's happening en where we're going.\n\nThe camera being so close to the characters kind of mirrors the viewers perspective of the story and what feels like the vision of the director. We as wel as him lose all orientation and end up, like him, left to whatever his last remaining brain cells conjure up given the current setting.\n\nIt's a mess. My only question is how did the actors not catch on and intervene? This is a man losing his mind.\n\nPs: this movie is either amazing on drugs or a hell."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "futuretype",
        "review_rating": "3",
        "review_title": "Mish mash of acting and storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "explorer-08638",
        "review_rating": "10",
        "review_title": "I loved this movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bjarias",
        "review_rating": "5",
        "review_title": "..an easy and justifiable Aloha",
        "review_detailed_main": "Just goes to show big names (Crowe, Cooper, McAdams, Stone) will not always guarantee to get you into the black. This was a case where the story-line did not pan out. It's just totally unmemorable (and that's after seeing it yesterday!). When you think of coming across a film another time, and will readily watch it all over again... well this is NOT one of those movies, and when that includes the likes of a McAdams and a Stone that is not good. And it's not going to be on anyone's 'recommend' list, even though it's probably one of Cooper's more watchable performances (guess that says something). It had to be a case where it looked a lot better on paper than what came out on the screen. The writer-director-producer dynamic does not always go well."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "nicholaslewiswriter",
        "review_rating": "5",
        "review_title": "Cameron Crowe Wanders Off",
        "review_detailed_main": "Some artists become so enthralled with their ideas and styles that they get lost in their own world and we are stuck here trying to decipher the meaning behind their art. Such is Aloha which is more of a character study of the director himself than the people residing in the purely fictional mess this story is. The creative choices for this movie are so idiosyncratic and downright bizarre, you stare in amazement than irritation or boredom."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mulholland-lily",
        "review_rating": "3",
        "review_title": "Horrible",
        "review_detailed_main": "A stellar cast wasted in a ridiculous space wars flick. What were they thinking?"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "TheMunkeyBoy",
        "review_rating": "4",
        "review_title": "So disappointing",
        "review_detailed_main": "A fan of most of Cameron Crowe's movies. But this was very much a disappointment. I advise to avoid."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "thekatieware",
        "review_rating": "3",
        "review_title": "Do Bradley Cooper + Emma Stone hate each other?",
        "review_detailed_main": "I couldn't tell you what this movie was about because Bradley Cooper and Emma Stone had such an uncomfortable awkward tension between them all I could do was wonder if they hated each other in real life the whole time I was watching it.\n\nI have concluded they must hate each other as I have never felt that so palpably when watching a movie before.\n\nThe 3 stars are for Regina George and Jim from The Office.\n\nTruly for such an all star cast this movie was quite a dud and at this point I'm only continuing to type this review because there is a character limit. I can't stress enough how much I felt Bradley and Emma hated filming together. It was really really uncomfortable to watch."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mboyleg",
        "review_rating": "10",
        "review_title": "Expected less",
        "review_detailed_main": "When I see a movie listed that I am not familiar with, I typically do a search on it to see what others thought of it. Most of the critique on this film was negative. But I always need to be the judge.\n\nAfter watching this movie, I was so pleasantly surprised with how much I enjoyed it that I was happy that I went with my gut and spent the time. Since then, whenever it's on, I get hooked all over again.\n\nSome say it's a feel good film and I think that's exactly how I would describe it. The story, the characters, the acting, all solid. It was bright and interesting.\n\nWith regard to Ng, never been much of a Stone fan but she made the movie with her zest for life and her optimistic, spiritual buoyancy. Much has been made of how her character does not look 'diverse' enough but she makes it a point to say she is Chinese, Hawaiian and Swedish. Just maybe the Swedish genes were dominant but she never wavers from and in fact embraces her Asian roots so I saw it as all good."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "5",
        "review_title": "Admirable attempt falls flat",
        "review_detailed_main": "Cameron Crowe's \"Aloha\" is at its most interesting when it's focusing on Hawaiian folklore and legends and the perpetual conflict between the natives and an American government that is viewed as little more than an interloper by the islanders. Unfortunately, in the screenplay by Crowe, this intriguing aspect is largely relegated to the background while a comparatively banal love triangle takes center stage.\n\nThe male point of that triangle is a cynical, morally compromised military contractor played by Bradley Cooper whose return to Hawaii complicates the lives of his ex-girlfriend (Rachel McAdams) and the female Air Force captain (Emma Stone) assigned to be his liaison between the military and the natives on the islands.\n\nWhile Cooper is trendily worldweary and vulnerable, Stone is upbeat, cutesy and perky to the point of distraction.\n\nDespite an amiable cast that includes Bill Murray, John Krasinski, Danny McBride and Alec Baldwin in supporting roles, there are not a whole lot of buy-in points for the viewer, thanks to insufficiently developed characters and a lack of focus in the storytelling.\n\nEven a nicely executed final scene isn't enough to redeem most of what's come before."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tinkwasmine",
        "review_rating": "1",
        "review_title": "Booooring!",
        "review_detailed_main": "The characters are boring, the story is boring, this movie is a waste of celluloid. There is no plot, the characters just wander around doing and saying inane stuff. We turned it off after a half hour and put it back in the envelope to mail back. I gave it one star on Netflix and in this review only because there is no way to give it zero stars. It is the very definition of a failure."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sofia5553",
        "review_rating": "1",
        "review_title": "Booooring and cheesy!",
        "review_detailed_main": "Struggling to keep watching. I don't even understand what this movie is about? Is it a political/social comment or just a cheesy romantic flick? And what's up with all the mythology talk? Most of the time it looks like they're actually making fun of the Hawaiian people while trying to sound respectful! Ridiculous! Writing this while I try to keep watching but giving up as I type..."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "neil-337-103676",
        "review_rating": "3",
        "review_title": "Confused",
        "review_detailed_main": "Why do so many really good actors and John Krasinski sign up for such a mess of a film?"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "estreet-eva",
        "review_rating": "4",
        "review_title": "Not so much quirky as a lot of quirky set pieces fashioned together",
        "review_detailed_main": "Forget that Emma Stone doesn't work as half-Chinese / half-Hawaiian, she doesn't work as a go-getter Air Force F22 fighter pilot. Really? Luckily she drops the character fairly early in the goings and becomes the doe-eyed girl meeting Bradley Cooper's boy. Also forget the plot, something to do with Bill Murray's billionaire Carson launching a nuclear missile into space so he can...take out rival billionaires? (Anyway the Russians have had them up there for decades so a little late to the party Bill). Alec Baldwin plays a bellowing general, well, for a while, then he becomes just another guy to go with Bradley Cooper's guy. John Krasniski has no lines in one of the movies many quirky running gags - he needs to find another agent. The scenery is nice and when the weirdness becomes no worth the effort gives something to look at. In short, FREE HAWAII! (even though it wouldn't last out the rest of the year as an independent nation)...or an avoid this bit of oddness."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "carmenvladoianu",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cricketbat",
        "review_rating": "3",
        "review_title": "A waste of talent and a waste of time",
        "review_detailed_main": "There's something off about Aloha. It's as if there are conversations and character development that happen off camera, which would explain certain moments, but we, as the viewing audience, aren't allowed to watch them, so nothing really makes any sense. This movie is a waste of talent and a waste of time."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jawneyfloros",
        "review_rating": "",
        "review_title": "A rom-com that is all over the place",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "vlilla",
        "review_rating": "4",
        "review_title": "Unexpectedly bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jacquiejoanne",
        "review_rating": "2",
        "review_title": "Snooze fest!",
        "review_detailed_main": "I was excited to watch this movie because of the cast! It was extremely boring, I do not recommend wasting your time."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sue_yang",
        "review_rating": "2",
        "review_title": "Speechless",
        "review_detailed_main": "Have no idea what this is. BC, ES and RM must be so regretful for making such thing, just as RR is for Green Lantern."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "selenkars",
        "review_rating": "1",
        "review_title": "What a nonsense plot!!",
        "review_detailed_main": "Does this movie has even have a plot? I have never watched such a disjointed, fragmented movie. I struggle to understand how they have convinced the cast to be a part of this movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "juliarohan",
        "review_rating": "9",
        "review_title": "I went through the unbelievably long and unnecessarily convoluted process of verifying an IMDb account just to defend the loveliness of this movie",
        "review_detailed_main": "Please ignore anyone who gave this movie a poor review. They are too dense to see the multifaceted and nuanced humanity this movie presented so beautifully. I'm sure Michael Bay is those folks' fave director and they watch The Kardashians religiously.\n\nBut to the rest of us, this captures the intricate layers of what it is to be human. To work, to enjoy your work...and love and to move on from old love to new love and the growth that comes with it. To attempt to do something more in life and to laugh and make mistakes, and then freak out that those mistakes were a national security risk.\n\nI don't know how people didn't love this movie. It has some of the best actors of our generation (Emma Stone is a treasure) used expertly and is an exercise in both verbal and nonverbal communication as well as the depth that comes with age. These characters are real and not 2 dimensional tropes. Go watch and give the negative reviews a solid middle finger and question their intelligence as well."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "grantss",
        "review_rating": "3",
        "review_title": "Incredibly bad - easily Cameron Crowe's worst film",
        "review_detailed_main": "A former US Air Force officer, Brian Gilchrist, returns to Hawaii as a civilian contractor. He now works for a private space company, owned by multi-billionaire Carson Welch. This return is a homecoming of sorts but is bitter-sweet: his best friend is now married to his ex-girlfriend and he still holds a torch for her. Then there's Allison Ng, the beautiful Air Force captain tasked with watching over him.\n\nWritten and directed by Cameron Crowe, this is easily his worst film. Crowe made some great films - Say Anything, Jerry Maguire, Almost Famous, Vanilla Sky - as well as writing the excellent Fast Times at Ridgemont High. However, his output after Vanilla Sky - 'Elizabethtown' and 'We Bought A Zoo' - was less impressive. Not bad, just not great and not in the same league as the aforementioned movies.\n\nAloha confirms that his output trajectory is definitely downwards.\n\nAloha is incredibly bad: a half-baked romance mixed in with a nonsensical, farcical examination of the ethics of weapons in space and civilian space companies, with a bit of Hawaiian culture thrown in to please the politically correct crowd. Nothing ever feels plausible or is even interesting. The movie just rumbles along, with random divergences and a cliched central plot.\n\nGreat cast - Bradley Cooper, Emma Stone, Rachel McAdams, Bill Murray, Alec Baldwin, John Krasinski, Danny McBride - but even they feel like they're phoning it in. Stone overdoes the intensity initially, though gets better as the movie goes on.\n\nProof that Cameron Crowe has run out of ideas."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "vinnmann47",
        "review_rating": "3",
        "review_title": "Just plain Bad",
        "review_detailed_main": "This movie is just plain bad from beginning to end. The plot makes no sense, the dialogue makes no sense, and some scenes are so bad they make you cringe. Emma stone I think is channeling Marcie from Charlie brown and Bradley cooper must have been high when he made this movie. I love when he howled out the car window for no reason. I guess cause he goes hard and he goes deep and sometimes he breaks things. Also dont forget three day beard boy, mr. Sexy pants Alec baldwin great dialogue in that scene. This movie is so bad you have to watch to make you laugh."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kristann-04642",
        "review_rating": "3",
        "review_title": "Curiouser and Curiouser... Puzzled by This Hot Mess.",
        "review_detailed_main": "Very perplexed by this one... Did I just enjoy myself? I don't think I did...\n\nThe talent in this movie lived up to their names and the chemistry was definitely there. The acting was the only thing that kept me watching really. That being said, watching this plethora of story lines unfolding felt very disjointed and uncomfortable.\n\nI wasn't sure if it was maybe supposed to be some sort of parody because of some of the outlandish & goofy scenes and plot points, but it wasn't at all funny. The whole thing felt a little forced and as many others said, like it just didn't know what it wanted to be.\n\nOne slight redeeming factor is that I did appreciate the ode to non verbal communication. But again that is attributed to the A List casting.\n\nI think in theory this could have been a great movie had it had some direction and a few subplots shaved off (or at least blended/smoothed out.)\n\nOther than the stellar cast, I honestly can't fathom why anyone whole heartedly enjoyed this movie... I dont actually believe they did.\n\nThe only reason I'd recommend this to a friend is to see if they could explain to me what I missed that would make this a good movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ida96",
        "review_rating": "2",
        "review_title": "Not feeling the love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "Strictly Average!",
        "review_detailed_main": "Cameron Crowe's 'Aloha' is strictly an average fare, with a few good moments. But overall, Crowe hasn't delivered a wholesome Romantic-Drama, that one expects from the prolific Writer-Director.\n\n'Aloha' Synopsis: A celebrated military contractor returns to the site of his greatest career triumphs and reconnects with a long-ago love while unexpectedly falling for the hard-charging Air Force watch-dog assigned to him.\n\n'Aloha' is aimed to be a feel-good entertainer, but in reality, it merely offers a few good moments, that leave a mark. The portions involving the protagonist (Bradley Cooper) & his lady watch-dog (Emma Stone), are cute. But otherwise, nothing really arrests. The sub-plots are weak comparatively, especially the one involving the protagonist's ex-flame (Rachel McAdams). Crowe's Screenplay tries to be a lot of things, but only engages in bits & pieces. His Writing isn't bad, but it isn't strong either. Certainly, Crowe can write better! Crowe's Direction is fair. Cinematography & Editing are well-done.\n\nPerformance-Wise: Bradley Cooper is awkward all through. Emma Stone is the pick of the lot. She's very natural. Rachel McAdams is sincere. John Krasinski is alright. Bill Murray & Alec Baldwin are wasted. Danny McBride is adequate.\n\nOn the whole, 'Aloha' is a so-so fare, at best."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mileperic",
        "review_rating": "10",
        "review_title": "Aloha Celebrates Life",
        "review_detailed_main": "In a quiet randomized order, one man's moves take him to the point of clarification - what has been missing in his life for years. This is the type of movie getting closer to our hearts as the story develops. The way the main character and his daughter create an unbreakable mental bridge is absolutely unforgettable.\n\nSomewhere in this movie, it is also underlined that everything happens for a reason - and that is where Aloha becomes a real storyteller.\n\nAbove all, nothing is particularly sensational about this movie. This is one of those helping us discover the beauty of life - all over again. However, life is a sensation by all means. \"Aloha\" goes to that."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "vejarbejde-00569",
        "review_rating": "2",
        "review_title": "How to human?",
        "review_detailed_main": "Someone with a lot of impact on this movie has clealy lost touch with normal everyday life. He's obviously so succesful that human relations isn't something that takes any kind of effort, because everyone wants something from him. That is the only explanation I can find for the flaws in this movie. This is like a movie from the point of view of a big slobbering dog that jumps up on everybody - only in this movies universe everyone is somehow totally ok with it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "devrebristow",
        "review_rating": "4",
        "review_title": "Boring",
        "review_detailed_main": "Not much to say , didn't hold our attention. Boring"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jaimeeandellie",
        "review_rating": "3",
        "review_title": "Rushed and Confusing",
        "review_detailed_main": "Some funny and feel good scenes throughout the movie, but the whole idea of the film was confusing to watch and felt a bit rushed. I watched the movie with my mum and we were expecting big things, as the actresses Rachel McAdams and Emma Stone are top favourites of ours, but we were immensely disappointed.\n\nBy rushed, I don't mean the making of the film, I am talking about the rushed relationships in the movie as we got no context from any of the characters backgrounds or former relationships, which I consider very important\n\nIf you are looking through the reviews to decide whether to watch the movie, I wouldn't recommend it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "edwagreen",
        "review_rating": "3",
        "review_title": "*1/2*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dont-fall-asleep",
        "review_rating": "4",
        "review_title": "Alo-huh?",
        "review_detailed_main": "So messy, you're up for a meh movie in general and a disaster of a plot and pace, too fast. An attempt of an easy going and feel-good movie but adding unnecessary complications, to the point where it doesn't sound smart, just ridiculous. I never knew what to feel even when the characters where telling me, the last scene with the daughter could be from a horror movie if you change the music."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kymhaze",
        "review_rating": "8",
        "review_title": "I liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "alexandredrouin-49324",
        "review_rating": "1",
        "review_title": "Empty movie",
        "review_detailed_main": "That was by far the best movie I watched in the last 2 Hours. I don't really have words to describe this movie, because I didn't understand half of it!\n\nI had the choice between watching this movie and create an empire to be the richest man on earth, sadly it's seems that I made the wrong decision!\n\nI recommend you this movie sincerely if you want to lost 2h and ask yourself WTF I just watch!\n\nSpoiler alert : That movie will probably win an Oscar and leonardo dicaprio will lost against it!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kilohanamama",
        "review_rating": "4",
        "review_title": "BARF!!!!!",
        "review_detailed_main": "Hawaii, Hawaiians GREAT!!!!! Casting...stunk...story...stunk...Whoever responsible should be on a rail out of town...an embarrassment to Hawaii and its people and the actors Who consented To associate, and the subtle political okoles who contributed their stupidity and bias. Hawaiians would say this is \"opala\" Look it up you waiwai 'ole okoles!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "A Bradley Cooper fest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "1",
        "review_title": "Uggggggg",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "abo_furoz",
        "review_rating": "1",
        "review_title": "Soooo boring",
        "review_detailed_main": "Don't waste your time, the whole movie is a mess. Why would anyone be apart of such a movie!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "haranatsutsmdiaa",
        "review_rating": "5",
        "review_title": "The cats were amazing that's all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "DarkVulcan29",
        "review_rating": "8",
        "review_title": "Bradley Cooper and Emma Stone are watchable",
        "review_detailed_main": "The Hawaii setting here pretty much becomes a character here. Bradley Cooper does a descent job as Military man trying to bring closure of his past mistakes, so was Emma Stone as a female pilot who befriends Coopers character. Together they have incredible chemistry, and make on screen magic. Emma Stone seems to make any film, either good or bad, memorable. Rachel McAdams is alright, so was John Krasinski. But other actors like Alec Baldwin and Bill Murray feel like wasted goods here. Although is was nice to see Danny McBride not play an overly vulgar character for once.\n\nWriter-Director Cameron Crowe has always been good for unique storytelling in his films, but this seems like to much was edited out. I may be the only one here who didn't think this movie was to bad, but I no way would say this movie was great, I certainly didn't love this film. It's a film for me to say the movie is only good seeing one time. But I wouldn't say it's all terrible either."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "xatzieric",
        "review_rating": "1",
        "review_title": "Worst movie I have ever seen",
        "review_detailed_main": "They were stretching the movie so bad. I am disappointed for sitting through the whole movie. It was just a waste of time. One of the worst movies I have ever seen along with Tarzan(2016)Bad casting terrible acting. That is all I want to say and I don't recommend this to anyone unless they want to kill themselves or just waste their 107 minutes from their life. I really want to go to the director and tell him what a disappointment he is and then I am going to think about how disappointed I am from my self for watching the whole movie. I believe that even I could make a better movie out of these actors and story and it would not even be hard. Just flock all those people and their totally fraud movie. I would be ashamed to put this in the theaters even if I would make a ton of money. The worst scene is the one with the party with the Hawaiian locals. It was just extremely boring and sh atty. I am much prouder for the time wasted to write this review than I am for watching the movie. If you were getting ready to watch it you still have time to quit guys. Fock this movie........."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "eodgibson",
        "review_rating": "1",
        "review_title": "Disrespectful to Gold Star Families & Vets",
        "review_detailed_main": "Whomever their military liaison was insulted every gold star family out there and veteran with deceased brothers and sisters by combining the repatriation of a fallen American with a party on the ramp.\n\nNo one would be dancing, messing about, or doing ANYTHING other than paying respect to the fallen, in formation or otherwise lined up on both sides, in quiet solidarity with the fallens family and friends.\n\nI am saddened that the Hickam Command allowed this to occur on their airfield. Yes it is a movie, yes it is a parody of life but that scene should have shown what really happens. The fallen is treated with dignity and respect as he or she is transferred from the plane on their way to their final resting place. The American people would have benefited from seeing this as it happens day or night, rain or shine regardless of politics or rank.\n\nThis was a shameful scene in a terrible film."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "stephendaxter",
        "review_rating": "5",
        "review_title": "A little heavy on the romantic side but still enjoyable",
        "review_detailed_main": "Aloha is a romantic comedy that stars Emma Stone and Bradley Cooper leading a cast with so much talent, and that talent was largely underused and unfortunately just in a not so good movie. Looking back, you also have Rachel McAdams, John Krasinski, Bill Murray, Alec Baldwyn, and Danny McBride, these are all quality actors in the romance/comedy genres but none of them really shine in this film that has overall messy writing. The movie has so many shifts in tone and pace that it is very uneven from start to finish where some moments are rushed and some are dragged out for a while. There were brief moments of comedy here and there but nothing really to deem this movie a romantic comedy, it got me to chuckle a few times throughout but they were so spaced out that by the end the romantic emphasis trumps whatever comedy there was. John Krasinski was the source for 80% of the comedy in this film, pretty much every time he was on-screen i was laughing, not the laugh out loud kind but a good chuckle, so he bought a nice lighthearted feel to the film.\n\nNow, Emma Stone's character Allison is the most interesting character in this movie, not in a good way but also not in an extremely bad way. I feel like they made a mess of her character, she felt like a blend of a few different characters that take over her body at different points in the movie. Very early on i was liking the character, her quick talking and confronting personality really clashed and contrasted with Brian (Bradley Cooper) pretty well. But that quickly changed when within 30 minutes she was really getting on my nerves and i was thinking that she should get the 'X-Men Origins' Deadpool treatment ASAP. But then, by the 1 hour mark she calmed down and was simply playing a love interest or one corner of the love triangle for the rest of the movie. And she kinda goes in and out between these three states briefly throughout the film. It would have made sense if there were events forcing her to change in certain ways but the only reason she was changing so much was because the script said so.\n\nThe plot is very weak for most of the film, you occasionally have 10 minute bursts where the NASA based main plot takes control but those moments are very few and you only really piece together what is happening and why later on in he movie. At the other moments it is the romantic elements that drive this movie at a slow pace towards the end. Even though i thought that Bradley and Emma's characters had good chemistry and Bradley and Rachel's characters also related well i thought that some of the events that happen between them weren't natural. The inclusion of the love triangle that kind of exists for some of the film only adds to the list of romantic film clichés to be found. The movie doesn't offer anything new but was still a pretty watchable experience, i never found myself wanting to turn off the movie because i was for some reason still mildly entertained.\n\nIn the end this is not a bad movie, it is definitely watchable does have a little that you can get out of it. The problems with the movie in addition to the writing were almost all minor issues i had that added up to end up with an dissatisfying result. I also have to say that some of the cinematography in this movie was awful, some of the framing and movement of the camera shots were at times distracting. There were multiple really close-up shots and awkward zooming in, out and around conversations that i was picking up. All of these camera related issues i noticed early on in the movie as oppose to later on. But i did like Bradley Cooper, and the supporting cast was all pretty spot on, just as i said, minor issues added up to make for a not so great movie. If you are a fan of the romantic comedies, even though this one is very skewed to the romantic side i think you may still enjoy it. - 5"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "katieanddustin",
        "review_rating": "5",
        "review_title": "Confused plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "DJ_Shilo",
        "review_rating": "1",
        "review_title": "Aloha is a sad Trainwreck - Worst of 2015",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "prudhocj",
        "review_rating": "9",
        "review_title": "Forget everything you think you know about this movie and just watch it!",
        "review_detailed_main": "I'm not entirely sure what got this film deep-sixed but ignore everything you've read about it and watch it! It's very good....great performances and cast, good script, Hawaii, Emma Stone and \"Bumpy\". It never drags and the story has a tidy little twist at the end that is very satisfying. Much, much better than the nay-sayers convoluted, misguided attempts to sound smart and politically correct at the expense of what's actually on the screen."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kathrynr-96363",
        "review_rating": "3",
        "review_title": "Such a mess",
        "review_detailed_main": "Great mess, really bad movie. I would not call it a rom com, but am not sure how to classify it. Awful dialogue and a confusing plot, with an end scene would be considered ridiculous even if the viewer downed an entire vat of disbelief before hand.\n\nI am wildly curious as to how such a famous and generally talented cast came to be associated with this project. Were they offered zillions of dollars? Was there blackmail involved? Did they lose a bet? Inquiring minds want to know.\n\nThree stars given only because of the dance scene with Bill Murray and Emma Stone and because I got to look at Bradley Cooper for an hour and a half."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "robb-882-472407",
        "review_rating": "2",
        "review_title": "Disappointing",
        "review_detailed_main": "I had very high hopes for this film. A great director with an all star cast. It's almost as if there was too much story to tell, and all the continuity was left on the cutting room floor.\n\nThe plot line just jumps so much you wonder what is happening. After a while, you can sort of make assumptions on the intent of the plot. From there, you see where the intention had been to sew things together, but it just never really makes it into the story line, making the film very difficult to watch. I sincerely hope they someday release a directors cut that closes the plot gaps.\n\nI will say the acting was superb, as was the filmography. Spectacular exchanges between characters, and Bradly Cooper does an amazing job bringing the inner struggles of the character to the audience.\n\nIn the end, I feel compelled to rate this film very low. It could have been a beautiful movie if produced better."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "diabolaude",
        "review_rating": "3",
        "review_title": "Ho dear... what a waste!!",
        "review_detailed_main": "Casting is quite impressive but ho dear this is such a waste! The movie is indescribable, I mean it is too predictable, too sugary, clumsily put together... I cannot even find words really (which is rare for me). Even a bottle of red wine cannot get you hooked on the movie it is such a waste of comedian, character and time. When critics are so extremely different it makes me curious and I often have good surprises but not this time... nope..."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "bravo-super",
        "review_rating": "10",
        "review_title": "Congratulations",
        "review_detailed_main": "Congratulations to the entire team, Bradley, Emma and Rachel and all others. Like all actors, in combination with the beautiful film makes everything look different. Fortunately, you made this movie and there was something that you refuse. I think Bradley in this film rehabilitate himself and says this is what I want to show to the people. There are methods in the film, which are used very skillfully. The best place to be filmed this production is Hawaii, else it would not have this feeling. To watch the film because the film itself is something that rather not had happened. Every minute was enjoyable to watch. And this is the background of some other disappointing movies in theaters, for which had higher expectations. I will not do an analysis of the movie, you know very well what you are doing and have done excellently. Thanks"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "richardasmus",
        "review_rating": "10",
        "review_title": "I love this movie.",
        "review_detailed_main": "It's just a fun movie. It pokes fun at billionaires, the military and the crazy aspect of love. Having lived in Hawaii for nine months, I love the sensitivity to the Hawaiian culture, at least from the non-billionaire set. And to add to it, a cute little love story with an ending that ridicules the many imbeciles who want to control the planet."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "h-kuhlman3",
        "review_rating": "8",
        "review_title": "Family film",
        "review_detailed_main": "I watched this film for the first today had no expectations , its is a feel good film , I really enjoyed myself , good cast good end."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cristinapetrar",
        "review_rating": "9",
        "review_title": "Loved it",
        "review_detailed_main": "I loved it. It has soul. Real magical moments of non verbal communication that speak more than any words ever could. It is a feel good kinda movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Dynames",
        "review_rating": "8",
        "review_title": "The Critics Got This One Wrong!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "avirariva",
        "review_rating": "10",
        "review_title": "I Want To Have Romance With All These Women.I wish they were lesbians.",
        "review_detailed_main": "Aloha is a Great Comedy and Romance with irresistible women and great acting.\n\nAloha movie tells the story of a shameful military defense contractor (Bradley Cooper) who is rehired by an old boss to supervise the launch of a weapons satellite in Hawaii. Upon his arrival he reconnects with an old love (Rachel McAdams) but finds himself becoming increasingly attracted to an Air Force pilot (Emma Stone) assigned to watch over him.\n\nIf you are looking for a perfect Romantic Comedy and if you love sexy women,see Aloha."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "seweso",
        "review_rating": "8",
        "review_title": "Low scores only from people with wrong expectations",
        "review_detailed_main": "I always wonder why people would rate a perfectly entertaining movie with such low scores. It truly boggles my mind. Maybe its the dramatic folk who need a bigger dose of drama. Maybe its people who believe that every movie has to be hyper realistic and can't suspend a little bit of disbelieve for the sheer enjoyment of a nice movie. And how do all these critics even decide that this movie takes place in our own universe anyway?\n\nI'm not going to overcompensate all the low scores and therefor give this movie a 10 myself. This is seriously an 8 in my book.\n\nMy advice: Always look at the breakdown of the IMDb score to determine if a movie is worth watching. Or look at the score of the most helpful review, so you are not swayed by all the crouches."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dundee246",
        "review_rating": "9",
        "review_title": "Very good movie!",
        "review_detailed_main": "I started watching without expectations and it turned out to be a gem! Funny, tender, bright!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "chrisriley-44693",
        "review_rating": "10",
        "review_title": "Aloha vs The Martian",
        "review_detailed_main": "Spoiler alert if you have not yet seen \"The Martian\" 2015.\n\nI recently watched both \"Aloha\" and \"The Martian\" and this morning had been checking the internet for a comparison on the two 2015 films and hoping to find some like minded reviews, unfortunately this was not the case. One of the highlights from my web search was finding many posts from fans of The Martian wondering if it was based on a true story. Wow. This film almost feels like a collective internet voted choose your own adventure gone wrong featuring Matt Damon playing a botanist/ astronaut (Wow) mixing his own fecal matter with Martian soil to grow potatoes in a greenhouse for what seemed like half an hour (riveting cinema) then ripping off the plot from the 1999 film Red Planet (worth a watch). This film as of right now has an IMDb rating of 8.1 WTF. Aloha on the other hand is currently rated at only 5.5.\n\nAloha boasts an all star cast including some very humorous cameo appearances with well written characters and story throughout. While there are definite leftist messages within this film, it plays as in- background to a multi-layered and complicated (human), warts and all story of love and moral dilemmas. In saying that the messages are still there and worthy of conversation in current times, touching on the treatment and perceptions of indigenous cultures, the \"potential\" freedoms available to billionaires within military and other government organisations and \"potential\" realities of military and mercenary occupation. Yeah I know, all that in one film. Please watch/ re-watch if you missed the point of this one and tell your friends, it deserves a better rating. It would be a great shame to see Writer, Director, Producer Cameron Crowe be discouraged from making films like this.\n\nAloha 10/10 from me at first watch, definitely worth a few re watches at a later date.\n\nThe Martian 4/10 because i like vegetable gardens, not because i like to watch Matt Damon wander around for two hours (I DON'T)."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "klaus-mueteam",
        "review_rating": "9",
        "review_title": "A nice surprise",
        "review_detailed_main": "For me, a welcome change in the commercial film monotony. A quiet, human and compassionate look at unique characters, which was beautifully worked out by wonderfully acting cheerful actors and a director who took his time and gave the actors space.\n\nLandscape, people, music and plot form a wonderful foundation for the story and the message; that is to be transported with the film. Not for the fast and loud audience, but that also makes the film something special.\n\nOf course, this is not the typical popcorn cinema and no superheroes are portrayed. But if you take the time, you will be pleasantly surprised."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jaceslade",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "This is a fun movie. You don't have to be a Crowe fan to like or understand this movie. You just have to sit and watch it. You will laugh, and maybe cry. It's predictable, but well acted. I laughed more when nothing was said. Expressions alone will move you, and Danny Mcbride is in it. He is usually responsible for most of the laughs, but not in this movie. Cooper is good, and his scenes feel real. Emma Stone is as good as ever with authenticity. Rachel McAdams is charming and her emotions show. Baldwin and of course the great Bill Murry create additional fun for an already enjoyable movie. 8 stars."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kevinavellaneda",
        "review_rating": "10",
        "review_title": "Will remind you of life :)",
        "review_detailed_main": "For those who are stressed out in life or those who are so used to seeing action/sci fi/horror films that doesn't have much meaning on them this is one is a good heartwarming and uplifting movie. You will totally enjoy it.\n\nNot a fan of being a \"movie critic\" where everything in a movie should be perfect from audio to video editing etc. For me all movies are pieces of artwork. We will like some and dislike others. But artworks are never created to be perfect but to convey meaning when you look at them.\n\nSoundtracks are cool, the casts were perfect for their roles. The story is not that complicated and is really inspiring. It isn't that much dramatic to make it the most life changing movie you'll ever see but that's not the goal of the film.\n\nThe film is about making you feel the story. Making you \"like\" life again despite all the stresses about work and etc.\n\nBefore I start watching this one, I'm all stressed out - you know one of those moods when you feel like everything is going the wrong way. But the movie will make you feel rejuvenated in life, inspired, happy and will remind you that life is simple - Be inspired and enjoy life. Don't take it too hard.\n\nThis movie is definitely one for keeps."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lorry-75189",
        "review_rating": "8",
        "review_title": "Loved it",
        "review_detailed_main": "Having lived in Hawaii for a long time, I loved this movie. There is a lot that is very realistic, including a Caucasian with an Asian last name. Happens a lot, Hawaii is the melting pot of the world.\n\nI loved the cast, and think it was better than Crowe's original picks. Alec Baldwin and Bill Murray are great as always. Emma Stone and John Krasinksi are a draw for me as well.\n\nAnd, love Crowe's writing and song picks, always good. I wish he was more prolific, there's too much time between his movies.\n\nWould like to see a director's cut, maybe longer with more details.\n\nAmazing that Crowe included the Night Marchers. And the contrast of hi-tech military vs. a nature based culture was great."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "MatthewJ0713",
        "review_rating": "9",
        "review_title": "Ignore the worthless critics and wannabe critics",
        "review_detailed_main": "Great Movie. I saw the trailer while watching something else and had to check it out. I like feel good movies. The critics will say you didn't use Chinese or Asian people but ya know what Asia...there aren't any good Asian actors for certain parts. Now a days you cant do anything without the internet trolls moaning and complaining. Movie was great. Story kept me and my Adult.A.D.D on point and normally i am off in my own world. The ending scene was moving and excellent work from the young girl. I'm a US Marine and i teared up. Good Job overall and i watched it twice!!! And to you dumb-dums that complain about race issues in this film or plot holes, i am glad i don't personally know you. To know how much you wrote and said it was a bad movie....why'd you stay and watch the whole thing. I'd hate to be your significant other cause that must be he/ll putting up with you and your complaining."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mtntexas-559-284308",
        "review_rating": "8",
        "review_title": "Recommendatio for IMDb to include music Summaries",
        "review_detailed_main": "I like this movie very much. Casting deserves an A++ as ALL characters were likable and believable. The Hawaiian scenery was beautiful and inviting. I would have bet the farm that no actress could steal the leading man from Rachel McAdams, but Emma Stone did exactly that. This is a great 'feel good' movie.\n\nMy criticism / recommendation is not about ALOHA, the movie, but is about IMDb, the 'site'. I've seen good movies that plummeted due to music AND I've seen mediocre movies that were GREAT due to the musical score. I'd like to see music / songs / conductor / writer / performer(s) listed on IMDb. Music is a very important part of every movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ciaratarpey",
        "review_rating": "9",
        "review_title": "An interesting foray away from the norm",
        "review_detailed_main": "To be honest I thought this would be another terrible manufactured rom com but it was a great surprise. It's funny has a great cast and what's good is it's just different. I can't properly verbalise but the way it's made is interesting and holds your attention more than a standard movie. Definitely worth the watch! There are plenty of little sub plots at play too."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kevinsuhr",
        "review_rating": "9",
        "review_title": "Start is much about nothing/ending absolutely beautiful",
        "review_detailed_main": "Was very surprised about all the negative reviews. This movie was very touching. Felt it was very deep on many levels. Had several family members watch it and they too were very moved by it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ricardomartins_thesecond",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "I don't understand the bad rating for this movie, at all! Great movie man. Wonderful cast, and the movie has greats moments and some powerful messages. Shaking my head at the 5 rating on IMDb. 10/10. All i can say after watching the movie, and speaking about the low ratings it gets is that the movie targets exactly the why of the low rating it has. People's lack of understanding, care and..well, love. I advise you to watch this. Just for sake of having to add the necessary 10 lines of text for the IMDb review - which i don't understand; when the world communicates at 140 characters at a time - again, i would watch the movie, if you haven't already."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "wellman-71564",
        "review_rating": "9",
        "review_title": "Loved It",
        "review_detailed_main": "I had no idea what this movie was about as I happened to click on it while scrolling through the channels. I absolutely loved this movie. Bradley cooper delivered another stellar performance. Emma Stone was captivating and believable to say the least. The story was completely original and having it set in Hawaii was a fantastic touch.\n\nReally can't say enough good things about the movie so many touching moments and lessons learned through life. I was quite blown away by the message that was delivered and the story will stick with me for a long time.\n\nI highly recommend watching it"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "r_h_price",
        "review_rating": "10",
        "review_title": "Fun, entertaining, ignore the bad reviews",
        "review_detailed_main": "I re-watched this a couple of times. a feel good movie. Why people have had a problem understanding it is a mystery."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lsnyder6",
        "review_rating": "8",
        "review_title": "Great to watch",
        "review_detailed_main": "So the plot was a bit lame. The actors were fantastic. I usually only half watch movies. But the interactions hooked me. I watched every expression. Cooper was brilliant. Stone mesmerized. But Danielle Rose Russell sealed the deal at the very end of the movie. Her bit part after the main plot had played out will be added to my short list of movie best scenes ever. Go Danielle!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sorensen10003",
        "review_rating": "8",
        "review_title": "Delightful, warts and all",
        "review_detailed_main": "I've now seen the film six times. Emma Stone steals the film with charm, humor, tenderness and vulnerability. Bradley Cooper is completely charming, with vulnerability and excellent comic timing. And has never looked better. Rachel McAdams, as always, is perfect. John Krasinski is delightful, showing signs of the star he'll soon become. Comic cameos by Murray and Baldwin and others are superb. Yes the big finish is unrealistic but it really isn't the point. It's a love song to Hawaii, and the four leads. Great soundtrack too. Best Christmas party ever."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "antdemoras",
        "review_rating": "8",
        "review_title": "There's a great 2 hour and 10 minute movie somewhere...",
        "review_detailed_main": "And it's been cut down to 90 minutes here.\n\nThis movie isn't nearly as bad as I had come to expect. The plot is indeed stupid. There's no way getting around that. And the third act straight-up derails, which is a shame, because there's a lot of great individual pieces in this messy puzzle.\n\nEach dialogue-driven scene is great, it's just that they don't really lead up to anything and because the plot is a mess. And because of this, it holds back these strong, natural scenes.\n\nOverall, great performances from pretty much everyone are pretty much undone because of the preposterous plot that it's all wrapped inside of. But even though it's all over the place, it's still a Cameron Crowe movie, and has all the best parts of what we've come to expect from him."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ruigodas",
        "review_rating": "9",
        "review_title": "Better than they said",
        "review_detailed_main": "It's a good movie about love and all you have to giveaway some times and move forward. It leave me some kind of need to a next page. I'll like to see the more. It's funny, some times Depp, not everyone understands that."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "monsbons-86841",
        "review_rating": "8",
        "review_title": "It is a lovely movie that made me fall in love with Hawaii",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "glenn-major",
        "review_rating": "8",
        "review_title": "Vacuous reviews here",
        "review_detailed_main": "Wonderful film. Wonderful script. Wondering how many of the negative reviewers have ever been to Hawaiian Islands and experienced their beauty, fun, adventure and spirituality? I'm guessing very few to none,going by inane reviews here. Suck it up morons!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ddidi-43513",
        "review_rating": "8",
        "review_title": "Enjoyable mess",
        "review_detailed_main": "I'm not gonna lie, the movie struggled a lot with the way they told the story. Most of the time it feels like a confusing mess, and it shouldn't be. But if you pay lots of attention you can get what's going on, and there is lots going on. It has moments that really shine. I would really recommend it, it's good enough, it kind of makes up for it's mistakes."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "oleswava",
        "review_rating": "10",
        "review_title": "What a gem",
        "review_detailed_main": "I loved that film. I rarely say that about films, but I loved this one. I guess you need a certain sensitivity in order to appreciate this wonderful gem and perhaps that's why it has been scored so low by so many people. Well, I loved it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "latinfineart",
        "review_rating": "8",
        "review_title": "Wonderful film. Excellent writing. An adult story",
        "review_detailed_main": "Not sure why so many are complaining about this film. I watched it, and was quite charmed by it. Watched it again, after recommending it to a few friends. Half of them got it, the other half complained. I found the writing to be bordering on magical. A bit surreal at times. It is becoming so hard to find a well written film, coming out of Hollywood these days, so it is refreshing when one finds something like this. The scenes with Bradley Cooper and Rachel McAdams (both were outstanding) were totally believable, and there was real chemistry there. His character was well conceived, and Alec Baldwin was funny. But, the top scenes in the film were with the Maestro Bill Murray. Oh my God. They must have been written with him in mind.\n\nThere were some plot contrivances that were a bit much. But, they are forgivable, when the rest of the film is this good.\n\nVirtually the entire scene in the bar for the Christmas party was pure magic. I will not give anything away here, but pay attention to the dialogue. It is gorgeous. That scene alone is worth watching this movie for. Many screenwriters and directors could take a cue from this film. It is very well put together, and a delightful film to watch."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Dar Star",
        "review_rating": "8",
        "review_title": "A DiamondHead in the Rough",
        "review_detailed_main": "I agree with a lot of reviewers who advise folks to ignore the bad reviews. This was a fine fine film. I'm not one who enjoys romantic movies at all, but this one struck the right balance with a good dose of humor. The cast is superb and the story is one that will be relatable to anyone who has had difficulty with a painful breakup. Highly recommended!!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mattkratz",
        "review_rating": "9",
        "review_title": ":-)",
        "review_detailed_main": "This is the type of movie that works-the good story clicks with an outstanding cast! A military hero with \"big dreams in the sky\" arrives home in Hawaii and gets involved in military stuff, the \"restless natives,\" and two loves of his life-one new (a military lady) and one old one from his distant past.\n\nThis works with good characters, a great cast (Bradley Cooper, Alec Baldwin, Rachel McAdams, Emma Stone, etc.), and plenty of other stuff. I enjoyed everything about it, and you will too. The gorgeous scenes in Hawaii work too, and the photography was amazing. That was one of the best parts. This was good for the whole family.\n\n*** out of ****"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "rsauto-10274",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "At at loss at the ratings??? Best movie I've seen in years!!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "tabuno",
        "review_rating": "9",
        "review_title": "A Superior, Quality Romance Comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "atlasmb",
        "review_rating": "8",
        "review_title": "A Poetic Gem",
        "review_detailed_main": "One reviewer said the main problem with this film is its tone, but tone is the one thing this film has in spades. \"Aloha\" uses plenty of understatement to deliver a thoughtful, poetic film that might remind some of \"Local Hero\".\n\nThe three leads--Bradley Cooper, Emma Stone and Rachel McAdams--are delightful. In fact, the entire cast is excellent.\n\nThe action does take place in Hawaii, but I don't want to say much about the plot, because it is full of surprises that should not be spoiled. I will say that it celebrates island culture."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "gibson-claudia",
        "review_rating": "8",
        "review_title": "Its charms far outweigh its flaws!",
        "review_detailed_main": "I had never even heard of Aloha - it apparently bombed and disappeared quickly in 2015 - but searching for a distracting film during this COVID period, I decided to give it a whirl. So glad I did, despite the poor official reviews.\n\nWhat makes this film worth watching, despite a too-busy plot and some choppy editing, are the performances of this wonderful cast. They wring every possible shred of touching humanity out of the script. I loved watching the evolution of Bradley Cooper's beyond-cynical, ex-soldier defense contractor, from embittered torch-bearing wounded shell, to a man reinvigorated by the possibility of real love with a quirky partner, Emma Stone, who is more than his equal. The chemistry and interactions between all the four main characters feels real and unforced. Yes, they are all ridiculously attractive, but the way each actor thoroughly inhabits their role, and commits to the characters' interactions is what made this film work for me. If Cameron Crowe had abandoned the over-the-top, way too ambitious sub-plot of the evil defense contractor worming his way into the space program (while Bill Murray is always an asset, both he and Alec Baldwin morph into cartoonish caricatures by the film's end, and feel like an intrusion), and focused more on the evolution of the main character's relationships, the film would have been a thorough winner. Lose the \"I'm 1/4 Hawaiian\" aspect of Emma Stone's character, which is needless and offensive, and focus more on Cooper's evolving redemption as a human, I would have told Crowe. But then again, he didn't ask me. ;-)\n\nI've never been a huge Bradley Cooper fan before, but I fell in love with him a little bit after this movie, due to his fine performance. And Emma Stone, Rachel McAdams and John Krasinski are right there with him, matching him step by step. I plan to watch Aloha again, and savor some very fine acting. Critics aren't always right."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "hasibsairuddin",
        "review_rating": "9",
        "review_title": "A nice light drama",
        "review_detailed_main": "People epxectation always kill.. Aloha is a good melodrama.. Its storyline is solid.. Yes. Look like jumbled.. But.. Thats the way it told.. Just relax and enjoy romcom.."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mub541",
        "review_rating": "9",
        "review_title": "Think different",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "wthartley-52548",
        "review_rating": "8",
        "review_title": "Sometimes it pays to be picky.",
        "review_detailed_main": "Some movies you watch from beginning to end, seeing each scene build on the previous ones, and end up with a very good movie.\n\n> This is not one of those movies.\n\n> This is a movie where it pays to be picky. Not every scene is ummm... good. But the good scenes to me more than make up for it. And we can fast forward through the less than stellar bits.\n\n> Watch the interplay of the three main characters. Pick out the good scenes and ignore the rest. The interplay between Bradley Cooper and Emma Stone works well. Rachel McAdams is always fun to warch.\n\n> There's enough frivolous silliness to ignore the flatfooted \"message scenes\". Which is a shame as they touch on subjects commonly ignored and not even thought about. A more serious movie, with much better writing and staging to explore the issues of a People within the People would be greatly appreciated.\n\n> All in all, if you need a relaxing, movie tempered with charm and seriously silly plot lines, this might work. You could do worse."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "kalatta",
        "review_rating": "10",
        "review_title": "Feel good, sans cheese",
        "review_detailed_main": "It's hard for me to watch a movie anymore. I can see the real humans behind the actors. Alaa has one of the very few exceptions I can watch this movie over and over, and every time it fresh and renewed.\n\nAll actors did their parts with ease, and Grace, from stars to passers-by. I think. Even the weather, the scenery perfect.\n\nI love the silent unspoken acting. I thought it did convey a lot of the motions as intended. The soundtrack was great. The music and songs selection completed the image and scenery.\n\nI hope Hollywood makes more thoughtful movies. I recommend it for any weekend or movie night.\n\nAloha!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lenalou-00905",
        "review_rating": "9",
        "review_title": "Lovely movie",
        "review_detailed_main": "I really liked this movie. It's quirky but has a lovely quality with good actors."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "petsalv",
        "review_rating": "8",
        "review_title": "Quirky, romantic, heartwarming",
        "review_detailed_main": "One of my all time favourite movies. The bad reviews are just from those who need everything spelled out for them like a Disney movie. Yes there are parts that might not make sense at first, yes you might need to watch it twice to understand, but I love that about it. It's like you've stepped into their lives and are figuring it all out along with them. The character development in this film is beautifully done. This is my comfort movie.\n\nLove the entire cast, Rachel McAdams is radiant as ever, obviously Bradley Cooper is incredibly endearing and Emma Stone's character is a little pocket rocket. Such a loveable cast. If you watched it once and are not sure how you feel, try watching it again!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "desertdog-02479",
        "review_rating": "8",
        "review_title": "Watch with original opening",
        "review_detailed_main": "I watched the 11 minutes original opening of Aloha which was cut from the movie. It covers much more of the backstory and character of Brian Gilchrest prior to his arrival in Hawaii. It just changes the overall movie and it makes a lot more sense - especially the first act. And I am a big fan of Cameron Crowe and appreciate the work he puts in on developing characters and looking at difference sections of our culture and society.\n\nGot a feeling the studio forced this cut as they wanted more a fluffy Hawaiian based rom-com with a love triangle. And that shouldn't be a surprise given the email leaks and the lack of confidence in the movie prior to its release. But such a shame. Hope one day we get a directors cut and get to see Crowes real vision."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "lschrom",
        "review_rating": "8",
        "review_title": "Entertaining film, interesting plot",
        "review_detailed_main": "I don't get the negative reviews, it seems reviewers are clutching at nonsensical critical things to say because they didn't like something about this movie - the notion of Hawaiian sovereignty? The role of the US military? The power of American oligarchs to ignore government treaties and weaponize space? The precious nature of water and sky? Yes, there are several story lines in this movie and that is what life is like. Emma Stone was not necessarily a poor choice in this role, her character's fair appearance is ostensibly explained by a Swedish mother and a half Chinese-Hawaiian father. I thoroughly enjoyed the movie and did not find the plot confusing or difficult to follow in any way."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "skitchp",
        "review_rating": "8",
        "review_title": "Quirky and Entertaining",
        "review_detailed_main": "I don't think this is as bad as some made it out to be. The movie is a bit quirky at times, but still displays good entertainment value with a truly outstanding cast. Good chemistry between Cooper, Stone, and McAdams along with some warm moments overall. The \"silent\" communication/dialogue between \"Woody\" and \"Brian\" is a hoot and Stone is great as the spirited \"Allison Ng.\" The lovely Rachel McAdams adds to any movie, and she's perfect in her role in this one. There are certainly multiple plots going on, and they don't all get in-depth development, but there's enough there to keep things at a nice pace. Oh yes, just the right amount of Alec Baldwin to stir things up a bit. Entertaining!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "sufstjames",
        "review_rating": "8",
        "review_title": "Doesn't hand it to you on a plate",
        "review_detailed_main": "I had pretty low expectations of this film considering the user reviews, but I was pleasantly surprised with how much I fell for this film. It's a beautiful little snapshot in time with a great cast and nuanced direction/acting. Nothing is handed to you or made too obvious, but it gently follows conventions of a romcom dramedy at the same time, making the little twists and turns pleasurable to tease out. There a multiple threads in this film that tie in nicely. The story centres around Gilchrist returning to the Hawaii base and the audience gets to see each character resolve their own issues as a result of his return. The film is as much about them as it is about him, which made this a dynamic, enjoyable film. Good Sunday afternoon watch."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "MickyG333",
        "review_rating": "9",
        "review_title": "Hopeless romantics beware",
        "review_detailed_main": "8.6 stars.\n\nWhy 8.6 stars? I've seen 'Aloha' four times, is that enough justification? I just am crazy about this movie. The dialogue is not overly clever, but it has extremely smart moments, especially those few silent moments, and how it's all about body language.\n\nIt's about Bradley Cooper's character and how everyone in the world loves this guy, he's \"the guy\", you know, that guy every girl loves and every guy wants to be (like the Big Lebowski kinda). He's sort of like...Bradley Cooper. He's portraying himself as a jack-of-all-trades Casanova, but he's human and fallible an he broke his legs really bad some years ago, so he has a perma-limp. All the more reason to love his character. He is Bill Murray 40 years ago in his hayday, pulling shenanigans and taking names.\n\nThis is one of my favorite romcom guilty pleasure films, because Bradley Cooper, he is gold. Emma Stone is gold, Rachel McAdams is gold, John Krasinski is gold, Danny McBride is gold, Alec Baldwin is gold, Bill Murray is gold. I cannot imagine a more perfect cast of all my favorite actors over the past 40 years, and how they could afford to pay this ensemble cast, nobody knows. But like any movie made up of a cast like this, it's going to be more about the plug and less about the substance.\n\nThe plot is only lacking because they aren't sure which direction to go...should they focus more on the love triangle, or the military aspects? Should we get more of the accolades and comradery between Cooper's character and everyone orbiting him, or should we focus more on Stone and McAdams? They chose the former to get more of the spotlight. I have to be honest, it's tough to make it a proportional experience for the audience. There is not quite enough of McAdams, yet she really shines and there is almost enough of Stone. Hard to figure it out, because the movie isn't short, it's long enough to tell the whole story.\n\nI really wish they made a sequel, you know, put them back together, she's flying jets, he's on another assignment, their relationship is on the rocks, he wins her back. The usual sequel material."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "vvanspengen",
        "review_rating": "9",
        "review_title": "Quirky and well acted",
        "review_detailed_main": "Wow. I loved this show. Quirky with lots of heart."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "babyjiang_us",
        "review_rating": "10",
        "review_title": "Best movie ever",
        "review_detailed_main": "I watched it many times. And I also comes to the same conclusion. This movie is one of the best ever."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mohamedahmedali44-727-99368",
        "review_rating": "8",
        "review_title": "People really got this movie wrong !!",
        "review_detailed_main": "I don't know why such a low rating here.. this movie was wonderful and made me feel a lot of feelings.. ignore all the hate and don't follow the rate and watch this wonderful movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "jsprankle-57688",
        "review_rating": "10",
        "review_title": "One Of my all-time favorites",
        "review_detailed_main": "I think this movie is absolutely stunning. I have to admit the first time I watched it, I did not feel this way, but now it is one of my absolute all-time favorites. The relationships are depicted so beautifully and in such a relatable way, that your heart physically burns and cringes along with them. They are just perfect. Complicated first love versus growing pains of an established marriage to a new relationship forming in a way that is so real and yet very rarely portrayed. So beautifully nuanced, but nuances are harder to see at first glance. Once you do, it is art. One of the scenes at the end with a young Danielle Rose Russell is absolutely breathtaking."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "amcopeland-77154",
        "review_rating": "10",
        "review_title": "Ignore everyone - where's the sequel?!",
        "review_detailed_main": "This movie is so good. Great cast, not a \"mess\" or \"all over the place\". There needs to be a second."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Chuckify",
        "review_rating": "8",
        "review_title": "if you don't think this movie makes sense",
        "review_detailed_main": "If you think this movie doesn't make sense, it's not because the director is dumb, or anything like that -- it's likely that you are simply dumb.\n\nIf you think this movie doesn't make sense, it's not because the director is dumb, or anything like that -- it's likely that you are simply dumb.\n\nIf you think this movie doesn't make sense, it's not because the director is dumb, or anything like that -- it's likely that you are simply dumb.\n\nIf you think this movie doesn't make sense, it's not because the director is dumb, or anything like that -- it's likely that you are simply dumb."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "monte_kui",
        "review_rating": "9",
        "review_title": "Better than anticipated",
        "review_detailed_main": "This film had a lot of depth of stories in family, relationships, culture, and history.\n\nIt's not just a simple romcom. There are several gems of stories that consecutively depict life...just like real life.\n\nTop cast with great locations that took us around the island, through the Mountains and into the stars.\n\nMy kids enjoyed the movie as well as my husband. It was comical and profound.\n\nIt was so much better than we had anticipated. Even had Bumpy Kànahele and his group. Loved that Kanikapila session. I know this is years later after the film came out but I just wanted people to know it is actually a greatly movie."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "socrates99",
        "review_rating": "8",
        "review_title": "This worked as my wife's fun movie pick",
        "review_detailed_main": "This is a nice amalgam of charming performances, that of Emma Stone and Rachel McAdams, particularly, and the mystique of Hawaii with a minimum plot that mostly serves as a flimsy but inoffensive excuse.\n\nBradley Cooper who is no slouch is the narrative center of the film with Stone, McAdams and even Bill Murray and Alec Baldwin revolving around his character's actions. Cooper and McAdams both pull out their usual impressive set of moves, but the real delight of the show is Emma Stone, who sparkles impossibly brightly.\n\nWhen Ms. Stone comes on screen you're immediately reminded of old movies where some perky leading lady momentarily steals the show. That was never a centerpiece in movie's heyday, but Ms Stone is so immediately lovable in this film, that she nearly overwhelms everyone else's performance. And that's worth the price of admission by itself."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "alexcole-27745",
        "review_rating": "8",
        "review_title": "Heart-warming. Made me cry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "mohdjad70",
        "review_rating": "9",
        "review_title": "A single word like underrated is not enough to describe this; its brilliant and thought provoking.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "duncan-87544",
        "review_rating": "8",
        "review_title": "Ignore the bad reviews",
        "review_detailed_main": "I really enjoyed this fresh take on the old romcom. The story was unexpected and I enjoyed the multiple layers and story lines"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cezarina_boghinciuc",
        "review_rating": "8",
        "review_title": "Lovely",
        "review_detailed_main": "I really enjoyed this movie. Clearly it is underrated."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "pw-51091",
        "review_rating": "8",
        "review_title": "Much Better Than the Reviews",
        "review_detailed_main": "Another movie that I happened upon while channel surfing. I quickly checked IMDB to check who was in the cast and Aloha has plenty of star power with plenty of A and B listers. Bradley Cooper, Emma Stone, Rachel McAdams, Bill Murray, Alec Baldwin and the list goes on. I believe that most people have a problem with the movie because they were expecting a romcom. While it's not the deepest album ever made, it does have a bunch of subplots and several of them are serious in nature. These subplots are not hard to decipher, but all of the characters give very good performances. I have seen Aloha two more times and I still very much enjoy it.\n\n7 to 8 stars, going with 8."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "danaelambros",
        "review_rating": "8",
        "review_title": "Review",
        "review_detailed_main": "Don't believe the ratings when it comes to this film. Sure, there are a few inconsistencies here and there regarding the story threads, especially in the first third of the film, but if you can get beyond that and let the story and characters truly unfold, this is a little gem of a film. The acting is really spot on, particularly with Cooper, McAdams, Krasinski, the over-eager but slightly insecure Emma Stone, and the super- talented teenage actress who plays Grace. In fact, the final moments of the film were beautifully acted and embodied the whole spirit of this film. The most powerful feelings often cannot be fully expressed in words; but the power of gestures and in particular the amazing eye contact and non-verbal acting talent in this film, are what truly makes it so satisfying to watch. If you want a heart-satisfying story that mirrors the the complexities of real life, and the emotional layers that are often expressed through the power of gestures (the beautiful Hawaiian dancing comes to mind), then Crowe has served up a truly satisfying feel-good film. I highly recommend it."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "dwpollar",
        "review_rating": "8",
        "review_title": "Complex, funny, emotional lost love story with an environmental twist plays well.",
        "review_detailed_main": "1st watched 6/6/2015 Complex, funny, emotional lost love story with an environmental twist plays well. Bradley Cooper plays a contractor getting a gig in Hawaii where he has many connections including an ex-love interest played by Rachel McAdams. He is assigned a tag-along in the project in an Air Force pilot played by Emma Stone(bringing along her usual charm). The project involves getting the blessing from local folk to build on some land for what will be a blossoming contract company for the military. The gig seems like a normal formed alliance with the Hawaiian people, but gets very complex when it's assumed the military has plans that will not make them happy(satellites in orbit with possible weapon deployment in the air). The romantic triangle is the centerpiece but there is so much more here done by writer/director Cameron Crowe in this carefully constructed tale. The storyline definetly doesn't sound like a blockbuster, but the talent involved here brings this piece up another level. A good job by all involved."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "aab874",
        "review_rating": "10",
        "review_title": "Captain Allison Ng (Emma Stone) and Tracy Woodside (Rachel McAdams)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "cathieannliles",
        "review_rating": "9",
        "review_title": "heart-touching movie",
        "review_detailed_main": "Sure i'm a 72 year old grandmother, & i have seen a bunch of movies in my lifetime. As a teenager my sister & i would stay up late at night on weekends & in the summertime & watch great romantic movies. We would sit right next to the tv so the sound wouldn't bother our parents. Now i can recognize duds & hits. This movie is a sleeper, one filled with intelligent dialogue & talented actors. It's a movie i can watch again & again & not grow tired of it. This movie has surprises with the actors & the plots. I'm a new fan of Bradley Cooper & his blue eyes. Taking place in gorgeous & lush Hawaii is perfect!!! I'll be recommending this to friends & to my sister!!!"
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "Funsunsea",
        "review_rating": "8",
        "review_title": "Just Brilliant",
        "review_detailed_main": "Emma Stone are Bradley Cooper shining in this quirky unexpected love story bound up in a triangle of great story telling simply written to uncomplicated an enjoyable saga. Brilliantly casted and excellently written, superbly directed."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "ajkbiotech",
        "review_rating": "10",
        "review_title": "Another Cameron Crowe Brilliancy",
        "review_detailed_main": "There only a few US states that were independent countries before they were appended to the USA;\n\n1) Hawaii - formed in 1795, annexed by USA in 1898. Independent Kingdom\n\n2) Deseret - the independent country of the Mormons from around 1850 until the peace with the USA in 1890 recognising Utah as a state.\n\n3) Texas - 1836-1848. Voted to join USA after Mexican American War.\n\n4) California Republic - existed briefly in 1846 but was subsumed by the USA.\n\nSo this film is really about Hawaii, and is full of cultural diversity and inclusion.\n\nWell-scripted and well-acted, it paces well and is very funny.\n\nThe film soundtrack is great!\n\nEveryone shines, Bradley Cooper, Rachel McAdams and Emma Stone."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "smartobsession",
        "review_rating": "10",
        "review_title": "Heartwarming unpredictable story",
        "review_detailed_main": "This movie is definitely not worth 10 stars but it most certainly is not worth the 5.4 either. I loved the story and the effect it had on my psyche. As an art form, the film is about stirring up an emotion, making you feel something and this movie achieved that, it had a way of telling the story that I haven't seen before. So critics can take their sticks and to further depths on this one.\n\nThe acting was believable and immersive, the music was really good. The whole production achieved its goal to take you on a journey, to live through these characters, to relate to them, to make you ask yourself certain questions and it all came together in a wholesome way."
    },
    {
        "movie_id": "tt1243974",
        "movie_name": "Aloha",
        "movie_rating": "5.4",
        "review_username": "rfarrellairman",
        "review_rating": "8",
        "review_title": "Underrated",
        "review_detailed_main": "Was kinda blown away, and remembered Crowe w\\Vanilla Sky and Almost Famous. This is not his best but much better than a \"5.4\". Have good personal connection to this so its an excellent portrayal of all the drama within the military, Agree with all the positive responses, the whole racism bit is non-sense and alot of this film is about outside the Military, Would recommend this because Crowe definitely captures some of the odd things in a military and a romantic life.... Rf."
    }
]