[
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "zeki-4",
        "review_rating": "4",
        "review_title": "So bad that I almost walked out of my own house!",
        "review_detailed_main": "The first one was fun and well played out. This sequel is a total misfire. Not because it follows the trend of having women being the alpha characters and portraying men as either weak or stupid, but simply because it's a lazy effort. Except a couple of scenes, and hilarious over-the-top acting by Pedro Pascal, I found nothing here. It has \"straight-to-DVD\" written all over it."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "4",
        "review_title": "Surprisingly poor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jesse-846-720503",
        "review_rating": "6",
        "review_title": "WTF did I just watch?",
        "review_detailed_main": "I saw the first Wonder Women and kind of enjoyed it, even though I didn't grow up knowing the WW canon. But it was a fun film that played with the fish-out-of-water aspect. But this - WW1984 - what in the hell was this? Again, I don't know that much Womder Woman history, but this seemed like a huge conglomeration of crazy story line, special effects, philosophical ramblings... it was a total mess.\n\nGal Gadot and Chris Pine are pleasant, appealing actors, and certainly pleasant to look at. And Kristin Wiig had a great role that I'm sure she had fun with. But overall, this was just a total mess of a movie. And Pedro Pascal...I can't figure out if he was great, or just did one of the most over the top performances in recent memory."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Sleepin_Dragon",
        "review_rating": "3",
        "review_title": "Ouch, that was so boring.",
        "review_detailed_main": "The first film is outstanding, it's exciting, it's fun, and apart from looking amazing, it has depth.\n\nThe problem here, it's so slow, and goes on forever and a day, did anything actually happen in the first ninety minutes? There was absolutely no action.\n\nChris Pine felt wrong here somehow, eye candy only, Gal Gadot, I thought she was pretty good, the shining light here, I just felt like she was battling against a miserable script. You could almost sense that she knew the script was no good.\n\nThe Villains were generally inept.\n\nI won't be watching again, 3/10."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "david-504-353150",
        "review_rating": "",
        "review_title": "Well well",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ThomDerd",
        "review_rating": "7",
        "review_title": "WW84 is a joke, but it's a fun one.",
        "review_detailed_main": "WW84 is entertaining, but unfortunately not as good as other DC films (or generally films of the superhero genre).\n\nStoryline: Set in 1984, Wonder Woman tries to save the world once again from an unlikely enemy while she still seems to be thinking about Chris Pine.\n\nRuntime stands at 2,5h which is too long but the pace of the film is good.\n\nCGI is good throughout the movie and most the action scenes are well made. There's a bunch of great outtakes as well.\n\nThe cast is interesting-Pedro Pascal's overacting is a highlight- and Gal Gadot is stunning once again. Kirsten Wiig is also a good addition to the film, but the development of her character could have been more in depth so we can see her transformation being more justified.\n\nOn the contrary, the character of Pedro Pascal is well developed and I was impressed by the tension that he adds in the entire film. I was happy to see him switching between drama and comedy and many points go to him for keeping the film's pace interesting.\n\nBut the film lacks a strong villain and the performance of Gal was a bit dry.\n\nOverall, it's a fun Sunday afternoon superhero flick which should have been 30 min shorter.\n\n6,9/10."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cascar73",
        "review_rating": "2",
        "review_title": "Whoever wrote this did not live through the Cold War or the 80s",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "landonsage55",
        "review_rating": "7",
        "review_title": "HONEST REVIEW",
        "review_detailed_main": "Don't listen to the people giving this film a 1 or a 2. At that point the film would be unmatchable.\n\nYou also shouldn't listen to those giving this a 10. It isn't perfect.\n\nFor me the movie is right around a 7. I enjoyed it a good amount but it wasn't spectacular or worthy of anything higher than that.\n\nHere are a few things people keep bringing up:\n\nCGI: People keep ragging the cgi. Overall, the cgi is NOT bad. The visuals in this film are actually very good. I will say there are a few moments where the cgi could have been done better, but I'm not going to nitpick and say the entire movie looks bad.\n\nScore: The score is great. It's Hans Zimmer. He does use someone else's score at a crucial moment in the film, but it has been used in many different movies and is fitting here.\n\nActing: The acting overall is very good and you're just hating if you say otherwise. You can argue that the story isn't the best, but I had no problem with the acting whatsoever. Gal kills it yet again as Wonder Woman as does Chris Pine as Steve. Pedro Pascal offers a great performance as the lead villain of the film. My favorite performance of the film was actually Kristen Wiig who I was worried about before since she's usually a comedic actor, but I was thoroughly impressed with her.\n\nPlot: The plot to me was the downfall of this film. It had visuals, acting, music, but the plot felt a little off to me. I was scratching my head at certain points of the movie, but overall it made sense and I had no problem with it. It's a fun superhero movie that you aren't meant to take super seriously."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cogatlin",
        "review_rating": "1",
        "review_title": "Horrendous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "teamdiana-80779",
        "review_rating": "6",
        "review_title": "Is this a \"Maxwell Lord\" movie?",
        "review_detailed_main": "The new supporting character get waaaaay too much screen time.\n\nIt doesn't seem like a WW movie to me. This movie should be called, \"Maxwell Lord\".\n\nAlso, why does Kristen's character, Cheetah, hate/resent Diana so much? Weird. Diana never did anything to her except be her friend.\n\nThis movie would've been better if Gal had more screen time. It's always annoying when a sequel focuses less on the original characters. That's one of many reasons why sequels are disappointing..."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "BA_Harrison",
        "review_rating": "3",
        "review_title": "Be careful what you wish for.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cleon1010",
        "review_rating": "8",
        "review_title": "Chill yall",
        "review_detailed_main": "Damn. Y'all really need to chill. The movie is still based on a comic, so let the cheesy be cheesy. Speaking of cheesy, everyone keeps talking about the cheesy ness in the beginning with the mall heist and what not. But my high a** saw it as \"oh cool! 80's movies were so like that\" cheesy! It felt intentional?? Also, I feel like It's telling you in the simplest terms, flat out what greed gets ya! No? Anywho. I enjoyed this movie thoroughly. Take a chill pill and stop digging too much and just enjoy a darn movie. #girlpower #happyholidays"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "feels long",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sduncan15",
        "review_rating": "2",
        "review_title": "Makes Justice League and Suicide Squad look Oscar worthy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jaimemedina-36288",
        "review_rating": "2",
        "review_title": "Utter disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Stevensson",
        "review_rating": "",
        "review_title": "Long and Boring .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "keithsreed-185-295755",
        "review_rating": "7",
        "review_title": "Oh it's Good... but definitely Not Great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "AlsExGal",
        "review_rating": "6",
        "review_title": "From a person who is not a comic book movie fan...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "steventonge",
        "review_rating": "1",
        "review_title": "Just read the other review. All true!",
        "review_detailed_main": "Why is Warner Brothers hell bent on destroying a potential gold mine, that is the DC franchise. I thought they had finally sorted it with WW and Aquaman. But no, normality resumes. This movie was terrible at everything. Story, dialogue, acting, cgi. Just sell the franchise to another studio and give us DC fans a break"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "JamesAlvarez520",
        "review_rating": "6",
        "review_title": "Sure, I enjoyed it.",
        "review_detailed_main": "Good flick. I'm a little biased because I love everyone who's in this. I thought Pedro Pascal was fantastic as Max Lord. The action scenes are few and far between, but when they happen, they're fun to watch. There are some weird story-telling decisions and the overall plot gets a little muddy (especially in the third act), but I there were more enjoyable aspects than negative ones."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "stevebarley",
        "review_rating": "1",
        "review_title": "From hero to zero in just two WW movies",
        "review_detailed_main": "The 1st WW film was absolutely brilliant and had more ticks than a farmer's dog in my book. WW84 is, which truly saddens and maddens me, the polar opposite. It has a script so weak it should be classed as highly vulnerable, a plot that has more holes than my kitchen colander, and characters about as believable as a career politician. I did love the opening island scene where the girl actress playing the young Diana was superb, and apparently did all her non-cgi stunts. But then it went downhill faster than an illiterate skier passing a 'Warning - cliff ahead' sign. I won't go into detail over WW84s failings as I have a bus to catch...in a week, but I think I can reveal my favourite, jaw-dropping line from the film without it being a spoiler...\n\n'... I want to be an apex predator!'\n\nIt certainly made me growl."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "iam_ahardrockers",
        "review_rating": "8",
        "review_title": "WW is on its own \"realm\"",
        "review_detailed_main": "WW is on its own \"realm\", a hopeful and positive and compassionate one. This sequel embodies that perfectly. The costume and hair/makeup department deserves credit for this one too, because the 80s era really lives on in this movie. Also Kristen Wiig and Pedro Pascal are surprisingly fit the role as Barbara Minerva/Cheetah and Max Lord respectively.\n\nThere were also some cheesy, eye-rolling moments in the movie but, during this trying times, I could take those and just suck it up and enjoy the blockbuster movie cinema experience.\n\nWatch it in the cinema if possible (of course with health protocols and regulations applied) and it'll remind you of the wonderful times when we are all gather in a cinema to watch Summer blockbuster offering."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "shoei907",
        "review_rating": "7",
        "review_title": "How can people give this 1 star? 6.5 seems fair.",
        "review_detailed_main": "People are bashing this and I enjoyed it. Yes, the plot was simple and cheesy. I thought the way the conflict was resolved was unimaginative. But I thought the acting was terrific. Wiig felt like two different people (like the script portrayed). Pasco, is he the best actor to come from GOT? It was kid friendly and sappy, not the dark DC from recent years but it's Wonder Woman, not the death of Superman. It could have been better but it felt like a fitting sequel. People today are so childish rating this with 1 star, this is at the very least an average film. TV quality is improving on a whole but Sharknado got 3.3 stars. This is far from a 1 star film and worth the time if you enjoyed the first film. Just maybe don't get your hopes too high. You may not enjoy it as much as I did. I gave 7 stars to try and offset the 1's but 6.5 seems pretty accurate."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "msskrads",
        "review_rating": "1",
        "review_title": "Sorry Patty, you tanked!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bigg_g",
        "review_rating": "4",
        "review_title": "Rubbish film.",
        "review_detailed_main": "Too long, too slow. Quite uninteresting. An absolute ton of plot holes. DC destroy another movie. Did Gal Gadot forget how to act? Don't waste your time."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "A Bland, Banal & Bloated Mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "chloecolvard-01519",
        "review_rating": "6",
        "review_title": "It has heart but not much else",
        "review_detailed_main": "I am overall saddened by WW84. The movie has a good but corny message that I feel could have been done better if wasn't so obvious. Gal gadot is a pleaser to watch as Wonder Woman and truly does in body the character. However either her, or Pedro Pascal charismatic villain 'Maxwell Lord'. The wonky VFX and the convoluted script does not help the movie especially bring into account WW84 has been sitting on the Warner bros. shelf for around a year. Hopefully the third WW movie Patty and her crew will get their grove back and wrap things up!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jothamleeyishu",
        "review_rating": "1",
        "review_title": "Oh when will this end....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rafahd-59304",
        "review_rating": "7",
        "review_title": "A refreshing movie to watch after a year of pandemic.",
        "review_detailed_main": "It's a nice movie with a nice message for the world in general and it's hard to see movies coming with one, especially superhero flicks. Kids got a better movie than adults tbh, it could've been done better as it had a lot of potential. The score, the action sequences and the visuals everything was perfect except it lacks the charm of the first movie. Pedro Pascal as Maxwell Lord is the highlight here he just nailed it, he's probably the best DCEU villain imo. Gal, Chris and Christen did their best, nothing to complain about their performances. I liked the dialogues and monologues they were well written and the relationship between the characters were quite good, they have a certain depth. Overall the movie failed to reach the standards of the first film but as sequels go this is not so bad."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "matid-80892",
        "review_rating": "2",
        "review_title": "unacceptable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "dwarol",
        "review_rating": "6",
        "review_title": "Epic fail due to poor writing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "phd_travel",
        "review_rating": "3",
        "review_title": "What a wasted opportunity",
        "review_detailed_main": "This movie has some really bad points. It isn't the worst action hero movie ever. It's 80% bad with some redeeming qualities here and there. Firstly the bad points: 1. The story. This silly \"wish\" premise is weak and wears thin very fast. Be careful for what you wish for. Even a 1984 movie wouldn't have such a simplistic premise. It gets too overblown at the end. The writers really did a bad job. It's beyond low mentality and cliched. And things really fizzle out at the climax. 2. Long winded scenes. Many scenes could have been cut in half to keep the momentum going. From the overlong competition in the beginning, almost every scene could have been trimmed by a quarter. The good points: 1. Gal Gadot is watchable and likeable - she could read the phone book and it would be watchable. 2. Pedro Pascal of Narcos is the villain here and he looks quite different - good that he has a big movie role. 3. Kristen Wiig has a remarkable transformation and her character is quite interesting. 4. Watch out for Lynda Carter. The cast is good but they can't save a bad story. Chris Pine looks a bit haggard. 5. The production values are fine - it is a big budget movie. And the cinematography is good.\n\nThey had better think carefully about who they get to make Part 3."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "craigcoleshaw",
        "review_rating": "8",
        "review_title": "Doesn't deserve such a bad score",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "WhySoSerious_JT",
        "review_rating": "7",
        "review_title": "That's just a trash can",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "martyk007-653-916385",
        "review_rating": "1",
        "review_title": "Not what I expected",
        "review_detailed_main": "Very long winded and quite soppy, I found myself getting quite bored. I m not really sure what this movie is trying to be, a drama love story maybe with a few action scenes. Disappointed."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rickgartshore",
        "review_rating": "3",
        "review_title": "Patty Jenkins Sets Women Back w/ This Rubbish",
        "review_detailed_main": "The first WW movie was amazing! It clearly demonstrated that a woman super hero can be strong, smart, funny and, most of all, can easily hold her own with her male counterparts. It was a monumental step forward for super hero movies and women in general and I couldn't wait for the sequel. It was very disappointing to see the direction Mrs. Jenkins took this character. The WW in this movie represents and displays all of the stereotypical cliches so many serious actresses have worked for years to dispel. In the first WW she was a badass who fought with passion against evil and stood up for her convictions. In WW84, when she's not pining for her lost love (because we all know a woman is lost without her man, right?) she's winking at little kids while she fights campy bad guys who are literally tripping over themselves to get caught. The female supporting cast isn't much better. Kristen Wiig is the embodiment of the frazzled, clingy stereotype that went out of style in most movies years ago. The only 2 strong women (Connie Nielsen amd Robin Wright) are gone after the first 10 minutes and we are left with weak, campy garbage. The WW in the first film was Christian Bale's Batman. In WW84 we get the Adam West Batman. Such a disappointment."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Doesn't have the powerful touch as before",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "laceup-96849",
        "review_rating": "7",
        "review_title": "Not your typical superhero movie",
        "review_detailed_main": "If you expect it to be like the last move you would be wrong but this is still a good part 2, its more about good over bad, good message very emotional especially during this pandemic, so I think everyone should watch it but keep your expectations to be something different"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "johnmcc-78031",
        "review_rating": "2",
        "review_title": "Probably the worst action scenes I've ever seen",
        "review_detailed_main": "Pure cheese. It was like a bad Asian action movie. Acting was also just... poor. Gal godot is a stunner... But acting? Are her eyebrows fixed in one place this entire movie?? One emotion.. Confused... Pedro Pascal is the only saving grace in this movie, with an awesome performance. Poor script writing seems to be a regular occurance with big budget movies. Kristen does a great when she turns evil. However her initial character and dialogue was so badly written... We get that she is a nerd.. Do we need 50 obvious scenes to exentuate it beyond all sanity!?? The flying scene also becomes ridiculous.. Especially hooking onto planes and lightening??? Its just painful 😂"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "chrisw-17947",
        "review_rating": "6",
        "review_title": "Okay but a bit underwhelming",
        "review_detailed_main": "I loved the first Wonder Woman and was anticipating for the sequel to be great as well since it was also directed by Patty Jenkins. Unfortunately this was just okay. Gal Gadot delivers the energy that Wonder Woman has very well which is why she is perfect for the role. The visuals in this movie are nice. But the action scenes were the best parts of the movie, which leads into my flaws. There are hardly any action scenes in the movie. The first 17 mins are action-packed and then leads to slow and unnecessary exposition over an artifact that grants wishes. Pedro Pascal was okay but I thought his villainous role was a huge miscast. I found him annoying and comical. Kristen Wiig's role as Cheetah was okay as well but I found her character to be a trope as a DC villain (nerd turned into villain). Also an hour and a half later it's just more lazy storytelling with great visuals and well shot and choreographed fight scenes. I also never bought the 80's vibe that it brought because it didn't feel like an 80's movie, it was just telling us that it's set in 1984 because of the fashion, technology, and cars. There are rarely any references to the 80's other than those 3 categories. I didn't hate WW84 but the writing could have been much better. 6/10; C+"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bash7200",
        "review_rating": "1",
        "review_title": "Terrible!",
        "review_detailed_main": "Really, really bad. Dumb plot executed over an excruciatingly long and boring 2.5 hours. Acting was fine but story, flow, and execution was really terrible. Worst superhero movie I have seen in a long time."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Thekeybaldemasterrises",
        "review_rating": "7",
        "review_title": "This was unapologetically goofy and I loved it",
        "review_detailed_main": "WW 84 is so goofy, nonsensical, and I had a blast with it. Patty Jenkins has essentially gone back to the Richard Donner era of cape flicks like Superman. It wears its heart on its sleeve and embraces the cheese of its romance, its plot, and just all of its comic book antics that we don't really see anymore. Whatever you think of the old school comic book films is what I think will either make it or break it for you. You gotta just embrace the tone and run with it, otherwise, this is probably not worth checking out. Everyone seems pretty turned off by it, but I thought it was just good silly fun like the old days!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "the_real_smile",
        "review_rating": "4",
        "review_title": "Actionhero movie with almost no action",
        "review_detailed_main": "Writer, producer and director Patty Jenkins really did a give this movie a feminine/soap opera touch and by doing so destroyed everything that this movie could have been. The first WW movie was not that great, but Patty did not write that one, this sequel she did and it is worthless. I was wondering if I was watching a drama or a action hero franchise. First the movie is far to long, the dialogue's are pointless and boring, you can skip with ease them because the story is not that complicated. For the action, the effects are good, not worth the time to watch, but still well made, but there are not very much action scenes. If you look at the demographic of the votes you can see girls <18 years are the only ones who love this movie, and that should have been the warning that should have been given with this movie: only see this movie if you are a teenage girl."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "tboneb-01547",
        "review_rating": "8",
        "review_title": "There are a lot of people who decided their opinion of the movie long before it started...",
        "review_detailed_main": "To start, this is a good movie.\n\nPros\n\nthe comedy worked, mostly Chris Pine discovering the \"new\" world\nexcellent score from Hans Zimmer\nGal Gadot embodies Wonder Woman, as always\nmuch better villain character development than the first film\ninteresting themes of the dangers of instant gratification and greed\ndoes well displaying the global fears of the time and how close the world was to utter chaos\n\n\nCons\n\n\n\nThis movie doesn't have a bad script, like many are saying. The CGI is good. Many are determined to dislike it because it is a DC film and/or Geoff Johns wrote it (whom I normally despise).\n\nIf you see it in theaters or on HBO Max, do not expect it to be a replica of the first film, it is not. Go in and enjoy the film for what it is! A beautifully scored, well acted film that sometimes exaggerates but mostly embodies the global fears of the time."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "baddboy77489",
        "review_rating": "7",
        "review_title": "Not as bad as these reviews make it to be",
        "review_detailed_main": "These reviews are harsh my goodness yes it does have plot holes but I wouldn't say it was terrible. The movie isn't good as the first one, but that's a hard movie to stand up to. This was an enjoyable movie overall 👍🏾"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Eggoreluckadman",
        "review_rating": "6",
        "review_title": "\"This movie was good but it can be better\"",
        "review_detailed_main": "Wonder Woman 1984 is the film definition of a mixed bag. On the one hand you have the return of the great chemistry between Gal Gadot and Chris Pine, a very entertaining villainous portrayal from Pedro Pascal, and a enthralling score from Hans Zimmer. However, there is also weak direction from Patty Jenkins, an unfortunate miscast with Kristin Wigg and overall just mediocre action, writing and pacing. The first Wonder Woman film achieved everything mentioned before in a better manner but has a weak villian portrayal. This film is the opposite."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "mjpoehler",
        "review_rating": "2",
        "review_title": "Vastly Disappointing",
        "review_detailed_main": "The first movie was great.\n\nI wonder why Gadot agreed to do this one. I really wonder why with all the good things DC have been doing recently, they chose to do this to the franchise.\n\nThe film had a very few moments of grace, but then just let them all go. If you're keen to watch it, wait for one of the streaming services to pick it up."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jultep",
        "review_rating": "7",
        "review_title": "Solid 7. No more. No less.",
        "review_detailed_main": "I found it too preachy towards the end. There were some good action scenes and story was fine. Not great but not as bad as some are saying it is, in my opinion."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "marcusclestrade",
        "review_rating": "1",
        "review_title": "One of the worst superhero movies I have ever watched.",
        "review_detailed_main": "I can't believe this movie was released, its like they don't care about making a good movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "6",
        "review_title": "Frustratingly inconsistent.",
        "review_detailed_main": "'Wonder Woman 1984 (2020)' suffers from similar issues as its predecessor. It doesn't make a good first impression, as its opening is honestly pretty rough. Though its initial action scene has a few enjoyable moments, the first sequence that properly showcases the eponymous hero is really unconvincing and is possibly the worst one in the entire affair. Thankfully, then, the second act is considerably better than the first. Once again, a decent chunk of the film is solidly entertaining. It's a little slow (people who prefer to see Diana in her costume might be a bit disappointed), but it's perfectly fine and features quite a few compelling scenes. Perhaps surprisingly, its best elements are its characters and theme. Though it's often heavy-handed, the flick does a good job of exploring its interesting central concept, which is actually rather resonant and gives its characters something to struggle with internally. Pedro Pascal and Kristen Wiig are probably the movie's best aspects; their characters are distinct, unexpected and surprisingly believable. Pascal, especially, is a delight to watch as a charming but greedy businessman whose initially calm exterior slowly breaks down over the course of the story. Unlike its predecessor, the movie manages to successfully - and, I'll add, satisfyingly - see its theme through to its logical conclusion. Unfortunately, the film's quality drops significantly as it moves into its final act. After a fairly forced heel turn, the affair struggles to balance its human (though still overblown) stakes with its superhero action. It feels as though the final, CGI-fuelled fight is only included out of a pressure to confirm to the genre. The finale's actual conclusion brings things back down to a more relatable level, but by then most of the damage is done. Still, it's not a terrible sequence and its conclusion is actually shockingly effective. What isn't shockingly effective is the picture's denouement. This tacked-on ending (clearly a reshoot added due to the piece's pushed-back December release) is genuinely terrible, a Hallmark-esque moment that straight-up seems like a life-affirming commercial for, like, a beer or something. It's so bad that it almost sours the entire feature; you really have to remind yourself that this scene doesn't represent the quality of the overall thing. I mean, there are a few sequences that look, sound and, even, feel 'made for TV' (and one that annoyingly uses John Murphy's theme from 'Sunshine (2007)'), but nothing comes close to the cringe of the last pre-credits scene. So, overall, the film is a mixed bag. It does some things better than its predecessor, such as maintain a consistent theme and provide compelling villains, but it also does some things much worse and, even at its best, generally isn't as entertaining. However, it's not a bad picture, by any means. Frankly, some of the heavy criticism levelled towards is a bit excessive. 6/10."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "NarniaIsAwesome",
        "review_rating": "5",
        "review_title": "Wonder Woman 1984 is... A Wasted Concept.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "diescobarmdq",
        "review_rating": "8",
        "review_title": "Great xmas present!",
        "review_detailed_main": "I absolutely enjoyed it! Loved Pedro Pascal and Kirsten Wigg, they were great supporting actors. The young Diana flashback was my favorite part, \"I wish\" to see more of that 😉 And that cameo! It was awesome!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "liajames",
        "review_rating": "7",
        "review_title": "I suspect critics were paid, but I still liked it - would watch again.",
        "review_detailed_main": "The script is solid, albeit without a particularly strong or enthralling villain. Chris Pine is great, as is Gal Gadot. Kristen Wig gives a great performance, despite claims to the contrary. Some of the CGI is wonderful, some of it looks like it's from 10 years ago for some reason (?) The lasso looks completely different. In a Summer blockbuster, it's blisteringly hard to redeem a villain without a huge bowl of sticky syrup, and this film proves that once more. Still, I think that's the direction they were going in; bright, hopeful and upbeat.\n\nObviously the film was built around the necessity of getting Chris Pine's character into the film, and it shows. Personally, I would have taken a different approach. The wishing stone was a good idea, but I would have suggested changing 40% of the script.\n\nStill, it's very entertaining - even wonderful in parts, and I would definitely watch this again. Patty Jenkins is heading toward a fantastic career, one I aspire to.\n\nVery minor spoiler follows-\n\nIt's a fun film, but it's frustrating to watch Wonder Woman 'lassoed' so to speak, as she gradually loses her powers to the wishing stone. We watch Wonder Woman to see her kick ass, not take bullets - we want to see her dodge them with lightning fast reflexes and flip cars with her bare hands.\n\nStill, you can't really go wrong if you liked the first one, though it doesn't approach the brilliance of the original film."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Snootz",
        "review_rating": "5",
        "review_title": "Believe the negative reviews",
        "review_detailed_main": "Wonder Woman is not wonderful.\n\nThis wasn't the horrible movie some reviewers make it out to be. 1 & 2 stars is a bit exaggerated-- I save such ratings for worst of the worst. At the worst this is simply a disappointing, poorly-written, badly-directed comic-book movie (emphasis on comic book writing... and there have been better comic books).\n\nStill, believe the negativity. This movie has so very many flaws. I'll sum the entire movie up in one scene: roping a lightning bolt and swinging from it.\n\nSeriously?\n\nWW'84 made me feel like I was watching the 1970s Wonder Woman with all its ridiculous camp. With almost 2000 reviews here I don't need to spend a lot of time writing this one. A bunch of people are going to see this movie. Some are going to love it because well... that's some people. Some people will like it because of Gadot or Pine. A whole lot more are gonna be justifiably disappointed.\n\nThere are worse movies out there. Wonder Woman is bad, but remember Batman and Robin? Electra? Catwoman? Some movie writers and directors need a lot more talent."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ldebremaeker",
        "review_rating": "1",
        "review_title": "If you want to punish someone, you should put this movie on for them",
        "review_detailed_main": "I dont know how its possible to make such a bad movie.\n\nThe quality of the scenes is really terrible. I really have no words for this movie.\n\nIts a punishment to watch.\n\nIf i could give less then 1 star, i would do it."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "CL09",
        "review_rating": "",
        "review_title": "I came here for the reviews 😂",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Linus_N",
        "review_rating": "6",
        "review_title": "Wonder Woman VS Cats & The Wishmaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "gpcheng87",
        "review_rating": "4",
        "review_title": "Absolute Chaos.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jericha-27402",
        "review_rating": "7",
        "review_title": "Ignore the harsh reviews",
        "review_detailed_main": "Sure, it isn't as dynamic as the first movie. It's a sequel. The actress who played Cheetah was fine. The writing could've been better. People need to stop confusing bad writing with bad acting:\n\nThe film felt rushed, but there are some emotional moments in this movie. Overall, the saving grace of this film was THEE Lord Maxwell. That actor is so talented! Without giving out too much, the film has a very good message and speaks about the materialistic 80s."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jayg_58",
        "review_rating": "5",
        "review_title": "In quarantine, you'll buy anything.",
        "review_detailed_main": "Very colorful, lots of money spent. Kristin Wiig was a masterpiece of miscasting. She wasn't funny; she wasn't scary, but great costume. The whole plot was a vehicle to resurrect Chris Pine, but there was no real chemistry between them. It made the lines of endearment quite awkward and the embraces seemed forced. All the usual tropes: WW loses some of her powers, so there can be suspense; she plays Spiderman and holds two vehicles apart. Just nothing new and Gad Gadot proves again that she's a glamour model and poses well. She can't act. Still - entertainment in a vacuum of good movies, so watch it and be distracted for TWO AND A HALF hours."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "dinoyoshiuk",
        "review_rating": "7",
        "review_title": "Not as good as Wonder Woman but is still worth a watch albeit slightly slow paced with an anti climax ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "CapitalP",
        "review_rating": "8",
        "review_title": "The Human Factor",
        "review_detailed_main": "What I liked about both Wonder Woman movies is the heart that it has in telling the stories. I really got emotional watching this. Sure the action was great but what was even better was the message in this film.\n\nI don't know too much about the character of Wonder Woman in the comics but I've always heard about her having a love for mankind. It really shows it in these movies and the hearfelt stories is what made this a good movie for me. I wasn't the biggest fan of the Cheetah character but that still did not stop me from enjoying the story."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "adamwoodford-60860",
        "review_rating": "7",
        "review_title": "Great, but not better than Wonderwoman 1",
        "review_detailed_main": "I went in with the (harsh) expectations that this movie was to live up to or even supercede the first installment. It doesn't. But it was still an enjoyable and great movie. There was great action, and even a Christopher Reeves Superman feel to it at some points which was nice, but I didn't get the same type of goosebumps (I still got goosebumps in a few scenes) like I did when Diana entering No Man's Land, or fighting Ludendorrf and Ares in the first movie. But this is coming from a guy who thoroughly enjoyed the extra 30 minute smash fest of Superman vs Zod in Man of Steel."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "siderite",
        "review_rating": "5",
        "review_title": "Another mediocre film made by someone who doesn't get comic books",
        "review_detailed_main": "I am no expert in comic books myself, but what I expect from a comic book movie is to be striking, visual, stereotypical and above all, consistent with its past and its planned future. WW84 was neither of these! It wasn't awful for a random movie made by students, but it was really bad for a film made by a major studio and starring talented people and having so much material to draw inspiration from.\n\nFirst of all, Gal Gadot had a supporting role in this film. She may save the day at the end (well, sort of), but the main character of the story was Max, the villain. Then every other supporting cast member had a development arc, while Gadot had about half of one if I am being generous. Second, the story pushed in the invisible jet and that Wonder Woman can fly (!?) in a clunky and hard to stomach way. You almost saw the outline of the executive shouting \"she needs to fly in the next movie!!!\". And third I am wondering if this film was misandric or not. Men were consistently portrayed as weak, abusive, violent, lacking impulse control and heartless. If it weren't for three male characters whose only quality was they were not evil - and that includes Steve Trevor and the random guy he inhabited, I would have seriously felt under attack the entire film.\n\nThe result was something that felt like a draft story for a writer class, with bad CGI, improbable deus ex solutions to problems that were hard to swallow in the first place, underwhelming characters, poor action scenes, pointless Trevor appearance, unnecessarily physical solutions to problems that could have been tackled by simply talking to a person on a phone or something and so on. And the ending was about how nice the holiday season is after a catastrophe that affected every person on the planet and almost destroyed the world!\n\nSo no. No! I am not taking it anymore. I am tired of movies that are not made for children but assume I am one, and a dumb one to boot. I want good stories, I want compelling characters, I want people who do their damn jobs!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "frankwittke-15794",
        "review_rating": "1",
        "review_title": "This is the worst movie I watched this year!",
        "review_detailed_main": "In fact if I would have watched this movie on January 1st, 2021 it would have been the worst movie in 2021. It is right up there next to Cats."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "DaveG121",
        "review_rating": "",
        "review_title": "Desperate...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "unholyprophet",
        "review_rating": "6",
        "review_title": "I have seen worse, tries to hit audiences with nostalgia and campiness.",
        "review_detailed_main": "A movie that tries to embody the campiness and nostalgia from the old Wonder Woman TV series. Sometimes it succeeds. In other moments, it is a complete failure. The most unnerving moments with this movie are related to the Wonder Woman's super powers, what they are, their limits, and their balance. They feel underpowered just to move the story forward but overpowered at the story's climax scenes. She seems to have a few new super powers that are not explained at all (at least in the movie).\n\nStory-wise, there are moments that could be plot holes or just the result of hasty editions pursuing a light \"Marvel-like\" feeling. The story is a simple one that goes well with the campy felling that they were looking for. Unfortunately, during several scenes, Gal Gadot feels emotionally disconnected from the script. Pedro Pascal seems more engaged and hits his marks but, again, the story is not this movie's forte.\n\nOverall, I have seen worse."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "arabnikita",
        "review_rating": "7",
        "review_title": "Satisfies the superhero craving",
        "review_detailed_main": "When was the last time you saw a proper standalone superhero film? Yeah, I couldn't remember either and as I watched Diana swing from one lightning to another, I experienced that long forgotten feeling of heroic joy. While it certainly didn't live up to the ridiculous hype, it was still a grand spectacle that satisfied my craving for a cinematic experience.\n\nTo my surprise, the narrative of the film was a lot bigger than was shown in the trailer and I mean a lot! Due to her actions, Diana ended up paying quite a hefty price as she battled two intriguing and non generic villains while the events of the film escalated to levels that are uncommon for most superhero movies. With that being said, WW84 did try to poorly juggle too many subplots and as a result couldn't tie them up in a nice way without leaving a multitude of in-your-face plot holes.\n\nI admired that instead of trying to justify the plot elements with pseudo sciene or the word \"quantum\", the movie just admitted that it was magic. Sadly the narrative itself lacked the \"magic\" of the original as it failed to conjure up a single emotional moment, not counting the stunning prologue. Gal Gadot was naturally electrifying but her performance felt timid, as if she was sacred of being a powerful heroine that we loved in Part 1.\n\nAs the film swings between magnificence and disappointment, it satisfies the cinematic superhero craving thanks to the impressive visuals and Hans Zimmer's soundtrack but it fails to create the exhilarating experience due to a flawed narrative and a lack of an emotional touch. If I watched it at home, it would have been a 6/10 so cinema is recommended.\n\nMovies.shmovies on Instagram"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "CC38",
        "review_rating": "1",
        "review_title": "Last review was deleted!!!",
        "review_detailed_main": "I saw my review posted with full text and now it is gone, not even readable from my account. They are purging negative reviews. Do not buy this terrible movie!! It is not worth 2.5 hrs of your time.\n\nThe writing and plot are the worst of any DC movie so far and that is saying something. Unfortunately, the stylized action and good CGI that helped make the previous installments rise above the writing is not present here. The CGI is bad and there isn't much action. I think Wonder Woman felt less strong as a person in this movie than the last one. The villain was lame, and the armor she wears in the promotional material was pointless."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "msbreviews",
        "review_rating": "8",
        "review_title": "WONDER WOMAN 1984: I couldn't ask for a better film to watch at an IMAX theater for the last time this year...",
        "review_detailed_main": "If you enjoy reading my Spoiler-Free reviews, please follow my blog :)\n\nThe superhero genre has been growing exponentially during the last decade, so it's bizarre to go through an entire year with only Birds of Prey and The New Mutants instead of literally dozens of films from both Marvel and DC. Thankfully, Warner Bros. decided to release Wonder Woman 1984 before the year's end, but not without a catch. Most people will only have the possibility of watching one of the few blockbusters of 2020 through HBO Max, a streaming service only available in a couple of countries, while some incredibly lucky moviegoers might have the chance of seeing this visually epic film in theaters, depending on the country's pandemic rules.\n\nFortunately, I'm one of those lucky people who got the opportunity to end 2020 on a positively immersive note by watching Patty Jenkins' latest flick in an almost empty IMAX theater (paradise). If you've been following me for some time, you know I'm a firm believer and defender of the so-called \"theater experience\", and I can't hide the fact that I felt extremely emotional going into one of the best, biggest theaters in Portugal to witness one of my Most Anticipated Movies of 2020. Until 2017, DCEU struggled to deliver a massively loved installment, and Wonder Woman came to the rescue. It was one of my favorite films of the respective year, so I was obviously excited for its sequel, even more having in mind the circumstances we're all living in.\n\nIn my opinion, this sequel stands close to its predecessor. With a lengthy runtime known for being associated with absolutely epic movies, I was confident that WW84 could deliver a solid film with great villains for a change. Well, Kristen Wigg and Pedro Pascal are definitely two of the indisputable standouts. Patty Jenkins, Geoff Johns, and David Callaham made the right decision in dedicating a significant portion of the screenplay to Barbara Minerva and Max Lord. Their arcs are far from being groundbreaking, but they're a thousand times more effective than the \"CG punch bag\" narrative.\n\nBarbara follows the \"lonely, insignificant, no one cares about me\" archetype, and Wiig does a surprisingly remarkable job in portraying this character, but the script is what really makes her shine. At first, her comedic mannerisms left me a bit dubious about the eventual character's likeness. However, as time flies by, it's almost inevitable to feel sorry for Barbara, making her future motivations understandable and perfectly natural. On the other hand, Max Lord is apparently exploding with conviction, but his life is not as amazing as everyone might think. This time, it's Pedro Pascal who ends up elevating the character, delivering a brilliant performance with just the right amount of over-the-top expressions.\n\nEven though these two are magnificent, Gal Gadot continues to prove that she's one of the best casting choices of the millennium, interpreting Diana Prince aka Wonder Woman. I seriously cannot imagine another actress wearing that costume, throwing that Lasso of Truth, incorporating the character's essence as seamless as Gadot. In this movie, she was able to perform highly emotional scenes, nailing every single one. Her chemistry with Chris Pine (Steve Trevor) is palpable on the other side of the world, and their interactions go through every zone of the emotion spectrum. Regarding Steve, I'm not going to spoil how he comes back or anything concerning his arc, but I can safely write that his presence in the film is both necessary and logical.\n\nThe biggest compliment I'll offer this sequel concerns its screenplay and direction. Finally, I can confidently write that the DCEU is capable of producing a well-structured, well-developed story with well-written characters. It doesn't have as much action as the original, but I still didn't feel the 151 minutes. WW84 flows incredibly well due to Jenkins' ability to fill up the runtime (almost) only with important scenes. There's a slight \"over-persistence\" in the attempt at sending a certain message (I'll get there), but story-wise, I sincerely wouldn't take a second out. Even the comic relief moments, particularly with Pine (who plays some sort of parallelism with the first movie's Diana), are welcome and timely.\n\nThe action scenes might be low on quantity, but the few that the audience gets are long, complex, and technically challenging to pull off. The opening sequence alone almost made me tear up due to its epicness. Hans Zimmer's powerful score, Richard Pearson's clean editing, and Matthew Jensen's camera work all work together to present a lengthy, grand, wide view of an Olympics-style obstacle course with young Diana. Throughout the entire film, the action is colorful, vibrant, fun, and entertaining... except for the (supposedly) climactic clash.\n\nWell, to be fair, there are two climaxes during the last thirty minutes since WW84 owns two antagonists to play with. One of them is closed in perfect fashion, with the emotional stakes at their highest. Great job there, no complaints whatsoever. However, the main fight sequence inexplicably contrasts with the rest of the movie's action. The vibrant colors disappear and are replaced by a dull grey, which makes one of the characters involved (who shares the same color tone) hard to notice, transforming an epic final battle into an underwhelming, barely comprehensible collection of awkward cuts, punches, and screams. Gadot's golden suit is way less exciting (and poorly lit) than her original costume, and Barbara's arc ends without real closure.\n\nIn addition to this, Jenkins insists too much on passing to the audience that greed brings horrible consequences. \"Be careful what you wish for\", \"money and power can't buy happiness\", \"be thankful for what you have\", and messages along these lines are repeated continuously (implicitly and explicitly). I admit that it might be a nitpick of mine and that not many people will feel like I did, but I couldn't help but feel that some moments sounded and/or seemed a bit preachy and way too repetitive. Also, it's a bit weird how the official premise mentions Wiig as Cheetah, but this word is not mentioned once in the entire film... Nevertheless, don't be mistaken: I'm thrilled that WW84 is the last flick I watch at a theater this year!\n\nAll in all, Wonder Woman 1984 proves that DC continues on the track of success by delivering a well-structured, well-developed DCEU installment without an absurd amount of overwhelming CGI and/or forgettable villains. Patty Jenkins, Geoff Johns, and David Callaham's impressively layered screenplay makes the lengthy runtime feel adequate not only by offering epic, exciting, technically superb action set pieces, but also due to the remarkably well-written heroes and antagonists. Gal Gadot and Chris Pine are outstanding together, but Kristen Wiig and Pedro Pascal steal the show as the newcomers. With two wonderful \"villains\", WW84 boasts a solid, elaborate narrative that I was lucky to witness on the big screen. Unfortunately, the climactic battle is disappointingly underwhelming and colorless, Barbara's arc ends abruptly without true closure, and Jenkins insists too much on the thematic message of the story. These issues may affect more viewers or not, but one thing's for sure: it's one of the most entertaining movies I've seen all year, worthy of being seen on a massive theater.\n\nRating: A-"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "khudri-johari",
        "review_rating": "6",
        "review_title": "More like a Drama; not really Action / Fantasy / Comedy",
        "review_detailed_main": "As stated above, to be honest. We just had our cinema ban lifted here in Malaysia, I got on the first screening in the country together with thousands other people nationwide with the increased ticket price, distanced seating, etc.\n\nand lo and behold...it's a drama!\n\nAction? Sure, here and there. Fantasy? Yeah, obviously. Comedy? Of course, a bit. But in its entirety, it's a drama. It's like watching ... a DC-ed, Pixar-esque / Disney-ed, live-action movie...yeah. Movies like Maleficent, Beauty & The Beast, Mulan came to mind...somewhat similar feelings.\n\nAll I'm saying is; if you expect it to be like the 1st WW or the Justice League - don't."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "westsideschl",
        "review_rating": "3",
        "review_title": "Dumb!!",
        "review_detailed_main": "1. Background of WW youth story seemed very artificially seen-before-unlikely. Not creative or interesting.\n\n2. A quartz crystal prop (also seen many times in movies) that you can purchase on line or in many gift shops for ballpark $10 to $20; instantly materializes wishes - please, so juvenile dumb.\n\n3. Action scenes such as the as usual vehicle chase was a boring redux from nearly every action movie. Nothing new.\n\n4. Magical lasso scenes came across as very cheap CGI.\n\n5. If anything the movie's intent was to showcase Gadot's looks."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "richardjshaw",
        "review_rating": "1",
        "review_title": "Don't believe the negative reviews - it's worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "TheRavenOfAll",
        "review_rating": "",
        "review_title": "What a joke!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cgmagmaent",
        "review_rating": "7",
        "review_title": "WW84 is the perfect movie to bring back moviegoers to the cinema as it shows why some movies are meant to be seen in cinemas.",
        "review_detailed_main": "It has been a while since we go to the cinema and people are shifting to Netflix and other OTTs for entertainment. But with the release of 'Wonder Woman 1984', once again it proves that some movie are meant to be seen in cinemas.\n\nTwo thumbs up to Patty Jenkins, Gal Gadot who portrays the heroine perfectly and all the creative heads and hearts behind WW84 for giving us the best DC movie after The Dark Knight (IMHO) that went all out not only in its drama and action fantasy, but also in hearts and the believe in humanity and kindness. It truly bring back the memories of Chris Reeve's Superman (directed by Richard Donner).\n\nFrom its spectacular opening towards the end, WW84 is a joyful rollercoaster ride that (hopefully) will bring all moviegoers back to the cinema. #WW84SavesCinemas"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "Way too much to say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "yjcool",
        "review_rating": "7",
        "review_title": "Pretty good movie for a Christmas season",
        "review_detailed_main": "DC gives you dark movies ,they claim its too dark and when they give a light hearted movie with contemporary situations they cry its too cheesy. I agree the only character who got wasted was cheetah reminds me of venom in Spiderman 3. Nonetheless its a good movie to take a look on 80s era and a beautiful movie which shows what you get when u get back a loved one. Feels like this could be Christmas superhero movie in the coming years"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "arnkp",
        "review_rating": "3",
        "review_title": "It's pretty awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "LostFRINGE",
        "review_rating": "6",
        "review_title": "Overhyped",
        "review_detailed_main": "They really did an outfit change montage in this movie, and I can't believe the movie makers thought it was a good idea.\n\nThe \"villain\" was just ridiculous. Very poor dialogue with little to no substance. He was bullied at school? That's it? That's why he's mean? And it took just a speech to defeat him and make him feel bad? What a cop-out!\n\nI still gave it a fairly average score as I don't believe it deserves 1's or 2's that a lot of people gave this movie. There were still some emotional and entertaining elements that were shot beautifully, but overall I do agree this movie was disappointing and underwhelming."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "craigcornwell67",
        "review_rating": "9",
        "review_title": "1 out of 10?",
        "review_detailed_main": "Decent film, fun and action packed. Where all these 1/10 ratings come from I don't know. Some people didn't even watch more that 15 minutes and are the others saying it's the worse movie of all time? Ridiculous. Do yourself a favour, ignore all the amateur reviews (including mine) and make up your own mind."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "gilangsatriaramadhana",
        "review_rating": "7",
        "review_title": "Overall Good but is it better than the first one?",
        "review_detailed_main": "So, About Wonder Woman 1984 ....\n\nI'm a DC boy and I love Wonder Woman . And this movie is overall good, But so much stories and sometimes not delivered fully. The Act is brilliant tho . I love all the Action Sequence . It is very different than the first film. Is it better than the first film? I guess it's not(?)"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "GetTheNak",
        "review_rating": "1",
        "review_title": "What a joke, a really bad joke.",
        "review_detailed_main": "Fifteen minutes into the movie and I've writing this review while I'm watching the movie because I know I won't miss anything. Even the 70's WW series with Linda Carter was less campy than this movie. It's too bad, I really enjoyed the first Wonder Woman. As a matter of fact, I think stop watching this and go rent the 70's WW series. You should too."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ozzytank",
        "review_rating": "2",
        "review_title": "Incredibly boring and ridiculous storyline",
        "review_detailed_main": "I love Gal Gadot. I really like Chris Pine. I hated this movie. To be entirely honest, I should say I hated the first half of the movie which was more than I could stomach. I asked my wife if I could turn it off and she was already asleep. This is something you might expect if this was sequel number 20 and they had completely run out of ideas. Not sure what I expected but this was embarrassingly bad."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "GadgetMom23",
        "review_rating": "",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "subxerogravity",
        "review_rating": "7",
        "review_title": "Nice Christmas gift! put a smile on my face!!",
        "review_detailed_main": "Like the first one I'm a bit indifferent about what I'm seeing but this movie does not have the stigma of the fact that I've been waiting so very long for a Wonder Woman movie. I already got that.\n\nI do love the fact that this movie is movie is stepping further away from the darkness that began the DC Extended Universe. I loved Man of Steel but I felt it was being too much like the Dark Knight which is not the persona of all the DC superheroes.\n\nWhat is a concept of all the DC superheroes is that they are big and epic. Wonder Woman without a doubt is saving the world in this one, that's the purpose: giving it all to save the world and I felt that from this movie, something that I do not feel in other movies like this, necessary.\n\nLike a good sequel everything is a little better. Both Patty Jinkins and Gal Godat seem more comfortable making this flick. The actions scenes are better I like how Wonder Woman fights in this one. Way better than the last one. At the same time its far more sappier than the last film. Wonder Woman's moral campus and purpose as a hero is never overshadowed by superficial bells and whistles. Not sure how I really feel about that cause I love how Captain America's moral code can be found at the end of his right hook. Not to through shade on how in WW84 Diana takes a defensive strategy, never using her powers in violence no matter how violent the enemy is and only uses her power to stop the enemy with not intensions of destroying. How very Bruce Lee in the philosophy if not the movement.\n\nKristin Wiig as Cheetah was perfect. I first felt like they were trying to mimic something that the old Batman movies did with the bad guys. Her origin resonated with that of Catwoman in Batman Returns with the fun and playful persona of Jamie Foxx's Electro in Amazing Spider-Man 2. Plus, I feel like I've been waiting all my life to watch Wonder Woman go up ageist Cheetah in a movie and WW84 brings it!\n\nLike Batman Returns and Amazing Spider-Man 2 Wonder Woman 1984 boost more than one baddie and after finishing the second season of the Mandalorian I could not wait to see its star Pedro Pascal in anything. Maybe it's my lack of knowledge on Wonder Woman, but I do feel they got to be careful not to run out of Rogues for her to face (She's no Flash who like Batman has an endless supply). Pascal's Max Lord felt like Thanos in human skin and it works well.\n\nI will say I did not think the movie was 80s enough for a movie with 1984 in its title. Though those moments with Steve Trevor as a man out of time are funny I'm very surprise how subtle they kept the whole thing, or rather when it comes to paying homage or using it for humor. I think they had the political atmosphere of 1984 covered.\n\nIf you liked Wonder Woman than WW84 is something to check out. It's...Wonderful!!\n\nThanks HBO Max!!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ntncnm",
        "review_rating": "1",
        "review_title": "Waste of everything!",
        "review_detailed_main": "Geez I don´t even know where to start.\n\nIt was a waste of time, a waste of energy that was needed to shoot that movie, a waste of everything.\n\nHow could GG, CP, KW, RW etc. Even decide to make this movie?\n\nThe story stolen from many other movies (and it was a bad steal), terrible overacting, terrible storyline, terrible F/X, terrible everything.\n\nAs I said: I don´t even know where to start.\n\nThank God I did not spent any money on this since I watched it on Netflix last night but I feel sorry for everyone who did.\n\nWho writes crap like this and who thinks it is a good idea to make a movie of it?\n\nWhoever it was please never again write a script for a movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "WinterOf63",
        "review_rating": "7",
        "review_title": "Not Bad, worth Watching",
        "review_detailed_main": "This movie is overlong, no doubt about it. The final CGI battle goes on and on. They should have cut 30 minutes or more off the run time, but there's still plenty to like. The opening scene of young Diana competing in the Amazon Games and learning a hard lesson is great. Gal Gadot is still spectacular. I also liked the main plot wherein everybody gets their fondest wish and it just about destroys the world. It reminded me of the \"Monsters of the Id\" plot from Forbidden Planet. There's also a guest appearance by Lynda Carter in the closing credits.\n\nI think some of the 1 and 2 ratings are politically motivated because of Gadot making a statement in support of her country, Israel. All the haters are trashing the movie probably without having seen it."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "tylerc-62293",
        "review_rating": "3",
        "review_title": "Hard to enjoy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jadepietro",
        "review_rating": "7",
        "review_title": "Careful What You Wish For",
        "review_detailed_main": "IN BRIEF: Despite major story problems and pacing issues, there's enough action and romance taking place in this diverting sequel, and Ms. Gadot is back in her breakout role.\n\nJIM'S REVIEW: (RECOMMENDED) Wonder Woman 84 follows the same fate as most sequels that rarely surpass their successful predecessors. This bloated second installment of the Wonder Woman franchise uses its same winning formula, blending a love story with action-packed set pieces, with mixed results. Long awaited, after many delays due to COVID, this once summer solstice Hollywood blockbuster movie is finally being released at winter solstice in select area and being streamed simultaneously. So much for wishes.\n\nAnd wishing is the main issue at the core of this escapist entertainment. The McGuffin is a powerful dreamstone, an archeological relic that sends the world into chaos by a megalomaniacal businessman, Max Lord, and the ability to grant everyone's singular wish. Make a wish...no genie will appear, and it will be granted, but beware of its consequences! Of course, it becomes Diana Prince's aka Wonder Woman's mission to stop him. Along the way she befriends a mousy co-worker, Barbara Ann Minerva (Kristen Wiig), who will blossom into womanhood, reunites with her dead lover Steve Trevor (Chris Pine), and battles evil with her Lasso of Truth.\n\nGal Gagot reprises her role as our superhero and she is again the film's greatest asset. She makes a commanding figure and handles the physical and emotional duties quite well. Director/ Writer Patty Jenkins helms the production and delivers well staged action scenes and a convincing romance. The main problem with her film is twofold: the film's lackadaisical pacing between combat scenes due to a sketchy script in need of tightening and its two major villains that really lack gleeful comic book menace.\n\nAfter a throwaway prologue that adds little to the story except filler, moviegoers are transported back to the eighties. The screenplay takes forever to set the plot mechanics in gear. Too much time is spent reminiscing on 80's nostalgia (the fashions, hair, music. etc.) and introducing new characters. Somebody show Ms. Jenkins the cutting room and hand the lady a scissors please! Nearly 40 minutes into the movie, we are finally whisked away to adventure-land. Judicious editing and a couple of rewrites should have been her first mission.\n\nAs blockbuster extravaganzas go, kudos to the fine CGI and the stunt-people. Ms. Jenkins provides some nifty action throughout the movie, especially in two key scenes: one involving armored vehicles in a desert setting and another at the White House. However, the climactic battle between the villains is a real letdown with many loose ends about characters and their aftermath just left hanging. (An aside: The make-up department has done an awful job with its resemblance to President Reagan and they made Cheetah, an \"apex predator\", look like something from the stock company of Cats: The Musical. Talk about evil forces!)\n\nChris Pine is cleverly resurrected as WW's favorite aviator and he brings some charm once again to his role in this fish-out-of-water scenario. Ms. Wiig falls back on her comic safety net as the late-blooming Barbara before the actress transforms into a fully dimensional character. Pedro Pascal as Max just has too much comic edge as a perverted Gordon \"Greed is Good\" Gekko type. One never believes his evil side.\n\nWW84 has enough satisfying moments between its long hauls of non-stop exposition. I would wish that the third future installment focuses more on a concise story and improve on its pacing, but I don't wanna waste that request. Hopefully the talented Ms. Gadot will be a major player as well. Alas, one wish per customer. (GRADE: B)"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "lylet",
        "review_rating": "3",
        "review_title": "Boring and a waste of great potential",
        "review_detailed_main": "About the best thing with this latest DC release was the trailer, featuring the Blue Monday remix soundtrack. Great actors though who have been let down by a poor story line and boring lacklustre directorship."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "23Daniels99",
        "review_rating": "8",
        "review_title": "It had issues, but I had a great time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "anastamad",
        "review_rating": "7",
        "review_title": "Hero of Amazononas",
        "review_detailed_main": "The CGI not bad the first 1 hour in the film excellent story too after everything hollywoody"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "markk-28274",
        "review_rating": "3",
        "review_title": "Really quite upset as was looking forward to it",
        "review_detailed_main": "Really quite terrible. I watched it, but in lock down with cleaning the house as the other option which was tempting even after it somehow being £15 to rent on Netflix??? I loved the last one so just don't get how they messed this up."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "hathalud",
        "review_rating": "5",
        "review_title": "\"B\" movie with an \"AAA\" budget.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Very long, actors are good, but not always interesting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "kvamsisrinivas",
        "review_rating": "6",
        "review_title": "Nice action movie but no story in this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "gobillybatson",
        "review_rating": "1",
        "review_title": "Green Lantern is relieved",
        "review_detailed_main": "That it's no longer the worst modern superhero film. Superman IV: Quest for Peace...you can also take a cleansing breath."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "SaberaSurovy",
        "review_rating": "7",
        "review_title": "What? It wasn't that bad!",
        "review_detailed_main": "I mean, Gal Gadot's acting hasn't improved much but the story was enjoyable. Chris Pine was an absolute delight and Pedro Pascal's acting was as expected.\n\nKristen Wiig's character felt redundant, mostly because there was no development showing her transition from being an awkward scientist to a villain. It was like the script writer flipped a switch or something.\n\nThe scene where Diana's wish was renounced definitely could have been and should have been more emotional. I think it would have been if Gal Gadot was a better at acting.\n\nAction scenes were as bad as the first movie.\n\nBut overall I don't think the rating is justified. It deserves at least a 6.2 generally."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "chooper-32740",
        "review_rating": "1",
        "review_title": "Come on DC! What was that?!",
        "review_detailed_main": "Don't waste your money. My family sat down tonight all very excited to watch. No more than me. All three of my children got up and walked away from the movie within first hour and my wife had a nap. I was determined to see it through. Pretty upset I wasted $30 on this."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ninamwolf",
        "review_rating": "7",
        "review_title": "Liked it despite the reviews",
        "review_detailed_main": "Like title suggests, I went in sceptical as I had read the reviews about the movie before seeing it. However, I came out entertained and happy with my experience. The characters were clearly motivated, the action was well paced (although sometimes loud but hey it's an action movie). I felt that it had good character-driven moments rather than just aimless fighting and grunting. The performances were good and kept me engaged. My only downside is a particular scene toward the end which I felt like could have been cut down or cut out entirely but it didn't ruin the movie or anything. I liked the dynamic between Diana and Barbara. The scenes between Steve and Diana felt heartwarming. And even Max (although comically villain-ish at times) showed a man driven mad by power in pretty decent way.\n\nOverall, with certain superhero movies, just go see it yourself and don't pay attention to what others say."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "stan_gee",
        "review_rating": "1",
        "review_title": "WW84 This one they should have left in 1984, or even 1884",
        "review_detailed_main": "I recently had the pleasure, or what it a displeasure, either way I sat thru watching this trash and wondered when in hell it would all end, 2 hours and 31 minutes later in creeped to an end, but wait, in the end, the Easter Egg, made this horrible, terrible movie a littles less trashy.\n\nSince IMDb hate spoiler in their reviews, I won't spoil it, but let me say, if this is the future of the next Wonder Woman, there are good things coming down the pike, cause right now, this movie is a heaping pile of ... wasted film.\n\nJust because a woman or women want to produce and direct major films doesn't always mean they should, in this case they really shouldn't have, their vision for WW stunk to high heaven, please take away whatever they are writing with and burn it.\n\nThe sad thing about this is they brought back from the dead a guy who blew up in a plane in 1942 or thereabouts, then tried poorly to explain it away. Having grown up and lived in 1984, whoever the set designer was, must have lived in an alternate reality, I'm guessing Trumplandia, it was nothing like the real 1984.\n\nSo, if you are reading this prior watching the movie, save yourself a lot of time and don't , you'll have more fun watching rust form on metal."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bob-the-movie-man",
        "review_rating": "9",
        "review_title": "WW dot Well Worth Waiting for Gadot!",
        "review_detailed_main": "The long delayed release of the Wonder Woman sequel has finally happened, and it is well worth waiting for.\n\nGal Gadot is fabulous as the Amazonian beauty (and then some) with Chris Pine reprising his role from the first film. (Of all the \"WTF\" moments of 2020 trailers, this was top of the list.... just HOW? A McGuffin is involved, but no spoilers here!).\n\nIn brief, Patty Jenkins delivers a popcorn blockbuster than has legs (over and above Gadot's perfect specimens!): the Goblet-of-Fire-Potteresque pre-title sequence is thrilling and engaging. And the story builds cleverly through the first half of the movie. Above all, there is a heap of HEART involved here.... this is not your run of the mill supervillain showdown flick. In fact, it's a movie with TWO villains (normally a doom-laden premise for this reviewer... \"Spider Man 3\".... shudder), but here it really works well.\n\nSure, there is a requirement for a suspension of belief, but - hey - it's a DC movie. On a slight downside, the second half of the movie - for me -unfortunately doesn't quite live up to the promise of the first half, blending \"Bruce Almighty\" with \"Superman 2\" and rather over-egging the pudding.\n\nBut in a lockdown morass of B-pics, this sequel is one that is gorgeous to look at (Matthew Jensen's cinematography is superb), gorgeous to listen to (an epic score by Hans Zimmer) and is genuinely engaging. There's also a nice vein of humour running through it... when Kristen Wiig is in a park, a rough sleeper on a bench is reading \"Waiting for Godot\".... or is it \"Waiting for Gadot\"?? It's such a brief scene, I wasn't sure!\n\nAlthough I DEPLORE the Warner's decision to release their material in parallel to streaming, here is a movie that is MAGNIFICENT on the big screen and WELL WORTH you getting out to the cinema to see... assuming that you can find a UK cinema open (I saw this in the excellent Showcase De Lux in Southampton).\n\nOh, and if you are someone who dives for the exit at the first title... resist... there is an excellent and surprising mid-title sequence that will particularly appeal us older folks!\n\n(Please check out the full graphical review on bob-the-movie-man, which will be going live shortly. Thanks)."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "vsamuhammed",
        "review_rating": "7",
        "review_title": "A princess movie which should be animated by Disney!!",
        "review_detailed_main": "As a Wonder Woman and a DC fan I am disappointed with this sequel. It not even felt like an actual sequel. It felt like a Disney princess movie at sometimes. But as a pedro pascal fan i am absolutely shocked and happy. Pedro stole the entire show. But not felt like a superhero movie to me. Post credit scene bought some happiness. And then there is our legend Hans Zimmer who made my ears delightful throughout the movie. Background Score saved this at a very large scale. I can spend so much time just listening to Zimmer's Godly score. Direction and Story felt nowhere near the 1st movie. Gal Gadot didn't get much to do. Kristen Wiig' cheetah also got very low time. VFX works were great. As a DC fan , nowhere near expectations. Its good when you consider as a non superhero movie. Delivers some great message and its not dark like other DCEU movies. A Watchable one after all"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "vdmakwana",
        "review_rating": "3",
        "review_title": "A huge DC fan but this one was a garbage!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "pranavk45",
        "review_rating": "",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "khalilarman-90278",
        "review_rating": "6",
        "review_title": "More Drama, less Action",
        "review_detailed_main": "Just Full of Drama, bad plot, bad fighting coreo, but Gal gadot was Stunning!!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "tatoo_joa",
        "review_rating": "4",
        "review_title": "So so bad",
        "review_detailed_main": "Extremely predictable the whole time. Super lazy scripting, unrealistic events (planes have infinite gasoline?) and even bad special effects.\n\nPedro Pascal's acting is the only good thing of this movie. First time I saw him in a role like this and he did a great job."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bunngak",
        "review_rating": "3",
        "review_title": "Toss this movie with Josstice League",
        "review_detailed_main": "First WW was PHENOMENAL! This movie was bad on so many levels. Bad CGI. Non memorable action sequences. The plot was meh. That mall scene was WTF. Jenkins dropped the ball. Sorry wanted to like this movie so bad."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "logical_guy",
        "review_rating": "6",
        "review_title": "The SUPERHERO SPECTACLE we need right now.",
        "review_detailed_main": "Wonder Woman 1984 is POWERFUL, BIG, BOLD, BEAUTIFUL and STUNNING from the Epic opening scenes on Themyscira showing us some fantastic environments to the beautiful airplane flying in the fireworks scene, this movie has it all, nostalgia, love, and hope. The way Gal Gadot plays the role Wonder Woman, looks like she was born to play this role. The movie made brought the emotions in me, I never knew a movie could bring. This is definitely the movie 2020 needed to end on!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "meathookcinema",
        "review_rating": "3",
        "review_title": "Wonder Woman 1984: The Quest For Peace. Awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "info-17634-70644",
        "review_rating": "8",
        "review_title": "Much more better than a bunch of forgettable superhero movies out there",
        "review_detailed_main": "The movie has one true meaning about truth, from the beginning to its ending. It brought tears to my eyes several times. If you have children and you're so busy at work you could see yourself in Max Lord. Pedro Pascal did a great job to potraying his character. Except Joker (2019), I don't see that level of performance from other actors in recent superhero movies. Although WW84 has some flaws, but do other movies not have flaws ? I don't understand where all the hate and negatives came from. What kinds of actions were you waiting for ?"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "malhar-60950",
        "review_rating": "7",
        "review_title": "Worth a 'one time watch'",
        "review_detailed_main": "The plot has a lot of potential and the antagonist who is not a \"superhero villian\" adds to the excitement too. Of course the movie is low on action because the villian portrayed in the movie is not worth fighting. All you had to do was show him the truth. Its a good movie but it could have been better 😅"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "morfunkel",
        "review_rating": "1",
        "review_title": "Up there for top 10 worst superhero movie",
        "review_detailed_main": "I went in not looking at a single review just excited to finally see a movie in theaters this year. Man it really sucked though.\n\nThe only reason it has a 3/10 is because Pedro Pascal was really good with what he got. His motivations aren't clear but he did a good job. As well as that Chris Pine did good with the jumbled part he got. His character doesn't really add anything though except some laughs. Everyone else was very stale. Just so boring with terrible action...in the like 3 scenes that there are action.\n\nI had more fun watching quest for peace.\n\n\n\nActually thought about it more and it doesn't even deserve the 3 star it is so bad"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Haranauldy66",
        "review_rating": "3",
        "review_title": "Yikes!!!",
        "review_detailed_main": "Sat down with my son, we were both really looking forward to seeing this. The opening sequence, that was decent I might add, ended then the mall sequence. Oh my. He looks at me, I look at him and he said \"this is terrible\". I couldn't have agreed more. This movie is a mess. Bad CGI, story that's all over the place and so much more. At two different points he wanted to shut it off but I talked him off the ledge. I was determined to finish, no matter what. I have been known to make bad decisions.\n\nI feel giving it a 3 is VERY generous, VERY generous. How someone can even think this is a 10, please. Watch and judge for yourself but be warned. It's bad, very bad. Catwoman is an Oscar winner compared to this. Just say'n."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "fanimator03",
        "review_rating": "",
        "review_title": "Truth is all there is",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cardsrock",
        "review_rating": "6",
        "review_title": "A step down from the first film",
        "review_detailed_main": "I was pretty excited for this film, so I do feel quite a bit let down by the end result. The first film was a breath of fresh air in an increasingly crowded genre. I'm not sure exactly what this sequel brings new to the table.\n\nThere's plenty of heart and hope, much in the vein of the Christopher Reeve Superman films (this film even gives off Superman III vibes, not necessarily a positive). The romance between Diana and Steve is once again the highlight of the film. Their scenes are terrific and you really feel the connection between these two. The film outside of that, is so-so.\n\nMaxwell Lord is pretty generic with his take-over-the-world aspirations and Cheetah is fine, without being particularly noteworthy. The idea of wishes is the center of the story and the film handles it with mixed results. Some of the logic is iffy and there's just some lacking in forward momentum that the first film had. The CGI is also stunningly bad for a film with this budget. Some of Diana's movement look very stiff and awkward. The action scenes are okay, if sparse and not particularly outstanding. The film is also way too long and could've shaved off 45 minutes at least.\n\nThis isn't a bad film, but it just feels like it could've been something more. It also feels like a step back for the DCEU. WW84 is a decent source of joy in these unique times, but don't expect a DC classic."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "krazysoon",
        "review_rating": "1",
        "review_title": "Un-Wonder Woman",
        "review_detailed_main": "This has to be one of the worst movies of 2020. I waited patiently for this film to release and I was dismayed by what I saw. The action is dull, the acting is wooden and dialogue sounds like it was written by a first time writer. If you love cliches this is your movie. It's filled with them and you just have to roll your eyes. Superman v. Batman is far more superior than this film. Director Patty Jenkins really dropped the ball. The first film was so much better. What blows my mind is that the movie was directed by the same person who directed the first one. I think it was the right decision to split the release between digital and theatrical because it was not going to make its profit back just by doing a theatrical release, let alone on demand. I don't recommend this movie. I'd advise you wait until it's free on tv in about a year. It's that bad. It pains me to be so critical of Wonder Woman because I'm a huge fan. However, I'm not a fan of a director who can't even make a decent sequel. This is the same director who is going to direct Star Wars Rouge Squadron in 2023. If you love Gal Gadot check this movie out, other then that this is a hard pass."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "josephcohen-57404",
        "review_rating": "6",
        "review_title": "Very good, the first one is slightly better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Joe-93",
        "review_rating": "1",
        "review_title": "Ouch -- so painful to watch",
        "review_detailed_main": "This is, without question, one of the worst films I have seen in my life -- a paint-by-numbers approach to screenwriting, but by people who clearly can't count from one to two without getting lost. The saddest aspect here is that Kristen Wiig is utterly wasted here. Her character was the most engaging early on, but then the filmmakers don't seem to have any idea what sort of character they want her to be. What a waste of time and money."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jplhms77",
        "review_rating": "6",
        "review_title": "Just What Us Comic Book Fans Needed.",
        "review_detailed_main": "Forget the negative reviews. People nowadays are so critical. It's a fun entertaining movie that hits all the right spots. It's been a long time since we've had a superhero movie released, sit back, relax and enjoy it . Is it perfect, nope, but what movie is."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "4",
        "review_title": "Even Big Brother isn't watching this",
        "review_detailed_main": "The year is 1984. For some reason. Diana(Gadot, asked to carry a lot of the movie on her shoulders, and, sadly for all of us, out of her depth) still misses Steve Trevor(Pine, charming as ever, given less to do than last time). You'd think she misses her people, family, home country, more than the guy she knew for a week 66 years ago, but whatever. One day, he mysteriously returns. And a number of people are having wishes granted. Can something like that happen without serious consequences? And is it possible to include a moral message about that, without getting extremely condescending?\n\nThis is a mess. While I wish it was significantly better, I won't let my disappointment affect this review, I will be entirely honest. The tone is again partially that of the Christopher Reeves(RIP) Superman movies, especially the first two, except for when it's gritty and harsh. Those two approaches clash. A lot of the acting is reminiscent of the Sam Raimi Spider-Man movies, which works a lot of the time there, yet rarely here. The storytelling is sloppy, with countless instances of people somehow guessing where to go(and what to do, and what is happening), superpowers with inconsistent rules and sometimes lasting only one seem never to be mentioned before or after. It seems as though the Golden Lasso can do absolutely anything that they felt like it could at that moment. You have to look pretty hard to find a bigger fan of Patty Jenkins than me. I've watched Monster over two dozen times, before the release of Birds of Prey the first Wonder Woman solo movie was easily my favourite DCEU entry, and honestly I do still think she has more amazing movies in her. I don't think the blame lies entirely on her for the low quality of this film. It appears to me that it was butchered in the editing room, with the unusually long post production allowing for way too many producer notes, as studio people got cold feet about certain aspects of this. That would explain why so many things in this are poorly set up and/or go unresolved.\n\nThis features disturbing material. I recommend it only to the biggest fans of the people who made it. 4/10."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "maleficentkaiservrede",
        "review_rating": "9",
        "review_title": "Wonderful, amazing and emotional",
        "review_detailed_main": "Wonder Woman 1984 is a much different tone than Wonder Woman (2017). However, it shows Diana's vulnerable side and teaches us that we should appreciate what we have especially during these pandemic times. Patty Jenkins vision is definitely clear and her love for Wonder Woman is clearly evident. There are definitely some flaws that could have been improved but the theme, message, escapism, cinematography, performance of the actors and actresses(especially Gal Gadot), the beautiful Golden Eagle Armor and the emotional aspect of the movie will keep you interested to watch it and feel amazed or satisfied. Definitely one of my favorite movies ever. Believe in Wonder everyone!!!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "souvikdas17",
        "review_rating": "7",
        "review_title": "Good Philosophy, Average Climax",
        "review_detailed_main": "The concept is quite good actually- The temptation of desires and the struggle of letting it go, but falls a bit weak of execution."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "giggityalright85",
        "review_rating": "",
        "review_title": "What. Is. This. Movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "pj1082",
        "review_rating": "7",
        "review_title": "I dont review often but I felt like a defense was due",
        "review_detailed_main": "This movie is getting trashed by users and im not sure why. Is it the movie that will save the DCU? No I assure its not, but it is certainly worth watching. Gal Gadot puts on an acceptable performance and Chris Pine and her have good (I didn't say great so relax) chemistry. Pedro Pascal doesn't stand out in this movie the way he does in the Mandalorian (I can already feel the comparisons coming) but he plays his role well. Watch and make up your own mind, but give it a chance."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rohithprakash-prakash25",
        "review_rating": "7",
        "review_title": "Patty Jenkins has delivered it again !!!",
        "review_detailed_main": "Wonder Woman 1984 is a movie made with a lot of love and it shows up on the big screen right from the get go !!! I was very keen to know how Steve Trevor was brought back to life and Patty Jenkins has pulled that off perfectly.\n\nThe one thing that WB has done best is to cast Gal Gadot as Wonder Woman. She's mesmerizing and you just can't take your eyes off her. She was excellent in emotional scenes and as always great in the action sequences. Kristen Wigg's transformation from Barbara to Cheetah is mind-blowing. Pedro Pascal played the role of Maxwell Lord to perfection. Most importantly Hans Zimmer's background score is out of this world. WW theme gives you goosebumps !!!\n\nThis movie is a must watch not just for the DC fans but for all the cinema lovers...."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cricketbat",
        "review_rating": "4",
        "review_title": "An overly long movie with a half-baked plot, covered in bright & colorful frosting",
        "review_detailed_main": "Wonder Woman's powers have been pretty unclear in the DCEU thus far, and this movie didn't help things. In fact, Wonder Woman 1984 kind of makes up abilities for everyone just to further the plot. Plus, the characters don't really talk to each other, they just all seem to be trying to dispense profound fortune cookie messages about truth, hope, and desire. This is a messy, overly long movie with a half-baked plot that's covered in bright & colorful 80s-themed frosting."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "nalaka-net",
        "review_rating": "7",
        "review_title": "Gal Gadot is so cute",
        "review_detailed_main": "So satisfying just to keep looking at Gal Gadot. She is so cute that I didnt want to take my eyes off her."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "madelyn3",
        "review_rating": "8",
        "review_title": "Good movie, form your own opinion.",
        "review_detailed_main": "First of all, I liked it. Was the dialogue clunky at times? Yes. Were the performances ok? Yes. But come on, it's another super hero DC film. The costumes, the set, the action, the storyline...it all worked. The ending, and how it ended, was actually a pleasant surprise for me. Ended differently than most superhero films out there. I enjoyed it and quite often i over analyze films. So please, watch this movie and form your own opinion before disregarding it entirely."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "northernlad",
        "review_rating": "6",
        "review_title": "Okay it's time for some real reviews...",
        "review_detailed_main": "Not sure what is going on with IMDB reviewers of this movie, but clearly some toes got stepped on or something. But as is the case with IMDB anyway, which is why the message boards disappeared anyway. But I digress...\n\nRating this movie lower than a 5 is just ridiculous.\n\nThe movie is 6/10 for me. I'd give it higher but the movie is long winded and slow in some areas. But when the movie gets going, it's a fun movie much like the first installment. The ending was a little disappointing and a little too simply wrapped up...but I'll deal with it.\n\nThere! That's a real review. IMDB...as usual....clean up your site from trolls."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "paul_haakonsen",
        "review_rating": "5",
        "review_title": "It was just a generic sequel actually...",
        "review_detailed_main": "I did actually enjoy the 2017 movie \"Wonder Woman\" quite a bit, so I was definitely looking forward to this 2020 movie from writers Patty Jenkins, Geoff Johns and Dave Callaham.\n\nAnd while \"Wonder Woman 1984\" was definitely a watchable movie, it just wasn't really up to par with the 2017 movie in anyway. Why? Well, simply because the storyline felt way too comical and the villains in the movie weren't really all that interesting or menacing.\n\nThe storyline told in \"Wonder Woman 1984\" just fell short of being all that entertaining. Sure, it was a watchable movie, but it was hardly an outstanding or particularly memorable foray into the D.C. world of superheroes. For me, the storyline here felt like something that had been ping ponged around a breakfast table, with the writers just tossing out ideas and settling on something that seemed like something that could be made into a Saturday morning cartoon.\n\nOf course it was nice to have Gal Gadot return to portray Diana/Wonder Woman in this 2020 movie, and she was joined with talents such as Chris Pine, Kristen Wiig and Pedro Pascal. I must admit that Pedro Pascal's performance was actually the most brilliant and enjoyable in the movie, and his character was the one with the most appeal in the movie. Mind you, as a villain he just wasn't all there. I mean, it was more of an average Joe come into power situation, so it took away from the usual superpowered villain stuff you'd expect to see in a D.C. movie.\n\nFor me, the whole granting wishes thing concept of the movie just felt out of place, and like something that belonged in a whole different type of movie. It just failed to captivate me, and proved to have little entertainment value in terms of being the focal point of a superhero movie.\n\nVisually then \"Wonder Woman 1984\" was all there, just like the 2017 movie was. So the visual effects team definitely worked their magic with this 2020 movie, no doubt about that.\n\nWhile I have now seen \"Wonder Woman 1984\" once, I doubt that I will be returning to watch it a second time, as the storyline just felt out of place and too weak for a movie for Wonder Woman.\n\nMy rating of \"Wonder Woman 1984\", sadly, lands on a very mediocre five out of ten stars."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "robert-slaughter",
        "review_rating": "1",
        "review_title": "Horrendous",
        "review_detailed_main": "I'm not even going to write a lot here, all you need to know is this is potentially the worst DC movie out the lot.... and it's not exactly a high bar to overcome. What a shambles. So disappointed."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "wk83",
        "review_rating": "",
        "review_title": "Just a bad movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "GCleyton",
        "review_rating": "7",
        "review_title": "exciting and charming!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "fastdrop",
        "review_rating": "2",
        "review_title": "Really awful",
        "review_detailed_main": "This is a chaotic movie. It rambles around the different uninteresting arcs without cohesion or benefit to the plot line. The best acting is by the main 'bad' guy and even that is predictable and uninspired. Intentional emotional tugs are painful to watch...not a good painful. The main character...so much less inspiring and interesting than her previous ventures as Wonder Woman. What happened to her acting skills? Even the special effects were so so. And...when did Wonder Woman start to fly like Superman instead of using her high tech jet?\n\nHonestly even my kids were left dumb founded and cringed at many of the scenes. It became a point of laughter rather than super hero drama or intentional comedy."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "PABLORIVASCAA",
        "review_rating": "6",
        "review_title": "I dont know why the bad reviews",
        "review_detailed_main": "I am a DC fan since kid, I have seen a lot of bad adaptation, animated or live action films. and this one is not a bad one. WW 1984 is amazing, is not a master piece like the Godfather or a Stanley Kubrick film,or a visual journey like Zack Snyder type of thing but inside the DC Universe this movie goes great. The plot is fine, the visual efects and the soundtrack is great, and the acting is in level with another great hollywood movie, even Gal Gadot, that really surprised me. I dont understand the hate, really, and I really like to hate bad adaptation like \"Birds of Pray and the Emanblablabla\". But, the movie itself don´t add nothing to the DC Universe, is just, a crazy thing that happen in 1984 and we never ever again gonna hear of it again in any DC movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "gino-salguero",
        "review_rating": "1",
        "review_title": "Sad",
        "review_detailed_main": "This terrible disaster has so many mistakes, that looks like an alpha production. Why did you get us this movie after showed us that you are perfectly capable to do good super heroes movies (WW1 and Aquaman)?. Sadly you will lose completely your base of fans if you continue with this miserable products."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "parameshyerra",
        "review_rating": "7",
        "review_title": "Great life lesson movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "phillhudson",
        "review_rating": "3",
        "review_title": "Skip this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "davidwhitley1995",
        "review_rating": "8",
        "review_title": "See for yourself.",
        "review_detailed_main": "If you need action to keep you entertained go watch Michael Bay where food stands explode. Pedro really stood out to me in this. Seeing his range is pretty great. Its not the greatest movie but its one of the best recent DC movies. It's way better than most of these review bombs claim. Thanks for reading."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "denilsonvalenzuela",
        "review_rating": "6",
        "review_title": "Not everyone's cup of tea.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bigwal-2",
        "review_rating": "1",
        "review_title": "I would rather knock myself unconscious with a cricket bat than have to watch this again.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bpalmeira2",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "I've never watched something so silly , childish . Stupid script . How it came out of a writing room ? How the director , or the producer accepted this s... ? It's a disrespect with the watchers , specially the ones anxious because of the marvelous first one. I feel pity for the actors too , but at least they were all well payed.\n\nAnd I thought WW84 would scape from the fate of the majority of DC movies ... well this was one doesn't"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "paulvillani",
        "review_rating": "",
        "review_title": "Dentistry Without Novocain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "thelovetree",
        "review_rating": "7",
        "review_title": "Nowhere Near As Bad As The Worst Reviews",
        "review_detailed_main": "Reading the utter carnage of poor reviews for this film, I can only conclude that they were either written by people with an encyclopaedic knowledge of the superhero genre, or by people with no knowledge of it whatsoever. No middle ground. Now, I can understand Comic Book Guy from The Simpsons combing through the minutia and taking grave exception to the film's cliches, apocryphal inconsistencies and general awfulness. But for everyone else, what were you expecting? The character development of Brando from On The Waterfront? A savvy, tightly woven script written by Charlie Kaufman?\n\nIn truth, WW1984 requires only as much suspension of disbelief as a swathe of other superhero movies, and doesn't brandish nearly as much plot armour as some other, more highly rated films (Yes, X-Men, I'm looking squarely at you). Before viewing, I was most concerned about how the gimmick of the 1984 time setting would effect the mood of gravitas established by its 2017 predecessor. Would the sequel lapse into bathos, like so many films in the MCU? Because when I think of cheesy, this is scriptwriting straight from the Kraft factory. Maintaining consistency of tone was always going to be a bridge too far, I think, and there are indeed a handful of scenes where the eighties schtick is a bit glitchy. But there's nothing that I found particularly grating...knowing full well how it could have been handled.\n\nSo, what did I enjoy about the film? I thought that it was well acted, on the whole. Gal Gadot infuses the WW character with lustre, sincerity and steely resolve. She does a fine job with what is, and must be, a cartoonish script (this is not Citizen Kane, remember). Chris Pine is also very good, and there is no doubting the onscreen chemistry between the two leads (not something to be taken for granted). And I did kinda 'dig' the villain. Pedro Pascal has one hell of a time playing wannabe oil magnate, Max Lord, and at least some attempt was made by the writers to sketch a backstory and endow him with a sense of human fragility. In this respect, I enjoyed him far more than the utterly two dimensional baddie Ludendorff from the first WW film, not to mention David Thewlis's 'ping, I'm actually Ares' moment in the third act (as much as I like Thewlis as an actor).\n\nOne more thing to like about WW1984: it's got some really cool aesthetics. The opening 15 minutes, set in Themyscira, is a visual feast and features some compelling cinematography as the camera - virtual or otherwise - swoops and weaves its way around the island as Amazonian athletes strut their stuff. Another well crafted scene involves an admittedly implausible fragment of plot - as Chris Pine flies a 'borrowed' aircraft through an explosion of fireworks en-route to Cairo to save humanity. Ridiculous? Yes. But beautifully shot nonetheless.\n\nOverall, whilst this film certainly ain't no Ironman or Deadpool, it's no Dr Strange either (if we are to speak of totally unearned character development or abuses of logic and physics). I do think that WW1984 is a solid 7, rating it as one must within the genre it is occupying. To lowball the film with ratings of one is really unfair in my opinion. The hyperbolic claims of 'worst film ever' come, I think, from a place of Fanboy-Dom, where unforgivable blasphemies occur and people cheerlead both for and against their favourite franchises. I would recommend the film as no better or worse than a multitude of other superhero movies. Whilst this is hardly high praise, I can honestly say that I thought the film was quite fun, at times moving, with likeable leads and some solid performances. In short, I was entertained."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sandycochrane-97758",
        "review_rating": "4",
        "review_title": "Hahahaha",
        "review_detailed_main": "I haven't laughed so much at a film in ages - So thanks for that!\n\nOther than the awful mall scene, what was the whole point of it being set in the 80s?! There was literally nothing else 80s about the film.\n\nEven American Horror got that bit right\n\nI'd put this film on par with the all female Ghostbusters film - it was that bad"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "lilykin",
        "review_rating": "6",
        "review_title": "Watched twice. Still convoluted and disappointing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rosedemaris",
        "review_rating": "1",
        "review_title": "Painful to watch, cheesy & bad CGI",
        "review_detailed_main": "For such a highly anticipated movie this was one of the biggest letdowns. The cgi was so obvious and overdone and the acting was cheesy. It was a struggle to get through the film. We kept waiting on it to get better, or at least some awesome fight scene, and nothing happened. Seems fitting for the year 2020. They messed up on this one."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "egyptiangod-21071",
        "review_rating": "7",
        "review_title": "This is great. Worth the watch. Not sure what other reviews are about.",
        "review_detailed_main": "WATCH IT. IGNORE THE NEGATIVE REVIEWS. I was weary of watching it given the negative reviews on here, but honestly it was a pretty good movie. Sure, it's not as great as the first WW film -- don't go in expecting it to be, but it is still a solid 7/10. Great plot and acting. Be open to enjoying a movie where they build on the characters and not just throw you into 120 minutes of non-stop action. Really makes me sad to see so many angry users on here with unfair reviews of a great movie.\n\nSeriously giving this a 1/10? You've got to be kidding me. You're rating this lower than Dolittle or the Eurovision movie that came out this year??? Hah!!!\n\nI'm not going to give this a 10/10 in hopes of \"making up for the low scores\" but instead providing an honest review of the film.\n\nBottomline: If you're interested in the movie and enjoyed the first one and like Gal Gadot, then you will enjoy the sequel."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "deltaforce7",
        "review_rating": "1",
        "review_title": "Disastrous, boring, confused, poorly played, lacking in common and technical sense flop of a flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "vincentflorquin",
        "review_rating": "9",
        "review_title": "Amazing movie",
        "review_detailed_main": "There are so many reviews out there giving this movie a bad rating. Let me tell you how they don't understand the movie or the setting of the eighties. This movie has it all. The humor of series like the A team, Macgyver etc. The message of being content with what you have an appreciate it. The simple power of friendliness. Gal Gadot and team you nailed it and don't let others tell you otherwise."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "chhatriwalafaizaan",
        "review_rating": "6",
        "review_title": "Starting 1hr is way too boring",
        "review_detailed_main": "Overall the movie is good. The actions were good the storyline was okay. Both Chris Pine and Gal Gadot has done the great acting. DC can perform well...... After 1hr the actual movie starts......"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jodee143",
        "review_rating": "1",
        "review_title": "Not Consistent",
        "review_detailed_main": "Is this set in the 80's or not? Hard to tell with the inconsistent set and costumes. Disposable coffee cups like those at a gas station or Starbucks weren't around in that era. Kristen Wiig shines as always."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Imran_Gul",
        "review_rating": "4",
        "review_title": "This ruined Gal Gadot's charm as Wonder Woman",
        "review_detailed_main": "Why why why 2 hrs and 30 minutes, when there is nothing to offer. A family movie made the whole of my family so bored that we had to forward at many parts to just finish the movie. The most disappointing thing is that this movie ruined all of the charm that Gal Gadot had as Wonder Woman. This looked so fake and so bollywood."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cdib",
        "review_rating": "",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "daydreamer-85787",
        "review_rating": "7",
        "review_title": "Don't know what the complaints are about...",
        "review_detailed_main": "Honestly, the movie was entertaining. It wasn't great, but it was good. The ending felt a bit too easy and cheesy, and overall, the movie had a bit too much of a \"feel-good\" vibe, but was fun and light-hearted otherwise."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "nealgupta-75187",
        "review_rating": "1",
        "review_title": "0/10 Script and Directing",
        "review_detailed_main": "This movie had so much potential and was a complete trainwreck. Might be the worst script and directing job I've ever seen in a movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "monsterhunt-94296",
        "review_rating": "7",
        "review_title": "A good enough superhero movie",
        "review_detailed_main": "Wonder Woman 1984 is the sequel to the 2017 Wonder Woman. This is a solid sequel, and although the themes are nothing we haven't seen before, it gets its message across and is made well. The film, for the most part, looks great. The entire thing looks like it was shot on film (after a quick google search I confirmed I was right and my eyes are really trained to notice the difference between film and digital now), so the colors look great and the image really pops. The cinematography was pretty solid throughout, although I thought it didn't look the greatest at times.\n\nThe film has some CGI that's... bad. A lot of the CGI looks great, but some of it just really doesn't work. The characters are all well written, and the main villain of the film, Maxwell Lord, was really interesting to see. I think he got a little over the top near the end of the film, but he was an interesting villain (a lot better than Ares in the original film...). The movie is entertaining throughout, although I thought some of the action scenes did drag on for a little too long. The score by Hans Zimmer is great, and the film keeps a fast pace and there's never a moment where it drags throughout its two and a half hour runtime. Overall, this is a well written and well made sequel to the original film, and although it has its flaws, I'd definitely recommend seeing it if you liked the first. 7/10."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "joseosorio28-124-740017",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Nonsense, Mediocre and improvised story and script, lots of loopholes on the storyline, poor performance off absolutely all actors and actress, Oscar to the worst off all DC movies."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jp_91",
        "review_rating": "6",
        "review_title": "Good but something is missing.",
        "review_detailed_main": "\"Wonder Woman 1984\" is an interesting film with a feeling of the 1970's TV-Series. Many films set in the 1980's looks fake about fashion or furniture, but this film looks like a real 80's film, the costume design and the hairstyles are excellent, even the cinematography is totally retro. Patty Jenkins direction is good, Gal Gadot, Chris Pine and Kristen Wiig performances are great, the production is amazing but the script is weak, some good action and sad scenes, but not more, the special effects are not that cool. A fine film, not a masterpiece but funny, the first film is better than this sequel!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jonnyluckett",
        "review_rating": "1",
        "review_title": "I renounce my wish of ever seeing this movie!",
        "review_detailed_main": "Once you've wasted 2 hours of your life watching this movie you'll wish you listened to all the reviews and hadnt bothered! Some advice, don't waste your time with this drivel!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ashleyxtaylor",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "Not sure why all the bad reviews but I enjoyed this movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "pissbaby_",
        "review_rating": "6",
        "review_title": "Shines as a welcome dose of perfect golden power suited escapism.",
        "review_detailed_main": "Jenkins' fast paced direction makes this film an effective comic book movie that leans heavily on wholesomeness and optimism, leaving out any kind of moral ambiguity or nuance for bright colours and popcorn friendly ostentatious action scenes. WW84 is a rare superhero sequel that, for better or rarely worse, carves its own path and finds something joyous, wacky and deeply enjoyable as a result. Gadot has a queenly self-possession and she remains a charismatic presence who wields the lasso with authority. There are some fantastic costumes and some terrific bold performances from a delightful cast specially Pedro Pascal who's talent is being wasted behind the Mandalorian helmet. It's a visually dazzling melodrama that has to hide it's relative disinterest in superpowered showdowns but the movie's in service of a plot that sometimes loses sight of what makes the character so great in the first place. Though the film can't quite reach the heights of the first film, it is still brimming with the same wonder and joy as the previous one beacuse unlike the first the flaws are minor and aren't glaring at you and the movie definitely soars beautifully when it matters the most. Overall, Wonder Woman 1984 is a very hopeful film with hints of sadness and realism especially towards the end and it kinda takes you back into the real world with a much needed message of hope and a sense of optimism, contemplated strongly by the musical score from the legend Hans Zimmer."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "yumigumibear",
        "review_rating": "1",
        "review_title": "Couldn't finish watching it",
        "review_detailed_main": "I was hoping this would be like the last one but it definitely is not. Seems super low budget and story is average."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "KenEsq",
        "review_rating": "1",
        "review_title": "Bad, Boring, and way too long",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "kviner-28295",
        "review_rating": "",
        "review_title": "How does a 200M movie ends up this bad?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "epalejandrocarrillo",
        "review_rating": "6",
        "review_title": "Action takes a backseat to the story.",
        "review_detailed_main": "More of a morality movie rather than a punch the bad guy in the face movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bombersflyup",
        "review_rating": "3",
        "review_title": "Phony baloney.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Elewis1195",
        "review_rating": "6",
        "review_title": "Not as bad as everyone says, but not a good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bigwoolf5",
        "review_rating": "5",
        "review_title": "Maybe don't put the best stuff in the trailer?....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "stemmetjason",
        "review_rating": "6",
        "review_title": "IN AWE",
        "review_detailed_main": "Saw it with my family yesterday I still can't get over how epic this movie is.Going in I lowered my expectations because I loved the first one so much but WW84 just surpassed every expectation I had .First of when I heard the villians were gonna be Cheetah and Max Lorde I thought they were a down grade from Aries and not really a threat after defeating a god but boy was I wrong.They totally eclipse the last movies villains as they break down Diana physically and emotionally piece by piece to the point you can just feel sorry her and cry with her .Also the action scenes are beyond epic and are probably some of the best set pieces in comic book history.A Beautyfully crafted film with Themes that is as relevant today as it was in 1984 .My hat goes off to you Patty,Gal and the rest of the cast and crew .Well done I'm pretty sure marvel fans will jump on sites just to give this film bad ratings coz its not made by Disney/Marvel but if they would really just judge films by how good they are everything wont be either black or white"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "vincent-98249",
        "review_rating": "5",
        "review_title": "No, giving just 1 star makes no sense, its not that bad.",
        "review_detailed_main": "But giving it an 8 or 9 star also makes no sense at all. So for me, it is a five at most. Before I watched WW84, I already read some bad reviews, so I was prepared. That helped, that helped a lot. The first Wonder Woman movie was great. For me, that was a 9-star movie.\n\nDon't get me wrong. WW84 had some nice scenes. But also, moments, I just wanted to turn off the movie. My wife stopped watching altogether and instead watch a TV Show. The WW84 mall scene... that hurt. It was a lousy slapstick. The person who designed/wrote that part should be fired and never be allowed to work in the movie or TV industry.\n\nBut the bottom line is, would 'I' recommend it? No, but that for you to decide."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Ionpixels",
        "review_rating": "10",
        "review_title": "the film means noble advice",
        "review_detailed_main": "In my personal point of view , I think there is an important life advice message that want to show in this film, sound likes : Don't ever expect too much from people, don't always indulge in endless lust, life becomes good as it is, try hard as you can to be better and more valuable, so you pass this mortal life towards god in peace"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Batsy1501",
        "review_rating": "7",
        "review_title": "Not enough",
        "review_detailed_main": "I think it was okay. I enjoyed 90% of the movie ! Except the third act! And can anyone give me the reason why the CGI is getting worse."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "mahnoor96",
        "review_rating": "1",
        "review_title": "Cats is a better movie",
        "review_detailed_main": "Gal gadot can not act. Full Stop. The script was atrocious, nothing flowed. Best parts of the movie are the supporting cast. And the best 1 minute of this movie was the after credits scene.\n\nDO NOT WASTE YOUR TIME."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jonathancasas-12799",
        "review_rating": "1",
        "review_title": "Chaotic, typical, illogical",
        "review_detailed_main": "This movie was somehow both typical, and illogical. The main plot was inconsistent, yet reminded me of a lot of DC typical stories. Character development was typical, and the dialogue was cheesy. I could a spilled a box of alphabet soup, and it woulda made a better script."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "kilofitness",
        "review_rating": "",
        "review_title": "Watched It For Gal. The Movie, Hot Dumpster Fire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "illumiinati",
        "review_rating": "7",
        "review_title": "Gal Gadot deserved a better script. And audience deserved a better movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jwjvalexander",
        "review_rating": "4",
        "review_title": "Remarkably terrible!",
        "review_detailed_main": "I don't want to think about how much time I donated to the power plant for this thing. I loved the first Wonder Woman movie and had high hopes. They were dashed in minutes.\n\nMy advice to the curious: watch until the Smithsonian gala scene. After that it careens so quickly over the cliff that all hopes of landing on a solid story line are lost."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "nicholassilva-76588",
        "review_rating": "7",
        "review_title": "Great message!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "dunkycraig",
        "review_rating": "1",
        "review_title": "Finally seen it",
        "review_detailed_main": "Well i just wasted 2.5 hours of my life on this. Wow how can you make a good movie in the first then with top notch actors in the second be so so bad? I can work out the opening or even fathom why it was there. The rest was slow and disjointed, Pine must of only been there to drag punters in.\n\nFor me this came close to the worst comic book film ive ever witnessed but nothing can beat the F4 for that spot, it makes justice league original version a masterpiece. Heres a thing film makers why not actually use the source material properly? You know the reason we like the characters, and not butcher them like this pile of 💩. Please for once leave the stories alone forget esg and write something that will make money."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "eliadz232-194-120984",
        "review_rating": "7",
        "review_title": "Theaters",
        "review_detailed_main": "I think the studios should wait with this movie until the countries open there theaters because yesterday I saw this movie in theaters after I saw it in my home and damn this was nice movie, not what I thought on the movie when I watched it at my home."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "skfla500",
        "review_rating": "3",
        "review_title": "The opening scenes are great...",
        "review_detailed_main": "...but unfortunately, it's pretty much all down hill from there. The script is poor, the scenery is odd and everything just feels out of place. Gadot is eye-candy and her acting is not too, too bad but that can't make up for the script. Who ever wrote this seems to watched all the old action hero shows from the 70's and 80's and pulled the worst and most wooden parts of the shows and stuck them all in this production. In addition, the ancillary characters too WW are rather poor. Even Chris Pine, who I like in most things, doesn't really fit in the movie. He seems to realize what a stinker he signed up for and kind of, sort of phones in his performance (compared to other roles he's played). There's a reason this made it's appearance in streaming so quickly. So, watch the opening scenes a few times and then just hang it up and call it a night. I wish someone had suggested that to me and I had listened."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jjofish",
        "review_rating": "8",
        "review_title": "Solid film, covid safe.",
        "review_detailed_main": "A solid sequel, weak but enjoyable storyline. I saw this opening week in the UK, I travelled to my local cinema (34miles one way) to enjoy this film and enjoy it I did. 6 people in the screen including the wife and I. Don't let the headlines of box office flop to put you off, it can't be a success with only 6 people in a 100 seat cinema. The film is what I expected, fantastic effects, good cast, and predictable storyline. In fact for me the storyline was the sticky point, I won't go into details just incase, but the whole first section, it's a shame it bears no impact on the rest of the film or even referred to again. In short, go watch with beer and popcorn, enjoy escape and be happy."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "redcanofevil",
        "review_rating": "6",
        "review_title": "Inferior in every way imaginable",
        "review_detailed_main": "WONDER WOMAN (1984):\n\nWhen Wonder Woman is the most bland and uninteresting character in her own movie you know its not going to be good. For a movie championing femininity and Girl power, almost all of its better moments came from the male cast aka Chris Pine and Pedro Pascal. Its like a MCU movie without any of the humor, action, quips or even good writing. Just a colorful cheese ride that is one part conflicted nostalgia bait and one part sad romance.\n\nHonestly, Pedro Pascal as a Nicholas Cage-esque Lex Luthor, a time gap Steve, nods to the old TV series and a very special cameo aside it was honestly a poor movie. Even for a sucker for Wonder Woman like me.\n\nRATING: 6/10 (As an obviously biased Wonder Woman fan)"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "srmhxq",
        "review_rating": "2",
        "review_title": "Blah",
        "review_detailed_main": "How many times can I fall asleep watching a movie. This was a pathetic excuse for a film and only exists for making money. What a waste of time."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ANastyGorilla",
        "review_rating": "4",
        "review_title": "A Disappointing Sequel",
        "review_detailed_main": "Wonder Woman 1984, directed by Patty Jenkins, significantly underperforms compared to its predecessor, delivering a sequel that lacks the coherence and emotional depth of the original. Despite its vibrant 1980s setting and a promising premise, the film struggles with a convoluted plot, uneven pacing, and underwhelming character development.\n\nThe story follows Diana Prince, played by Gal Gadot, living in 1984 Washington, D. C., working at the Smithsonian and performing heroic deeds in secret. The plot centers around the Dreamstone, an artifact that grants wishes but at a significant cost. Diana's wish brings back her deceased lover, Steve Trevor, played by Chris Pine, whose return feels forced and undermines Diana's independence, making him a \"masculine crutch\" rather than a supportive character like Peggy Carter in the Captain America films.\n\nGal Gadot continues to shine as Wonder Woman, but even her strong performance cannot save the film from its narrative flaws. The script fails to give Diana the same level of complexity and growth seen in the first film, reducing her to a more passive figure. The return of Chris Pine's Steve Trevor, while charming, dominates the storyline unnecessarily and detracts from Diana's heroism.\n\nKristen Wiig's portrayal of Barbara Minerva/Cheetah and Pedro Pascal's Maxwell Lord add some intrigue but ultimately fall flat. Wiig's transformation from a meek scientist to a powerful villain is one of the more interesting arcs, but it is rushed and lacks depth. Pascal's Maxwell Lord starts strong but becomes increasingly cartoonish, failing to provide a compelling adversary.\n\nThe film's pacing is uneven, with long stretches of exposition and meandering subplots that detract from the main narrative. Key themes about truth and the consequences of wish fulfillment are lost in the cluttered storyline. The over-reliance on CGI, especially in the climactic battle scenes, makes the action feel less grounded and more cartoonish compared to the original.\n\nVisually, the film has its moments, with vibrant colors and some well-executed action sequences, but these are not enough to compensate for the lack of a cohesive and engaging story. The opening sequence featuring a young Diana in an athletic competition is a standout, but nothing else in the film matches its visual cohesion or emotional impact.\n\nWonder Woman 1984 is a disappointing sequel that fails to capture the magic of the original. The film's convoluted plot, underdeveloped characters, and uneven pacing result in a lackluster viewing experience. While Gal Gadot's performance and the nostalgic 1980s aesthetic provide some highlights, they are not enough to overcome the film's significant weaknesses. Wonder Woman 1984 earns a 4 out of 10 for its missed potential and overall execution, leaving fans yearning for the brilliance of the first film."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "not very engaging despite a diligent effort from the lead actors",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sethtruhett",
        "review_rating": "7",
        "review_title": "worth a watch",
        "review_detailed_main": "It was a fun cast of people who all gave a great performance, I just didn't find the story very interesting. I never really felt that there was a true sense of necessary peril, which made it difficult to connect with the characters and the decisions they made."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Top_Dawg_Critic",
        "review_rating": "3",
        "review_title": "How to end a superhero's career:",
        "review_detailed_main": "Hire Jenkins. She single-handedly wrote and directed the worst superhero film in the history of super hero films, and there's no close second. That was the longest waste of time watching the sappiest superhero movie.\n\nIt was infantile, ridiculous, and riddled with plot and technical issues. Long, lame dragged out and unnecessary scenes. The dialogue was horrendous. I get that she's a newb writer, but having two other seasoned writers - Geoff Johns and Dave Callaham, there is no excuse for this horrible story. A 5th grader could've written this better.\n\nAs an experienced director, she also failed miserably in her direction of the entire 151 minute runtime. Even the great Hans Zimmer's score was too loud, constant and overbearing. Who green-lit this poor excuse of a superhero movie?\n\nLinda Carter must've cringed cashing her cameo paycheck. It's a very generous 3/10 from me, all going to the poor crew that at least came up with some decent S/VFX."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "edwincervantes70",
        "review_rating": "6",
        "review_title": "WW84 is to the first Wonder Woman what Quantum of Solace was to Casino Royale.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "zkonedog",
        "review_rating": "2",
        "review_title": "A Sequel That Lost Its Soul",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "simonv-14712",
        "review_rating": "7",
        "review_title": "Fun, good message",
        "review_detailed_main": "I like it. It leans quite far into the fantasy conceit, making it like a fable, so you have to be okay with that, take it on board. I did that, relaxing into what they were doing, and really enjoyed it."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "cesarsosay",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "Who wrote this? The story makes so little sense. It was hard to watch all the way through. All I can say is hey they tried, not sure if it was their best try however."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "luucong",
        "review_rating": "9",
        "review_title": "Story about Truth & Lie, Love & Hope",
        "review_detailed_main": "9 for the hero 10 for the villain. Thanks Maxwell Lord for being a great villain and a great father."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "joaospaz",
        "review_rating": "6",
        "review_title": "Stick to the trailer",
        "review_detailed_main": "To sum it up: the new order music trailer is better than the actual picture..."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "aaronka-16580",
        "review_rating": "5",
        "review_title": "Failed sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "pc95",
        "review_rating": "4",
        "review_title": "Big Fall from 2017 Outing",
        "review_detailed_main": "The predecessor to this turkey was a good watch, not great. Curious considering written by same principle author. This is a large fall-off mainly due to a chopped up, stupid, disjointed, and hokey story that tries to rely on a dumb wish-master premise that's been done before. The direction is bad, with the dialog sometimes laughably bad. The scenes are all over the place in a bad way. The movie feels like its gone through 20 re-writes in a bad way. This is what happens when ideas become a dime a dozen - grasping for straws, or too many writers become hamstrung."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rishikumar-00309",
        "review_rating": "7",
        "review_title": "Well worth watching 1984 colourful.",
        "review_detailed_main": "The Wonder Woman 1984 plot revolves around a special artifact called the Dreamstone that has the power to grant one wish for whoever holds it -- kind of like the horror story concept of the mystical Monkey's Paw. When you wish for something, there's always some strings attached."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jessetbeck",
        "review_rating": "2",
        "review_title": "Female empowerment deserves better",
        "review_detailed_main": "This film is dribble . I absolutely love Kristen Wiig but she / her agent was asleep behind the wheel when they agreed to give her talent to this . I hope they paid her so much to be in this P. O. S. The script is horrendous. I know superhero movies are fantasy but this one was outrageous. They spent a lot on it and the visuals are impressive but still a magic stone common. A skimpy dressed poorly acted female Protagonists surely can't be the be what the world needs . Honestly the longer the film goes the worst it gets. It's set in 1984 for no purpose besides lowest common denominator jokes and outfits. I like superhero movies a lot but this film sucked . The plot was long winded , sappy and the acting fell short even though good actors. Weird to think films like this exist. I'll watch many superhero films again especially Tim Burton's Batman but I will never watch this again. I recon you skip it."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "mday008",
        "review_rating": "6",
        "review_title": "I wanted to like this but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Jdb2021",
        "review_rating": "1",
        "review_title": "Can't believe some people like this movie.",
        "review_detailed_main": "Horrible plot, action, CGI, characters, etc. Enjoyed the first one, but this sequel was as bad as they come. Honestly, I can't believe the writers, director or actors didn't just say STOP and walk away from this when they must have realized what a mess it was going to be. Yikes."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jamesferguson-04874",
        "review_rating": "6",
        "review_title": "Not good, but not that bad",
        "review_detailed_main": "There's a lot of excessively harsh reviews here. This movie is just average. It has problems in a few areas, but it isn't worth hating and the visuals and action are fun. It also is clearly having a lot of fun with the period and with fashion, which isn't for everyone.\n\nFor my money, among DC films, the trash heap that was Aquaman fully deserved all the 2's and 4's this movie's getting. The fact it currently gets 6.9 is inexplicable to me. It was nonsensical idiocy with no plot or character. WW84 is just clumsily written and directed but at least seems to know what a movie is supposed to be and, y'know, has three discernible acts.\n\nI suspect this movie is getting review bombed because there are obvious parallels to Trump in the male villain. He's a sleazy/trashy conman/businessman who's a loser and a failure and desperately wants more wealth and power and somehow gets it when no one expected it. That said, it's not exactly the story of Trump at each step, it's just taking a character who's similar and telling a morality tale about related themes. But I don't doubt the partisans will take offence.\n\nThis movie just really needed more editing (2.5 hours is too long for what they have) and better direction. The logic of the McGuffin at the centre of the story isn't explained very clearly, but withholding the explanation isn't that interesting or exciting, it's actually pretty cliché.\n\nNot being clear about what's happening until way too late in the movie muddles the plot and just makes the hero look incompetent because it's not clear what a disadvantage she's at or why. Either explain the threat almost as soon as the McGuffin is in play and have the hero be really, really weak and in danger or reveal the danger of the McGuffin in the third act after the hero solves the mystery and then have them suddenly in danger from it. But this movie tries to do both and ends up just revealing the threat in dribs and drabs so no one knows how much to care about the threat to the hero, because we have no idea how bad it is.\n\nMaybe they were trying to please everyone and have a strong and capable woman but put her at just enough disadvantage that at times she needed a man's help as well? If so, they just succeeded at pleasing no one. She's not the same model of female empowerment anymore, but the guys who have a problem with female empowerment still aren't going to be satisfied and the vast majority of average viewers who aren't that political are just annoyed they have no idea if she supposed to be powerful or weak in any given scene.\n\nAll in all it was entertaining enough that I didn't turn it off, but long and uneven enough that I was checking the runtime around the 2 hour mark."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jgreed-49807",
        "review_rating": "8",
        "review_title": "I felt that",
        "review_detailed_main": "Movie good. Needed more action, but it was good. Moment with Steve, I felt that. I could see comic fanboys not liking it, but I loved it and so will you!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "DjfunkmasterG",
        "review_rating": "7",
        "review_title": "Not Great, not horrible... Lots of 80's style cheese",
        "review_detailed_main": "I originally documented this review for Fandango and since I am not up to editing or re-drafting it for IMDB you can just take it for what it is and I adjusted my score based on IMDB\n\nFor a sequel I kept my expectations tame. While I didn't find the film to be as good as the first WW, I do find it to be kind of entertaining. As normal Gal Gadot is just stunningly beautiful either as Diana Prince or as WW herself. What I found to be the most amazing aspect of the film was the colors and palette used to create this 1980's style and feel. I think the DP as well as the colorist did a phenomenal job on this film.\n\nOne other thing I enjoyed was Steve (Chris Pine) re-discovering the world. The fish out of water element was a nice re-visit with a flipped script since this was done in WW1 with Diana.\n\nLet's face facts it is comic book movie and the cheese level is pretty high on the scale here, but the underlying message about truth is not just fortune cookie wisdom. It actually has much more meaning in a world like our own today in 2020.\n\nCall it what you want? Call it faith, call it Karma this movie was made for a reason not just to fill the taste buds of comic book fans but to make us all look a little deeper at ourselves and ask... Am I really so bad off? and what Truth can I put forth to make myself better.\n\nWith all the CGI and hyper over stylized action this movie meets the lust of 80's cheese full on, and while it will not be as memorable as the first WW. It is still a decent entry into the series.\n\nBut sit back and appreciate the velveeta fest on display and take the one message the film does deliver.\n\nI chose 4 stars because I felt that the 3 star rating of \"Meh... it passed the time\" is not a true statement of this film, and I don't think it is awesome by any stretch of the definition of the word. However, it is entertaining and out a scale of 1 to 5 it delivers on the scale at a solid 4."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jehan-hossain",
        "review_rating": "1",
        "review_title": "Don't waste you time",
        "review_detailed_main": "Avoid at all cost. The storyline is absolutely garbage. The whole cast should be recast. DC continues to disappoint."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "justin-fencsak",
        "review_rating": "1",
        "review_title": "Worst movie of 2020",
        "review_detailed_main": "Compared to the original movie that made it a surprise hit at the summer box office, this 80s set flick has a confusing plot , bad CGI, and hardly a lot of 80s music against a score that almost sounds like a final fantasy video game."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "kieferpruett",
        "review_rating": "",
        "review_title": "FULL SPOILERS ARE IN THIS REVIEW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "lasttimeisaw",
        "review_rating": "7",
        "review_title": "Cinema Omnivore - Wonder Woman 1984 (2020) 6.5/10",
        "review_detailed_main": "\"At the end of 2020, here comes Jenkins' belated WONDER WOMAN sequel, thankfully Yours Truly is currently in China, where cinema remains open, and is able to watch its 3D version on the vast screen. WW 1984, its time-line is set among the Cold War nuclear hysteria, and our heroine Diana Prince (Gadot) does the usual superhero good deeds while remain certain degree of anonymity in Washington D.C.. Still pining for her lost lover, the WWI pilot Steve Trevor (Pine), she alights on a magical wish-granting gem, makes her wish and hey presto! Steve's soul is tossed back into our world (inhabiting another man's body, but in the eyes of his smitten beholder, he is the same old Steve all right), but soon it occurs to her that this miracle has a price to pay, the star-crossed lovers have to brave another adieu when Diana must choose to do the right thing, the emotional crunch is well-wrought, and Pine's soulful blue eyes are too irresistible to take our eyes off, and Gadot also passes muster to act out some real affect other than her acrobatic fighting showmanship.\"\n\nread my full review on my blog: cinema omnivore, thanks"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "TheVictoriousV",
        "review_rating": "3",
        "review_title": "Tedious, bloated, and predictable, with some hilarious gaffes",
        "review_detailed_main": "We were so close. 2020, thanks to the COVID epidemic and its effect on film distribution, was very nearly the first year in ages without a single big-studio capesh-t movie, with the exception of Birds of Prey.\n\nBut the folk at DC got the idea quicker than Marvel (that online streaming, for better or worse, is the future)), announcing that Wonder Woman 1984 would come straight to HBO Max at Christmas but with a few screenings at the same time - a model set for most of Warner Bros.' other releases going forward (not always with the consent of associated studios, apparently). Time will tell if Marvel will do the same with Black Widow; they clearly aren't shy about putting a gazillion other items on Disney+. Logically, DC must be the real feminists.\n\nIf there's one other thing the DC Extended Universe keeps outclassing Marvel on, it's inconsistency - of tone, of style, of lore, the works - and Wonder Woman 2 is no exception. It's downright impressive. Whereas the MCU can only muster up a retcon or two within Captain Marvel and an uncertainty of how many years have truly passed since the \"Battle of New York\" (a question raised by Spider-Man: Homecoming), DC manage to get something wrong with each new installment. Bravissimo!\n\nNext up to \"undo\" for the DCEU is a fact established by Batman v Superman and confirmed by the first Wonder Woman film: that Diana \"Wonder Woman\" Prince went off the grid after World War I, resurfacing only after the Earth's close encounter with Kryptonians. Wonder Woman 1984 decides that \"Nah, she actually did some other stuff during the 80s (that no one remembers) and we picked the 80s because Thor: Ragnarok is one of the Marvel films we haven't aped yet, excluding the trippy bits in Aquaman.\n\nBut the movie isn't as out-there or charmfully old-fashioned as Ragnarok. We do get some synth tracks, some colorful outfits, and vibrant locations that may be at home in a John Hughes film or a Stranger Things season, but this is still, for the most part, just another modern blockbuster - complete with a misogynistic Trump look-alike, this one being played by a Latino actor in what might be the final jab at Trump. After all, Hollywood soon won't have a Trump to regurgitate their jokes about; in a sense, they already don't.\n\nMaybe Warner Bros wishes they had streamed this film even earlier. Maybe the post-election release of this film made them realize just how much they'll miss this. Watching the ham-tacular Pedro Pascal in WW84 really does feel like the end of an era (not that future movies won't make Trump jokes way past their relevance) and it's a touch bittersweet. I'm sure the point still stands that some things haven't changed since the Reagan years (Pascal's Trump caricature is shown to be in control of the US president of the time) but we all know this sort of satire won't be as fun for Hollywood without a Drumpf, even if it succeeds at seeming \"woke\", as is always a plus.\n\nBut uh-oh, then we have the controversial Egypt scenes, which I've gathered aren't doing wonders for the woke points; critics are irked by the idea of Gal Gadot, an Israeli ex-military celeb garbed in American colors, going to Cairo to set things right and save soccer-playing Arabic children from an incoming missile (that her faction fired but let's no try to sort out all the nonsense). In Kyle Kallgren's words, they \"made a scene where a superhero undoes a war crime that the lead actor was likely involved in\". So that's pretty funny.\n\nWhat elevates the movie, in spite of it all, is how likable Gadot's Wonder Woman is - when Gadot's trying. She may be easier to relate to this time around, while retaining the attributes that make her inspiring. She was a demigoddess that became more human; now she's at home among mankind, having to explain modern amenities to a time-traveling Chris Pine (inhabiting the body of someone who gets no say in whether he/they should have sex with Diana).\n\nStill, it's mostly stuff we've seen before - the fish-out-of-water stuff with Pine has been done, the Kristen Wiig character has been done (by Pixar, Marvel, and DC themselves, albeit not always with a furry element), and the ideas surrounding the wish-granting stone have been done (with far more intelligible rules). If it was shorter and more self-aware, I'm sure I wouldn't mind. As it stands, it is a weak film that some of you might have fun with anyway, especially during its idiotic, hideous, sloppily produced action moments.\n\nAnd no matter how hard you insist that this is a comic-book movie and so it isn't meant to be taken that seriously (despite the insisted poignancy and emotional weight of several scenes), nor be realistic, Diana Prince \"swinging\" on lightning bolts with her whip isn't going to look non-stupid. \"It's meant to look cool, though\", someone might say, and the fact that it goes for coolness at the expense of rudimentary realism is what makes it so goofy.\n\nI'm sure there is a possibility she's being helped by her pep-pep Zeus during these moments but that only reminds me of the sad fact that, should Zeus ever appear in the DCEU, we won't get to see a mythologically accurate love life."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jackinfinity203",
        "review_rating": "6",
        "review_title": "Decent Sequel to Wonder Woman",
        "review_detailed_main": "Wonder Woman 1984 is a decent sequel to Wonder Woman!! It has solid acting from the cast, and Gal Gadot delivers her best performance as the iconic heroine yet! Pedro Pascal is a marvelous antagonist in the form of Maxwell Lord. The action sequences are cool to watch when there are any. The villains here are much better than Ares from the first movie, and WW84 has a superior third act to its predecessor. This movie has some great humor, and it never fails to make you laugh when needed. The emotional moments in WW84 are so heartbreaking to watch, it never fails to make the audience cry, or shed a tear. The story here is good, but it drags midway through the movie, and it's not as good as it could've been. The pacing was all over the place, something that bothered me in the movie. Overall, it's a step down from the first movie, but it's not bad like people make it out to be!! P.S. Stay for the credits, it'll be worth it!!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "benscott89",
        "review_rating": "1",
        "review_title": "Utter Dross",
        "review_detailed_main": "Never wrote a review before, but felt urged to project my viewpoint. This is utter dross.\n\nAlthough I never grew up in the 80's (but a big fanatic of 80's culture) the portrayal of the era is almost as if somebody decided to base the entire decade on Saved By The Bell. I never expected a lot from the film but I didn't expect it to generally align in quality with the first.\n\nI would rather watch my parents getting changed than watch this ever again."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "amroaj",
        "review_rating": "7",
        "review_title": "Finally a Good Movoe to Watch in 2020",
        "review_detailed_main": "I like it , it has a good story, it will keep your attention during the whole movie"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "SomeNicknameForThisSite",
        "review_rating": "3",
        "review_title": "Not only it is bad, but it is also long",
        "review_detailed_main": "Dumb plot, bad special effects, uninteresting dialogue, long and boring. My wife wanted to see it, but no one in the family liked the movie. I gave it 3 stars because there are worse movies, but on the thumbs up / thumbs down scale, it is the latter."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rish2006",
        "review_rating": "8",
        "review_title": "Worthy sequal",
        "review_detailed_main": "The 2nd Woner Woman film was very much satisfying with a strong plot and breathtaking action sequences / cinematography. The only drawback is the long duration of the film as in today's world, people don't want to give more than 2 hours for a film. But WW84 went for more than 2 1/2 hours. Rest all is good."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "RussHog",
        "review_rating": "7",
        "review_title": "Good Superhero Movie",
        "review_detailed_main": "I thought Wonder Woman 1984 was a perfectly good superhero movie. It had some stuff that was cheesy but that is genre appropriate for a lot of 80's movies. The villains were pretty cool. The reality warping plot was fun. Chemistry between Pine and Gal was \"meh\" but whatever. There is a handful of seriously memorable stupid stuff in this film but also some good moments. I think it was overall much better than Justice League, BvS, Aquaman, or Birds of Prey. I'd watch a third Wonder Woman movie with Gal."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "miguelmaal",
        "review_rating": "1",
        "review_title": "I would rather go to school",
        "review_detailed_main": "Couldn't tell whether I was watching it in reverse, it's so slow and nonsensical. Everyone was all over the place. Random stuff happens and sometimes it's important and sometimes it doesn't mean anything. So who were the good guys?"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "mirzasarmad-84188",
        "review_rating": "1",
        "review_title": "Terrible in all expected ways",
        "review_detailed_main": "Illogical screenwriting, cheesy jokes, cheesy dialogue, its everything you want when you are looking for a movie to laugh AT In 2 hours and 45mins, the action sequences are maybe 20 mins and ultra low quality. In all honesty, this is a download kinda movie. Save the cash"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "franka_van_loon",
        "review_rating": "",
        "review_title": "I wish my money and 2½ hour back.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "pktexas",
        "review_rating": "7",
        "review_title": "I was entertained",
        "review_detailed_main": "Not as bad as others have said here, I was entertained and that's all I can ask for on a quiet Christmas day. And I could look at Chris Pine all day long and totally enjoyed the surprising role for Kristin Wiig, she was great!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Sicaa369",
        "review_rating": "5",
        "review_title": "Wonder Woman 84 - mixed opinions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "vishumeti",
        "review_rating": "7",
        "review_title": "A totally unexpected entertainment.",
        "review_detailed_main": "A cheesy superhero movie. Very limited action scenes. But, it is a feel good movie.\n\nI was expecting to be bored and based on all the negative reviews, I went in expecting this to be a totally stupid movie. But, it turns out that the movie is definitely better than few other superhero movies I have watched and felt dissappointed. Most superhero movies have been all about action sequences these days. This is a change to the superhero movie tone that is good once in a while."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "That_Random_Engineer",
        "review_rating": "1",
        "review_title": "Wtf is this?",
        "review_detailed_main": "Just release the real one alredy i get it its a prank but its not funny i want the worthy wonder woman sequel i was peomised"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "billyt33",
        "review_rating": "7",
        "review_title": "I don't know, I liked it, once.",
        "review_detailed_main": "Not what I really expected, but I enjoyed it. Quit being so judgmental, just try to enjoy what you got. Especially in this day and age. It was entertaining, that's good enough for me!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "eddie_baggins",
        "review_rating": "3",
        "review_title": "A huge quality drop off from the first film, a major letdown!",
        "review_detailed_main": "Lets not kid ourselves, 2017's Wonder Woman was no cinematic classic but when compared to this second outing, the 2017 Gal Gadot starring and Patty Jenkin's directed hit looks like the Citizen Kane of superhero films.\n\nA surprisingly fun and inventive offering, the first WW came at the ideal time for the struggling DC cinematic universe and in turn launched its leading lady and director into the public eye in a big way, with many fans from across the globe keen to see where the adventures of Diana Prince would lead to next.\n\nEnsuring that we all understand wishes shouldn't always come true (a key theme to one of the films incredibly overwrought and cringe plot-lines), the return of the WW gang comes as one of the nastiest surprises of the 2020 release calendar as the first films charm and playfulness is replaced with a dreary, overlong and lifeless blockbuster that fails in almost every single way as it tries to recapture the lightning in a bottle vibe the original managed to harness.\n\nIt's one of the biggest drop off's in quality seen in a sequel in some years, gone is the charm of Gadot who appears to be laboring with the material she's given, Jenkin's is unable to capture any magic with set pieces or character beats and the films 80's infused humor and throwbacks is nothing more than a waste of time, with one left wondering why on earth the film even needed to be set in the 80's outside of the fact it was trying to piggyback off the era's popularity in pop culture right at this moment.\n\nFrom the instant we witness Prince swinging around a local mall in the films awkward opening stand you get a feeling something isn't quite right in WW world but there remains hope things can only pick up from here on out but with a laborious 40 minute or so stretch that follows, that allocates far too much time to Kristin Wiig's Barbara Minerva and the Raspberry Award seeking Pedro Pascal as oil tycoon Maxwell Lord (legitimately one of the worst comic book villains committed to celluloid with a performance that is all-time bad), you quickly begin to realize that 1984 has been doomed to fail.\n\nIf one were to waste their precious time or somehow manage to endure multiple screenings of this cringe-worthy affair there could be thousands of words written about the lameness that is to follow on in the wake of 1984's mismanaged opening segments with countless plot holes and eye-rolling moments (fueled up museum planes, 4th of July fireworks, kids playing soccer on a highway etc etc) building and building until you're willing the film to put and end to this whole shebang as its tigertastic final battle and preachy messages of love and kindness take hold around an overwrought final act, one that I'm sure its screenwriters were gleeful with as their life affirming messages found themselves proudly attached to one of recent memories worst finales.\n\nThroughout the film you're given moments that remind you that everything at one stage appeared to point to WW being a likeable and fun cinematic property, Gadot and the returning Chris Pine still share a good on screen chemistry even if there reunion is clouded in a seriously odd set of creepy circumstances and a throwback to the island of Prince's youth is fun and over the top with Hans Zimmer's typically intense score perfectly encapsulating proceedings but all you're left with as the credits begin to roll is a feeling that WW may never properly recover from the misguided failings of this Xmas turkey.\n\nFinal Say -\n\nThere's an incredible amount of things wrong with Wonder Woman 1984, a preachy, over the top and uninviting escapade that is far too long and self-confident for its own good. We may never know how things turned so bad from something originally so promising, as its now unlikely we will ever again see the Diana Prince and her adventures we all feel in love with back in 2017.\n\n1 1/2 wishes out of 5"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "karthi-49401",
        "review_rating": "9",
        "review_title": "Definitely a worth to watch movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "Get used to it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ajikude",
        "review_rating": "1",
        "review_title": "silly story, average acting, many flat scenes",
        "review_detailed_main": "Very disappointed. Boring. many pointless timewasting scenes . bad acting by great actors. bad corny nonsensical script . totally illogical. The fireworks scene was a waste of time. many subliminal political messages . I had to force myself to watch til the end. The funny bits are lacking and not great. I would avoid this movie. So overrated. The story line is just very poorly made. Not great directing."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "dankott",
        "review_rating": "1",
        "review_title": "DC comics deserve better",
        "review_detailed_main": "I hope I am not alone in becoming disenfranchised by superhero franchises. The Avengers finally got it right towards the end where vulnerability was finally embued their \"immortal\" cast. I can digress where how none of these movies create a true ambiguity between good and evil, but Wonder Woman boils down to just making yet another character invincible. Whereas the revitalized Dark Knight showed us a flawed Batman, the Wonder Woman series is a Superman 1.0. I won't designate a higher number as Superman has not taken off much at all either.\n\nDC needs to reboot their production docket or sell out to Disney. Wonder Woman was boring, with horrible fight scenes where she glided around in a stationary position, and not suspenseful at all. Everything was so predictable I couldn't finish 30 minutes of this shameful movie. Razzies here it comes."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Dgmojo",
        "review_rating": "",
        "review_title": "Cant delete my review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ADAKENNDY",
        "review_rating": "7",
        "review_title": "The wishing stone is a essential idea",
        "review_detailed_main": "This wishing stone idea is so well thought out that it both solves the problem of Stevie's return and successfully creates the image of the two villains, flesh and blood and not so cold, saying that Stevie is playing for keeps, stevie's position in the WW series was essentially a tool to bring out the human side of Diana, who was never really resurrected. It is a fact that the female hero is difficult to film, referring to Captain Marvel next door, is a comprehensive view of WW two movies, are wrapped in the shell of a superhero, the inner essence or human weaknesses. Diana image is always sent to deal with combat, the emotional line is the core of WW, Diana again strong, also can not save his true love Stevie, there is a kind of ancient Greek tragedy."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "silviolpleno",
        "review_rating": "1",
        "review_title": "Not good",
        "review_detailed_main": "This is the worst film I've seen in the last years. No dynamic in the acting. The acting itself was very poor and slow. The script is very poor and on top of it all, it's a film full of classic clichés that make it very uninteresting. Very disappointing."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bbv-69237",
        "review_rating": "6",
        "review_title": "Underwhelming - but OK",
        "review_detailed_main": "Had high expectations and was disappointed - should have realised nothing in 2020 was going to be good - Annus Horibilis (a Terrible Year). Gal Gadot was great as always - and Pine, Pascal and Wiig do fine jobs - everything was fine - except the plot. The storyline was just ridiculous and so far over the top that it all started falling apart very early. There was very little momentum after a promising start, and it was easy to start getting bored. Still - I enjoyed it as a bland fun movie, but with an obvious middle and end."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "iidgnmv",
        "review_rating": "2",
        "review_title": "Possibly the dumbest movie of all time",
        "review_detailed_main": "I though that perhaps the reviews were wrong. I wanted to give it a chance. Unlike Aquaman, which was SO bad it was good, this was just bad. Really bad. Plot holes, contradictions, terrible acting, shallow script, lame costumes, even the CGI was sub par. DC should have taken the 200 million dollars it took to make this film, given everyone in the US .50 cents, and we all would have been better off.\n\nYes. It was that bad."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Holt344",
        "review_rating": "6",
        "review_title": "WW84 is an underrated and different superhero film, but the character driven plot fits Wonder Woman",
        "review_detailed_main": "Wonder Woman 1984 is the second installment in Patty Jenkins' Wonder Woman trilogy. It's very much her movie as she co-wrote the script with Geoff Johns and Dave Callahan, she also directed and produced the movie.\n\nPatty Jenkins is a great director, she showed it with the first Wonder Woman and of course her award winning Monster. I have read multiple reviews that WM84 isn't a good film but I disagree, it's different and not the average superhero film and I'm glad Patty Jenkins and her team made it a character driven film and not about a dark versus light. Instead it's more about the characters and about greed, I found the pacing to be perfect for the character driven story. The overall writing was great, maybe a few things could be improved but I liked it.\n\nThe first installment took place in 1918, and the sequel finds Diana Prince at the Smithsonian Institution in Washington, D. C while secretly performing heroic deeds as Wonder Woman. It have been 66 years and in that time she have grown wiser and more mature, also learning new powers and mastering old.\n\nWonder Woman 1984 is much more character driven than the previous film and I'm fine with that, the characters are well written and rightfully cast, great acting from everyone. It's extremely light in tone and the stages in life that Diana/WM is believable and I appreciate a movie like WW84 and Shazam to be this lighthearted. Wonder Woman is truly a hero in this film, saving countless of lives and honestly not hurting a single person. It says says a lot of a person, but she isn't perfect and nor is the other main characters, everyone has flaws and that's why they are realistic and likeable.\n\nPedro Pascal portrays Maxwell \"Max Lord\" Lorenzano, he's a struggling yet charismatic businessman who are famous for TV infomercials, and the founder of Black Gold Cooperative. After spending the majority of his life searching for the mythical Dreamstone, Lord acquires it and uses it for power and personal gain. What you'll see and notice about the film and the story its trying to tell is that it's about greed, fitting then as it is now.\n\nKristen Wiig portrays Barbara Minerva / Cheetah who are an insecure geologist and gemologist who befriends Diana before becoming imbued with mystical abilities that gradually transform her into an apex predator-like superhuman, Cheetah. Seeing Kristen as Cheetah was one of the highlights, she was perfect for the role and made the character justice.\n\nChris Pine returns as Steve Trevor and it was everything I wanted for the character, I'm glad he could come back. Great performance.\n\nThe fight sequences aren't bad, they just aren't exciting and engaging enough. I want to say this though, I have respect and appreciate the work Patty Jenkins placed into the action sequences and lack of violence, it fits with Wonder Woman and the tone of the movie completely. What I love with the action sequences are the choreography and the use of Wonder Woman's powers and skills, Gal Gadot is amazing.\n\nMatthew Jenson was the director of photography and he's an acclaimed cinematographer, his work in this film doesn't go unnoticed. The cinematography is incredible and one of the highlights of the movie, as it's so pleasant for your eyes.\n\nThe musical score by Hans Zimmer is hopeful, powerful and brilliant. Perfect return to the superhero genre.\n\nSome final thoughts about the ending, no spoilers. I found the ending to be perfect, and I'm so glad there weren't a cgi boss that Wonder Woman needed to beat as that would have destroyed the themes and tone of the movie, it's the one thing I disliked about the first film, how there had to be a cgi boss battle. The ending was perfect and they have set up some very nice things for the third installment, I hope Patty Jenkins brings in Donna Troy as a new character."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "nil_park",
        "review_rating": "3",
        "review_title": "Had this movie a director?",
        "review_detailed_main": "I mean, guys, this movie had a proposal at the beginning: make us swollow down girl power. Ok, I don't like this kind of stuff because everybody has the right to be what they want to be and I don't need a movie to show me that. But at least it had a point at the beginning, and I was ready to take it.\n\nBut as the plot goes on, the movie becomes boring, with empty attempts of comic relief, and worse, it felt like the director took vacation and let everyone take decisions. Seams Patty Jenkins told the actors \"you are great actors, act like you'd want to\". So the VFX supervisors took her exemple and let the VFX team do what they pleased: No sense good-looking CGI (I don't even know that could exist such thing).\n\nThere was a time the movie started giving me too much information, too much supernatural rules like a very bad RPG master who wants to fill up the story.\n\nI WON'T EVEN SAY ABOUT WRITING MISS JENKINS & GEOFF JOHNS!!!\n\nIn short, it's a miserable fail with a big potential. I had everything to redeem the first movie, but writers and director couldn't deliver it. I KNOW there's the fact of COVID-19 and all, but I won't refresh on my opinion. It's sad how a full star production could be so misused.\n\nI feel sad about Chris Pine, Kristen Wiig and Pedro Pascal who are great actors. I feel sad specially for Gal Gadot who took part on the production in addition of being a phenomenal artist. This movie was a disrespect for the main acting team's career."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "brandie_loca",
        "review_rating": "9",
        "review_title": "Don't overthink things... comic book fans will love",
        "review_detailed_main": "If you ever read the comics, you'll love this movie. Seeing Cheetah played on the big screen was awesome. Yes there are some times the CG doesn't keep up. The pace of the movie seems like there are moments where things aren't explained and others where things are overextended/over explained. But to sit back and watch Gal Gadot in her WW role is amazing. Chris Pine as Steve is exactly how you want him. Handsome, cynical, and ready to defend the one woman who has his heart. Kristen Wiig truly captured the essence of Cheetah and her insecurities. I wish there were more of her and Diana to really show the comic book side of things. But..Pedro Pascal was loving playing Max Lord and it came through. Overall is was truly a great movie. Already watching again... DO WATCH THE END CREDITS!!! It's sooo worth it!! I was jumping up n down seeing my childhood WW show up! Ready to watch again."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rsduffie",
        "review_rating": "7",
        "review_title": "Would you like some cheeese?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "guisreis",
        "review_rating": "5",
        "review_title": "Embarassing soap opera with shallow self help and awful script",
        "review_detailed_main": "In the first 11 minutes, we see a child Diana having a great performance in a kind of Olympic Games of Amazons. Well, that was promising enough... Then, things change and we see for five minites adult Wonder Woman saving the they in a shopping mall. Despite some nonsense action scenes with the lasso, it seemed that the movie would have a vintage old-school superhero approach, what could also be very interesting. However, after that, the real film began as what it would be until the end: an embarassing and silly soap opera with poor script, a lot pf shallow self-help and inconsistent superpowers and magic. While both villains are ridiculous, the idea of Diana's dead lover possessing another man was even much worse! Script is not only cheesy as the worst cliché romantic comedies, but also quite lazy, as the evil rock of desires makes obvious. Cheetah's uprising, the invisible plane... everything had a bad and unintelligent explanation in the story, or simply was not explained, such as the weird flight (was that Supergirl?! Is that Hawkgirl?! I thought it was a Wonder Moman movie!). To resume: awful blockbuster. Gal Gadot also looks better when she is in superpower action full of CGI than when she is actually acting."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "fishermensmell",
        "review_rating": "2",
        "review_title": "Poorly drawn characters and incoherent storytelling results in 150 interminable minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "threefive-37405",
        "review_rating": "",
        "review_title": "A Big Budget B MOVIE!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "JasonXIX",
        "review_rating": "7",
        "review_title": "1984?",
        "review_detailed_main": "Unfortunately this film probably won't live up to most viewers expectations. The first Wonder Woman film set a precedent, and actually had something fresh to say. WW84 feels like a sequel that had to be made, to capitalize on the huge box office of the previous film, even though there was no more story to tell.\n\nAlso, was there really any reason for this movie to take place in 1984? Other than trying to capitalize on 80s nostalgia, this movie's story could have happened at any time. The only link I can see, is this movie had a campy feel, similar to the Superman sequels of the mid-80s."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "johnrjex",
        "review_rating": "1",
        "review_title": "Worst movie I have paid for in a while!",
        "review_detailed_main": "No real story. All over the place. Boring. I wish I burned my eyes out before watching this dumpster fire. I can't unsee it! My wife and I love movies. We talked about it all the way home and neither of us could think of anything good to say. The pandemic has nothing on this movie!!! Awful! I wish I could give negatve stars."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bannerninja",
        "review_rating": "7",
        "review_title": "Don't understand the hate this one is getting - perfectly fine Wonder Woman movie",
        "review_detailed_main": "I must say I was somewhat tiptoeing in to seeing this and grabbed it when iTunes has a special short-time price. Overall - I gotta say I don't get the hate here - this cannot be over the movie.\n\nThat a relic from the gods is found and wrecks havoc, demanding hard choices and sacrifices to overcome the challenges and save the day - that is core Wonder Woman stuff.\n\nI was happy to see Chris Pine return, even in a roundabout way, as he and Gal Gadot has absolute perfect on-screen chemistry and just seem to bounce off each other like choreographed.\n\nAnd their relationship also is a great vehicle for exploring the absolute core of Wonder Woman - and perhaps that is what is throwing people off here; this is not another movie of Wonder Woman kicking ass, but rather finally facing up to having locked herself away from the world and what it is costing here - there are some serious leaps of growth as a character and I certainly hope to see Gal Gadot return to this role; albeit, I would appreciate a third movie with some more omph! :)\n\nThe ending of Max Lord is perhaps the weakest point in this movie - without spoiling everything, I think he gets away too easy, that feels definitely unsatisfying."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Odintodd",
        "review_rating": "2",
        "review_title": "Resembles a made for tv children's movie",
        "review_detailed_main": "What a joke of a movie 2/10 . It was like watching a made for TV children's movie from the 90s, bad editing, bad CGI, bad script, and the Plot was RIDICULOUS."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "ChrisinDesMoines",
        "review_rating": "6",
        "review_title": "Not great but not deserving of the bad reviews",
        "review_detailed_main": "Maybe it's because I'm biased, I admit that I've been a DC comics fan (and it's movies/TV shows based off of their characters) since the 70s. Running home from elementary school to watch Batman with Adam West and waking up early Saturday morning to watch Superman George Reeve. When the Wonder Woman TV show with Linda Carter aired, I was all in and one of the privileged that saw Christopher Reeves wear the red cape with blue suit.\n\nOverall my opinion regarding the DCEU has been mixed, I didn't like Man of Steel as much as the movies from my youth, a \"darker\" Superman just doesn't sit as well with me as the darker Batman does but the attempt to remain faithful to the original look and feel of Krypton was enough for me to look past it. I enjoyed Wonder Woman but didn't much like the WWI setting because it's contrary to the origin story, but suspect that it was in large part to set it apart from the recently released Marvel superhero movie set in the same timeframe, so again, it was enough to get me to look past it.\n\nI genuinely like this movie, plot is new and fresh along with injecting a deeper moral tale to not take short cuts because when you do it will cause you problems down the line. Admittedly, most of my knowledge about Wonder Woman is based off of the 70s tv show and the animated Saturday morning Superfriends or DC animated cartoons of recent years so I'll need to defer to my DC comics colleagues with more knowledge of the source material to provide accuracy details in that department.\n\nI do think it's a decent entry into the DCEU franchise and moving it into it's current direction, which overall I agree with. Aquaman and Shazam both fits nicely in this continuity and soft reboot direction. Action is good, special effects could be better but not distracting and acting is consistent with the previous movie. Not getting the \"Trump\" reference I'm reading in other reviews, but truth is that I put the blame for those criticisms on Hollywood and professional reviewers, not on the individuals who are seeing it. Far too often Hollywood and professional Journalists inject so much political b.s. into the movies that if you see an African American actor playing President it's just assumed that it reflects how that producer views Obama and now if you see a blond funky comb over it's assumed to be Trump. Hollywood and Journalists both need to get a grip and return to Earth.\n\nIf you liked the previous Wonder Woman film or the Aquaman and Shazam movies, you'll like this as well. Again, not as solid, but a good follow-up to the Amazon princess."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sedtnksfq",
        "review_rating": "1",
        "review_title": "No need to \"Wonder\"",
        "review_detailed_main": "Everything that makes a movie terrible. Slept 10 hours before watching this and this film put me right back to sleep. Also, a lot of pot holes"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "chimera-sg",
        "review_rating": "8",
        "review_title": "Worth it in the year of Covid",
        "review_detailed_main": "One needs some positivity this year. Yes the movie is long winded. Yes there are flaws. But we can all do with some cheer. Overall, the movie works. Especially love the focus on relationships which often lacks in superhero movies."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "alternative_lifestyle",
        "review_rating": "6",
        "review_title": "Not great, but still a decent film.",
        "review_detailed_main": "This film doesn't deserve so much backlash as to be fair I've seen worst films and this isn't one of them. Some scenes were better than others, but it's still a decent film and got a pass from me."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jake8278",
        "review_rating": "1",
        "review_title": "Hot Garbage",
        "review_detailed_main": "I was looking forward to seeing this, but I was more than disappointed. The script of this movie is the most atrocious thing I have ever seen. I will briefly review the storyline so that spoilers are not present.\n\nOpening scene: (shown in ads, so not a spoiler) Wonder Woman's early years in a competition. Completely unrealistic that she is beating adult women in an olympic thing complete with horse racing and parkour. Then it turns into a goofy moral filled ending of the competition. You are wanting more of her early life story, but then it skips right to adulthood.\n\nThe problem with the rest of the movie is that it has ridiculous amounts of filler. It will spend 10 minutes straight acting as if the main pot line is not there. Stupid things like the mall scene, attacker scene, love story scene, etc. It is like lots of small cut scene movies chopped together. Then you got Pedro Pascal doing the main plot line of the movie the whole time. Pedro is simply not a good villain. It is so laughably bad, but they dragged the movie on for days. It's as if 3 separate movies were made about each main/supporting character and they pieced them together in the editing room. The action scenes randomly appear in the movie, but then they quickly end and go back to the random story lines."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "richardblake314",
        "review_rating": "1",
        "review_title": "5 years + 200 million dollars = a horrible movie?",
        "review_detailed_main": "This movie should've had audiences cheering! There's just no excuse for how much of a mess this entire movie was. It's Wonder Woman, it's colorful, its the 80's, it cost a fortune - so why is this movie no fun? Unfortunately, it's just bad, uninspired storytelling."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bobwroe-48970",
        "review_rating": "",
        "review_title": "Utter, utter dross.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "BennyBunny03",
        "review_rating": "7",
        "review_title": "Diana Still An Outsider",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "savior-11",
        "review_rating": "1",
        "review_title": "Just terrible, terrible!",
        "review_detailed_main": "I thought that the first Wonder Woman was bad, but was I ever wrong.\n\nWW84 is just God-awful. I'm sorry.... I just don't even want to think about it any longer."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "6",
        "review_title": "Wonder Woman 1984",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jonathansanchez-73184",
        "review_rating": "1",
        "review_title": "One of the worst films ever made",
        "review_detailed_main": "Nothing about this film worked. Complete disaster. Loved the first one none of the magic of that film made it to the sequel.\n\nThe 80's look fell flat, characters and dialogue as well. Action sequences looked fake or just dumb. How did such a pile of garbage get made?\n\nI feel bad for all the talented people that had to get on this crazy train. Poor Chris Pine can't get a break great Kirk and Jack Ryan but both franchises fizzled out. Now he is part of yet another failing brand."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "dperrine-02080",
        "review_rating": "7",
        "review_title": "Need the opposite of a directors cut",
        "review_detailed_main": "Really enjoyed the film. Pedro and Gal steal every scene and Chris and Kristen have great supporting roles. Only issue is they wanted too much and should have shortened it by 30 minutes. Especially since I was at home watching release day some of the longer scenes got me looking at my phone. Acting was great. Liked the story honestly. Just tooooo drawn out at times."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "obiektywny",
        "review_rating": "1",
        "review_title": "Total brain wash",
        "review_detailed_main": "I've decided to sign in for this movie. It was so bad. I lasted whole 10 minutes. Even my kids were bored and I was jist disgusted. I can't believe that such a bad movie is alloud to release. There shouldnbe some commission cancelling such a pointless brain washing peace of ..."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "whosjohnny-148-605982",
        "review_rating": "9",
        "review_title": "With all the senseless ranting negatives, here are what's good about story of WW84",
        "review_detailed_main": "Look everywhere you see nothing but plethora of 1 star reviews, ranting, complaining and just really boring and non-intelligent rambling.\n\nI don't disagree to majority of the complaint but they're not to the intensity of deserving a 1 star review, a more appropriate be a 6 or 7 stars.\n\nWhat's good about the story of WW84? There are lots actually.\n\n1. I love how the movie explore the aspect of an inner demon, which is ourselves and our desires and wants. Ancient teachers have taught us that to seek answers, look within and to Know Thyself. Why? Because we are our greatest enemies.\n\nThis movie explore the danger of our desires and the harm we unknowingly can hurt our close friends and love ones. I thought this movie is awesome in that regard!\n\nWW84 truly lives to the feminine aspect of looking inward to ourselves, are we truly honest with our selves? Or are we pretending to be someone else we're not just because of fear or ridicule or what others may think? WW84 is an amazing movie to explorer such depth that not few Hollywood movies today do.\n\nAnd WHY AM I THE ONLY WHO SPEAKS OUT ABOUT THIS? I'm sure there are supporters and fans who may be too afraid to speak when they see plethora of negativity.\n\nWELL YOU SHOULD ALWAYS DO THE OPPOSITE when you see majority of the \"herd mentality\" like feral pack animals going in one direction, SMACK THE S out of THEM and wake them up. Tell them they are not the Borg, they are not ONE MIND being programmed like zombies and RESISTANCE IS FUTILE is a lie because RESISTANCE always beings about PROGRESS. LOL.\n\n2. There are many positives but I'll just make 2. The solution to our world's biggest problems sometimes DO NOT rely on an single INDIVIDUAL or a single HERO or HEROINE. The greatest message WW84 gives me to and I'm sure millions of fans out there is this MESSAGE - YOU AS AN INDIVIDUAL, you may see yourself as just one person and that your thoughts, your actions DO NOT matter. But WW84 is here to tell you, you as an individual - without super powers - your thoughts and actions -DO MATTER!!! Collectively billions of minds added together, if we all believe OUR thoughts, OUR actions matter, then combined the POWER is greater than any single HERO or HEROINE can do. Also WW84 is also trying to say - that LEADERS and HERO/HEROINE greatest task is to EMPOWER the individuals that their voice, their vote matters. That their thoughts and actions matters.\n\nJust these 2 points along makes WW84 a GREAT movie. Plus what's not to like about the beautiful Gal Gadot? The golden armor is just spectacular - really love it. Like Nephilim or Cherubim, the golden arc wings of angelic being of high heavens. Ah - so majestic and beautiful AND powerful.\n\nThink positive guys/gals - for the world need positive thinkers to push society forward."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "thepriceofpayne",
        "review_rating": "6",
        "review_title": "It's the 80s Man!",
        "review_detailed_main": "The long anticipated \"WW84\" is finally with us on the big screen and small screen no less, after numerous delays due to the coronavirus we can all finally enjoy seeing DC's blockbuster. But how does it stack up? Well, it's a bit of a mixed bag (but in the best way)! Patty Jenkins and Gal Gadot return and it's no secret that they know what they're doing, Gadot has shined from the moment she stepped foot into Wonder Woman's boots and Jenkins clearly has a love for the character (not to mention a talent for directing), aside from Gadot, everyone acting in this film is on their A-Game. Chris Pine returns and continues his wonderful chemistry with Gadot, while newcomers Pedro Pascal and Kristen Wiig are just performing their hearts out and clearly having a great time. The 80's setting is also a welcome addition, I tend to be a sucker for this period in film and this was no exception. So the acting is great, the direction phenomenal, and the setting fun and colorful. What's the problem? Sadly, the script. While I feel like this movie captures Wonder Woman's spirit it's sadly not very well written. The plot can at times feel zany which is not a problem as it is a superhero film, but the dialogue doesn't help the fact. The entire film feels reminiscent to the 90s Batman movies (With Kristen Wiig's character clearly taking on the Poison Ivy/Riddler role). I wouldn't complain so much but this is coming off the heels of a spectacular first film and that script was actually quite good in terms of story and plot. While one could argue WWI is a darker tone than 1984, it just feels like this movie has a lot going on and the way they speak doesn't I can't keep a straight face. At the end of the day, this is a fun and inviting sequel to its predecessor that has great performances and phenomenal visuals, even if at times it can feel a bit bloated and strange to listen to. I'd gladly watch this film again, but I'd be lying if I admitted the first wasn't better. Also stay tuned for the after credits, for quite a fun surprise."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "mgazintshangase",
        "review_rating": "3",
        "review_title": "Boy oh boy...",
        "review_detailed_main": "I don't even have the energy to write this review. I just wish I could get the 2 hours of my life that I lost to this nonsense."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "alexkatsoulas30",
        "review_rating": "2",
        "review_title": "How to destroy a Super Hero, even though she beat her opponent",
        "review_detailed_main": "Silly and cringeworthy lines that probably took all the actors' talent to keep them watchable, certain periods of mediocre acting and hundreds of plotholes when it comes to the scenario and the action scenes, the super powers etc. I won't repeat what has been stated probably hundreds of times before here. Really bad effort, Wonder Woman probably wonders how this left the production stage..."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rcarrollo",
        "review_rating": "7",
        "review_title": "Not a masterpiece, but not as bad as people are saying",
        "review_detailed_main": "I really think 2020 has just turned everyone into pessimistic bafoons. Can people not just enjoy a movie anymore? Does everything have to be a cinematic masterpiece? I literally keep reading reviews picking apart the 'reality' of a superhero movie!! They are freaking superheros!! What part of that made you think 'hmmm... this movie should be completely realistic to real life'??? Turn off your pessimism and enjoy the damn movie. I always thought that the first movie was a bit overrated, I liked it, but everyone was going gaga over it. I don't think this movie was one bit better or worse than the first one, I actually thought this one had a better villain. Yes, it's full of self righteousness and yes the opening mall scene was very cheezy, but overall I enjoyed it for what it was and I don't think it makes me feel any better or worse about the franchise as a whole."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "imalkhamis-59663",
        "review_rating": "2",
        "review_title": "Bsd",
        "review_detailed_main": "Bad movie. Graphics, story and production are worst than the previous one."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "amyklotz-38700",
        "review_rating": "7",
        "review_title": "Great escape! WW remains the best!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "heathy-26035",
        "review_rating": "3",
        "review_title": "Yikes",
        "review_detailed_main": "I enjoyed the first movie. Gal Gadot is excellent as the golden hearted heroine in both films and is 3 of the 3 stars I gave for this stinker. Wow, what a lame story- just to crowbar in you know who it seems- why isn't someone somewhere saying no, this is rubbish! before it even gets off the ground? They tried to take what was good from the first movie but just ended up producing some crappy cheap fast-food version. McWonder Woman. I feel sorry for the actors. I remember seeing the main bad guy in the Buffy the Vampire Slayer series. So this jobbing actor gets a big-break in a blockbuster movie scenario and it's this one. Really not worth your time, watch something else."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Weirdo-Magnet",
        "review_rating": "6",
        "review_title": "I've seen better, but it wasn't THAT bad",
        "review_detailed_main": "This Movie wasn't brilliant, but it wasn't as bad as some of these reviews are saying it is. I will admit, there are some very cheesy moments, and at one point, I was thinking \"ok something needs to happen now\". But it wasn't a terrible movie. Some of the action scenes were good. Not brilliant, but good. I actually liked the female villain, but she would have been so much better if she was an Apex predator from the beginning. Instead, they decided to add a bit of dark eye make up and longer hair to make the character look stronger, and edgier. meh. just make them fight already! I wouldn't recommend paying for it. but give it a watch. Its not THAT bad."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "paulbertolish",
        "review_rating": "3",
        "review_title": "A bad film to watch even during quarantine",
        "review_detailed_main": "This film is so inept that it's a truly waste of time to watch it even while doing quarantine. Very badly written, slow, just a few action scenes, ridiculous characters, lack of depths, things that just don't add up. The first hour feels like two.... There's nothing here worth watching. Maybe just the beauty of Gal Gadot. Terrible sequel to a promising first franchise film."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "gerardo-28620",
        "review_rating": "9",
        "review_title": "A smile lights up the screen",
        "review_detailed_main": "The film seemed very good to me, although not excellent. The narrative may seem a bit slow, but necessary. Gal Gadot perfect in her role, the expressions on her face and the physical strength she shows, are totally believable. The movie has a good pace, but it could last 15 minutes less and no sequence of the story would be missed.\n\nWhat I liked the most, obviously, the protagonist, with that smile that floods the screen, and makes the rest stop mattering. It's worth it, enjoy it."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "craightfc",
        "review_rating": "7",
        "review_title": "Not as bad as they say...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "c-m-f",
        "review_rating": "2",
        "review_title": "Turns out wonder woman is a rapist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "shawnyu64",
        "review_rating": "",
        "review_title": "Too much on the plate, even for 2 hours 35 minutes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "Benjamin-M-Weilert",
        "review_rating": "6",
        "review_title": "A fairly standard superhero film that doesn't lean into much of its era or characters.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jamericanbeauty",
        "review_rating": "1",
        "review_title": "Unless WW3 is written and directed by William Moulton Marston and H.G. Peter, I'll skip it..",
        "review_detailed_main": "I will settle for Zack Synder. After seeing WW1984 tonight, I will never watch anything with Patty Jenkins' name on it. Pedro Pascal is awful. He was awful in Kingsman 2 and he's a cringeworthy cartoonish mess in WW1984. A good director would have reigned him in. Please keep Prince Oberyn out of movies. If we want to see Kristen Wiig, we'll rewatch Bridesmaids. Hollywood, please stop casting Kristen Wiig. She is badly miscast in WW1984. She looks uncomfortable and lost. Please Stop Resurrecting Steve Trevor. Gal Gadot is a very likeable, gorgeous, strong lead. She deserved a better movie, not this overindulgent, bloated, chaotic mess. Wow, it was unbelievably bad"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "PaulJurma",
        "review_rating": "6",
        "review_title": "Don't watch the ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "thatchermacdonald",
        "review_rating": "1",
        "review_title": "Bad script, plain & simple.",
        "review_detailed_main": "Really bad story, plot, writing; no point going any further than that. First four minutes was the best part, no wonder they used as a teaser. The movie was doomed after that due to the script."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rlgoodridge",
        "review_rating": "6",
        "review_title": "Too much talking, not enough action!",
        "review_detailed_main": "To make my review simple, my problem was there wasn't enough action. I usually love dialogue and I critique movies for not having enough of it but in this case, there was way too much talking. To make matters worse, the dialogue wasn't all that engaging. I just don't think every thing needed to be explained, we the viewers can get messages through the actions of characters. I adore Gal Gadot and I think Gal did a solid job as Wonder Woman. She embodies the principles of Diana Prince. I loved most of the action sequences in the movie but they were too far and too few. I can only speak for myself but when I watch a superhero movie I want to see the superhero using their powers most of the time and it wasn't enough of that in this movie. With all this said I really hope to see a third film. As I said before I like Gal and I think she does a good job as Wonder Woman so I have faith, with better material she can deliver an amazing performance."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "captainsavi",
        "review_rating": "1",
        "review_title": "Pure Garbage",
        "review_detailed_main": "How can the first one be so good, and this one so bad. Yeah, I wanted to walk out on it but I watched it at home."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jeroenk",
        "review_rating": "9",
        "review_title": "Very good sequel, but missing something.",
        "review_detailed_main": "It was a very good movie. For me, it came very close to the first one, but it was missing something. Still overall I think Patty Jenkins and Gal Gadot did a fantastic job with a sequel full of heart, humor and awesome action. It also has a very great message about wishing. I also thought the villains of the movie were very well done. Pedro Pascal and Kristen Wiig were very good as Maxwell Lord and Barbara/Ceetah. So I really recommand it if you loved or liked the first one."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "anniebhat",
        "review_rating": "7",
        "review_title": "A good one-time watch. Don't listen to those giving 1 star rating!",
        "review_detailed_main": "Movie was a decent watch, a bit lengthy, but acting is good and gal gadot looks gorgeous as always. Logic is out of question as in most superhero movies. Ut it's not bad at all. Looks like a planned mass voting of 1-2 ratings by DC's competitors."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "TeaLeafOnTheWind",
        "review_rating": "1",
        "review_title": "Embarrassingly awful",
        "review_detailed_main": "The writing was that of a fourth grader's school assembly. The design was absent from the story. The story made no sense in any way whatsoever. It was so long. So so very long. These were good actors giving the worst performances. The editors and director should be apologizing to the actors for choosing these takes. The concept was dumb and inconsistent. The extras felt like they were told to ham it up. It held up every awful stereotype. The relationships felt like most of the people met that day, and were uncomfortable around each other. It was not even fun. It had a couple of decent nonsensical action scenes, but the constant shift in her powers, and the overuse of the lasso were unflattering. I am embarrassed for everyone involved in the decision making for this film. The first movie was so good - and this was no just a bad sequel, but the worst superhero movie I have ever seen - and I have seen almost all of them. I often get accused of being too easy on certain films. I would maintain, the above is STILL going easy on this film. Horrendous on every level."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sitegeisha",
        "review_rating": "1",
        "review_title": "Honestly created an account just to warn to others",
        "review_detailed_main": "My kids couldn't watch the entirety of this movie, two of them wandered off mid movie! Spend your money somewhere else, wish I could get a refund."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "mcsnygg",
        "review_rating": "",
        "review_title": "Painful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "yunusknudsen",
        "review_rating": "6",
        "review_title": "What did I just watch?",
        "review_detailed_main": "I mean, there is no doubt Pedro Pascal is a brilliant actor. Or atleast in my opinion. The screenwriting is just lazy, the CGI is not in the standard of a DC movie, character development... meh. I just feel like this movie would've been great but just not as a Wonder Woman movie. Maybe another scenario where the concept of this movie happens (there is one by the way called Absolutely Anything (2015) ). I feel like Pedro Pascal dominated the entire movie with his acting and his perfect screen time. If you are looking for something out of the comics, don't. If you want to waste time, yeah maybe why not. You get bored time to time with very little action throughout the movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "crom-dubh",
        "review_rating": "6",
        "review_title": "Since y'all can't actually be bothered to write a real review..",
        "review_detailed_main": "So this movie isn't anything special. I usually don't write reviews for films that are neither terrible nor great, but looking at all the \"reviews\" here, it's a little disgraceful that no one can seem to actually articulate a complete thought about it.\n\nYes, this did feel rather cheap compared to the first movie. The effects and overall production just felt a little shoddy. There are parts where Gadot is swinging from her lasso where it looked like circa-1984 green screen work.\n\nThe writing is kind of a mess and doesn't feel very inspired. We just kind of skip from one thing to another and there's little cohesion from scene to scene. There are a lot of obviously unlikely or impossible things happening without any attempt to justify them. Yes, this is kind of typical of a lot of movies, but here it's so unabashed and they're not even trying to employ misdirection or anything to make it less obvious.\n\nI would say overall it does manage to be at least a little entertaining though. Pedro Pascal and Kristen Wiig are the stand-outs here. I think both do a good job with what they're given. Yes, the acting overall in the film is a little substandard, but I wouldn't say there are no redeeming performances.\n\nSo, yeah, this was a little bit of a disappointment after the first film (which wasn't perfect either), but I think the poorly-expressed vitriol you see being directed at it is rather hyperbolic."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "jeffnugget",
        "review_rating": "2",
        "review_title": "Probably the worst modern superhero movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sefquin85",
        "review_rating": "7",
        "review_title": "Solid Movie",
        "review_detailed_main": "This is a solid movie, had a very great 80's feel to it. Reminded me of the Richard Donner Superman movies. Beautiful in 4K, stunning color. Pedro Pascal acted his heart out and Kristen Wiig did well as Cheetah. I watched it 3 times...."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "biff-23",
        "review_rating": "1",
        "review_title": "Just Terrible",
        "review_detailed_main": "Outside of the opening, this is one of the worst movies I've seen in a long time. Gadot and Wiig are both beautiful strong women that are wonderful talents but even they have to have a plot to work within. This movie is a train wreck ten minutes in to finish. Just terrible."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "bhanu-theja-p",
        "review_rating": "8",
        "review_title": "A very heart warming movie",
        "review_detailed_main": "I understand the negativity spreading around this movie, less action, long movie and all. But I enjoyed it very much, its a not regular routine type of super hero movie, this carries a very strong message and also it shows how a hero can make difference through their words and good deeds, the actual meaning of a hero. Yes this doesn't stand upto to part 1 and didn't connect emotionally as much it did in the last act of its predecessor. Having said that this definitely a good movie, children will love it and learn from it as well. Trust me this will get more praises when times passes. Yes the action could have been a lot better, the over usage of Laso of truth was bummer."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "matt_jacobs1",
        "review_rating": "6",
        "review_title": "From a huge DC fan!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "faerysoff",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Most of the budget went to the Gadot and her makeup. Special effects at the level of the 2000s. The plot is just terrible. This is the final of Gadot's career."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "rwalk-2",
        "review_rating": "1",
        "review_title": "One of the worst movies I've ever seen",
        "review_detailed_main": "2 1/2 hours of complete garbage. It was boring and slow, the few times there was any action it was poorly executed and the CGI isn't good at all.\n\nI find it ironic that I scrolled the reviews for 5 minutes and saw nothing above a 3 star rating yet this movie still has a 6."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "czechmike",
        "review_rating": "",
        "review_title": "Horrible Storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "akashvermaab",
        "review_rating": "7",
        "review_title": "I think my aspirations is so high",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "sblewis-34729",
        "review_rating": "6",
        "review_title": "Great Sequel",
        "review_detailed_main": "Worth the watch, great sequel. I liked it better than the first"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "fbargothi",
        "review_rating": "1",
        "review_title": "Cast not engaging",
        "review_detailed_main": "Cast were not engaging, weak actors. I am sure with a few major changes in Cast this can be a sustainable franchise, otherwise in my opinion it will no go anywhere."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "6",
        "review_title": "Let's go to the 80s with Wonder Woman",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "foxtografo",
        "review_rating": "4",
        "review_title": "Poorly paced and bland",
        "review_detailed_main": "This movie could easily lose half an hour or more, but that wouldn't help very much, the main story is ok, but the writing is quite inconsistent and the pace is terrible, after the first action scene the movie drags over one hour showing long, silly and boring scenes of the character coming and going, doing nothing. When the main events unfold, it's quite a mess, and the characters keep running around like headless chicken. The action is not impressive, nothing new to see. Many things don't make any sense and I don't even want to start thinking about plotholes... Quite a mess of a movie, it does have some good moments, but it's definitely not a good movie."
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "herichbarbosa",
        "review_rating": "9",
        "review_title": "Life is good, but it can be better",
        "review_detailed_main": "Gal Gadot and Patty Jenkis return for the sequel to \"Wonder Woman\". It was one of the thousands of films that were advanced because of the Pandemic, but fortunately it was released in 2020, even with controversy, as it will be simultaneous with streaming, something new for the industry.\n\nGal Gadot manages to act and stand out here than in the first film. The two villains are well developed, the story of the two holds you back. The sequel is better than the first film. Well, here it is lighter, upward, high spirits, even with the problems that the humanity of the film faces, and we also in real life, the film brings a speech of optimism and hope. Inspiring us to be better as humanity!\n\nIt has the '80s vibe, but with the look, technologies and ambitions of the time. But, I missed the songs of the time, which was the best time to have a soundtrack. In the trailers, they put \"New Order - Blue Monday\" and it was one of the things that took me to see the movie.\n\nIt also has fan service and references according to the mythology of the heroine in the comics. And that post-credits scene was sensational, it made me tear up and vibrate, and look, I didn't even accompany this person in her time!"
    },
    {
        "movie_id": "tt7126948",
        "movie_name": "Wonder Woman 1984",
        "movie_rating": "5.4",
        "review_username": "amnatario",
        "review_rating": "6",
        "review_title": "Mixed feelings",
        "review_detailed_main": "Weaknesses - Drafty plot, the story should be better carved. Acting didn't add much to the mix. Strongs - Good, important, message. A certain level of eloquence was achieved. In the end, it wasn't a waste of time."
    }
]