[
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jodylax",
        "review_rating": "1",
        "review_title": "I want my 90 minutes back",
        "review_detailed_main": "Surveillance Vido of an Empty Parking Lot Is A More Entertaining Way to Spend 90 Minutes. 'Awful' is way too kind of a word for this piece of garbage. And to think, crew people actually had to get out of bed in the morning and waste gas driving to the studio to make this movie. A waste of time, money and effort. The only thing NOT wasted here was talent, since no talent was used in the making of this stinker. Is Paris so broke that she has to stoop this low to get some cash. Offering to water my lawn would garner Paris more respect in the public arena than what she did on screen here. I hope the studio didn't spend more than $50 on the script. If they paid more, they got ripped off."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "So ridiculously bad",
        "review_detailed_main": "OK, I'm not going to bash this film based on Paris Hilton, I admit, I don't like the girl, but I'm not going to base my comment on that alone, I think it's unfair. A lot of people are giving this movie a one just because of Paris without even seeing the movie, it gets a bit annoying. But I don't know why, I think I was just in a mood for one of those awful films that just leave a bad taste in your mouth, I think every once in a while, we need to see something like that. Now the problem with The Hottie and the Nottie, besides it's stupid title? The story, beyond predictable and hypocritical, along with the acting... it's like they just took people off the street who had no credibility to be in a film. I love how Paris Hilton isn't even the main character and yet she is first billed, you know that she paid good money for that or wouldn't be in it, big woop, her as an innocent charity loving girl, that's believable.\n\nNate Cooper is a man that just can't seem to move on in life, after 20 years he returns to his home town looking for his first grade crush, Cristabel. She's still around making men drool, but she won't go for him unless he can hook her ugly friend, June, up with a guy as well. June has bad teeth, bad skin, bad nails, bad hair, just all in all, it's bad, so Nate does everything he can to get June a guy, but it's more difficult than he could ever expect, until he finds out that love isn't everything he thought it might be.\n\nThe script is predictable, stupid, could've been written by a teenager and was very hypocritical, which you will see what I mean if you watch this movie. Now I know that they were just trying to get a big name, but come on... Paris Hilton? I actually had an open mind and just thought to give the movie a shot, but she just is such a horrible actress, like beyond horrible, I'm not just saying that because of who she is, just I know you'll believe me. This is a movie that really shouldn't have been made or if Hollywood wanted it so much, get different people, please, before they do something like cast Paris... never mind. Stay away from this movie at any costs.\n\n1/10"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Peeni_Sweenis",
        "review_rating": "1",
        "review_title": "why would you do this to people?",
        "review_detailed_main": "this movie is to say the least, one of the worst things done to mankind in the past 100 years right behind the a-bomb. I had the misfortune of seeing this piece of garbage with my sister for her birthday. I would not recommend seeing this movie even it it is for comic value of how bad it is. There are 3 scales of bad: 1. the kind that makes you laugh it is so bad (murdercycle) 2. the kind that is soo bad it pisses you off (Epic Movie) 3. Gary busey bad (The hottie and the nottie). i hated it but my sister loved it, (granted she is 12 and has down syndrome (no lie)). the fact that this movie also tries to portray a message is even worse, because i wasn't sure what it was until i did some reading.... this is perfect grounds why IMDb needs a 0/10"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "dove22309",
        "review_rating": "",
        "review_title": "But why'd they have to make her so ugly?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "printzcomm",
        "review_rating": "1",
        "review_title": "Money can't buy love or talent . . . GAG!",
        "review_detailed_main": "AWFUL!!!\n\nIf ever there was a case for barring someone from the film industry, this piece of trash is it. Money DOES NOT equate talent (or common sense in the case of Hilton).\n\nThis movie has little plot and Hilton's zombie-like \"acting\" puts the deep freeze on anything you might want to get out of the film. There's a reason the rest of the cast is made up of unknowns and little known bit players in Hollywood.\n\nThere have been some pretty dense actors through the years, but Hilton is by far the runaway winner of all time. She even believes her award from Harvard is something good!\n\nSome people learn they don't have the skills to be in the business after the first flop, or at least after the second bomb. Hilton however is obviously too blinded by her bedazzled sunglasses and purse to be able to recognize she has been in FOUR of the worst movies of all time!"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Meeker",
        "review_rating": "1",
        "review_title": "Oh my that's bad",
        "review_detailed_main": "I am just amazed that (as of this moment) there are 554 people who rated this movie a 10...\n\nI would like 10 pounds or 20 gallons of whatever it is that has warped their mentality to such a degree...\n\nActing - Abysmal to Non-existent... Script - Huh? Wazzat? Directing - Not that I saw.\n\nMy only regret is that I cannot vote less than 1...\n\nAlthough I must say that I am quite satisfied that this flick has rocketed to the numero uno spot of the bottom 100...\n\nR"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "dcinsider",
        "review_rating": "1",
        "review_title": "This Is So Not Hot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "As stupid and vein as it is disgusting, and this movie is nearly vomit inducing.",
        "review_detailed_main": "It's obvious a movie that's sole claim to fame is that it stars Paris Hilton is not going to be a masterpiece. In fact, it seems every movie Paris Hilton stars in ends up being a horrible mess, and this is no exception. The Hottie and the Nottie...let's just think about what a stupid and conceited title that is. When Paris Hilton was offered the role as \"The Hottie\" she should have turned it down, not just because the script felt like it was written by a 10 year old, but because she is playing \"The Hottie\". That sounds so conceited, especially since Paris Hilton isn't all she seems to think she is. The title is also stupid, and sounds about as mature as the actual script is, which is the maturity you might find in an elementary school bathroom.\n\nNate Cooper (Joel Moore, who seems to be a mixture of John Heder and Mike White) is dumped by his girlfriend and decides to go to Los Angeles to find and date Christabelle Abbot (Paris Hilton), the girl he was attracted to in the first grade. Christabelle is apparently so attractive that every time she goes jogging, all males stop their activities to stare at her mouth agape. He ends up becoming friends again with her, but she can't go out with him because she made a pact with her not so attractive best friend June Phigg (Christina Lakin). Nate tries to set up guys with June to get with Christabelle. As June begins to get procedures done to her to make her less ugly, Nate begins to become more attracted to her.\n\nI believe earlier I said that June Phigg was not so attractive. Well that's an understatement. The make-up people made the normally attractive Christina Lakin as nasty looking as possible, with black and green teeth stubs, a balding head, and a terrible case of halitosis. Several times I had to turn away from the screen when they would base the humor around June's hideousness, because I felt like I was going to throw up.\n\nThe script is bad, unfunny, and along with that shows no development in character whatsoever. Nate begins to fall for June, but not until after she becomes pretty. Before that, he shows no interest in her at all. He didn't even like her personality, he cares simply about looks, so if any of the female characters were like him, they would be running for the hills from this doofy looking guy. In a romantic comedy (I guess you can call this that, despite the lack of romance or humor), you'd expect there to be someone looking for their true love, but not here. It's all about looks in this superficial waste of time. Also Nate is always lying to make himself seem hipper, and ends up seeming like an unfunny version of Seinfeld's George Costanza, mixed with a lobotomized Napolean Dynamite. The plot also makes little sense. This guy had a crush on this girl in the first grade, then moved. Who the heck keeps a crush on a girl he only knew for less than a year, that barely even knew him. He thinks back to his time in elementary school and really wants to see her...she was a little girl. It's almost pedophilic.\n\nThe acting is all around bad. Joel Moore is by far the best actor, and he doesn't even deserve to play extras in community theater. Paris Hilton has an annoying flirtatious delivery of each line, and I don't think that she was told to act this way, this is just her natural acting abilities. Christina Lakin also has very poor acting abilities, but also didn't really need any. Her role is to be there and look as nasty as possible, then later to look pretty. She has few lines in comparison to the two untalented leads, especially Joel who spouts out stupid lines every 2 seconds. The back-up cast is also terrible, including one guy, who plays Nate's stupid friend, who thinks he is so cool, he's credited as The Greg Wilson, after all it's super cool to put a \"The\" in front of your name.\n\nI watched this movie, because I thought it might be one of those \"So bad it's funny\" experiences that you enjoy laughing about later with friends. This is not one of those movies. It's just bad, no wait, it's just terrible. The movie's sense of the humor is so bad, it actually almost made me feel sorry for the writer. If she thought what she was writing was good at all, then she is either completely delusional, or she might have a mental problem. I hope Heidi Ferrer, writer of this film, along with a few episodes of Dawson's Creek, will write a masterpiece and just leave this as a blemish on her booming career, but in the future not force contrived slop on the viewing public with any more screenplays like this.\n\nNow, onto the positives. The camera direction wasn't bad. It was kind of flashy and nice looking at times. The beach this was shot at looked like it would be nice to go for a dip at. I guess that counts as a positive. Paris Hilton plays a terrible character, but at least she's a kind hearted one. And that's all I can think of.\n\nIf you can't tell, I hated this movie with a passion, and from it's current ranking of number 10 in the bottom 100, I can tell other people share my views on this cinematic massacre.\n\nMy rating: BOMB out of ****. 88 mins. PG-13 for language, and crude humor."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "blooutcast",
        "review_rating": "1",
        "review_title": "How much really needs to be said here?",
        "review_detailed_main": "Just try and tell me you don't think the lead players had their roles all mixed up. Even as a tomboy on Step By Step, Lakin was a real hottie and knew how to make \"boy\" styles look cute. She deserves a whole lot better than this. Hilton's track record, on the other hand, speaks for itself. If Judge (Michael) Sauer had the power to indict her for bad acting, singing, and just plain performing overall, he'd lock the door, throw the key away, and make sure this nottie \u0096 with an Executive Producer credit, of all things! \u0096 never got out. I ragged on Madonna for her performance in Swept Away; compared side-by-side to H&N, she's Oscar material! If this aural and visual carnage never makes it to DVD or home video (trust me, it will), it'll be too soon."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "dmc-26",
        "review_rating": "1",
        "review_title": "This makes Manos seem like North by Northwest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "colinwii",
        "review_rating": "4",
        "review_title": "Not nearly as bad as the rating",
        "review_detailed_main": "This is a pretty bad movie for sure, but it's not outragously bad and actually quite an okay watch.\n\nSome funny moments here and there, simple and cliché plot. Just don't go in expecting anything else than that."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "megumi_hi",
        "review_rating": "10",
        "review_title": "I liked it",
        "review_detailed_main": "It's a feel good film and I enjoyed it. The acting isn't bad and I thought it was funny"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "beesknees2",
        "review_rating": "7",
        "review_title": "An actual review of the movie (NOT the star!)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "EdwardNashtonReeves",
        "review_rating": "5",
        "review_title": "If any popular actress was the lead, people would find it watchable",
        "review_detailed_main": "People hate Paris Hilton. Why? Because they are taught so. Because when a woman makes internet porn, she's instantly famous, yet again instantly hated. With people like Charles Manson on IMDb, the girl who shown a lot of skin and is rich certainly doesn't deserve any hate IMO. Was she Oscar worthy? No. Was the film? No. But it is a watchable, nice film, and she isn't bad at all in her role.\n\nIt is actually a story about a guy who loves a hot girl (Hilton), and then gets slowly involved with her unattractive friend (Christine Lakin). It is a story of surpassing the physical stuff and loving someone for their inner personality. And it is not original, nor genius, but it is a warm and funny film. I'm certain that if some actress who is not famous for being famous is playing Hilton's role, that this movie would have like 5.0 average rating instead of 1.9. People need to stop bashing just for the sake of bashing. Bottoms Up was bad. This one is not. I would actually recommend it for a casual and relaxing afternoon watching."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "PrivateBits",
        "review_rating": "",
        "review_title": "I no longer fear Hell.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Buddy-51",
        "review_rating": "4",
        "review_title": "More \"Not\" than \"Hot\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "fjhuerta-2",
        "review_rating": "3",
        "review_title": "Even though 99% of the people voting on this movie haven't even seen it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Shazzlovesjohnny",
        "review_rating": "5",
        "review_title": "Its not that bad...",
        "review_detailed_main": "I saw it thinking it was going to be horrible..\n\nThe acting wasn't that bad in fact I was impressed. Joel Moore and Christine Lakin were very good. Paris Hilton wasn't the best but considering the expectations gave a good performance.\n\nThe plot is a bit shallow-Guy going after the hottie but has this 'nottie' in his way- but it sends out a good message.\n\nAlthough I don't think it is the best movie out there by a long shot I think if people got past the fact Paris Hilton is in it they would be pleasantly surprised.\n\nDon't judge it till you see it."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "paulFransenNZ",
        "review_rating": "4",
        "review_title": "Under-rated movie - average not not terrible",
        "review_detailed_main": "This movie does not deserve to be in the IMDb worst movie list. As of 2014 it is 3rd from the bottom. I have seen a lot of the bottom movies and this is far above them. It's still an average movie it's not a terrible movie.\n\nThe acting, directing, sound, editing, etc is fine. The story is a little weak and in some places silly, but this movie came from Hollywood so there is nothing unusual in this type of movie.\n\nThere is a few cringe moments in the movie which some people may not like but still it wouldn't drop the movies ratings by much.\n\nIn my opinion this movie gets an extremely low rating because people don't like Paris Hilton. They don't like her \"party girl\" life style and she comes across as shallow. In this movie she plays a character that is the opposite of her real life persona.\n\nSo if you don't have a problem, dislike, jealousy, envy, etc with Paris Hilton you should enjoy this movie. If you still don't like it and you want to rate it then try watching \"birdemic\" or \"going overboard\" first as these should be the standard for judging all one star movies.\n\nSo in summary; this is a below average romantic comedy. Don't expect much from this movie but I think you will enjoy it if you can see through the Paris Hilton media negativity."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "gsh999",
        "review_rating": "1",
        "review_title": "Not funny, not amusing, not even in a train wreck kind of way.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jeanette-roman",
        "review_rating": "1",
        "review_title": "Thank God for pirated movies.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "battlemetalchick",
        "review_rating": "8",
        "review_title": "Great film",
        "review_detailed_main": "I really enjoyed this film :) it certainly doesn't deserve its 1.9 rating. It was a lovely film which kept me watching to the end to find out if he ends up with one of the 2 girls. I know a lot of people will rate this as a 1 straight away because Paris Hilton is in it. Give the film a chance :) I'm no Paris Hilton fan by the way but do find it unfair people rate badly just because she's in a film. She's not the best actress but she's in no way as bad as some others out there. E.g some of these found footage films e.g Blair witch (which amazingly scored way higher than this) Overall the film had some funny moments and you get to know each character's personality and find yourself wanting the ugly girl to get a date."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "willman85",
        "review_rating": "6",
        "review_title": "A not-terrible lighthearted, brainless, and somewhat enjoyably trashy B-movie romp",
        "review_detailed_main": "This movie has joined the list of movies Considered The Worst Ever.\n\nTo me a movie is bad if it is unengaging and without worth.\n\nI have seen WAY WORSE films.\n\nParis Hilton is something of a guilty pleasure for me. I think she's matured from a tabloid It Girl heiress to a mature young woman who knows the value of her name, and is focused on building her brand. She is every bit the businesswoman that Kim Kardashian-West only wishes she could be. This movie is an artifact of that transitioning period.\n\nI therefore consider myself to be more unprejudiced and open-minded than others here. (Hindsight may also be a factor; I am reviewing this in 2018.)\n\nWhat we have here is a lighthearted, brainless adolescent romp. Joel David Moore is terrific as the lead. And Paris' acting isn't terrible, it's just fine in fact (a significant improvement over her Bottoms Up performance). An enjoyably trashy B-movie. It was after all shot in 5 weeks with a $9million budget and produced by Paris Hilton Entertainment.\n\nAt worst it's corny and very average; at best it has a little heart and charm. It is definitely nowhere near \"one of the worst films of all time\". Not even close."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "denismou",
        "review_rating": "1",
        "review_title": "Don't watch more than the trailer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "burnadrenaline",
        "review_rating": "",
        "review_title": "You may think I'm crazy for saying this but...........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "ejonconrad",
        "review_rating": "1",
        "review_title": "Mental illness is not funny.",
        "review_detailed_main": "Let's be honest: rom-coms frequently celebrate really questionable values and champion behavior that would land you a restraining order in real life. If this movie had had a little bit more self-awareness, it could have been a pretty good parody of the genre, but it takes itself way too seriously for that.\n\nIt starts out by stretching the \"lovable loser\" trope way past the breaking point. Our \"hero\", Nate, had a crush on a girl named Cristabel in the first grade, then his family moved across the country and he never saw her again. Now an \"adult\" (in years anyway), he's never gotten over this. He can't stay in a relationship, or even hold a job, because he can't get Cristabel off his mind. Rather than see a therapist, he decides he has seek her out. Since Google doesn't exist in this universe, he hops in his car (which definitely couldn't have made the trip) and drives across the country to find his first grade friend, Arno. It turns out Arno has also been obsessed with Cristabel since the first grade (what are the odds?). In fact, he's been stalking her his entire life, and has compiled a full dossier with the help of his mother, with whom he lives and has a very creepy relationship. Like Nate, he appears not to have a job. In spite of his lifelong obsession, he seems to have no personal interest in Cristabel, and has apparently just been waiting around for Nate to return so he can help him win her over.\n\nHe re-introduces himself to Cristabel, the eponymous \"hottie\", by tackling her while she's jogging. Rather than macing him like any sane person, she somehow charmed by him and says the only reason she won't date him is not that he's unattractive, broke, and generally has nothing going for him, but rather that she has to find someone for her \"nottie\" friend, June, who has also been around since the first grade, and the stakes are set.\n\nIn their quest to solve this problem, Nate and Arno will establish themselves to be truly loathsome individuals, but we're meant to ignore that because of the inherent nobility of first grade crushes.\n\nIf you've ever seen a rom-com, it won't be a spoiler to tell you that Nate encounters a rival who is everything he isn't: good looking, wealthy, athletic, charming, and talented. The thing is, this guy is also at least a good a person as Nate, probably better.\n\nAnyway, yada, yada, you see the end coming a mile away, and we learn some valuable lessons about how important it is for women to be as attractive as possible if they ever want to be happy, and how important it is for men to, um...., have a pulse, I guess."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Seoulion",
        "review_rating": "1",
        "review_title": "Underrated",
        "review_detailed_main": "I was surprised to see this on the bottom 100 list, it was no way near that bad. I know that Paris Hilton is in it but you can tell from her performance in House of Wax that she can actually act, she should be seen as a proper actress for some roles. I mean nobody criticises Robert De Niro for Little Fockers because he has starred in films like Taxi Driver.\n\nAnyway, this film had quite a few plot twists that I didn't expect and the end result was pretty satisfying. It is designed for a certain type of audience but I for one really enjoyed it. I would even go as far to say that it is in my top 10 favourite films. Really, try this film or you will definitely regret it. Subtle, yet brilliant."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "totigerus",
        "review_rating": "5",
        "review_title": "5/10 About as good as any mediocre afterhours comedy",
        "review_detailed_main": "I agree with others here that say that if Paris' character was played by anyone else, the ratings would be around 5/10 which is what I rated it. You can't give this a 1/10 and give Manos: The Hands Of Fate or Orgy Of The Dead anything higher. It's just preposterous."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "kthoran",
        "review_rating": "1",
        "review_title": "I watched this and really tried to keep an open mind... and still hated it.",
        "review_detailed_main": "Where to start... I felt like the entire movie was a Paris Hilton commercial of some sort.\n\nIt's hard to ignore the camera work that used all sorts of filters to make the very average looking Paris into the \"hotty\". She is average looking at best at her current age even with special effects.\n\nThe plot was really bad even at it's most basic level. Loser dude decides to stalk his 1st grade heartthrob. Then the flip that no one saw. Puhlease, bad movie making 101. Maybe you could've had everyone ride off on horses on the beach to really make it end as stupid as the rest of the movie? This movie shows me that Hollywood is entirely f-ed up and especially when they devote the time and resources to push crap like this and actually think people will enjoy it.\n\nI would like to punch Paris Hilton in her ugly face for making and producing this self-aggrandizing turd of a movie."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "gumbyspike",
        "review_rating": "4",
        "review_title": "Truthfully...",
        "review_detailed_main": "To those who have seen or have yet to view this film.. disregard the ranking of this film. The IMDb film rating system has never been perfect. In fact, there are numerous boards devoted to the very issue. This film is no more or no less an ugly duckling story. Beauty is on the inside.. yadda yadda yadda.. you should know the drill by now. The production value was surprisingly high for what i consider a B movie. A film such as BLOOD FREAK is far worse, yet receives a 4.3 rating. HOW? I'm not here to lambaste this other film, but hope it serves as an example of the unjust ranking system. Christine Lakin's performance more than makes up for Hilton's wooden performance (does she even have expressions?) I'd say anyone can enjoy a mindless romp with this film. Not every movie need be some profound meditation on life. This film is entertaining at best and escapism at worst. While this movie isn't the greatest, it wouldn't kill you to see it. Overall Rating: 4, Mediocre"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "sisu_liber2",
        "review_rating": "1",
        "review_title": "Trashiest movie ever created / I wan't my money back",
        "review_detailed_main": "I was used to good movies and for once I wanted to view a bad movie, to see the differences. I was eager to watch a piece of crap and it seemed that the Hottie and the nottie could fulfill my desire. From its trailer I could extract the main idea : the movie sucked. No wonder it received a Razzie Award. I was sitting comfortable in my sofa and pressed the button. The movie started. After the first 2 minutes, I was wondering how many neurons i had lost. The opening showed the great \"diva\" Paris Shiton gathering all men's views. It was pathetic and totally unrealistic. I bet 10 $ that I would resist more than 20 minutes. After 10 hard to digest minutes that included horrible acting and scenes I was on the right way of getting something from this garbage: 10 $. The movie reached the climax when the main character, an unbelievably bad actor it i can't call him like this, went to a gym in an attempt to \"conquer\" the nottie. Suddenly, i heard my neurons screaming, i grabbed the 10 $ banknote and threw it to my friend. I closed the TV as fast as i could hopping that a few of my nerve cells have escaped. In conclusion, I would rather lose all my money than having to watch the WORST MOVIE EVER CREATED. 1/10 - I could not find a lower mark. Actually the movie deserves 0."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "stephenbooth-uk",
        "review_rating": "1",
        "review_title": "Abysmal (Slight spoiler for something that's covered in the 10 minutes)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "waelkatkhuda",
        "review_rating": "10",
        "review_title": "Not a Great Movie But Also Not a Bad One!!!!!!",
        "review_detailed_main": "I still remembering the first time when i saw the film in 2008 after i heard so much about it ( the worst film of the year ) so i thought i'm gonna see something you can called disaster, but it was good one making you laughing , yes there is at some points over acting from Paris Hilton especially at the party scene when she is wearing a wedding dress but for( God Sake) she wasn't that bad( remember she isn't Meryl Streep and i gave it 10 not because the movie deserve it but because to many people attacked it without any reason ( just because they don't like Paris Hilton) i hope it will get much better reviews in the future , and ask everyone to give it what it is deserve"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "spam-1164",
        "review_rating": "7",
        "review_title": "An honest review",
        "review_detailed_main": "First off, I have seen a lot of films in my time and this is nowhere near the bottom 100 in acting, plot, humour, direction, wardrobe, makeup, or anything else. Unfortunately, the sheer volume of votes by people who haven't bothered to see it means this review will probably get lost and ignored, but I think this film deserves better than it's getting so I'll try anyway.\n\nI won't go over the plot because that can be seen above, except to say that its the usual love story sort of thing. I don't think the filmmakers were going for anything mindblowingly original here, nor is that what we end up with. What we do get is a sweet and lighthearted film that takes an everyday setting and throws in some fairly normal, although exaggerated, characters and builds a simple little interwoven romance around them. From the outset it's not difficult to predict what will happen in the end, the acting of Paris Hilton isn't what I'd call good but it's by no means teeth grindingly bad either, and the characters (especially June and Johann) have been taken to the extreme in terms of looks and talent respectively but that is no bad thing. The aforementioned things do prevent you from getting fully immersed in things and you're constantly reminded that you're watching a film, but I think thats okay for something that only wants to entertain you for a while. The other actors were good, it was shot well, and the script and narrative, however simple, were well matched with the cinematography and general feel of the film. The film made me laugh several times (which is more than I can say for most recent comedies), the interactions between characters was handled well and the ancillary characters neither infringed upon the main ones or felt pointlessly lost in the background, and the direction, whilst not world class, was better than I've seen in a lot of films and no shots felt out of place or jarred you from the flow of the film.\n\nOverall, I found this film entertaining despite not being immersive or 'deep' and, since I believe that was the intention, I can't say the filmmakers failed here. I don't feel that I've wasted my time, I had no trouble watching this all the way through, and although I probably wouldn't watch it again for several years I thought it managed to lift itself above the usual standard of Hollywood films these days, if only a little. If you cant stand Paris Hilton, if you want to tax your brain, or if you want a film to get lost in then this is one to avoid, however if you've got some time to fill and you want to see something that wont weigh you down then you can't really go wrong with this one. There's far, far worse out there, trust me."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "nikkithedog",
        "review_rating": "5",
        "review_title": "Not as bad as everyone says",
        "review_detailed_main": "I am no Paris Hilton fan. I actually only watched this movie because it was rated so bad. I just had to see for myself. I'm not going to go into the plot or the actors etc...... All I will say is it is not as bad as people are making it out to be. Is it great? NO Would I watch it again? NO. But it was not unbearable to watch.\n\nI think most people voted this so low because it's a Paris Hilton movie. Why I can see that. I can't stand her myself, and she is not much of an actor.\n\nBut I have seen many movies that are way worse than this. I think right now this one is rated as the 53rd worst movie of all time. There has to be at least 100-200 more movies worse than this. Probably many more."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "eetwiz",
        "review_rating": "5",
        "review_title": "Surprisingly Good",
        "review_detailed_main": "I decided to register just to make this post. Yea I am a movie goer and IMDb is my bible so why not. I was just shocked at the range of ratings this movie received. It only reiterates the fact that we all have different opinions of what we like. I am sure the fact that Paris is in it has caused many to vote either for or against this movie.\n\nLooking at it from an entertainment perspective, I enjoyed it. Some very funny moments and a nicely hidden moral for us all to learn from. The old \"..book by it's cover..\" saying fits well.\n\nI laughed, I teared up, I enjoyed it. Give it a try, it's not Joe vs the Volcano nor Grandma's Boy. It's right in the middle."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "RLARKT199",
        "review_rating": "1",
        "review_title": "waste of time",
        "review_detailed_main": "A friend,obtained a DVD of this film.The hottie and the nottie. Paris Hilton a no actress,she may think she is. This film,bomb out after one week in the cinema's. The take,for the cinema owners was around 27 thousand dollars. Now it is on DVD. Do yourself a favour and save your money. I had to force myself to sit through this film. Because of her alcohol problems and the way she carried and boo hoo and cried on,giving the impression of being a spoiled brat,and her sexual encounter with her boy friend,on video. Paris Hilton is her worst enemy.Concerinig this film,do yourself a favour,avoid this one. This is a bomb."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Azu-Kazoo-Atoms",
        "review_rating": "1",
        "review_title": "Paris Hilton",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "LOURIP",
        "review_rating": "1",
        "review_title": "WOW I mean what the HELL",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "anna-banana85",
        "review_rating": "5",
        "review_title": "Not THAT bad",
        "review_detailed_main": "I'm not saying it was great. But it really wasn't THAT bad. I've seen a whole lot worse. For it's genre it was amusing light entertainment that was never intended to be a cinematographic masterpiece. So take it for what it is people. I think a lot of people are letting their opinion of Paris Hilton influence their opinion about the movie. To be honest, she was the thing I liked least about this movie. But I just don't think this movie deserves just a 1,6 rating. Watch the movie expecting light entertainment, and obvious humor. Don't watch it if you're expecting to do some deep philosophizing on the subtext of the plot. I just don't see what is so much better about a movie like American Pie for instance, and this one. Same genre, same easy laughs, same crap really. But it's occasionally quite relaxing to watch a movie that you don't really have a to think about all that much."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "paulabryan-teel",
        "review_rating": "1",
        "review_title": "possible spoiler, but whatever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "aaronmocksing1987",
        "review_rating": "1",
        "review_title": "Summer: Hottie. This Film: Nottie.",
        "review_detailed_main": "You want to know something? Personally I believe that if I were to be able to remake this film some 40 years for now on an epic movie scale in the vein of Michael Bay or Steven Spielberg, for everyone to see, this is how I would do it. Without a doubt, Paris Hilton would be, and should have played, the role of Nottie if this movie was going to garner any sort of attention in the mass media. That's the kind of roles she should be getting since she thinks everyone should take her seriously as both actress and a Hilton. But obviously, Paris doesn't seem to actually want to get good roles and just continue to play the part of the silly dumb bimbo who somehow plays a major role in movies as lame as this. Did National Lampoon make this movie? It almost feels like it, or all those lame American Pie continuations. Paris instead yucks it up with a bunch of other actors who really did this for a quick couple of dollars to pay the rent, perhaps. I certainly didn't find this movie any funny, nor interesting, and it was my younger sister who rented it to see how messed up it really is.\n\nAfter sitting through halfway, it got so much waves of quiet awkwardness and scorn from everyone that we ultimately returned it pretending it was scratched and unplayable on our DVD - replacing it with a movie, actually, no, instead we got a DVD containing a collection of 20 random infamous fight scenes from movies over the years: Jackie Chan, Bruce Lee, Brad Pitt, Rowdy Roddy Piper (\"PUT ON THE GLASSES!\"). It definitely soothed the soul and made us forget we ever watched a film like this ever. It's not as eyebleedingly bad as Uwe Boll, but it certainly ranks among next to it.\n\nUnless you like cruelty to people who aren't as distinguished as you are, or stress the fact that \"Girls, if you want to look good for your Boy, surgery is the best way to go,\" which is terrible to even consider even as a moral, then go ahead and see this movie.\n\nBut if you're smart, go see Star Wars or something again."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "cabkat",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "This movie is the greatest movie I have ever watched in my whole entire life. It inspired me to be different like the ugly one. It also helped me learn that it is not okay to be ugly. I want to be beautiful like the hottie. But I am nottie. I am the grossest ugliest person you will ever meet but this movie showed me how to rock it. I am the new ugly rock now. WATCH OUT WORLD. I am coming. People scream when they see me and I used to be embarrassed but now I feed of of their screams. I am powerful. I am unstoppable. I am the new nottie. I am like a fire and peoples screams are like the kindling that feed me and make me grow. I am starting a new earth where I will rule the world and the world will be a better uglier place. If you are an ugly please watch this amazing, classic, romantic, comedy, thriller, adventure filled, action packed, foreign, horror, sci fy fantasy, musical drama. You wont regret it. If you want to join me and the uglies please tell me and I may accept you into my ruling. Goodbye hotties HELLO NOTTIES."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "tonyshanahan",
        "review_rating": "7",
        "review_title": "Don't read the other bad reviews",
        "review_detailed_main": "This is not about Paris Hilton it's just a romance movie and not bad either. Give it a go better then some over hyped new movies I've watched lately and funny in most."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "mortis5555",
        "review_rating": "4",
        "review_title": "It's not as awful as the rumors",
        "review_detailed_main": "This movie is not anywhere near as bad as people have been saying. That is not to imply it's a great film or even very good, but this is not worse than, say, Catwoman (2004) for example. The acting is a bit poor and most of the jokes aren't laugh out loud, when they're even there to begin with; but I never had that sense of the movie being actually painful to watch, which is to me the real mark of an awful film that deserves to be trashed at the level this has been.\n\nThe biggest flaw of course is that the \"Nottie\", even with all the makeup they put on her, doesn't look much worse than Paris Hilton; and definitely not gaspingly ugly as she's meant to be. She looks less like a truly ugly person than like someone suffering from drug addiction. Most people see this type on the street all the time and don't think much of it.\n\nThe script is basic and predictable, but not godawful. It seems like the kind of thing that might have been a basic-cable made-for-TV type film had not Hilton gotten her hands on it."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Rockin_Joe_87",
        "review_rating": "1",
        "review_title": "All nottie, no hottie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "mehranism",
        "review_rating": "5",
        "review_title": "The reviews given to this movie has made me lose all faith in community review.",
        "review_detailed_main": "I have never watched a movie below a 7 star rating on IMDb. Never. It's my guide to ensuring time well spent in movieland. But after reading a review about this movie, the style of which indicating significant intelligence on the part of the author, I decided to throw caution in the wind and give this a chance.\n\nGranted, my expectations were a 1.5/10 (thanks to all the useless non-watcher comments) - so no doubt this has reflected a little on my surprising enjoyment of it.\n\nContrary to what I was expecting, Hilton actually delivered an above par performance. Really, there are much worse performers out there (Alba in the Fantastic Four, to name one - Alba, forgive me, yes, I know you're gorgeous and I'm free anytime this week).\n\nJoel Moore didn't do too bad either. Granted, the story line is childish at best, but really deserves a rating in the median of other garbage coming out of Hollywood these days.\n\nI'm not saying this is a must see, far from it, but it certainly isn't a 1.5/10... Come on people! Ace Ventura has a 6.5/10 on IMDb, I mean pleaaase!"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "injury-65447",
        "review_rating": "1",
        "review_title": "Physically upsetting and uncomfortable",
        "review_detailed_main": "I was curious to try this film. Part of me thought it couldn't be as bad as its notoriety suggested. I don't even mind Paris Hilton as a person.\n\nBy the time it got to the yoga scene I felt physically ill and repulsed by the juvenile meanness of this film. It really is horrendous and shamefully bad. It's a marvel that something like this actually exists. Imagine a stupid gross out comedy but minus all of the laughs. This is a truly soul destroying and disheartening movie experience."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "saskpareki",
        "review_rating": "4",
        "review_title": "its not so bad. Paris Hilton is an ok actress",
        "review_detailed_main": "I cant understand all this hate against Paris. She played really good . If it was any other beautiful american actress everybody would be giving >6 stars.\n\nThe movie is not funny enough its more like stupid enough.\n\nBut its not worth so bad reviews. It can easily get 4-5 / 10\n\nwhat do you expect to see? Its supposed to be stupid and make fun of beautiful non beautiful standards and stereotypes."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Uriah43",
        "review_rating": "2",
        "review_title": "More Repulsive Than Funny",
        "review_detailed_main": "This film essentially begins with a young school boy by the name of \"Nate Cooper\" (Caleb Guss) becoming quite smitten with a new classmate named \"Cristabel Abbot\" (Karley Scott Collins). The scene then shifts to many years later with the adult \"Nate Cooper\" (now played by Joel David Moore) having a serious breakup with his girlfriend \"Jane\" (Kathryn Fiore) and deciding to travel all the way from Maine to Los Angeles to pursue the one girl he has truly loved ever since the first grade: \"Cristabel Abbot\" (now played by Paris Hilton). However, he soon discovers that, because Cristabel is so beautiful, that there are a great number of other guys who are also quite interested as well. Not only that, but making matters even more difficult is the fact that Cristabel has a best friend since childhood named \"June Phigg\" (Christine Lakin) who acts as her first line of defense and successfully chases away all suitors with her unbelievable ugliness. So, to remedy that problem, Nate does everything he can to find someone to date June in order to spend more time with Cristabel. The problem is that this is much harder than he realizes. Now, rather than reveal any more, I will just say that, even though the overall plot was quite predictable, this film had a certain amount of potential if handled correctly. Unfortunately, the director (Tom Putnam) obviously didn't know what he was doing as he took a rather simple story and totally ruined it by making June much too ugly and disgusting to be even remotely entertaining. That being said, although I cannot fathom what his thought processes were when making this movie, what I can say is that I was pretty much repulsed by it. In short, the only reason I didn't rate this film even lower is because of a few scenes involving Nate's best friend \"Arno Blount\" (Greg Romero Wilson) which were quite funny. But other than that, this movie was an abject failure and I would not recommend it to anybody."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Jayc1601-643-779107",
        "review_rating": "4",
        "review_title": "Not absolutely horrible.",
        "review_detailed_main": "Knowing what the movie is about, if you don't automatically lower your standards, then you only have yourself to blame. Lol Watching the trailer i expected a handful of cheap, juvenile laughs, and that's exactly what i got. The acting for the most part was mediocre, but then again, i didn't watch the movie with any high hopes of anything. So with that in mind, i was not very disappointed.\n\nMy only disappointment was that the few cheap laughs dried up half was through the movie, and there was no real redeeming features left after that."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "vgezer",
        "review_rating": "10",
        "review_title": "It does not deserve to be the worst",
        "review_detailed_main": "Normally I would vote 7 for this movie, but since it did not deserve to be bad, I gave 10 points.\n\nI think it reflects a real problem in today's world, but in a funny way. It is not a time wasting movie. If you would like to laugh, I really recommend for everyone. It has a typical romantic comedy scenario. I also liked the cast.\n\nI am not professional, but I could not notice any shoot mistakes either. The location selection is also OK. The only problem I noticed was being non-continuous. This caused the movie become a kind of sitcom."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "janadrigval",
        "review_rating": "7",
        "review_title": "To see with eyes unclouded by hate",
        "review_detailed_main": "I lost my faith in humanity after reading some reviews. Has anyone of you actually watched this movie? It sure does not seem so, for it is not bad at all. Parises acting was actually rather OK and the other actors did a great job. If people write stuff like how could god let them make this horrible peace of.., it just makes me sad. Its a cute and funny movie, not better or worse than any other easy going comedy. I don't understand the hate, if its bad because they \"make fun of ugly people\" or is exaggerated, then there are movies a lot more offensive and gross than this one and they still have a better rating. You people don't forget, is not a documentary but a comedy."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Ellie0920",
        "review_rating": "5",
        "review_title": "I've seen worse.",
        "review_detailed_main": "I mean, it was an horrible movie of course, but cute at the same time.\n\nParis Hilton (who I love for being so dumb) was dreadful, and the one that played Johann too. Luckily, Joel Moore and Christine Lakins comedy skills saved the movie.\n\nI know it's not like that The Hottie and the Nottie will be remembered as a good move, but I think the reason so many people hate it is because Paris Hilton's in it.\n\nIt was awful, but it was a whole lot better than the Scary Movies (and all the ones from those writers) and A Cinderella Story. It deserves a 5 at least."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Deserves everything bad that has been said about it",
        "review_detailed_main": "I don't mean to sound opinionated here, but The Hottie and the Nottie is nothing short of abysmal. Nothing whatsoever is good about it, it is lazy, mean-spirited and unfunny and many other things. It looks alright though, some of the scenery is nice but the camera work is rushed and there are times when it doesn't feel like a movie. The music is awful, it is enough to make you want to cover your ears because it is sheer torture, while the direction is non existent. The script is one of The Hottie and the Nottie's worst assets, it is terrible. I didn't laugh once, actually I was groaning most of the time, while the story(basically an ugly duckling turned beautiful twist) is completely predictable and badly developed so you didn't care for the characters and their situations. I almost forgot to mention how hypocritical this movie is, I thought I'd seen the last of hypocrisy with The Hannah Montana movie, but the hypocrisy here makes the hypocrisy in that film seem subtle. The acting is a joke. As dire as Paris Hilton was, she cannot act if her life depended on it, she isn't entirely to blame, none of her co-stars were any good either. All in all, terrible and dare I say embarrassing. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "A fun film flick that reminds us not to judge others by their appearance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "etc_fotbal",
        "review_rating": "1",
        "review_title": "disgusting",
        "review_detailed_main": "OH MY GOD!!! I may not be much of a movie critic,but even I can tell that this movie SUCKS!it's absolutely horrible,in extremely many ways .\n\nParis Hilton shows us once and for all that she can't do anything good than sex tapes.Her acting is horrifying.\n\nIn the firs part,\"June\"has such a disgusting look that I barely made it through.Christine Lakin acts a little bit better,but she can't make much of a difference\n\nAfterwards,this is supposed to be a romantic comedy.How romantic is the fact that a guy just wants to sleep with a girl,but has to pass a monster first?The movie only gets romantic in the last part,when SUDDENLY both\"June\"and \"Nate\" fall in love with each other.How come?obviously,thanks to June's new look.HOW ROMANTIC!!!"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "artis-spertals",
        "review_rating": "1",
        "review_title": "Christine Lakin saves the film",
        "review_detailed_main": "I give 10 stars to Christine Lakin, cause she's the most beautiful woman in the world and 1 star to Paris/screenplay/all other stuff. No offense Paris, but you shouldn't be an actress.\n\nAnyway - I rolled the film all to the place, where Christine Lakin becomes herself (without the ugly mask) and now I will have to watch those 30mins for like 100 times to get enough from Christine :D Why couldn't she be 10 years younger :( Anyway - this film looks like some low-budget crap. The main idea is very good, but you should invest much more money in those kind of ideas. The only thing worth watching this movie, as I said, is Christine. Damn, she is so beautiful."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "spenserpup",
        "review_rating": "2",
        "review_title": "Extra point only for Christine Lakin",
        "review_detailed_main": "I could only stand about 10 minutes of this abomination and that only so I could see Christine Lakin on screen. Now I have to scrub my memory of this film so that I can enjoy seeing her again.\n\nI really didn't expect the movie to be any good. After all, they chose Paris Hilton to star in it and an \"actress\" with less talent than she has would be very hard to find. I really don't see how she is considered a beauty when there are so many talented women out there who are far better looking and sexier (not necessarily a matter of looks).\n\nThe premise actually isn't that bad; however, I'm not sure whether the putridity here is a result of a poorly implemented script, poor directing, or idiotic casting. It's probably a combination of the three."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Will52",
        "review_rating": "5",
        "review_title": "Worth Watching",
        "review_detailed_main": "yes Hilton is in it, and that's probably all most people had to see before they decided to rate this movie. Has any of you actually seen the movie, it's about much more than just an ugly and a beautiful girl, it's about finding someone special and looking beyond what they look like and seeing them for who they really are on the inside, and for most people doing that is a lot harder than they are willing to admit.\n\nThe point the movie is trying to make is that to find the perfect person you need to look a lot deeper than their outside to really get to know then and sometimes the person you least expect might just surprise you\u0085\n\nThe plot is simple yet entertaining; the movie would however do a lot better especially in the ratings department if Hilton was replaced by someone with a better reputation. Christine Lakin is great and for anyone who still remembers her from her start in Step by Step should see this movie. Overall the movie is worth the time you spend watching it and it is definitely better that the current overall rating of 1.5"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "A mean-spirited premise, but not THAT bad a movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "tombom-14105",
        "review_rating": "1",
        "review_title": "😱",
        "review_detailed_main": "Having Paris Hilton as the star tells you all you need to know. Easily the worst movie I've ever watched. Avoid like your life depended on it."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "momster0005",
        "review_rating": "8",
        "review_title": "Don't let the Low ratings or Paris Hilton keep you from watching.",
        "review_detailed_main": "I was thrown off by Paris Hilton and almost let this cute movie slip by. Christine Lakin & Joel David Moore were the stars of this gross at first, cute romantic movie.\n\nObviously the people giving this low budget movie the low ratings didn't watch the entire movie or have no appreciation for Romantic Romedies."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "anonjay",
        "review_rating": "7",
        "review_title": "Don't judge have a open mind",
        "review_detailed_main": "I liked it. It just got boring towards the end. It's been done before but does that make it bad.. it's got Paris Hilton in it, does that make it bad? Probably but I liked house of wax.. it's got a bad message and we all know Paris thinks she's it in real life but come on if she wasn't Paris Hilton and she walked up to you in a club you know you'd be taking her home...lady's too lol. I liked the guy in dodge ball too so 7 it is."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "countrymuzluvr",
        "review_rating": "1",
        "review_title": "Desperation all around",
        "review_detailed_main": "Production companies are desperate for blockbuster films so they think to capitalize on big name talent. (Talent, HA!) So they went out and cast Paris Hilton (That's HOT! Gag me, please) in her own movie.\n\nProduction companies are so desperate for big money movies that they move the film into quick production. It's obvious that a first day earning of 9,000 dollars isn't going to make this a box office success.\n\nI think there are just some movies that shouldn't be made no matter how frantic producers are for a hit. Other movies that come to mind are From Justin to Kelly and House of Wax. Paris Hilton shouldn't be allowed to act at all. Why kids of the US think her vapid shallow lifestyle is one to emulate I'll never know. I just pray that parents are teaching them the difference between Paris's so-called life and reality."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "ragpap93",
        "review_rating": "2",
        "review_title": "Was OK despite Paris",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "catdogmanfish",
        "review_rating": "1",
        "review_title": "RIP Women's Equality Movement",
        "review_detailed_main": "This is just bad, women should be offended that they're treated either as objects of lust or trash monsters. Men should be offended that they're depicted as mindless zombies or grade A creeps. Really everyone should be offended. Paris Hilton laments that people think she's the dumb blonde persona she maintains, well maybe prove them wrong and so something different and, I don't know, smart. The only two satisfying things I got from this movie are 1. I didn't have to waste money on it. And 2. The How Did This Get Made podcast episode is probably going to be really good because this is so bad."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "ComedyFan2010",
        "review_rating": "3",
        "review_title": "A fail, not because of Paris",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "lukkomarewicz",
        "review_rating": "1",
        "review_title": "Embarrassingly bad",
        "review_detailed_main": "This plot is so bad, illogical that it's hard to believe sb could \"invent\" that kinda foolish story. Firstly a hottie like Paris wouldn't be around a girl who's appearance would be like that also a girl who has personal hygiene big issues. They could have created quite nice script but this one is a total mistake. There are silly comedies for teens but there must be some limits of foolishness or maybe the creators targeted people with null taste regarding movies."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "KirkFogg",
        "review_rating": "1",
        "review_title": "Truly one of the worst movies ever made.",
        "review_detailed_main": "I find myself torn between giving this movie a one or a ten-ultimately I had to go with the former. On one hand, I hate myself for spending ninety minutes watching a self indulgent dumpster fire of a film. On the other hand, this movie is EXTREMELY fun to watch, and is one of my go to \"worst movie ever\" titles. I can't suggest watching this enough, but objectively it's very bad."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "whpratt1",
        "review_rating": "1",
        "review_title": "Entertaining Film",
        "review_detailed_main": "This story is about a boy who falls in love with a girl named Cristabel Abbott,( Paris Hilton) in his first grade class, the boy's name is Nate Cooper, (Joel Moore). After about 20 years Nate meets up with this Cristabel gal and finds out she is very popular with the guys but she will not date or even get married until her friend, June Prigg, (Christine Lakin) meets a guy and falls in love. However, June Prigg is not just your ordinary gal and she has plenty of surprises for any young man wanting to take her on a date. Nate decides to figure out a way in order to get someone to date June which turns into a complete disaster. If you like Paris Hilton and enjoy watching her on the silver screen, don't miss this film, it will hold your interest and keep you entertained. Enjoy."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "Absolutely ridiculous and a terrible message.",
        "review_detailed_main": "I get it that it was fashionable to trash Paris Hilton for her airhead and celebutante ways. I understand that she didn't do anything to make herself popular or shed her party girl image. And I see how people would say she's a bad role model for our youth based on her lifestyle. But none of that really should be taken into account when it comes to her acting. She is after all playing a character in this movie and not herself.\n\nBut on the other hand, she proved that she's not much of an actress and this movie was a vanity project from the start.\n\nA vanity project is something that is done for the express purpose of making somebody feel better. It plays on their status as a famous person or more importantly plays up who they are. A good example of this, other than this movie of course, is Mariah Carey's \"Glitter\" which is a semi-fictional version of her rise to fame. That too was rightfully trashed by the critics who saw right through it.\n\nIn this movie Paris Hilton plays the titular \"Hottie\" by the name of \"Cristabelle\". That's the movie's first mistake. Paris Hilton isn't that hot although if you like cocaine thin vapid airheads then I guess she's your type. But most people will admit she isn't that pretty. She has an ugly friend, the so called \"Nottie\" named \"June\" and played by the much prettier Christine Lakin in heavy ugly makeup.\n\nEnter Nate who has been in love with Cristabelle since elementary school and finds out she's single. The problem is Cristabelle won't go out with anybody until June has a date. Well what's a guy like Nate supposed to do? He'll lie, cheat and do everything in his power to get June a date just so that he can be with Cristabelle. Isn't that sweet? He tries to bribe people, hypnotize them and even convinces a handsome plastic surgeon to give her free facial work to improve her odds. What a guy.\n\nIn the end, when June has been made pretty Nate suddenly realizes that he's in love with her and they wind up together. So nice isn't it? Or at least it would be if you really thought what this movie was telling people. That is, if you're not \"perfect\" like Cristabelle then you need to literally change your face so that people can fall in love with you. It's not what's inside that counts, it's how beautiful you look on the outside.\n\nAnd that is one of the worst messages you can send anybody.\n\nThankfully this did so poorly that nobody ever asked Paris to do another movie."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "helengracebirdsall",
        "review_rating": "8",
        "review_title": "Funny",
        "review_detailed_main": "I really don't know why this has been given so many bad reviews. Honestly just give it a chance!! It's a lot of fun and very sweet.\n\nPeople just like being mean for the sake of it and it's a shame as people won't watch this because of the 1 stars. Watch it!! :)"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "rogers-beth",
        "review_rating": "7",
        "review_title": "Not hottie but not nottie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jartdm",
        "review_rating": "1",
        "review_title": "Dear God, may the person who created this aboration burn in hell!!!",
        "review_detailed_main": "Personally, I would love to arrest the distributor of the film and charge them with crimes against humanity. Nothing about this film was funny in the least bit. It did show Paris Hilton in her usual role, a stupid ho. I used to like Christine Lakin when she was in Step by Step, but I really don't know who convinced her to do this. Joel David Moore should be thankful he was in Avatar, otherwise his career would be on life support. This monstrosity of a film should be classified as a WMD. It's so bad the military should show this to those losers at Guantanamo. The terrorists would gladly talk after watching that torture. Who needs waterboarding when you have this stupid crap."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "kristoferthompson",
        "review_rating": "1",
        "review_title": "What a rip off",
        "review_detailed_main": "The most pathetic version of Taming of the Shrew you will ever have the misfortune to see. Avoid this waste of cinema at all cost."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "thesar-2",
        "review_rating": "2",
        "review_title": "Cry for Help",
        "review_detailed_main": "1st Grade? FIRST GRADE? NO ONE REMEMBERS OTHER KIDS IN THEIR FIRST GRADE AT THESE PEOPLE'S AGES!\n\nI'm okay. I don't need help. Well, maybe I do after seeing this. But, in my only defense, I only watched this trash for the How Did This Get Made? podcast.\n\nI don't think I have the patience or desire to waste too much time on how many, many, many things were wrong with this film, but suffice to say it was horribly shot with far too many unnecessary closeups, horribly written, cliched, predictable and once again shows how paper thin Paris Hilton is, inside/out. But, I will give this movie two positives, just to be fair.\n\nDespite his awful character, actor Joel David Moore *was* trying throughout and the music wasn't that bad. In fact, I kinda liked some of the catchy music. But, playtime is over.\n\nThe movie's about a shallow guy's attempt to keep a 1st grade crush alive many, many years later, but must fake like/help her purposely hideous friend so he can get laid. And you will know, from minute one, where this is headed.\n\nParis is such a distraction. From being super plastic, to existent acting to very non-existent acting, to just trying to flirt with the camera, her ever presence onscreen makes me cringe. But, she's not the only dark stain here. It's the exact same I've said about her as the \"comedy.\" This is supposed to be a comedy and I laughed not once.\n\nFine. I must be honest. I smirked once for sure, maybe twice. I never laughed. None of this was funny. I see where there's supposed to be jokes. I just never once saw one land.\n\nIf you're a fan of How Did This Get Made? and you want to see this like I did for their episode devoted to this trash, you might be pleased to know as of, at least, 1/15/20, this movie is available for free for Amazon Prime members. I'm just relieved I didn't contribute a single cent to these bad filmmakers.\n\n***\n\nFinal thoughts: Did secondary character Arno played by Greg Romero Wilson really make them list him as \"The Greg Wilson?\" Okay, fine, that might be the one joke that landed."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "NutzieFagin",
        "review_rating": "",
        "review_title": "I'll make this short and sweet....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jboothmillard",
        "review_rating": "2",
        "review_title": "The Hottie & the Nottie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "IonicBreezeMachine",
        "review_rating": "2",
        "review_title": "Paris Hilton tries and fails to headline a movie in an ineptly made Farelly Borhters knock off that doesn't understand basic storytelling tenets let alone comedic",
        "review_detailed_main": "Nate Cooper (Joel David Moore) is an unemployed failure who's just been dumped (and nearly killed) by his latest girlfriend. Realizing his heart has never been with any of his girlfriends, Nate heads to Los Angeles to find his childhood crush, Cristobel (Paris Hilton), his childhood best friend, Arno (The Greg Wilson), has been living with his mother and keeping tabs on Cristobel with an extensive filing system and reveals Cristobel still maintains a friendship with June Phigg (Christine Lakin) her ugly best friend or as Arno calls her the \"Nottie\" to Cristobels \"Hottie\". When Nate runs into Cristobel he's horrified to find she's put a hiatus on dating until June finds someone so Nate takes it upon himself to find anyone willing to date the \"Nottie\" so he can claim the \"Hottie\"\n\nReleased in 2008, the film was Paris Hilton's one attempt to headline a theatrical film following a largely forgotten and ignored National Lampoon Direct-to-Video film, Pledge This! And a supporting role in the House of Wax remake. Upon initial release the film was savaged by critics, many of whom placed it on their worst of the year lists and made a paltry $27,000 dollars in the United States against a $9 million budget. Internationally it fared little better, barely breaking $1 million. While the film is certainly a vanity project with its premise built around Hilton's \"Hotness\", it's not even a good vanity project as its completely lacking in good writing, good direction, or even a good supporting cast.\n\nThe movie's lead of Joel David Moore's Nate is easily one of the worst leading comic performances I've seen in a romantic comedy. Not only is Joel David Moore playing the pathetic loser trope up to the nth degree, but scenes of him lusting over Cristobel come off as massively creepy including a scene during the \"meet-cute\" where Nate follows behind Cristobel on her jog without her knowing and sniffing her hair. Moore has shown himself to be a more than capable comic presence in films like Dodgeball or Grandma's Boy, but in both of those he was a supporting player for a good reason. He doesn't have appeal as a leading man. Paris Hilton basically coasts off her looks not so much \"acting\" as standing in reading lines in a voice that doesn't even change octaves. Easily the worst performance in the film goes to the credited \"The Greg Wilson\" playing a creepy overgrown man-child who treats his mother like a secretary and keeps an extensive filing system on Cristobel in another misfire of a joke that feels like it was put there to make Nate look less creepy by comparison (NO! I hate them both!).\n\nSpeaking of the jokes, there's basically two types: Men stumbling and drooling over themselves as they leer at Cristobel or hackneyed gross out jokes around the character June and overdone reactions thereof. Poor Christine Lakin is clearly trying and gives the \"best\"(albeit still not great, but no one in this movie makes it out in tact) performance but virtue of at least being able to express a diverse range but is buried under overdone make-up effects and obvious facial and mouth prosthetics for the sake of stupid jokes. The movie tries to excuse its stupidity by going for a \"beauty on the inside\" type approach, but it lingers on characters being grossed out borderline gynecological shots of Paris Hilton that are so transparent that it's clear this message is about as hollow as the film's box office receipts. The movie is basically a lesser version of the Farrelly Brothers Shallow Hal which was already a pretty flawed movie in its delivery of the same premise, but it had sincerity to it that made it more forgivable. There's nothing \"sincere\" about The Hottie and the Nottie, it's a cynical attempt to ape the Farrelly Brothers style of raucous gross out humor without actually understanding why it works and instead just hoping that Paris Hilton's name will be enough sell tickets."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "alains_postbus",
        "review_rating": "4",
        "review_title": "Christine Lakin is the only thing that makes this movie watchable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "hollywoodshack",
        "review_rating": "1",
        "review_title": "A school is needed to show films like this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "vip-danii",
        "review_rating": "1",
        "review_title": "Is It Really Possible For A Movie To Be *THIS* Bad...?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "mahmoudmoner91",
        "review_rating": "9",
        "review_title": "Best of the Best",
        "review_detailed_main": "I have to tell you guys that after reading all this bad reviews about the movie, I give up and I wasn't going to watch it anymore, but after watching it, I have to tell you that it's the best of the best. The movie is telling you that there's no Nottie Girl, every girl is beautiful, but she have to look after herself and find her beauty !. This movie is really amazing and very unique!. It's about love and how to not give up on your love and try to make him/her feel that you love her/him. Try to feel this move more than watching it. I still can't believe all this bad reviews ! Go watch it and forget about all bad reviews, you will like it. \"Laugh and Feel\" .. Mahmoud Mounir"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "savagesteve13",
        "review_rating": "6",
        "review_title": "Oh come on, it was not that bad! You people just hate Paris H.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "crow30002003",
        "review_rating": "1",
        "review_title": "Hottie and the Nottie, I'm going for the latter",
        "review_detailed_main": "I have finally come across a movie that is worse than Twilight. Starring everyone's favorite talentless socialite, Paris Hilton, it's The Hottie and the Nottie. Even the title makes me cringe, so let that set a tone for what is to come.\n\nFirst off, despite many warnings from other IMDb members, I decided to give this film a shot, letting my own jokes give me a cheap thrill. I'll say this, it makes Twilight look like Star Trek. I wasn't expecting Oscar material, but boy did I get it. Even Oscar the Grouch would be ashamed to have this filth in his trash can.\n\nEnough blind insults for now, let me give you the plot (Not that you'll watch this film anyway). Basically one girl has another friend that drives boys away, and she tries to give her a boyfriend. Wow, Shakespeare himself would deem this to be a true literary achievement, he lied. It's bland, generic, uncreative, and a horrible excuse to get Paris Hilton more exposure.\n\nI am honestly astonished on how they managed to make a movie, if you would call this one, this amazingly bad. I have to ask, why isn't this lower on the bottom 100? I ask you, why? The money used to make this waste of film could have been used to feed starving Ethiopian children! A showing of this piece of festering trash would be illegal since it'd classify as torture!\n\nI implore you, unless you'd like to kill off every brain cell in your noggin, have a severe masochist fetish, or you have a thing for astronomically crappy films, do not, I repeat, DO NOT watch this movie. It's a disgrace to American cinema, and a shining example of why foreign countries want to blow us off the map."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jenny7018",
        "review_rating": "",
        "review_title": "Loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "wwe7961",
        "review_rating": "1",
        "review_title": "Very nottie indeed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "michaelm1234",
        "review_rating": "3",
        "review_title": "Yes, It was bad but I don't think it deserves to be in IMDb bottom 100",
        "review_detailed_main": "I originally watched this movie just to be able to say I have seen one of the worst films of all time (I expected to watch half of it then get bored and turn it off) but although this movie wasn't good it wasn't half as bad as I expected it to be. The acting unsurprisingly by Paris Hilton (not even half as good looking as her character is meant to be in movie) was terrible but I have to say I was relatively impressed with Christine Lakin's (The Nottie) performance who was miles above the rest of the crew and I was disappointed to see her resolving to a movie like this. I think that Paris Hilton should \"Throw in the towel\" and discontinue her acting career as the 2 movies in which she has been the main character (Pledge This! and The hottie and the nottie) are both in the IMDb bottom 100 movies of all time (Ratings of 1.7 and 1.6). That should kind of send her the message that if she wants to continue being an actor she'd be better suited to being an extra on a midday soap opera.\n\nOverall the movie was slightly \"watchable\" but I think the only reason I was remotely entertained is because I thought it was going to be the worst movie of all time but there is worse such as \"The Love Guru\", \"Martians go Home\", \"The Pink Panther 2\" and the appalling \"Get Smart\"\n\nBy Michael"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "kaefab",
        "review_rating": "1",
        "review_title": "I stop reading after Paris Hilton is HOT",
        "review_detailed_main": "This women a part from being a turd in life as nothing hot... i never found her remotely attractive.... and can't believe she is an actress.....\n\nThis movie deserves the bad rating because its an awful plot to start with.\n\nParis Hilton and hot i think NOT"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Sandcooler",
        "review_rating": "3",
        "review_title": "Pretty much as bad as you've heard",
        "review_detailed_main": "The Razzies are usually rather trite and uninspired, and making fun of Paris Hilton is like hunting rabbits in a petting zoo, but that doesn't change the fact \"The Hottie And the Nottie\" is really, really terrible. It starts out like an average romantic comedy, and it ends like one too, but everything in between is mind-numbingly horrible. It's such a mess that not even \"Step By Step\"'s Christine Lakin can save it, and that ought to say a lot. The jokes? Well, pretty much all of them come from a wacky sidekick, and unfortunately this actor isn't half as funny as he seems to think he is. Paris Hilton also farts. Twice. That's about it I guess. The story is supposedly touching, but the moral lessons seem highly questionable. What we learn from the movie is basically: always go for the girl with inner beauty, but wait until she gets a make-over and starts looking like Christine Lakin. Before that happens, just completely ignore her. Thanks for clearing that out, \"Hottie And The Nottie\". What a wreck of a movie, downright painful to see."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "selumt0",
        "review_rating": "1",
        "review_title": "I now have an STD watching this.",
        "review_detailed_main": "I wish I could rate lower than 1 because this film has now gave me an STD by watching it. At first I was like \"Oh lord not Paris Hilton\" but she didn't do as bad as expected. Even if her acting deserves to be in raunchy films instead of actual production films. It was very poor acting and the script was just terrible. Who wrote it? I bet it was some child under 7 who doesn't know English terminology yet. This film (If that's what you call it, because it seemed like a home-made video) was just TERRIBLE. I don't get why people make terrible things like this. I would definitely not recommend you to watch this film if I was you. Unless you're a die hard Paris Hilton fan. The budget was like $25. 1/10 even lower if I could."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "sambodude",
        "review_rating": "2",
        "review_title": "It's pretty bad, but if you're super bored....",
        "review_detailed_main": "Let me start with saying that the movie sucked really hard. Especially in the beginning. Very poor acting by Paris Hilton. The others did okay. I got to admit that there were some funny parts, for example the scenes that Nate had to compete with the perfect Johann. And some jokes were really unexpected and hilarious, but there were only a few of those. I guess that there's a good message in the movie, but that only seems at first. After thinking about it, only of you're good looking, you're worthy of being loved. Pretty nasty, no? Anyway there's only one reading that I rated this movie with a 2 and that's because there was actually a surprising scene in the movie. Normally these kind of movies are pretty predictable, this one is not different, but the WAY it ended was kind of surprising. Anyway, I wouldn't recommend it, but of you have some spare time left..."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "dimonosads",
        "review_rating": "3",
        "review_title": "May have been another silly comedy if..",
        "review_detailed_main": "I enjoy watching silly comedies with stars like Jim Carrey, Adam Sandler and many others. So silly, they become ridiculous at one point. This title sounded like a good choice for me.\n\nDespite my love for such movie, I didn't enjoy it as much as the other I have seen. Was it the acting of Paris Hilton, that destroyed the movie? Definitely, yes. Was it the awkwardness of script for this movie? One more nod from me. Was it the jokes that didn't make me giggle? Of course. Was it the pointless of plot in general towards the end of the movie? Absolutely.\n\nIt may have been another silly comedy if it didn't have these flaws."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "projectlazyday",
        "review_rating": "10",
        "review_title": "In defense of this movie!",
        "review_detailed_main": "I declare the people hate it because of Paris Hilton but this movie has at least 5 or 6 laugh out loud moment in the first 30 minutes. It's an awesome movie to kickback with on lazy day.\n\nIf you forget for a moment that it's Paris Hilton, this movie is on the surface of it a fun and funny movie. I thoroughly enjoyed it. Really easy to watch. I'm giving it a 10/10 because there are so many negative biased reviews that aren't being fair to this title. They are not judging this movie on its merit. It's actually a good movie if you want something casual and fun to watch for an evening. Some comedy gold in this. I can't believe this was not more widely received. It kept me engaged the whole time."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "stormphire1",
        "review_rating": "7",
        "review_title": "Paris Hilton",
        "review_detailed_main": "First off let me just say that movie is not that bad at all and to say its the worst movie EVER is pure nonsense anyone ever seen \"Phone Booth\", don't get me wrong its not \"Gone With The Wind\" but its freaking hilarious, it does start to drag after 45 minutes but it picks back up in the funny department.. lets face it I bet 90% of all the people that are bad mouthing this movie are just Paris Hilton haters and God Knows that she has plenty of those. If Paris wasn't in this movie it wouldn't be getting flamed nearly as bad and that's just the truth. I watched The Messengers yesterday its FAR WORSE, at least this is funny!"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Edvis-1997",
        "review_rating": "2",
        "review_title": "2",
        "review_detailed_main": "Stupidity ,bad ,cringe,time wasting, disappointing , no point to watch, awkward movie."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "bgoldberg62",
        "review_rating": "",
        "review_title": "So pathetically bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "chucknorrisrules",
        "review_rating": "1",
        "review_title": "Sorry Ms Lakin, you made a mistake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "a-twetman",
        "review_rating": "1",
        "review_title": "Taking the awkwardness of romantic comedy to the extreme",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "Vvardenfell_Man",
        "review_rating": "1",
        "review_title": "*sound of projectile vomit striking toilet water*",
        "review_detailed_main": "This really is, like, wow. The fact that Protagonist Man was a star in Avatar--released the year after this--is embarrassing. The main character is a disgustingly selfish boor; the writer or writers may or may not have realized this. Maybe we're supposed to sympathize or identify with him. Maybe with his friend. Maybe with Paris Hilton; maybe with her friend.\n\nThe biggest problem here is the astounding lack of empathy in the writing of every single character. Generally, movies that make fun of the \"ugly\" people in our society and can't find anything interesting to say about them--like, simply, \"Maybe beautiful people are uglier on the inside than ugly people are on the outside,\" which is still an awful idea to center your movie on--are the worst kinds of movies.\n\nThis might have been handled better by John Waters. It's possible but unlikely."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "southdavid",
        "review_rating": "2",
        "review_title": "The Hittie and the sh...",
        "review_detailed_main": "Another film cheerfully watched for the \"How Did This Get Made\" Podcast. I was bracing myself for some real garbage with this one and, to be fair, that's what I got. Despite its reputation though, I think I've seen films for the podcast that were a lot worse.\n\nSince junior school, Nate (Joel David Moore) has held a romantic torch for classmate Cristabel (Paris Hilton). Following another failed relationship, he decides to track her down, engaging his friend Arno (Greg Wilson) to help. Arno explains that whilst Cristabel has grown up to be a beautiful woman, men are kept away from her by her best friend June (Christine Lakin) who is physically unappealing to the opposite sex. Nate orchestrates a meeting with Cristabel, which goes well but in order to get his date, he'll hate to find someone willing to join them as a suitor for June.\n\nIt's important that I get across pretty quickly that this film is awful. So much of the teenage gross out comedy-era, which you could make a reasonable argument came to a decisive end with \"The Hottie and The Nottie\", is morally reprehensible and this one is no exception. Ugly people deserve scorn and only become acceptable as worthy of love when they undergo massive cosmetic surgery to change themselves seems to be the moral point that the film seems happy to run with. Jealousy and entitlement are seemingly admirable qualities and in the words of Family Guy \"It's alright to lie to women, they're not real people like you and me\".\n\nThe performances are awful, as you might imagine when you look down a cast list of people whose careers never took off. Hilton is not asked to do much and whilst she's not staggeringly awful with it, she brings little to the role. The premise of the film struggles when it comes to June's personality. There's no real explanation why she's keeping men away from Cristobel - we see her eviscerate one man who dares to try, but otherwise she doesn't seem to hate men in general and seems to want to be in a relationship herself.\n\nIts only slight redeeming quality was that I felt there was some awareness of the horribleness from Joel David Moore's leading man and, occasionally, he managed to raise the smallest of laughs with his delivery.\n\nIt's scant reward for sitting through what I'll again point out is an awful film, but again - if this is the worst film you've ever seen, consider yourself lucky."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "anishp-75737",
        "review_rating": "1",
        "review_title": "i am so braindead after watching this",
        "review_detailed_main": "This is the worst film i have ever seen hands down. The random jump cuts, the horrendous acting and so much more that is just not explainable in words all turn this into an 'oh god when will this be over' kind of experience."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jenovello",
        "review_rating": "1",
        "review_title": "This Just Needed a Complete Scrip Rewrite",
        "review_detailed_main": "This could have been good. Rewrite the script and recast most of the actors and it would be decent. Actually, the actors here might have been fine with a better script and better direction. It's nicely photographed. I'm struggling to reach the maximum characters. This was shot in beautiful settings. As is, it's better than some things I've watched-like \"Cereal Man.\" And, actually, this movie wasn't much worse than \"Anyone but You\" with Sydney Sweeney. Paris Hilton isn't too bad here, since she hardly says anything. The guy who played the \"abs guy\" was decent. I was able to watch this because someone slapped it on YouTube."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jo-erg",
        "review_rating": "2",
        "review_title": "Really bad, but not the worst (CONTAIN SOME Spoilers)",
        "review_detailed_main": "Well,It's true that is really a very bad movie, but not the worst of 2009. The people only hates this movie because of Paris Hilton's egocentric behavior, which is true, but not for the movie itself. The Love Guru is worst than this movie, when I saw it I thought I was going to vomit. This movie is only doesn't make me want to vomit, it is only a waste of time.\n\nMaybe if Paris Hilton wouldn't be that selfish, this movie could be better. The others actors aren't that bad, only her, specially on the parts when she sees at the camera and pretends to be hot, and she is not. Other fact that made the movie's quality worst was the script, it was made only to made Paris Hilton look smarter than she really is. She gives stupid metaphors all around the movie!!!!! Moore's performance wasn't really very bad, but it is difficult to look good in a bad movie.\n\nMy rating is 3/10,as i said, bad but not the worst"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "littlebopeep_2",
        "review_rating": "10",
        "review_title": "I liked it",
        "review_detailed_main": "I thought this movie was very sweet. I hadn't seen a movie like it before, it was refreshing to watch an unfamiliar plot unfold. I loved the fact that June was given a chance to shine. It would be so hard to be constantly compared to your friend as the \"nottie\". I think something we can learn from this movie is that you should make the most of who you are, don't put yourself down. If you don't believe in yourself, who will? I know a lot of people hated this movie because of Paris Hilton. If you focus on the story, its far better than most movies today. I'd definitely recommend it, especially to teenage girls. Go on, its worth it."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "mitchfromtoronto",
        "review_rating": "7",
        "review_title": "Lighten up--It's really funny!",
        "review_detailed_main": "OK folks I don't get all these negative comments... Could it be that everybody hates Paris Hilton this much and it's clouding their reviews???? I have seen this movie with my entire family and found it to be one of the funnier movies we have seen...That's right FUNNIEST as in laugh till my guts hurt. A couple of scenes are guaranteed to make you laugh. If you don't find this movie the slightest bit funny then there's something wrong with your sense of humour IE you have none!! I am NOT a Paris fan per se but again this is entirely funny... Take a look and see for yourselves...I promise you will be entertained and laugh till your belly hurts..."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "lisafordeay",
        "review_rating": "1",
        "review_title": "I would rather watch any other romantic comedy like While You Were Sleeping than this piece of crap.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "siverns19932009",
        "review_rating": "3",
        "review_title": "this movie is as shallow as a paddling pool",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "comedyfan71",
        "review_rating": "1",
        "review_title": "Indefensible",
        "review_detailed_main": "This is quite a difficult film to review in a way as I'm struggling to find anything remotely positive to say about it. I guess that some of the acting isn't horrendous and Paris Hilton is better than in the other films I've seen her act in, but it's a rather low bar. The cinematography also isn't a disaster. That's pretty much the only positive things I can say.\n\nThere's so many problems here. I guess the first thing to say is that the story to start with doesn't seem to have had the potential to have gone anywhere. The story is painfully predictable and I don't get the whole premise of having a young man continuing to lust over his childhood love interest from 20 years ago (whom Hilton plays.)\n\nThe gags pretty much all fall flat, there is zero evidence of any thought being put in here. The jokes all revolve around the disgusting nature of June. If you thought the likes of American Pie had too much gross-out humour, you've seen nothing yet.\n\nIt pains me to say but it's deserving of it's title as one of the worst films of all time."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "nick-679",
        "review_rating": "10",
        "review_title": "See this film for yourself",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "YoGreve",
        "review_rating": "6",
        "review_title": "Decent romantic comedy !",
        "review_detailed_main": "First of all - STOP HATING BECAUSE Paris HILTON IS IN IT ! No, I do not think this is a masterpiece, Oscar worthy or anything like that, but to say it was bad is just wrong !\n\nThis is a decent comedy that deserves to be watched because of the message, not because people wan't to check out the bottom 100 - Where it does not deserve to be !\n\nParis Hilton surprised me in this ! She does a much better job than she did in Pledge This ! She has definitely improved her acting ! The entire cast may not have been the best actors in the world, but they are all so lovable.\n\nSo if you bored a Saturday night - like I was, go rent this movie - YOU MIGHT LIKE IT ;)"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "edebrajjean",
        "review_rating": "10",
        "review_title": "I Have Been Laughing At This Movie All Weekend!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "contactmatthewk",
        "review_rating": "7",
        "review_title": "Stop judging. This is a good movie. Try it out before you bunk it.",
        "review_detailed_main": "As many have said already this movie should stop being judged on Paris Hilton being in it. This is actually a good movie. Its not great. But the acting is decent. Its funny, it has a good plot line with a interesting progression. I think you should at least watch the movie before you listen to all of these people who say not to. Make your own decisions and make your own opinions. I actually enjoyed everyones role in this movie. After seeing some of Paris' past work i wasn't sure how she was going to do, but she really pulled it off. Showing she can learn and be adaptive and it has paid off making her a good actress in her own right. Anyone who judges this movie based solely on the fact that Paris is in it is ridiculously biased. And completely unfair. Not only are you judging someone you don't know, but you are also judging everyone in the movie for just acting alongside her. This isn't third grade. Please grow up."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "olalara",
        "review_rating": "10",
        "review_title": "An Impressive Comedy Romance Movie With Sexy Paris Hilton.",
        "review_detailed_main": "It is not fair at all to see a fantastic movie with sexy Paris Hilton (the girl whom I love) getting extremely low votes and being too under-rated!.\n\nPlot of The Hottie & The Nottie: Nate Cooper just cannot get it together with women. But he also cannot forget his first crush, the tall, attractive, blonde Cristabel Abbott, from their time in elementary school. Nate sets out for the beaches of California and meets up with his geeky best friend Arno, whose mother has an unnatural amount of information about Cristabel, and perhaps an unusual relationship with her son.\n\nCristabel jogs on the beach every day with many suitors trying to catch her eye, including an albino stalker. But she's still single, and there is a reason: Cristabel is still best friends with the same short, unattractive brunette girl whom Nate also knew in elementary school, June Phigg.\n\nNate reintroduces himself to Cristabel and they hit it off. However, Cristabel refuses to go on a date with Nate unless June has a date as well. Nate sets out to find a boyfriend for June, but guys recoil at the sight of her. One day at the Santa Monica Pier, Johann Wulrich, an attractive dentist who works as a part-time model, appears in their lives. He seems to want to do a makeover on June when he apparently sees her inner beauty. However, Nate believes that Johann is a threat to his shot for Cristabel, since Johann is almost perfect. Eventually, with June dating Johann, Cristabel finally begins dating Nate, per his original plan.\n\nOver the next few weeks, as Nate and June become friends and she emerges from her cocoon, with her face and appearance transforming into that of an attractive woman whose beauty begins to compare with Cristabel, Nate slowly realizes that June may be the girl of his dreams. Nate tells this to Cristabel, who is happy for June. Nate then tries to find June, and finds her, telling her how he feels.\n\nBuy The DVD And Don't Be Brainwashed By Haters!. The Hottie & The Nottie Is A Lovely Movie & My Darling Paris Hilton Is As Sexy As Ever. I Love Paris Hilton With All Of My Heart."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "MermaidMandy01",
        "review_rating": "6",
        "review_title": "Kind of a cute movie",
        "review_detailed_main": "I'm surprised it has so many people who voted it at a 1. I've seen way worse movies. I thought it was okay. It wasn't horrible, it wasn't something I'm going to put in my top five, but it's a predictable romantic comedy which is fine to throw on every once in awhile. Paris Hilton just plays herself which is fine, but everyone else's acting is actually pretty decent. It has a really cute ending. AND I'm just glad there wasn't a cliche makeover moment, that it was spread out throughout the movie."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "swabbab88",
        "review_rating": "9",
        "review_title": "Why the bad review? Stop hating!!",
        "review_detailed_main": "OK so this isn't the best movie in the world but NO WAY is it the worst movie. The plot has been done a million times before but if the story line was so bad people wouldn't keep on doing it. I read the reviews and thought oh no i'm going to hate this but sometimes you have to take a chance and i'm so glad that i did.\n\nThis movie is REALLY REALLY good. I'm not a Paris Hilton fan and her acting wasn't the best but yet i still really liked this movie. Maybe it's because i'm a romantic at heart that i liked this movie but i really would watch it again and will be telling friends and family to take the time out ignore the reviews and watch the movie.\n\nI give this movie 9 out of 10 and i don't normally rate movies that high but this movie left me with the feel good factor. I did laugh at some of the jokes and it's really not a bad movie. Take a chance and watch it for yourself you never know you might like it, i know i did."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "mrlooneybin",
        "review_rating": "8",
        "review_title": "This movie was great!",
        "review_detailed_main": "I thoroughly enjoyed this movie. i watched it after seeing the review for it here. Clearly the rating is vendetta to Hilton. She played her role perfectly. However, this was Larkins show. Shes is a incredible actress. The guy who played JT in grandmas boy also did a great job in this movie. Don't let fake rating hold you back from watching this movie. The movie is one that actually makes you laugh and genuinely feel good at the end.\n\nThe whole story of a childhood crush with the possibility of making that dream come true is a fantasy many of us still think about. The discovery of what your dream truly is makes it even better. Enjoy this movie with family and friends."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "grpapa43",
        "review_rating": "8",
        "review_title": "surprisingly not too bad",
        "review_detailed_main": "despite the fact Paris was in the film, i found it to be funny and very enjoyable. by the time the movie was over i felt good inside and was very happy with the ending. Paris sucks as an actress but its no reason to bring down the other actors abilities. so if you can ignore Paris and just watch it for what it is, i believe you will enjoy it too. the movie shows that real beauty always comes from within and Paris may believe she is a hottie but the true hottie is the supposed nottie. i liked the sound track and all the scenes where Paris was not a part of. you have to admit if Paris was not in this movie more people would have given it and chance and liked it. maybe someday Paris will realize she is not an actress and not that hot to where she thinks every man wants her. so try the movie and see for yourself that if it was not for her that this is a very likable movie."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "sarabernard-79872",
        "review_rating": "10",
        "review_title": "Paris hilton nailed it !!!",
        "review_detailed_main": "Probably one of the best comedy films of 2000s and of all time Paris gave us here an Oscar performance, she was so funny and clever Reminded me of mariln performance in Some like it hot , Highly recommend this film for everyone , a must see for comedy lovers Paris is best of the best"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "allen-brett-l",
        "review_rating": "10",
        "review_title": "This hottie can really act!",
        "review_detailed_main": "I went in to this film hoping for another One Night in Paris. I was at first disappointed to see they had not used the night-vision camera as Paris is so known for. However, she didn't disappoint.\n\nShe gave a truthful, honest and heart-breaking performance as a young girl down-trodden by society and cursed with her natural good looks.\n\nSee this film if you loved Pledge this like I did.\n\nI can't find enough good things to write about this young talent.\n\nLet's all cross our fingers that her next film, the rock-opera will be just as good.\n\nAnd when will we see Lindsay Lohan or Britney join forces with this lovable starlet?"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "bubbben",
        "review_rating": "10",
        "review_title": "I Thought It Was Good",
        "review_detailed_main": "I don't understand how people can say this is a absolute awful film it isn't. The acting isn't bad but its not the best in the world. Paris Hilton has definitely improved since her other films and is now more of an actress than she was, she is a believable actress now and has an actual character unlike before. Chrisina Lakin was very funny and some of the quotes Paris' character said were pretty funny too. Joel Moore was funny as ever. The Plot was not that bad it was cute and very funny. The film was romantic and had its Awwwww bits people shouldn't not rate this just because it has Paris in and the people who rated it a 1 have not even seen it they are sad pathetic people who have nothing better to do with themselves but sit on their computer and criticise films because of the people in them. I would recommend it for anyone who wants to see a nice happy Romantic Comedy."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "ifuseekkody",
        "review_rating": "10",
        "review_title": "As close to Paris Hilton as you can get!",
        "review_detailed_main": "Unless you know her daily iterniery, this is as close to cheeky Paris Hilton as you can possibly get! Far from being a rich, spoilt brat, Paris has got natural talents as an entrepreneur. That I admire. She's a natural actress, very comfortable in front of a camera, very cool, calm, cheeky and captivating.\n\nI enjoyed this fun-filled movie from it's beginning.\n\nWhat I like about the themes of this particular movie:\n\n-> Paris' character of being a faithful friend to someone unfortunate. I wonder if Paris Hilton can stay in any long-term relationship in real-life?\n\n-> Paris' philosophy about the human soul vs body and how we look on the outside.\n\n-> The revealing \"flashback\" story-telling technique that is used to explain present relationships in relation to the past.\n\nIf you want a good laugh and a little learning philosophy in how humans judge others, watch this movie. I also recommend the movie \"Shallow Hal\" which is just as good."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jons_watching_you",
        "review_rating": "10",
        "review_title": "What is everyone complaining about?",
        "review_detailed_main": "Honestly, I hate nearly every movie I see nowadays.. there's just nothing to them, no redeeming quality, no fundamental truth.\n\nThen, every once in a while I watch a movie that really touches me. Honestly, this was one of them.. it really changed the way I looked at beauty.\n\nI think it's a beautiful movie, inside and out, and I can only assume that people hate Paris Hilton so much that they all jumped on the bandwagon against this movie. Or maybe they just can't handle a movie that's actually really sweet and truly has something to express, cause honestly this is one of a dozen in the past ten years that falls under that category.\n\nI love Joel Moore, he really has that nice guy look and feel, and the chemistry he creates with his love interest is wonderful. I also enjoyed (of course) looking at Paris Hilton, who does a surprising job playing herself quite well and I especially enjoyed Christine Lakin, who was just very sweet and innocent.\n\nAll in all, one of my favorite movies since 2000. And I'm a dude. (Albeit a sensitive one)\n\nSo if you have an open heart, check it out. You might be surprised."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "ssmksi",
        "review_rating": "10",
        "review_title": "I loved it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "don_robeo",
        "review_rating": "9",
        "review_title": "Absurd rating on this......",
        "review_detailed_main": "The reason and only reason I watched this is because of the terrible rating it got. I had to see what all the fuss was about. I thought Paris Hilton must really be making a fool of herself so I had to see if it was really that bad. Keep in mind I'm not a huge fan either, but her personal life is none of my business. Done my fair share of partying myself.\n\nI don't think I could've have been more surprised. This was a great little romantic comedy! That's not my favorite genre either but I give credit where it's due.\n\nThe fact that people hate Paris Hilton so much that they would come on here just to vote down this movie is more than a shame, it's criminal. There is NOWAY all these people watched this and hated it.\n\nDo yourself a favor if you like romantic comedies and WATCH THIS!!! COMPLETELY IGNORE THE RATING...................................\n\nP.S. Never really thought Paris was all that myself, but she did GREAT and looked fabulous doing it. She produced this gem too."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "z-mbe",
        "review_rating": "10",
        "review_title": "OMG how much better could it be?",
        "review_detailed_main": "first things first... WOW what a movie!\n\nParis Hilton again amazes the audience with a truly masterful performance. she shows us why she has the determination and the talent to become one of Hollywood's finest actresses.\n\nnext, i'd like to congratulate tom Putnam for showing us that he has the leadership and skill to rise among the ranks of George Lucas and Steven Spielberg.\n\ni can't remember the last time i laughed throughout the entirety of a film. this movie gets two big thumbs up for originality, and the best acting in 2008 so far. move aside Indiana Jones, make way for one of the all time greats in the movie industry.\n\ncheers Paris"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "ignilc",
        "review_rating": "10",
        "review_title": "film making taken to cosmological levels",
        "review_detailed_main": "this movie is excellent cinematography. and artists and a lot of very misunderstood outstanding performers. only if you are retarded or incult or illiterate will you dislike this pellicle. it has the best scenario, the best directing and the best music and the best actors. if one man would open up the skulls of the crew that worked on this movie i wouldn't be surprised to see a UFO flying out. get it? catching my drift? this, people, acknowledge is THE best movie ever made. it's godlike. wonderful acting job performance of paramount grandeur from top notch artist Paris Hilton. \"i too have rich father. and thanks to donald trump system, when daddy dies, i'll inherit his money, hm\""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "misakizack",
        "review_rating": "10",
        "review_title": "Not for everyone",
        "review_detailed_main": "This movie is definitely not for everyone, if you hate movies with acting deemed \"cringe\" or \"bad\" you'll hate this. That being said I love movies with slightly cringe acting/moments as I feel it makes the movie better. Plus it has Paris Hilton herself! Who wouldn't love seeing a movie with Paris Hilton? I was mentally, emotionally and physically invested and interested in this movie! Nice amount of raunchiness for a teen movie, great chemistry, hilarious jokes/gross out scenes, Paris Hilton looks hot in the movie, the movie uses a romance movie cliche that I absolutely love, it's a teen movie. What else could you want? I highly recommend it!"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "fdn-41444",
        "review_rating": "10",
        "review_title": "Very good and funny",
        "review_detailed_main": "The movie was written in an era that you were telling the things as they were without thinking of hurting the feelings of the other. So please give some slack to this movie. In addition, many comment on the poor performance of Paris Hilton. However, do bare in mind that it was her first steps into the movie industry and never she considered herself an actor. She was more of a guest star that the producers wanted to have her more as a \"supermodel-diva\" personality which in my opinion she delivered perfectly. As of the movie itself, it is a typical goofy comedy with a happy ending. No idea why so many hate towards it, but if you are not easily offended and you want to pass your night with laughters, do see it!"
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "G-Pal",
        "review_rating": "8",
        "review_title": "It's actually a good film!",
        "review_detailed_main": "Some people have slated this movie saying its not very good, but to be honest once you've watched it 7 times its actually very funny. It's one of Paris's best films since One Night in Paris. The supporting cast all gave a fantastic performance, especially Jeremy Scott Johnson who plays \"Little Girls Dad\". I thought he was great when i saw in an episode of Criminal Minds, but this film really shows off his potential as a great actor. I look forward to seeing his career take off. So overall if your looking for a funny film and good acting i would recommend The Hottie & the Nottie. Fingers crossed The Hottie & the Nottie 2 is in the pipeline."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "The beat",
        "review_detailed_main": "What's not to love about this film? I guess probably nearly all of it."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "sarahmaccallum",
        "review_rating": "9",
        "review_title": "Pretty Good",
        "review_detailed_main": "It was a pretty good movie.\n\nParis Hilton is actually quite decent at acting for never even really going to school.\n\nI would recommend to friends.\n\nParis is truly a woman of many skills.\n\nPeople really need to tone down the hatred in these comments. Just because someone isn't a similar acting to Jack Nickolson doesn't mean they aren't talent or enjoyable to watch.\n\nMy teenage daughters also enjoyed the movie. They actually watched it twice in one weekend. They invited their friends over on Saturday after watching it once on Friday."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "slaterjn",
        "review_rating": "10",
        "review_title": "A seminal masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jakejonesworld",
        "review_rating": "8",
        "review_title": "I was surprised...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "madmada",
        "review_rating": "9",
        "review_title": "A good enjoyable movie",
        "review_detailed_main": "The movie is very decent, with some good moments. Objectively a 7/10 (for me 9).\n\n\nA mix between \"There's Something About Mary\" and \"10 Things I Hate About You\".\n\n\n\"The Nottie\" progress to be the focus of the story was done well, they tricked the viewers and subverted their expectations of Paris Hilton being the \"dream girl\" as she was portayed as such at the start."
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "iamtigerjames",
        "review_rating": "",
        "review_title": "Boring, Degrading, Offensive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0804492",
        "movie_name": "The Hottie & the Nottie",
        "movie_rating": "2.0",
        "review_username": "jamesleodelacruz",
        "review_rating": "",
        "review_title": "Stop the cap wtf.",
        "review_detailed_main": ""
    }
]