[
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "satellitepictures",
        "review_rating": "3",
        "review_title": "A great movie that will have you watching it over and over and..what?",
        "review_detailed_main": "What? Oh S Darko? I thought you said Donnie Darko. Oh...well that changes things. Um... Let me take all of that back then.\n\nOK on a serious note there are a lot of posts on here that will say that they A.) Were huge fans of Donnie Darko B.) Thought the girls were hot and scantily clad C.) Thought the effects were not so special d.) Thought this was kind of rehashed\n\nI agree with all of these statements. I also tried looking at it like it wasn't involved with the first movie at all and you end up with a no so brilliant, watered down less than mediocre movie. The problem is this is a Donnie Darko movie. You have fans who have watched the original over and over, read countless summaries of not only the movie but the \"mechanics\" of how that universe worked and then came to your own conclusions. You have fans that (myself included) donned (no pun intended) the skeleton costume and grey hoodie for Halloween. When you try to add to a cult phenomenon like Donnie Darko, unless you do your homework, you are going to fall flat.\n\nTo me this movie felt like someone watched Donnie a few times, wrote down some key elements from the movie in a notebook and then tried to incorporate it into a new movie.\n\nAs a huge fan of the original I can't find myself \"hating it\" in the same way that I can't hate the Star Wars prequels, so I gave it a 3 out of 10. I don't want to betray it even though it betrays the original and its fans. It was by no means one of the worst movies I have ever seen, but it is a let down of a sequel. I also gave it a 3 because I understand what this movie was trying to do (involving others in the timeline plot to change destinies) but I don't think it was done well. You still have some of the mechanics involved in the first, although altered. Even the characters are somewhat the same (the sexual deviant priest vs the sexual deviant motivational speaker, etc)\n\nEven some of the lines used are to try to get a reaction from original fans. It just comes off as a bad rip off.\n\nWhen you were done watching the original, you felt as though you wanted to watch it again and learn more. You felt a sense of witnessing something special."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Shaun_of_the_Dude",
        "review_rating": "4",
        "review_title": "How does one suck a F***?",
        "review_detailed_main": "As soon as I had heard about this hybrid sequel (and it is a sequel), I immediately thought that they had gone and done it again, I thought they just couldn't help themselves, I thought that it was just another money spinner and it was produced to simply draw in the gradual pulse of Donnie Darko fans.\n\nAfter watching it though, it really didn't disappoint, my initial gut instinct was right. This film follows in the footsteps of other previous solo films that they just couldn't leave alone.\n\nThis film has so many Donnie Darko cliché's, it's unbelievable, the visual effects (which I could have done myself), the stylised music of the time, the time lapse scenes (which are OVERUSED), the times caped school scene (with Tears for Fears)... Everything... Everything that made Donnie Darko the artistic and visually spectacular film it was, has been transposed to this and it has been transposed, woefully.\n\nThey have even cast a couple of Jake Gyllenhaal lookalikes for some of the parts, and there is NO way this is an accident, because they act so badly, they must have been cast on their uncannily resemblance to J.G.\n\nIt's a bit like when Dennis Leary, Ripped off Bill Hicks, it's rather sad seeing someone else trying to imitate someone else's joke, you still laugh at it for a minute, but afterwards, you just want your money back.\n\nThis film is a bit poo, I can't even comment on its \"plot\", because, you can see \"the plot\", has been moulded around the model of Donnie Darko, you can see that the plot was the last thing they thought about, which funnily enough, in a Donnie Darko fashion, was probably the first thing though about in Donnie Darko.\n\nI don't know though, for some strange reason, this feels more like a bad re-make, than a sequel, and people probably will say something like \"You have watch this movie, independently, don't think that it's a sequel to Donnie Darko, try to see it for what it is.\", okay, that would be a fair thing to say. But as soon as you release a movie, with one of the same actors from the original, with the same title as the original (nearly), with the same freaking emblem as the original, pfft... well... You can't cook a cookie from a recipe and say it's your own.\n\nNow, let's get to the acting. The acting is awful, there really doesn't seem to be any interACTION, between the actors, it just feels as though they are saying the lines to each other, it really does, there doesn't feel like there is any co-character development, there doesn't seem to be any rapport at all, and more importantly, there doesn't seem to a distinguishable emotion, throughout the movie, honestly, watch it... The best actor throughout, is one of the actors who hardly has a scene John Hawkes, from, From Dusk Till Dawn and Identity.\n\nThere are also 2 shady looking characters in the film, who don Men in Black attire. They look like two bloody elephants in a fridge, they really do, they look SO out of place and so uneasy on the camera, that they were probably just picked from the town that they filmed in, either that or they are two tecchies from the production team.\n\nAs I've said before, the production looks shoddy, it really does, the effects from Donnie Darko, looked much better and that was.. what? 8 years ago? And 8 years, is a long time in technological terms. Even in one scene (this is supposed to be set in 1995), you can see post 95 produced Cars in the background, and an up to date Budweiser sign.\n\n(I wish I could do the time travel thing and go back in time and NOT watch this film.)\n\nAll-in-All, this film is bad, I suppose my advice could be to watch it with an open mind, but I would be misadvising you, this film is obviously aimed at making a few quid from Donnie Darko fans and with that in mind, I just can't get past the audacity of the reason for this film. It is a much asked question of films, especially sequels, but I am going to ask it anyway.\n\nWhy?\n\nI have given this film a 4/10, and that is primarily because I think that the lead is hot, she walks around a hot state, with practically nothing on most of the time and the fact that she looks like Jessica Biel, that is how skin deep I feel, after watching this film, which is no doubt, how the producers thought throughout the process of making this film.\n\nIf you are thinking of buying this on DVD for a present for someone you know who is a Donnie Darko fan, then don't, A. It will disappoint them and B. It will only spur on, more crap like this.\n\nAnd as for one KILLER line in the movie...\n\n\"Like... Drugs and Anus Sex!\" Best line in the whole movie."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "TheEtherWalk",
        "review_rating": "3",
        "review_title": "Not the worst movie ever, but really bad in a lot of ways",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Otto-Maddox",
        "review_rating": "2",
        "review_title": "I Doubt Chris Fisher's Commitment to Sparkle Motion...",
        "review_detailed_main": "S. Darko is one of many sequels that has no reason to have been created at all. But even if one puts the original film out-of-mind, and only look at the sequel on it's own merits, the movie still falls completely flat.\n\nThe film picks up 7 years after the original left off, Samantha Darko and her friend Corey are on a cross-country trip heading for Los Angeles. When car problems leave them stuck in a little town by the name of Conejo Springs (which is populated by a community of horribly written character's), the girls are forced to mingle with the townies, and Corey finds herself at home with the boozy losers, while Samantha, still in pain over the death of her brother (Donnie), finds herself drawn to the Outsider by the name of Iraq Jack, a disturbed Gulf War vet who has learned through bizarre visions that the world is coming to an end on July 4th, 1995.\n\nIt seems that Nathan Atkins is a fan of Richard Kelly's work (including Southland Tales because the character of Iraq Jack seems similar to the character 'Pilot Abilene' & the end of the world date being on 'July 4th') But Atkins can't write believable dialogue to save his life. And the director 'Chris Fisher' doesn't seem to understand what made the original film so good, which was the feeling of being able to connect with the characters going through something this crazy. And if the audience doesn't care about the characters on-screen it becomes very hard for them to feel any effect of the narrative structure.\n\nS. Darko is a hollow cash-grab by producers who must have never understood what Kelly was going for, but they now control the rights to the Darko universe, and they're hoping to collect any profit from this wannabe Donnie Darko replica."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "maddern",
        "review_rating": "2",
        "review_title": "Should never have been made",
        "review_detailed_main": "As huge fan of the first Donnie Darko I was very excited to see this. It was such a shame that the original director didn't make this film. The film is trashy and brings nothing new to the table. It take a handful of special effects and concepts from the first one and turns it into a crappy teen flick. The main characters made me cringe and after the first half an hour I thought this is a disgrace to the original film.\n\nThis film is not worth wasting your time on. The sad thing is that some people will see this film without seeing the original Donnie Darko. This film should never have been made."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "jason-coffman",
        "review_rating": "1",
        "review_title": "More like \"ASS Darko\"",
        "review_detailed_main": "I was honestly shocked that this film was actually worse than I was expecting it to be. It really seems like the writer and director got hired for the job, watched about half of the first film before they got bored, and then set off to make something roughly similar. Awful dialogue, careless (and painfully obvious) anachronisms, and some jaw-droppingly bad CG effects. I'd be willing to bet they had more money to make this than Richard Kelly had to work with on the original, and none of it's up on the screen. Maybe it cost them a lot of money to license \"Hobo Humpin' Slobo Babe\" by Whale.\n\n*cough* Anyway, as far as cash-grab sequels go this has to be one of the all-time worst. A suggestion: tape an episode of \"One Tree Hill\" or \"Gossip Girl,\" then put on some red-and-blue 3D glasses, and pretend one of the cast members is saying stuff like \"Remember the future\" and \"My farts taste like cherries.\" Then watch the show on rewind for about twenty minutes and do it all over again. Repeat for 102 minutes total, and you've had roughly the same experience. Utterly shameful."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "versacemedia",
        "review_rating": "1",
        "review_title": "An embarrassment to the Darko name",
        "review_detailed_main": "Before anyone gets on their high horse saying I am one of those Donnie Darko fans not giving this new movie a chance, I gave this film a chance and spent the five bucks to rent it straight away after learning it existed.\n\nThe only good thing about this film is that it ended. OK, that may be harsh, the film's colour and surrounding landscape it unfolds in is pretty cool but that is it. The only other interesting elements, whether technical in filming style or plot-wise of this film, were ripped straight from the first film. What was cool in Donnie Darko is merely imitation here.\n\nThe plot is weak and has logic holes which fail the Donnie Darko/tangent universe test from the first film. As fans of the original we cannot help but compare the two films because s.Darko centres on characters and memories from the first one and rotates on the principles that drove the original as well. How can you not compare the two? What almost borders on insulting in this film are the straight repetitions of acts, scenes and quirky characters from the first one replicated in this one. I don't want to spoil the film if you are drawn to sit and endure it but you'll see what I mean, you cannot miss the weak, formulaic repetition, especially if you are a fan of the original.\n\nBasically, s.Darko is the same model car like Donnie Darko but has different paint colour and chokes along on a four-cylinder engine whereas the first one rumbled along on six."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "jh-goldsmith",
        "review_rating": "1",
        "review_title": "If you thought \"How can they make a sequel to Donnie Darko?\"",
        "review_detailed_main": "If you thought \"How can they make a sequel to Donnie Darko?\" then you should be warned. This movie fails as miserably as you would expect. It also lacks in the quality of the cinematography of the original. It is almost unwatchable.\n\nThe ending to the original Donnie Darko was absolutely superior. It absolutely completed the story and left the viewer to ponder the meaning and philosophical implications of the work quietly to themselves. There was no antagonist to be reviled from the dead to fight again and no antagonist, having saved the world once to be brought out of a failed marriage and rehab somewhere to save the world again. I do not mind watching movie series even movies such as Saw or Rocky. But Donnie Darko is not the type of movie that could possibly lend itself well to a series and it doe not deserve to be put in a category with those types of movies and the attempt to do so is a complete failure."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "andy-salter",
        "review_rating": "1",
        "review_title": "Arrrrrgggggg",
        "review_detailed_main": "well where do i begin. i never expected much from this film but i hoped for so much more than i got. the plot is randomly all over the place with hints of donnie darko crow bared in to make it relevant to the original(and probably the idea was to interest fans of the original). the acting is very wooden, the story is totally rambling and the end is stupid in so many ways. it seems very much like the makers have gone way out of the way to appeal to fans of the original, well i am very much one of those fans and i hated it with more than a passion, i only found out about this movie about an hour before i sat down to watch it, i wish i never found out about it.its obvious why it went straight to DVD. so if you are a fan of the original stay away from this one and just keep on loving donnie darko."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "BremenDruid",
        "review_rating": "1",
        "review_title": "I just had one thought running through my head while watching this . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "rokcomx",
        "review_rating": "9",
        "review_title": "Much about this movie to like",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "emphedokles",
        "review_rating": "6",
        "review_title": "Its no real Darko but it is still good",
        "review_detailed_main": "Well, i reed a lot of comments about how bad this movie is. Normally i trust the comments on IMDb, but this time i decided to watch the movie.\n\nAnd hey, it was not that bad. If they did not had named it s.darko i would say it is a greate movie.\n\nIt really has not anything to do with Donny Darko. But except of this it is very entertaining. Cute chicas which looks like 17 are stumbling through a kind of screw back time horror movie.\n\nThe story does not make any sense and there are way to much Beverly hills 90210 look a like people in it. (including the nerd who looks totally cool after he took off his glasses and changed his shirt)\n\nBut it totally entertained me. There are greate pictures of wide desert landscapes in it. The girls are pretty and the story is mystical without looking like a cheap scifi channel story.\n\nIf you are bored and open for 90 minutes of easy entertainment, then it will not be a waste of time. (except you wait for darko greatness. this will not happen)"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "alfredblue2",
        "review_rating": "1",
        "review_title": "i honestly wish i never saw it",
        "review_detailed_main": "Oh my gosh. Why? I just don't get it. This has got to be one of the worst sequels ever made. Lets look at the list and take a look at everything wrong with this film. And by the way let me say i AM a big fan of Donnie Darko.\n\n1. The acting is almost unbearable. 2. The story sucks... well if you even want to call it a story. 3. its so confusing and does not even come together in the end. 4. The characters are extremely unlikable if you liked these characters my heart goes out to you... but you have no brain. 5. SO MUCH LAME CGI There you go the top five list of why this movie is so awful. I give this film a F."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "mbrooks-8",
        "review_rating": "1",
        "review_title": "The \"S\" in S. Darko stands for sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "donmoore444",
        "review_rating": "1",
        "review_title": "Couldn't they have just Let Donnie Rest in Peace?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "Poor acting and unlikable characters.",
        "review_detailed_main": "I am an oddball in that I have NOT seen \"Donnie Darko\" yet I watched \"S. Darko\". This is because I have an odd obsession--to see as many of the films from the Bottom 100 list on IMDB as I can. I also decided NOT to see the original film because from what I read, folks who loved the original (and it seems to have a cult-like following) absolutely hated this sequel...and I wanted to see if the sequel might be better if you never saw the first. So is this film bad enough to be #88 on the list? No...while it IS a terrible film in many ways, there are definitely many worse films that this one...not exactly a glowing endorsement.\n\nThe biggest problem about the film are the two female leads. Both play characters who are annoying jerks....and any film with annoying jerks in the lead faces an uphill battle. In addition, the acting of many (including one of the male leads) is terrible. They or the director seem to think that talking monotone and emoting very little is the epitome of cool. Instead, I just found the acting (like the characters) to be super-annoying.\n\nAs far as the plot goes, there are a lot of weird dream-like warnings about some pending apocalypse in a rural town in the American West (it was filmed in Utah). The special effects were very interesting...but the story was confusing and silly.\n\nOverall, a film that I didn't like at all but TECHNICALLY it isn't completely terrible."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "frudda",
        "review_rating": "1",
        "review_title": "This movie isn't worth to see",
        "review_detailed_main": "This movie is trash if you've seen the first Donnie Darko movie. It has nothing to do with the original. And the actors are really making the movie boring. I saw 1 hour of the movie then I got really angry, and turned it off.\n\nI wanted to give it a chance..\n\nThe movie has an feeling of those teenage movies that gets released pretty often. I can't understand the director what he thought when he made the second part like this.\n\nIt might be a trend that all second part followers movies gotta be this way. Why waste money on something thats not come from the heart.\n\nR.I.P Donnie Darko."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "emdrgreg",
        "review_rating": "1",
        "review_title": "Pungent Universe",
        "review_detailed_main": "I'm in agreement with virtually all of the negative reviews so far. This film is completely derivative and almost completely unoriginal. In fairness, though, there may be some things that make S Darko a little less incoherent. The basic universe of S Darko could be the tangent universe of Donnie Darko. The universe problem in the first film is not that the tangent universe cannot and must not exist, but that any universe cannot be contaminated by a tangent universe. My interpretation may be completely wrong, but the tangent universe plane engine in Donnie represents the contamination that must be corrected. Otherwise, why did Frank wake Donnie? If the ongoing reality in S Darko is that Donnie was killed by a still unidentified engine, then S Darko is an exploration of that tangent universe that Donnie saved us from. In DD, it has to be that the engine that killed Donnie is from the real universe, and from the plane that WOULD HAVE been carrying Sam and her mother had they gone to the competition. Donnie accepted death because that is how our universe should have unfolded. Maybe the rest of Sparkle Motion died, or maybe none of them went. Unfortunately, this probably suggests that in the tangent universe, Sam and her mother are both dead.\n\nThat said, the S Darko filmmakers were too intent on maintaining the rules and structure of DD in this film, and rather than an homage they made a very unconvincing re-make. They painted themselves into a corner. Exploring Donnie's tangent universe would be OK to do, but it should have opened up new levels of reality rather than to cram us into the old ones."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "tetrill",
        "review_rating": "3",
        "review_title": "Bad bad movie makers . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "blawson2010",
        "review_rating": "2",
        "review_title": "S. Darko is how one sucks a f***",
        "review_detailed_main": "I saw Donnie Darko not long before the release of S. Darko. I've watched Donnie Darko countless times so i originally viewed it and was interested in the sequel. I felt this movie would fall to the usual sequel stereotype of being ridiculous, cheesy and trying to ride on the fame of the original and i was right.\n\nS. Darko takes place seven years after the event of Donnie Darko. The film starts with Samantha Darko (Donnie's sister who was ten in Donnie Darko) and her friend Corey on a road trip to Los Angeles but their car breaks down just outside of a small town called Conejo Springs, Randy, the local dark and moody kid, gives the pair a ride to the mechanic. Corey becomes immersed in the town's party scene with Randy.\n\nFrom there the movie just tries to recreate the mood of Donnie Darko and dramatically fails. They even parallel some the memorable lines from the first one \"Why are you looking at me funny?\" \"Why do you look so funny?\" It is clear director Chris Fisher saw the original film well enough to make a copy but didn't follow the depth or meaning behind any of the original movie.\n\nThe acting was definitely sub par, it seems the casting crew went for beauty instead of talent which is not what Donnie Darko was ever about. Surprisingly the special effects were pretty standard, nothing to ridiculous but nothing to write home about either. This movie followed the typical teen movie guideline, hot chicks, crazy stuff and action.\n\nS. Darko will fall short of Donnie Darko fans expectations. Even a person who knows nothing about Donnie Darko will have trouble enjoying this movie.\n\nS. Darko is how one sucks a f***"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "justonesp00lturn",
        "review_rating": "8",
        "review_title": "Far better than I expected.",
        "review_detailed_main": "I'm a huge fan of the first film. That said, when I heard they were making a sequel, my first thought was simple: \"Why?\" However, I consider myself an open-minded person. I knew I'd watch the movie before passing judgment. My expectations were incredibly low, however. I figured that it would either be a poor attempt at cashing in on the first film's success, a cute film that made a decent attempt, or a surprise hit that blew my mind. The large amount of time since the first film made me doubt the first option, and the fact that Richard Kelly would not be involved made me doubt the third. So I figured it would be an okay film, worth watching once, and then forgetting about. The film finally came out, and I decided to rent it. I watched it with a friend, also a big Donnie Darko fan. My final verdict: I was indeed blown away. I will say that this film is not really on the same level as Donnie Darko. But it was far better than I had expected it to be. In terms of cinematography, the film is superb. In smaller terms: it LOOKS like Donnie Darko. You'll find fast-motion clouds, slow-motion parties, and upside-down, rotating shots. All of the rules of the first film are kept intact. Those who are very involved in the mythology of the film will likely not be disappointed. Everything about time travel, water, metal... all remains intact. My major qualm is that some things seemed directly lifted off of the first film. Of the now four people I know who watched both the first movie and this sequel, all four have found that to be its biggest flaw. But it does have its own story, and it's a beautiful story. The effects are wonderful, very beautiful. Overall, the movie is worth watching. I expect a lot of people will cast it aside and hate it simply because it exists. Good for them. But this movie is a good continuation, a great sequel (considering the original mastermind was nowhere to be found) and it was put together by true fans, for true fans. Where Donnie Darko blew my mind out of this world, this movie at least blew my mind out of my chair. That's more than can be said for a lot of films. In short, this movie is not Donnie Darko. It is what it is, and it is good."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "azmuzik61",
        "review_rating": "6",
        "review_title": "It makes sense to me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "barney2001",
        "review_rating": "3",
        "review_title": "S. Darko --- S. for Spoiling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "almo-8",
        "review_rating": "1",
        "review_title": "Im too angry for a summary...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "ur_a_mum",
        "review_rating": "1",
        "review_title": "Why did I watch this!?",
        "review_detailed_main": "I want to punch something or someone! GET ME CHRIS FISHER! ARGH If only I was aloud to swear. S. Darko is most certainly not where Donnie Darko left off. The actors who play both protagonists have never been in anything prominent or good (meant in its lowest form), so I didn't expect anything magnificent but this is something else. The film tries to be \"Donnie Darko\" but falls: using a similar structure, story and premise. I could have seen this movie being somewhat of a success if it had a different directer. WHY DO WE ALLOW CHRIS FISHER TO STILL MAKE FILMS HAVEN'T WE ALL COME TO REALISE THAT HE IS RUBBISH! I don't think I have truly expressed my anger for this film and I do think i ever will be able to as words can't express this hatred!"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "PreciousRoy",
        "review_rating": "1",
        "review_title": "Jack Sparrow should have stuck to swashbuckling...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "rdmingham",
        "review_rating": "3",
        "review_title": "ARRRRGGGGHHHH, The Pain!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Gandhi2",
        "review_rating": "2",
        "review_title": "S. Darko - A Donnie Darko Tale - NO NO NO NO NO NO!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "padma_sambhava_india",
        "review_rating": "1",
        "review_title": "couldn't have ruined more of it",
        "review_detailed_main": "well, that was a waste of money, for me, for the producers, the cast and the whole world.\n\nThe only thing that saves the movie from an absolute zero is the fact that the protagonist is pretty cute and walks around in her bare pajamas the whole movie (so that may turn into a sexploitation movie). NOTHING MORE.\n\nThe movie completely fails in any attempt to evoke or fabricate any sort of emotion thru the whole thing. Yes, it tries so hard, it instantly makes you feel bad for wasting your time with slow motion crane cameras, characters looking into nothing with dumbass faces, bad acting, convoluted plot, total lack of meaning in any action and interactions, all characters are total gloomy posers and 1990s alternative music.\n\nJust as an example, like doonie darko, after the actress tries to show that she falls asleep, she sleepwalks, that pretty much gives an excuse for her to appear anywhere in town by a simple scene cut, dressed in her pajamas and conveniently close to the next nonsensical interaction with whomever. Thats the main mode of transportation in the movie by the way."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "magician-humphrey",
        "review_rating": "3",
        "review_title": "Spoils the original - Comically Awful",
        "review_detailed_main": "First 20 minutes spoiled it for me, seeing the 'Rabbit Ears' on the dead girl just totally done my head in. That was to do with the fancy dress party of the first film, why capitalise on an exhausted idea?! What a royal cock up. OMG then the odd bloke building and then wearing a metal rabbit mask, hahaha, this film is hilarious! So many screw ups with comparisons to the first film.\n\nHaving said that, liked the photography and some of the effects were quite unique, petty they were involved in such a badly written film. Shame, Shame, Shame...\n\nIsn't really worth watching if you liked the original, quite a let down in many aspects."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "murnank",
        "review_rating": "10",
        "review_title": "Reversing the roles of \"Donnie Darko\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "bowmanblue",
        "review_rating": "7",
        "review_title": "Not terrible, just unnecessary",
        "review_detailed_main": "The original 'Donnie Darko' movie turned out to be a 'cult classic' and slowly gathered more and more momentum as the years went by. It's still totally watchable, even if you don't entirely understand it! It's weird, twisted and totally surreal science fiction about time travel and a revolting bunnysuit-clad man who warns a teenager in the eighties that the world is about to come to an end in a few days time. Yeah, I never said it was an easy watch and, if you're a fan of David Lynch's films, this should be for you.\n\nHowever... and it's a BIG however, it's 'sequel' (in name only) just doesn't deliver. Its biggest problem is that it doesn't add anything new. In fact, you could almost consider it a 'remake.' It's story follows the original beat for beat, only with a sense of hollowness about it. Despite the actress who played Donnie's younger sister 'Samantha' (hence the 'S. Darko' title) returning, now much older, and experiencing the weird and sinister world her older brother once did, this one just didn't capture the same magic.\n\nIt's certainly not the actors' fault this film doesn't succeed. They do their best with what's given to them. It's worth noting that this isn't written or directed by the man (Richard Kelly) who did the first one. Therefore it lacks the original's sense of visual style and flair, meaning the whole atmosphere just isn't there, along with the classic eighties soundtrack that 'Donnie Darko' possessed.\n\nAll the 'weirdness' is just copied - seemingly - for the sake of it, as if it's desperately trying to be 'out there' and 'deep and meaningful,' but really just coming off as bland and incomprehensible. Yes, the original was odd and many people ended up wondering what it was all about, but even if you didn't understand 'Donnie Darko' you felt like it was an experience worth investing your time in and it was definitely entertaining. My advice: just stick to the original."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Harlemer",
        "review_rating": "3",
        "review_title": "A waste of time and money.",
        "review_detailed_main": "When I found this DVD in a store on discount, I was stunned. I couldn't bring myself to believe that there were people stupid enough to make a sequel to a movie like Donnie Darko, when there was no indication at the end of the film that a sequel could even be made.\n\nIf you've seen and enjoyed the first movie, you'll know how unique and one-of-a-kind it is. The sequel, however, is a pile of messy, incoherent trash that obviously and thankfully was not worth sending to theaters, despite the fact it's a continuation of a cult-classic, cult-following film.\n\nThe \"story\" follows Samantha, the least developed character of the first film, played by the same actress. And let's just say, her acting as a nine-yea-old was better than her performance here. She's on a road trip with her trendy Maggie Gyllenhaal look-alike friend, when their car breaks down and are saved by a hip, cool-as-ice boy played by Ed Westwick, whose most notable role prior to this movie was Alex, from Children of Men. His character, Randy, likes to act cool, meaning he has no interesting qualities other than his adequate good looks. He brings the two girls to a motel in his sleepy home town where a meteorite strikes a windmill, and another Gyllenhaal look-alike predicts the end of the world. What ensues is crappy writing, drama, sub plots, and characters, all which add their own flare to this piece-of-junk movie.\n\nThe only redeeming quality about this movie is how they got a little bit creative with the main character, making her not the living receiver, but the manipulated dead. But that's it! There's NOTHING interesting about this movie, and it's nothing but a rip-off of the first one, creating nothing original, but creating quite a bit of similarities. A sequel is supposed to be it's own movie, as well as a continuation, but S. Darko failed at that. Plus, it was an unnecessary sequel, sent straight to DVD where it belongs.\n\nAll-in-all, I don't recommend this movie. It's boring, poorly-paced, and just a terrible piece of work. Spend your money on a better movie on the discount shelves."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "JKuenzel",
        "review_rating": "1",
        "review_title": "OMG...what was that??? I feel cheated...",
        "review_detailed_main": "...sadly enough, I did not use IMDb for this movie - I usually do b4 watching a new flick. Never again!!! This movie was actually so bad, that after just 30minutes, I got up, got my netbook and checked it on IMDb - I thought I had been given the wrong film... It confirmed my worries and I must tell you:\n\n!!!DO-NOT-WASTE-YOUR-TIME-WATCHING-THIS-MOVIE!!!\n\nThere is movies that waste your time and there is movies that make you angry about the fact that they did so... This is one of the latter.\n\nThere is NO STORY LINE, there is NO FUNNY/SAD/INTERESTING/SCARY/COOL/MEMORABLE MOMENTS in this movie. -ANYWHERE! The chick is kinda cute - THAT IS IT. There is NOTHING good about this film: no sceneries, no nice shots, no nice music, no nice dialog, no nice plot, no, no, no, nothing... I really did try to find something good about this flick, but like another review states: you find yourself saying: \"WTF...?!?!\" every one to two minutes for nearly the entire movie as nothing makes sense (and that is NOT something intended by the storyline/writer), nothing matters, nothing gets you anywhere in this movie.\n\nI think this was made just to be made, not to set any new standards or be a good movie - I think someone wanted to make a movie and did so and that is it.\n\nI have seen a bunch of really bad movies lately - including LEGION - but this is by far the worse and most mundane and uninteresting movie that has EVER found its way on to my computer.\n\nDO NOT RENT THIS - EVEN IF IT IS FREE OR ONLY ONE BUCK! Don't waste your time. Go have some quality time with ur g/f / b/f / wife / husband, walk the dog, clean the litter-box, take out the trash, cook some food, do some laundry, ready a book, talk to the neighbor, watch random TV-channels or simply sleep some - anything is better than watching this p**ce of C**P!"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "sethdevan",
        "review_rating": "1",
        "review_title": "Without a single redeeming quality",
        "review_detailed_main": "\"S. Darko\" tries to maintain the original feel but just comes off as a poorly done high school mockery. Its storyline so translucent and unimaginative that you'll wish someone would punch you in the face just so you could feel something. I feel that Nathan Atkins and Richard Kelly owe me 103 minutes better spent on watching nearly anything. These teens girls can't be like any real teen girls... can they? Please? NOBODY needs to see this movie. In fact, if you were a fan of the prequel save yourself the embarrassment. If you weren't a fan of the first one then you've still got something to lose. Trust me. I was left wishing that all the characters had been sacrifices. I would have felt better at the end. At least a sense of accomplishment. Maybe that would undo how violated I feel. It was worse than when my Aunt Margaret made me watch all 14 video cassettes of her \"Memories of Kentucky\" and did a running commentary of the \"squash salad\" and \"hour of hair-drying\" highlights. This movie is meaningless. Trivial. Without virtue or memorable moments of any kind."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "tomsan84",
        "review_rating": "1",
        "review_title": "a shame",
        "review_detailed_main": "in short I chose not to rate this movie since I didn't see it all the way through (stopped at 'bout 1 hour). 'irritations' started early (although the intro is pretty nice) with the corvette (i'm not sure) and the pack of Sig's in the sleeve, what a cliché's. the whole story just doesn't make any sense and doesn't want to make me see the end of it.\n\nI have to admit, the fact that Donnie is such a great movie makes it almost impossible to make a sequel. Sam is perfect for the role and she is the only one I 'bought' but the rest of it is garbage.\n\nan awful shame that this movie is made, since this rubbishness rubs of on one of the greatest movies."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "vulcanism22",
        "review_rating": "1",
        "review_title": "THEY ruined it.....",
        "review_detailed_main": "I feel so sorry for the director and the fact that it was filmed in beautiful Utah, but he had not the sense to film in in a better place than the crappy Salt palace region. what is up!!!? you could have put them up in the Avenues..plenty of trees..plenty of DD atmosphere...darkness and such. instead it was filmed in the vicinity of the Great Salt Lake, which is a beautiful place, but its just not right for the DD sequel.\n\nThis film lacked money, this is so obvious, either that or someone blew it on the wrong things. IT will NEVER EVER come out of the depths like DD did, once again directors are making movies that steer toward those with no attention span, pulling together anything to make a buck.\n\nthe movie explained nothing in conjunction with Sparrow...how did her grandson end up in Utah? Just holes holes holes...I can't believe anyone let this get made...does the director reside in Utah? Shame on you for making such a crappy Sequel.\n\nI hope someone redeems DD with a better third movie day...these things have happened.\n\nJust horrible, horrible, horrible!"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "lost-in-limbo",
        "review_rating": "4",
        "review_title": "\"I believe life sucks and you die\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Escaping_Fate",
        "review_rating": "1",
        "review_title": "Complete joke, so very, very awful",
        "review_detailed_main": "If you are, like me, a massive fan of Donnie Darko, DO NOT WATCH THIS.\n\nIt is so bad it will make you forget the good things of the original. The original (or should i say the only Donnie Darko film because in my opinion this film is such a disgrace i now refuse to even consider it as a sequel or to be in relation with the first one) was amazing, it dealt deeply with emotion and relationships and of course, the theory of a time loop, this however is bad on endless levels.\n\nHow this could have been allowed to be made is beyond me, really dreadful and when your film is released onto DVD instead of being shown in the movie theatres you know it must be bad."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "srigby-2",
        "review_rating": "1",
        "review_title": "Uhhh Riiiight",
        "review_detailed_main": "This was a pathetic take on the original film, heck this was a pathetic take on an original script. Beyond the fact that the film made no sense the characters were hollow. Each sequence of events were random and the script and the story did the poorest job of of streamlining and making a fluid connection between a series of seemingly pointless events. Why, why was this made? What was the point? This added nothing to the original story and added less as an original story.\n\nDonnie Darko was a great film. As complicated as time travel, warm holes, and near death experiences can be to capture well in a story, it did it very well. This film did not do so well. If you liked the original film you may find this to be a grotesque caricature and if you didn't you may find this unbearable."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "pinktuesday-733-491612",
        "review_rating": "9",
        "review_title": "Really really good and worth watching!",
        "review_detailed_main": "I thought this film was amazing. The camera-work was astounding as were the landscape shots. The story was beautifully understated, and although a little confusing, it was intriguing and just creepy enough. The general feel of the film, with the soundtrack and the camera-work and the storyline all working together, was quite touching. I think its such a shame no one seems to review this film well. It is definitely in my top ten favourite movies. I have never actually seen Donny Darko, so maybe people would enjoy this more if they didn't compare it to Donny Darko and saw it in its own right? Overall, sweet, creepy, and beautiful. Almost perfect."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "windypoplar",
        "review_rating": "6",
        "review_title": "um, blasphemous, but not bad on it's own",
        "review_detailed_main": "When I saw this on the rental wall I was psyched, A \"Donnie Darko\" sequel and with Daveigh Chase!? But I'm not stupid, I read the back of the box and noted that Richard Kelly had nothing, I repeat, nothing to do with this. Argh!! At least When George Lucas altered (bastardized) Star Wars, it was his stuff! This is two guys I never heard of, Nathan Atkins and Chris Fisher. Sigh.\n\nFirst off if you've never seen Donnie Darko, do so, please. It is possibly one of the best American films ever made. Now, than brace yourself, cause from the moment your realize our tow leads are stranded in a desert town, you know we're in trouble. It doesn't get better. The ending is also troublesome. Whereas Donnie saved the world and did so by selflessly sacrificing himself, Sam appears to manipulate the dead in order to, what? Grow up? Save her bitchy friend Corey and return home? It's vague and annoying. Seriously, what's up with the meteorite?\n\nNot that all is bad, the photography and music are good. Ed Westwick, when God created the perfect man he called him \"Ed Westwick\", is good as the town drunk. There are a few decent shocks, Hey is that really Elizabeth Berkley!? but overall you wish this had been better done, or better yet, not done at all."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "lysha_me",
        "review_rating": "1",
        "review_title": "Bleh",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "logangiese",
        "review_rating": "2",
        "review_title": "PLEASE DON'T SEE THIS MOVIE, it truly is awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "KineticSeoul",
        "review_rating": "3",
        "review_title": "Very unnecessary sequel!",
        "review_detailed_main": "A sequel or so called continuation of the original film that should have not been made. Even few of the people that played a part in making this movie was like \"why does there need to be a sequel?\" and yet they went ahead and made this cheap crappy movie. I just wanted to forget this movie as soon as I finished watching it. This movie is simply unnecessary and doesn't add anything to the \"Donnie Darko\" film but subtracts it. This one is all over the place but just doesn't seem consistent. It's like the writers wrote down a bunch of scenarios and just decided to mash them all together in a incoherent and in a manner that is not very clever. I think they first tried to get Maggie Gyllenhaal who played Elizabeth Darko to play a part in this movie. But I guess she smartly declined. And now this revolves around Samantha Darko who is Donnie's youngest sister and it takes 7yrs after what happened in the first \"Donnie Darko\" film. It started out like it might be a watchable flick but as the movie started to progress it got worse and worse. And my gosh the special effects are just freaking awful, even for a straight to DVD movie. Movies like this goes to show that if you don't have a creative or good idea for a sequel, don't go for it! I am just going to forget that this movie ever happened.\n\n3/10"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "zfqhf5z02",
        "review_rating": "1",
        "review_title": "Absolutely appalling",
        "review_detailed_main": "I am a fan of DD. I so loved the original i bought two copies of the DVD because i wore out the first copy through use. Then they released the director's cut, i bought that too and was that ever a disappointment... Now this... thing ? has come out; what is it ? what does it have to do with DD except for sharing the title ? is the presence of his sister supposed to legitimize the use of the Darko moniker ? i truly do not understand how can movie studios approve such appalling material, sequels yes - and there have been quite a few that were much better than the originals, but movies like this are probably worked out over lunch, with sketchy and vaguely defined ideas jotted down on a napkin and passed to the director to be fleshed out as-it-goes. there's no other explanation guys, this is so bad it's unbelievable that in times of recession they'd think people are going to throw away money on such rubbish in any amounts.\n\nDo not buy or rent this DVD, not only it has *nothing whatsoever* to do with Donnie Darko except the title (and were it a good plot I'd forgive them) but it's just bargain-bin garbage. \"Plan 9 from outer space\" for the 22nd century boys&girls, but this has no hope of becoming even a classic for bad cinematography, it truly is that bad and has no redeeming features.\n\nFinally, in the hope that somebody with weight in the movie industry monitors these boards, please, i beg you, stop. just stop."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "badbadbadbad",
        "review_rating": "1",
        "review_title": "Fee Seas",
        "review_detailed_main": "This film is like an episode of Buffy the Vampire slayer patched together with images plagiarized from Donnie Darko. Attractive people substitute for substance. The actors are bad. The soundtrack is bad and also bad. The dialog is consistently wooden. The CGI sequences are cringe-worthy, like a video game you can't play. The Star Wars Holiday Special and Troll 2 come to mind. Some unrelated party made off with the rights to a good film and churned out a turd, hoping enough people would be fooled into thinking it's a real sequel. This film is farcically bad; its only entertainment value is of the so-bad-it's-good variety."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "slash-strike",
        "review_rating": "5",
        "review_title": "This is not Donnie Darko",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "lennonforever",
        "review_rating": "1",
        "review_title": "Complete and utter disregard for the Darko tale",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "gnostic_paladin",
        "review_rating": "1",
        "review_title": "Made by people who didn't like the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Jamie_Seaton",
        "review_rating": "",
        "review_title": "no, no, no, no, no !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "groovymike_16",
        "review_rating": "8",
        "review_title": "Not the abomination it will be treated as...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Johannesn",
        "review_rating": "7",
        "review_title": "Forget it's a sequel. It's really good.",
        "review_detailed_main": "This movie can stand on it's own, you don't need to have watched Donnie Darko to watch this movie, or to understand this movie, who really understands Donnie Darko anyway. It's meant to be mysterious. This movie gave me the same fantastic atmospheric feeling of mystique that Donnie Darko did.\n\nCan we just for one moment forget that this is supposed to be a sequel to the greatest movie of all time? I think people are way too harsh on the movie. I watched the movie with an open mindset and I tell myself that if I had never seen Donnie Darko I would still really enjoy this movie.\n\nI didn't see any obvious flaws or paradoxes while watching, it was just enjoyable and the music was very unique too. So unique that you can't even find that one particular good song from the movie on YouTube. Usually soundtracks are everywhere for free but not this one.\n\nIt had a lot of parallel action with Donnie Darko, and I appreciate that.\n\nDefinitely worth the watch if you are an open minded Donnie Darko fan or if you have never watched Donnie Darko and don't intend to. Because you obviously wanna watch Donnie Darko first."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "GriefEriksson",
        "review_rating": "1",
        "review_title": "Don't waste your time. Honestly no redeeming qualities.",
        "review_detailed_main": "S.Darko was awful. For those who loved Donnie Darko, if you are sniffing around on this page to see if this movie is worth watching, its really not. Don't let people lure you into thinking this film has some redeeming qualities that maybe some people just didn't \"get\". It has no redeeming qualities. There is nothing to \"get\" except perhaps bitterly disappointed. Richard Kelly didn't write or direct this sequel, and those who tried to fill his shoes Failed. This just stinks.\n\nI hope for your sake that my review doesn't inadvertently stoke your curiosity, luring you into watching this just to \"see how bad it really was\". Don't fall for it. Right now you might be thinking \"it CAN'T be THAT bad\" but you would be wrong, I am telling you don't fall for it, its a mental trap.\n\nAround the midpoint of this movie, I honestly remember thinking about some of the poor reviews I had read and still hoping to myself \"Its not totally worthless, maybe it will come around by the end\". I was wrong. Don't hold out hope. It just gets worse and worse. I am sorry I ever watched this. If I could time-travel, I would go back in time wearing a metallic bunny mask and attempt to scare myself into not watching this. But then I suspect that Me-in-the-Past probably would have just been even more curious and watched the damn thing despite the warnings from Future-Me.\n\nBasically if you've read this far, you're already boned. Just watch the cursed movie and get it over with, then write your own warning to others. But THEY won't believe you anymore than you believed me. I'm sorry for ever getting you into this. Its all my fault. For me, watching this movie was the equivalent of the time I tried to find out the definition of \"munting\"; the verb \"to munt\". Once I learned it, I couldn't un-learn it no matter how much I wanted to. Once again, I apologize in advance."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "JaimeManzo88",
        "review_rating": "1",
        "review_title": "These Guys Are Idiots",
        "review_detailed_main": "Chris Fisher and Nathan Atkins, Idiots. They have defiled Richard Kelly's Masterpiece. This movie was terrible in every way imaginable, They definitely did not understand Kelly's true genius and vision, And attempted to rip off his work... and FAILED... TERRIBLY. The only thing Chris is qualified to film is commercials, He understands nothing about creating truly great film and therefore should not associate with ANYTHING DARKO. I'm surprised he's not behind other disasters like all those terrible \"Genre\" Movies. For an untalented, inexperienced piece of scum I wouldn't recommend going back to film school, I WOULD RECOMMEND A CAREER CHANGE!"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "sherri-51",
        "review_rating": "1",
        "review_title": "Pretty much one of the worst movies ever",
        "review_detailed_main": "I don't even know what to say. I speechless. It's that bad! Any reviews over one star must have been written by someone connected to the movie. It makes no sense. It is horribly acted. It is an hour and a half longer than it needs to be. My review is more interesting. My review has more plot. Please make it end.\n\nI don't even know what to say. I speechless. It's that bad! Any reviews over one star must have been written by someone connected to the movie. It makes no sense. It is horribly acted. It is an hour and a half longer than it needs to be. My review is more interesting. My review has more plot. Please make it end."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "garissonangel",
        "review_rating": "3",
        "review_title": "A shameless remake bereft of original ideas.",
        "review_detailed_main": "Do you want to know what it feels like when you die? Watch this & find out, (at least how dying of boredom feels like anyway). Unlike many others out there, I was quite excited at the prospect of a DD spin-off. I imagined the principle ideas from the original were easily extendable into other story lines & characters. I was actually looking forward to watching this film & saved it for a special moment to savour. Fool that I am. Well if I could travel through time, I'd certainly change that. It's not just that this film has thoroughly dislikeable characters, trashy dialogue, uninspiring locations, an abysmal soundtrack, amateur special-effects, and no plot line, its' real crime, which is truly horrific, is that it offers absolutely nothing new. There is not a single original idea in this film. Everything is taken from its' predecessor and I mean everything; - direction, characters, sub-plots, principle events...everything. This is a shameless remake for a teen audience, (although It's unlikely to be able to compete with the appeal of Twilight there). The film does raise one thought provoking question; why on Earth would someone want to do this? I'll check my mailbox everyday till someone tells me."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "MovieShrink7",
        "review_rating": "1",
        "review_title": "Dear God why?!?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "chris-olson2",
        "review_rating": "1",
        "review_title": "Worst Movie of the Year Anyone?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Abztrakt",
        "review_rating": "5",
        "review_title": "Not what I wanted, but I didn't bash it.",
        "review_detailed_main": "This film has basically no positive reviews for it, so, let me give an unbiased statement.\n\nThis film, being a sequel, is expected to provide fans with the criteria they love (a strong story). This film did not deliver such. This film is more of just, any other movie, with borrowed names, events, and objects from the original.\n\nThe film's acting was not bad, the story itself wasn't too strong but it wasn't awful, and the wrap-around events were all pretty simplistic.\n\nOver all, I would say if you had any hunches telling you to watch this movie, go for it. If you got turned off from this film because of what you've read, don't believe the counter- hype.\n\nIf you're looking for a spell-binding sequel, then you're going to have to go someplace else. If you're looking for a new movie to like, with some familiar content and comfortability, then this film is for you.\n\n5/10."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "dschmeding",
        "review_rating": "4",
        "review_title": "Well, sure could have been worse but...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "snoopaloop1981",
        "review_rating": "",
        "review_title": "I've seen way worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "orlandobloom91691",
        "review_rating": "8",
        "review_title": "People Are Picky Picky...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "icanseehimrightnow",
        "review_rating": "6",
        "review_title": "S. Darko proves to be just the younger sibling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Lanraso",
        "review_rating": "2",
        "review_title": "What a way to make a mess of the first film",
        "review_detailed_main": "To call this movie bad is a good thing. The truth, without Jackson Rathbone's talent this film would have been a total crapper but still, this film kinda ruined the first for me.\n\nIt was a bad idea to want to exploit the fans by giving this grade of rubbish and IQless music video trash.\n\ncertainly too much for a noname director and the script, its like bad fanfiction and we get the butterfly effect sequels all over again.\n\nI kinda wanned a sequel after I first saw Donnie Darko because there was potential, and this wasn't the potential the fans deserved, it wasn't good, nor did it offer the fans anything worth waiting for, it was just a bunch of fanfiction written by someone who was unable to comprehend what Donnie darko meant for the millions of fans around the globe... and having said that... Im kinda glad it blew up in the faces of the idiots who tried to exploit us."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "southoasis",
        "review_rating": "2",
        "review_title": "Complety rubbish.",
        "review_detailed_main": "When i first heard of S Darko, i was like, \"How can they make a sequel. Well, they pretty much cant. I watched the first 10 minutes and immediately found myself falling half asleep. I am a fan of Donnie Darko, but S Darko just ruins the whole Darko business.\n\nIts like saying there going to make a shawshank redemption 2 or Pans Labyrinth 2. Its just not going to work. But the scary thing about it is, how they thought it was good enough to be released. But there was some good parts, like the credits, when i realised it was finished. I actually found myself relieved. But if you do see this film, do not buy it. Don't say i didn't warn you. No matter how tempted you are, do not get it.\n\nI hope my report was helpful."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "trellamec",
        "review_rating": "1",
        "review_title": "I don't even know where to begin...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Pantalaimon60107",
        "review_rating": "3",
        "review_title": "How the hell...",
        "review_detailed_main": "I have to say that I should have seen something like this coming. I mean, the film had a completely different crew, didn't have a theatrical release, the supporting cast was filled with nobodies, etc. etc. Not that any of that is bad, necessarily; there are good sequels that consist of different crews, not many good films that don't have theatrical releases (none that come to mind, but I'm sure a few are worth a look), and casts of nobodies can really help out, but... There's almost nothing that's good in this film.\n\nI will say, however, that the opening five or six minutes are promising enough. The premise itself is promising, too, but just about everything goes wrong after the first five minutes, with all the details fleshed in, which... There's no way to understand this film. I'll say that. Oh, it's simple enough, but there's no way to understand the logic behind most of the characters' actions regarding the tangent universe. How they know what they know is just... Eerie, or the writers being lazy.\n\nI figure I'll go ahead and talk about the story instead of just bitching about its shortcomings, although shortcomings are more than abound. Samantha and her friend are stuck in Utah and the strange events from the first film are thrown in just for kicks. While the world slowly, steadily comes to an end, there's a kidnapping, or maybe that was before they came to town, and there's a party or two with music that nobody at a party at that time would listen to (another complaint that I've got is the soundtrack; Donnie Darko had an amazing soundtrack, whereas this... doesn't).\n\nThe bottom line is that this film can't stand with Donnie Darko because it falls so short, but it can't stand on its own because it relies so much on the previous film, which isn't even logical at points, for reasons that anyone unfortunate enough to see this film can figure out for themselves. This is a terrible movie. It's sh!t. You'd be better off buying and watching the original film, the Director's Cut if you've got the original release, or the original release if you've got the Director's Cut. It's money better-spent than spent on this."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "groucho_x",
        "review_rating": "3",
        "review_title": "SDARKO is like BROLEX",
        "review_detailed_main": "Just like a bad, lame imitation of the original. A bit of time travel, bunny rabbits and an old character.\n\nI could not really get through the end of this boring bunch of pointless memorabilia of the old Donnie Darko dispersed through such a mindless plot.\n\nSome people pointed out that it's impossible to make a sequel of such a cult movie like Donnie Darko. Then why would some (crazy) guy embark on a similar project? For money, of course. Some people who watched and liked Donnie Darko would be curious to see if the sequel is as good as the original. Most people (I think) are curious to see how crappy such a senseless sequel can be. The conclusion is: if you liked Donnie Darko then you'll probably watch S. Darko. The consequence is: the producers will make a lot of money out of this piece of crap."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Jackpollins",
        "review_rating": "1",
        "review_title": "The worst film ever made, I'm almost too mad to even write a review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "Buckaroo_Banzai_",
        "review_rating": "1",
        "review_title": "Oh no.",
        "review_detailed_main": "This title made me want to time travel just to stop the the movie from happening !"
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "rhaynes1974",
        "review_rating": "4",
        "review_title": "Boring but not dismal",
        "review_detailed_main": "Not quite as dismal as some of the reviewers have made it out to be but boring as all hell. I'm in total agreement that this doesn't come close to the very unique original and does somewhat tarnish its reputation slightly.\n\nIt's still better than a lot of the straight to DVD dreck that litters the shop shelves of late though, give some credit where credit is due. The performances are at least fair to middling and all the leads give this their best shot. You'll still find this one instantly forgettable though as opposed to the genre bending original.\n\nAt least they tried to make a different film, it just would have been nice if they also tried to make an interesting film too."
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "lx_baatz",
        "review_rating": "8",
        "review_title": "Deus Ex Machina",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "glowierin",
        "review_rating": "7",
        "review_title": "As a sequel, it fails. As an homage to Donnie Darko, there are some redeeming qualities.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1231277",
        "movie_name": "S. Darko",
        "movie_rating": "3.6",
        "review_username": "toll-8",
        "review_rating": "1",
        "review_title": "Could possibly ruin the brilliance of the first.",
        "review_detailed_main": "Let me start by saying, this film is the sequel to the brilliant Donnie Darko but don't make that reason force you to watch this. My advice is to avoid it at all costs.\n\nThe film tries to be its predecessor but over complicates it, eradicates all sense of emotion and drama and casts actors who just cannot act. So basically the exact opposite to Donnie Darko. Sure that was complicated but the end sewed most things up and also it leaves so much lose that you want to watch it again and again with intrigue. This film however I barely made it through one full viewing. It is seriously bad.\n\nRight, it is about Donnie's sister, Samantha (Chase). She is in the first film but is eleven years old. Now she is eighteen and run away from home as her family has dismantled after her brother's death. As her and her mate Corey (Evigan) drive across country their car breaks down, leaving them stranded in a desolate town with weird town's folk. In this town lives a homeless Desert Ops veteran who has been having visions of Samantha telling him the world is going to end. When he sees her he tells her this and she begins to think about what this means. Next thing you know Samantha is killed but her mate is given the chance to go back in time and alter it so that she survives the car accident. I'm going to stop there for a second as this was a huge problem in the film. Her friend goes back into time but instead of preventing the car accident, she saves her friend and remains in the car that crashes. If she knows the outcome why doesn't she get out the car or even tell the car to go the other way. To me this was one of many major plot holes.\n\nContinuing on, Samantha is now alive and her mate dead but she isn't given the opportunity to save her friends life. We then interweave all the crazy sub-plots that involve a pointless town rebel, who has a brother who went missing along with another child, the town geek falling for Samantha and doing all he can to get with her and a man attempting to sell Christianity to her as well as having a strange relationship with one of the lost boys mother. What the hell! Donnie Darko had sub plots but they all related to the main plot. These ones just don't, and if they do the film could have done without them.\n\nSamantha then finds the missing boys although now dead, gets the veteran arrested and then has a date with the geek who seems to turn into an alien during a meteor storm. Then she rewinds to the beginning and decides to go home before this happens again. What a crock of pony. This tries to outdo the original and it really, really, epically fails. It is so bad.\n\nNothing in this film makes any sense. Throughout I was puzzled as to what the hell was going on and at times I was even bored. All the characters are stereotypical and clichéd. They turn up at a desolate town and we have a geek, intact with glasses and high pants, the typical rebel, with sports car and beer and a weird religious nut. We also get a cameo from Elizabeth Berkley from Saved By The Bell, and her role is just pointless.\n\nSeriously never, ever, ever consider watching this film. The brilliance of the first one could be tarnished because of this dire sequel. We even get a reimagining of the bunny from the original and in this film it has no place, they have just brought it back to tie something in with the first. The director of the first reiterates that he had nothing to do with this film and has stated he wouldn't work with any of the actors who starred in this. If you haven't seen the first, watch it, you'll be intrigued, but don't bother with this. There is a very good reason it was released straight to DVD."
    }
]