[
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Calicodreamin",
        "review_rating": "3",
        "review_title": "Snooze",
        "review_detailed_main": "While this tries to be a psychological thriller 'deadly illusions' is a snooze. The acting doesn't feel authentic and there's no chemistry. The storyline is fairly predictable and the brilliant twist falls flat. Characters lacked depth and made it hard to connect to the story. Story was basic and lacked development."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Sir_AmirSyarif",
        "review_rating": "3",
        "review_title": "Silly, third-rate 'Basic Instinct'-y thriller",
        "review_detailed_main": "Mary Morrison is a bestselling author who writes novels about \"passion, sex, lies, betrayal.\" In order to focus on writing her next novel, Mary Morrison hires a young, hot nanny to look after her children - and maybe her husband too. It's pretty obvious where this is going. Anna Elizabeth James' 'Deadly Illussions' is a silly, paint-by-numbers, third-rate 'Basic Instinct'-y thriller with its thin and definitely confusing plot. Anyone who can sit through this without cringing at least once deserves an honorary Oscar. Stream it!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "adrian-weale",
        "review_rating": "3",
        "review_title": "A throwback to 80s made for cable erotic thrillers - but not in a good way.",
        "review_detailed_main": "The one redeeming feature of the 80s erotic thriller genre was that we got to see attractive performers get their kit off and do their thing, albeit in a usually clichéd and highly derivative set up. Sadly, that doesn't happen here. We've got the clichés and the lack of originality but none of the eroticism.\n\n3 stars for the cast for managing to keep straight faces but that's about it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dansalisbury",
        "review_rating": "1",
        "review_title": "Reading the reviews is more entertaining than the film.",
        "review_detailed_main": "The only thing this film is good for is slowing the passage of time, perhaps useful if you're on your deathbed. However I feel you'd be begging for death's sweet embrace far before the end credits.\n\nWorth watching solely for the old woman in the library who does the worst keyboard acting I've ever seen in my life."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "austindoerr",
        "review_rating": "2",
        "review_title": "I wish I could unsee it",
        "review_detailed_main": "1hr in and I thought, surely this is about to get good; and then it literally got worse. My only regret was not getting blacked out drunk before it started.\n\nI do not recommend."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "liferightnah",
        "review_rating": "1",
        "review_title": "Possibly the worst movie of 2021",
        "review_detailed_main": "This movie is so bad, I'd rather watch Kanye West talking about himself for 10 hours straight"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "citaernanda-97184",
        "review_rating": "2",
        "review_title": "Watch it if your day is really good and want to balance it out by feeling upset a little bit",
        "review_detailed_main": "I'm so upset that this movie had to be this bad. Don't get me wrong, it wasn't boring but it was almost entertaining to watch how bad its plot and acting were.\n\nI mean, the villain CAME OUT FROM NOWHERE. The story of the mother being a writer is almost useless. There was no correlation between the character and the conflict. The motives and background were definitely not in sync with the plot it meant to give.\n\nThe acting was not helping either. When they supposed to be happy they didn't look sincere, when someone supposed to be in shock, they didn't even do what people supposed to do when they're shocked.\n\nI personally don't recommend it but go watch it if your day is so good and you need to balance it out by feeling upset a little bit."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Shoebarno",
        "review_rating": "1",
        "review_title": "Quite boring and doesn't make sense",
        "review_detailed_main": "The movie is seemed to be quite lost about what story it was trying to tell. It could have been a good psychological thriller but it ends up being a sometimes sexy and sometimes meh slasher flick.\n\nThe \"villain's\" goals are unclear and nonsensical. The exposition of what makes the villain the villain is hamfisted and comes out of nowhere. The pieces of the early parts of the movie that is used as \"foreshadowing\" do not work. And in the end, as always, everything is blamed on a mental illness that the writers (and Hollywood really) don't seem to understand.\n\nI don't recommend watching this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jessdelong-25072",
        "review_rating": "6",
        "review_title": "Has potential, the directing ruined it",
        "review_detailed_main": "Honestly it has potential, but I really feel that with a different director, the movie would have been a better thriller. The editing could have also been better."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mraedkhatib",
        "review_rating": "1",
        "review_title": "bro netflix fd me up telling me it's number one in canada rn. Wtf is this lie",
        "review_detailed_main": "This is the worst movie i have ever saw i couldn't even finish it i stopped half through it"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ShriArunKumar",
        "review_rating": "10",
        "review_title": "So bad that it's actually entertaining.",
        "review_detailed_main": "Saw it on a lonely Sunday. From the beginning I knew that it's going to be an utter crap. But I could not stop watching it.\n\nIf you want to know how bad a movie can be, watch this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "luxferxx",
        "review_rating": "",
        "review_title": "WHY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ellebbz",
        "review_rating": "7",
        "review_title": "A misunderstood movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "scarlettimogen",
        "review_rating": "1",
        "review_title": "Dear god",
        "review_detailed_main": "This is bad. Kristen Davis is an absolute embarrassment....her acting is forced and cringingly awful. I can't believe Dermot Mulroney signed up for this absolute garbage. I mean he's not an Oscar worthy actor but he's worth way more than this. It tried so hard to be a psychological thriller and it fails completely and utterly. Avoid at all costs"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bigturk-76313",
        "review_rating": "1",
        "review_title": "Heinous",
        "review_detailed_main": "I'd lick a 9v battery for 2 hours rather than spend the time hours watching this movie again."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fiver5",
        "review_rating": "1",
        "review_title": "The only deadly illusion is that this is any good",
        "review_detailed_main": "Absolutely one of the worst films I've ever seen! 1 star feels generous. Made no sense!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "guilhermecoelhorocha-66-787211",
        "review_rating": "1",
        "review_title": "DOES NOT MAKE SENSE. EVEN IF IT WAS A SOAP OPERA!",
        "review_detailed_main": "Questions: WHO PAID FOR this trash to be filmed? WHO LET IT air after watching it? WHO rated over 2/10?"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bus-86832",
        "review_rating": "1",
        "review_title": "I made an account just to write this review",
        "review_detailed_main": "I will never get those two hours back. Don't waste your life on this. On my deathbed I will regret this movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "winecellarwomack",
        "review_rating": "1",
        "review_title": "Bras",
        "review_detailed_main": "Is that what it's like when you go to try on bras at a fancy boutique? It made me very uncomfortable LOL"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "Delusions(?)",
        "review_detailed_main": "Do I consider this a great movie? No. Do I think it can be entertaining, especially if you consider the \"competition\" this has when it comes to similar movies? That is a very big yes. So I reckon I am a little bit surprised, but I reckon when people get savvy and snarky and cynical ... I almost want to board their train to be honest.\n\nOn the other hand, I also have expectatins to fulfill. And those include me being nice to movies from time to time. This being one of those instances. Especially considering that the shy one from Sex and the City is almost the complete opposite in this one ... Quite raunchy role she gets here. It is all in good fun ... if deadly games can be considered good fun that is of course.\n\nTry not to take this too seriously and you'll have a good time. All the mayhem and insanity included."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "samkruger-10126",
        "review_rating": "1",
        "review_title": "One of many who created an account just to rate this flaming pile of cheetos flavoured trash",
        "review_detailed_main": "Wtf even was that??? You know what, just throw the whole movie away."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aunwin2002",
        "review_rating": "8",
        "review_title": "Did you all watch a different movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "emiliebekaert",
        "review_rating": "7",
        "review_title": "The ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "phuongchi-80873",
        "review_rating": "1",
        "review_title": "Terrible acting, execution, camera work",
        "review_detailed_main": "The idea of this movie is not horrible. It's just bad and cliche 5/10. The worst thing is the acting. Omg it's like K. Davis never acted b4. So stiff, no emotion, clumsy much. The direction is also bad. Some stupid camera shooting... I want my time back."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "marcus-22692",
        "review_rating": "1",
        "review_title": "Haha",
        "review_detailed_main": "Hahahahahaha. Hahhahahahahahahahahahahah. Hahahahahahahahahaha."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "verycoolmydude",
        "review_rating": "1",
        "review_title": "Once again a movie that spreads misinformation by claiming DID/schizophrenia = killer, disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "chanevdm",
        "review_rating": "1",
        "review_title": "No.",
        "review_detailed_main": "I have never seen worse acting. It's hard to watch."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "KM777",
        "review_rating": "1",
        "review_title": "No 4 in Ireland on Netflix-WHAT",
        "review_detailed_main": "An absolutely ridiculous movie...How can it possibly be in the No 4 slot of the most watched movies in Ireland on Netflix."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "annaamelia-82916",
        "review_rating": "7",
        "review_title": "I didnt hate it like everyone else",
        "review_detailed_main": "It almost had a happy ending 😭😭 I didnt know what was real and what wasn't throughout the whole thing. I thought it was a good thriller suspense movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rebeccaritter-63149",
        "review_rating": "1",
        "review_title": "DEADLY STUPID",
        "review_detailed_main": "Worst acting I've ever seen in my life. Dumbest movie I've ever seen. This should be banned in all countries for how terrible it is. Lord, help us all."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "matt_jacobs1",
        "review_rating": "8",
        "review_title": "If you enjoy classic thrillers, then this movie is for you.",
        "review_detailed_main": "Don't listen to the negative reviews. This movie is a thriller and exactly what it says on the tin. If you're expecting it to be something else, then you're wasting your time. Having said that, I enjoyed every bit of it. It was slow paced, character driven, tense and very well made. Yes it's corny and yes it's also trashy in parts too, but that's what makes a thriller a classic. There are some very raunchy parts too, which were not only pleasing to watch, but they added a 'forbidden fruit / Pandora's box' feel to the relationship between Mary and Grace. All of the negative reviews were clearly written by people expecting something completely different to what it actually is. Like I said if you are a fan of thrillers than this movie is for you."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "SolaceSolitude",
        "review_rating": "6",
        "review_title": "Black Bear (2020) meets Swimming Pool (2003)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "puzo12",
        "review_rating": "1",
        "review_title": "Bullsh**",
        "review_detailed_main": "I hope this movie will be Winner of golden raspberries in all categories"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hallesq",
        "review_rating": "1",
        "review_title": "Is it legal for a movie to be this numbingly boring and still be labeled a thriller?",
        "review_detailed_main": "This movie is Exhibit 1 in support of the claim that a thriller can be mind-numbingly boring. This movie is a \"Give me back the 90 minutes you stole from me, Netflix\" event. Instead of churning out hideous fare like this, with the hackneyed, cloaked-in-menace \"mysterious stranger\" at the end, why doesn't Netflix concentrate its resources on a few really good shows? Sure, people come to Netflix for the Coen Brothers or for Better Call Saul and maybe that's how Netflix justifies pumping out drivel like this thing but, on the other hand, I'd be willing to bet that movies like this drive away as many subscribers as Better Call Saul attracts."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "loganjamieson",
        "review_rating": "1",
        "review_title": "Are they paying TikTokers to lie and promote this movie?!",
        "review_detailed_main": "Why are people on tik tok hyping this up and how is this #1 in Canada.\n\nIt's ok as a p*rno I guess, if that, but as a movie it's pretty bad"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mcdon87",
        "review_rating": "1",
        "review_title": "Don't do it",
        "review_detailed_main": "I watched the first 10 minutes then fast forwarded through it all, stopping a few times to watch a minute here and there.\n\nProbably did it all in 22 minutes. You don't need to watch it all, it's soo predictable. Absolutely terrible.\n\nI want the 22 mins of life back"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Horror_Flick_Fanatic",
        "review_rating": "1",
        "review_title": "Absolute trash",
        "review_detailed_main": "Branded as a psychological thriller, it isn't psychological nor a thriller. The true horror is that this movie occupies space on Netflix servers. Who wrote this crap?"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "betul_ayberkin",
        "review_rating": "1",
        "review_title": "Is there a lower rating than 1?",
        "review_detailed_main": "Really lame and bad. Nothing to see in the movie. I was expecting some action till the end, nothing, just boring."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zack_gideon",
        "review_rating": "6",
        "review_title": "Oddly mesmerizing",
        "review_detailed_main": "I don't know, it's not going to win an Oscar but it's an oddly mesmerizing film. I was entertained throughout it. It really liked the performance of the nanny. I enjoyed it, it's almost dream like. If you want drink some Chardonnay and pass 2 hours this is a good choice!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "firoozh",
        "review_rating": "1",
        "review_title": "Stop making garbage",
        "review_detailed_main": "Netflix should stop it's garbage factory. They sponsor one or two films like Mank or Roma and the rest of what they put out there is low quality trash. All cliche and formulaic. Entertainment doesn't have to be stupid. Combine ten of these trashes' budgets that you make and hire independent talented film makers and screen writers"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jimwaldothefirst",
        "review_rating": "9",
        "review_title": "A movie for thinkers",
        "review_detailed_main": "If you like movies that keep you thinking WTF, what is going on, who, how, what? repeatedly throughout the movie then this might be for you.\n\nThere are elements that still go unanswered, or they might not, it all depends on what you decide is real.\n\nThis movie is weird, its unnerving at times, it disturbing at times and it can leave quite an uncomfortable kind of cringe feeling.\n\nWithout giving away any of the plot I think people struggle to understand that there is more than one story going on at a time here, its almost like 3 rolled into one, as I said, its really a movie for thinkers. Once you can figure at what those 3 stories are then you may have a better understanding of what is going on in this movie.\n\nEven until the very last 30seconds of the movie, if you have followed it, thought about it, and haven't dismissed it as a boring piece of randomness because your brain switched off an hour ago because of the complexity of the plot, then you should be asking yourself the question... Who, what, why...?"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Fairbrit",
        "review_rating": "6",
        "review_title": "In someone else's hands it could have been so much better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "milomaxschouten",
        "review_rating": "2",
        "review_title": "But...but why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sputnik0913",
        "review_rating": "1",
        "review_title": "really really bad",
        "review_detailed_main": "How could you do this to my charlotte. cliche and no turning point waste my life"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hayaonallah",
        "review_rating": "1",
        "review_title": "#1 Most Cringe-Worthy Movie on Netflix is the only list this movie should be on",
        "review_detailed_main": "This movie was so terrible on all levels imaginable. The acting was awful, and the script was even worse. The unraveling of what had supposedly happened just comes out abruptly without diving into any details properly. The movie does not understand itself, and the scenes seem put together without a second look at what works and what doesn't."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cardsrock",
        "review_rating": "1",
        "review_title": "One of the worst things ever",
        "review_detailed_main": "My god. This is beyond words. \"Films\" like this are truly a treasure to behold.\n\nThe dialogue had me rolling. The acting is laughable. The plot is absolutely nonsensical once the \"villain\" is revealed. The entire purpose of this movie and the motivations of the characters do not even remotely add up. The big reveal is just insulting and tone deaf. I don't know how two decent-sized stars agreed to do this movie, but I'm glad they did. What a ride."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "versandeep",
        "review_rating": "1",
        "review_title": "Helping people",
        "review_detailed_main": "Me suggesting all to avoid this movie is like \" helping people \". I am therefore proud of writing this review . That's it !"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "movielover5555",
        "review_rating": "2",
        "review_title": "What???...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bonniehutchins",
        "review_rating": "6",
        "review_title": "Easy viewing",
        "review_detailed_main": "This movie keeps you hooked until the end. The twist ending really has me questioning the entire movie. Those giving it 1 star obviously didn't understand it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rikkiolsen",
        "review_rating": "1",
        "review_title": "Please god no.",
        "review_detailed_main": "No. Oh god no.\n\nOh godddddd WHYYYYYYY\n\nNonononononononono\n\nI'd rather have to sit through the worst 8 hour blind date of my life who spends his time cosplaying as carrot top at a wayyy too trendy, deconstructed cuisine, vegan restaurant with 15 dollar wheatgrass shots.\n\nAnd you have to do the Macarena every 15 minutes or you get spritzed in the face with vinegar.\n\nNo. Please no."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hilzklly",
        "review_rating": "",
        "review_title": "Daytime movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "manessamber",
        "review_rating": "8",
        "review_title": "I almost feel bad for liking it",
        "review_detailed_main": "I've never left a movie review before, but after reading all the bad(yet humorous) reviews left by others, I felt compelled to speak up for the initial 1.5 hours which I found oddly entertaining. I was definitely surprised by the ending and if ever in conflict about hiring a nanny that decision was made after watching this movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mlbach",
        "review_rating": "7",
        "review_title": "Quite a good film if somewhat campy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "peterbochev",
        "review_rating": "1",
        "review_title": "Script found by accident",
        "review_detailed_main": "If you go to McDonald's right now and buy a Happy Meal, there's a bigger chance of finding a better script than this one in the meal, put by someone who works there and wants recognition (not saying anything bad about McDonalds employees). You know, how a movie can be a disaster initially when it first hits the cinemas, then years later people watch it and discover that it's a masterpiece? This isn't one of those. If you're hoping that this might be a diamond in the polish, it's not."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "imursel",
        "review_rating": "1",
        "review_title": "An example to a trash movie",
        "review_detailed_main": "I don't remember if I gave only 1 point for a film in Imdb until this film but this one really deserves this judgement. The plot is very clichè, nothing new, boring and amateurish. Terrible acting. This is a fine example of a absymal movie. Avoid it if possible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kpanesar-49339",
        "review_rating": "2",
        "review_title": "This movie goes nowhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rachelowen-95021",
        "review_rating": "1",
        "review_title": "No, just no",
        "review_detailed_main": "Poor Dermott. I always thought he was a pretty good actor but he must be desperate for work. Shocking movie"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "HumbleMensa",
        "review_rating": "1",
        "review_title": "Oops ---not a chance - I lost brain cells",
        "review_detailed_main": "Edit: I actually happened to be in a room while someone else was watching it so now I have seen this bizarre twist of ridiculous TWICE. The good = Kristin Davis looks fantastic, which I usually don't comment on things like that because I think it isn't relevant, but she does. That's about it. This movie reminded me of a soap opera style, romance novel thriller \"wannabe\" ... I only kept watching because I kept thinking \"surely this isn't it\" and then it got silly. And kept on being silly."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kostaselgreco",
        "review_rating": "1",
        "review_title": "My head just exploded",
        "review_detailed_main": "Unbelievably bad movie, so bad that actually it made me laugh in the end"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jaggerp-86726",
        "review_rating": "",
        "review_title": "What an atrocious attempt at a moovee",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sb-29",
        "review_rating": "7",
        "review_title": "Entertaining \"less than soft core\" porn",
        "review_detailed_main": "I must be one of the few people on the planet who enjoyed this movie.\n\nIt was sexy without removing hardly any clothes. It certainly didn't take itself seriously. The actors did a fine job of telling the story however lame, and were all beautiful.\n\nLooked like a lot of fun to make. If you like movies made by \"The Asylum\" production company this is of a similar B movie puedo porn style.\n\nThere are far worse things to watch."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "salma_b-94177",
        "review_rating": "1",
        "review_title": "Tiktok told me to watch it",
        "review_detailed_main": "I now hate tiktok My husband and I could've made a better movie in our 2 bed apartment"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "boself",
        "review_rating": "8",
        "review_title": "Intelligent psychological slow burning thriller",
        "review_detailed_main": "I am your average, middle aged, European Jane Doe with a Netflix subscription and in no way, shape or form affiliated with this movie. I was hooked from the start and thoroughly enjoyed it. Was never bored. I even had to double check if I watched the same movie as all the bad reviewers did. I work as a psychotherapist in mental health care. Maybe that's the reason I liked it so much? It because it was very well made and acted? The writing was amazing and had me rewinding to different scenes.\n\nLike some other high rating reviewer stated: I will watch it again!\n\nSo... if you are intelligent and like the more complex plots, you might like this one."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "potipiroon",
        "review_rating": "7",
        "review_title": "There is no way this movie is getting a 4 rating",
        "review_detailed_main": "Okay, this is not going to win any Oscar but it doesnt deserve a 4. It is entirely watchable. I had a good time watching it and so should most people. This genre deserves more credit."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mgeorgioh",
        "review_rating": "1",
        "review_title": "Worse than wet socks on a cold day",
        "review_detailed_main": "Bad. Like, really bad. I've watched a lot of terrible movies but this really takes the cake. I have nothing more to say. I wish I hadn't of watched this film. Please don't be like me. I regret my actions.\n\nPs I made an account just to write this review"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ashleybigos",
        "review_rating": "1",
        "review_title": "I wish I read the reviews first",
        "review_detailed_main": "The worst movie of 2021 and probably the entire decade. I couldn't be more angry I watched this entire movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cruise01",
        "review_rating": "2",
        "review_title": "Horrible.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "acafspace",
        "review_rating": "1",
        "review_title": "Very Poor",
        "review_detailed_main": "Absolutely ghastly, dreadful script, below average acting, don't waste your time"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Lexilikes",
        "review_rating": "1",
        "review_title": "Excruciatingly Terrible",
        "review_detailed_main": "It felt like it was trying to recreate a early 90s movie, like basic instinct or sleeping with the enemy BUT my gosh it failed! I actually think the story is good but the execution was excruciatingly terrible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "freyjakat",
        "review_rating": "1",
        "review_title": "More uncomfortable than haemorrhoids",
        "review_detailed_main": "Seriously Kristin Davis what were you thinking... this movie is so bad it's funny! It's an uncomfortable watch, painful, dire and confusing.... It's bad real bad! Save your eyes and ears and watch something else!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "markdel316",
        "review_rating": "",
        "review_title": "Anna Elizabeth James is on crack",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "martimusross",
        "review_rating": "6",
        "review_title": "A Good Thriller, Kept Me Guessing!",
        "review_detailed_main": "Deadly Illusions\n\nOverall this was good fun, I am unclear why some reviewers have marked this so low, to my mind you got exactly what was on the tin.\n\nKristin Davis overacted her way through this, she had the look, but it was all to intense and ultimately exhausting. This was a TV movie, nothing wrong with that.\n\nI'm going to give this a 6, it kept me guessing to the end and I rather enjoyed it!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "critzy-46344",
        "review_rating": "2",
        "review_title": "Cliche central + awful acting",
        "review_detailed_main": "I was impressed by just how God awful this movies was - extremely predictable plot, lousy acting , nothing original whatsoever. I was so shocked that these actors were in it. There's no spoilers possible for this movie because it has ALL of the cheap psych thriller cliches"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "grzegorzsawczak",
        "review_rating": "10",
        "review_title": "Intelligent people only",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jennspecs",
        "review_rating": "7",
        "review_title": "Really not that bad! Worth a watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "LAntichristo",
        "review_rating": "1",
        "review_title": "😂",
        "review_detailed_main": "That movie was an excellent piece of trash to watch high and laugh at talentless, overrated, masters of 21st century B type movies. Fantastic crap 😂 😂 😂"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "secretstory",
        "review_rating": "1",
        "review_title": "Contrived and transparent",
        "review_detailed_main": "Hey: look how good my *Kristin Davis plastic surgery looks Hey: look how we are trying so hard to convey that older women are sexy Hey: look at all these EXPENSIVE things On and on and on. How tragic that these scripts get the okay. It's so contrived and transparent. Not even fun. SAD Cringe factor x1000"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "DanielD_95",
        "review_rating": "1",
        "review_title": "Cancelling my Netflix account because of this movie",
        "review_detailed_main": "I can literally not think of one good thing about this movie. It was just horrible. Netflix will legit play anything these days."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "paluchagnieszka",
        "review_rating": "1",
        "review_title": "Worst expierience you can get",
        "review_detailed_main": "I never wasted my time in a worst way, never. Id rather have a flu for a week than watch this movie again"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bntcpzmf",
        "review_rating": "1",
        "review_title": "Wait, What?",
        "review_detailed_main": "I wish I could ask Netflix for a refund. No stars. Not one."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "wisewebwoman",
        "review_rating": "1",
        "review_title": "When series are desperately awful....",
        "review_detailed_main": "And I can't tear my eyes away from the hot mess on screen tearing out my eyeballs, I start to imagine a different script and perhaps the writer's intentions which somewhere along the line got chewed up by the dog or somesuch. So these are my thoughts. I don't think any of the savagery took place except in the author's imagination. Or the sex scenes between the two women. Speaking of sex, what I found alarmingly amusing was Dermot Mulroney diving under the sheets like a seal or a porpoise without one flicker of any kind of sexual excitement. Even the ending, which I won't get into here surely was in her imagination? This was telegraphed way back at the beginning when she talked about the \"episodes\" she has when she is writing her series of bestellers..\n\nAnd the acting was pitiful and the whole thing was very rushed. And the twins were so unequal in size as to lift the eyebrows a lot. Defo one of the worst of 2021 so far. Shame on you Netflix for throwing this garbage on our screens."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aust_4",
        "review_rating": "",
        "review_title": "Getting hi and reading reviews is more entertaining than this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "clareibells",
        "review_rating": "6",
        "review_title": "Enjoyable",
        "review_detailed_main": "An interesting watch! Not Oscar worthy but enjoyable and don't understand the 1/10 ratings from people"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "danielmanson",
        "review_rating": "2",
        "review_title": "Wow!!! What a bad film",
        "review_detailed_main": "I'm only giving this a 2/10 because I feel harsh giving it a 1/10 considering literally every review is just that. But my god, this is absolutely awful cinema.\n\nThe acting is insanely sub par and the first hour especially of this film is exceptionally slow, like I'm genuinely amazed as to how slow a film can be. I've seen disabled slugs move at a quicker rate than this. The film had no direction either, because literally nothing was happening you didn't know/ or care what was to happen next.\n\nThe \"twist\" was just pointless. You knew it was coming and it was so cliche. Really wasn't inventive whatsoever and really did sum up this entire movie.\n\nSince this doesn't spoil anything I can say this. So a big part of this film is the fact she is writing a book and it really zones in on that aspect at times. Several scenes of her writing etc. DOESNT MEAN A DAMN THING. It doesn't change the plot or outcome, it serves absolutely no purpose. Why bother???\n\nGenuinely this is just awful. I honestly can't think of a single positive and I'm angry at myself that I watched this. If you are debating it, don't."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "iGlad",
        "review_rating": "8",
        "review_title": "Crazy Mad but I loved it",
        "review_detailed_main": "I could not tell fact from fiction in this crazy film but I did like seeing Kristin Davis in a few sexy scenes. It was still a mad film with a nod to Dressed to Kill."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "wade_meyer",
        "review_rating": "7",
        "review_title": "Keeps You Questioning",
        "review_detailed_main": "The movie has you asking many questions through the whole thing. Based on other thriller movies I've watched you think you have an idea of where it's going but the twists and turns keep coming.\n\nAlthough there are many loose ends that leave you with no answers it is a great movie overall. The let 30 minutes is where it really picks up and leaves you trying to figure out who did what.\n\nNot sure who is giving all the 1 stars on here...maybe someone who got kicked out of creating this movie. Seems like all the reviews with one one star are the same person if you ask me..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "domarbat",
        "review_rating": "1",
        "review_title": "New account just to rate this: it's a comedy not a thriller",
        "review_detailed_main": "This movie is sooooooo dumb .... but sooooo dumb that you will be dumber after finishing it by for example accepting or processing illogical facts like the nanny can be in your room while you are dressing to then casually ask her for help, and here you are for 11000 times telling yourself \"ok let's suppose that this is possible\" . This movie is stupid I almost broke the tv when the husband said \"there are only your fingerprints on the knife used on the bike\" Does he have a fingerprint analyst at home because how does he know? Why did he test that knife? When? So man questions. Once again netflix top ranking sets me up. But this time I created my account here just to save other people. Actually ... the movie will be great if it was described as a COMEDY. Everything was ridiculous from the acting to the plot . And even if she was just crazy and grace never existed it is still very poorly expressed in the movie, and it will be more like you are forcing yourself to believe that to somehow give a little sense to the movie because never, you have a hint that she is grace. Let's suppose (again) that Grace was never there, Elaine was her psy ok but why Elaine will ask her to be careful because grace will steal her husband if she was grace? Is it not more important for her psy to focus on her not losing herself than an affair between her second personality and her husband? And why is she not in prison then one year later for killing Elaine? I mean this is what happen when you overthink on a bad and stupid movie. I wish I never watched it"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "khjtzanvms",
        "review_rating": "1",
        "review_title": "So so bad",
        "review_detailed_main": "Worst film of 2021, sorry typo. Worst film ever. It makes no sense and shocking acting. Save the 2 hours of your life."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zoe-84885",
        "review_rating": "1",
        "review_title": "What a shame",
        "review_detailed_main": "THIS MOVIE IS SO BAD, I WILL PROBABLY DREAM OF IT."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nicolebulos",
        "review_rating": "1",
        "review_title": "Lifetime movie with decent actors",
        "review_detailed_main": "When I saw the cast I was really hopeful about the movie. Unfortunately these great actors encountered terrible writers and what must be an enormous amount of money to read the script and still go through with it. I can only compare the story plot to those series who start off meaning to be 1 season, and after some success end up concocting a lot of senseless stuff to drag it into 2 or 3 more."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ivcjacqting",
        "review_rating": "1",
        "review_title": "I cried",
        "review_detailed_main": "It's so bad that I had to watch till the end to see it's this bad"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "pablo-98872",
        "review_rating": "1",
        "review_title": "It is a joke?",
        "review_detailed_main": "Hollywood really doesn't know how to make movies anymore? Sorry but I think this movie doesn't even deserve a review."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nrash-19388",
        "review_rating": "",
        "review_title": "horrendous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "retababyagyare",
        "review_rating": "6",
        "review_title": "Ignore the bad ratings",
        "review_detailed_main": "So I really don't know why the ratings here are so bad. I am shocked. I'm sure if I had checked before pressing the play button I wouldn't have watched it.\n\nIt's not as bad as the ratings say, It's a good movie. One that definitely promises to give a good thrill and time.\n\nNot all movies are suppose to wow you: this is a good movie to pass the time.\n\nA writer who is writing a story , then you are left to guess if she is living the story she is writing or if it's all real.\n\nIt's not a 10 but trust it is better than a lot of movies:\n\nOkay I'm done. Just need to finish the character requirements now."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cborders26",
        "review_rating": "1",
        "review_title": "A rating of '1' is generous.",
        "review_detailed_main": "Anyone claiming no movie deserves a 1 out of 10 is correct. This movie deserves a '0' Just when you think it can't possibly get worse, it does. At least we'll have something to laugh about around the camp fire camping this summer."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jessnicobien",
        "review_rating": "10",
        "review_title": "Keeps you on your toes!!",
        "review_detailed_main": "This movie kept me on my toes throughout it's entirety. Leaves room for the viewer's imagination, and has a \"whodunnit\" vibe. Would recommend!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alex-harris-love",
        "review_rating": "7",
        "review_title": "An actress with serious range...",
        "review_detailed_main": "It has been quite some time since I last wrote a review but this one was absolutely necessary because of the performance put on by one of the co-starring actresses, Greer Grammer. I had never even heard of her before this film but her range from a mild, meek mannered, innocent young girl to a deranged psychopath makes this movie well worth watching. The movie is slow with nothing insightful to gain from it nor does it have an intricate plot and it is poorly written but the acting performance put one by Grammer makes this film entirely worth watching as there aren't many (if any) female actors who possess any sort of range whatsoever."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "joanesy",
        "review_rating": "1",
        "review_title": "Really should be able to give zero stars",
        "review_detailed_main": "Terrible. Just terrible. The writing was laughable. So many plot points that never come together. Watch Hand that Rocks the Cradle instead."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "linasharar",
        "review_rating": "1",
        "review_title": "Deadly lane and boring",
        "review_detailed_main": "I couldn't stop thinking how Greer made it as an actress!! Watching her was like watching a high school play that was booed by nurds and popular kids alike!!! Save your time and skip this one.."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tychochase",
        "review_rating": "1",
        "review_title": "Bad overall",
        "review_detailed_main": "Trashy waste of time. Netflix is really trying their best to releases hot garbage all year long."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "popdiana-76452",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I don't recomand this movie. It's the worst movie I have ever seen."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "emilygdacosta",
        "review_rating": "1",
        "review_title": "We need negative stars to be introduced",
        "review_detailed_main": "This movie was absolutely horrible. The entire time I was extremely confused but not in A- Inception kind of confused where they do it on purpose and keep you on your toes for suspense- no. This was just completely confusing from beginning to end, they don't explain many things, and then the ending set a record for the worst ending I've ever seen. This movie was terribly written, terribly acted, terribly directed, terribly scripted, terribly- everything. Don't waste your time."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "eventlaunch",
        "review_rating": "2",
        "review_title": "What a disastrous attempt of making a MOVIE",
        "review_detailed_main": "Or what a terrible attempt of writing a novel attempting a script into a screenplay into the most boring stupid impossible could would never happen MOVIE"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "VileAndDouchy",
        "review_rating": "",
        "review_title": "One of the worst movies ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "janesmith227",
        "review_rating": "7",
        "review_title": "ITS ACTUALLY A GOOD MOVIE",
        "review_detailed_main": "I really don't understand what is going on with the people reviewing this movie. It really makes you guess and wonder about things and also makes you go \"wth did i just watch?\". That does not make it a bad movie... however i do agree with people saying that some of the acting was bad especially Kristin's (Mary). The plot though was quite interesting; personally i think that its either all in Mary's head and both Mary and Grace are her (which is supported by some scenes where Mary does some stuff, for example slushes the bikes' tires, and then we see Grace do the exact same things) or it's the plot of the book sequel she's trying to write because many of the situations in the movie are shown in her board with the book plans. Also, when it shows Grace interviewing for a job, at first she shows off a bad attitude and then the scene replays with Grace's behaviour being the quite opposite indicating that Mary rewrote the scene (if it really is the plot to her book). On the other hand, it could all be real. Thats because if im right and Grace isn't real then how can Elaine and Tom talk about her?anyway the moment where i got confused was the ending. The woman exiting the hospital according to the theories above is either Mary (who could have been in jail -because who the hell leaves the station that easily? Its provably in her head- and afterwards sent to a clinic and found a way to escape), or Grace (who might killed/knicked out Mary and dressed up like her to get out of there) or both in case Grace isn't real and its all in her mind -that also explains why she is in the clinic in the first place-. I know its way too confusing but thats not something negative... i don't get why people are giving it a 1/10 or a 2/10...."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "keithtownsend-98690",
        "review_rating": "1",
        "review_title": "Soft, poor,corn",
        "review_detailed_main": "I rarely quit a movie, but that was unavoidable with this one. Hardly deserves the description as 'rubbish' - it's an insult the art of movie making. Avoid!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "em-55871",
        "review_rating": "9",
        "review_title": "COOL WATCH",
        "review_detailed_main": "Really enjoyed this movie. Wish I had a husband like Tom and that house. This new actress Greer Grammer is very pretty."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tammmyjones9",
        "review_rating": "7",
        "review_title": "Pretty interesting concept!",
        "review_detailed_main": "This movie wasn't as bad as some are making it out to be. It could've used a little more flow in the story and some of the actors weren't 100% on their game, however the story was interesting and it had some psychological aspects that I find interesting."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lee-03191-06025",
        "review_rating": "1",
        "review_title": "I also made an account just to rate this movie",
        "review_detailed_main": "Was so horrible I feel extremely guilty for wasting my previous time on this complete garbage. The acting is terrible, plot doesnt make sense in fact nothing makes sense. I highly suggest movies like this should not exist or be put out there at all, it's like human civilisation has gone backwards 50 years."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "icequeen-47246",
        "review_rating": "1",
        "review_title": "Bad Take on Mental Illnesses",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nancy240",
        "review_rating": "2",
        "review_title": "A star for Davis, a star for Mulroney",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aurlinii-32545",
        "review_rating": "1",
        "review_title": "This is the Proverbial Train wreck of all movies",
        "review_detailed_main": "Terrible plot holes, tropes, and disconnection with how ANYTHING actually works in real life. I hate myself for watching this, the person that recommended it, and everyone involved with making this trash. I'm ready to boycott Netflix for allowing this, but canceling good shows they had"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "joana-gomes-606-314769",
        "review_rating": "1",
        "review_title": "This movie is so bad I am actually writing a review",
        "review_detailed_main": "Giving this movie 1/10 might be one of my most generous acts of the past decade."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aldo-apachi",
        "review_rating": "1",
        "review_title": "Tommy Wiseau level writing and directing",
        "review_detailed_main": "This movie is so bad I'm just amazed Nicholas Cage isn't in it. He'd be great."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "evlinlake",
        "review_rating": "",
        "review_title": "It continued to go down an extra cheesy hill.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lujimbo",
        "review_rating": "7",
        "review_title": "Transfer of affect",
        "review_detailed_main": "Not as bad as most think. You have to be psychoanalytically talented to get it though ;)"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "k-ford-356-288578",
        "review_rating": "1",
        "review_title": "Omg .. JUST DONT!",
        "review_detailed_main": "Seriously awful, wish I'd read the reviews first! The best bit was the credits as it was finally OVER!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Favorable...",
        "review_detailed_main": "I liked the mysterious tone, but the convenient situations are annoying, when it comes to being surprised, quite the opposite, it became predictable in the first third of the film, however adorable, all the atmosphere of romance, exuding sensuality, what a perfect chemistry... Crazy, exhilarating, and Grace's forced but relevant end to the entertainment..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "melpolymerturk-34754",
        "review_rating": "7",
        "review_title": "Very nice movie, with a nice ending. Of course confusing like its title",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ndeshi1110",
        "review_rating": "1",
        "review_title": "Stay away",
        "review_detailed_main": "She took her new nanny bra shopping... That's all that needs to be said a out this appalling effort"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alindsayal",
        "review_rating": "1",
        "review_title": "A Truly Dreadful Film",
        "review_detailed_main": "Another day in Lockdown and another film to watch, this time it is Deadly Illusions and here is my review for it. The premise of the film sees an author hire a young babysitter to watch her children, when the two of them start to build a friendship and connection.\n\nMain Character Kristin Davis of Sex and The City fame plays the lead character here and she is just not very good. Her character is really bland and uninteresting with Davis delivering some really cringe worthy dialogue that made her a character that never connected in any way shape or form.\n\nSupporting Characters Greer Grammer plays the young girl that joins as the babysitter and she is also really bad here. She delivers line after line of awful dialogue and she just has some truly bad scenes that makes it hard for you to by anything in the film and the supposed chemistry between her and Davis which is never there. Dermot Mulroney plays Davis' husband in the film and he is literally just phoning it in and just playing the same character he does in every other project he is in. The rest of the cast offer nothing as well and the acting is just really bad.\n\nStory Ever since Fatal Attraction was released, Hollywood has believed they can just churn out similar films for cheap with nothing unique and they are pretty much all bad and this one is no different. This film is laughably bad and throughout it does nothing interesting and then the last act happens and it is is just hilariously ridiculous and makes no sense.\n\nScript The script is terrible, the dialogue is as mentioned above cringe. With drama, humour and romantic dialogue that are all terrible and the actors deliver it in such ways to make it seem even worse. Then someone wrote the ending of the film and they just had no clue what they were doing and maybe they should move into comedy.\n\nStyle The style of the film is awful, the pacing is so slow and literally nothing happens for ages and even when it does it is terrible. Plus this film is way too long, a film like this in 2021 should never be 2 hours long and it just keeps on going.\n\nOverall Overall, this is a truly awful film. Deadly Illusions is one of the worst films of the year so far and is one that should never be seen by anybody.\n\nRating - 1/10."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hussain-alkhamis",
        "review_rating": "1",
        "review_title": "Not good",
        "review_detailed_main": "I would like to apologize to myself for watching this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "briadanielle",
        "review_rating": "1",
        "review_title": "Horrible acting",
        "review_detailed_main": "I never write these reviews but I want to help people not waste 2 hours of their lives watching this movie. The acting is so bad and it's so boring 😴"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "thediva-89114",
        "review_rating": "4",
        "review_title": "What the actual hell???",
        "review_detailed_main": "2 hours I'll never get back. I have no idea what this film was about?!!!! Completely bemused."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "respectfornothing",
        "review_rating": "1",
        "review_title": "A child could have written a better film. Beyond awful.",
        "review_detailed_main": "It is borderline inconceivable that a movie so bad has been brought to screen. Avoid this. Promise."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "oopickle",
        "review_rating": "",
        "review_title": "Theiller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "veritylouise",
        "review_rating": "7",
        "review_title": "Good for a TV movie. It's not a blockbuster so stop treating it like one.",
        "review_detailed_main": "I wanted to write a review because of all the bad ones. It wasn't the best film but it's more like a TV movie and for that I thought it was good. It's a slow start but I liked how it played out. If you like a Lifetime movie, ignore the reviews and give it a go."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gpeterdi",
        "review_rating": "5",
        "review_title": "Read it right after watching it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "preyby_xxx",
        "review_rating": "10",
        "review_title": "I want to see it again.",
        "review_detailed_main": "Totally worth seeing this movie. It's not for stupid persons, who gave 1 out of 10 they trully don't know nothing about movies and don't understand a bit from this movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jonathandavid-79123",
        "review_rating": "6",
        "review_title": "Not as bad as the sheep think....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sunitsanghvi",
        "review_rating": "1",
        "review_title": "I made an account just to leave this review",
        "review_detailed_main": "I'd say \"disappointed\", but that would imply that there was some potential to begin with. This movie makes a trainwreck look good."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aprilsfriendorin",
        "review_rating": "3",
        "review_title": "Yup, it's bad.",
        "review_detailed_main": "I looked up the reviews beforehand and thought, well, if it's number 1 on Netflix it can't be all that bad, right? I decided to throw it on in the background while I was doing work and yeah... It's bad. The main actress's acting is poor and the movie is full of plotholes. It has one of those forced endings that come out of nowhere, don't really make sense and seem detached from the beginning. A good movie builds things up over time, but somehow they couldn't manage to do that over 2 hours worth of content? Also it kind of stigmatizes mental health. Think of it as an erotic lesbian thriller turned murder mystery turned regular thriller? But none of it is good?"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sbrayna-77225",
        "review_rating": "1",
        "review_title": "Wishing I could time travel...",
        "review_detailed_main": "A note to my past self just in case I'm able to time travel: Please don't waste your time on this one, every bit of this film has been done before, there is no twist no real surprises...it's mundane with such terrible acting...you've seen it all before. Please watch something else, read a book, clean out the bathroom, watch some socks drying in the wind - trust me it'll be much more entertaining."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jafellperez",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": "The movie makes no sense. Very boring, good actors I think but the story is terrible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sheela1979-791-56389",
        "review_rating": "4",
        "review_title": "Cliche movie",
        "review_detailed_main": "This is not a good movie offcourse, but its a shame people are rating movies with 1 or a 10, a movie is never a 1 or a 10 (there are exceptions but thats a small percentage) so that have his affect on the true ratings and i cannot trust the reviews completely because of that. I hope people will give more serious ratings, thats good for us movie fansz"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "petterimerinen",
        "review_rating": "1",
        "review_title": "Oh! I see what they did there",
        "review_detailed_main": "Ok, so this is what happened. The writers had three ideas for an mediocre movie. There is the erotic storyline, where the babysitter seduces both the mother and the father which leads to jealousy. The second storyline is a Fight Club ripoff where the mother develops a side personality, the babysitter, because of stress and surpressed emotions. Third is just a story where they hire a babysitter who turns out to be nuts, maybe making it a murder mystery / slasher movie\n\nInstead of picking one storyline they decided to combine them all, because what could go wrong? The end result is an utter mess and one of the most frustrating movies I've ever seen. The plot and storytelling make absolutely no sense. Acting is weak but there is no one who could have saved this script. Just terrible all around."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ian_cooper-37437",
        "review_rating": "7",
        "review_title": "Wtf",
        "review_detailed_main": "Sooooo many questions. Got a bit lost with this!\n\nNot bad tho lol"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "LittleCriticDontHurt",
        "review_rating": "2",
        "review_title": "What did I just watch!? :/",
        "review_detailed_main": "Lmao! This movie was just terrible! I gave it a 2 because it was so bad that it made me want to keep watching in case the ending made it all make sense. But the ending was even worse that I had to create an account so I can review it. It took me three days to finish watching it because I would just pause it and find something else to watch.\n\nThe writer of this movie obviously had a writer's block just like the main character in the movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tsandquist",
        "review_rating": "10",
        "review_title": "Keeps you guessing",
        "review_detailed_main": "Keeps you guessing through the end. Very intriguing."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ts-0000",
        "review_rating": "",
        "review_title": "Wasn't as horrible,like most are rating it..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mjanssens26",
        "review_rating": "6",
        "review_title": "Sort of like one of those 1990's sexual thrillers for 2021",
        "review_detailed_main": "Kristen Davis and Dermot Mulroney play an attractive 50-something couple with two young children. Though they're a successful husband and wife team, Dermot manages to lose half their savings. Kristen is then forced to return to work as an author and write a novel in which she's being paid a hefty advance. With two young children distracting Kristen from her work, she decides to hire a nanny and this is where I'll leave the story as to not give anything away. Is this story real? Is it all just part of a book? Is the nanny real? Is the nanny crazy? Is Kristen crazy or is her husband out to get her? There are a lot of ways this film could have gone. Ultimately, it's an OK thriller similar to those 90's thrillers like Basic Instinct, Sliver, etc. Not great, though certainly not bad. A middle of the road effort."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "KJMartin83",
        "review_rating": "1",
        "review_title": "I think this is the worst movie I've ever seen",
        "review_detailed_main": "I have no words for how awful this movie is. Probably the only good thing about this movie is if they ever do an episode of How Did This Get Made about it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "eikemodersohn",
        "review_rating": "1",
        "review_title": "Keanu Reeve's Knock Knock is an Oscar Film Of the Year Masterpeace compared to this",
        "review_detailed_main": "Watched it because of the worst reviews. It's so cringeworthy that it's hilarious. I am so confused."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "renatekoessner",
        "review_rating": "1",
        "review_title": "Predictable junk",
        "review_detailed_main": "Waste of time. But we are having enough bacauss of corona anyway"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "loganrocks-79585",
        "review_rating": "2",
        "review_title": "How does a movie this bad even exist?",
        "review_detailed_main": "The mom smoking cigars for no reason. The nanny acting so desperate and wierd the whole time. Nothing makes sense, this has to be a joke."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "beatriceweager",
        "review_rating": "2",
        "review_title": "More boring than a detention!",
        "review_detailed_main": "I mean how bad could this movie get? Bad acting, bad scenes, bad plot, bad twist, it's a waste of time and should never have been released!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "helenneier",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Everything in this movie was bad. 1 is already too much for this movie"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jetkot",
        "review_rating": "6",
        "review_title": "Too much happens",
        "review_detailed_main": "Psychological thrillers usually keep you at the edge of your seat. This movie does manage a decent plot but the treatment is flawed. A writer suffering from a writer's block and maybe deadly illusions.The performances are decent but when you sit back and join the dots it gets too confusing. They should have focused on one person having a mental illness or someone simply being a villain. They instead choose to tease and titillate you in the first half and do too many things in the second half and the end result is an average thriller with an ambiguous ending."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "amriyana",
        "review_rating": "1",
        "review_title": "I really Hate this movie 👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻",
        "review_detailed_main": "I could not make below than one star, but I rate this movie 👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻👎🏻 Dont watch this!!!!!!! Wasting my time"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rbrb",
        "review_rating": "8",
        "review_title": "The Girls in the Band",
        "review_detailed_main": "A best seller authoress hires a nanny whilst she attempts to complete her next book.\n\nThe mental stress and strain of writing the novel takes its' toil on the writer and causes her to suffer illusion or delusion when trying to finish the book.\n\nOr maybe she is actually experiencing the truthfulness of her life and her desires whilst at he same time her husband and the nanny are living out their feelings, sane or otherwise too?\n\nI loved this film and it had me mostly engrossed throughout.\n\nThe poor reviews maybe down to the fact than many viewers cannot accept certain kinds of love, in particular within same sex relationships. That relationship was done brilliantly in the movie.\n\nThe two female leads vie with each other to steal the show; both are the winners!\n\nThe ending is mightily thought provoking and shocking but at the same time wholly understandable.\n\n8/10."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "moviereel_cb",
        "review_rating": "6",
        "review_title": "Not sure what the low ratings are for",
        "review_detailed_main": "The movie was well done up until a climatic scene that was laughable. This movie felt like something I'd see on USA late at night. If you're bored, it's worth a watch. There's other movies that are so much better though."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Ginrosie",
        "review_rating": "1",
        "review_title": "1 star because zero stars isn't available",
        "review_detailed_main": "The storyline has been done a hundred times before, many have been badly done but this is D grade low budget amateur quality level. Cringe inducing, predictable & very bad acting."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "annemiekvdbos",
        "review_rating": "1",
        "review_title": "2 hours of my life I will never get back..",
        "review_detailed_main": "I kept watching because I thought it had to get better at some point, but it didn't, horrible bad movie! I actually made an account for this!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "barbara_amarante_oliv",
        "review_rating": "1",
        "review_title": "Worst film ever!",
        "review_detailed_main": "What the hell just happened?! Why?! Such a BAD movie. But....You'r forgiven Charlotte, still love u...please don't do this again..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "AHK03",
        "review_rating": "1",
        "review_title": "Worst movie EVER!!!",
        "review_detailed_main": "Don't waist your time! It's pure trash. I lost 2 hours of my precious life!! This movie doesn't make any sense."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hardknocks-196-122794",
        "review_rating": "2",
        "review_title": "A really profoundly terrible film",
        "review_detailed_main": "What was the point of anything that happened in this film? I mean I was expecting it to be bad, but jeez."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jeanao",
        "review_rating": "1",
        "review_title": "What even?",
        "review_detailed_main": "I really wish I read reviews BEFORE watching. Do not waste your time. This movie has no idea what it's trying to be. Disappointing."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sandor6",
        "review_rating": "7",
        "review_title": "I enjoyed it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gpxdlr",
        "review_rating": "1",
        "review_title": "Suffered Through All Two Hours",
        "review_detailed_main": "Waiting, waiting for something to happen, for SOMETHING! So slow. Watch something else. Do Not See This."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "samrich-75414",
        "review_rating": "10",
        "review_title": "What a great film",
        "review_detailed_main": "I watch films all the time and some films just do not keep you interested, but this film was great from the start. The sexual tension and suspense was brilliant. Kept me interested all the way till the end. I loved the way it finished too."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bryanjdeleon",
        "review_rating": "6",
        "review_title": "It's basically a Lifetime Movie (LMN) type movie.",
        "review_detailed_main": "There was a lot of promise but in the end it turned into a LMN production type."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "vmarchese-75255",
        "review_rating": "1",
        "review_title": "I should have read the reviews",
        "review_detailed_main": "Why didn't I read the reviews before embarking on the worst garbage movie ever. I tortured myself to finish the movie and I'll never get that 1hr50min back"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Nightmarelogic",
        "review_rating": "3",
        "review_title": "This was just bad",
        "review_detailed_main": "I was hoping this would be a decent thriller. And it started out that way but it pretty quickly devolved into the worst kind of lifetime movie tripe. Worst of all it made very little sense. Avoid this at all costs. It really is that bad."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mvitalbrazil",
        "review_rating": "1",
        "review_title": "Kristin Davis acting as bad as it can possibly be",
        "review_detailed_main": "I hate not finishing to watch movies, no matter how bad they are. This time I really struggled and fought a lot, but still found it to be unwatchable. I need a few years in therapy now, thanks lady-who-should-never-act-outside-a-lame-girlie-tv-show."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "julietkurtz",
        "review_rating": "1",
        "review_title": "One of the Worst Movies I Have Watched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "maxeisl",
        "review_rating": "1",
        "review_title": "Ridicolous, bad and boring as hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "julieshotmail",
        "review_rating": "3",
        "review_title": "Acceptable buildup that becomes random out of nowhere",
        "review_detailed_main": "The beginning of \"Deadly Illusions\" offers decent-enough suspense and mystery, while giving us a glimpse of what has become of the now-56-year-old Kristin Davis who is looking absolutely vibrant and fabulous. The plot seems formulaic, which we can accept, however the climax is just plain silly and blatant lazy writing. Two-thirds in, you are hoping for a satisfying reveal, only to be insulted with the most ridiculous plot move they could possibly conceive of. What a waste of time!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lucienm-60321",
        "review_rating": "7",
        "review_title": "Interesting angle",
        "review_detailed_main": "Don't know why the rating is low.\n\nCasting is good, plot is good."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ilaydacbang",
        "review_rating": "2",
        "review_title": "What",
        "review_detailed_main": "I dont even know what this movie was.\n\nIm so annoyed that i wasted my time on this"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "monica_kathya",
        "review_rating": "10",
        "review_title": "Must watch!",
        "review_detailed_main": "Like some other people's comments, not sure why hey gave a 1 star..... lol\n\nIt's a good movie! Keeps you thinking!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fuad_tarin_58",
        "review_rating": "7",
        "review_title": "7/10",
        "review_detailed_main": "Just watched this and abit suprized by the low rating. It aint the best movie but it aint that bad either. I would say its quite entertaining.\n\nIts a 6/10 for me but i give it a 7 cause of the clowns that gave it a 1/10. Because 1/10 means its trash and that aint true."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mhottrax",
        "review_rating": "1",
        "review_title": "WTF",
        "review_detailed_main": "I was reading some of the reviews and thought that nothing could be as bad as they were saying. I was wrong. Completely disjointed. Poorly written. Poorly acted. Just not thought out. I think I know what they were trying to say, but they failed miserably. Thought maybe there would be some good sex, but even that never materialized. All in all, an hour and 45 minutes of my life gone."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sandraskold-17301",
        "review_rating": "1",
        "review_title": "Helen Keller might have liked this",
        "review_detailed_main": "This film might have been the single worst contribution to the art form since the advent of motion pictures. Offensive to the eyes, ears, and somehow nose and tongue, deadly illusions successfully destroys any lingering hope that Netflix even employs sentient humans on its content curation team. To expect that this movie will evoke any response from its audience other than sheer disgust is itself a deadly illusion.\n\nWith all that said, the library scene at 1:23 single-handedly launches this film into must-watch territory, with support acting comparable only to The Room's flower shop scene."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kenyaekofi",
        "review_rating": "2",
        "review_title": "TRASH!",
        "review_detailed_main": "This shouldn't even be called a movie. This should be called dead brain cells. This movie literally never had a certain point to it or a conclusion to it. Just a bunch of climaxes and no solution, no endgame, nothing. Just seriously bad acting, possession bull crap. Split personality demonic issues. None of the flash backs ever had a point! This girl was literally mentally ill and was acting like a seductress, bdsm, mentally unstable person. This movie made NO sense. The ending was very tacky and this movie needed help."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "imdb-14850",
        "review_rating": "2",
        "review_title": "A Calamity of 'C' Words...",
        "review_detailed_main": "Campy. Careless. Characterless. Cheap. Cheesy. Cliched. Comical. Common. Confused. Contemptible. Contrived. Cornball. Crappy. Criminal. Cringeworthy. Cruddy. Culpable...."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "meghajyasala",
        "review_rating": "1",
        "review_title": "🤢🤢",
        "review_detailed_main": "Can i get my time back or help me unsee it. So bad that even ppl who worked on this film wasted their time to produce such piece of 💩. Yukk"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ssyer-31400",
        "review_rating": "1",
        "review_title": "I want my time back!",
        "review_detailed_main": "This is the worst movie I have ever watched!!! It's on Netflix top 10? Hahahahahahaha I kept hoping it would get better.... It's better now that it ended! This was the worst acting I have ever seen. Even the lesbian bits couldn't hold my attention without laughing..... Do something else rather than watching this. Anything is better.... Even an enema.... 🤣🤣🤣"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "brianpleung",
        "review_rating": "7",
        "review_title": "Confusing but not that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "joiningjt",
        "review_rating": "1",
        "review_title": "This proves that Netflix makes up the top 10!! This was terrible I mean TERRIBLE!!",
        "review_detailed_main": "This is 1 of those movies that have absolutely no redeeming value at all, NONE, some of the worst dialogue ever, worst acting ever, and talk about a stupid predictable story done wrong here you go!! I like just about everything heck I've watched some 3.5 movies that I enjoyed its extremely rare I give anything under a 5 but this movie is soooooooo bad!! Netflix says it's the #1 movie in the country right now, that's absolutely a lie its impossible for this to be popular. Even jujitsu was better and that stunk!! It has nobody we know and its horrible and stupid but its #1 COME ON !! Liars!!!!!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dimitrisdago",
        "review_rating": "10",
        "review_title": "Perfect thriller. I suggested it",
        "review_detailed_main": "Why so many negative ratings? The movie was perfect. It was exactly what I want to see for a thriller. I really can't understand the ratings..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Mamdouh_Raslan",
        "review_rating": "6",
        "review_title": "Not that bad guys",
        "review_detailed_main": "I really don't know why all critics and viewers are so down with this movie, of course it's not awesome yet it was not that bad and I felt tense in it. The main character role was not built good enough and the finale was in a hurry but I enjoyed the movie overall.\n\nAnd I don't think that it was predictable.. Another thing that it has no sex or nudity at all, I am really wandering about the viewers openion.. Overall lately all movies are the same and no new plots to be watched, and the characters performance is below average, but let's face it this became the common thing unfortunately so we just have to deal with it.."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nia-00312",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I Don't understand how producers waste their money In such an horrible movie... Writing is poor, story worst than poor, actors.. What I have to say.. This is not to be an actor I Don't believe any of them.. There is no tension, no climax no nothing.... BELIEVE ME DON'T WASTE YOUR TIME!!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "winecellarwomack",
        "review_rating": "1",
        "review_title": "I have a slice of quiche and a bloody Mary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "daltonbradshaw-55151",
        "review_rating": "1",
        "review_title": "Literally made this account to give this a bad review",
        "review_detailed_main": "This was by far the worst movie I've seen in years. Can't believe I wasted my Friday night watching this. Do not waste your time. I would literally rather be doing manual, back breaking labor than watch this movie again."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "malanskip",
        "review_rating": "1",
        "review_title": "Bad, really bad, really bad...",
        "review_detailed_main": "Lifetime movie, bad actores, bad history, boring, boring, deadly boring lifetime movie.. Bad,bad, bad..horrible.."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "doctorock2004",
        "review_rating": "2",
        "review_title": "Watch the sky for 2 hours... You'll get better illusions!",
        "review_detailed_main": "I fell asleep in the middle of the movie, when at some moment, the screams woke me up ... I watched it 'til the end, and of course, I didn't understand anything. I thought I had lost something and I resumed watching from the point where I remembered the action. In the end, I was even more confused...but those minute of sleep....ahhh...thx God for them."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ppanagi-51953",
        "review_rating": "1",
        "review_title": "So bad it should be illegal",
        "review_detailed_main": "I think I just watched the worst movie ever made or will be made."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Jimmoviesreviews",
        "review_rating": "6",
        "review_title": "Hum",
        "review_detailed_main": "I give this movie a 10 haha.ok a 6 it's not that baaaad We 've seen this a million times before It is what you expect to be though You know what was worst than this movie? While watching stopped it to get the wet towel i had outside to dry and it had bird poo on it lol."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alfredom2000-368-251279",
        "review_rating": "1",
        "review_title": "Worst movie of 2021",
        "review_detailed_main": "Bad script, bad dialogue, bad acting, bad directing. I couldn't find something at least regular in this movie. Is so boriiiiiiing!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "emilyballard-80550",
        "review_rating": "10",
        "review_title": "Fun to watch. Loved the female perspective.",
        "review_detailed_main": "The thing I love most about this film is that it is female driven and is open to your own interpretation. You get to decide what happened. Watch with your friends and discuss! Its so fun"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "miran-65898",
        "review_rating": "6",
        "review_title": "Good story line, average execution",
        "review_detailed_main": "Surprisingly poor acting for such good actors. Good concept with poor directing. Average at best. Felt like for a long movie like this they could have done much better in bringing out character stories much better than they did. A few twists but predictable. Worth the watch if your bored."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lokis-18932",
        "review_rating": "4",
        "review_title": "Just, no.",
        "review_detailed_main": "For a minute there I was tricked into thinking this movie was going somewhere... Spoiler alert: it wasn't.\n\nMake it into a drinking game and at least you'll get drunk and forget about it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Typical repeated story, with some horrible intimate scenes. A complete waste of time, nothing new, nothing thrilling and way to boring. And the end is so typical to leave a room for next movie but i hope they just dont make another one."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "diego-cervantesb91",
        "review_rating": "5",
        "review_title": "Only if you have nothing to do",
        "review_detailed_main": "The movie didn't make sense AT ALL, The actors were ok I guess, it gets you hooked sometimes, but the end was just..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "meairton-39463",
        "review_rating": "2",
        "review_title": "Easy to laugh at its badness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mpar-52182",
        "review_rating": "4",
        "review_title": "Predictable.",
        "review_detailed_main": "The movie was somewhat enjoyable. The actors were fairly good in their roles."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lora-jen",
        "review_rating": "2",
        "review_title": "Nope.",
        "review_detailed_main": "This movie is bad, mmmkay.\n\nNo.\n\nNope.\n\nBad.\n\nBad movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kholofelo_khools",
        "review_rating": "10",
        "review_title": "Worth watching",
        "review_detailed_main": "I truly enjoyed watching this movie from start till the end."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "stefanyrjunges",
        "review_rating": "6",
        "review_title": "It was ok",
        "review_detailed_main": "I actually liked this movie, but it could have ended way differently... it kind of disappointed me tbh. I really hated that Mary woman, so I spent basically the whole movie with a disgusted look on my face because jesus christ what a terrible character. But anyways, worth a watch, it's just confusing and not everyone will enjoy."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "brandon-19950",
        "review_rating": "2",
        "review_title": "This was..not great.",
        "review_detailed_main": "I rated this 2 stars because I'm sure I've seen worse movies, just not recently.\n\nThis plot had potential, I legitimately thought I was going to see a movie that was derivative of Basic Instinct, a cool slow burn psychological thriller with sex appeal.\n\nWhat we got instead was just..rubbish. There were very few scenes in which anyone acted appropriately to the situation. The dialog went from mediocre to atrocious scene to scene.\n\nThis was recommended on Netflix and my wife and I thought we would give it a go. We watched waiting for it to turn into something interesting, noting it was 20 mins from the end we had that sinking feeling that we had just wasted 2 hours.\n\nDon't do it, there's better out there."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dogonu-215-965738",
        "review_rating": "1",
        "review_title": "Dumbest movie since the world according to Garp and that is syaing something.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "anwny",
        "review_rating": "1",
        "review_title": "2hrs wasted",
        "review_detailed_main": "It is such a long movie and is very slow to pull you in. But I stuck with it thinking it must get better. It never does. Don't waste your time. Move along to something else quickly!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "anasess",
        "review_rating": "1",
        "review_title": "Worst Movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bazookamouth-221-898097",
        "review_rating": "3",
        "review_title": "Seriously awful",
        "review_detailed_main": "Firstly this junk is 2 hours. It thinks its an erotic thriller but you get nothing erotic from the female leads. The husband shows off his ass. Could do without that. There is the token black friend. The acting from the nanny was unbelievable. She acts like shes 14 years old. Kristin mouth is odd. She kinda reminds me of a fish. The husband came across like a horny teenager early on. The family is far to sugary. The cigar smoking by Kristin was nice though. Theres quite a few scenes. It was funny first half and nonsense in the second."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "AK1475",
        "review_rating": "1",
        "review_title": "So bad it's sad .",
        "review_detailed_main": "From the beginning I realized that it's going to be bad but it was even worse than we thought . I watched it with my hubby and we had to stop it because it was so stupid we couldn't go on with it ..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "miguelmighty",
        "review_rating": "6",
        "review_title": "Still thinking",
        "review_detailed_main": "I watched this with my wife. A story is about a best-selling author, Mary who does not want to write another story as there's a tendency that she needs to have an influence on the current situation (I assumed a dark story) to have a good book. She ended up writing again on the grounds that the monetary offer was good, she got influenced by others to write a follow-up novel, and their financial situation was not that good for her to just be at home with the family. For her to continue, someone has to help look after her juvenile twins while she pens another story. Grace, the baby sitter entered the picture. As the story developed, we wanted to find out what the ending looked like. It ends up that more thinking needs to be done. I will not say that this is a bad film because it gives me and my wife time to discuss what happened. If wether the scene is real or just Mary's imagination on what's going on. There are no conclusions about who among Grace and Mary wore the killer outfit on two scenes . Maybe others can find out themselves. I can still recommend this film if anyone wants to watch a psychological thriller."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "salahdahbi-05084",
        "review_rating": "1",
        "review_title": "Please do not watch this movie",
        "review_detailed_main": "The worst ever . It's waist of time . Do not not watch it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "juanmuscle",
        "review_rating": "10",
        "review_title": "I'm no shill I think this was damn good even...",
        "review_detailed_main": "Though I didn't understand the ending. I felt like it had me gripped the entire time and throughout the thing it was explaining itself while it told the story which was pretty inventive so I don't know , I thought it was pretty cool!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hefo-64558",
        "review_rating": "1",
        "review_title": "So, so, so bad!!",
        "review_detailed_main": "Oh my god, what did I just spend the last two hours on?!?! I was reeled in by the names of Kristin Davis and Dermot Mulroney. Fair enough, they are not known for their Oscar-winning performances, but still you suspect it can't be half bad cause no self respecting actor would want to link their good name to some worthless piece of movie toilet paper. I was wrong.\n\nWhere Kristin Davies' role as a hysterical uptight flower pattern wearing rich housewife is very funny in SatC, it was just plain agony in this god awful flick. Furthermore, the storyline is a mess, the characters are completely unbelievable and the 'erotic' scenes were just cringe as f. As you come towards the end of the movie you just start wondering if the whole production team was on acid or something because it just loses all grip to reality.\n\nI wish their was a law against movies like this. Or at least a way to get compensated for hours lost.\n\nIf you value your precious time, skip this disaster and go do something worthwhile."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zlifb",
        "review_rating": "2",
        "review_title": "Amateur hour",
        "review_detailed_main": "Deadly Illusions sets off to a promising start before sliding gradually into farce. It feels as if those involved just went along with the flow, perhaps too naive or too scared of the director to speak up about the bizarre script and poor editing. Inconsistent pacing, curious but incomplete interludes and the laughable plot, combined with unconvincing acting and a pathetically weak ending, result in an altogether unsatisfactory performance. If this was produced as a showcase or proposal for a film to be made by a major studio, it would not have sold without significant improvements. As it is, it falls almost completely flat. The one bright spot (sufficient for a second star) is Greer Grammer's vindictive persona that finally emerges after far too much of her vacant sicophantic drivel in the first three-quarters. That at least was convincing and heart-felt, whereas the rest were merely coasting along."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ptpitts",
        "review_rating": "2",
        "review_title": "Junk Junk Junk",
        "review_detailed_main": "I don't understand this movie. There is really nothing there. A waste of Netflix money."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "adel_agawany",
        "review_rating": "1",
        "review_title": "No, just no!",
        "review_detailed_main": "The title says it all. Whenever you think of watching this movie, and for whatever reason it is, whether it is because of the trailer, or because someone who secretly hates you recommended it for you, or because for some bizarre reason you are a fan to one of the people involved making it. Remember my advice... NO! Just NOOOOOO!\n\nThe problem is, by the time you catch this review, it would most probably be too late."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lwilcox1125",
        "review_rating": "1",
        "review_title": "1 hour and 54 minutes too long",
        "review_detailed_main": "Wow. Just wow. Not in a good way, but in the worst way imaginable. Yes, I watched the entire movie. Why? I don't know. I am just the type of person who has to finish a movie or a series once I start it unless the violence and/or language becomes more than I can take. Boy, do I wish I had never started this movie. So, if you are the same kind of movie watcher as me and feel you have to finish it once you start, then heed this warning...do NOT start it! I am so embarrassed for everyone involved in the making of this film. I am even more embarrassed to admit that I actually watched it. 1 hour and 54 minutes too long!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "MisssB123",
        "review_rating": "1",
        "review_title": "One of the worst",
        "review_detailed_main": "The acting is fair, considering what they had to work with, though Kirsten Davis doesn't quite sell it. The plot, writing, and everything else are as bad as they come. Terrible movie. Just awful."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bluesparkles-59317",
        "review_rating": "2",
        "review_title": "Dreadful",
        "review_detailed_main": "This starts out okay, a fairly formulaic erotic thriller but entertaining nevertheless, but quickly descends into something ludicrously ridiculous.\n\nOnce the 'twist' has been revealed, the acting goes downhill fast, Grammer's especially was over the top and not very believable. There is no explanation for why her character targeted this particular family. The back story was weak and seriously underdeveloped. Not to mention the very final scene, which made absolutely no sense.\n\nAll in all, a decent start ans a very lazy ending. Dreadful."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "emilyrosencrantzballard",
        "review_rating": "10",
        "review_title": "Interesting and fun",
        "review_detailed_main": "Really cool movie. Liked it a lot and the characters."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "pamelatovargs",
        "review_rating": "1",
        "review_title": "SAME PLOT",
        "review_detailed_main": "I just watched this same movie in 5 different occasions, same plot, same poor acting but this added a little bit of sexuality (that was bad also, as bad as the whole movie) and reminds me a little bit the golden movies in the 90's. I never believe nothing from the plot, since the begging. Terrible script worst acting."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dvi-37579",
        "review_rating": "1",
        "review_title": "I've never seen a worse movie",
        "review_detailed_main": "Like, for real. It's so terrible. The acting is atrocious, plot is somehow all over the place and yet totally predictable. Do not waste your time."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "chad-61313",
        "review_rating": "1",
        "review_title": "Life Time Movie Gone Bad",
        "review_detailed_main": "I wish I read the reviews before watching this nonsense. This so-called film had enough cheese in it to supply every McDonald's in all 5 boroughs of NY for an entire weekend. Even if they would've cut it back to 90m, nothing could save this trash. Writing and direction took a nose dive. Although I've enjoyed two of the actors in other films, I think everyone involved in this one was high throughout the entire production. I'm not going to give away any spoilers, but do yourself a favor, like I wish I did, and just pass this one by. I would've rather watched a family of turtles race around Daytona. Ugh."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kfielding21-1",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Easily one of the worst movies I've ever seen. Confusing, acting/writing is horrible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "whitney4397",
        "review_rating": "1",
        "review_title": "the terrible acting was the most entertaining thing in rhe movie",
        "review_detailed_main": "Pointless, dragged on, and just plain sucked in every possible way"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lisaschultz-56381",
        "review_rating": "1",
        "review_title": "WTF???",
        "review_detailed_main": "The only thing good about this movie is it finally ended."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mxsuba26",
        "review_rating": "1",
        "review_title": "Deadly Illusions or Moronic Confusions",
        "review_detailed_main": "All that can be said is that the writers of this one definitely drank the bong water"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tristankapp",
        "review_rating": "10",
        "review_title": "Challenging, Arousing and Moving!",
        "review_detailed_main": "What a paradigm-shifting film! I had never watched a movie, that challenged me and made me wonder the entire time so much, like this one. It made me question everything I thought was real and what is fake the entire time. Playing with the persistence of this narrative to- and fro' so creatively, bringing in so much elements that psychologically make so much sense. Much of the movie makes you question the characters themselves, their nature. You live their desires, their pain, their fear, their joy throughout the entire movie. Kudos to the directors, the cast and the storyline is absolutely mind-blowing and yet still leaves you with a questionmark in the end. Maybe I'm just over thinking it, but I thought it was absolutely brilliant!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zarahcwilliams",
        "review_rating": "1",
        "review_title": "Painful",
        "review_detailed_main": "This is the worst movie I have ever seen! Acting is so so bad it hurts and the storyline is so ridiculous"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gailmck-62224",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "With two reputable actors in the lead I was hopeful of a good film. How wrong was I. One of the worst I have seen. Totally unbelievable and poor everything. It adds weight to the old adage that if it seems too good to be true it generally is. Totally unrealistic. Kristin Davis should have called it quits after Sex and the City."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "medusastudios",
        "review_rating": "1",
        "review_title": "How did this get the green light?",
        "review_detailed_main": "Really, really terrible film. It was almost as if someone said \"Let's take Ozon's 'Swimming Pool', a nice dramatic thriller about a writer's creative process, and throw in a little 'Hand That Rock's the Cradle' jazz, and maybe...just maybe...we can come up with something that'll squeak by!\" It doesn't squeak by. The end product is abysmal. The writing is lazy and uninspired. For one, Dermot Mulroney's character is an underdeveloped and two-dimensional place-holder in the \"insert male here\" slot. The directing, editing, acting...all very sub-par. It amazes me that with viewing audiences being as sophisticated as they are today, this product can be heralded as \"No.1 in the U. S.\" on Netflix! Please don't watch this film. Look up \"Swimming Pool\" instead. If I can save even one person, I'll have done my job."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "colette-97863",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "I can't believe I had set a reminder for this film on Netflix. The \"plot\" is such a patch-up job with giant holes. It begins with the premise that Kristin Davis is a successful author who hasn't written a new book in a long time not just due to writer's block but also because she somehow \"changes\" when she writes. So are we supposed to believe that she's imagining the events that follow? That would make more sense than accepting the preposterous behavior of the characters. Then in the climax everything is retrofitted to try to justify the ludicrous preceding 90 minutes but still doesn't make sense. Also did Kristin Davis chip a tooth? She has a terrible lisp throughout, probably exaggerated by the poor sound quality."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hadas-haimov",
        "review_rating": "1",
        "review_title": "It's the acting for me",
        "review_detailed_main": "How did nobody stop Kristin Davis when she was filming the first scene and just said: please stop. Please. Go home. Please, this is terrible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ferran-29362",
        "review_rating": "5",
        "review_title": "Boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "syvinay",
        "review_rating": "1",
        "review_title": "Nice Drone Shots",
        "review_detailed_main": "Camera work was captivating, I was illusioned into watching this incompetence of a Script writer."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "davidcvetkovski",
        "review_rating": "10",
        "review_title": "Misunderstood",
        "review_detailed_main": "Not y'all thinking movies are supposed to have a clear ending or at least a couple possible outcomes *crying emoji* Hear me out, this movie has amazing cinematography and good acting but in regards to the plot, it obviously was meant exclusively for YOUR interpretation. I enjoyed this movie a lot and when i saw the reviews i'm telling you i was in SHOCK *laughing emoji* *facepalm emoji*"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "arieljaegar",
        "review_rating": "1",
        "review_title": "RUBBISH ACTING",
        "review_detailed_main": "The acting is terrible.. I only stayed for Shanola, but even then I managed to skip through the film.. I think this has to be the worse film I watched, even the ending was meant to be creepy but I ended up laughing at how bad the acting was."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bseybolt-1",
        "review_rating": "2",
        "review_title": "Laughable Crap",
        "review_detailed_main": "This movie was apparently made by people who couldn't cut it at WE, The Hallmark Channel, or in soft-core porn. The cutting room floor must have been immaculate, as no scene was too poorly written, poorly acted, or nonsensical to be left out.\n\nAn absolute embarrassment, and hopefully a career nadir for all involved."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jennart-93728",
        "review_rating": "1",
        "review_title": "Ooof",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "arp7088",
        "review_rating": "1",
        "review_title": "Is Kristin Davis strapped for cash?",
        "review_detailed_main": "..because I don't know what other reason she would have to do this horrible movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kimberlyvanderbeke",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Bad acting Stupid storyline Creepy smiles Fake Boring nothing good to say about this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "shaunaburkable",
        "review_rating": "1",
        "review_title": "Probably the worst movie I've ever seen",
        "review_detailed_main": "If you're going to watch this movie look at it from the perspective of how a movie can go so wrong."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "mid-level nothingness",
        "review_detailed_main": "Mary Morrison (Kristin Davis) is the successful author of a pulp thriller series. She's presently retired to be a homebody with her two young kids and husband. Her publisher is desperate for a new book from her and offers her a $2 million advance. Her husband Tom (Dermot Mulroney) pushes her to take the money after making a bad business deal. She hires Grace (Greer Grammer) from a high-end nanny service. She starts having erotic dreams about the nubile hire.\n\nThis is one of those movies that used to be a mid-level theatrical release. It's a bit trashy. It has a few name actors. There is no room for these anymore. It's not good enough to be wanted by anybody. It's getting thrown into the streaming VOD vortex and be lost forever. It tries to be a bit of erotic trash, but it's not. There are no thrills except for an action scene after two hours. It has some potential drama with the cops which is quickly thrown away. These actors are not drawing anybody to this film. This is falling into the mid-level nothingness in today's cinema."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "btreakle",
        "review_rating": "8",
        "review_title": "Loved it",
        "review_detailed_main": "I personally loved deadly illusions. Kristen Davis was excellent in the pyscho-drama. Highly recommend this"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Atait89",
        "review_rating": "1",
        "review_title": "Omg",
        "review_detailed_main": "It takes a lot for me to give a movie a one star. I find it disrespectful to all of the people who work so hard on a film. That said... this movie has no redeeming quality. Nothing about this movie is good. Sat through the whole thing just in case the twist was good... it was not, in fact it made the movie worse."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "evi_markopoulou",
        "review_rating": "1",
        "review_title": "Trash.",
        "review_detailed_main": "Let's see... no plot, bad script, terrible acting. Tbh K. Davis can't act. I think Charlotte was the only role I've ever seen her where she was decent. Still wonder how these people are still in business. Save time and watch sth else."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "daverickard13",
        "review_rating": "1",
        "review_title": "Making an exception to not reviewing films to say don't even add it to your watch list!",
        "review_detailed_main": "That is all.\n\n...but if you need more; the only people giving this terrible film good reviews are people that want to think they're intellectual and arty, but are just delusional. If you don't believe me watch it for yourself and you'll find out, but for your sake I hope you don't!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mikf78",
        "review_rating": "3",
        "review_title": "The storyline and character motives don't make sense",
        "review_detailed_main": "I watched this movie because it came up on the Netflix top 10 most watched list and I thought with the actors involved it could be a decent watch.\n\nThe film is very slow moving and it really doesn't have a clear direction on where the story is going. It wants to be a thriller but the majority of the movie is a drama.\n\nI think the actors are doing the best they can with the material. Sometimes they seem like they are in a romance movie, a drama, a thriller. It's all a bit muddled and inconsistent.\n\nIt's not the worst film I've ever seen, however I wouldn't recommend it to anyone, or watch it again."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "passomagh",
        "review_rating": "1",
        "review_title": "Veryyyy very bad",
        "review_detailed_main": "I will never forget myself for watching and continue watching this stupid awful movie, very bad acting, no real story, not logical at all. I cannot belive that netfix in 2021 will produce such a bad cliche movie"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tvggrpxf",
        "review_rating": "1",
        "review_title": "Waste of time!",
        "review_detailed_main": "This is the first time I'm leaving a review, but I simply had to! Awful movie, awful story, boring, terrible acting!!! Don't waste your time on this!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "vcmalice",
        "review_rating": "1",
        "review_title": "Classic amateur cliche garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "luciantutunovic",
        "review_rating": "10",
        "review_title": "Astonishing!!",
        "review_detailed_main": "Me and my girlfriend were hooked to this epic drama. The ending was so suspenseful. We hope there will be the sequel!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "deboragranja",
        "review_rating": "1",
        "review_title": "The reviews is The only good that came from this movie",
        "review_detailed_main": "Read The reviews before watching. You Will have a laugh here and not waste your time watching this movie. Be smarter than us."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ozguryangir",
        "review_rating": "2",
        "review_title": "Bad writing",
        "review_detailed_main": "I only gave 2 star bec. i respect the people who work at the set"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "joanamarah",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "I got 20 minutes in and wondered what the hell is this so came on here and the reviews didn't disappoint!\n\nOne of the worst films I've ever watched. This was a hallmark film at best and definitely not a Netflix standard one. The acting was terrible from everyone. The writing was terrible too. The irony of having her ask her husband about her having plastic surgery is hilarious.\n\nThe constant panning of the camera and cringy cutscenes was laughable and the main character smoking is incredibly annoying, the sound and everything. There wasn't really a story to it either it was just all over the place."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "twinkle_pink",
        "review_rating": "2",
        "review_title": "Very forgettable",
        "review_detailed_main": "Accidentally started watching this for a 2nd time last night, and only realised 15 minutes in that I'd already watched it. It only came out in 2021, so that wasn't even more than a year ago."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jdkco",
        "review_rating": "2",
        "review_title": "It's bad. Such a shame for Kirsten and Dermont",
        "review_detailed_main": "Two good actors with good history. And then this. Gave them one star each for what could have been\n\nThis awful predictable movie with bad lines. No real story.\n\nBeen there done that with the \"nanny\" movies. Sigh. I had high hopes. But it was reminiscent of ordering Uber meal only to find they stuffed up your order."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "wnejdfeakh",
        "review_rating": "1",
        "review_title": "Absolutely nonsensical",
        "review_detailed_main": "I have never written a review before, never actually watched a film as bad as this. I am so angry at myself that I sat through just because I wanted to see the end. Acting is awful, every single human being bar the dog, was a steaming pile of trash. I was grossed out by the sex scenes as they were as random and bizarre as the plot. I'm actually angry for watching this when I could have been asleep. AVOID LIKE THE LITERAL PLAGUE."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "stephkeithley",
        "review_rating": "1",
        "review_title": "What even is it",
        "review_detailed_main": "I'm going to write a novel by hand and take my employee bra shopping and smoke a cigar to celebrate how absolutely brain dead I am."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Athem85",
        "review_rating": "10",
        "review_title": "Absolute masterpiece with best the best twists and acting...ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mobirl",
        "review_rating": "1",
        "review_title": "Deadly awful",
        "review_detailed_main": "Don't waste your time with this not worth it. And you'll want to get your time back."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "philwonderwall",
        "review_rating": "2",
        "review_title": "Just not good....",
        "review_detailed_main": "I'm really in no position to review this movie, as I still haven't seen the last 15 minutes. But, if that doesn't tell you all you need to know, then you need educating about film reviews... For now, I'm going to assume the ending is predictable and lame. The first 1 hour and 45 minutes is, so I don't see why that would suddenly change. In summary it's essentially a modern day remake of The Hand That Rocks The Cradle, an early 90's film that was good for its time. They've altered some aspects to modernise it, like make the live-in babysitters obsession with the mother become sexual, in addition to it being sexual with the husband. But otherwise it wanders no further from the hackneyed plot of \"obsessed outsider infiltrates and ruins family\". It's one of those films that I think people in the industry still think they're right when they have meetings around tables and say things to each other like \"We're gonna show people how wealthy this family is because people love seeing opulence!\" When in actual fact that approach is dated and considered very unrelatable these days. It kind of attempts to make you wonder whether the main female character or the babysitter character is the one causing the problems. But it just comes across as muddled and unclear. You get what might be flashbacks, might be memories, or visions from the main character of both herself and the babysitter doing terrible things, because apparently she \"gets very dark\" when she's writing... yawn. She gets so dark she randomly goes completely mental, dropping the f-bomb at the dining room table in front of her kids, after no hint whatsoever that she was about to lose the plot. And everyone reacts... as if it's fairly normal. Sadly this film suffers far too much from those annoying experiences viewers have, such as saying to him/herself \"You wouldn't do that / say that.\" Or \"Why did she do / say that?\" many times throughout the film. Ultimately, it bears little resemblance to normal people and normal everyday life, which is a shame because it's a straight up drama based on earth in 2021..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "katcgg",
        "review_rating": "1",
        "review_title": "WORST ACTING IVE SEEN",
        "review_detailed_main": "The first half is not that bad but everything after is simple idiotic, don't waste your time, the acting of greer gramer is the worst thing that could happen to this movie, the story is also very bad. Don't watch this. Really, don't"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "LoveMoviesNotExperT",
        "review_rating": "1",
        "review_title": "Netflix I beg of you .. change your algorithm!!!",
        "review_detailed_main": "Bad, bad, bad. I only watched it because it's been Netflix #1 for some time now. I wish Netflix was consumer oriented. Unfortunately they are \"advertising money\" oriented. I'm waiting for an honest platform to take over. Overall move = zero stars, Netflix = zero + shame"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "o_jota",
        "review_rating": "1",
        "review_title": "Trailer looks promising, but...",
        "review_detailed_main": "Like a poor TV show from the 70s. Plot,story and acting just horrible. I can think of a lot better ways to waste 2 hours."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lainemoeke",
        "review_rating": "1",
        "review_title": "Don't waste your time with this garbage!",
        "review_detailed_main": "It's embarrassing watch Davis bopping around like a teenager! She's a shocking actress! It probably would've been a half decent movie if they cast a different leading lady. Sigh...wish I hadn't wasted 20 minutes of my life...too hard to watch after that!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "beckyispog",
        "review_rating": "1",
        "review_title": "my father left halfway through the movie and now i wish i did too",
        "review_detailed_main": "The only character i felt empathy for was the aunt's dog.\n\ni give this 1% :)"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bienerz",
        "review_rating": "10",
        "review_title": "Watched it several times...",
        "review_detailed_main": "...still debating what I believe happens at the end.\n\nIf you liked the Soprano's ending you are going to LOVE this ending."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "IamR00t",
        "review_rating": "1",
        "review_title": "The good thing",
        "review_detailed_main": "Part way through I stubbed my toe on the way back to the couch and I found that experience less painful because I had been torturing myself with this dumpster fire. I turned off the movie and watched my toe turn black and blue as it was more entertaining."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "whitershadeofpale-89116",
        "review_rating": "1",
        "review_title": "Went online to find out the plot after watching.",
        "review_detailed_main": "I give this one mixed reviews, \"bad\" and \"terrible\"."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "axerri",
        "review_rating": "1",
        "review_title": "Boring and bad acting",
        "review_detailed_main": "Literally Netflix should pay you to watch this rubbish movie, boring and horrible horrible acting, cliche storyline"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rahat-anindo",
        "review_rating": "1",
        "review_title": "I want my time & money back",
        "review_detailed_main": "I want my time & money back now. Never wasted 2 hours like this, getting headache and need an Advil."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "qsspzhpzf",
        "review_rating": "1",
        "review_title": "Cringe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "wolter-n70",
        "review_rating": "1",
        "review_title": "Quite simply \" Appalling\"",
        "review_detailed_main": "Acting is disgraceful, plot could have been written by a child and just plain ol boring from start to finish."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tnjakgdb",
        "review_rating": "1",
        "review_title": "Really bad in every way.",
        "review_detailed_main": "In every way. I only sat through it for my husband's sake and he hated it, too. I think he thought it might redeem itself at the very end, but I don't believe in miracles."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "emilydesalvo",
        "review_rating": "10",
        "review_title": "A must see!",
        "review_detailed_main": "This movie is a must see! It kept me watching until the end! Constantly second guessing what was happening!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "noida-sanjay",
        "review_rating": "1",
        "review_title": "Incredibly senseless movie !!",
        "review_detailed_main": "Sometimes we wonder why such senseless movies are made!! Slow, boring, dull and what not! My recommendation is to save few hours instead of watching it !!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "maddyfarrow",
        "review_rating": "4",
        "review_title": "Not the foggiest",
        "review_detailed_main": "Have absolutely no idea what happened here! have no idea what the genre was, legit thought it was a comedy at some points. Like actually what is happening"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jkt2006",
        "review_rating": "4",
        "review_title": "Another Netflix trash!",
        "review_detailed_main": "It starts as a promising thriller, you start to gradually feel it's heading into some sinister direction...but it falls on its face every which way. Nothing new, nothing novel that you have not seen before. The so called suspense has been repeated so often in movies that it's a dud! Please Netflix get your act together and stop investing into trash(read \"quantity\") and begin to put the moolah into quality instead!! It's high time guys. I find Amazon prime to be selecting its movie line up way way better!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "robmilnerfhm-63116",
        "review_rating": "3",
        "review_title": "Confusing",
        "review_detailed_main": "I just don't understand how they ended up at the bra store?.... Not a great film but it did make me laugh!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alexxluonto",
        "review_rating": "1",
        "review_title": "One of the worst ways to spend your time",
        "review_detailed_main": "There was no reason or no need to make this F minus film. Nothing new, nothing original and nothing interesting. Not sure why I even spend my time watching this piece of garbage. Stupid characters with stupid decisions and reasoning for them. Not only the storyline was bad but also the storytelling was below tv-movie grade. Cliches upon cliches and with the ''cliffhanger'' ending. A bad movie in a even worst ''erotic-psychological-thriller'' genre. No thanks."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "daebbert",
        "review_rating": "1",
        "review_title": "Agreed!",
        "review_detailed_main": "Ha, first time that I've ever seen everybody agreement here"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "angelsitha",
        "review_rating": "2",
        "review_title": "Uhmm, no",
        "review_detailed_main": "Kirsten Davis is 55, her Kids are around 5, that irritated me a lot and I thought why are there those kids? Than I realised that the movie is not working without the kids at first. Than it got even worse. It leads to nowhere, just boring. Gave 2* couse I didn't watch it till the end."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "yvonnetheturner",
        "review_rating": "8",
        "review_title": "It wasn't that bad! 😂",
        "review_detailed_main": "Would actually give it a 5 but gave it an 8 to balance out the bad reviews.\n\nIt was watchable and passed a couple of hours!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "salahdahbi-05084",
        "review_rating": "1",
        "review_title": "The worst movie ever",
        "review_detailed_main": "Please do not watch it. Waist of time. It's a dime movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "arpayanoctavia",
        "review_rating": "1",
        "review_title": "TRASH",
        "review_detailed_main": "Full on Garbage Status unleashed. What a waste of time!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zippytango",
        "review_rating": "2",
        "review_title": "Nothing to like",
        "review_detailed_main": "What a piece of crap. Where to start? Unoriginal plot, bad dialogue, and unbelievable situations abound. A \"perfect\" family to hate, with their opulent lifestyle and climate-killing his & hers SUVs (Mercedes G-Class for her and a Range Rover for him). They only have one argument and it's about money. Filmed almost entirely in their home. Boring. A few bizarre and pointless scenes with no people, focussing on the dramatic San Francisco Bay shoreline, in a film in which the ocean and that coast play absolutely no role whatsoever. Bottom line, they fail to draw you in, fail to make you like them or care about them, and fail to be believable."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jannabananablue",
        "review_rating": "1",
        "review_title": "ew",
        "review_detailed_main": "This film is so bad, i wish i could unsee this omygod. even the actors wth????"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bedird-74601",
        "review_rating": "5",
        "review_title": "OK movie",
        "review_detailed_main": "Acting is not good at all. However, in summary, quite an exciting act that you get caught up in. Doesn't experience it at all as predictable as other reviewed it to be."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "papocasey",
        "review_rating": "1",
        "review_title": "Keep putting bad movies out like this Netflix...",
        "review_detailed_main": "Netflix end game is to raise prices and continue to real ease crappy stuff like this. Absolute waste of time. Terrible all around."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nadkarnisumeet",
        "review_rating": "5",
        "review_title": "Kristin shines. Film doesn't.",
        "review_detailed_main": "Deadly Illusions review :\n\nFirst things first. The only reason I spent two hours of my life on this loophole laden and at times, utterly predictable erotic thriller was only for my fave 'Sex and The City' star Kristin Davis. She plays a middle age novelist going through a writers block and to devote more time on work, hires a young nanny (Greer Grammer) to look after the kids. Not long before she starts sexually fantasizing about her sweet new employee and worse, unable to differentiate if this lesbian liaison is indeed her dream or the real world. Intense, eh?!!..you may ask.\n\nNah, on the contrary, Deadly Illusions is like those typical B movies of Hollywood watched largely for guilt pleasure than anything else. The plot is unreal, the twists are laden with glaring loopholes and the climax (or anti-climax if you could call it that) is a huge let down with some unanswered questions. To put it bluntly, the film just crumbles in the last fifteen minutes. Sad to say this as there was a good concept here which got mauled and killed by inept execution.\n\nAs for the ever charming Kristin, her performance is the best of the lot and you will actually sit through this muddle of a movie only if you love her. Others can skip it safely!!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ashdon-98696",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "I really enjoyed this movie I think it's amazing how it ended finding out who the killer is and why she acts so strange and innocent. I hope they make a sequel to this movie it was brilliant I rate it not 10/10 but 100/10."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mark130673",
        "review_rating": "1",
        "review_title": "At parts, death seemed preferable.",
        "review_detailed_main": "I watched all 114 minutes of it, waiting to find one redeeming quality. I found it finally when the screen faded to black."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mohammedzadeh",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "This the worst movie ever I watch i regret about the time was wasted watching this"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mklvntwar",
        "review_rating": "1",
        "review_title": "WTF",
        "review_detailed_main": "If I had a choice between death and watching this film again , I'd have to think about it long and hard ."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fsaelee86",
        "review_rating": "3",
        "review_title": "Cliche to the max",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "niccihoffmann",
        "review_rating": "1",
        "review_title": "Thought I had a weird taste...",
        "review_detailed_main": "... but I don't seem to be the only one really wanting my almost 2 hours of life time back. This was one of the most boring movies I have ever watched in my entire life. At some parts you also don't understand what they wanna tell you. Almost thought I was dumb or maybe nobody understands the art behind it. Don't know. I found it horrible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "pmaravillaimagen",
        "review_rating": "1",
        "review_title": "I don't usually write reviews...",
        "review_detailed_main": "I don't usually write reviews but this deserves the effort. It's totally garbage, poor acting, bad story. Don't waste your time"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "marknoble-02631",
        "review_rating": "1",
        "review_title": "What was Kristin Davis thinking !",
        "review_detailed_main": "Utter tripe. It's diabolical on every level. Why does Netflix insist on showing these hideously bad movies ? Avoid at all costs."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "haroldherrera-81092",
        "review_rating": "10",
        "review_title": "I don't understand the bad reviews",
        "review_detailed_main": "Don't let the bad reviews stop you from watching the movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dianeescamilla31",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "I literally skipped through 60% of this movie because of how awful it was. Terrible acting even worse storyline, I hated it. Stupid movie"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ChristyGuinn",
        "review_rating": "1",
        "review_title": "Garbage.",
        "review_detailed_main": "This movie is terrible. Everything about it is terrible. Won't waste my time explaining all that is wrong, it's stolen enough of my life as it is. # 1 my as$...thanks for nothing Netflix. You suck too."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Rasalgheti_2000",
        "review_rating": "3",
        "review_title": "Don't watch this crap.",
        "review_detailed_main": "Boring, predictable, badly acted, a meaningless denouement, and a story that is mediocrely lost in the dreams of a sexually frustrated woman (i mean the writer and director)"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "navinkhaware",
        "review_rating": "2",
        "review_title": "Lost midway",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "trinaboice",
        "review_rating": "1",
        "review_title": "So disappointing",
        "review_detailed_main": "IN A NUTSHELL: I was intrigued to watch this movie because I'm an author and author coach. The film's description says: After a bestselling novelist suffering from writer's block hires a new nanny for her children, the line between fiction and reality starts to blur. It's a psychological, erotic thriller that is so badly executed that I'm giving you fair warning here.\n\nTHINGS I LIKED: Fans of Sex and the City will be excited to see Kristin Davis starring in a feature film. Unfortunately, she's not a strong enough actress to save this film. Her character is conflicted in many ways. I thought it was sweet that, as a mom, she had different handshakes to say goodbye to each of her kids when she dropped them off at school.\n\nGreer Grammer stars in the movie and also produces it.\n\nI liked the original musical soundtrack by Drum & Lace.\n\nEvery author's writing process is different. In the movie, we see Kristen Davis' character writing her book with pen and paper, rather than on a computer. I have some author clients who do that. We also see her create a storyboard on a big board, a technique I recommend to my clients because it really helps you \"see\" the story develop and allows you to be very intentional where you place certain scenes.\n\nHusbands and wives need to be extremely careful in order to protect their marriage from external relationships and impropriety. For example, my husband NEVER drove home our female babysitters. It wasn't that I didn't trust him or our sweet babysitters. Too many crazy things can happen based on what other people think could have happened, you know? It's just not worth it. No, people shouldn't assume or judge, yet they do.\n\nTHINGS I DIDN'T LIKE: Even the title isn't original. So many books have been written with the same name.\n\nI'm surprised that Dermot Mulroney went for this script.\n\nWeird and creepy. I mean who takes a complete stranger bra shopping? That's the first scene when you realize the movie is ridiculous and it just gets worse.\n\nIt's often hard to know what's really happening and what's fantasy. Of course, that's the point because the protagonist can't either. Then again, the execution and writing are so bad that it makes you wonder if the writer and director even knew.\n\nThere are some really terrible acting moments.\n\nThere's a terribly cliched flower moment.\n\nLots of exposition.\n\nThere are twists but they're ridiculous with so many details that don't make sense. We're left with more questions because Act 3 is a complete mess.\n\nThere were some \"Gollum\" moments that made me laugh out loud. (The psycho hobbit in the Lord of the Rings)\n\nTIPS FOR PARENTS: This movie is NOT appropriate for children. Plus, they'll be bored anyway.\n\nYou see a married couple rolling around under the sheets. Then later, they do it in a kitchen closet.\n\nYou see some skin when two best friends are in a spa sauna & shower.\n\nA pretty girl wears an immodest bathing suit. You see her in a bra many times.\n\nThe mom smokes cigars as a symbol of her warped and developing manly obsessions of a young girl.\n\nA woman goes skinny dipping in the pool. Later, you see part of her naked chest in a bathtub.\n\nTons of inappropriate sexual illusions.\n\nTwo women kiss.\n\nYou see some blood in a murder scene.\n\nSome profanity, crude language, and an F-bomb You see the naked backside of a man in a shower Violence.\n\nl!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "roberts-andersen96",
        "review_rating": "1",
        "review_title": "I made an account just to say this",
        "review_detailed_main": "The person that wrote this movie needs to be prosecuted"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "trina_jnz",
        "review_rating": "1",
        "review_title": "A gloriously herrendous movie",
        "review_detailed_main": "Anyone who values their life would not waste their time watching this horrendously acted and directed movie. Filled with a cheesy and predictable storyline this movie is sure to disappoint and leave you questioning your life choices."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lgcorcoran",
        "review_rating": "10",
        "review_title": "A head scratcher !",
        "review_detailed_main": "Keeps you thinking even after it's over! A must watch a few more times!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rdmceagles",
        "review_rating": "1",
        "review_title": "WHAT???",
        "review_detailed_main": "I lasted 20 whole minutes. I'm wondering if anyone else lasted longer. 🙄"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "roxmewild",
        "review_rating": "1",
        "review_title": "Paint by numbers would be more entertaining!",
        "review_detailed_main": "If there is one thing I took away from this mess of a so called movie it was the Fact Kristin Davies should have Retired after Sex and the City !\n\nShe is piss poor in this but then again the whole story script etc is a pile Of Crap!\n\nPs changing the Title of the movie from deadly illusions to Grace does not make it Any better and fools nobody 🙄"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ericsdesmond",
        "review_rating": "1",
        "review_title": "Insultingly bad",
        "review_detailed_main": "So bad it's insulting. Bad plot, bad acting, incredibly bad bad bad. A waste of money making it and a waste of time watching it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "draco-hardcore",
        "review_rating": "1",
        "review_title": "Stank the place up",
        "review_detailed_main": "Very bad movie. Acting overforced. The movie has so many plot holes that it amazes me how it found a buyer. Quality control failed on this one. Good cast but bad performance. Felt like someone combined bunch of rejects from Ed Wood into movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "chellash-97657",
        "review_rating": "1",
        "review_title": "Can I get a refund for the life I spent watching this?",
        "review_detailed_main": "Awful film. I was disappointed by what I thought would be a psychological thriller. The film was a combination of bad erotica meets bad slasher, equalling a tedious and painfully awful attempt at a story. The film was a waste of time. I felt committed after 45 mins, so continued to watch. I regret my decision to see it through.\n\nI get the feeling the budget was very low. Stunts and special effects were poorly executed. The storyline really could have been turned into a good film, but it's not. I wish I had read these reviews before watching.\n\nIf I could give zero stars, I would."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "notjackiechan",
        "review_rating": "1",
        "review_title": "This was unbelievably bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jennaelectric",
        "review_rating": "1",
        "review_title": "Shocked",
        "review_detailed_main": "I was shocked by how bad this was. Lifetime movies are often better than this and that's not saying a lot. Very disjointed. Bad writing. The acting was rough too but what can you do with a script that is that bad?! I watched the entire thing as I was astounded how it went from bad to worse. It is like they started intending to make a decent film and then when they realized it was going downhill they just hit the gas pedal...."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "noomzcontact",
        "review_rating": "10",
        "review_title": "very good",
        "review_detailed_main": "I enjoyed it but sometimes it was so awkward to watch lol"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jaydenstewy",
        "review_rating": "2",
        "review_title": "Just dumb",
        "review_detailed_main": "Make No Sense by NBA Youngboy.\n\nThe Acting is a thing The whole thing just doesn't make sense like why. I m lost for words how god awful this movie is and I sat through the whole thing and you know what I'm doing it again right now just to kill time. Just a dumb movie who thought of this.\n\nEverything about it sucks eggs. It's hard to realise what is happening half the time and it's just so god damn random."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bambuever",
        "review_rating": "1",
        "review_title": "UTTER UTTER TRIPE!!",
        "review_detailed_main": "The worst acting and under acting I have ever seen in my life. The creepiest scene was the bra buying scene! What was that about? Please .... don't waste your life watching it, the only award this film will get is for the worst ever!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nunneryjed-34423",
        "review_rating": "1",
        "review_title": "Could a movie get worse than this?",
        "review_detailed_main": "Made an account to rate this movie 1 star and wish I could rate lower."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jennifart-23139",
        "review_rating": "1",
        "review_title": "Excruciatingly painful - 0 stars if I could",
        "review_detailed_main": "The deadly illusion is the illusion that it might actually get better, or make any sort of coherent sense after an hour and a half of it being a snooze fest with the most irrelevant, nonsensical plot lines, and terrible acting to top it off, but in the end your brain cells and time are murdered. If you like wasting your time and hate-watching the stupidest movies known to man, this one's for you."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ljemitchell",
        "review_rating": "1",
        "review_title": "Laughably bad",
        "review_detailed_main": "Bad acting by all, horrific writing, the worst directing. How do these movies get made ??"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fscqmcp",
        "review_rating": "1",
        "review_title": "Absolutely senseless!",
        "review_detailed_main": "Just spent almost two hours of my life with this movie. In the beginning, the plot was almost slighly creepy but then, it does not make sense. There are so many unlogical questions unanswered, e.g. How can Mary drive two hours to Grace's appartment and Grace herself comes with her bycicle every morning? Don't know why i continued watching - most probably I always thought: \"This can't be it\". But then again: it is!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "miss_gtradial",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "I'm confused and the directing, camera angles, music and the writing is terrible. I'm guttered as I was looking forward to this movie, thinking it could of been great. I really don't get what I watched to be honest as it was weird and a waste of time."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dailysongsradio",
        "review_rating": "10",
        "review_title": "Incredible",
        "review_detailed_main": "You are a bunch of suckers and haters if you rate this movie under 8. This movie is like Gisaengchung (Parasite). Soft in the beginning and thriller at the end. I f you rate Gisaengchung 8.7 why rating this 3.7? Suckersss!!! Personally this movie is amazing. I didn't get bored at all."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "KaraleeCupcake",
        "review_rating": "1",
        "review_title": "Number 4 in Denmark?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "laurafaichney",
        "review_rating": "1",
        "review_title": "Sweet mother of god.....",
        "review_detailed_main": "I have just created an account just so I could leave a review..........this honestly has to be the worst film I have ever ever seen If you feel the urge to watch just don't please please don't ....... The acting is just appalling. I know we are in a global pandemic but this honestly is just pulling the piss it's so bad I'll never get the two hours of my life back 😢😢"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "g_mak1",
        "review_rating": "2",
        "review_title": "I got dumber watching this.",
        "review_detailed_main": "I've rated a lot of movies but this is the first time I've written a review. This is truly one of the worst movies I've ever seen. And I blame my girlfriend for it. Don't watch this movie. It's terrible. I won't get this time back in my life."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lorimiller-42007",
        "review_rating": "1",
        "review_title": "WTF Did I Just Watch?",
        "review_detailed_main": "Seriously Netflix? This was worse than a 1975 remake. I know it's a pandemic and we're all in need of home entertainment, but this was a joke. Not one thing was realistic, made any sense, the acting was poor, and the story was a \"scrape the bottom of the bucket\" remake of babysitter gone bad. Everyone involved in the making of this movie should be ashamed of themselves. If you keep watching, hoping the story will get better, save yourself and turn it off."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mkmissy",
        "review_rating": "1",
        "review_title": "Created an account just to rate this movie",
        "review_detailed_main": "I wanted and waited for this movie to become good. It was too sexual with no explanation. These are actors I respected.\n\nAlso, who the hell takes their nanny to a lingerie boutique?? Weird."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hannahbethalmond",
        "review_rating": "1",
        "review_title": "Don't bother",
        "review_detailed_main": "I made it to about 15 minutes and just had to turn this movie off. Dreadful storyline and really poorly excuted."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "billkaminski-31608",
        "review_rating": "2",
        "review_title": "Well, that's two hours of my life I'm not getting back",
        "review_detailed_main": "This could have been a good movie. The premise was really good but the script was horrible. Don't waste your time with this one."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aadkins0087",
        "review_rating": "9",
        "review_title": "OUTSTANDING MOVIE",
        "review_detailed_main": "Highly recommend! A bit slow but the twist at the end makes up for all of it!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mkakaka",
        "review_rating": "1",
        "review_title": "Makes you want to be blind",
        "review_detailed_main": "How come that none of these actors, at one point, said - Wait! What are we doing?!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jodiebax-97061",
        "review_rating": "1",
        "review_title": "Worse film I've ever saw",
        "review_detailed_main": "Don't waste your time watching this, I honestly can't believe how bad it was. Worst film I've ever saw! I have never rolled my eyes so much. At the end we burst out laughing about how rubbish it was and the most frustrating ending ever. You'll regret watching it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zamboni-36633",
        "review_rating": "1",
        "review_title": "Oh. My. God.",
        "review_detailed_main": "What a terrible movie! You could fly a 747 through the plot holes and if I have to see one more slow motion sex scene that is anything but sexy, I'm gonna hurl. The big twist?! Stupidity abounds once again. Don't watch this garbage. Really. Don't."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "evanshore",
        "review_rating": "1",
        "review_title": "This film sucks you in...and then it just sucks.",
        "review_detailed_main": "It's as if they lost the 2nd half of the script and simultaneously blew the budget half way through. The film's start was compelling enough to keep me watching. But about 45 minutes in, the plot collapses and the whole picture devolves into a hokey Hallmark Channel style horror film (If there is such a category). The second half features cringe worthy casting in the form of a police detective and equally cringe worthy dialogue during the chaos of the (not so) grand finale."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hnoufaljasser",
        "review_rating": "1",
        "review_title": "TRAAAAAAAASH !!",
        "review_detailed_main": "Don't watch it I've never seen a movie so trashy and boring at the same time!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "charlotteammermann",
        "review_rating": "1",
        "review_title": "i was saying \"what?\" the whole time",
        "review_detailed_main": "Absolutely terrible. i started 57 minutes in because my roommate had started it before. i wish i could take my time back from watching this. the acting was not good, the story line could've made a good movie, but what was done with it is what makes it so bad."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rebecaioana-21278",
        "review_rating": "1",
        "review_title": "Another bad movie, another waste of time",
        "review_detailed_main": "It gets very boring and annoying, what can I say... don't waste your time and energy on this movie. It's almost as bad as the \"Knock knock\" movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "evalagunero",
        "review_rating": "10",
        "review_title": "Great movie!",
        "review_detailed_main": "Great movie with several twists and turns. Edge of your seat drama and great acting. I think other reviews were too hard on this movie. It was excellent!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bp29",
        "review_rating": "2",
        "review_title": "365 Days Was More Entertaining Than This",
        "review_detailed_main": "I read the reviews on IMDB before watching and so I knew this wasn't going to be racking up the Academy Awards, but I try to approach any movie with an open mind,,, the first half was actually ok, the tension was building and you could tell something crazy was going to happen, however it was a complete let down, this movie is the Walmart version of 50 Shades of Grey."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ithornhill",
        "review_rating": "1",
        "review_title": "Cringe worthy acting",
        "review_detailed_main": "This starts off ok, but tbh towards the end the acting is so cringe and terrible I couldn't bare to watch it. I would absolutely not waste your time with this film. The ending is diabolical"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tatmanlulu-49193",
        "review_rating": "1",
        "review_title": "Scary bad",
        "review_detailed_main": "My boo thing and I just got through with this painfully long and slow movie. My response was meh so-so. I told him I feel like they could have cut out like 30 scenes and gotten the point over that they were trying to get over. And correct me if I'm wrong, but haven't we already seen the story of the evil nanny like 1,000 times before in multiple different movies? In fact, I think one of the movies in question is called \"Evil Nanny\" if I'm not mistaken. The storyline is played out."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "designbycan",
        "review_rating": "1",
        "review_title": "What's HAPPENING!?",
        "review_detailed_main": "So acting awful, direction pathetic and the PLOT!!! There was no resolution to Mary's illusions/hallucinations. I have never seen a more half ass story in my life! Deserves and AWARD for that."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "laurenthorsteinson",
        "review_rating": "1",
        "review_title": "Can I please get the last 2 hours of my life back?!?",
        "review_detailed_main": "Ok, first things first. Who on earth have this movie more than 1 star?!? Seriously!!! Have you people never seen a movie before? I think the worst part of the movie was the directing. The entire time I kept thinking, \"I wonder if this movie would be better if they had a different director.... or script.... or acting!!!\" Which is weird because I love Dermot Mulroney. I REALLY wish I would've read the reviews before watching this. I could've watched a better movie like Glitter... or The Emoji Movie... or anything really!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sigg_e",
        "review_rating": "1",
        "review_title": "Its official, it sucks if its from Netflix",
        "review_detailed_main": "Bad acting, old story and overall very very bad... Does Netflix do any quality checks before making a movie... with all that money you expect atleast 6/10 but the best rating I can give netflix flicks is 3/10"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "vonkaviddys",
        "review_rating": "1",
        "review_title": "My head hurts",
        "review_detailed_main": "I almost feel guilty giving this 1 star but Jesus Christ... this movie was absolutely horrible!\n\nTerrible acting, the story made no sense at all, and literally 90% of the scenes didn't contribute to the story whatsoever.\n\nThe only reason I kept watching was because I was hoping the story would get better at some point or there would be a clever twist. But, nope.\n\nI'm not even sure if I should laugh or cry about the fact that this \"movie\" revolves around a writer of Thriller novels, and the actual movie couldn't have been any more cliche.\n\nSad to see poor quality movies like this one on Netflix nowadays.\n\nJust a matter of time before this trash is reviewed by RLM so we can actually get some entertainment out of this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "capezza",
        "review_rating": "10",
        "review_title": "Artsy",
        "review_detailed_main": "Hey love the opening scene...love the music...cinematography I thought was spot on. Love the house clothes etc. kept me guessing. Acting was fine. ..love this movie. I'll watch it again...casted perfectly"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Puddleduck64",
        "review_rating": "1",
        "review_title": "So bad it's funny",
        "review_detailed_main": "Bra shopping, cigars, spoon feeding, fake rubbing in the tub, the flow chart, boring really? What's really bad is this listed as a thriller. Whose obsessed with who? And who hand writes a book anymore? I'm losing brain cells as I continue to torture myself continuing to watch a middle age couple get wet over a teenager! The nanny has spent more time with the parents drinking than the children. Really feel sorry for the nanny riding the bike! I mean ouch! I'm thinking this might be a tax write off for someone at this point. Did the actors get the script the night before? Half way through can I make it?"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "danielsageenc",
        "review_rating": "1",
        "review_title": "Netflix Completely Lies",
        "review_detailed_main": "Once again as many other reviews I've written Netflix puts that a movie or show is Number 1 so people watch these HORRIBLE HORRIBLE films. I can't even write more than that."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "suzcorgiat",
        "review_rating": "1",
        "review_title": "This cr*p is what gives DID a bad wrap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tunde-04368",
        "review_rating": "1",
        "review_title": "Quite terrible - Don't waste your time.",
        "review_detailed_main": "Netflix says this movie is top 10 in my country. How? The movie is classless, the acting is terrible and the camera angles? Oh, God."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "laragi",
        "review_rating": "1",
        "review_title": "Covid garbage",
        "review_detailed_main": "I guess they thought people would be desperate to watch anything after the first full Covid year. This was terrible. Complete garbage. To think people get paid for this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cadeligosucc",
        "review_rating": "1",
        "review_title": "Waste",
        "review_detailed_main": "Total waste of time. Well I didn't really expect that much out of it but I'm really disappointed I wasted an hour of my life on this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bimmer-20464",
        "review_rating": "1",
        "review_title": "Hard to watch",
        "review_detailed_main": "It was very hard to watch this movie. It was like a combination of bad acting and just a weird plot."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hrisko-27214",
        "review_rating": "10",
        "review_title": "Best movie i've watched in a while",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mirnahelmybio",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "This is my first time writing a movie review. It's awful and totally waste of time!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "brettmetallica",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "I googled \"can I sue a movie for wasting my time\". That's how horrible this sad waste of money is. I'm upset people were paid. I'm upset energy was used."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bradleylyle",
        "review_rating": "1",
        "review_title": "Cringeworthy",
        "review_detailed_main": "I'm exactly 31 minutes and 28 seconds into this cringe fest and the antagonists acting is making me wish I never watched it. Her acting is so forced and comes off cringey and unnatural."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "the_hawk8",
        "review_rating": "1",
        "review_title": "Boring, bland, terrible script, bad acting. This is awful.",
        "review_detailed_main": "What is this movie? Lifetime movies are generally better than this. The script and dialogue are horrendous. Wooden, stiff, it doesn't sound like how people talk.\n\nWhat the hell is even happening?\n\nThis movie is so off balance that I don't even know what to say.\n\nSave this one for bad movie night with friends. Get stoned. Get drunk. Watch this trash fire."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jayhodge",
        "review_rating": "3",
        "review_title": "Waste of time",
        "review_detailed_main": "I like some things about it, the lead actress and the premise but that's it. I lead-up was too long and the ending was too quick. The blonde actress's lines were terribly cliche. I mean the whole dialogue was cliche but the blonde's was the worst. They also put a \"twist\" at the end that was infuriating. Not the good kind of infuriating. Skip this one."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "shalinigoldar",
        "review_rating": "2",
        "review_title": "Predictable plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Charles-Delroy",
        "review_rating": "1",
        "review_title": "Believe the reviews! Terrible",
        "review_detailed_main": "Worst acting I've seen in a long time. Unrealistic story poor everything. SKIP!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cohru01",
        "review_rating": "10",
        "review_title": "Worth Watching",
        "review_detailed_main": "Very decent movie. Interesting from start to finish. Give it a try."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "stephos-52230",
        "review_rating": "1",
        "review_title": "I'm confused?",
        "review_detailed_main": "By the end of this film I was laughing - is it a parody film? The main actors have always been brilliant in other things I have watched, but the acting seemed so terribly cheesy I can only assume that was on purpose??"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lildeanever",
        "review_rating": "3",
        "review_title": "That was idiotic",
        "review_detailed_main": "This movie had potential as I thought it was going somewhere interesting. But that \"twist\"? Nope. We should stop using mental illness as an excuse to make thrillers shocking and a motive for murderers. It's lazy writing in my humble opinion."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "darkmomo-81831",
        "review_rating": "1",
        "review_title": "Gonna call this one a DNF XD",
        "review_detailed_main": "Oh man at first I was into it. 80's swimsuit, hot nanny, sexy gay scenes. But I'm halfway in and realizing that I'm not even WATCHING the mvie. It's THAT boring. I might fast forward to see what's going on but damn is it boring. At least gimme hot girl on girl sexy times. But I'm seeing none of that. Just fantasies. NEXT!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "crestcustom",
        "review_rating": "1",
        "review_title": "Nooooooo!!!",
        "review_detailed_main": "I read a review a while back and they wrote: Kick me in the ba**s!! Well kick me twice!!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "atendimento-43580",
        "review_rating": "1",
        "review_title": "Don't waste your time!",
        "review_detailed_main": "Worst movie I've seen in a while. Sad to see experienced actors and talents with such a poor script. A sadness!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "missbelinda",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "There was no real plot and half way in I was still waiting to see why was going to happen. How that woman was meant to be an acclaimed writer yet can't remember she's going out with her friend after spending the day with her. The amount of times the 'nanny' spent with the couple and yet the children managed to be home without her was laughable. This could have been so much better but truly tragic and embarrassing to see some great actors in such a pathetic movie"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "blondesensed",
        "review_rating": "1",
        "review_title": "Adds nothing to a saturated genre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kristian-90052",
        "review_rating": "9",
        "review_title": "A slow burn but pretty interesting",
        "review_detailed_main": "This film isn't bad at all so I'm a bit surprised about the terrible average rating (3.6 atm)"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tjzc-87049",
        "review_rating": "1",
        "review_title": "If there is an award for the worst movie ever this right here will definitely win",
        "review_detailed_main": "No wonder why its trending on netflix. its soo bad that people wanna watch how awfull this movie was."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "csfhr-03601",
        "review_rating": "1",
        "review_title": "Terrible, just terrible",
        "review_detailed_main": "I've never written a movie review before. This one drove me to it. I can't believe that someone wrote it and produced it and Kristin Davis agreed to act in it. Every moment was cringeworthy- I just kept thinking about her colleagues from sex and the city and how embarrassed they must be for her. Kristin, don't take an acting job just to take an acting job. The good news is that this movie is so bad that people will want to watch just to see how bad it is! Like they say in show business, even bad publicity is good publicity."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rajaccie",
        "review_rating": "3",
        "review_title": "Sloww",
        "review_detailed_main": "Slow and kinda lagging ! Somehow I couldn't gel into the story ! Average movie. Simple characterization but directors vision wasn't seen ! Music was good though. Overall a ok movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "a_elokr",
        "review_rating": "2",
        "review_title": "Terrible!!!",
        "review_detailed_main": "Oh God, what a terrible movie!\n\nThat was probably one of the lousiest acting I've ever seen in my life!\n\nPoor plot, tons of holes, dialogues are so weak...\n\nNothing about this movie worth more than 2 stars by far!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "AR98282",
        "review_rating": "1",
        "review_title": "HORRIBLY TERRIBLE!",
        "review_detailed_main": "Same storyline from \"nannie\" movies but what was really bad was the ending. This could possibly be the worst ending in the history of bad movies."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jwcrash-21529",
        "review_rating": "1",
        "review_title": "Why just why",
        "review_detailed_main": "About 3 mins in we decided that this was going to either be the Mary killing grace or Grace killing Mary. In retrospect it was this whole movie killing our brain cells. Made no sense and the \"twist\" so boring.\n\nThe camera work for the erotic part of this movie was cheesy as all get out. Who starts a \"relationship\" with someone 2 scenes after meeting them. And wasn't the couple in a fight for the entirety of the movie. They had a screaming match in one scene and were screwing the next. Come on. That was bad\n\nSeemed like this whole movies goal was to make us regret watching and spending almost 2 hours on it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "daniellepaquetarsenault",
        "review_rating": "1",
        "review_title": "Worst movie I've ever somewhat watched",
        "review_detailed_main": "I couldn't even follow the plot. This was so awful that I had no idea what the writer was trying to show the audience. I only put it on because it said #5 in Canada on Netflix. Seriously?? Please don't waste your time. I have second hand embarrassment for Kristin Davis and Dermot Mulroney."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "meganshoe",
        "review_rating": "10",
        "review_title": "Great movie!",
        "review_detailed_main": "Kept me wanting to know what was happening next! Must watch!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "wintertagtraum",
        "review_rating": "2",
        "review_title": "Feels like your 08/15 90s \"Psycho\" Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "thechloeeseveryday",
        "review_rating": "1",
        "review_title": "What a waste of time",
        "review_detailed_main": "I can't even remember if I ever watched a worse movie. I'd say NO. This is utter horror. Waste of time-epic proportions. Number one worst movie of all times. Don't even know what I watched and why, but I lost two hours of my life. Just skip it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Mischiefboi",
        "review_rating": "2",
        "review_title": "Should have read a book",
        "review_detailed_main": "The story line has been done to death. A mishmash of different, better written movies."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jennygardner90",
        "review_rating": "1",
        "review_title": "Watch this stoned",
        "review_detailed_main": "This movie was amazing if you hit it at the same time you press play. But I saw a completely different movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cala3",
        "review_rating": "1",
        "review_title": "Dermot Mulroney is still fine 👌🏽",
        "review_detailed_main": "Dermot is literally the only redeeming quality about this movie. The rest is absolute nonsensical trash.\n\nI was trying to figure out if it was a Harlequin Mystery or some such garbage. I kept sticking with it in case it actually went somewhere. How does almost two hours of this nonsense actually get put together, marketed, sold and put on Netflix? That's the most baffling part about the whole thing."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kentarjy",
        "review_rating": "1",
        "review_title": "Gave Me a Headache",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "khaladi",
        "review_rating": "1",
        "review_title": "Zmi9",
        "review_detailed_main": "So so bad, terrible acting don't waist your time and save yourself"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mrdonleone",
        "review_rating": "8",
        "review_title": "Good . movie",
        "review_detailed_main": "Very good movie. Can I hear an Oscar??. Everybody should see this movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "joostkale",
        "review_rating": "1",
        "review_title": "I don't give anything below a 2 star, unless it's this level of awful",
        "review_detailed_main": "I was warned about this. I should have known it was going to be this bad, but I had to be stubborn and watch it myself. If your wondering why I decided to watch it after knowing it was bad. I said in my Thunder Force review that it had a good chance of being my pick for worst movie of the year. While I was writing that I was thinking: \"I haven't seen Music or Deadly Illusions, so maybe it's not the worst?\" So, I gave one of these a try and immediately regretted it. This is far below a bad movie. This is an awful movie. The story has no clue what it wants to be. The acting is below mediocre. I laughed out loud multiple times about how bad the performances are. The dialog is not good. Its cliché stuff and so on the nose that it hurts. Also, the technical aspects are so annoying. Why are there so many cross-fades? And was the audio doing to this poor actress voice in the end? The only reasons I'm not going below a one star, is because it kept me mildly intrigued. It kept me interested enough to not turn it off. But that third act oh my god. The ending is so badly executed that I wanted to get drunk, so I could forget it as fast as possible. I still have so many questions. It's very hard not to spoil the ending, but why did this person go through all the trouble to get there? There is no reasoning at all. I'm going to watch Ted now just so I can wash away this mess of a movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Meeshay",
        "review_rating": "2",
        "review_title": "Ridiculously bad",
        "review_detailed_main": "Watched because it was \"trending\" Didn't expect much but oh my dear lord I didn't think it would be this bad. The whole thing is even more ridiculous than a soap opera. The acting is truly terrible but since the three main characters were able to make it through the most absurd scenes without bursting into laughter, I guess they deserve some credit for that?"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "idmorrison",
        "review_rating": "1",
        "review_title": "Had potential, but nope",
        "review_detailed_main": "There were some interesting concepts floated at the start of this film which could have made it a half decent watch - I'm guessing this is why so many people endured the full run time. For those familiar with the Room, it drew far too many comparisons in terms of bizarre storyline and pointless references as the Tommy Wiseau cult classic, if only it had anywhere near the endearing charm of Tommy or the spoons..."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Scebert",
        "review_rating": "1",
        "review_title": "Beyond bad",
        "review_detailed_main": "Complete waste of time. I am shocked this film is trending on Netflix. Not even Dermott Mulroney could come close to saving this disappointment"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jeffven-34023",
        "review_rating": "1",
        "review_title": "What is the director's thinking?",
        "review_detailed_main": "Can't believe someone can make a rubbish movie like this? Its just waste everyone's time to watch it!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "elliotjeory",
        "review_rating": "5",
        "review_title": "So bad it's kinda good??",
        "review_detailed_main": "Even though the film kind of dragged and took ages for the story to develop I kind of liked it in an ironic way as I found it unintentionally funny and fascinating. Netflix films like this are my guilty pleasure, they're absurd in story but make entertaining commentary whilst viewing with your partner. Lol."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cdshanken",
        "review_rating": "1",
        "review_title": "Please, for both of our sakes, do not, under no circumstances, watch this movie!",
        "review_detailed_main": "I am not a savage critic, nor do I write reviews that often, but not only did this movie make no sense, it was so disgustingly awful that I would rather sit in the DMW for one week straight in the middle of the desert with no food or water than watch this movie again. The fact that it is #2 in the US right now makes me want to vomit."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bienmc",
        "review_rating": "10",
        "review_title": "Made me think",
        "review_detailed_main": "Loved it! It definitely makes you think and makes you wanting more!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lomaxx-27257",
        "review_rating": "3",
        "review_title": "SLOW.",
        "review_detailed_main": "Slow. Slow. Slow. Ssssslllooowwww.\n\nSlow. Boring. Slow. Tedious. Slow. Cliché. Slow.\n\nGood deception theme, but frustratingly missing wildly. Wandering aimlessly ..most of the story stuck in one place.\n\nMom on Nanny stuff mildly amusing but -- slow. Finally some progress forward at 1:22:37. Kristin Davis recast, sorry, and snapping it up about 50% faster, would give it a 5 or 6."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "squeenp",
        "review_rating": "2",
        "review_title": "Overused twist",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "natashancooke",
        "review_rating": "1",
        "review_title": "Wish I could get back 114 minutes of my life",
        "review_detailed_main": "Would not recommend this movie to my worst enemy. If I had the choice between watching this movie and eating only soy beans for the rest of my life. Soy beans 100%"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "skipjen-18270",
        "review_rating": "1",
        "review_title": "The WORST movie I have ever watched",
        "review_detailed_main": "I literally only wrote this review so that I could give it a 1 star review. ....and one star is generous."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "robinbreuer-38218",
        "review_rating": "1",
        "review_title": "Don't watch!",
        "review_detailed_main": "This movie is just Bad. I am so angry, i even made an Account."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mail-584-594576",
        "review_rating": "1",
        "review_title": "Everyone in this movie deserve a razzie awards.",
        "review_detailed_main": "I have never seen such bad acting before. It's so bad that it's good. They should've listed the movie as comedy."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fkennedy-41589",
        "review_rating": "1",
        "review_title": "The writers bailed; you should, too.",
        "review_detailed_main": "I think the writers of this movie escaped before crafting an ending. Future viewers do the same. The only reason to watch this film is to see how many plot threads are tied together - they aren't. The result is like noshing on some snack foods, and getting a nice beverage to wash it down, except the hopefully satisfying beverage is a cup of dirty sand. And at the bottom of the cup is a note that your snack is tainted with salmonella."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "yourfriend_hsn",
        "review_rating": "9",
        "review_title": "Don't know why it is rated too low.",
        "review_detailed_main": "The movie is good. Although ending may come up with a twist."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kmaddy365",
        "review_rating": "1",
        "review_title": "2 hours of my life i will not get back",
        "review_detailed_main": "Terrible, absolute garabage...wasted 2 hours of my life watching this off the recommendation of my wife....terrible film"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "luckysgirl26",
        "review_rating": "1",
        "review_title": "Jeez really?",
        "review_detailed_main": "I wish I would've read the reviews first. Not only is the story bad, the acting is horrendous. I actually laughed. Skip this one... do yourself a favor and waste time doing literally anything else."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "osaure",
        "review_rating": "1",
        "review_title": "Wow...",
        "review_detailed_main": "This is a bad movie. I like bad movies, but this isn't even bad in a good way."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "heidifatula",
        "review_rating": "1",
        "review_title": "Filth and Stupidity",
        "review_detailed_main": "I mean really if they are going to create such trash they could have at least shown more boobies."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "SpaceCowboy89",
        "review_rating": "2",
        "review_title": "Bad Movie",
        "review_detailed_main": "Bad Movie, save two hours of your life. One hour in i was thinking when do stuff start 30min away from the end i realized this never gonna happen , for me it was to late, dont do the same mistake."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "CC2021",
        "review_rating": "1",
        "review_title": "Seriously, who allowed this to production.",
        "review_detailed_main": "I have never written a review concerning a movie but yet here I am, to complain about Netflix top rated 1-10 movies/tv shows that come out, where do they get their information from? This movie was downright boring, slow, and felt like I was putting together the smallest yet most confusing puzzle together. And not an interesting one. This movie barely if at all let who you know the characters which I understand isn't really developed fully in a movie, but this just barely scrapped the surface of anything that would want to keep you engaged. You don't even have to focus on this movie, more like slow background noise where half the movie was kind of silent. This is actually a reason I never got into watching movies, it's 1 1/2 - 3 hours of a forced plot, sometimes okay or even good, but there most the time seems as if writing these plot lines, even the writer would be best to serve his time doing something else. The acting was cringe worthy, awkward, and the part that bothered me the most was when they were having dinner, random scene again, and she told Grace basically I thought you said you didn't intrude on family time, but then Starr's screaming about her husband and Grace sleeping together, but yet the husband sat there as if he were gaslighting her as well. I mean so your telling me a couple who has a good marriage, has a nanny show up and she is sleeping with husband and wife for them to never know. And yet she got the nanny to cook, clean, and watch the kids but yet the nanny is hardly ever with them, she's what, giving massages by the pool or in the bath, and creeping about in a very drifting away movie. I just don't get it. I actually feel pity this movie ever even made it on screen."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jessiehenderson-41294",
        "review_rating": "4",
        "review_title": "Deadly Movie...",
        "review_detailed_main": "First off, why is this so overrated on Netflix?? It was a frustrating experience. While the idea could've been unique had it been executed properly, it was more disappointing and confusing than anything. Also, let's put things in perspective, how is she the number 1, best selling novelist?? Wouldn't everyone know about her if she was? Including the nanny that came over who had no idea who she was (mind you, the young nanny reads novels for fun and they bonded over that) it's a bit of a stretch to make her that successful and renowned, and then we never get to see her write until halfway through the movie. I'm surprised this film has Dermot Mulroney!\n\nThe villain's goals are unclear and unmotivated and nonsensical. This couldve been a good psychological thriller but it was just lost about what story it was trying to tell. Also, the bits that were used as foreshadowing pieces we see in the beginning of the movie don't pay off or work later. The fantasy wasnt really fantasy like since it just made no sense (even for fantasy) and in the end, everything is blamed on mental illnesses, of course. But that also means both of them were crazy? The ending was one of those confusing endings were nothing is explained merely because the writer/director doesn't have a clear vision either and just wants you to wonder what the answer could be. I don't recommend this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mohammadhussain-78913",
        "review_rating": "10",
        "review_title": "Different concept,",
        "review_detailed_main": "Different movie, not a typical mystery or thriller.\n\nThe movie first starts a typical mystery/Drama, than gets a bit slow and the momentum of the movie fades a bit, but the last half is filled with a lot of twists and turns.\n\nOverall do think that the film was abit too stretched and there could be some better scenes which could form a better connection between the starting and end of the movie. But the acting from all the actors was good though.\n\nI feel movies like these are interesting that show a different perspective rather than a more predictive storyline so it will be a good watch for people who like unique storylines\n\nGreat watch, great acting!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "simonazucca88",
        "review_rating": "3",
        "review_title": "This movie could have been a sentence",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "tiagoadao",
        "review_rating": "1",
        "review_title": "How can I get my two hours back?",
        "review_detailed_main": "Please don't waste your precious time watching this movie. It's plain bad."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "wilkinstmksn",
        "review_rating": "1",
        "review_title": "Please end this",
        "review_detailed_main": "I am now one hour into this awful awful film. Please hold make it stop"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jaredstaub",
        "review_rating": "1",
        "review_title": "Might be the worst movie I've ever seen",
        "review_detailed_main": "Do not watch this it is a complete waste of time. Terrible movie."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alexv-36632",
        "review_rating": "1",
        "review_title": "Would give it zero if it was a option",
        "review_detailed_main": "Such a poor film from start to finish, acting is terrible and cringe and the plot is just awful. 0/10."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "avathegermanshepherd",
        "review_rating": "1",
        "review_title": "I created an account just to say how horrible this movie was",
        "review_detailed_main": "Wasted two hours of our lives. No plot, horrible acting, recycled ideas from other thrillers. How do these movies get made."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "charmerize",
        "review_rating": "3",
        "review_title": "Boring and slow",
        "review_detailed_main": "Boring and slow. I had to make myself get through it. The camerawork and music were decent, I'd even say good, but the acting is awful. Kristen Davis is stiff absolutely lacks emotion. She goes back out of character so fast it's like she never acted before. Greer portrays an innocent girl you hate in the beginning well, but her acting gets worse as the movie goes on. Kids' acting was so superficial. It's predictable, laughable and not original, lacked depth and connection with characters."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rickobeatty",
        "review_rating": "9",
        "review_title": "Good thriller",
        "review_detailed_main": "Umm, surprised by the low ratings, an enjoyable well acted thriller."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rubaabouturab-48304",
        "review_rating": "2",
        "review_title": "Terrible movie",
        "review_detailed_main": "Terrible acting terrible storytelling and terrible in everything. I gave 2 points only because the basic idea of the movie was kind of okay but all the execution was awful."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "petrina0",
        "review_rating": "1",
        "review_title": "3 year old's writing",
        "review_detailed_main": "Hahahahahahahaha it's so bad it has to be intentional comedy. There s no way someone sane financed this thinking it s a psychological thriller"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kizzie_nikita",
        "review_rating": "2",
        "review_title": "I had to downgrade",
        "review_detailed_main": "I gave this 3 stars as it was watchable...until the last 20 minutes were so cringe alongside the acting being Z list embarrassment I had to change my rating to 2 stars.\n\nWords can't explain how ridiculously embarrassing the last 20 mins are though, it's like any acting skills were all used up prior and some person who had never acted in their life was thrown in.\n\nShame as the plot could have been done well if they actually tried. There's alot you can do with phycological films like this, but they had no idea what route they wanted to go with and it really does show as it's just a Mish mash and all over."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jenweaver31",
        "review_rating": "3",
        "review_title": "Terrible acting!!!",
        "review_detailed_main": "My coworker recommended this movie. The acting was TERRIBLE!!!!! The storyline was predictable. I do not recommend it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gary-64525",
        "review_rating": "2",
        "review_title": "A little stoned probably helps",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "margobesse",
        "review_rating": "1",
        "review_title": "Please watch! Just to see if you agree with us!",
        "review_detailed_main": "Absolute BS. Kept waiting for the story, dialogue, acting,or intrigue to get better. The End."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "beautifultragedy-12949",
        "review_rating": "1",
        "review_title": "Another Lifetime movie",
        "review_detailed_main": "Can yall please stop calling this Netflix trash and call it for what it is, Lifetime trash movie. The acting is horrible, but the movie is ok but you're still asking yourself wth did I just watch."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sdfvnfjsnksjf",
        "review_rating": "10",
        "review_title": "A masterclass in storytelling!",
        "review_detailed_main": "Amazing film! Truly! So you have a writer who doesn't own a computer. Kelsey Grammar's sperm turns up to baby sit some kids and she has an ass that seems to turn everyone gay for her. The family don't own a dog but they might own fish, not confirmed. The child actors are only bettered by the sensational product placement of a phone always in shot somewhere and some Adidas trainers worn by barely legal blonde.\n\nRachel's ex boyfriend needed some cash and my God does he earn it with good hair and the 470 sex scenes he's in.\n\nPeople drive cars, a little girl plays a recorder, mental health is funny and a little bit evil, honestly, the film has it all.\n\nRumour has it that the film was made totally in the dark and colour was added digitally post edit."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bombres",
        "review_rating": "1",
        "review_title": "HORRIBLE",
        "review_detailed_main": "This movie just sucks. There's no other nice way to put it"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "vivienne-west",
        "review_rating": "1",
        "review_title": "I liked the house.",
        "review_detailed_main": "I liked the house.....yep, that's the only positive thing I could think of saying."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "annavkswahn",
        "review_rating": "1",
        "review_title": "Nonsensical trash",
        "review_detailed_main": "Don't do it to yourself. I created this account solely so I could warn others!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ioneebrijanareid",
        "review_rating": "2",
        "review_title": "The logic is the best!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "marymcfarland-01866",
        "review_rating": "1",
        "review_title": "Netflix is Trying My non-Patience",
        "review_detailed_main": "Seriously, this is the 5th Netflix program today that I've stopped 5-20 mins in because it sucked so hard. Get it together, Netflix. I'm not paying for terrible plots, bad acting, and stupid storylines. Jeez."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "leonipickering",
        "review_rating": "1",
        "review_title": "I couldn't even see it through.",
        "review_detailed_main": "This movie makes no sense and the acting is so cringe. I had to turn it off."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "thelk-06369",
        "review_rating": "1",
        "review_title": "What is this",
        "review_detailed_main": "Why is this number one on Netflix. It's landfill. The writer should be ashamed of themself and move on to a lesser career."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dime-store-poet0",
        "review_rating": "8",
        "review_title": "I love it!",
        "review_detailed_main": "After reading the critics here, I was expecting a low quality movie but it was really good and fun. First of all it doesn't feel like 2 hours. Acting was good. Suspense was always there, \"Is this real or fantasy?\" \"Is the nanny poisoning her?\" \"What's going on?\" etc. The only part I didn't like was the wrongfully executed mental health part in last 15 mins. I don't wanna spoil it, it doesn't happen like that!\n\nI think conservative, homophobic, racist and boring people should stop watching Netflix & whining and watch the grass on their backyard."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "peternbrant",
        "review_rating": "1",
        "review_title": "It's not good",
        "review_detailed_main": "Usually a film can get away with bad cinematography if it has a good story and I'm sure the director thought that they could get away with it because they wrote it. They were wrong. The story sucked"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fredrik-16320",
        "review_rating": "2",
        "review_title": "Could have been so much more...",
        "review_detailed_main": "I watched the whole thing just to see the end twist that never came. Instead it ended in a very unoriginal kliché way. It was like the writers couldn't be bothered to even try to come up with something new. Too bad!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "charlesrileymusic",
        "review_rating": "5",
        "review_title": "Victim of bad editing",
        "review_detailed_main": "This movie is a great example of where pinching pennies on the budget for the unsung heroes behind the scenes can ruin a flick. This could have been amazing. But nope. Mediocre."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "shoefloozy",
        "review_rating": "5",
        "review_title": "A Bra fitting?",
        "review_detailed_main": "I work as a nanny for a living and lemme tell you if my employer brought me shopping for Bras, picked them out AND stayed in the fitting room while perving my body and making comments.... I'd slap her with the biggest sexual harassment lawsuit."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "lucifer_over_tinseltown",
        "review_rating": "1",
        "review_title": "Barmecide Feast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Mehki_Girl",
        "review_rating": "5",
        "review_title": "Love the Whiners",
        "review_detailed_main": "This movie wasn't that good, but not that bad either. It's pretty clear what's going on. It's in the title - duh.\n\nI liked Kristen in Sex and the City, but her bad plastic surgery was distracting.\n\nThe conservatives whining about the movie would deny racism exists or that they're racist, but somehow always manage to reveal themselves.\n\nEvery placement of black actors in a movie is somehow PC, but they would be the first to claim they have a black friend.\n\nGolly gee, if racism doesn't exist, wouldn't black people exist in every strata of society and be friends with whites? But that's the problem with conservatives they constantly whine and contradict themselves and make zero sense. Black people exist, get over it.\n\nHere's a tip, stop watching movies made by Hollywood. Cancel your Netflix subscription. As a matter of fact, just turn off your TV and cancel all streaming services and sit in the dark where minorities, none of whom you're racist against, exist.\n\nThere, fixed that for you.\n\nTired of reading your whiny, snowflake comments, like there's no off switch on your remotes."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gustheaffen",
        "review_rating": "1",
        "review_title": "Really bad - aging actors desperate for some air time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rkanalbay",
        "review_rating": "8",
        "review_title": "Actually good !",
        "review_detailed_main": "I don't know why so many people didnt like this, I think it has no classic ending were you get everything explained. I dont think it should be. This was entertaining and good acting. The stroy seems a little thin, but directing makes it good.... I enjoyed it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "draganaapp",
        "review_rating": "5",
        "review_title": "Wtf is this?",
        "review_detailed_main": "They had a good story, but they make it sooo boring"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "queso-95836",
        "review_rating": "1",
        "review_title": "I suffered more watching this movie than recently having no water, power and freezing in Texas",
        "review_detailed_main": "#1????? Don't waste your time watching this movie. I am not sure who ranks these movies on Netflix but they dropped the ball on this one. I will read the reviews before I watch another \"Top 10\" Netflix movie again."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aydinbekoglu",
        "review_rating": "1",
        "review_title": "What did I watch?",
        "review_detailed_main": "I watched this movie expecting a thriller kind of story, instead I got something worst than an experience of watching paint dry.\n\nThe acting is beyond terrible. The writer woman looks like someone who is just rehearsing the role for the lead actress who is sick at home. The character developmnent is zero and the story progression is so murky. The director wanted to make something suspicious, ended up with being meaningless.\n\nIs it erotic? No Is it interesting? No Is it scary?\n\nOnly if you think about the time you lose watching this."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "joannegriffiths",
        "review_rating": "1",
        "review_title": "Worst film ever!",
        "review_detailed_main": "Bad story line, bad acting! The whole film just doesn't make sense. A cheap holiday paperback they have made into a film which doesn't work"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hfares-98117",
        "review_rating": "3",
        "review_title": "Good story, bad acting, bad directing, bad everything..",
        "review_detailed_main": "I think the story has fallen into the wrong hands.. It could be better with another crew."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alicia-franks",
        "review_rating": "1",
        "review_title": "Just thought I would add my numbers to the many registering in order to express my disgust",
        "review_detailed_main": "Laughable, shocking acting, terrible story line. Please give me back my one hour and 40 minutes The only reason I watched until the end was because my husband was convinced this was one of those movies that was so bad that the ending must be good, that the twist would make up for it. I like the end credits because it meant I could turn it off."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jennytouchie",
        "review_rating": "1",
        "review_title": "One of, if not the worst movies I have ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "alurafoxx",
        "review_rating": "10",
        "review_title": "New age plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "albertval-69560",
        "review_rating": "2",
        "review_title": "AMD THIS IS SUPPOSED TO BE A THRILLER!",
        "review_detailed_main": "This is a film that totally lacks drive. To think it's touted as a thriller. Pacing is slow bordering on boredom. Acting of the main protagonists is so wooden, so contrived. Dermot Mulroney and Kristin Davis are known for their consistent acting. This is definitely not the case in this one. And Greer Grammer, who is psychotic, does poorly in essaying her role. Too bad. A tiny saving grace are the cool shots of the lake or river. But that's it."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "blueberry-jen",
        "review_rating": "1",
        "review_title": "Awful, don't wate your time",
        "review_detailed_main": "Disappointing how bad the acting is from the leads. Really bad. A waste of time to watch this movie, it's ridiculous from start to end."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "radel-92036",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Such an awful movie - made absolutely no sense !! The storyline is not well written and alot of scenes are left without answers"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "richardbooth-45596",
        "review_rating": "1",
        "review_title": "This is why Netflix needs a rating system",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "dayana421",
        "review_rating": "2",
        "review_title": "Another Garbage by Netflix",
        "review_detailed_main": "Netflix never disappoints one garbage show after another. Forced story line pointless. I am still waiting for a semi decent show from Netflix, looks like I have to wait for a long long time."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "reenusthomas",
        "review_rating": "1",
        "review_title": "Deadly painful to watch",
        "review_detailed_main": "Such a drag and waste of talent and time!! The whole movie revolves about someone being in the pool or bath.."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "avalterra",
        "review_rating": "1",
        "review_title": "Stunningly bad but....",
        "review_detailed_main": "Yes, this movie was atrocious. Possibly one of the worst I have seen in my life. However, there was an upside. For all of you who suspected that the Netflix, \"Top 10 in the ((country name)) today\" list was manipulated, this film is proof. A movie that everyone agrees is terrible is still somehow number one on the list as of today - 3/24/2021."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "benjamingabrielj",
        "review_rating": "1",
        "review_title": "The movie made me a deadly illusion",
        "review_detailed_main": "At an hour in I thought a day had pass and I was only half way.. i begin to think am I the movie and they are watching me.."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "faliciamrzljak",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Terrible movie, one of the worst I've seen in a long time. Terrible plot, terrible acting. I don't know how Netflix decided this storyline would be a good idea."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "MoviesforRelaxation",
        "review_rating": "3",
        "review_title": "Uncomfortable and Too Ambiguous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Kingslaay",
        "review_rating": "4",
        "review_title": "A waste of time",
        "review_detailed_main": "There could have been some potential with this film. It seems steady in the first half and then badly unravels towards the end. I was hoping for a suspenseful thriller with an interesting twist. But so much of it falls apart and does not add up. Why was Grace so easily able to get away with being the baby sitter for so long? Did the agency not check in or Mary not expect to pay for services? It was quite predictable that Grace would be a villain of sorts in the end. The way they explained it did not add up. They didn't explain her condition well enough and her erratic behaviour was never really explained, it felt like a rushed and poorly developed plot point. Also the icing on the top of this bad film is the bad acting which poorly sells this film."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ashleyy-howard",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "I can't believe this is number 1 in the US on Netflix. How?? The whole thing was so bad and like everyone else said, a waste of time. The writing and direction sucked!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gillwheeler-14313",
        "review_rating": "2",
        "review_title": "A very poor film",
        "review_detailed_main": "Badly acted, ridiculous storyline - certainly more like a second rate TV film."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "hestefly",
        "review_rating": "1",
        "review_title": "Abominable!",
        "review_detailed_main": "WHAT, HOW, WHY???? Goodness me! Shockingly awful movie! Don't waste your time, save yourselves! Mind you, we did laugh A LOT at the absurdity of it all so If you need a good laugh, this might be for you!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Saoustou88",
        "review_rating": "1",
        "review_title": "Negative Stars",
        "review_detailed_main": "I lasted 10minutes. Awful everything, wow! Listen, don't do this to yourself. If you love yourself, your time, your sanity, then avoid this useless film at all costs."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rachelbox-56260",
        "review_rating": "1",
        "review_title": "Wish I could give this a negative rating",
        "review_detailed_main": "Ok, I've never written a review on any movie, good or bad. This was so bad I created an account in order to warn others. Almost two hours of my life I will never get back. This is a movie that you know gets made because the stars in it need a paycheck."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "neiderjenny",
        "review_rating": "1",
        "review_title": "What in the world?",
        "review_detailed_main": "My eyes!!! I got 30 minutes in and had to give up. Worst movie ever."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "thejaredisaac",
        "review_rating": "1",
        "review_title": "Developed serious PTSD after watching how bad this movie was...may sue film maker",
        "review_detailed_main": "Things I'd rather do then watch this: -Pour tabasco in my eyes -smell my girlfriend's farts -stay at the Cecil hotel."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cappeca",
        "review_rating": "1",
        "review_title": "Yes, it's that bad",
        "review_detailed_main": "I was tricked into watching this by Netflix top list. Usually I come here to check ratings before I watch anything, but I was ready to go and this was up so I just tried my luck. Oh boy, how do I regret this. This one is written, directed and produced by the same woman, because no one else wanted to get involved and told her it was a bad thing, but she probably said \"Fine, I'll do it myself\" and did. And it shows. This is like a TV movie from the 80s, but worse. This is like some kids picked their phones and went \"hey, let's make a movie right now!\" This is the stuff you do when you get drunk and have to apologize for it later. This is more embarrassing than a sex-tape scandal. Don't waste your time."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mariaflorencia-49864",
        "review_rating": "2",
        "review_title": "At least half an hour too long",
        "review_detailed_main": "This movie isn't different from any other cheap, Lifetimesque thriller Netflix offers. Bad script, mediocre acting, gaping plotholes... We got the full package; but truth be told, we saw it coming from a mile away. What I can't forgive is the length: almost two hours of my life just so the director could show me a a collection of supposedly \"erotic\" (and in reality really lame) scenes? What a waste."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "gurumaggie",
        "review_rating": "1",
        "review_title": "Deadly Mince",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "nadejdachemoul",
        "review_rating": "1",
        "review_title": "Impossible to watch",
        "review_detailed_main": "Without any expectations I started watching this movie and I simply couldn't. It looks so unrealistic from the 1st second, as if robots or aliens inhabited earth and tried to act like humans. A person can't keep smiling all day long *cringe*."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "oaken007",
        "review_rating": "3",
        "review_title": "Watched the whole thing, couldn't tell you what it's about.",
        "review_detailed_main": "I watched this movie on a flight and fell asleep with 50 minutes left. Came home and finished the rest while unpacking. Couldn't explain really anything. I am a little lost in the plot. Doesn't seem too important because this movie was quite boring."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "justinekeefer",
        "review_rating": "3",
        "review_title": "I just...",
        "review_detailed_main": "I just don't have the effort to type out a long-winded review as to why or why not this movie is watchable. Watch it if you want. But it's an absolute ATROCIOUS depiction of mental illness that I just can't behind, no matter the plot point. That was the most annoying/alarming thing to me throughout."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Remoire",
        "review_rating": "5",
        "review_title": "5 for not Mediocre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cool_jojo_007",
        "review_rating": "5",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "bennyq85",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen",
        "review_detailed_main": "I've seen a lot of movies, and this is a special one.. i dunno how this thing got produced"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "brittneyposh",
        "review_rating": "3",
        "review_title": "Wasn't good but wasn't terrible either",
        "review_detailed_main": "It was just ok. The movie left me feeling blah. I've seen this exact storyline on lifetime a few times, the only difference is it has some explicit scenes. Nevertheless, I was on the edge of my seat the entire movie. Little details throughout kept wheeling me in and kept me watching. I would get my hopes up but then nothing catastrophic would happen. There was no major payoff. I will say this, the movie was not boring. It definitely kept me interested."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "proeraonly",
        "review_rating": "5",
        "review_title": "Potential",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "fredlindgren",
        "review_rating": "1",
        "review_title": "Terrible terrible terrible",
        "review_detailed_main": "Easily on the top of any list gloriying the worst movies ever... the story, dircting, the acting, its all so bad its actually great. WTF are there known actors in this movie? I mean its C worth actors at best that are eligible for this plot! Jesus Christ is this a bad movie to avoid... im just worried as to why it came up as a suggestion for me to watch on Natflix... where did I go wrong???"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Dar Star",
        "review_rating": "5",
        "review_title": "Lurid trash but the rating is too low",
        "review_detailed_main": "Yes this is lurid trash that has a disappointing and unimaginative ending. It wants to be a poor man's Basic Instinct, but doesn't measure up. But. The ratings here on IMDb are wayyyyyyy too low. This is not a 1 rating film. A 1 rated film is unwatchable and this is not the case here. You are engaged as the audience trying to figure out all the possible twists and turns so you are never bored. Sure the denouement is not great, but it falls within the average category and that's what this film deserves, an average rating of 5. People giving this a one rating are simply venting and not giving a true accurate rating."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jmsilva-41791",
        "review_rating": "5",
        "review_title": "Dissociation Identity Disorder",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "rodgere",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "After reading all the other bad reviews, I had to watch it to see for myself and everyone was right, it was terrible. It was like a bad Lifetime movie. The acting was awful and the motivations made no sense. The fact that this garbage is the Number 1 movie on Netflix this week is unbelievable."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "elpyamsler",
        "review_rating": "1",
        "review_title": "Please, do not watch this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "obviouslyella",
        "review_rating": "1",
        "review_title": "Idiotic and Unlikable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sjmzgkck",
        "review_rating": "1",
        "review_title": "Wow. Believe the reviews.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kiowhatta",
        "review_rating": "1",
        "review_title": "Urgh",
        "review_detailed_main": "There's such an abundance of cheese, sugar, soap and cliches that you'll likely get constipated, diabetes, clean skin and epilepsy from cringing-that's if your eyes don't roll right out of your head first."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "zoebirch-30646",
        "review_rating": "4",
        "review_title": "Wow....just Wow!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "ingamazonaite",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Really hideous movie. Not sure what Kristin Davies are doing here, but apparently, she is produser of this trashy movie too.\n\nMovie is absolute nonsense, no plot, no future, no nothing.\n\nHorrible wasted time."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "coleyrae",
        "review_rating": "1",
        "review_title": "Shuh up shuh up shuh UP",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "linh-39",
        "review_rating": "1",
        "review_title": "Just Cheap!!",
        "review_detailed_main": "Cheap acting, cheap film and cheap plot. Everything about this movie is just cheap and terrible. Wasted my 2 hours and so regretful! Signed up an account just to write review about this movie that i have never done before. Kristen Davis and Dermot is just so plain and disappointed.\n\nInfuriating frustrated how bad this movie is made."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "Lexiii67",
        "review_rating": "1",
        "review_title": "Perfectly terrible",
        "review_detailed_main": "There is not one redeeming quality in this entire movie....awful from star to finish. I only watched the entire movie become I couldn't find the remote (I was sitting on it). The whole falling in love with the babysitter, buying her bras??? So creepy. I'm a nanny and my boss has never taken me bra shopping. I'm going to ask her about that tomorrow."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "aljishi-fathi",
        "review_rating": "1",
        "review_title": "Movie is good",
        "review_detailed_main": "I give it 1 star because of bad sound and bad music. The music is not for this movie. I view without sound many times through the movie. May be because of what happened since 2020 pandemic they didn't find a good music. I see in netflix in march 2021"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "mickclarke48",
        "review_rating": "1",
        "review_title": "Dire Dire Dire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "cholding-45077",
        "review_rating": "1",
        "review_title": "Terrible!!!!!!!!!",
        "review_detailed_main": "What a bloody waste of time this was with an anticlimactic ending. It was so boring that me and my wife ended up fingering instead , batter than the brown lady got in the film in that bath with the milk. An incandescent light bulb, incandescent lamp or incandescent light globe is an electric light with a filament that is heated until it glows. The filament is enclosed in a glass bulb that is either evacuated or filled with inert gas to protect the filament from oxidation. Current is supplied to the filament by terminals or wires embedded in the glass. A bulb socket provides mechanical support and electrical connections."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "argylx",
        "review_rating": "3",
        "review_title": "Good movie, until they throw it all away",
        "review_detailed_main": "Creepy, suspenseful, entertaining and keeps you on your toes. Everything you'd want in a bog-standard, decently watchable psychological thriller - until the last 15 minutes when they gratuitously throw it all out the window in something like a bad parody of the worst M Night Shyamalan movie.\n\nI have never seen a movie go so downhill so quickly in such a poor attempt to deliver a twist ending. What's utterly ridiculous is that up until this point, it does a really good job of hinting at a plot resolution and ending which would have been much, much better.\n\nIt's like they switched writers for the last 10 pages of script."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "kwenchow",
        "review_rating": "1",
        "review_title": "A bit mystery, but overall full of boring conversation, and annoying overuse scene! Not recommended!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "sydbernard",
        "review_rating": "5",
        "review_title": "IT'S A MOVIE FOR PEOPLE WHO HAVE MOMMY ISSUES !!!!!!",
        "review_detailed_main": "All i can simply say is who ever wrote this movie just had major mommy issues!!!! Half the time the audio would get cut off. The writers really didn't know what to say the other half of the time and the background music AWFUL."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "HairDude",
        "review_rating": "1",
        "review_title": "Sucked so bad!",
        "review_detailed_main": "Lamest movie I've seen in a long time!\n\nReally nothing creative to see here at all... Avoid!"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jim-possible",
        "review_rating": "1",
        "review_title": "Wow....",
        "review_detailed_main": "Who in their right mind okayed this movie? Absolutely horrible."
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "clementi28",
        "review_rating": "2",
        "review_title": "Predictable and booring",
        "review_detailed_main": "Senseless movie... voices in the head...is this a 2021 movie??\n\nPlease don't waste your time to watch unless u have plenty of time......"
    },
    {
        "movie_id": "tt7897330",
        "movie_name": "Deadly Illusions",
        "movie_rating": "3.8",
        "review_username": "jj-bezant",
        "review_rating": "2",
        "review_title": "So bad it made me write my first review",
        "review_detailed_main": ""
    }
]