[
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "dineshprakash",
        "review_rating": "5",
        "review_title": "Breathtaking visuals but abrupt emotions with unnecessary violence",
        "review_detailed_main": "Director Mr. Sanjay Leela Bhansali ,is known for taking the scenes far more ahead from screenplay by adding visual magic and he succeeds to create the magic again. He is also master of portraying emotions but this movie lacks his masterstroke. Story is simple, screenplay is OK but dialogues by Siddharth-Garima , are very good mostly. Movie is slow at places even belonging to the action drama romantic genre. Climax is forced because of adaptation. Love scenes are best as usual. Director has given his 200% to conceiving the visuals that he couldn't give his 100% to the emotions. Characters are not well established. A women, who is able to remove bullet from her most loved one person's dead body, possess soft heart!! How!? A person goes to the deadly enemy's house without proper disguise or any other precautions. Even , he can intrude with the help of a tree trunk.Guns are the most common things between them but in pre climax they fight with swords! Main male lead body is deliberately over exposed, which doesn't go well with the premise of the movie, where rest of the person prefers to cover themselves. Performance wise Ranveer Singh is OK but lacks in most of the emotional scenes. Deepika Padukone is adorable. He slaves you to look at herself in every frame. Ratna Pathak is impressive. Richa Chaddha is fine. Music by director himself is OK but lyrics by Siddharth-Garima is very good."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ibbbisheikh",
        "review_rating": "7",
        "review_title": "an amazing performance by ranveer singh and deepika padukone",
        "review_detailed_main": "i don't get it why people are criticizing so much about this movie.... okay if its about the sultry dialogues i agree they were somewhat vulgar. but to be honest the movie had the elements of romance, chemistry and emotions. the cinematography was great and i loved the colors in the movie.... deepika padukone has become a fine actress and every film of hers depict her smooth acting abilities. ranveer singh is the coolest actor I've ever seen on the screen. the songs are nice and the choreography is outstanding. i couldn't take my eyes off deepika during the song \"nagada sang dhol\". it's a good movie to watch but surely is not a family movie."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rajat_srvstv",
        "review_rating": "6",
        "review_title": "This RamLeela has nothing new to offer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "bobbysing",
        "review_rating": "",
        "review_title": "Bhansali's another self-obsessed film, which is visually stunning with few notable performances but how many times I am supposed to watch the same story again & again.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "critiquerimdb",
        "review_rating": "7",
        "review_title": "Fierce, Effective, Tapping yet Erratic is what Ram Leela is all about.",
        "review_detailed_main": "Goliyon Ki Raasleela Ram-Leela, one of the most anticipated movies of the year releases with all its bang and reveals itself as least related to stuff for which it had been declared controversial.\n\nSanjay Leela Bhansali's take on Romeo-Juliet, despite a known script, seems quite refreshing. The visuals, nobody questions, is by far Bhansali's best. Utterly flawless. You might want to compare the flawed VFX effects of movies like Krrish 3 and Ra. One and find Ram-Leela's visuals standing far ahead of them. The symmetry he puts in, the pattern he develops in every visual is like the best artist would.\n\nSLB's poetry, dialogs and expression are so well that you might want other directors to get training from him. The professionalism is of Hollywood standard.\n\nThe songs are already chart-topping (Nagade Sang Dhol was No.1 on i Tunes for 7 consequent weeks), and when you watch them in the movie you feel mesmerized. So well choreographed are these dances that you couldn't stop yourself from thinking of performing them on some occasion. Though a bit raunchy, Ishkiyaon Dhishkyon seems more funny than vulgar. Priyanka's item number gives mph effect.\n\nThe strongest part of Goliyon Ki Raasleela Ram-Leela is the star performances. We do not doubt that Deepika Padukone, who has established herself as an equal of the Vidya Balan and Shaban Azmi only betters herself with this movie, giving her critics a yet bigger challenge. She, as Leela, is flawless. You wouldn't be watching Deepika Padukone, but Leela in the movie. Though in Cocktail, Ye Jawaani ha Deewani and Chennai Express, Deepika was the soul of the movie, here she has to share it with Ranveer Singh who acts equally well. This is his best performance so far. In fact, this is the best performance of the year by a male actor. Richa Chada is shockingly real as Leela's sister-in-law and Supriya Pathak, though sounds a bit like Hansa, is exhilarating and fear-inducing. Every dialog she delivers is pitch perfect.\n\nThe perfection that Bhansali has expressed in all the aforementioned topics gets polluted by the flawed script. Though in the first half you do not notice how time passes with the songs, acting and the chemistry setting fire to the screen, the second half takes a U-turn. The second half begins with impracticality, which moves on to deal with various serious topics, which is exceptional to a love story. What becomes a problem here is the absence of effective execution of these scenes. The sub-plots are in abundance but all last for so less time that the tears of Leela and Ram do not reflect on the audience's eyes. Before the audience could feel the pain, the scene changes. The ending becomes more like a fairy tale which ruins all the realistic happenings of the movie.\n\nDespite its flaw, Goliyon Ki Raasleela Ram-Leela stands as WORTH WATCHING. One must definitely watch this class-and-mass movie for entertainment, visuals, star performances, songs, and by far the best adaptation of Romeo and Juliet by Bollywood. Go fall in love with Ram-Leela!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "a-claudia-iordachescu",
        "review_rating": "8",
        "review_title": "Mesmerising cinematography and good acting",
        "review_detailed_main": "I watched this film with mixed expectations. On one hand, I had seen the Nagada Sang Dhol and Lahu Muhn Lag Gaya clips on you-tube - exactly what caught my eye and made me want to watch it. On the other hand, a- not-so-good rating and most reviewers claiming it was very bad were lowering my expectations. I did, however, watch it, and I loved it.\n\nThe film is intense, wonderfully directed and benefits from great acting. I am not familiar with any of the actors; nor with Bollywood films in general, which I do not find appealing because of their over- dramatisation of... pretty much everything. And mostly, poor acting. This is where Ram-Leela stands out. Apart for a few scenes, the director made use of the actor's skills, and pushed them to the point they save the sometimes-poor script. There's great chemistry in there, as well as some more than convincing acting, all in wonderful colours and costumes.\n\nI had a hard time understanding why it's got such harsh reviews, given how good it is, but reading them I realized what the problem is (and probably why I liked it): Ram-Leela is not a film for puritans. While it seemed quite tame to me, certain watchers found it \"vulgar\", or too sexual. From my point of view, it's aligned with European films. What it lacks in plot-line (although decent), makes up with daring performances and honest acting. As for those claiming it's not a love story, I agree: it's a battle of egos, and most important, a battle with the self for each of the characters. This could have been emphasized more, but you can't have everything."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rahulturbo",
        "review_rating": "7",
        "review_title": "There is a difference between theater and movie package",
        "review_detailed_main": "Ram Leela: Film opens up with colors, guns and a mahool was tried to be created but it was simply studio environ and thus provided a fake feeling. But Bhansali has also shown tremendous potential as a director when you consider certain aspects. Credit to him to get out some exceptional performances from his cast, Deepika is definitely improving with every outing but he deserves applaud to get some real stuff out of Ranveer Singh. That's where Motwani was found wanting in Lootera. Ranveer's hot bod is flaunted with precision and no one will complain about it. Supriya Pathak as Deepika's mother deserves special mention here for her performance. Priyanka was simply mind blowing in her class title track, as well as Deepika in her red ghagra 'Dhol' song....both of them have some exceptional choreography with equally fantastic dance. Deepika also looked like a queen seductress in her act on bed while 'Ang laga De' was playing, in fact she played that role uninhibitedly in whole movie. Songs are pretty good except 'Ishqyaun' that reminds you of Govinda-Raveena of 90s, simply bogus. Chemistry is intense between the lead pair, it becomes hard to take your attention off.....you tend to drown in their acts, where their electric smooches are icing on the cake. Only worry is that it started too spontaneously. Cinematography is great, but there are places where you feel this should have been real instead of studio and animation. Bhansali saab please understand movie is supposed to be real and theater is drama unless you don't want it to be otherwise. Editing is done beautifully, you hardly get to cry about length or unwanted stuff. Screenplay is the weakest link of the movie, transition of Ranveer from lover to don and an unconvincing end without much weight will leave you dissatisfied. If you want to watch a fitting end, go for Romeo + Juliet starring Leonardo and Claire Danes (1996). All in all film has Bhansali's stamp-theatrical, lots of perfect scenes and moments.....but it fails when you talk of the whole package. Definitely a watch, but don't expect it to deliver as a movie. This is a classical example of how you can fail to deliver even when you succeed- 3.3/5"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "diksha2805",
        "review_rating": "3",
        "review_title": "Goliyo Ki rasleela... Ramleela- It's all body no soul",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "Absolutely spellbinding and a beautiful film from Sanjay Leela Bhansali!!!",
        "review_detailed_main": "RAM-LEELA not only has a spellbinding effect, but it ships you to an unfamiliar world absolutely. You may have an inkling of the plot, but you definitely don't know how SLB will give an altogether innovative twirl to the premise. On the whole, GOLIYON KI RAASLEELA RAM-LEELA ought to be watched for multiple reasons: the electrifying chemistry between its lead actors, the strong dramatic content, the scintillating musical score, the violent streak in the narrative and of course, Sanjay Leela Bhansali's execution of the material. This is Sanjay Leela Bhansali's most accomplished work to date. It's a work of outstanding artistry. No two opinions about it. A masterpiece by the master craftsman Sanjay Leela Bhansali!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "yashmishra91",
        "review_rating": "7",
        "review_title": "Not Bad!",
        "review_detailed_main": "Director Sanjay Leela Bhansali returns with a bang with this highly commercial venture based adaptation of William Shakespeare's romantic classic \"Romeo and Juliet\", showcasing excellence with great technical and lead work. The director brings the Desi adaptation on screen with high gloss and great moments 25 years after what the 1988 Hindi classic \"Qayamat Se Qayamat Tak\" (Dir: Mansoor Khan) had brought. This film lies among his best works \"Khamoshi\" (1996), \"Black\" (2005) and \"Guzaarish\" (2010) with some nice twists and moments. The flaws in the film lies with the over melodrama and even over romantic factor in the film as well as its length which could have been cut down by editor Rajesh Pandey who also succeeds in bringing some great moments in a slick yet stronger form. The film's cinematography by Ravi Varman is excellent where every frame is painted well with sheer excellence and the execution of the shots by Ken Metzker in his DI work has been put up well. Production Design by Wasiq Khan, reminds of the brilliance of Bhansali's previous genius Nitin Desai in the director's previous works. The choreography is brilliant too and the music score by Bhansali and Monty Sharma is colourful, foot tapping and beautiful. The dialogues (Siddharth and Garima) are good and are also loaded with some nice punchlines worth of Taalis and Seetis. The screenplay by Bhansali and his team is good with its nice structure. In performances, Shruti Mahajan: Take A Bow for her selecting a brilliant supporting cast with Sharad Kelkar, Richa Chaddha, Abhimanyu Singh, Jameel Khan and Barkha Bisht who fit well in their respective roles. Supriya Pathak Kapur is excellent and is worth to look out for. In the lead, Ranveer Singh and Deepika Padukone come up with a sizzling chemistry as well as great performances, with the latter showcasing more excellence. Overall, this film is worth your ticket. Just sit back and enjoy the celluloid based vibrant splendor."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "abbasalib8",
        "review_rating": "1",
        "review_title": "Thoroughly disappointed to say the least.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "maria-pervez11",
        "review_rating": "10",
        "review_title": "An Exceptional Piece of Art",
        "review_detailed_main": "Im very disappointed by the audience for their taste is getting worse each day. I wonder what different they want. What was new in Ye Jawani Hai Deewani? What was new in Krish 3 and whats going to be new in Dhoom 3? The only difference is that Ram Leela is made from the colors of imagination and fantasy and not just that the fantasy is painted as it is on the canvas of a film. All other movies are just the copy of Hollywood worst movies in a worst manner. There are three things that make Ram Leela and exceptional one. First the music. Sir Sanjey hats off to you for not only a superb director but a wonderful music maker. Though I'm a Pakistani but i really appreciate the fact that this movie has utilized the real Indian instruments with songs which sings the soul of India. Second the sets. No movie in Hollywood or Bollywood could make such beautiful dreamy sets just so beautiful. Third the acting of Ranveer and Depika. The way Depika showed emotions in Rang Laga De were just too beautiful and emotional. The music and acting made it the most beautiful song ever. Similarily Ranveer showed so many mixed emotions beautifully. Well i will say our audience are losing their taste. They are not into the classic movies like Ram Leela, Lootera or Sanwariya. They deserve Krish 3 and Rowdy Rathore. Keep it up SLB. Every movie of yours is Superb."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "anupapu8",
        "review_rating": "6",
        "review_title": "Nice But Not Worth a Watch In Big Screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "feverbaba123",
        "review_rating": "1",
        "review_title": "Trigger Dabane Ki Baat Mar Kar, Trigger Daba Daal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "kescool",
        "review_rating": "",
        "review_title": "Ram-Leela - An entertaining Drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "bobishmp-843-317319",
        "review_rating": "7",
        "review_title": "Beautiful ROMEO - JULIET Saga..!",
        "review_detailed_main": "SANJAY LEELA BANSALI once again comes with Beautiful Love Story - Which will make you entertain throughout the movie.\n\nTheme: RAM-LEELA is Story of RAM who belong to RAJWADIS & LEELA who belong to BAWAALS . Basically there's a Big conflict between the two Villages & the Love Birds comes across when RAM goes to his RIVALARY Village for playing HOLI.\n\nThe movie comes with Eye catching visuals and framed beautifully.Songs are beautifully and suited well for the them.\n\nActing:Good chemistry between lead couples.\n\nNote:An excellent love story just like a beautiful poem\n\nCan i watch with family:Yes but some mild love making scene"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "mitalmistry",
        "review_rating": "10",
        "review_title": "Excellent adaptation of the classic Romeo and Juliet Story!",
        "review_detailed_main": "I adamantly disagree with the other reviews on this site, this movie isn't like other Bollywood movies, just like the Baz Luhrmann version of Romeo and Juliet strayed from the norm of Hollywood movies. It pushes the boundaries of story telling and what can be shown on Indian movie screens, and the methods with which you can show fierce hatred between two families and love that can bloom even with huge conflicts surrounding it.\n\nThis leads me onto where Sanjay Leela Bhansali got some of his inspiration from and in my opinion he has intertwined a very religious time of the year in Indian culture excellently with the intricate and fierce story of Romeo and Juliet. He has also still managed to maintain a modern twist whilst still retaining the religious and cultural past times of India.\n\nI feel that the majority of reviews are from people who don't appreciate the story of Romeo and Juliet and the different adaptations in the past that have lead to what will now be referred to as the Indian version of said classic story. Please take some time and watch the original Shakespeare version and the Baz Luhrmann version as these will give you a good representation of an excellent story and telling the story in a different and unusual way.\n\nI loved the chemistry between Deepika and Ranvir and they're now one of my favourite on screen couples, that said the majority of the acting in this movie was very convincing with the mother of Leela being a particularly fearsome character.\n\nAll in all, don't try and compare this to other Bollywood movies, it's most definitely in a different league. It mixes playful flirting, fierce love, hatred, revenge, bitterness, contempt and finally sorrow and remorse into a moving screenplay that truly had me begging for the film to not finish as the classic story of Romeo and Juliet does."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "arupghose",
        "review_rating": "6",
        "review_title": "Typically over the top Bhansali...but fantastic chemistry",
        "review_detailed_main": "Ram Leela - an Indian take on the classic Romeo and Juliet, but I wouldn't even consider this an Indian take, but a full on Gujarati take!\n\nBhansali has a habit of making a film look over the top - Devdas and Saawariya are both good examples, but now you can add Ram Leela to the list. The film is good, but yet it some scenes really do confuse you and if you lose concentration at any point of the film, you get lost. You feel like there's way too many characters but then again, the story required it. Everything is just way too glamorous, when it's obvious that there's no requirement for. As I said - a typical over the top Bhansali film.\n\nThe major plus point of the film is the chemistry between Deepika Padukone and Ranveer Singh. Deepika is electric and you can't imagine anyone else in this role after seeing her. Ranveer is magnificent and is certainly an actor that is here to stay. He looks very much the part, and his on screen presence is fantastic. Whether or not they both have real life chemistry (it's likely they do), their on screen chemistry was perfect.\n\nSurpiya Pathak Kapur is a revelation and will surely be snapped up in more films in the future. Richa Chadda is excellent. She catches your eye in every scene she's in and will certainly leave you wanting more.\n\nThe songs are very good, with my favorites being Lal Ishq and Lahu Mau Lag.\n\nIn summary, Ram Leela is good, but not spectacular. Watch it for the Deepika-Ranveer pairing. Nothing else."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "shiviii148",
        "review_rating": "1",
        "review_title": "Over the top movie making at its best. SLB disappoints.",
        "review_detailed_main": "In spite of the not-so-appealing formula music and over the top cinematography, the controversy clad 'Goliyon Ki Rasleela Ramleela' was one of the most anticipated movies this year, courtesy SLB. The opening scene has multiple common men shooting bullets and throwing glass bottles with close precision and accuracy. The grand entry of the hero himself, taking a selfie on a motor bike would have been mesmerizing had it been the 1980s. The overly tanned and oiled up body of Mr. Singh and the dhoti tied up as low as humanly possible attracts the attention of very many local women in the movie and a few watching it. Deepika is stunning as Leela, though. But the essence of the subtle yet intense romance of the great work by Shakespeare is completely lost in this very Indian rendition of the same. Mr Bhansali has reduced it to what we as an audience want, colourful dance numbers, extreme drama and a sexual reference in every other scene. Music is no charm either. With irrelevant songs at irrelevant junctions in the film, the audience is bound to get restless. There was a point in the first half when we became desperate for the intermission, it came some 20 minutes later. The second half is no better. With stretchy sequences, pure masala bollywood dialogues, more useless songs, pointless silhouettes and closeups and typical SLB elements at every step, the movie comes to a close. Supriya Pathak's, Richa Chadda's, and Barkha Bisht's performances are the only high for the movie. All in all the movie makes us feel used and violated. The makers of the film try to cash in on their name, legacy and the Indian viewers' mentality and give us a piece of cinema decorated with warm colours and excessive drama. The sad part is they will succeed in their propaganda with critics like Taran Adarsh and Mina Iyer eulogizing every frame. Sad."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "tomsane-535-634571",
        "review_rating": "10",
        "review_title": "Pure brilliance from Bhansali.. go and watch it now",
        "review_detailed_main": "One of the finest movies to come from Indian cinema this year... Sanjay leela bhansali hits all the right notes again after hum dil de chuke sanam, black and devdas. Strong performances, perfect direction n a beautiful world created by bhansali. In short, a mesmerizing experience. Ramleela is one of the most magical love stories i have seen in years... i found ramleela an extremely well portrayed love story and massively entertaining. Its a visual magic and truly spectacular. Picture perfect frames, huge colourful sets, beautiful heavy costumes, emotions, poetic lines and melodrama. Deepika and Ranvir set fire to the screen together and as individuals. Do not be surprised if deepika bags in all best actress rewards this year and Ranvir emerges as a huge star in Bollywood."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sh-77818",
        "review_rating": "7",
        "review_title": "ram-leela: love and war",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "deepakjj",
        "review_rating": "2",
        "review_title": "Do not waste your time ... unless you watch it just for the sets, not story",
        "review_detailed_main": "Do not waste your time\n\n... unless you watch it just for the sets, not story.\n\nThe only reason to watch this movie would be for the sets and cinematography - Sanja Leela Bhansali is known for this.\n\nStory is horrible and it appears different parts of the story were written by different people.\n\nStory is an insult to one's intelligence.\n\nThey have tried to cast the story as modern day Romeo and Juliet, but no way can that comparison hold. Romeo and Juliet was a class apart.\n\nI wish I had seen Captain Philips instead."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "amitinfo26",
        "review_rating": "10",
        "review_title": "Great entertainment with great art,music,acting,direction....",
        "review_detailed_main": "Great movie with great adoption of Romeo-Juliet .. Some people are saying it's boring I don't know but it's totally entertainment and no scene useless or boring... Each set are very well made and songs are beautiful along with dance steps.... Direction is too good the way bhansali depicted culture of Gujarat's community is beyond imagination.. Being Gujarati I know this culture so hats off, chemistry between Dipika and ranveer it's amazing ..acting is too good. Only thing is language is pretty harsh but that to require for script like this so I am pleased bhansali use right one liners and it's way less vulgar(not even single scene I found uncomfortable) murder,jism2 etc,,, if people in India make chennai express,krish 3 and dubang ( don't want to put znmd,yjhd and 3 idiots),a super hit than why this kind of movie who depict true culture are not making money because all people need is b**lshit crap movie they don't respect art... And that's why we are not getting Oscar or any critique award... Because there is no money involve in making this kind of movie... If people don't make this movie 20 million rs grossing film than no offense but people in India don't have test of art....\n\nIn sort must watch movie with some uncomfortable language( not to watch with family).. All I can say is bhai bhai.."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sudhirkumarpal8",
        "review_rating": "7",
        "review_title": "One of the most colourful movie ever made.",
        "review_detailed_main": "Amazing visuals. Sets as par to even the Hollywood directors'. Storyline was a bit off the mark, so was the Acting. Deepika and Ranbir both were in thier typical best. Gosh! I wish for that home of Deepika. Decided to watch it on a big high definition screen. No doubt the effort was aptly rewarded."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "lamemoviesguy",
        "review_rating": "2",
        "review_title": "Ram! Ram! save me",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vijayant_venky",
        "review_rating": "",
        "review_title": "An amazing package Wasted!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "saytosandeep",
        "review_rating": "6",
        "review_title": "MY REVIEW: Bhansali's Cocktail of Guns and Love is Overdone!!",
        "review_detailed_main": "There are two kind of directors in one Sanjay Leela Bhansali. First makes silent noise in Khamoshi, Black and Guzaarish. Second one overindulges in Devdas, Saawariya and latest Ram-Leela. It was only Hum Dil De Chuke Sanam where he mixed lavishness with subtle emotions beautifully. Ram-Leela comes after he failed to impress us with Saawariya and Guzaarish. So he went back to Devdas style and gave his own interpretation of Romoeo-Juliet love and fights. He does four things right with six things wrong leaving you dissatisfied at the end. There are colorful sets, excellent choreography, tight direction and supreme performances by confident Ranveer Singh, gorgeous Deepika Padukone and my favorite extraordinary Supriya Pathak. At the same time, there are few extra songs, too many twists in second half, few plot holes, too much of gun sound, movie being at least twenty minutes extra long and overdoing many scenes in order to make an impression of epic proportions. No doubt Sanjay understands cinematic art to the core but he tries to impress too hard. You are left amazed by his work in some scenes but then you are completely baffled in few scenes. At the end, you are drained out so much that you don't feel like appreciating even the good parts."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "pihuvershwal-90090",
        "review_rating": "8",
        "review_title": "Iconic!!",
        "review_detailed_main": "I think the movie is impactful,many of the iconic scenes got struck in my head for days.It manages to radiate a vibrant,colorful vibe and still be violent and sorrowful. The movie was able to convey the emotions but the scene would change just when it would be highly impactful and was about to make the audience cry. Its a highly recomended movie. The script might go weak in some parts but the brilliant acting covered it all. The screenplay,songs and acting sure makes it a masterpeice. I loved it."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "SivakumarBalachandran",
        "review_rating": "7",
        "review_title": "Romeo and Juliet - with some brilliant performances and visuals but not a logical story line",
        "review_detailed_main": "RamLeela absolutely falls to the genre of Romantic drama and adapted screenplay since it has done justice to both the genre. This film from the house of Bhansali comes as a sound and massive production of the desi version of Romeo and Juliet.So this about the forbidden love and its tragic effects.\n\nThe film delivers what expected from it absolutely no doubt in that. But yet there are some minor loop holes here and there but doesn't stop me saying this is a brilliant portrayal of the most wanted romantic tale of the world. As we can predict things easily from the trailer that it is a love story winded between Ram and Leela in a violent environment. We can see a forbidden love which is built on pain, violence, guns and roses. So the ultimate climax will lead us to whether this love succeeds or not?\n\nDirection and Music by SLB was brilliant no doubt in that. The songs were frequent on the first half and less on the second half. All songs are perfectly placed and well composed. Thanks SLB for giving such good romantic numbers like Ang Laga De and at the same time some good item number like Ram chahe Leela. Direction was so good such a way where the characters in the movie were so well designed and all the actors did their best to live up to them. Cinematography of Ravi varman was visually enchanting that I have to say to see on screen it was like a beautiful painting. Editing department should have worked little better on the second half length of the movie.\n\nArt direction and costumes designing needs to be really addressed because both were ultimately supportive to the story line and obliviously enhanced the visuals that you will be able to cherish it and enjoy it. Particularly the icon piece of classic tale was the balcony was very well done though it was looking artificial but doesn't show up in the flow of the story.\n\nCasting: The show stealer was definitely Ms.Deepika Padukone portraying the bold and beautiful Leela. She was picture perfect to the role and just lived the character she was so bold in the romantic scenes with her mesmerising looks and steamy lip-locks. She built up a good chemistry with her co star Ranveer and sometimes over shaded him with her acting skills. Definitely she is the Juliet of bollywood with her continuous success. Then we should say the lady don Supriya as Baa and Richa as Raslila both were good in their roles. Ranveer delivered a descent performance but definitely could have done better for this bold Ram role more than his plastic over worked body looks like his voice dynamics was not so matching at times.\n\nSpecial appearance by P.C was absolutely a visual treat for her fans. She is definitely the Diva. Her song was Paisa vasool item song of this year. She has given what has to be done for an item song with hundred percent dedication and perfection. Deepika has worked hard in the entire movie to steal you but P.C comes for an item number and steals the entire show.\n\nNow to mention a few negatives we see the love of Ram Leela as a depth and passionate love but the initial love at first sight was not built up so strong where we see them in a crowded playful situation and just falling for each other to an extent of physical lip lock on the first meet without knowing each other on what grounds? Then it is the period on which the story happens is not clear because we see cell phones one side and old vintage cars on the other side. Second half seems to be dragging sometimes. But these reasons will be definitely overlooked by the overall presentation of the movie.\n\nVerdict:Finally get in for a pure cinema on romance on guns and kisses and find the answer whether all is fair in love and war for this love which is made on war!!! Strictly for Bhansali and romantic story movie lovers. Entertainment lovers stay away!!!\n\n-Reviewed by Sivakumar Balachandran (bsiva84@gmail.com)"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "angel-leo30",
        "review_rating": "2",
        "review_title": "OK Mr. Bhansali, this one is just sad..",
        "review_detailed_main": "I had the not so good fortune of watching Ramleela yesterday. Mr. Bhansali hasn't evolved and this looks like is his desperate attempt to recreate what has worked in the past. The sets look similar to Devdas and Hum Dil De Chuke Sanam (HDDCS), the music is grand and the background is colorful. The story takes you from not so innocent villagers to a Punjabi styled dance to misplaced Priyanka Chopra song and back to riot torn village. The integral elements of the movie - dialogues, screenplay, and performances have been poorly executed. Deepika looks gorgeous and Ranveer extremely well toned. If they had only stick to looking good... Both the actors deliver over the top performances that are devoid of the energy, excitement, innocence, and passion associated with young love. Each one of their scenes looks like a 'rush' to reach the end. Supporting cast brings some hope to the movie but is not sufficient to save the day. The movie is focused on enforcing 'a formula' without the Bhansali vision and thought we became accustomed to after HDDCS and Devdas.\n\nP.S. I will take Aishwarya Rai and Salman Khan over this any day.."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vikrantgangele-851-33674",
        "review_rating": "8",
        "review_title": "Tarantino meets Bhansali meets Shakespere",
        "review_detailed_main": "I was tentative to watch this movie, because I do not like Bhansali after Saanwaria and Guzaarish, but when I spent 156 minutes I was mesmerized by splash of colors. You can see the effort of director to convey the feelings in every frame, every camera angle, every dance step. There is inherent style in every bit and piece of this Movie. Deepika Padukone is stunning in every scene, one cannot take eyes off her. Supriya Pathak has done full justice to the role of an \"Ogre\". The vibrant colours of Gujrat, the local folk dances are very well embedded in the dance and song sequences. \"Morbani Thangat Kare\" soothes your senses despite the fact you do not understand a single word of it, if you are not a Gujrati. Yes, It feels like the music is derived from \"Hum Dil De Chuke Sanam\" but it is good, although Bhansali should refrain from writing the lyrics. Kudos to you Mr. \"Sanjay Leela Bhansali\" , you have given me a movie which I already watched two times and will continue watching more."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "jmoneyjohal",
        "review_rating": "7",
        "review_title": "Badla,Pyar,Aur Bahut Saura Rang",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "srivatsa_ree",
        "review_rating": "3",
        "review_title": "Mindless, colorful movie without a strong storyline",
        "review_detailed_main": "When a new movie releases we often look at the rating provided by other reviewers and decide on watching the same. But sadly the 5 star or 7.2 star rating provided to this movie may be based on the directors previous works and not the current one! Ram Leela is a good misdirection done by Mr. Sanjay Leela Bansali. Even Houdini would have to bow to him if this movie turns out to be a hit. Having watched many variations of the classic Romeo and Juliet, the last being one with Leonardo Di Caprio and Claire Danes, I can very well say that Ram Leela is clearly not a variant of this. Most likely the reviewer has been primed to think so. With an absolutely no story line, the movie relies on raunchy scenes between Deepika and Ranvir to carry the show. There's mindless violence, ridiculous camera work used for portraying mayhem against women, cheap dialogue's to show coolness. To take your attention off the plot, Mr. Bansali uses these misdirections very well. The eyes see colorful Gujarati Garbha dances, a clear desert, some good architecture around Gujarat, and the mind forgets that the movie has a story to tell! An item song by Priyanka Chopra is also thrown in to save the day. The rating 3 of watchable is mainly to see our Hansaben, Supriya Pathak. Her portrayal of Baa is mind blowing and dialogue delivery is great. Those used to seeing regular Baa's in our TV serials, now get to see a different Baa! Deepika had made a good choice with Chennai Express, where her acting skills were utilized. In Ram Leela she's there to dance and whine! One does not see the boldness Aish portrayed in HDDCS or the damsel deeply in love Aish portrayed in Devdas. I guess Mr Bansali wanted to see a mixture of both in Deepika. But sadly the story line does not call for it! Ranvir still has remnant parts of Band Baaja Baraat and Ladies Vs. Ricky Behl. In most of the scenes either he is full carefree or full sentimental (literally crying). A talent like Richa Chadda is wasted. To conclude, its sad to see Mr Bansali following Ram Gopal Verma's footsteps wherein camera work and raunchy scenes are used as misdirection for a bad storyline"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "glittertherose",
        "review_rating": "9",
        "review_title": "You will love it if you don't take it too seriously or a literal version of R&J",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "kumar-u-naresh",
        "review_rating": "6",
        "review_title": "Blink and miss this...or do you?",
        "review_detailed_main": "Ram Leela: This is one movie that I was looking forward to. And why not. It's a Sanjay Leela Bhansali film. The man has created a brand for himself over many years by delivering classics like 'Khamoshi' and 'Black' in the past. Agreed that his last two ventures in the past were box office disasters (anyone remember the much hyped 'Saawariya' and the forgettable 'Guzaarish'?) and probably dire straits led him to produce the modern age potboiler 'Rowdy Rathore'. But lets face it, the man is immensely talented. And that appears in a large part of this film. Ram Leela is his take on the Shakespeare classic 'Romeo and Juliet'. The story takes place it in two trigger happy rival towns in Gujrat who are looking out for reasons to have a go at each other. And as obvious and clichéd it sounds, Ram and Leela are from enemy families. There have been many adaptations of this line of thought. Some known examples are 'Qayamat se Qayamat tak' and 'Hulchul'. The story revolves around how a peace loving Ram falls hopelessly in love with an equally energetic Leela and against all odds are able to sustain their love for each other. Then as it would be, situations turn around and they find themselves standing face to face. As a welcome change, SLB does what he has done well in the past: Make the story grand. It is thankfully not a morbid looking film which runs of shades of black. He revives his Devdas and Hum Dil De Chuke Sanam colours and manages to liven up the film for a large part. The dialogues are also quite humorous and well written albeit slightly vulgar. The songs were brilliant both musically and visually. However, the biggest let down, if not a huge one, was the storyline and the screenplay. I could not understand the reason for the two protagonists to fall in love with each other. It was probably rushed otherwise the already long film would have become even longer. In totality, the movie does not leave a huge mark because of the poorly drafted scenes on many occasions.\n\nDirection: SLB returns after a long time and delivers his best. Having managed so many roles during the making, be it the producer or the writer or the music director, he still manages to ensure that his directorial vision is intact and be it the set designing or the art, he ensures excellence. It's a treat to watch his films if its only for the brilliant visuals.\n\nPerformances: Ranveer Singh was apt for the role of Ram and though I am not a fan of Deepika Padukone, I felt that she did deliver a good performance. Both of them translated the raw rustic nature quite well. The supporting case was great. Be it the veteran Supriya Pathak or the newbie Richa Chadha. They are a delight to watch. Others chipped in and did a good job.\n\nOverall: What the movie lacks in story it tries to make up in the other departments. Watch it if visuals is what you wish to see."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "yashasvityagi",
        "review_rating": "1",
        "review_title": "Its all colour with a wandering plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vihardesai41",
        "review_rating": "",
        "review_title": "Ramleela",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "Sherazade",
        "review_rating": "6",
        "review_title": "Hyper-Sexual Romeo and Juliet on Steroids & Viagra for sure",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "prithvipopat",
        "review_rating": "9",
        "review_title": "worth watching movie...!",
        "review_detailed_main": "Sanjay Leela Bhansali turns 'Ram-Leela' into such an ardent celebration of love, that it will have a spellbinding effect on its viewers. In the end it is Bhansali who is credited for screenplay, editing, music, and direction, leaving his stamp all over the film. The electrifying chemistry between its lead actors, the powerful dramatic content, the brilliant musical score, and the vicious streaks of action sequences add an innovative twirl to the premise. However the narrative starts to jiggle just before interval making it an over-plotted, bloody mess by the end of the film. In her last few films, Deepika has stolen the show from her heroes but this one belongs to Ranveer. Still Deepika and Ranveer and their on-screen intoxicating chemistry and brilliant acting make 'Goliyon Ki Raasleela Ram-Leela' worth watching."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "hrgr0016",
        "review_rating": "7",
        "review_title": "Average story but good acting gets it through",
        "review_detailed_main": "Movie starts out slow but builds up to the climax. Deepika Padukone gave her best acting role in the movie.She carried the film on her shoulders. She did a fabulous job in the movie. Ranbeer Singh also did fairly well. Storyline is based on the theme of Romeo and Juliet. Songs are pretty good .The movie has lots of violence and mature subject matter. Lots of adult themes etc. Good supporting cast. It is probably in the top ten movies of 2013. Certainly not as good as Devdas but Bhansali brought another good drama for you. If you like love stories this is for you\n\nScore 7/10"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ravik-kant",
        "review_rating": "1",
        "review_title": "Shakespeare wouldn't have liked this Ram-Leela - Neither do I",
        "review_detailed_main": "Had Shakespeare been alive to see his masterpiece converted on to screen like Ram-Leela, I am not certain he'd have liked it very much.\n\nIts colorful and visually amazing. It's got many songs, lot of them are forced and unnecessary but some are visually good. Music overall is decent. Baa's character is nicely carried out, so is the character of brothers of both lead stars. Deepika and Ranbir are fine in places, but mostly look out of sync from the characters played in the movie. Deepika did a fine job of playing a South Indian lady in Chennai Express, couldn't do so in this flick which needed Rajasthani character. I am just trying to be honest in this review. However nice I can be, but the fact is that the movie is boring. I had no interest in watching the film after 40-45 mins and after Interval, I just wished I had left. May be I could have saved on parking fee of the mall.\n\nIn short, it is Ishaqzade, with grandness and colors, but incapable acting, poor story building, not established characters and a disappointing director. I am not certain what he wanted out of Ranbir Singh. I just wished that rather than spending 6hrs in gym, had he spent few hours knowing about the character, it'd have helped this movie immensely.\n\nI'd suggest the director take some cue from Imtiaz Ali on how to make an emotional and binding love story. While nice visuals certainly help, they don't always end up making a good movie.\n\nI'd give it a miss any given day and won't keep a DVD even if it comes for free!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "gourav87",
        "review_rating": "9",
        "review_title": "Sanjay Leela Bansali at his best... great work.",
        "review_detailed_main": "Great work of art. Each frame was full of colors. Story was OK, but beautifully represented. Can say Indian version of Romeo and Juliet. Deepika was the best attraction. Her action is fabulous. I loved all the songs. Item song by Priyanka \"Ram Chale Leela\", \"Lahu munh Lag Gaya\" and \"Nagada Sang Dhol\" were the best songs. Music is unforgettable. Each song was placed at right position. First half of the movie was great. In the second half movie becomes a little bit slow. Lots of violence is shown, I assume it was the story requirement.\n\nSanjay was succeeded once again to take the movie to higher levels. In terms of Music 10/10, story 7/10, screenplay 10/10, direction 10/10, acting by Deepika 10/10. Each cast member was chosen very carefully and I think choice was perfect.\n\nI highly recommend to watch this movie who love romantic flicks and are fan of SLB."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "AwaixJvd",
        "review_rating": "7",
        "review_title": "This good movie missed a \"WoW\" factor.",
        "review_detailed_main": "I agree with all of users who watched this film,if you want to see it for sets and cinematography,yes this is indeed a great one but if for story,then i am afraid it is very average.\n\nThis story missed a \"wow\" factor throughout the story.This is something which makes a film great from every aspect.\n\nRanveer is a great actor,i admire his talents but he is a chocolate hero,he was mind blowing in \"Lootera\" and again great in \"Ladies vs Ricky Bhai\" but in this film,he was just average.\n\nSanjay Bansali should have chosen someone else for this role.Let me suggest you,what about: Arjun Rampal or Manoj Wajpai.They would have been great in this role.Deepika was a bit OK for this role but if they had taken some mature looking girl,it would have been better.\n\nSanjay Bansali was indeed great in Saawariya,and his choice of taking Ranbeer was also great.He did justice with the role,but when talking of mixture of Devdas,Saawariya and Eklavya and producing Raam-Leela,this must have been done with a great choice.\n\nThis is just a good eye candy,but still an above average film.My rating is 7/10 but not 8/10."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "snaidu422",
        "review_rating": "1",
        "review_title": "Feast to the eyes-Taxing on the brain",
        "review_detailed_main": "When you venture in to watch a Sanjay Leela Bhansali Movie, you need to be rest assured of one thing-this man knows his sets. You get to see the grandest of sets imaginable, never mind if those kind of houses do not exist any in the real world. But cinema has never claimed to do anything with the real world and expecting a movie to be mirror to the real world would be the heights of innocence (even the so called realistic pictures often rely on cinematic liberty). Okay the sets of the movie are worth the price of the ticket, but cannot say the same for the rest of the movie.\n\nIt is saying that Love can be very painful, well! Ram Leela proves it. The viewing is so painful that you start concentrating on the grand sets.\n\nWhen you are narrating a love story, the most important thing or call it the strength of the movie lies in convincing the audience of the boy meets girl-falls in love thing, Ram leela falls flat here, the development of the love story and the first meeting is so strange, you can almost relate it to those typical pub meetings leading to a one night stand. Love at first sight was not portrayed here, we can in fact call it lust at first sight.\n\nComing to the story, it takes place in a town in which buildings resemble Rajasthan palaces, people dress up in Gujarati style and speak in Gujarati accent and live a Bihari lifestyle. Weapons are sold in open market like vegetables and hawkers publicly hawking them (Al-Qida would be impressed). The town has two warring families and Ram and Leela belong to each of the rival family.Ram owns a porno video store and Leela is getting ready for a quick engagement to a spineless NRI. Ram and Leela meet on a Holi day and before you can say cupid they are in love.\n\nYou know something is real wrong with the movie, when the audience start stretching and yawning in the middle of high voltage emotional scenes and are ready to walk out the moment the exit doors are open without waiting for the end credits.\n\nTalking about the cast, the only saving grace is Supriya Pathak Kapur, she brings a new dimension to the character of Ba, with her chilling portrayal and her performance reaches new heights in the climax involving Ram's nephew. Richa Chaddha has come a long way since her wasseypur days, she plays a widow once again, but this time her role as a loving bhabi and a woman who decides to fight back against certain odds. Between them these two women chew up the scenery.\n\nThe less said about Ranbir and Deepika the better, you can draw the conclusion from the numerous song trailers you were subjected to before the release. They only do that through out the movie.\n\nSanjay Leela Bansali stated in an interview that because the heroine in the movie is named after his mother, he went little easy and little aesthetic in depicting her on screen romance or her general portrayal on screen. If this was the way he portrayed a character with his mother's name one shudders to think how he would have portrayed her if she was not name Leela.\n\nThe movie is not without its good moments, the song picturisations are out of this world. The wide canvas employed really worked wonders, too many things happening on the screen (for the pleasant) and you don't know what to watch and it is a visual feast. Priyanka's item number stands out with foot tapping music and sizzling presence of Ms.Chopra and her hot costume does the trick which the entire movie in itself fails to do.\n\nAll said and done, future generations will feel terrified seeing this one line on the movie posters \"Adapted from William Shakespeare's Romeo & Juliet\""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sdreelin",
        "review_rating": "8",
        "review_title": "A visual and aural feast for the eyes",
        "review_detailed_main": "One of Bansali's best pictures so far. It is loosely based on Romeo and Juliet so you already know the premise of the story here so no surprises really. What makes this different from other Romeo and Juliet based pictures is the visual styles and soundtrack. Bansali uses color in his movies to convey meanings in his films. Blues during sadness, reds during fighting or festivals, greens in neutral scenes and this film contains all those. The sets are elaborate lending even more of a feast for the eyes. There is excellent use of humor and seriousness at the right times. The chemistry between Deepika and Ranveer is spot on. The music and dance scenes are very elaborate and appropriate. Even the item number with Priyanka Chopra added some entertainment value though if left out would not make any difference to the movie. There are a few times where it is hard to keep up with some of the supporting characters. Sometimes you have to look for visual clues to figure out who is who quickly (a tattoo or a Tilak). It's not enough to detract from the movie, but lends a small amount of confusion. Watching it a second time I didn't have this feeling. Even though you know the overall plot, there is enough here to keep you engaged. A small amount of content may not be appropriate for small kids, but is OK the for rest of the family. The only issue I had is the hype leading up to the movie was a bit over the top. I would watch this again and again, but I only give it an 8 on a scale of 10 which is good still. Just not in my top 10. It will be a classic Hindi movie and certainly a must see."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "actperera",
        "review_rating": "6",
        "review_title": "Lack of Chemistry",
        "review_detailed_main": "Yet again I saw a movie of Ranveer Singh who has not shown any character as an actor. I don't know why he's getting so many movies but in all the movies I've seen of him were really dumb acting. but here Both these main characters are culprits. in some scenes they are kissing like stone sculptures. No chemistry between them at all. I was ready to forgive Ranveer because I was never expecting anything special from him but Never seen any emotions from Deepika Padukone as well. That's something new.\n\nMovie- trying so hard to remake something we've seen so many times. But failing there as Sanjay was trying too much and maybe because of that some scenes seems so unreal.\n\nGiving 6 because of the effort and the cinematography."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "mamta302001",
        "review_rating": "1",
        "review_title": "Worst....terrible...",
        "review_detailed_main": "Worst movie i have ever seen. Save your time, money and head. Please stay away from this horrible movie. We walked out after the 1st half itself. The story and the movie make no sense at all. There are way too many songs and the songs aren't good either. And of course the movie is horribly dragging. Please do not take your kids to this movie as it is very violent and has a lot of scenes not suitable for kids. Ranveer and deeps fail to impress and the supporting cast is not good either. I cannot believe this was inspired from romeo and julie. That is such a beautiful and tragic love story. this cannot be compared to that. To sum it up, its a really bad movie and i would suggest everyone to stay away from it."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "drravipatidar",
        "review_rating": "",
        "review_title": "Fun movie but don't make any image after seeing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sa_a",
        "review_rating": "7",
        "review_title": "Beautiful Cinematography",
        "review_detailed_main": "RamLeela- 2013 Director: Sanjay Leela Bhansali\n\nSanjay Leela Bhansali is known for creating the visual magic in the screenplay, his sets and Cinematography. He is the Master of portraying emotions which this movie lacked. There was Less Love and More Lust. Based on Shakespeare's Romeo and Juliet, the true 'Feel' of love was missing.\n\nNo doubt few magical moments do come in at various intervals. Songs were AMAZING. Bhansali's mega hit \"Hum Dil De Chuke Sanam\", \"Devdas\" had powerful impact on viewers. RamLeela- a film for those who like Bhansali or if you are a fan of Deepika or Ranveer."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "suhaspawar007",
        "review_rating": "10",
        "review_title": "4.5/ 5*",
        "review_detailed_main": "4.5*/5* \"Worth watching\", RAM-LEELA not only has a spellbinding effect, but it ships you to an unfamiliar world absolutely. You may have an inkling of the plot, but you definitely don't know how SLB will give an altogether innovative twirl to the premise. On the whole, GOLIYON KI RAASLEELA RAM-LEELA ought to be watched for multiple reasons: the electrifying chemistry between its lead actors, the strong dramatic content, the scintillating musical score, the violent streak in the narrative and of course, Sanjay Leela Bhansali's execution of the material. This is Sanjay Leela Bhansali's most accomplished work to date. It's a work of outstanding artistry. No two opinions about it. A masterpiece by the master craftsman Sanjay Leela Bhansali!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ranveer20132013",
        "review_rating": "7",
        "review_title": "Ram-Leela : A half-baked effort.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "spruthvi35",
        "review_rating": "4",
        "review_title": "Beautiful yet Boring..!",
        "review_detailed_main": "Those who know about 'Sanjay Leela Bhansali' (SLB) and the way he makes his works.. They would surely be knowing how intense the emotions would be.! And Ramleela is no exception from them , but the notable point is SLB has , moved a way behind the 'Too-Much' line as far as the 'Romance' is concerned , which he never ever did it in past. The reason why he surpassed the line , is just to raise the audience for the film , precisely to raise the commercial values of the film.It was inevitable for SLB that he had to make the lead pair get into their love track right from their first meet , highly pointless despite the movie being lengthy enough.! But nevertheless , he did his part well with the Music and Direction. The story highly dominated all the Technical department of the film , except for the Cinematography by 'Ravi Varman' , classic and colourful . The dialogue writers Siddharth-Garima , they should have been in a better place than this , because they have a great potential but this time chose the wrong project. Highly adulterated dialogues. Performances of the lead pair was good , but the fans of 'Deepika Padukone' and 'Ranveer Singh' will really feel annoyed by seeing the characters they played , ridiculous. The well appreciated part is Supriya Pathak's performance , great actress.! Except for Supriya Pathak , there were no other great acting skills in the list. Best moments while watching was only the 'Nagada Song' ,eye feast. Right after the movie's name is projected , they'll show this : 'Inspired from Romeo and Juliet' , but I actually feel that , it would be a disgrace for the great Shakespeare's work. Pacy first half , sloggy second half. And finally to say , this is obviously not a movie which you can see with family , never ever do. And the censor board should have been little sensible , as they give an 'A+' movie a 'U/A' certificate. Crazy..!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sojitradhawal-849-474493",
        "review_rating": "9",
        "review_title": "Movie not to miss.....",
        "review_detailed_main": "Direction: This movie truly shows creativity of \"Sanjay Bhai\". Story had nothing new in it. The twists were bit expected but honorable Sanjay Bhai represented in such a way that you can't get your eyes off the screen.\n\nScreenplay: The story is bit similar to Ishaqzaade but a better representation. It looks like watching a gujarati movie which makes a homely feel.\n\nActing: I hated Ranveer Singh before this movie but I'm his fan now. Deepika is awesome as usual. Ranveer has truly get inside the character. The character can be felt deeply if you are a gujarati.\n\nCostumes: A fresh costume is used by ranveer. Top is traditional gujarati wear and bottom is jeans.\n\nMusic: Background score is awesome. Music in tracks are bit similar to Sanjay's previous movies but the lyrics are awesome. Lal ishq is awesomely sung by the maestro Arijit Singh.\n\nLyrics: Expect the songs \"tatad tatad\" and \"ishquan dhisquan\" are to the point lyrics. You can feel the lyrics while watching the movie. This feeling is lost in today's bollywood movies.\n\nThe movie deserves 8.5 rating but being a Gujarati I have to be selfish for this movie so I would give a 9."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "Rawal_Afzal",
        "review_rating": "7",
        "review_title": "The making of Ranveer Singh!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ds-tejasvi",
        "review_rating": "1",
        "review_title": "Bad movie please avoid the headache",
        "review_detailed_main": "Bad movie - please avoid the headache, I do not understand how such a senior director Sanjay Leela Bansali can make movie with such a POOR script. I really got a head ache. May be any sense less person can like such a movie also. My advise : Bad movie - please avoid the headache, I do not understand how such a senior director Sanjay Leela Bansali can make movie with such a POOR script. I really got a head ache. May be any sense less person can like such a movie also.Bad movie - please avoid the headache, I do not understand how such a senior director Sanjay Leela Bansali can make movie with such a POOR script. I really got a head ache. May be any sense less person can like such a movie also. My advise : Bad movie - please avoid the headache, I do not understand how such a senior director Sanjay Leela Bansali can make movie with such a POOR script. I really got a head ache. May be any sense less person can like such a movie also."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "namashi_1",
        "review_rating": "9",
        "review_title": "A Fantastic Film!",
        "review_detailed_main": "Sanjay Leela Bhansali has made credible films in the past, but 'Goliyon Ki Rasleela Ram-Leela' is his finest to date. A Fantastic Film, that re-tells Shakespeare's epic love story Romeo and Juliet, in a violent & intense setting. A Solid Screenplay, Magical Direction, Impressive Music & Stellar Performances make this biggie unmissable.\n\n'Goliyon Ki Rasleela Ram-Leela' Synopsis: Ram & Leela, hailing from two warring families, fall in love. All hell breaks loose.\n\n'Goliyon Ki Rasleela Ram-Leela' is remarkably engaging & engrossing from start to end. The romance between its sympathetic leads is electric, while the violent & intense backdrop keep you equally arrested. The romance works, The drama works & even the The tragic-end works. Despite a running-time of over a 154-minutes, 'Goliyon Ki Rasleela Ram-Leela' doesn't ever lose pace or momentum.\n\nThe Adapted Screenplay is solid & thoroughly satisfying. The first-hour is fast-paced, while the second-hour, though violent, is equally superior. Bhansali's Direction is magical. The talented storyteller captures each frame so well, he deserves an ovation for his work here. Without doubt, 'Goliyon Ki Rasleela Ram-Leela' is his finest work to date! Music by Bhansali himself, is impressive. Each song is memorable. Cinematography is lavish. Editing is sharp. Art & Costume Design are outstanding.\n\nPerformance-Wise: Ranveer Singh is flawless as Ram. He delivers his finest, most dedicated performance. Deepika Padukone is uninhibited & highly effective. Also, The on-screen chemistry between the two is electric. Supriya Pathak is incredible. Richa Chadda is only getting better & better with each release. Gulshan Devaiah is terrific. He plays the calculative, conniving villain to the fullest. Sharad Kelkar & Abhimanyu Singh are perfect. Barkha Bisht does well. Priyanka Chopra sizzles in an item number.\n\nOn the whole, 'Goliyon Ki Rasleela Ram-Leela' is a winner all the way."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "nairtejas",
        "review_rating": "6",
        "review_title": "(Something) Short Of An Extravaganza. ♦ 64%",
        "review_detailed_main": "And it depends upon the viewer to select, if not one, the various discrepancies in the modern take on the famous classic. As far as I am concerned, the ditto adaptation of story, without even an iota of change proves two things: 1. Makers fear experiment. 2. There is no place for newness in Bollywood (mainstream only).\n\nBut the romance is absolutely stunning enacted by two growing and established people (whose efforts show). They are directed nicely and their performances give this film a positive nod. Supriya Phatak is flawless. Crime overtakes everything in this film of chaos & riot, most of which looked like they were unnecessary. But in an attempt to make things look like they are different, the makers adopted multiple thinking brains & who, in fact, thought for long hours giving us a boring second half. Sincerely speaking, the first half is a 10 on 10. Second half may reverse the former number.\n\nI'd try to call upon the art department for my wedding ceremony, because it is just too brilliant and that is what fills prowess into the film. SLB has always been a connoisseur and this time even, he has not left a single stone unturned. Dialogs are very, very good which showers brilliance all over the 160 minutes of fair-play.\n\nWith huge traces of vulgarity, crime (aforementioned), and situational rioting, this is not for children (not taking into account the ambiguous 18) in contrary to the Shakespearean classic.\n\nCan be watched with a typical Indian family? NO\n\nVulgarity/Profanity: Very Strong | Violence/Gore: Critical | Sex: No | Mouth-Kiss/Foreplay: Strong | Porn: No Visuals; Mild | Smoking/Drugs: No | Alcohol: Mild"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "arnavgoswami",
        "review_rating": "3",
        "review_title": "Bad version of Ishaqzaade",
        "review_detailed_main": "watched RAM-LEELA ..now change its name to \"Goliyon Ki Rasleela\" or whatever BUT everyone will call it RAM-LEELA(its done)...though the media is buzzing good things about it BUT the reality is diff...sure the movie has vibrant colours, good cast, in nice costumes in which they dances n prances on the beats of good songs(really), & though the story sets in 21st century STILL the \"movie sets\" reminds you of medieval n Victorian architecture(especially the Juliet/Leela's balcony)\n\nNOW everything about this film is good..except for its plot(the main sh!t)..its full of loopholes & crap(in itself)..boy n girl from rival families fall in love(like Romeo & Juliet) they met for the 1st time & the other day they are in each other's arm talking bullshit!?(How In The F**k is that romance?) & the atmosphere where this story sets is like of SHAKTI(2002) or of a f**king Talibani state(utter bullsh!t) & before you'll realise it'll turn into a Bad version of ISHAQZAADE & Ranveer Singh's overdose of Gujarati ll almost kill you (its sucks) its a waste of M&T\n\nI suggest_DO NOT WATCH_"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "drheart007",
        "review_rating": "",
        "review_title": "A colorful Holi on the big screen; A festival for the eyes and mind",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rijuthegreat",
        "review_rating": "6",
        "review_title": "Not a bad watch if you suspend disbelief",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sumitb128",
        "review_rating": "8",
        "review_title": "Great !",
        "review_detailed_main": "Making a movie based on William Shakespeare's work is an arduous task, but the more important question is how do you do something new in it? Many movies have been made on Romeo and Juliet or taken inspiration from it. But Sanjay Leela Bhansali's latest production Goliyon Ki Raasleela Ram-Leela is a too dramatic and Indianized version of the same with a pinch of Ramayan - our romeo hero Ram returns from his vanvas and meets his Juliet/Sita - Leela.\n\nVintage palaces and daunting deserts used in the movie makes the scale grand. All the actors have done a superb job - Deepika Padukone's breathtaking sexy looks, Ranveer Singh's six packs and Supriya Pathak's angry woman act stole the show. On top of that, the soft romantic songs are simply mesmerizing.\n\nI enjoyed the movie but if would say that if you don't like romantic tragedies or a serious sarcasm melodrama."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "shaankhan-u",
        "review_rating": "6",
        "review_title": "A CONFUSE review with a CONFUSED mind of a CONFUSING movie.",
        "review_detailed_main": "The confusing part is to call it a good or bad movie which made me confuse to write a confused review.\n\nUghh...\n\nWell let's see..\n\nDirection -- Perfect ; Production Value -- Astonishing ; Editing -- Great ; Cinematography -- Fantabulous ; Art Direction -- Magnificent ; Concept -- Brilliant ; Story -- Nice * ; Screenplay -- God knows what was it like. It was complicated to judge whether it was pacey and crisp, or sluggish, dragging to nowhere and repetitive. ; Performances -- Amazing (Deepika did a great job) ; Music -- Okay.\n\nSo... what happened in the movie was that everything was near to equilibrium but couldn't achieve what it would have otherwise.\n\nA good adaptation from Romeo & Juliet blended with commix of Indian masala and a sensible approach but with the ongoing screenplay, at times film went stupid, blunt stupid. The characters became dumb and chips fell in the wrong lane. It felt like everything that was bounded together to make it an excellent piece of cinema went lost somewhere which eventually wasted a beautiful love- saga into an average-to-good romantic-drama flick.\n\nIt deserves a watch for sure, but only to give you disappointment later on because everything in the movie will set your expectations on cloud 9 but it will keep on crashing those expectations at spaces.\n\nI'd rate this lost epic as 6/10.\n\nAnd I still hope someone could have read the script again before executing it so that to make those minute changes which would have given success to such a hard effort by everyone on-and-off the camera in putting up a commendable canvas of art."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sujath2807",
        "review_rating": "4",
        "review_title": "Romeo and Juliet is the Greatest love story ever !! Ram Leela was nowhere near it",
        "review_detailed_main": "I think we all knew what we were getting into for all of you who are complaining about the movie, we have witnessed previous works of Sanjay Leela Bhansali and trailers pretty much gave us an idea about G.K.R.R.L.\n\nIt is very clearly mentioned in the beginning of the movie that the story is an modern adaptation of Shakespeare's \"Romeo and Juliet\". When it comes to S.L.B movies it is all about Huge sets, great music, good actors and a long run time. However G.K.R.R.L has slight changes it is roughly 150 Minutes but seems longer due to the slow story, it has good actors but their potential wasn't used enough, the music is forgetful and i guess we have seen some great sets in his previous movies so G.K.R.R.L sets look average.\n\nRomeo and Juliet is a great romantic story ever, any one can make a good movie out of this story; but what the story needs is the intensity and passion which lacked in G.K.R.R.L. Ranveer and deepika seemed high on drugs while doing their romantic scenes , chemistry between them seemed more lustful than passionate. Of course SLB wanted the heat between the actors to show the audience a strong bond between them instead it looked cheap. SLB might defend this point by saying as the story is set in the modern times hence the fast forward romance, trust me young people in this age do not act like horny teenagers at least people in the serious relationships, it just seemed so stupid and UN-real the way Ram and Leela fall for each other. I had to write this in double quotes so yeah \"SLB should have spent some couple of scenes on the RAM - Leela budding romance story, at least by keeping Indian audience in mind\" anyways moving on the songs in the movie were so situation less and the way the dances were choreographed felt it meant for small children. However acting by supporting cast was much better specially \"Richa Chadda\" she stands out and delivers a strong performance, Gujarati culture did reflect in the movie and i laughed here and there on a joke or two. I was bored while watching the first half and was wondering whether we do not have an intermission in between (AS this is an adaptation of Romeo and Juliet \"PUN INTENDED\") much to my misery there was an interval and left me wondering how will i sit through the next half, however movie did drag till the end with the actors getting more and more confused with there characters. I felt Deepika knew what she was doing and was acting like a typical SLB's movie heroine. Ranveer seemed completely lost after the first half of the movie, i was confused whether he is playing a good guy or the bad guy i feel ranveer can pull the comedy roles better than the serious roles.\n\nAfter a dragging story it came to an end. No surprises there as how the movie ends, i guess SLB was trying to give us all a message ? or was trying to show a great love story or was just trying to entertain the audience. In my opinion none of them were delivered i am not saying the movie is UN watchable or something but Romeo and Juliet is the God of love stories it should make us cry out of emotion not out of pain or boredom. Well again i am not terming the movie as worse, trust me i have seen some worse movies, i feel when talented actors, a vintage director and a big budget meet. The movie should stay in our minds it should not be forgetful as this its just waste of money and time for so many people. Now that said i rate the movie 4 out of 10 for the beautiful screenplay and acting of the supporting cast and also for Deepika. I wont tell you to save your money and time by not watching it, but yes may be what you are looking for is not in this movie. Trust me it isn't !!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "Tanay_LKO",
        "review_rating": "8",
        "review_title": "A well-made and well-performed adaptation of \"Romeo and Juliet\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Romeo and Juliet + Ishaqzaade",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "jogesh_thakur_2210",
        "review_rating": "1",
        "review_title": "cheapness,lust,nudity at it's very best!!",
        "review_detailed_main": "This is the worst love story of all time which includes over the top violence no sense at all,and the poorer part was that how easy the co stars has started loving each other they see each other and in the very second part they kiss followed by more after every 2 scenes..i said what the....even if u try to call prostitute for sex in exchange of money,she will try to excuse for once it is not obsession of love but only obsession of sex,here story of ram Leela wow u will just find here stuck in the theater and whole time thinking in the end they should kill by someone so at least we can skip out of the theater in happy mood and finally that's happened at last i can make exit to the theater in some good mood pathetic cinema experience skip it and save your money you will never feel any emotions or this type of shameful movie please don't go don't go don't go :P"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rangarajnaidu",
        "review_rating": "8",
        "review_title": "A gem of Indian cinema",
        "review_detailed_main": "SLB is known for his great movies, this is one of them. I don not agree with users who say about Romeo Juliet and Ishaqzaade, because the start of the movie clearly says that RJ is an inspiration to the film and so Ram Leela is not an adaptation. Bhansali has colourfully weaved the Indian sets ,Gujratism, clan fights and passionate love of RJ into one cloth- Ram Leela.\n\nSupriya Pathak as Baa is just GREAT. One could not think of the Khichdi dumb Hansa to be a leader of a clan. Her acting and dialogue delivery leaves one spell bounded. The others are also great- Richa Chadda especially. The lead actors are good. Music by SLB is a hit again. But the item number could have been deleted.\n\nIt is worth watching for SLB fans, Pathakji fans, casual movie-goers. But for people who do not have a taste for a love-violence chemistry, this may seem boring. If you have 2 hours to spare for a great movie, then make your mind and sit on your couch and watch this movie."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ashvinmeetoo",
        "review_rating": "7",
        "review_title": "Simply amazing...",
        "review_detailed_main": "I must admit that I slept for the first 10 minutes or so... maybe I was tired... or I found the beginning boring.\n\nThe movie is awesome, well balanced. The actor matures as the movie goes on... from a kid to a don. I thought he would not be able to handle the story but he came out brilliantly.\n\nThe actress is superb, what can I say more... perfect performance.\n\nGenerally I hate romantic movie, I find them too emotional... but this one gave the audience an emotional roller-coaster till the final minute.\n\nI could easily have disliked the movie but the chemistry between Ram and Leela kept me watching till the end.\n\nA must see for every couples, for them to make up their own mind."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "jahangirhussain74",
        "review_rating": "3",
        "review_title": "Forgettable rehash of Romeo & Juliet",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "yunusitboss",
        "review_rating": "7",
        "review_title": "Goliyon Ki Raasleela Ram-Leela (U/A) Hindi --------- my Rating : ★★★½ COLORFUL ENTERTAINER",
        "review_detailed_main": "Goliyon Ki Raasleela Ram-Leela (U/A) Hindi New movie Reviews and lots more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nGoliyon Ki Raasleela Ram-Leela (U/A) Hindi --------- my Rating : ★★★½ COLORFUL ENTERTAINER\n\nSTRENGTHS :- * Camera : was awesome ...eyes were stunned.... * Music and BGM : were rocking and vibrating ....... * Casting and Performances : award winning performances . * Deepika padukone : Fires the 70mm screen too hot and boldness .... * Art Direction : was amazing set ..... * Dance and Direction : was enjoyable....\n\nWEAKNESSES :- * Screenplay : was weak with a lengthy First half ..... * Climax : was unacceptable ...... * Story : drops in second half .... * Certification : it must have awarded with an \"A\" certificate this movie contains vulgarity in dialogues with more double meaning dialogues and sound effects given by actor ....\n\nFINAL VERDICT :- * Overall... the movie is a complete entertainer with First half full of songs .... Enjoy it\n\nRam, the local village Romeo, is a colorful, charming yet dramatic vagabond whereas Leela is an unbridled and passionate village Juliet. The only thing in common between these two strangers is their family's hatred for each other.\n\nThe two communities have been sworn enemies since the past 500 years and their own kin falling in love with each other is worse than any storm that could have ever come. When Ram and Leela see each other for the first time, their worlds collide, wars are fought and destinies are written in blood, forever."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "dapadayachee",
        "review_rating": "10",
        "review_title": "Flamboyance, gusto and great energy, this film is intrinsically electrifying.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rachit-nirmal",
        "review_rating": "1",
        "review_title": "Ram Naam satya he... baki film 'lust' he..!",
        "review_detailed_main": "Is there any possibility that I can get my two and half hours back\u0085. Poor movie, looks like the screenplay had been written by more than 1 person. Every scene includes at least one double meaning dialogue. I don't understand why Sanjay tried to compare (or inspired) this with the classic 'Romeo and Juliet'. The love which Sanjay showed in this movie started from body hunger and ended body hunger. We can easily understand that there is no need/require of song, but inserted to increase the length of the movie. Ranveer Singh: Pathetic Deepika Padukone: She has changed her image after this movie Supriya Pathak: Excellent, but she deserved more screen appearance. She had not been utilized properly. Movie is good for its music, songs and cinematography. However when it comes to storyline, there is nothing. Unnecessary violence, lust and\u0085.. Overall a total time (and money) waste."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "parth1993007",
        "review_rating": "10",
        "review_title": "Try to watch in theaters.....",
        "review_detailed_main": "Amazing cinematography.........!!!!! Use of color is like every frame of the movie is painted by artist. The costumes are very carefully chosen. Background music is very effective. Every Gujrati feel proud of their folk-music, colorful raiment on the way it is presented in the movie. If you are a fan of art then surely you will like it. Acting Of all characters give justice to their role in the movie. Actually don't confuse with movie name \"Ram-Leela\", There is no historical relation with it. The movie is completely based on imagination, if Romeo and Joliet were Gujrati then how things had happened. Gujarati folk dance represented very purely, choreography is nice. In movie so many times word \"chhe\" used it means \"is\"or\"be\". Totally colorful and enjoyable. If say in Gujrati it is like \"Bhai Bhai...\"...!!!!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rajeevk",
        "review_rating": "5",
        "review_title": "Boring, Messy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "MisterAugust",
        "review_rating": "9",
        "review_title": "Goliyon Ki Rasleela-RamLeela",
        "review_detailed_main": "RamLeela have everything that a normal moviegoer seeks! It's complete entertainer! It have jokes-sometimes vulgar but enjoyable! Breathtaking visuals and superb cinematography! But it is not perfect! It has flaws! Sanjay Leela Bhansali has introduced violence in his project which was supposed to be an epic romance tale, thus mixing two different genre which I guess minimized the cinematic excellence of a genius's masterpiece! But still it's a must watch who love cinema and passionate performances which Ranveer fulfills soulfully by putting all his efforts. He was just above awesome however Deepika also managed to give a decent performance; Ranveer is a showstopper! Overall, RamLeela is not a promising or brilliant piece of art but it's a watchable movie and should be remembered for its choreography, music, dance sequence and dialogues!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "oursales11",
        "review_rating": "1",
        "review_title": "time waster - a bunch of crazy writers behind the story",
        "review_detailed_main": "After watching this movie, me & my wife had MIGRANE, that last for nearly 2 days, such a waste of time & money. Story was so stupid that one cannot even imagine. I think if you want to take revenge from someone then the best way is to send them this movie ticket.... It's so hilarious that a girl from village saw a man first time & kiss him & then a sequence of kissing after that, the writer must be crazy or may be....? there are so many songs and dancing that you will forget where was the film & that what the director is trying to show. Never expected such a shame from Sanjay Leela Bhansali. Anyhow best of luck for the viewers going to watch the movies and not the kissing scenes."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "manishkmantry",
        "review_rating": "9",
        "review_title": "Very Good Cinema...",
        "review_detailed_main": "One word: Breathless! - in terms of storyline, pace, camera work; Awesome! - in terms of execution, performance of the leading actors; Superlative! - to all that has come out for the year so far...\n\nI am a big fan of Good Cinema and this is certainly one very necessary addition.\n\nThe contemporary Gujarati adaptation of the eternal Romeo & Juliet saga has been given a very fair treatment and colour. But then this is commercial cinema and it remains such.\n\nSome scenes standout like the one when Kesar Bhabhi comes to visit Ram after his appointment as the Head of the Rajadi clan. One more such scene is the climax one.. not gonna reveal anything here.. see it to appreciate it.\n\nOverall the one word(s) given above stay."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "princebibs",
        "review_rating": "1",
        "review_title": "Overall good",
        "review_detailed_main": "Deepika is an absolute delight to watch. But Ranveer Singh?? A better performance was expected from him!! Despite awesome promos showing Ranveer in great scenario,sadly the weakest link of the movie was Ranveer. A better performance was expected from him!! Great songs and sequences add spice to this delight by Sanjay leela Bhansali.He proves yet again he is one of the finest filmmakers of this era. It won't be surprising if Ram leela has a healthy run at the theaters at the expense of other movies.People having second thoughts about this movie are in for a surprise.This is nothing like a masala movie.Watch the movie as soon as you can!My rating:4/5!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "moon75400",
        "review_rating": "9",
        "review_title": "Ram Leela aka Romeo and Juliet",
        "review_detailed_main": "Ram Leela, an epic adaptation of Romeo and Juliet by Sanjay Leela Bhansali (SLB). A celebration of love and a festival of colors, typical SLB style with some (read lots) added ammunition. Electrifying chemistry between Ranvir Singh and Deepika Padukone, great performances by the supporting cast as well especially Richa Chadda. The second half starts to lag though so could have done with some tight editing. Although there is a lot of titillation so let the young ones do something else while you watch this piece of brilliant cinema. This is surely and adaptation of which Shakespeare would be proud of. A treat for all Sanjay Leela Bhansali fans, don't miss it for anything"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "neelshah1617-848-297949",
        "review_rating": "5",
        "review_title": "Go to watch just Ram & Leela, otherwise don't",
        "review_detailed_main": "Ram-Leela (Inspired by William Shakespeare's novel) Nothing much to expect from this typical/conventional Hindi movie. Acting of of Ram & Leela may charm you, well their (steamy) chemistry do!!! Inception of affection occurs very immediately in a bold and reckless way (totally unrealistic!). It continues and later transforms in to revenge. First 1.5 hrs you will find common in every Bollywood movie and further stretched story line lacks content. However, you will enjoy the sets and creation of scenes (not direction!). What else?!! Go to watch just Ram & Leela, otherwise don't. Overall Verdict: 2.5/5 Total Time Waste. I would rather prefer to continue my 3rd season of 24 on Netflix!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "neelesh_jogia",
        "review_rating": "10",
        "review_title": "SLB - The Perfectionist delivers yet again....!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ketgup83",
        "review_rating": "5",
        "review_title": "Visually appealing but disappoints with weak direction and shabby screenplay",
        "review_detailed_main": "\" An eye for eye make the whole world blind \" as quoted by Mahatma Gandhi is the essence of Ram Leela. Love, not war , is the solution to the problem.\n\nGoliyon Ki Rasleela Ram-Leela is a tale of love , family-feud and sacrifice which is based on Shakespeare's acclaimed play Romeo & Juliet\n\nHow many times have we watched the adaptation of Romeo & Juliet on the silver screen? This might be the uncountable time in which the popular play is turned into messy and violent Ram Leela directed by Sanjay Leela Bhansali. As the film begins , you are introduced into the frequent intervals of unnecessary inclusion of songs. The chemistry between Ranveer Singh and Deepika Padukone will enlighten you and the main drama unfolds after killings of respective family members. However , the movie never picks up and tumbles down the rabbit hole. The poor screenplay is uncontrollable editing makes it worse and you might take a nap in between. Art direction is spellbinding along with brilliant cinematography and dance choreography. Ranveer Singh does decent job but could have been better. Deepika was brilliant in emotional scenes. Richa Chadha was good. But the surprise element was Supriya Pathak. It was pleasure to watch such a powerful performance with such a ease. She was marvelous in a negative role.\n\nOverall, Ram Leela disappoints with weak direction and shabby screenplay. Not recommended 2/5"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "atiyaahsan",
        "review_rating": "9",
        "review_title": "A visually sumptuous treat with raunchy dialogues yet commendable acting...!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "pankaj-parag",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": "This is absolute piece of ....\n\nAnother complete nonsensical film in year 2013 after Bhag Milkha Bhag, Krish 3 etc. Fortunate that I was in a group, so watched it out, unfortunate that I was in a group I could not walk out.\n\nPoor adaptation of Romeo and Juliet. The story does not make sense right from the first frame. I'd suggest to watch TVF videos over this idiotic movie. Only saving faces are Supriya Pathak and Richa Chaddha. They just wasted their talent here. Complete waste of time.\n\nA cheap and desperate attempt to popularize the dialog \"Bhai Bhai\". In the entire movie only 2 or 3 dialog were good.\n\nDo not watch even if you are paid for it."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "devtaal-prai",
        "review_rating": "8",
        "review_title": "If you love Beautiful sets,Sanjay's movies and some performance oriented movies,WATCH IT",
        "review_detailed_main": "Very gud movie by Sanjay Leela Bhansali But no best,best will be \"Hum Dil de ......\".Sanjay Used all his instincts of HDDS,Devdas as a signature to make movie a huge success. Excellent performances by all characters Ranvir Singh,Deepika, Supriya Kapoor. Music was outstanding Sets Were worth to watch and had very strong Choreography. Deepika and Supriya I hope had already Reserved awards .At this time only Ranvir and Dipika were BEST SUITED for movie.Though there were some loopholes in story but still It binds us till last and just make us to think..\" Yar ab kya hoga\" Message from movie is that People should be educated and at least broad enough to judge things in correct way. Very bold Movie.Movie had good direction,Performances ,sets but due to heavy action and subject some people can be scared."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "varun-sharma9891",
        "review_rating": "4",
        "review_title": "why SLB why?!",
        "review_detailed_main": "Walked out in the interval. Yes Deepika was looking good. Yes she is a good actress. Apart from that I found the movie to be a desperate attempt to grab attention by double meaning dialogs and unwanted vulgarity. and unwanted cleavage(Ranvir Singh, please wear a shirt if you are wearing a shirt). Other than that I just think SLB did a Miley Cyrus. There was no romance in this so called tribute to Romeo and Juliet, it's just two people(with seriously elevated estrogen/testosterone levels) looking at each other for the first time and falling in love/Tharkiness. I don't know if I'm allowed to say that. Apologies in either case.\n\nThe music was so bad. \"ram chahe Leela, Leela chahye ram, in do-no k love main duniya ka kaam\" \"bhaiii bhaii *gunshot* *gunshot* bhai bhai *gunshot**gunshot\", \"tu goli chalye mien Teri chum mi Lu something\" were just embarrassing. The performances, Deepika was good(duh). Ranvir Singh, frankly, I find him annoying. I'm sick of watching him in his typical 'chichora' roles. Sadly, I have seen almost all his movies (ricky Baal, shaddi one and the other one.), heard he was good in Lootera but also heard so was Sonakshi Sinha which I highly doubt, so gave it a pass. Supriya Pathak was good. Priyank Chopra was bad, even though she didn't have control over the choreography or the lyrics of the song. It was bad. Badbadbad. If I'm not wrong, this was the first time Sanjay Leela Bansali had to resort to an Item number to sell his film. Just shows the kind of audience that was being targeted.\n\nThe Indian audience is above the era where when the director wanted to show an intimate scene there would be a flower blocking the view or a bunch of bushes moving in front of their faces but I don't think we are ready for this kind of vulgarity 'yet'. In my opinion, if he wants to make Adult Cinema, SLB should try a different approach or maybe take some tips from Anurag Kashyap ;)"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ankit-848-233854",
        "review_rating": "10",
        "review_title": "Good",
        "review_detailed_main": "I guess Mr Bansali wanted to see a mixture of both in Deepika. But sadly the story line does not call for it! Ranvir still has remnant parts of Band Baaja Baraat and Ladies Vs. Ricky Behl. In most of the scenes either he is full carefree or full sentimental (literally crying). A talent like Richa Chadda is wasted. To conclude, its sad to see Mr Bansali following Ram Gopal Verma's footsteps wherein camera work and raunchy scenes are used as misdirection for a bad storyline I guess Mr Bansali wanted to see a mixture of both in Deepika. But sadly the story line does not call for it! Ranvir still has remnant parts of Band Baaja Baraat and Ladies Vs. Ricky Behl. In most of the scenes either he is full carefree or full sentimental (literally crying). A talent like Richa Chadda is wasted. To conclude, its sad to see Mr Bansali following Ram Gopal Verma's footsteps wherein camera work and raunchy scenes are used as misdirection for a bad storyline"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "malhar-chudasama",
        "review_rating": "1",
        "review_title": "Pathetic Movie Ever",
        "review_detailed_main": "To begin with, I haven't added a single review yet on any film on IMDb. But after seeing this I cannot stop myself to warn the users.\n\nWhen you think about SLB, you will remember Khamoshi, HDDCS and great love etc etc. This movie doesn't having anything from that. Just lust sex that it. How they fall in love? Simply seeing each other and on first meet they smooch? Same day meet they goes on the bed and talk about removing cloths? where is all the great love by SLB.\n\nNothing in story that keeps you on the screen, I waited 2 hour 30 minute to see something extra-ordinary but disappointed. I was just waiting when the movie will finish.\n\nUnrequired dialogs, No logic for many things, Specially why this is ram- leela? Why using so strong topic from myth, just for hype. In one scene Leela(deepika saying 10 proverbs without reason pathetic).\n\nAbhimanyu singh totally wasted. Supriya pathak was the only one who done the best.\n\nIf you still not watched it don't worry there is no special thing. Don't waste your 2.30 hours on this."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "yesno1111",
        "review_rating": "8",
        "review_title": "Film with a good message but poorly delivered, preferable but not lovable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "soomro-raheel",
        "review_rating": "4",
        "review_title": "All that glitters is not gold!",
        "review_detailed_main": "Mr. Bhansali what happened to you? Your previous work reflected your creative art, heart and soul but after watching Ram Leela, I was simply shocked. The heart of \"Hum Dil De Chuke Sanam\" or the innocence of \"Black\" just disappeared from your creation. Vulgarity, poor plot and a predictable end literally killed the movie. It's really a shame how the movie has been overrated and have been doing so called top sales in India.\n\nIt actually reflects what kind of frustrated public is going to see this movie. Thank God that I did not take my kids to see this \"unrated\" movie otherwise I would have been so embarrassed. Ranvir and Deepika has done a superb job and the movie is visually appealing to some extent. As far as story is concerned, there is no soul, no heart and no sense to it; making it a bad remake of Romeo and Juliet. There is a fine line between eroticism and vulgarity which was crossed big time as if the movie was made by a an amateur. I have given the movie 4 votes just because of the visual appeal."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "elhassaniyou",
        "review_rating": "10",
        "review_title": "Ram leela",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "lakshyag",
        "review_rating": "5",
        "review_title": "A visual treat but conflicting content",
        "review_detailed_main": "Again a visual treat by Sanjay Leela Bhansali. As always he has created each and every frame of the film as an individual painting. Visually a beautiful movie.\n\nThe story of the film as about Ram and Leela who belong to 2 Gujarati clans who are enemies for centuries. They fall in love and in spite of all kind of opposition run away from their families. Then the family politics and shrewdness come into effect and they get back to their families. Due to circumstances created by people in the family Ram and Leela are appointed leaders of their respective clans. Though now they now have responsibilities they still love each other and try to bring peace between 2 clans. At the end when they see no alternative they shoot each other to die together.\n\nThe movie is adaptation of William Shakespeare's Romeo & Juliet.\n\nThe depictions of richness, enmity, culture and power is amazing in the movie. From the aesthetics perspective no one can point a finger at Sanjay Leela Bhansali as he is the master of detailing. Though he has taken care of every detail in the movie there was something missing in the movie from content point of view.\n\nFirst half of the film is gripping and leaves you mesmerized. Nice narration of the story with correct pace whereas it lacked in the second half.\n\nThe movie has amazing performances by Deepika (She has never looked so beautiful so far), Ranveer, Richa Chadha, Sharad Kelkar and unforgettable Supriya Pathak.\n\nEven after having so many strong points and amazing qualities, a little disappointing for Sanjay Leela Bhansali movie.\n\nThere are many conflicts in the content of the movie. Though Ram and Leela are deeply in love and trust each other with their lives but there were major trust issues at many places in the movie which seem very conflicting. Ram is shown as a peace loving person in the midst of cold blooded killers around him and as soon as he is appointed leader of his clan he gets busy with his clan issues which was conflicting. In the second half of the movie the eagerness of being together was missing in both Ram and Leela though they were shown remembering each other at times. Overall second half of the film does not keep you curious. Rather you loose track at some moments so it leaves you stranded. The grip is missing in the second half."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "jackrichardson-68191",
        "review_rating": "10",
        "review_title": "One of The Best Romantic Movie",
        "review_detailed_main": "This is the Greatest love story i have ever seen. One Of The Purest And Strong Love story..Leela always trusted ram. The concept and storyline is so rich you can binge watch this movie 2-3 times in a single day.\n\nLeela took my heart away. Ahh best love story."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "abhaykumar1-858-237945",
        "review_rating": "2",
        "review_title": "Didn't expect such a bad one from Sanjay Leela Bhansali",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vssvms",
        "review_rating": "9",
        "review_title": "Intense film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "DareDevilKid",
        "review_rating": "5",
        "review_title": "A Nonsensical Farce",
        "review_detailed_main": "Reviewed by: Dare Devil Kid (DDK)\n\nRating: 2/5 stars\n\nSanjay Leela Bhansali is back to his pretentious, self-indulgent, pseudo-psychological best. Deepika as usual tries her level best but just about passes muster. What does the make the movie bearable to a certain extent are Supriya Pathak's and Ranveer Singh's sterling, rustic, Gujrati turnovers. Supriya Pathak gives ample proof why she's one of our industry's most underutilized prized performers.\n\nWhile Ranveer Singh displays oodles of unbridled confidence, silken chutzpah, inescapable charm, relatable earnestness, and raw emotions to convince us beyond doubt that here's a thoroughbred leading man come to entertain us for a long, long time. Unfortunately, \"Ramleela\" is a classic case of two superlative acts trapped in a very mediocre film."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vikaskumarbishnoi",
        "review_rating": "10",
        "review_title": "Best movie for ranveer",
        "review_detailed_main": "The screenplay and double meaning dialogue was excellent. the acting of ranveer singh is of pro level no one can reached there."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ahwaan_padhee",
        "review_rating": "5",
        "review_title": "Ramleela : Riot of colors and blood",
        "review_detailed_main": "Bhansali's film have become a metaphorical revisit to larger-than-life richness, visual tapestry and opulence.In this adaptation of Romeo & Juliet saga,he mounts his lavish sets against the bloody(read Red) backdrop of two warring clans - the Rajadis and the Saneras who have a astronomical history of rivalry for over 500 years.\n\nSounds familiar ? Yes , it does. The temperament of Ramleela resonates the same sentiments that Ishaqzaade had.With the ghastly memories of the unbearable Issaq still afresh in our minds , we are offered another violent love story set in the fictional town called Ranjaar in Gujarat.Its lust at first sight for Ram (Ranveer Singh)the scion of the Rajadi community and Leela (Deepika Padukone)from the Sanera family.Bhansali develops their romance with strong sleazy dialogues, cheesy SMSes and a solid undercurrent of sexual energy.Eventually the romance is thwarted by familial vendetta and transforms into a love-hate fare where each party is on an endless, mindless pursuit to settle scores with guns and bullets.\n\nThe problem with Bhansali's storytelling is its exaggeration. With the narrative turning wobbly in the second half , the contrived melodrama resurfaces and takes a toll on your brain. Somehow, the sequences look disjointed and every high-tension action is punctuated by a dance number which slowly gets on to your nerves.His obsession for folk dance becomes evident when you even find a cocky and clumsy Abhimanyu Singh shaking his booty in a song sequence.The blazing camera-work and elaborately choreographed songs stand out in this enterprise, with Priyanka Chopra's tantalizing item number effortlessly topping the list.\n\nWe all know that Bhansali's over-indulgence is channelized towards the female lead.He makes Leela a heady concoction of sweetness, bitterness and sauciness.With her ethereal looks and luminous eyes, Deepika spreads the rare aura that you can't take your eyes off her.But when the script is so saddled, not even a determined performer like Ranveer can salvage it.He has the natural potency but his character is so awkwardly written that it tries to break into multiple directions.\n\nThe supporting cast does make its presence felt - be it the menacing Supriya Pathak in the role of Ba who moves her eye-balls like the notorious Kooka(Mohan Agasse) of Trimurti or Richa Chaddha playing the feisty sister-in-law of Leela with utmost perfection.Watching Abhimanyu singh and Sharad Kelkar in the terrific bottle-shooting sequence did raise goose bumps and good hopes.Barkha Bist and Gulsan Deviah do fair amount of justice to their roles.It was a treat to feel the rich baritone of Raza Murad cast in a cameo , as his character woggles helplessly at the silliness of the plot.\n\nWatching Ramleela gave me mixed feelings. I was irritated because it was a drag and happy at the same(with due regards to his artistic reverence) anticipating that brand SLB would not come back before 3 years.\n\nRating : 2/5"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sarojaryal",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "Perfect direction, amazing performance, deepika breathtaking, Ranveer's physique, visuals, music, emotions, supporting actors top class, A treat to watch for any movie lover."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rajeshnaik21",
        "review_rating": "1",
        "review_title": "Waste of time and less than 1 star",
        "review_detailed_main": "Super duper flop movie without any logic. Except for the sets and star cast there isn't much to talk about this movie.Gun shots being fired all over the place and no story at the end you are left wondering what was the exact story about? It shows the law and order in complete chaos and puts the state/country in Bad light as such to the viewers in general leaving no space in assuming that there isn't any law and order in India. Songs once every 5 minutes for no reasons at all bore you real time. Waste of time,money and this movie tests ones patience. It is just over hyped with paid reviews and advertisements. Thumbs down from me. Avoid it at all costs and only time will tell the result."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "RohitGupta0101",
        "review_rating": "8",
        "review_title": "Bhansali's another self-obsessed film, which is visually stunning with few notable performances but how many times I am supposed to watch the same story again & again.",
        "review_detailed_main": "To begin with RAM-LEELA remains another self-obsessed, colourful but over-stuffed painting on the celluloid with some exceptional brush strokes failing to generate any huge impact on the viewer in totality. The film does have its worth watching moments which are mostly to be found in its first half watching the lead pair together doing their lusty sexual acts (questionably) portrayed as Eternal LOVE. But post intermission it all fizzles out drastically and the director tries to add too many unconvincing twists and turns taking it to an unnerving end sadly. No doubt few magical moments do come in at various intervals, consolidating the director's famous status in the industry. But regrettably they are not something fresh or path-breaking, since either they remind you of a song sequence of his mega hit \"Hum Dil De Chuke Sanam\" or of a powerful scene of \"Devdas\" giving you a seen before kind of feel, repeatedly. The soundtrack too is able to impress only partially with a few good tracks in the initial reels and as the film progresses their excessive use starts becoming annoying, particularly in the second half.\n\nTo say the truth, being a powerful love story as per its theme, I found the famous \"Bhansali Feel of Love\" also missing in the film replaced by lust, sex and double meaning dialogues quite surprisingly. For instance, I may sound to be an 'old timer' but I don't think a girl can easily come forward and give a straight smooch to a boy if he looks good and of her own type just in the first meeting itself in a public place. Moreover the way both the boy and girl start rolling over each other on the bed with several kisses one after another in their second meeting only, for me it wasn't anything close to 'Pure Love' but only lust, sex or body hunger and nothing else.\n\nInterestingly such depiction of love was not there in any of Bhansali's earlier films. The director never showed his love birds in this kind of sexy, lusty avatars ever before. Hence undoubtedly this time Bhansali is more interested in reaching the masses with cheap insertions of a blue film parlour, David Dhawan like rhyming dialogues, guns, bullets, murders, rape attempts and bloodbath, may be in a state of desperation. Yes, he begins well with an exceptional sequence of rivalry between two groups in the first scene and then handles another sequence depicting the same with a superb camera-work & vision. But actually this isn't a Bhansali genre at all and once the love birds get separated, going into the violent mood, the film falls flat with everyone behaving in a confusing manner not suiting their actual character as defined in the first hour.\n\nIn the performance section, the actors simply surrender themselves to the vision of their director and the three winners coming out of entire cast are Deepika, Supriya Pathak, and Richa Chadda unarguably. Following the above are Abhimanyu Singh, Gulshan Devaiah, Sharad Kelkarand Barkha Bisht who play their parts well but the director should have given more mileage to Richa Chadda alone. Along with these good performances there are some pretty ordinary ones too including Raza Murad, Homi Wadia and the deliberately added poor item number of Priyanka Chopra. Talking about the lead pair, Deepika once again scores over her hero and she even goes shockingly bold this time as instructed by the so called love-guru i.e. SLB. Ranveer on the other hand, doesn't offer something new, as he plays the same old flirty lover boy with the only difference of his Rajasthani attire and nothing else through a great script too with something novel to share.\n\nRevealing the controversy, SLB's film has nothing to do with either Lord Ram or his sacred Leela at all. So the director had a clear intention of using the phrase \"RAM-LEELA\" for his film's instant publicity alone and all this controversy could have been easily avoided by using any other name with a regional touch.\n\nRegarding its subject based on Shakespeare's \"Romeo-Juliet\", I remember watching QAYAMAT SE QAYAMAT TAK when I was in school and then few other films too with the same theme. Plus just recently there was not one but two films made on the same subject namely ISHAQZAADE & ISSAQ, which forces me to think that perhaps except Vishal Bhardwaj, very few have read the other classics of William Shakespeare in reality in our own Bollywood. And that might be the reason why they repeatedly pick the same old, over-used Romeo-Juliet again & again to bore the innocent audience quite arrogantly. However there is one more reason which comes to my mind regarding the use of this same theme again and that is the 'Fear of Rejection'.\n\nAnyway, for me CINEMA means \"The Art of Storytelling\" and if a film hasn't got a new or interestingly fresh story to tell then it is quite a waste of time despite all the great visuals, drama, music, performances and execution. To elaborate on the same, we have a small life here to live on this planet with a limited capability to read or know all the worth studying literature of the world. So we need the medium of cinema to introduce us to many unknown and unexplored gems written within as well as out of the country following a wider vision. And that is exactly what I search for while watching every new film coming my way in any form.\n\nSo with a hope that these reputed film-makers of our industry would soon find their old courage back, I can only recommend RAM-LEELA to the viewers who are more interested in just the bodies and not their souls."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "aa-35383",
        "review_rating": "1",
        "review_title": "Overacting at it's very best",
        "review_detailed_main": "If one could separate the visuals and story from the movie and offer it to better actors it may have been watchable."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "disizzgsk",
        "review_rating": "10",
        "review_title": "Ram-Leela is An Indian Romeo-Juliet with love-romance-violence...Bhansali is Indian Shakespeare",
        "review_detailed_main": "Ram-Leela is Romance love drama between two clans Rajadi and Sanera with violence.Bhansali always make a movie like love romance epic nobody can't picturize. Ranveer Singh and Deepika best pair in this movie, They are really appear as Romeo-Juliet with love romance. Deepika One of the Best actress nobody can't dare some characters in bollywood she is perfect to Leela role. Ranveer singh Got a good experience with Bhansali Sir,This film help him a good level in bollywood. Movie had violence very much but Bhansali covered all parts Story,Love,Romance,Drama,Violence in his way of directing. Music is ultimate, I think so Shreya Ghoshal is first choice in his movies always. She sung a beauty beauty of songs.\n\nStory ends with tragedy but that's not effect to the movie. Violence between Rajadi and Sanera clans are so much but Sanjay knows the limit of point and its edge. We felt One kind of routine story also but director and actors their hard work no object to ask other things. Bhansali is Evergreen Director nobody replace his place and his movies in bollywood."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "altafnpatel",
        "review_rating": "2",
        "review_title": "Rubbish story, awkward background",
        "review_detailed_main": "Had lots of expectations from the movie being directed by Sanjay Leela Bhansali. The movie failed to give a strong, in-depth story. It always seem to be pathetic always waiting for climax that didn't arrive. Don't know how on first sight Leela falls with Ram, no story, no reason ! Acting of Ranveer was not more than childish. Never seem to be prime part of the movie. Childish expression, no seriousness in character even after being the leader of the Rajwad. I haven't seen any actor with that level of overconfidence in acting. The film always tried to put beautiful landscape with camera but movie is not all of it. So much songs, exaggeration on culture of Kachchh was all boring. It might be good for TV serial. The movie was neither love story, nor presentation of communities/region."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vilontetoyou",
        "review_rating": "9",
        "review_title": "I like all the colors and extras",
        "review_detailed_main": "Storyline: 7/10 Quality (colors, dancing etc): 9/10\n\nI also enjoyed the funny/ dirty lines"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "anshuman-patra",
        "review_rating": "1",
        "review_title": "Kept waiting for my Headace to stop",
        "review_detailed_main": "I thought for the first 10 minutes into the movie it will get better ,but by 30 min my wife and I looked at each other and said 'Oh God'. And we were not the only ones in the theater because by intermission we heard a lot of sigh of reliefs as to some moments of sanity We went to this movie for entertainment..... why did we buy tickets why did we waste our time is what was going through our heads... and we said to ourselves maybe it gets better.... We both got headaches by 45 min and the only reason we sat through the movie was that we have a disease of finishing every movie we watch.....no-matter how bad it is .....believe me it was a Test of Patience and Mental Strength ..... there are only a\n\nfew ways this movie can be described an utter waste of talent, money ,resources and a few disprins !!"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "obizzle-92350",
        "review_rating": "9",
        "review_title": "Bhansali",
        "review_detailed_main": "With Bhansali creating such a unique film encapsulating such majestic Indian cinema and by portraying it with the help of Shakespeare's legendary story. I truly think that the music was crucial to making this movie a complete banger. I just think that with the movies second part it lost the mark on what the main point and plot of the true story was. I understand that the director has a vision, but I don't think that this film can be called a Shakespeare spinoff when the movie takes a completely different direction with this storyline. I would barley consider the second half of this movie a Shakespeare play."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "anmolkumar-88201",
        "review_rating": "1",
        "review_title": "Shame on actors and director for this cheap irrespect of hindu dharma and double meaning dialogue..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sauravmalla",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "Very beautifully designed the whole plot of the movie. Great direction by Bhansali. Costumes, characters,location and the dialogues of movie could attract a lot of viewers. Performance of Ranveer is amazing. Almost 80% of the credit goes to himself. All the songs were beautiful. Great scenario of Gujarat based Indians and their lifestyles are perfectly shown in the movie. All the actors have worked very hard for this movie. I would give my most of the credits to Ranveer, Supriya Pathak, Richa Chadda, Deepika Padukon and Abhimanyu Singh. Overall great movie so far. Could be made a lot better if the movie was not made through the exaggeration of Romeo and Juliet. I think for the adaption of the \"Romeo and Juliet\" only,the movie has been compromised to make some sort of changes at the end."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Not Recommended 👎",
        "review_detailed_main": "Don't watch it it not worth the time, I never support a bad storyliine not even if production hier some popular actors and actresses 👎"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "kcrajput007",
        "review_rating": "10",
        "review_title": "It is really good movie to watch",
        "review_detailed_main": "It is really good movie to watch. worth to see Deepika.\n\nI guess Mr Bansali wanted to see a mixture of both in Deepika. But sadly the story line does not call for it! Ranvir still has remnant parts of Band Baaja Baraat and Ladies Vs. Ricky Behl. In most of the scenes either he is full carefree or full sentimental (literally crying). A talent like Richa Chadda is wasted. To conclude, its sad to see Mr Bansali following Ram Gopal Verma's footsteps wherein camera work and raunchy scenes are used as misdirection for a bad storyline.\n\nWhen a new movie releases we often look at the rating provided by other reviewers and decide on watching the same. But sadly the 5 star or 7.2 star rating provided to this movie may be based on the directors previous works and not the current one! Ram Leela is a good misdirection done by Mr. Sanjay Leela Bansali. Even Houdini would have to bow to him if this movie turns out to be a hit. Having watched many variations of the classic Romeo and Juliet, the last being one with Leonardo Di Caprio and Claire Danes, I can very well say that Ram Leela is clearly not a variant of this."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "chaitanya_jamadagni",
        "review_rating": "5",
        "review_title": "Messed Up - Not Completely",
        "review_detailed_main": "The script is poor. Unnecessary violence. SLB did not get it right for Ram-Leela."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "gulfisaforever",
        "review_rating": "8",
        "review_title": "An Excruciating Experience",
        "review_detailed_main": "Normally, I hate some movies, I love some movies, I find some movies to be average and some to be listless. This is the first movie, that I actually love and hate at the same time. I love it for what it is, I hate it for what it could have been. And in the same vein, there are certain aspects to this movie that are just amazingly, brilliantly created. At the same time, there are such obvious loopholes, mainly in the logic and plot department, that it almost undoes all the merits of this, hard to assimilate movie.\n\nMusic, Casting, Performances, Cinematography, Art, Dialogues, Costumes, everything is top notch. The best thing about the movie is that it feels so ALIVE. The problem is, there are some bits that are overdone. Its nice to see the heroine express her lust, her sensuality, its a nice idea, but too much emphasis is placed on such trivial elements, that it deters your attention from where it should be. It should be a love story, where two people fall in love, and love each other till the very end. Even in the last scene, Juliet asks Romeo \"Whats your size?\". Thats just an example, of things that could have been avoided, mended in this otherwise beautiful movie."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "nickonline22",
        "review_rating": "3",
        "review_title": "Mixed Bag of Tricks",
        "review_detailed_main": "Bollywood directors, please read these reviews as they are from an intelligent audience who will not pretend to patronize or flatter, but will speak from their hearts. The story plot of this movie was so weak....the development of the two main characters very weak, and so it has a tendency for a melodrama, unbelievable emotions that were overacted. Pretty buffed bodies are one thing, but if the content and story does not reflect the depth of the characters and their feelings, the interest and attention span of the audience begins to drop. Movies like Devdas, Joda Akbar, Umraan Jao, Mohobadein, Babul...these classics have captured the attention and hearts of millions of viewers because the Quality and depth of characters were much developed. There is much too much obsession with violence and cheap sex lately in Bolllywood movies. Naturally this is an American influence, which cheapens and degrades the quality of the films produced recently in Mumbai. I would hope that in the near future, the directors and producers of these films will take more time to fine-tune and develop a story line and characters that will continue to inspire the audience to heal, forgive, and love, by bringing more spirit and soul into these films."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "A-Thunder",
        "review_rating": "8",
        "review_title": "Captivating Retelling of Romeo and Juliet",
        "review_detailed_main": "The filmography absolutely captivated me - the lighting, pacing, movement, and grit - all of it! There were moments that felt like they were straight out of a fairy tale, and other moments that felt raw and harsh. The swing between each extreme added an extra weight to the story we all know. Although this tale has been told multiple times and in numerous ways, I believe this will be the version that sticks with me. The charisma between the actors felt palpable; the playful banter and looks seeped with charm. I appreciated the fleshing out of the characters too, and the way the story uniquely made not only their love and propensity for peace a strength, but also managed to highlight their innocence and playfulness as strength too - all without taking away from their intelligence. With just enough twists throughout this tale to keep the story fresh, I held on to hope for an alternative ending other than the one that's been immortalized. Nevertheless, the expelrtful suspense managed to break my heart all over again."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "macheteboring",
        "review_rating": "1",
        "review_title": "crazy movie with even a more crazy ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "jen-122-636160",
        "review_rating": "9",
        "review_title": "Really really liked this",
        "review_detailed_main": "Obviously - this is Romeo (Ram) and Juliet (Leela), done as a Bollywood extravaganza. I really liked it. They stayed true to the original story line but also borrowed heavily from West Side Story in a way that made for a really nice blend. In fact, the dominant influence appeared to be West Side Story - and not just because it's a musical.\n\nIt was also VERY sexy. But in a comical way. Our main characters would roll about in a state of near undress kissing, and then burst into song & dance. It's a Bollywood movie - it is what it is.\n\nI have to say - I loved Ranveer's look. Nearly naked, he looks like Adonis, and his mustache was wonderful. It's a really good look for him. More men should wear mustaches like that and I am not normally a mustache fan. He's made me one. His opening dance sequence was over the top fabulous.\n\nI enjoyed how they would occasionally speak in rhyme - basically translating some of the most famous lines from Romeo & Juliet into Hindi poetry. I thought that worked really well and it was delightful and helped anchor the movie as a proper retelling of Romeo & Juliet. When you see Romeo & Juliet - there are certain moments you need to hear. Certain lines that are classic and oft quoted, and they provided those moments in this movie with those bits of poetic rhyme. I thought it was an excellent artistic choice and again, helped to ensure that we knew we were watching Romeo & Juliet as Ram & Leela.\n\nI also liked the fact that the head of the \"Capulet\" family in this movie was a woman. She was nasty and mean and sympathetic and extremely well acted by Supriya Pathak Kapur.\n\nDeepika is wonderful, but she's Juliet - so her job is to fawn over Ram and be constrained by her family. She does it well - and her - are you coming to bed now that we are married sultry bed dance in white scene - wow - she is a REALLY good dancer. That was her main stand out moment.\n\nRicha Chadda - as Leela's sister in law (the Rita Moreno character in West Side Story) was also excellent. The women in this movie carried the movie. Aside from Ram - all the other men were basically interchangeable. Anyway - Richa's big moment - looking for Ram but getting harassed by Ram's men is straight out of West Side Story and again, I thought they captured the look and feel of that really well - it was a great echo of West Side Story - that sets us up for the rumble to come.\n\nThe rumble was well realized and beautifully shot. How the heads of family are turned to call off the fighting and the tragic deaths of Ram & Leela had me crying at the end. Any movie that makes me cry is a good movie as far as I am concerned."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "shankr-bgs",
        "review_rating": "1",
        "review_title": "A Great Disappointment for Ranveer fans",
        "review_detailed_main": "I couldn't imagine both the lead pair actors in such a distressing film. I would also mention that the role play was also not apt for either of them and Ranveer was too over acting at certain shots. At the whole it was a total disappointment to all the fans. Expected a lot from the film since its promotion which failed to deliver. Ranveer has to choose for selective roles as he is one of the best actor. Deepika's role is also great disappointment for the fans. At certain shots even Deepika failed to deliver. I hope Ranveer to go for a better film with good storyline and thrilling plot. Movie lovers may also find it a great disappointment."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "erosnowmumbai",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "Very well made by Bhansali. Brings out the brilliance in the story. Definitely recommend to watch."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "mr_zain93",
        "review_rating": "4",
        "review_title": "Turns out rather cheap and vulgar..",
        "review_detailed_main": "Sanjay Leela Bhansali has made a lot of great films , so I was really expecting something good out of this one as well..but unfortunately I was hugely disappointed , as it turned out to be one of the worst movie of 2013..it definitely wasn't SLB's standard..weak story-line , inconsistent screenplay..even the performance were just strictly average..\n\nThe only saving grace of the movie was it's music , which I believe was one the best of 2013...but unfortunately music alone isn't enough to save a movie , and that is exactly the case with Ram Leela..\n\nWhat surprises me though , is that why is this movie so overrated? Won so many awards it didn't deserve to..Deepika was strictly average , and didn't do anything special to make her performance award-winning worthy..the only actor which stood out was Supriya Pathak , as her the role seemed tailor made for her..\n\nSo , If you don't mind watching a movie just to past your time and listen to some good music , without giving a damn about it's pathetic story , Ram Leela just might be for you..or else , please ignore it.."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ajaybaliyan",
        "review_rating": "9",
        "review_title": "A Grand Entertainer",
        "review_detailed_main": "Sanjay Leela Bhansali is back with a blast with a Desi touch of Gujarat & Rajasthan.Deepika gorgeous as ever and Ranveer is improvising with every movie and going to be perfectionist in future.Each shot of movie is masterpiece and you can hang it like paiting in home.The movie reminded of Mudghal-E-Azam when compared to sets and the style.....I hope same with Padmavati also"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "leonardodavinci-10677",
        "review_rating": "3",
        "review_title": "Poor movie",
        "review_detailed_main": "People love the grandeur, grand sets of Mr Bhansali. But more than that people like Movie - the art. This movie is grand empty vessel. Fragmented story, Cheesy - cheap rhyming dialogues, no chemistry between leading pair except for lust. Do not watch in the name of 'Romeo and Juliet', No it's not adaptation of Shakespeare's Magnum Opus. Do not waste time."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "santubhattacharjee",
        "review_rating": "9",
        "review_title": "When it's Bhansali, you're bound to have a masterpiece",
        "review_detailed_main": "There was so much talking about this film. Someone told me about lack of plot, too much violence.. whatsoever I haven't seen the movie so far. Today I just wanted something good to start the year with. Ram-Leela didn't disappoint at all. Acting and production design was absolutely amazing. Best thing is the 'Deepveer' chemistry. It was mesmerising.\n\nMovie ended on a sad note that has made my eyes water but nevertheless, the larger than life portrayal of fictional society definitely leave you at awe.\n\nFull marks to the director to make everything that convincing. Music is definitely a great addition. Arijit's 'lal ishq' always stays at the top of my playlist. Happy to see Deepika and Ranveer showcase a great trailer of their love story that has made history now."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "winak",
        "review_rating": "4",
        "review_title": "Ishaqzaade-Part 2 ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "sweathar",
        "review_rating": "10",
        "review_title": "Beautiful movie",
        "review_detailed_main": "This film presented a fresh take on the classic Romeo and Juliet in the Indian scenario by the master filmmaker SLB. The expectations from him were at an all time low after 2 back to back duds. But this film made up for it all. SLB is back in his elements. He sets his own unique world and gives us an array of living breathing, passionate characters who take the movie forward.\n\nThe film also gives to Bollywood a fresh pairing of Deepika Padukone and Ranveer Singh who give smashing performances as Leela and Ram. They portray the role with much ease and the audience are taken in by the love story . They take chemistry to new heights which eventually is showcased at full potential with kiss.\n\nThe colorful sets, the attention to detail and SLB's hawk eye vision gives us many breathtaking visuals . The songs infused with the Gujarati flavor are clicks instantly and leaves a lasting impression.\n\nSLB has put an amazing cast together, Supriya Pathak gives a wonderful performance as Leelas Mother Dhankor, Gulshan Grover, Richa chaddha, Barkha Dutt and Sharad kelkar does their part. Costumes by Anju modi deserve a special mention."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rohitkatbamna",
        "review_rating": "3",
        "review_title": "one of worst movie ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "wk-78407",
        "review_rating": "8",
        "review_title": "Dialogues are really good",
        "review_detailed_main": "Dialogues are very nice of the film. Story is good too though it has too much violence. Deepveer chemistry is magical"
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "shalaka_shank",
        "review_rating": "1",
        "review_title": "waste of time",
        "review_detailed_main": "I just viewed this title in theater. Felling so boring. As growing old, Bhansali turns idiot director. I cant imagine that a girl wants to make love with his lover even not passed hardly a day to death of his own brother. Big shame to such a idea to present on now a days youth. Is this culture ? other bad points are : heroine is not suitable to this role, audience only see her beauty but one with mind cant digest her with the role of Don ! There is no powerful villain to oppose such loving couple ? Half of movie is showing only 'guturgu' of this bloody couple who only hungry for sex ! To see their lusty chemistry is not easy even for alone audience too. Then how can a family see this movie together ? Only young couple will enjoy. Moreover name \"RAM\" is used as hero's name who are selling and watching blue films .Where are 'Sanskruti ke Rashak' in India ? Dialogues are vulgar. Acting and physical movements of leading pair also are vulgar. I am giving 1 star for outstanding movie for bad performance."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "naanin-12258",
        "review_rating": "10",
        "review_title": "Be honest",
        "review_detailed_main": "This movie was a Masterpiece, you could feel love excitement Passion loyalty happiness and sadness power and weakness\n\nIt needs more attention despite that it was the beginning of another true love story while it has been ended opposite!\n\nBut sadly i saw some indian movies that were so normal such as Love-Li but it has 9 -_- please be more honest and even watch it more to see each time you will enjoy it\n\nI think the indian voters only vote for happy ending while it mentioned that inspired by romeo and juliet Me bymyself live happy ending too but the quality of this movie? I can not deny\n\nRespect for director and actors and other creators of the loyalty."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "AD21",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "This was the worst movie I have ever seen... the story line is so stupid... can't tolerate this good for nothing Ranveer singh."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "jainveenit",
        "review_rating": "3",
        "review_title": "It is a violent SEX movie",
        "review_detailed_main": "To be be very true the movie i think is about violent sex and grand sets, that all. I think this types of movies should be banned in India or at least should not be allowed to market in the main stream media.\n\nPlease its a request to all the directors and producers to please make some sensible movies with real content and stupid sets, sex or fashion. I wish they would listen to me. Anyways I would not spend my time and money for this movie.\n\nI hope sanjay leea bansali listens to the audiences and create more movies to appeal masses and not just few so called upper middle class. I was was upset to see the movie. I had very high hope from based on its trailers. Alas! the movie is a waste."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "5",
        "review_title": "Copied from Romeo Juliet,but misses its soul",
        "review_detailed_main": "No chemistry felt at all. Supporting actors performances are praiseworthy. Music is good. Not a Ranveer Singh type of movie."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ross-brownfield",
        "review_rating": "3",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "amalrocks_11",
        "review_rating": "3",
        "review_title": "Good sets awful storyline fails after the first 25 Mina",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "omairfarhan-70986",
        "review_rating": "5",
        "review_title": "Time Pass",
        "review_detailed_main": "The storyline of the movie cannot be criticised as its based on the William Shakespeare's play Romeo and Juliet. The set was very well developed and was very attractive. Engaged the audience with the love spark created by the character's performance. However Low rating as too much was cluttered up and was not carried to the conclusion properly."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "willcundallreview",
        "review_rating": "4",
        "review_title": "A poor Bollywood re-doing of Romeo and Juliet",
        "review_detailed_main": "Goliyon Ki Raasleela Ram-Leela is a Bollywood movie that is one, based around the story of Romeo and Juliet, and two is quite a mouthful. The film features everything from big dances to kind of crazy songs and to say this is supposed to be one of Shakespeare's tragedies well then it sure doesn't feel like that. The film is set around the 500 year old feud between two clans, the Rajadi's and the Sanera's and both although maybe don't go to war with each other, if you cross the dividing line between the two's areas, you're in big trouble.\n\nThe story plays out a bit insanely, at 155 minutes long it feels stretched out and even for a Bollywood movie this is just too long for what material it has. The story flies around the place and never settles down and even at times can become increasingly confusing as well with the entire crazy goings on that happen. The characters of Ram Rajadi(Romeo) and Leela Sanera(Juliet) are unlikeable as the two leads, the chemistry doesn't light a match, it's dull and especially in the case of Ram where he is not a likable person from the first time he rides in on his motorbike.\n\nRanveer Singh plays Ram and is not that great in the role, like I said fails to create a person you can like, sure at the beginning he is meant to be unlikeable but over time you are meant to get to connect with him more. Deepika Padukone is slightly better in the role, still not so so likable but she still does a job that she manages well. She really excels when she gets into a position of power in the movie, where no one can tell her what to do and what to think, she becomes a better actor when she is shouting I swear.\n\nThe director Sanjay Leela Bhansali is behind the helm on this movie and I feel he fails to do what he usually has to do in the movies he makes. It's the pure emotion that is lacking here and the love side of things just never works, we never feel bad for any character nor that happy and when we should be rooting for certain people, it just never materialises. He co-writes the movie as well and although the script isn't horrific, well it isn't much to shout about either way, the movie suffers from basic dialogue and some over dramatics that just make this feel silly but not in a fun way.\n\nI'll give the film credit where it's due some, it's shot well and the choice of camera angles is done well so that at least the movie is trying to show you some raw emotion of the characters involved. I liked the settings too, the shots taken in Udaipur are purely beautiful and the film definitely uses it's backdrop to great effect. The parts mostly shot in Gujarat are beautiful too, some of the movies scenes get a little confusing where suddenly a character is in the desert but all in all it looks great.\n\nOverall if I had to point to an adaption of Romeo and Juliet it wouldn't be this one although I can't say I have ever seen it done in such a fun kind of way. The choreography is nice there is no doubt all though the songs are not always fantastic, if the movie has made the characters more developed (which they could have in such a long film) then the movie would have been so much more lovely and we could have maybe actually felt something for the people who get very emotional in this movie."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "vibha101",
        "review_rating": "5",
        "review_title": "Beautiful but unnecessarily dramatic",
        "review_detailed_main": "Sanjay Leela Bhansali has made quality films that range from Hum Dil De Chuke Sanam to Devdas to Black. Ramleela as beautiful a movie as it was, did not compare to his previous exceptional works. The set and the execution of the film itself were colorful, vibrant and visually stunning. This movie had the potential to be ranked along with his previous works, however an unnecessary level of drama was added simply to appeal to the masses and raise box office numbers. His previous works have been lengthy, but was not realized as much as it was in this film. Although the story was based on Romeo and Juliet, a story so heart wrenching and beautiful, the additional and unnecessary elements took away from the purity and beauty of the story. The directive style did not seem to be consistent throughout as there were scenes that seemed to be out of place with the overall spirit of the film. The film could have been much shorter and more impacting had some of the scenes been eliminated. Most of the dialogue was well written, however some parts were rather meaningless. The acting in the film however does deserve credit, particularly Deepika, Ranvir and especially Supriya Pathak. Supriya was extremely convincing in her role and played it amazingly well. Ranvir and Deepika were well paired and rather brilliant in executing their roles. I do feel that the roles could have been slightly refined in their nature, but for what the roles were the audience will definitely be able to feel the emotions they convey. Although the film did not live up to Shakespeare's epic Romeo and Juliet story, as the audience we are definitely able to feel overwhelming emotion throughout, which I think is one of its successful attributes. Overall, the film is well made, entertaining for the most part, heart felt because of the acting and beautiful at its core after the elimination of various extra \"filmy\" attributes."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "aharnish",
        "review_rating": "5",
        "review_title": "Another debacle from SLB",
        "review_detailed_main": "Mr. SLB wanted to make another movie after great debacle of SAWARIYA & GUJARISH. He ponder over, over and over and then wrote a script , which he damn cared to be full of sense as he was confident enough that he would make out of world SETS. Then for obvious reason a music director was needed to make a movie for that also he damn cared and did that himself as he was confident enough that he would make out of world SETS. Then for obvious reason dialog were needed to make a movie for that also he damn cared and do this himself as he was confident enough that he would make out of world SETS. After his previous back to back debacle , he left no stone unturned and use as MIRCH MASALAS OF B grade action scenes, B grades dialog and some of very B grade story building sequences. In fact he made very GOOD MOVIE SET and for displaying that set he arranged one Hero and heroine with a veneer of acting. Apart from GREAT SETS another one saving grace was panache role played by PATHAK and gorgeous DEEPIKA. For me he was always a overrated director and this movie boost that perception only."
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "ElenaKhanxox",
        "review_rating": "",
        "review_title": "loved the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2215477",
        "movie_name": "Goliyon Ki Raasleela Ram Leela",
        "movie_rating": "6.4",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "Ram-Leela",
        "review_detailed_main": ""
    }
]