[
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "vierlix",
        "review_rating": "2",
        "review_title": "Truly a cinematic milestone.",
        "review_detailed_main": "So there's an old security guard and a guy who dies and then there's KEVIN, the world's biggest wuss. Kevin wants to impress his incredibly insensitive, bratty, and virginal girlfriend AMY. As he returns from work to... a random house... he finds his \"friends,\" the sexually confusing red-shorted KYLE and the truly revolting sluttish DAPHNE. They are soon joined by Daphne's boyfriend, the trigger-happy sex-crazed macho lunkhead NICK. And there's the title creatures, horrid little dogeared puppets who kill people by giving them their heart's desire. Kyle's heart's desire is to mate with a creepy, yucky woman in spandex. Nick's heart's desire is to throw grenades in a grade school cafeteria-- I mean nightclub. Kevin's heart's desire is to beat up a skinny thug with nunchucks. Amy's heart's desire is to be a disgusting slut. Daphne's already a disgusting slut, so she doesn't have a heart's desire. Along the way a truly hideous band sings a truly odd song. The hobgoblins randomly go back to where they came from then blow up. \"Citizen Kane\" cannot hold a candle to this true masterpiece of American cinema."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Aaron1375",
        "review_rating": "1",
        "review_title": "This Movie fails...on so many levels.",
        "review_detailed_main": "No matter how you look at this movie, it is just awful.\n\nIf you view it as a horror, then it is an unscary movie with the monsters being hand puppets.\n\nIf you look at it as a comedy, then you will notice most of the humor falls flat and is just lame.\n\nIf it is a romance you will wonder why a guy would stay with such a B**ch!\n\nIf you look at it as an action you can't really pull for the whiny hero.\n\nAs you can see this movie just fails to deliver anything remotely entertaining. As mentioned the monsters are obvious puppets and this film was another attempt at a Gremlins type movie. This however has the worst looking monsters of that genre. Critters looked pretty good, so did the Ghoulies, heck even the puppets from the Munchies looked better than these. The characters in this film are thouroughly unlikable. The hero is a whiney security guard, his girlfriend is always complaining, they have a tramp friend who has a jerk military boyfriend, and another friend who is a spaz. At one point in the movie the hero and the military guy fight with rakes...this movie is just utterly stupid. I like the scene when they are in the dreaded club scum (which is obviously not a club, but more likely a diner) and the hero tells the waitress that none of them are 21. Give me a break, I am 25 and I look younger than any of them."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Gislef",
        "review_rating": "2",
        "review_title": "A Rip-off of Rip-offs",
        "review_detailed_main": "If movies like Ghoulies rip off Gremlins, then Hobgoblins sinks to the new low of ripping off garbage like Ghoulies. These barely-animated furbies have some kind of scheme to fulfill fantasies (which involve basically groteque characters' sex dreams - oh joy), but what that has to do with anything is anybody's guess, except to let the director indulge his kinky penchant for erotica. They show this down in the 8th circle of Hell, one suspects. There's no real plot - just \"goblins - kill!\" and feeble attempts at humor and a mild attempt to arouse the viewing audience."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "super_harry",
        "review_rating": "1",
        "review_title": "Cinemantastic Disasterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "stormofwar",
        "review_rating": "2",
        "review_title": "Things I learned watching \"Hobgoblins\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "axeman-9",
        "review_rating": "1",
        "review_title": "Call the Fashion Police, there's a crime in progress!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Platypuschow",
        "review_rating": "3",
        "review_title": "Hobgoblins: Hardly a worst ever....",
        "review_detailed_main": "Hobgoblins currently sits as the 30th worst movie ever made on IMDb and lets be clear it's terrible.........pee poor stuff that makes the average cheesy 80's movie look artistic.\n\nIn a cross between Critters, Gremlins & an ounce of Wishmaster this creature feature doesn't deserve its place on that list and I'm baffled why it's there. Movies on that list are usually there because of an actor/actress (Paris Hilton) because it's got a gimmick or an angle that upsets people or non-existent production values.\n\nHobgoblins isn't worth your time but one of the worst films ever made? Hardly."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "khudak_2000",
        "review_rating": "1",
        "review_title": "80's cheeze that has to be seen to be believed!",
        "review_detailed_main": "Hobgoblins....Hobgoblins....where do I begin?!?\n\nThis film gives Manos - The Hands of Fate and Future War a run for their money as the worst film ever made. This one is fun to laugh at, where as Manos was just painful to watch. Hobgoblins will end up in a time capsule somewhere as the perfect movie to describe the term: \"80's cheeze\". The acting (and I am using this term loosely) is atrocious, the Hobgoblins are some of the worst puppets you will ever see, and the garden tool fight has to be seen to be believed. The movie was the perfect vehicle for MST3K, and that version is the only way to watch this mess. This movie gives Mike and the bots lots of ammunition to pull some of the funniest one-liners they have ever done. If you try to watch this without the help of Mike and the bots.....God help you!!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "atogcheese",
        "review_rating": "1",
        "review_title": "Can you catch a venereal disease from a movie?",
        "review_detailed_main": "This movie is not just bad, not just corny, it is repulsive. Something about Daphne, about the creepy call-girl, about the whole damn (and I use the word literally) film radiates a grotesquery that would offend a brothel mistress. This film makes my skin crawl, makes me regret having reproductive organs, and makes me feel unclean.\n\nOne of the things that bothers me most about this movie is that they used such a good concept. A creature that makes fantasies with disastrous results, rather than the cliché Worst Nightmare and the overdone Twisted Wish, is a truly fascinating film idea.\n\nThought: The reason why hobgoblins need to be killed before day is that they are attracted to bright lights. During the day, bright lights don't show up well, so they could go anywhere.\n\nCount the Hobgoblins: Four hobgoblins drive out of the film studio, and yet at least nine of the pernicious plush-toys are killed throughout the course of the movie.\n\nDiscussion Question: If you had a frigid, demanding, unappreciative girlfriend, would you enter garden-tool-combat with a military chunkhead? Explain."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "sebpopcorn",
        "review_rating": "",
        "review_title": "Desperately unfunny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "athies",
        "review_rating": "1",
        "review_title": "Simply Awful",
        "review_detailed_main": "How Rick Sloane was allowed to make five movies is harder to believe than cold fusion. This film is absolutely criminal. Before watching this movie I thought Manos: Hands of Fate was the worse piece of crap I ever saw, but at least Manos moves so slowly you might fall asleep, thereby rescuing your eyes from the pain it will suffer. The greatest tragedy of this movie is that the old man that keeps the Hobgoblins \"locked\" up makes it to the final scene. The time I spent watching this movie was an absolute waste of my life."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Hallur-2",
        "review_rating": "10",
        "review_title": "Super Movie",
        "review_detailed_main": "Hobgoblins is without a doubt one of the best movies I have ever seen. The storyline is compelling, the special effects are breathtaking and the fight scenes are very original and well made. This is definitely one of the movies of the century. I give this movie 10 and readily recommend it to anyone."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "leavethebronx",
        "review_rating": "7",
        "review_title": "This movie is NOT that bad",
        "review_detailed_main": "The fact that this movie is higher on this list than \"Monster A-Go-Go\" AND \"Castle of Fu-Manchu\" is a travesty. I mean, this movie was a riot. Sure, it wasn't great, but it wasn't THAT bad. I mean, at least it's watchable! \"MAGG\" is absolutely wretched in every aspect. The lighting is atrocious, the dialogue is incomprehensible (of course, that's a good thing, right?), and the plot makes no sense whatsoever. I would watch \"Hobgoblins\" without MatB and still enjoy it. But...shudder...\"MAGG,\" even WITH JatB is like torture of some sort. So I proudly give this movie a thumbs up. Everyone unite, put \"Monster A-Go-Go\" where it belongs! \"Hobgoblins,\" \"Space Mutiny,\" \"Soultaker,\" etc...these movies aren't THAT BAD compared to the horror that is \"Monster A-Go-Go.\""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "thedondo",
        "review_rating": "2",
        "review_title": "A unique movie and not in a good way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "lemon_magic",
        "review_rating": "",
        "review_title": "Not only fails on every level, it invents new levels to fail on!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Xophianic",
        "review_rating": "1",
        "review_title": "The worst movie of all time!",
        "review_detailed_main": "Ever seen a movie that actually caused you pain to watch? This is movie is the poster child of that. The only reason I watched it at all was because it was on MST3K. HOBGOBLINS is without a doubt the worst movie I have ever seen in my entire life.\n\nThe story is stupid, so I won't go into much detail. I don't really remember many of the characters anyway. A loser named Kevin (Tom Bartlett) is trying to make his annoying and non-supportive girlfriend proud of him, so he takes a job as a security guard and unleashes a band of stupid-looking puppets called Hobgoblins, who kill people by giving them what they really want. The way this leads to people getting killed is very idiotic. The hobgoblins go on a rampage which results in one guy getting hurt a little and a car getting destroyed. The ending is also stupid and not worth bringing up.\n\nThe acting is the worst I have ever seen. None of the actors went anywhere after this movie, nor did any of them deserve to. The special effects, if you can really call them that, were unforgivable. The hobgoblins themselves are the most fake looking puppets I have ever seen.\n\nUnless in MST3K, this movie should be avoided at all costs. I am only praying that some day the government will burn every copy still around, or maybe use it as a weapon in the army someday."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Oosterhartbabe",
        "review_rating": "1",
        "review_title": "Hobgoblins, Hobgoblins, what do you do with those hobgoblins....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Jordan_Haelend",
        "review_rating": "2",
        "review_title": "A waste of money, time and resources",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Mister-6",
        "review_rating": "1",
        "review_title": "Big hair, spandex, \"Hobgoblins\" - 3 bad things about the '80s!",
        "review_detailed_main": "For starters, \"Hobgoblins\" tries to ape the more successful \"Gremlins\". That's bad enough but they don't even try to make anything that closely resembles a movie here. Instead, it's more like a bargain basement, everything-must-go clearance of embarrassing scenes, inappropriate sound FX, acting as bland as unflavored tapioca and a script that takes everything humans hold sacred in their motion pictures and throws 'em down the old tube-aroo.\n\nThe plot? Grrrr.... Meddling kids track down gremlin-like creatures from movie lot before they kill people by projecting their fantasies. Sound cool, does it? Well, see that wall on the other side of your room? Run right at it, top speed, face first. See, THAT is cooler than this movie.\n\nYou dare to doubt? Quick, name something else one of the leads has been in other than this. What other scripts have the writers done since \"Hobgoblins\"? Name another Rick Sloane directoral effort. How many \"Hobgoblins\" action figures do you have? See? THANK you.\n\nI cannot believe I took so long to write about such a horrible film. I'd rather write about more important things; like the separation of church and state, economic restructuring in Europe, that kind of thing. But no, \"Hobgoblins\" it is and it is bad - bad like your grandparents' wallpaper, bad as pink flamingos on your lawn, bad like underwear that says \"Home of the Whopper\"...and I think we'll stop there.\n\nWell, Mike and the robots fight valiantly but try as they might, they can do only so much with \"Hobgoblins\" before they realize that, yes, the director DOES need kicked in the shin.\n\nReal, real hard.\n\nOne star for \"Hobgoblins\", seven stars for the MST3K version."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "vertigo_14",
        "review_rating": "1",
        "review_title": "Why would Rick Sloane think this merited the need for a sequel?",
        "review_detailed_main": "Wow, I just finally managed, after several attempts, to finish watching this god awful movie, only to learn that Rick Sloane and his production team have completed a straight-to-video sequel this year.\n\nOf all movies reviewed by MST3K--and they truly dig from the bottom of the barrel, screening the reputationally bad 'Manos,' 'Werewolf,' 'The Incredibly Strange,' and the lesser know disasters like 'Laserblast,' 'Zombie Nightmare,' and 'Time Chasers,'--this certainly has to be the absolute biggest pile of garbage they'd ever shown (which makes it perfect for riffing). Very simple, the movie is about a bunch of Munchies-like gremlins on the loose, exploiting people's desires for fame, fortune, prowess, and of course, sex in ways that end up with people getting killed. But this is the kind of movie where the acting is so ridiculous (a test of machismo, for example, is illustrated by two guys who battle in the front yard with garden tools), the writing is so forced (such as the oft-described scene of a gremlin hanging on the arm of one girl who would notice it, if only she turned her head a quarter to the left... and this isn't the first time in the movie this happens), and the story is so... rarely given attention (hence the MST3K riff about a \"law in the future where films have to be made by FILMmakers), that you actually root for the furry puppets to kill off everyone on screen. Worst movie... ever."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Nightman85",
        "review_rating": "1",
        "review_title": "this summary line contains a better plot...............and better everything for that matter.",
        "review_detailed_main": "Little furry monsters escape from film vault and it's up to some idiot teens to save the day! It ends up at a strip-bar.\n\nAbsolutely lame trash horror of the 80's, Hobgoblins is one of the worst excuses for a horror movie ever made. Hobgoblins has one flat-liner of a story, some hilariously awful 'special effects', stupid attempts at juvenile humor, a painfully bad cast, and not a bit of talent in sight. Want to know what the FX of this movie consists of? It's basically people rubbing plush 'creatures' on over-acting teens, that's the kind of cheap happenings here.\n\nBelieve me, Rick Sloan should be ashamed of himself!\n\nBOMB out of ****"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "thor-teague",
        "review_rating": "1",
        "review_title": "Two words: train wreck",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "seriousfilmcritic97",
        "review_rating": "9",
        "review_title": "An inspired statement on the dangers of inner desires",
        "review_detailed_main": "At first a held certain reservations against watching a film with what appears to be a no-brainer title for a film about the very same beasts, but sometimes the direct option is the best.\n\nStarring Tom Bartlett as Kevin, a young and brave assistant security guard, and Jeffrey Culver as McCreedy, the wizened old security guard who has seen too much, \"HOBGOBLINS\" takes us on a horrifying journey to the realm of the darker aspects of human consciousness made flesh. After a lengthy but suspenseful tour through the corridors of a mysterious storage facility, a group of frightening creatures known as 'hobgoblins' are released from a wicked bank vault within the facility. These demonic beings posses the ability to take the lives of humans by making their innermost wishes come true, hover at human shoulder height at will, and drive golf carts. What follows is a twisted ride into the psyche, as a gang of hormone-laden teenagers witness the horror of the hobgoblins, and their own inner selves.\n\nWriter/Director/Director of Photography/Editor/Producer Rick Sloane allows the audience no pause from the terror of the sickening creatures, and the atmosphere and execution is overall spot on. Forgivably Freudian, the movie posits that when the primitive urges of the id infect the aspirations of the superego, what wishes we hope to fulfill will inevitably doom the self, but through the use of rationality and technology, even the most misguided soul can be retrieved from apparent demise.\n\nUnfortunately, the film is held back from inducing true insight in its audience due to some unfortunate use of prosthetic eyebrows on Mr. Culver. This distracting little mishap did cost the film one star in this review.\n\nIn the end, \"HOBGOBLINS\" left me with an optimistic view of humanity. For if we can successfully survive the onslaught of such abominations that attempt to let our darker selves consume us, what else is there that could truly destroy us? I found the title ultimately an impeccable choice, since as we all know: hobgoblins are more introspective than regular goblins.\n\n*********/10 stars."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "jimy23",
        "review_rating": "1",
        "review_title": "I saw the Original version.",
        "review_detailed_main": "I know the most common version Is The MST3K one But I saw not only that Version but the Original. There are a few parts edited like MCcreedy's bosses scenes were cut Kyle's first phone sex call Kevin telling him that he's got a ton of phone bills for the sex hot-line not knowing Kyle is the reason and Nick suiting up for his grenade throwing spree. This is just to weird to understand it has so many plot-holes a pointless rake fight that seems like it goes on for ten minutes The Hobgoblins don't appear in till 20 or so minutes into it. The movie just makes no sense 1 person dies in a very cheesy way maybe two Nick's sergeant gets blown up but he could have been an illusion. The Hobgoblins can cause people to see things but other people can see someone else's illusion which is solid to other people to. This is easily one of the cheesiest movies i ever saw The beginning is weird the middle is Boring and unintentionally funny and the End has to be seen to be believed MCcreedy could have blown up the vault at any time so he's responsible for the whole movie. If that isn't enough there a part were some one is being fanned with a bottle acting like there getting hit an extra tipping there table over to make a chase look more wild."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Bumblevivisector",
        "review_rating": "1",
        "review_title": "How to convey just how bad this is...",
        "review_detailed_main": "I can't review this without mentioning MST3K, since even a tenth of the reviews and responses this film has received would not be here if Hobgoblins hadn't been featured in their 9th season. As of this writing, it's still available on DVD in Rhino's MST3K volume 8 boxed set. While there's no official consensus, I believe that this it the only true \"Maw of Hell\" caliber film they did for Sci-fi channel (see the Amazing Colossal Episode Guide). While most movies in that category tend to come from the the mid 60s (the oily period), this one from the 80s was far more excruciating for me since that was the decade of my childhood. Nearly every positive memory of 80s pop culture was unearthed, beaten with garden tools, urinated on, and then reburied in a humorous position. And I wasn't even one of the badly scarred viewers.\n\nSince there are already over 150 reviews of this film on this site, they probably don't need another synopsis of this movie. To explain just how bad this movie is, I need to tell a story of the second time I saw it with a group of people, in the spring of 2000. I'd already shown these three friends half of Rhino's then released tapes, including Manos, Eegah, and Red Zone Cuba, all Maw of Hell caliber. It was a Friday night, so we stopped after the first quarter to watch Space Ghost, and the second for Gundam Wing, so the wretchedness unfolded upon them slowly. With no show to pause for after the third quarter, I made to fast forward through the commercial, only to be halted by their cries, begging me to stop. The youngest among us was actually curled into a fetal position, shuddering. They implored me to just give them a few minutes to recover, to which I responded, \"Oh, well I know it's bad, but I guess I may be a little desensitized since...\" Now these people were close friends with whom I had shared much, like confessing attractions to various cartoon characters as 3:00 AM, and my most bizarre substitute for toilet paper I've ever resorted to story. So I had freaked them out routinely in the past, but when I finished that sentence with \"...I've already seen this 3 or 4 times.\", that was the only time in my life that I have looked into the faces of other human beings and seen genuine horror. If you were just going by their reactions, you'd have sworn I'd said something more along the lines of, \"Well, I know live puppies SEEM hard to chew at fist, but after my dog had her third litter...\" And this was the MSTed version. I shudder to think of the effects of the uncut version, especially for the MST crew themselves, who had to watch this 10 times in a week. I'm not sure the show completely recovered after this; a little of the love seemed to be gone.\n\nSo like I said: read other reviews for a synopsis. The point of mine was to warn all novices to watch as many other MST3K episodes as possible to soften the blow of this one. I've seen evidence of short-term mind-warping in viewers who made this their first MST, and long term trauma in those who actually watched the regular version. Follow these guidelines, and you'll find it a least as funny as it is painful."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "icehole4",
        "review_rating": "3",
        "review_title": "Gremlins did something similar, but a lot better.",
        "review_detailed_main": "Hobgoblins is a very cheap and badly done Gremlins rip-off. That's the best thing one can say about this stinkpile. Pretty much everyone in the cast was chosen for their looks and not their acting ability. It was very painful to watch.\n\nAvoid this one at all costs."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "It's horrible, but at least it never takes itself very seriously.",
        "review_detailed_main": "This is a very, very bad film but I can't bring myself to give it a 1 simply because the film never takes itself seriously. It realizes it's garbage and makes no apologies--a bad movie that never tries to be anything more! The film is about an old movie studio that's no longer functioning. When young guys are given jobs here as security guards, they have a habit of dying--and the old guy working with them doesn't do a whole lot to stop this until our hero (i.e., a big wuss) saves the old guy and the oldster tells him about the hobgoblins that live there. These creatures grant people whatever wish they want but end up killing them in the process. A not particularly good deal if you ask me. When these things get loose and attack the neighborhood, it's time to destroy these malevolent pests.\n\nThe film is an obvious knock-off of GREMLINS, though with practically no budget and actors who are ALL worse than Zack Galligan!!! But the most hilariously bad part of the film are the hobgoblins which are nothing more than cheap puppets--not much more realistic than ones kids might get from Toys R Us! They obviously are not animated in any way and flail about like stuffed animals--really, really crappy ones.\n\nOverall, there's really not reason to watch this dumb film unless you are a masochist who likes bad films! Don't say I didn't warn you!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "movieman_kev",
        "review_rating": "1",
        "review_title": "truly awful, but Sloan's Vice Academy films are worse",
        "review_detailed_main": "A group of extremely unlikable A-holes are tormented by lame puppets that some elderly douche bag night-watchman has kept locked away in a film vault for twenty years for no reason whatsoever.\n\nMany people know this film merely from MST3K's spot-on ribbing of the flick. But I've seen the actual movie and can safely say that yes it's bad, really, REALLY bad. From the one of the most awful 'fight' scenes I've ever witnessed to the stuffed toy 'aliens' that suffer from a lack of motion (I had a My Pet Monster that was scarier) right up to the atrocious acting (I had a My Pet Monster that was more charismatic) However, that being said Rick Sloan's \"Vice Academy\" films are somehow, and trust me I have no earthly idea how, much worse. That's not to suggest that this film is anything but crap, because it isn't. Just throwing it out there.\n\nEye Candy: no nudity in the movie proper, but there's 2 pairs of tits in the DVD Introduction to the film\n\nMy Grade: D-\n\nRetromedia DVD Extras: Introduction by Jim Wynorski; Stills gallery; and Trailer for this film"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Really, really bad",
        "review_detailed_main": "I do agree Hobgoblins is a terrible movie. But the worst movie ever made? Not for me. However, that isn't saying much, it is a milestone in film-making but not in a good way. If you want every single thing that makes a bad movie bad, look no further than Hobgoblins. Look for the ropey effects. Look for the poorly designed Hobgoblins, who aren't scary or funny in the slightest. Look out for terrible dialogue. Look out for incoherent storytelling. Look out for non-existent direction. Look out for bad pacing. And to add further insult to injury, look out for horrendous acting. Hobgoblins has every single one of those. In conclusion, terrible and one of the nadirs of the 80s along with Garbage Pail Kids Movie. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "catheadcatheadcathead",
        "review_rating": "1",
        "review_title": "As they say in Quake II, \"kill me, now\"",
        "review_detailed_main": "I really don't have anything new to add but I just felt like I had to comment on this sack. So here goes:\n\nAtrocious. I'm running through my MST3K DVD collection again and I just watched Hobgoblins for about the 10th time. It's really, really painful but it was next on the list... You can see that there is a tiny kernel of an actual movie buried under all the crap that is \"Hobgoblins\" but it just couldn't get out. Everything about this movie is 4th rate. The story, the acting, the effects, the women, the \"action scenes\", the... ahhhh forget it. I can watch a piece of crap like \"The Bloodwaters of Dr. Z\" (aka \"Zaat\") over and over and over with hardly any ill effects (I like it in fact- btw, it will be on TCM later this month- October, 2009) but \"Hobgoblins\" is a whole 'nother ballgame.\n\nThe worst part of it all may be that it's now about 12 hours after the movie ended, I had a good night's sleep, some coffee and some dry toast, my medications, and yet the ersatz \"New Wave\" dance music that Amy, Red Shorts, and Laraine Newman were frolicking to in the living room is STILL RUNNING THROUGH MY HEAD. This torment will last for days.\n\nGood luck, won't you?"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Ashki",
        "review_rating": "1",
        "review_title": "Warning: Hobgoblins May cause Blindness and Death",
        "review_detailed_main": "This was the warning on the reel container that Pearl pulled out of the box after Mike and the Bots were jumping on the couch, and well, I think that that the warning should be followed.\n\nNow why you ask? Well, because this is one of the worst movies that has ever been produced, right up there with other stinkers such as Manos: The Hands of Fate, The Wild World of Batwoman and Red Zone Cuba.\n\nA few things that make this movie bad, the Hobgoblins themselves, wish, like one of them mention, its just a plush toy, another thing, the characters, ugh, just ugh. One of thems a slut, another one, a rigid girl friend, the third, a nerd obessed with phone sex, and a sex crazed military guy whose the boyfriend to the slut.\n\nThe next and most horrible thing about this movie, the Club Scum scene where the military guy, after getting a load of hand gernades from his Sargent (who the hell just hands out hand gernades in the first place?) starts just chunking them over his shoulder blowing them up.\n\nThese are just a few of the most horrible things about this movie, beware unless watching the MST3K version."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "GeneralB",
        "review_rating": "",
        "review_title": "This movie is great...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "OptimusPrimeRibSpecial",
        "review_rating": "10",
        "review_title": "A Cinematic Tour De Force",
        "review_detailed_main": "One has to wonder - How did the Academy overlook it? Why didn't this receive a theatrical release? and finally Why did it take almost 20 years for a sequel to a film I personally think knocks Citizen Kane and Gone With The Wind out of the box for the #1 film of all time.\n\nWhere do I begin? The mystery, the suspense, the comedy. The Oscar worthy performances and sepecial effects. This film had it all. One referred to it as Titanic for the 80's and I couldn't agree more.\n\nSome Spoilers (Movie in a nutshell) Young man takes job as a security guard at Movie Studio (no doubt the Warner Bros. or Fox lot) and is warned by his elderly mentor/supervisor on the job to not open the vault. Unfortunately he is a hard learner. The Hobgoblins escape and wreck havok on the town (specifically the new young guards home which coincedentally is the first house they travel to - Oscar worthy screenplay, perfect execution) The chaos that ensues as the small ankle high creatures attack (somehow at face height - another mystery of the Hobgoblins that will leave you boggled), and the creatures ability to enter the mind (and not really kill you - pressumably to toy with you a bit then kill you eventually somehow - the writers do it again), the climax at Club Scum (where the Hobgobs run amok and somehow manage not to startle the all the club goers who continue to drink as if the hobgobs aren't there - another mind trick no doubt. Still trying to unravel that mystery)... I could go on and on. I'm overwhelmed with the sheer magnificene that is Hobgoblins. Please rent this film. From what I understand M. Night got his Surprise ending idea from this film. A must for up and coming filmmakers 10/10.\n\nP.S. - I heard the Director of this film (R. Sloane) passed on Titanic. Huh after this film he had the power to pass on anything. Hobgoblins was every Director wishes they could reach (I'm talking to you Spielberg, Scott, Cameron). Heck he never needed to make another film again."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "Obviously this is a very bad movie.",
        "review_detailed_main": "Around the time Gremlins came out, many rip-offs came out, and this was without a doubt the worst of them. In this film, a night security guard watching some random warehouse doesn't listen to the senior guard and accidentally releases some poor looking, cat-like, puppet hobgoblins. They make people's fantasies come true, then kill them. Everything about this movie is just horrible. The characters are really dumb, and extremely clichéd. One particularly brainless scene consists of a girlfriend getting mad at her man because he lost at a garden tool battle to a man back from the army. Another very brainless scene has a man sitting in his car while his date tried to shove it down a cliff, and he just sits there like a moron. Any line or scene in the film that is meant to be funny, ends up getting less laughs than the \"scary\" scenes, which involve teens holding stuffed animals to their faces. You'll probably enjoy this as a bad comedy, but as a movie, this is really bad.\n\nMy rating: BOMB/****. 91 mins. Rated R for sex and violence."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "fatcat_mud",
        "review_rating": "1",
        "review_title": "No God would allow this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Cyberbeast",
        "review_rating": "1",
        "review_title": "Deep Hurting",
        "review_detailed_main": "There are movies that are so bad, they're funny. That's the entire premise that MST3K (which is where I caught this little gem, like so many of you) is based on. This is not one of those movies. This movie is so bad, it makes you question your belief in God. It's so bad, you feel cheap and used after having watched it. It's so bad, that you find yourself wondering what you could have possibly done in a past life to deserve this kind of torture. Was I Hitler, or Stalin, or Martha Stewart? (I know she's not dead, but I needed her for the joke). It's so bad (How bad was it?), that to this day, it remains the one episode of MST3K that I can't get all the way through. Not even Mike and the bots can help this piece of skunk vomit. Actually, imagine if a skunk could vomit out of it's ass. And then Satan himself (or as I like to call him, Rick Sloane) hocked a big loogie on it. That's almost close to how bad this movie is.\n\nThe characters are unlikeable, zero-dimensional, and stupid beyond all human reason. The dialogue is actually, physically painful. Even thinking about the movie now as I write this, my temples are throbbing. I know that it's old, and low-budget, and that it's horrors will never soil my eyes again. But that doesn't make the hurting stop. Somebody has to be punished for this, because anyone who has watched it certainly has.\n\n0/10, only because I can't use negative numbers, and 4/10 for the MST ep."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "BandSAboutMovies",
        "review_rating": "3",
        "review_title": "Purely and patently ridiculous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "darren_boe",
        "review_rating": "1",
        "review_title": "Its stuck in my head and the only way its coming out is with a bullet!!!",
        "review_detailed_main": "With three exclamation points you know I'm serious. The movie could have been the 'so bad its good' type if I didn't have a strong desire to punch the actors in the face. From now on they need to do a quick punchability test before allowing people to be in movies. Walk them through a public area and ask people to rate how badly they want to punch the actor in the face (1-10 scale), its hard to take anyone seriously while you are thinking about how satisfying it would be to punch him in the face.\n\nThe plot isn't really worth mentioning outside of the fact that at one point the guys in the movie face off in a battle of masculinity by swinging rakes at each other. I was going to attempt something humorous about the rake fighting but I thought the fact that they were rake fighting is funny enough. No need to call the retarded kid stupid I guess. I fail to understand any of the character but I suppose its all for the better. One girl is a prude and yet her boyfriend stays with her? One girl is a slut but has a puchability rating of 8.4 not to be confused with her hitability rating of a mere 4.2, sad. The macho guy as proved via mild garden tool swinging is a pain in the ass military guy with a Scooby-Doo van. Finally the main character is a skinny kid who needs to brush up on his rake skills and has a shocking punchability of 9.8!! nearly perfect for face punching! Then some other stuff happens and it all sucks That's all"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "superguapo2000",
        "review_rating": "4",
        "review_title": "\"You're not young like you used to be\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "hansen1203",
        "review_rating": "1",
        "review_title": "Hard to deal with",
        "review_detailed_main": "OK, I'm a former Marine, I've been taught how to deal with torture, but they could have saved their money by just forcing us to watch this movie without comments by the MST3K folks. I mean, really, this is just so unbelievable horrible. I cannot think of ONE thing (lighting, sound, direction, plot, storyline, props, acting, etc) that this movie does on even a \"B\" level. I have always held \"Manos\" as the worst movie ever created and released, but I really think that this needs to take it's place. You could write for days on end about the failings of this piece of tripe. I can handle a cheesy movie, heck, I can deal with most 80's stuff because I kinda grew up then, but this is just bad at so many levels it makes your head spin. I have NEVER viewed a movie this bad before in my life...barring none. By the way, I teach Art and Design and have seen my fair share of bad \"Art\" movies also...nothing can compare with this."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mikeridges",
        "review_rating": "1",
        "review_title": "This movie both hurt my eyes and made me a lesser being",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "cudmoree",
        "review_rating": "",
        "review_title": "The Best Film Ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "hathead",
        "review_rating": "10",
        "review_title": "it's still better than \"Invasion of the Neptune Men\"",
        "review_detailed_main": "Yeah, it was bad, but I can think of a lot of movies that were worse...many of which even had BUDGETS. Clearly, if one were to compare \"Hobgoblins\" with say, \"The Postman\"...well, you get the picture.\n\nDespite its rank cheesiness, it made for a memorable episode of MST3K. Who could ever forget the riveting Club Scum scene? It's been a few months since the last time I've seen it, yet I still sometimes find myself laying awake at night trying to figure out what that rockin' band was singing about...was it \"fish picker,\" \"pig licker,\" or maybe even \"pig liquor\"? Which begs the question, who would distill pig liquor anyway...and why would anyone want to?"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "JarretCo",
        "review_rating": "1",
        "review_title": "One of those movies you want to physically harm",
        "review_detailed_main": "I can't tell you how loathsome every single person in this film is...from the \"slut\" to the \"nerd\" to the \"army guy\" to the \"good girl\" to the \"perv\" etc. etc. etc. It's the most masochistic movie-watching experience I've ever had -- I wanted to pick up any given actor by the feet and beat the rest of the actors to death with him, then make the writers eat what's left. That's the most horrific part -- actors could be forgiven for just picking up a check, but someone actually WROTE this pile of sh_t, thinking it was funny and/or suspenseful. Seek it out if you dare -- even the MST3000 treatment can't mitigate all of the horror."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "stephen_king_kuk",
        "review_rating": "1",
        "review_title": "Bravo...you have successfully killed me inside!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "gavin6942",
        "review_rating": "3",
        "review_title": "Didn't Think It Was That Bad, But I Think the Bots Helped",
        "review_detailed_main": "In an abandoned movie studio, a group of hobgoblins live in an old vault. They will grant your every wish and greatest dream, but sometimes that dream becomes a nightmare. An old man, his sidekick and a group of friends must take on these monsters, when they're not too busy listening to Wang Chung.\n\nThis film isn't really good, unless you enjoy laughing at bad cinema and possibly getting drunk while doing so. If you watched this on \"Mystery Science Theater\", you like laughing at bad cinema. If you watched this after seeing the Gin Blossoms, you were probably drunk. And you really enjoyed the Wang Chung line (\"everybody gets laid tonight\").\n\nSome things about this film were just absurd: a couple would apparently run off to have sex, and then the van rocks for 20 seconds. So, um, what were they doing? Jumping up and down? You can't even get your clothes off that fast, can you? Maybe you liked the rake battle. Like the fight scene in \"They Live\", it just goes on forever, for no real reason. The difference is that \"They Live\" is a good movie. Although, I must say this was sort of funny for its incredible stupidity.\n\nThe puppets were okay, as far as puppets go. Not sure if they were supposed to be scary or not. And what was with the chick pushing the car off the ledge? If she was a dream, how did she really push the car? And how did the other people touch her? Maybe I didn't understand. Actually, I know I didn't understand.\n\nPaint my muscle car prune color, please. I would gladly watch this film again, whether drunk or sober. But not because it's a good one -- because it's truly awful. Don't make your friends suffer through this alone."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "jewbo23",
        "review_rating": "3",
        "review_title": "Bad but oh so much fun.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "billshattner",
        "review_rating": "1",
        "review_title": "Quite possibly, the worst collection of images ever captured on celluloid",
        "review_detailed_main": "To truly, TRULY understand the pain, banality, and horror (not the intentional kind) associated with this movie, I suggest an activity: Douse your eyes in battery acid, have someone with an annoying voice scream misogynistic phrases into your ear for an hour and a half, and then, just for kicks, have someone remind you that life is unfair and brutal. Then, and only then, will you have some semblance of knowledge as to the unbelievably poor quality of this film. In truth, I don't know where to start. The writing is acerbically bad. The acting isn't much better, and the characters are so overwritten that the performances were doomed, anyway. The hobgoblins themselves are laughable, in that they appear completely inanimate. And all of that does little to address the blatant and suspect sexual themes of this movie. Truly, one can only wonder about the motivations and inspirations of Rick Sloane, the person most singularly responsible for this piece of dreck. In a few words, DON'T EVER SEE THIS MOVIE. It's low-budget, it's unimaginative, and mephitic doesn't begin to describe it. Seriously, stay away, and forget you ever heard about its existence."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "bensonmum2",
        "review_rating": "1",
        "review_title": "An abomination of film-making",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "denny-72149",
        "review_rating": "1",
        "review_title": "The worst...",
        "review_detailed_main": "Although, if you have to watch Hobgoblins, watch it on Mystery Science Theater 3000. Pure gold."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "So Bad It's Mildly Entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "stab-8",
        "review_rating": "8",
        "review_title": "I thought they were serious before I saw it.",
        "review_detailed_main": "I finally got this on DVD and I have to say that this wasn't that bad at all. Makers of the film seem to be well aware of all the cheesiness and plain stupidness, so in my opinion, it takes a big something away from all those \"omg the baddestest movie evahhh\"-comments. Everything seems to be deliberate, which I wouldn't have known if I hadn't seen it and just trusted other peoples comments.\n\nToo bad. If this had been done seriously, I would've laughed more. It's still laughable, though, and all the out-of-place stuff makes one wonder. The ending is as ridiculous as one could expect and the whole package is steadily chaotic. Oversexed 80's youngsters fit the picture perfectly and now when I think about it, they couldn't have been another way.\n\nI wouldn't rate this as a \"bad movie\", since it clearly was supposed to be this way.\n\nAdd another twenty years and this very well might be an art film."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "paul_haakonsen",
        "review_rating": "2",
        "review_title": "Rigid puppets from outer space...",
        "review_detailed_main": "I have actually never heard of \"Hobgoblins\" before 2016, when I happened to stumble across the movie by sheer random luck. And being a fan of creature features and horror movies in general, of course I gave \"Hobgoblins\" a chance, well knowing that I most likely wasn't in for something grand.\n\nAnd I should have taken heed to the low rating of \"Hobgoblins\" on IMDb and stayed well clear of the movie. Yes, this movie is every bit as to be expected given the synopsis and the rating it has received.\n\nThe story is about some aliens who are confined to a facility, where they are accidentally released from captivity as a new security guard opens a vault that is supposed to be off limits.\n\nThis is from the late 1980's, so of course expectations should be set accordingly. But even for a movie from this age then \"Hobgoblins\" was pathetic.\n\nThe acting in the movie was amateurish at best. I am not sure if it was because of the lack of having a proper script to work with, or if it was because they had opted to go with talents not really up for the task of acting.\n\nAnd the creatures, well let's just take a moment here to talk about them. While they did have some good conceptual ideas for their appearances, then the creatures just didn't work out so well on the screen, especially since it was so obviously clear that they were just puppets without movable parts. It was embarrassing to witness.\n\nBefore I forget, I should also mention the editing and cutting of \"Hobgoblins\". Wow, that was just abysmal to watch. This was probably some of the worst movie editing that I have ever seen.\n\nI didn't last through the entire movie here, because I just gave up on it before even reaching the half way point. And I have no interest in finishing the movie. And I just found out that there apparently is a sequel to this abysmal movie; but again, I have no interest in watching that, not after having seen enough of part one to see what it was.\n\nI can't find any reason for why anyone should take the time to sit down and watch \"Hobgoblins\", much less actually invest any money or time in doing so."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "stephaniethesing",
        "review_rating": "2",
        "review_title": "Hardly watchable",
        "review_detailed_main": "OK, I only saw this movie as a \"Mystery Science Theater\" episode, and it's wonderful in it's badness, but I don't know if it would be easy to watch in it's duration without the MST3K running commentary. The acting is horrible, the \"monsters\" look like rejects from the Muppet Show, and the dialogue is pretty bad too. I wouldn't spend the money to rent it."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "jesse_barboza",
        "review_rating": "1",
        "review_title": "There's been an accident at the studio...we made \"Hobgoblins\"!",
        "review_detailed_main": "Who knows what evil lurks in the mind of Rick Sloane? I don't, and I sure as hell don't care to find out anytime soon. This flick hardly even tries to hide the fact that it's a ripoff of Joe Dante's infinitely superior \"Gremlins\", and combined with the inane plot, cheesy dialogue, inexperienced actors, bad special effects, and lame music, it's no wonder that \"Mystery Science Theater 3000\" sunk their claws into this one for Experiment 907.\n\nSo, these little puppets that have the ability to grant you your fondest wish and then kill you escape from their vault at a movie studio and wreak havoc on the populace (hey, maybe this is where \"Animaniacs\" came from...or maybe not). Their chosen victims are Kevin (a total puss who still knows how to fire a gun blindly into the air to scare off burglars), Amy (Kevin's ice cube of a girlfriend who remains unimpressed with everything he does), Daphne (a slut outlined in spandex who refuses to watch any movie without a XXX rating), Nick (the jerky military brat trained in garden tool warfare), and Kyle (the lovable pervert hopelessly addicted to phone sex). While Kevin's elderly boss goes on for hours about how important it is that the puppets be stopped, the little devils have already attacked Kevin's friends (accompanied by a lyric-less dance song that also goes on for hours). Then Kevin stops Kyle from being taken in by his fantasy moments before his car plummets off a cliff (unfortunately, neither of the two characters are in the car at the time) while Amy goes off to discover her inner skank at Club Scum. After a rousing performance of the punk rock hit \"Pig Sticker\", Amy takes the stage, only to have her big night decimated by Nick's delusional war fantasy involving comically weak hand grenades and people that turn their own tables over in order to save the explosions some work...and then some other stuff happens, but by this time I had wandered off in desperation for human contact.\n\nThis is one of those cases where you know the director made this movie for the sole purpose of putting in nude scenes. Of course, such scenes were excised for the MST3K version, leaving us with a story that the director couldn't care less about. I can sympathize with the emotionally scarred Tom Servo and Crow as they bolt for the theater exit over and over again during the opening credits. This movie gives Hal P. Warren's classic stinkburger \"Manos: The Hands of Fate\" a run for its money as possibly the Worst Movie Ever Made."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "a-twetman",
        "review_rating": "3",
        "review_title": "Close but no cigar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Red-Barracuda",
        "review_rating": "4",
        "review_title": "Okay for a few laughs",
        "review_detailed_main": "First there was Gremlins (1984), then there was Ghoulies (1985), followed by Critters (1986)...the logical conclusion was Hobgoblins. This bargain basement creature feature centres on a group of small hairy aliens who have the power to grant people their innermost wishes, somehow. While, this is certainly a poor effort on several levels, including lots of lame humour and a useless storyline, it equally isn't really nearly as bad as its reputation suggests. In amongst all the rubbish are moments to appreciate to at least some extent, such as a place called 'Club Scum', hand-puppet monsters, a pair of ludicrous red shorts, an explosive ending which begs the question 'what was the point exactly?' and, of course, the legendary rake fight. Essentially, this is one purely for bad film fans, everyone else should steer well clear."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "highwater",
        "review_rating": "1",
        "review_title": "If It Gets Any Worse Than This, Don't Tell Me",
        "review_detailed_main": "It's hard to be surprised at how bad a movie is if you're seeing on Mystery Science Theatre, because you naturally expect all the movies featured on MST3K to be bad. But Hobglobins is so stunning in its awfulness that it belongs in its own category, far removed from all the other bad films you've seen. Nothing, and I mean NOTHING, works in this movie.\n\nIt starts out as if it wants to be a cheapie horror flick, but soon changes its mind and decides to become an extremely bad teen comedy. Unfortunately, the \"horror\" sequences are not remotely scary or even interesting, and the \"comedy\" scenes are painfully bad. And the fact that there is not a single likeable character in this movie does not help matters much. Even the character who is apparently supposed to be the hero is annoying, which would have led me to root for the hobglobins if I could have deluded myself into pretending they were anything other than puppets. So all the people are badly written jerks, the monsters are obvious lifeless props . . . what's the point?\n\nIt amazes me to think that some people actually paid to see this upon its original release. I wonder what the target audience was supposed to be -- clueless teenage morons, like the characters in the film? I don't know, but if there are worse movies than Hobglobins somewhere, I don't want to know about them."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "paulo20",
        "review_rating": "1",
        "review_title": "When puppets attack",
        "review_detailed_main": "Or, more accurately, when people clasp puppets to themselves and flail about like idiots. This movie's one saving grace is that it doesn't take itself very seriously at all. Still, there's no good reason for this film to exist. It's aim was apparently camp entertainment but it fails horribly at this. None of the characters are remotely likeable or funny; the only humor to be gotten is from the titular puppets: they'll inspire a hearty guffaw even without Mike Nelson and his robot pals; so the movie succeeds in this respect, at least, though the entertainment value the puppets provide is paltry, at best. Therefore, I recommend the MST3K cut of the film if you can manage to catch it at 9 or 10 am on Saturday morning."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "motor89",
        "review_rating": "",
        "review_title": "Heeelp!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "geodfil",
        "review_rating": "8",
        "review_title": "It has a nostalgic 80s vibe that made me love it!",
        "review_detailed_main": "Hobgoblins is not a movie. Is more of a time travel wormhole that can transport you back into the heart of the dreary emptiness of the 80s.\n\nIf you were a teenager in the 1980's and want to relive the experience, then grab some popcorn and soda (or wine, or beer) and enjoy the ride.\n\nPretend you're one of the actors who's claiming to be filming a movie while, in truth, you're reliving your youth.\n\nHappy viewing!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "shuvcat-1",
        "review_rating": "2",
        "review_title": "UP!! All Night.....",
        "review_detailed_main": "This film rips me back to the very late 1980's/early 1990's, when Letterman used to be the end of NBC's broadcasting every night, and the only thing worth watching after 12 midnight was USA's UP...All Night, starring Gilbert Gottfried and later the blonde trampy ho whose name I can't recall, introing really dreadful movies that a 12-year-old like me used to later esspy the video boxes of, in their town's local Food Happy Mart.\n\nI recently bought this as part of MST's DVD Vol 8, but I keep watching it, because *something* about it keeps triggering a repressed memory in me. Is \"Hobgoblins\" one of the trashy late 80's \"horror\" flicks hosted by Rhonda Shear at 1 AM back in 1989 on USA? I can almost remember.... and yet some dark shadow is barring the path in my mind's eye... perhaps to my own benefit.....\n\nNah, if I can remember \"Hello Mary Sue: Prom Night 2\" and \"Terrorvision\", surely I can't be that scarred by recalling \"Hobgoblins\". Yes, I will assume that I first saw this alone, without the aid of Mike or Bots. I can handle it. You Can't Handle The Truth!!......."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mospel",
        "review_rating": "1",
        "review_title": "This is REALLY not worth watching even if you are looking for Trash!",
        "review_detailed_main": "To all who are reading this: I have made a big mistake. I got this movie when it was on the top bottom, for I thought it might be some fun watching it, after all, a movie rated that bad could be entertaining - in a way. Well thats what I thought, I can assure you now: I was WRONG. This movie is just PATHETIC. The story SUCKS, the acting SUCKS EVEN MORE; the special effects SUCK, but never that much that it would be even remotely funny - same for the SUCKY dialog. To make things worse, I did not care for ANY of the characters at all (except mayhaps a little for the old janitor), and I do not think I am alone here. Plus, the whole movie is a real pain. It is really bad, but never that bad that this (being bad) would be any fun at all. So, its even worse than bad.\n\nYou might be interested in watching this piece of trash, but I urge you: DONT!!!! It really isnt worth it... trust me on that matter. There is absolutely NO reason to watch this movie, unless you are striving for disappointment."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "e_barker",
        "review_rating": "2",
        "review_title": "Well it could be worse, I could be dead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "rjh2200",
        "review_rating": "1",
        "review_title": "Hand Puppets from Outer Space",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "williampsamuel",
        "review_rating": "1",
        "review_title": "Pathetic and reprehensible, Hobgoblins should be avoided at all costs",
        "review_detailed_main": "Having just watched Hobgoblins, I now have a new entry for my most hated movies. It's an unbelievably pathetic rip-off of Gremlins which combines the worst parts of a horny teenager movie and a dead teenager movie. It was made for no other reason than the (futile) hope of making a quick buck by director/producer Rick Sloan, who obviously never met a teenager or saw a movie before making this one.\n\nThe 'hero' of this picture is Kevin, the new assistant security guard at a near abandoned movie studio. He's joined in this worthless enterprise by his girlfriend Amy, a frigid nag, her friend Daphne, a vapor brained nympho, and Daphne's boyfriend Tony (at least I think that's his name) who belongs to an unspecified branch of the military and who or may not be related to the guys on Jersey Shore. Plus there's Kyle, who's only attributes are a vague resemblance to Carl Wilson and a tendency to call naughty 1-900 numbers at the least sensible times, and an elderly security guard who is absent for most of the movie.\n\nThe titular hobgoblins are small, toothy, extremely ugly aliens who make all your wildest dreams come true, right up until the point where they kill you. They're unleashed onto the world and unsuspecting audiences by Kevin, who accidentally releases them from the vault where they've been imprisoned for the last thirty years. It seems that the old security guard has dedicated the last three decades of his life to making sure they never escaped, but somehow neglected to put a lock or even a warning sign on the outside of the vault. This is only slightly more inexplicable than the fact that despite knowing more about the creatures than anyone else in this travesty, he stays back at the lot after giving some instructions on how to catch them.\n\nSo Kevin spends the rest of the movie chasing the ugly little buggers while they work their evil magic on him and his friends, granting their fantasies of being a war hero, being a stripper, actually meeting a woman, etc. Their pitiful capers take them to exotic locals such as Kevin's house, the inside of Tony's van, and the aptly named Club Scum, which looks oddly like a Rotary hall. The hobgoblins are eventually vanquished, although unfortunately without killing any of the people in this movie.\n\nAs you hopefully realize by this point, there's no acting of any kind in this movie. There are also no real sets, no real plot, and no real budget. The titular critters are cheap hand puppets that mostly appear at the edge of the screen or partly obscured by furniture, the better to hide the puppeteer's hand. In the few instances where they directly attack someone, it's painfully obvious that the actors are just rolling around with plush toys. The fight with the octopus in Bride of the Monster was more convincing than this. At least the puppet wrestling has more plot significance than an earlier fight with gardening implements between Kevin and Tony, which takes place for no discernible reason except nagging from their girlfriends.\n\nWhat's worse, Hobgoblins constantly tries to be sexy, but has no idea how. The characters talk about getting it on with such earnestness and regularity that we can be certain whoever wrote their lines has never been past first base. Fifth graders know more innuendos and euphemisms than these bozos. And when Kyle dials up the local phone madam, her spiel comes off not so much erotic as schizoid. She used few complete sentences, and kept changing the pitch and volume of her voice, but apparently her routine has something to do with a mass breakout at the zoo.\n\nNor does Club Scum offer anything remotely sexy. The lights are too dim to see anything clearly, most of the girls look like they crawled out of a gutter, and Amy's 'striptease' looks more like a spastic cheerleading routine, and shows amazingly little skin. It's telling that none of the items of clothing thrown into the sparse audience have any resemblance to the ones she was wearing. Halfway through her act, I began to wonder why a place called Club Scum would have no stripper pole, but dropped this line of inquiry to ponder why a bouncer would hurl someone into the club while yelling at them to get out.\n\nI could go on and on about how pitiful this movie is. I could spend page after page describing its utter stupidity and abysmal quality. I could fill an entire page ranting about the music alone. Bottom line, Hobgoblins is utterly worthless and there is no reason for anyone on earth to see it. A blank screen shown for the same amount of time would have been a vast improvement, and I would surely have gone mad had I not been watching the MST3K version. Even Joel, Tom, and Crow had a hard time with this one. Anyone foolish enough to watch Hobgoblins after reading this will deserve what they get. Zero stars."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "garyb04",
        "review_rating": "2",
        "review_title": "Where to begin???",
        "review_detailed_main": "The first time I ever saw this piece of dung heap was through Mst3k and I couldn't believe anything could be this bad!!! Worse than Manos?? Yes,it's true!! I don't know if I should talk about the so-called acting or the many mistakes this movie has because there's so many to pick.I read that the director did it on purpose in hopes that MST3K would do this,but who knows!! The whiny hero to his non-supportive girlfriend to the nerdy pervert to the over-sexed floozy that is called Daphne;each actor is annoying in their own way.Even the creatures weren't even scary or even cute,like the ones in Gremlins,but it doesn't matter..If you're curious about seeing this,please,please see the Mst3k version and that's it,OK?? You have been warned!!!!!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Duzniak38",
        "review_rating": "1",
        "review_title": "Painful to Watch.",
        "review_detailed_main": "YUK! This has to be the worst movie that I have ever seen. I will never forgive my self for wasting 92 minutes, watching this trash! The only fun way I got through it was with the help of the MST3K crew! This film is about some Hobgoblins let loose from a factory - (Hobgoblins locked in a vault in a film warehouse!) - and then they wreak havoc through town, by making peoples fantasies come true, but they turn them bad in some way. This is my long list of bad pointers / scenes about 'Hobgoblins.' - The acting is absolutely dreadful. I have never seen a more depressed or unenthusiastic bunch of wannabees... - The script! God, who wrote this? A blind two year old kid? God, it was pure awful! For example in one scene, Daphne is standing outside, waiting for her boyfriend, when a hobgoblin creeps up to her left, growling heavily. She mistakes this furry little Hobgoblin for her best friend, Amy, remarking \"Amy, would you quit breathing all over me!\" This was the most laughably bad line, but the film contains millions more... come to think of it I can't think of one good line in this film at all. - The Hobgoblins were obviously little soft-toys, being controlled by some guy off-stage. Awful effects... - The quality of the sound and picture is goddamn awful! And the directing, *gak*, a monkey in a wheelchair could of directed this better... - Most of the scenes are dull and pointless - e.g. the long and tiresome garden-appliance fight in the back garden. When Rick Sloane, all the cast and crew-members directed / made / produced / whatever-ed this, WHAT WERE THEY ON? Crack? Didn't ANY of them come to their senses and think \"Hey, this film is a pile of crap!\" God... AVOID AVOID AVOID! I do recommend the MST3K version though - it's really funny watching the guys mock this rubbish! I have to say my favourite part of the film was .... the end credits... As the sticker states, at the beginning of the MST3K version of this movie, \"HOBGOBLINS: May cause blindness or death.\" Yes! It will make your eyes bleed! You have been warned..."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Hancock_the_Superb",
        "review_rating": "1",
        "review_title": "\"Go to hell for your kindness!\" **spoilers**",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "klatsdrawkcab",
        "review_rating": "",
        "review_title": "o/ what cha' gonna do with those hobgolblins o/",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "JamesMovieGuy_117",
        "review_rating": "3",
        "review_title": "the most bizarre small creatures running amuck movie",
        "review_detailed_main": "A young lad has been hired as a security guard for an old studio. However, on his shift he unleashes a bunch of creatures from a vault and they start going after the young security guard's friends. These creatures before killing their victims go into people's minds to fulfil their wildest fantasies, causing all sorts of mayhem.\n\nHobgoblins is a movie that's self-aware that it's b-movie entertainment. All the characters besides the protagonist are dumb stereotypical teenagers, however, the filmmakers go to the next level by having them in ridiculous and unrealistic situations.\n\nA scene that strikes me the most is a fight between the main boy and a guy who's just been out of army training. He's cocky and arrogant and he challenges the main boy to a fight, but this isn't no ordinary fight, it's a fight with gardening rakes! They just bang the rakes together until the military guy decides to take a hit on the boy. The girls then cheer on the arrogant military dude and after want to have sex with him. It's scenes like these that solidify the movies logic and well... it's utterly hilarious!\n\nThe creatures are very inspired by the Gremlins in not only their design but the concept of them running amuck. There were plenty of Gremlins rip offs in the eighties including the Critters, Ghoulies and Munchies. However, Hobgoblins has to take the prize for the most bizarre small creatures running amuck movie.\n\nIf you watch this knowing about the ludicrous nature of this movie, then you will be in for a treat!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Cinema Buff",
        "review_rating": "1",
        "review_title": "Ummm...Well...Aww, forget it!",
        "review_detailed_main": "To quote the chorus of the Broadway musical, *The Producers*, \"We can't believe it! You won't conceive it! How did he achieve it? It's the worst show in town!\"\n\nThe \"he\" that I refer to is Rick Sloane, who is somewhat notorious for his \"Vice Academy\" series. This was one of his first films, and the fact that he served as the director/writer/producer/editor/cinematographer/cameraman says a little something about it. This film shares its premise with the almost-as-bad \"Wishmaster\", in which you get to live out your fantasies, which is good, but then get killed by little rubber creatures, which is bad. These creatures, which are the \"hobgoblins\" that the title refers to, look like the rejects for a \"Critters\" film. The acting is laughable, the special effects are neither \"special\" nor really \"effects\", and the directing/writing/producing/editing/camerawork is second-rate.\n\nI would go into the film farther, but it does not deserve it. I will say this last thing, though: \"Hobgoblins\" is not available on video, and there's a very good reason for it."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "dethlamp",
        "review_rating": "1",
        "review_title": "Even with MST3K I think it gave me kidney failure.",
        "review_detailed_main": "This film has to be the single worst film of all time. It takes alot for me to turn off a movie especially when its MST3K'ed but this. UHHAGGGAAA..... PAIN! Old man+Bad Music+Stuffed Animals=This abomination. For God's Sake make sure that you never see this film unless you want your brain to be scarred forever!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Sterno-2",
        "review_rating": "1",
        "review_title": "AHHHHHHHHHHHHHHHHHHHH!!!",
        "review_detailed_main": "If I EVER...EVER meet Ric Sloane on the street, I will personally beat him over the head with a rubber mallet with the vain hope that it will beat some SENSE into him.\n\nSloane, whose \"expertise\" is soft-core porn flicks, should not quit his day job of providing entertainment to horny nerds who live in their parents' basement. Sloane's ripoff of Gremlins makes Coleman Francis look like Cecil B. DeMille!! A fight using garden tools is a high plot point? What next? Dueling screwdrivers at 10 paces? Fork fights? Vacuum cleaner races?\n\nThrow in horny people (especially the blonde chick -- somebody dowse her with a fire hose for goodness sake) and horrible hand puppets, and you have a terrible flick. If you read my review of Red Zone Cuba, I should have applied that review's summary (Night Train to a Self-inflicted gunshot wound) to this movie instead...Perhaps that was too harsh...ahh...ummm...ohhh...ahh, nope. It's suits here too.\n\nSterno says to get Nancy Sinatra's boots and walk on by this loser."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "liverboyjoe179",
        "review_rating": "1",
        "review_title": "The poor man's \"Gremelins\"... Only worse...",
        "review_detailed_main": "This has got to be one of the worst movies I've ever seen. Even for a purposely made stupid movie, this still sucks. Yeah, they say \"purposely made\" to hide the fact that: 1) No one in this movie can act, 2) The idea was very unoriginal 3) It's budget was obviously low. Strangely, some find this movie entertainingly funny. I say, if you're looking for a funny horror movie purposely made stupid, go for Dead Alive (aka Braindead)."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "bellino-angelo2014",
        "review_rating": "3",
        "review_title": "Yes, it's bad, but at least is a bit entertaining!",
        "review_detailed_main": "HOBGOBLINS is considered by many among the worst movies of all time. It was featured on MST3000, it has an appalling score of 2,2 and few months ago it returned on IMDB's Bottom 100 (the list of the 100 lowest rated movies of all time). Yet after I watched it I couldn't brought myself to give it a 1 because of its entertainment value. In fact, this is not a boring bad movie (such as MONSTER A GO GO, ZAAT or MANOS THE HANDS OF FATE) or an annoying bad movie (such as DISASTER MOVIE, CAT IN THE HAT or anything involving Lucas Cruickshank). This is among the movies ''so bad they are good'', so bad that you can also have a laugh or two for its inaniness.\n\nThe movie is as you can guess even from the poster a knock-off of GREMLINS. It begins in an abandoned movie studio, where one of the young watchmen helped by the old watchmen (who looks very similar to Buddy Ebsen) discovers about some monsters called Hobgoblins, that have the power of making wishes come true. But, there is only one BIG problem; when the wish finally comes true, the hobgoblins kill the ones that asked the wishes. So, it's up to the young watchmen, helped by the elder watchmen and his friends, to stop the monsters.\n\nWhile the acting is bad, the puppets are badly made and manipulated, it's a funny movie in its own way."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "seehra",
        "review_rating": "1",
        "review_title": "Damn you Rick Sloane",
        "review_detailed_main": "Rick Sloane is not a man. No man would force this atrocity upon another human. It goes from bad to even worse. Even while fast forwarding through the movie with bad tracking I was left with emotional scars. Why... why me?"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "10929",
        "review_rating": "1",
        "review_title": "Holy hell...",
        "review_detailed_main": "OK, so I consider this movie awesomely bad. I have never yet seen a movie that was so crappy in plot, special effects (ugh!) and other untimely movie-like things that were sort of added in at the last second. The movie is bad in so many ways... my list of top three bad things: 1. The dazed and confused look on everyone's face as they forget their lines for the millionth time. 2. The sticks that are visible holding up our precious \"Hobgoblins.\" 3. The really bad New Wave 80's band that plays for what seems like half and hour in the middle of the movie... for not apparent reason. So, kudos to whomever made this film, it's bad."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "spookyhead",
        "review_rating": "",
        "review_title": "Hobgoblins...yup.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Dexter Babin",
        "review_rating": "1",
        "review_title": "WHAT WERE THEY THINKING!!!!!!!",
        "review_detailed_main": "Ok i have seen alot fo bad movies before but this one is the WORST I have ever seen in my life. The first time i saw this movie was the great tv show MST3K,and i love the part when Cro says \"the movie was so bad even the car wanted to get out of it\"(after the car was falling off the cliff)I do not remember the names of the horrible actors in this movie,but one guy i think hade a granade in his hands but it blew up in his pants.And at the end of the movie(SPOIL) he comes back ALIVE and not that hurt. And the most sad part is it is horrible for a horror movie i would brand it stupid not worthing waste of space comedy.So I recommend this movie to no one I think it should be NEVER SEEN AGAIN BY ANYONE OR ANYTHING."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Jonny_Numb",
        "review_rating": "",
        "review_title": "\"Pig...sticker!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "maddysweger",
        "review_rating": "1",
        "review_title": "Horrifying",
        "review_detailed_main": "Wow. Worst movie I have ever seen. It was hard to sit through even with MST3K joking about it."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "CelluloidRehab",
        "review_rating": "2",
        "review_title": "Ladies and Gentlemen : It's the 80's, do a lot of coke and vote for Ronald Reagan",
        "review_detailed_main": "This is a horror movie that should not be watched un-MST 3000. And by horror, I mean the sheer terror of watching the whiny people trying to act.\n\nThis plot is simple, complicated and full of holes at the same time. Basically after the opening scene where a young security guard is killed, the old security guard hires a replacement, our hero : Kevin. They secure an abandoned film studio. The vault is the forbidden area. No one is suppose to go in there. Apparently, 30 years prior (this is all explained in a flashback by the old dude), these things (could be aliens, could be demons) appeared and slowly killed everyone in the studio. The old dude captures them and puts them in a vault. One night during the middle of a break-in, the \"Hobgoblins\" escape. Let me rephrase that. Our hero, Kevin, \"accidentally\" releases them. Boredom and stupidity ensue.\n\nThis movie is full of new and interesting pain-inducing methods. From the dialog, to the sets/locations (the inside of a warehouse, Reputation Road and Club Scum stick out in my mind), to the outfits, to the music, the fight choreography, innumerable scenes of cars parking or stopping and the special effects all scream out for a giant bowl of cyanide Kool-Aid. The first fight scene is a duel between Kevin and his \"friend\" returning from basic training, Nick. This involves a hoe and a rake (Battle of the Gardeners or something). Now think of the fight scene, in the original Star Trek series, where Kirk and Spock are locked in a duel to the death. It is nothing like that. If Shatner and Nimoy were drugged up on sleeping pills and bottles of alcohol maybe these two scenes might be similar. The fight choreography on Star Trek (being almost 20 years older than this movie) is far superior to anything this movie can muddle through. The nunchaku scene at the end (or as Crow likes to refer to it as flares tied with electrical tape) is the proverbial cherry arsenic on our anthrax cake.\n\nThe dialog does not help. It goes from worse to much worse. Classics lines such as: (Amy)-\"You would never show me a rated X movie. Would you Kevin?\"\n\nThe other characters are equally as inspired. Kevin's girlfriend, Amy, is a frigid, know-it-all. Nick is belligerent and a sex fiend. Nick's girl, Daphne, is also a sex fiend and wears different neon pants with different see through skirts. Kyle is the androgynous, useless 3rd and 5th wheel, accordingly. The old dude looks like he needs a change of adult diapers and some El Dope. Finally, there's the stars and name-sakes of the movie : the Hobgoblins. They appear to be hybrids of gremlins, ghoulies and critters. And by hybrids I mean cheap imitations. They literally look and act like dolls. The actors even have to pretend the \"stuffed dolls\" are trying to attack them. Their powers seem to consist of appearing out of nowhere and biting people, unless they're bored, in which case they telepathically project the desires of their victims. To what end ?? I don't know, since no one seems to be hurt by their brain illusions. Just like gremlins, hobgoblins also have rules attached to them. Actually its just one rule : they are attracted to light.\n\nUnder no circumstances are you to watch the non-MST 3000 version. Also try to contain your desire to watch this movie alone. This movie is not recommended for unsupervised viewing. Get a friend and some really,really good medicine."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Mike Sh.",
        "review_rating": "5",
        "review_title": "Hate! Hate! Hate, hate, HATE!!",
        "review_detailed_main": "This is one of the most hateful movies I've ever seen. It hates the audience. It hates the cast. It hates the crew. It hates the producers and distributors and marketers. It even hates itself! It has absolutely no regard for human decency and dignity. It is an embarrassment to watch. A wince (or at least a cringe) every five seconds, guaranteed!\n\nSeriously, watching this will make your cheek tingle with shame. The \"double entendres\" are as subtle as a 12g cannula jammed into you eyeball, or a weighted speculum shoved down your throat. (Not to put too fine a point on it.) The humor (what there was of it) was incredibly forced, and the characters were all despicable, loathsome people.\n\nHow the gang at Best Brains could stand to watch this film even one is beyond me. (It's my understanding that in the line of duty the writers and performers on their late lamented TV show were required to watch each film at least half a dozen times.) \"Hobgoblins\" is yet another example of their collective sacrifices made in the name of comedy. They really earned their money on this one."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "gothicgoblin1334",
        "review_rating": "1",
        "review_title": "You're kidding me...",
        "review_detailed_main": "Does every new-age horror film have to be sexual? Sick people love them, personally I just think they're there because the producers (Not writers, sadly these days they don't have much power anymore) say \"Hey, let's get the MEN turned on to this...\" or \"Hey, let's offended people even more!\" and \"Hey, we're already making a crappy movie, why not put sex in it?\" Ha. That joke could have been funnier if I was talking about BLOOD GNOMES (A terrible movie) or BLOOD OF THE ORGY...whatever....This movie is so terrible I can't decide if it sucks more or blows more. I hated this film but somehow a light came on in my head in this movie (Mystery Science Theatre 3000 light, that is) THEY MOCKED THIS MOVIE SO BAD!!! Thank You, Mst3k :) OK, back to the awful movie's topic: basically they tried to make it funny but ended up doing a good job of making it laughable (but not in a good way ;) ) Anway, it's not that much of a fantasy movie. Thank God for MST3K"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "TtheFG",
        "review_rating": "1",
        "review_title": "Great!",
        "review_detailed_main": "This movie was fantastic in all ways! From worthless scenes to plot holes and superb acting (not to mention the sound effects) it has it all!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "biancoceleste87",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "This movie should be avoided at all costs with the following exceptions;\n\n1.You have a car parking fetish, this is your movie! At least 30 shots of people parking.\n\n2. You want some excellent study material on how NOT to make a movie.\n\n3. You watch the MST3K version, this movie seems to be tailor made to be shredded by Mike and the bots.\n\nAll in all this is bottom of the barrel movie-making with a ridiculous plot, characters and dialog.\n\nRatings\n\n1.0 for the movie itself\n\n8.0 for the mst3k version"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "the_mothman",
        "review_rating": "1",
        "review_title": "So far, this is one the worst movie I've ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "tcuevas-886-751018",
        "review_rating": "1",
        "review_title": "I had forgotten how awful the 80s were",
        "review_detailed_main": "I wish it were possible to give minus stars. This is possibly the worst thing to come from that decade. The only thing that made it bearable was watching it on MST3K. The acting is wooden and the script is ridiculous. I wouldn't be surprised if the actors changed their names and moved out of the country."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "moonman122",
        "review_rating": "",
        "review_title": "Never ever watch this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Gabriel_Kuntze",
        "review_rating": "1",
        "review_title": "It stinks, no matter how you look at it",
        "review_detailed_main": "Wow, what can you say about this? It was clearly made completely aware of its own crappyness, which kinda takes away the fun for me. I mean, they deliberately made this film to be as ridiculous and cheesy as possible, so of course the result will be this incoherent mess.\n\nThe puppets are most of the times just static, and when they jump on people the actors (and I use that term very loosely) grab them and shake them as if they were attacked, it's just dreadful. The plot is beyond stupid, the whole bar scene last forever, and all the characters are a disgrace. You really can't put this movie in any genre also, because it fails in every level imaginable. I don't think a single person dies in the whole movie, not even the guy who gets completely engulfed in flames, so even the synopsis is a lie.\n\nThis movie is terrible, and honestly, I don't mean it in a so-bad-it's-good kind of way, because for me, in order for that to happen, the director has to be honest in the first place. BIRDEMIC and JACK-O are good examples of this, they really tried, but luckily for us, failed miserably. HOBGOBLINS is just a bad rip off of GREMLINS meant as a cash grab, taking advantage of the bad movies cult. The trivia even confirms that the director personally contacted the MST3K crew so they showed one of his films, but eventually sent them this one.\n\nAvoid this crap unless it's in the MST3K format, because to be fair the episode was truly hilarious."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Mookman",
        "review_rating": "1",
        "review_title": "\"If I run out of vomit, can I borrow yours?\" MST3K",
        "review_detailed_main": "I once thought that \"The Stoned Age\" was the worst film ever made... I was wrong. \"Hobgoblins\" surpassed it in every way I could imagine and a few I couldn't. In \"The Stoned Age\" I hated the characters. In \"Hobgoblins\" I hated the actors... and everyone else involved in creating this atrocity. I won't include a teaser to this film, I'm not that cruel. I couldn't subject innocent people such as yourselves to such torment. In fact, any discussion of plot pertaining to this film is senseless and demeaning. Words I would use to describe this film are as follows: insipid, asinine, and ingenuous.\n\nIn conclusion, PLEASE don't watch this film. I beg of you, from one movie lover to another... no, from one human being to another, PLEASE. For the sake of your own sanity and intellect DO NOT WATCH IT. Destroy any copies you come across."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mlhyer-479-199080",
        "review_rating": "1",
        "review_title": "THE ABSOLUTE WORST",
        "review_detailed_main": "The worst thing that has ever happened anywhere at anytime to anyone."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "director9ff",
        "review_rating": "1",
        "review_title": "it is not #2, it is #1 worst film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "yodaccm",
        "review_rating": "1",
        "review_title": "Oh My God",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "lee_eisenberg",
        "review_rating": "2",
        "review_title": "trip the tables, whether or \"MST3K\" or not",
        "review_detailed_main": "In one of the many ultra-crummy movies that Mike, Servo and Crow have to watch on \"Mystery Science Theater 3000\", a bunch of weird little monsters get loose and start wreaking havoc (which of course is the same thing as \"Gremlins\" and \"Ghoulies\"). The only reason that I stopped short of giving \"Hobgoblins\" 1/10 is that is has some sexy scenes. Of course, that's probably only because the director needed filler. Let's face it: when the same table gets tripped multiple times, you need a lot of filler.\n\nSo, the movie on its own is 2/10, but the \"MST3K\" version is 10/10. Pearl sure was cruel to make those guys watch this."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "goreilly40",
        "review_rating": "1",
        "review_title": "The worst of the worst",
        "review_detailed_main": "This movie has to be without a doubt the worst movie I have ever seen. Awful dialogue, poor and over acting, so many continuity errors, poor story lines, even the soundtrack didn't make any sense, nothing good can be said about this movie other than it provided the basis of the best episode of MST3K. This \"movie\", and I use the term loosely, was tailor made for MST3K and the director got what he deserved when Mike, Servo and Crow personally mocked him for inflicting this garbage on us. Don't watch this movie without a sick bag nearby, in fact don't watch this movie at all, except with the assistance with Mike and the guys. Do so at your peril, you have been warned."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "AshenGrey",
        "review_rating": "1",
        "review_title": "A D-Rate \"Gremlins\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Ralph Monroe",
        "review_rating": "",
        "review_title": "A good movie with a bad rap!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "X-the-Unknown",
        "review_rating": "1",
        "review_title": "The Passing of the Mantle of Terrible Direction",
        "review_detailed_main": "Ye, and it came to pass that The Crud Master Wood, friend of Bela and lover of cashmere, didst drink himself to a hasty grave, and his earthly vision did fall by this into oblivion. But lo, whilst his spirit did leave for Eternity, his mantle of overpowering lack of a cinematic clue did yet survive, and was handed down to his celluloidal scion, the Crud Master-in-Training Rick Sloane: behold \"Hobgoblins,\" the heinous nightmare-work of the cine-ignorant heir apparent, the dauphin de Plan 9 ideals, the dunderkind director-scribe. Behold the insipidity at all levels of production...ALL LEVELS OF PRODUCTION. Behold, the film so cruddy that it has revealed to legions of proto-directors that maybe accounting, or verily hotdog vendorship, would make a better career choice for many of Sloanian caliber. And the audience didst wail and gnash teeth.\n\nAnd so it came to pass... may it not pass again.\n\nX the Unknown"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "drew_starr",
        "review_rating": "2",
        "review_title": "Another candidate for the 'how not to do it' school of film-making",
        "review_detailed_main": "For every really great film that we see in cinemas, there are 100 really bad ones made at the same time. For every really great film made, there are 100 really bad films that are basically about the same thing. For example, Scrooged starring Bill Murray is about an evil business man who goes through a change of heart at Christmas time and becomes a loving caring man who loves Christmas. Santa With Muscles stars Hulk Hogan as an evil businessman who gets amnesia and thinks he is Santa Claus, becoming caring and loves Christmas. Movies with similar stories, but whereas Scrooged is a brilliant film, Santa with Muscles is not.\n\nHobgoblins seems to be, to me, a really bad Gremlins clone featuring lots of annoying kids and evil ugly furry little creatures, like the Gremlins. However whereas Gremlins was a brilliant and funny movie, Hobgoblins is not.\n\nIt does have its moments, like the first time we see the Hobgoblins, one of the funniest moments i have seen in film - truly dire example of film, but funny because of it. The acting is very low quality, and the characters are intensely annoying and badly written.\n\nThe film has a nice concept of the Hobgoblins being evil little creatures who use a form of telepathy to control people and allowing them to act out their deepest most carnal desires, or in some instances, forcing them to act out on carnal desires that normally would make them physically sick. The only way to stop the creatures is to kill them all before dawn. It has the potential to make a good film and it is an interesting idea but unfortunately it is just very badly executed, with little thought being given to the characters, the script, the direction, sets, make-up, locations, editing, sound, props, and really everything you could think of. The continuity in the film is really bad, in fact it makes Spiderman look continuous. Especially the very end. Watch it and prepare to see something that is laughingly bad and just utterly unbelievable at the end. The only reason to watch this film is because, like with most truly awful films, it is so bad it's funny.\n\nIt is just about possible to survive this film under normal circumstances, but i recommend watching this one with MST3K insulation as Mike, Tom and Crow make it a lot more bearable. (MST3K insulation is something that is familiar to people who have read my other reviews of bad films. Basically MST3K insulation means that Mike or Joel and Tom & Servo make the film bearable with their quips and riffs. They insulate you from the spirit-sucking soul-crushing badness of the film. MST3K insulation - never watch a bad film without it).\n\nGets one star for being so bad that it makes you laugh till you hurt. Just about crests 2 stars for a half interesting plot. The total lack of anything else stops it being 3 stars."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Woodyanders",
        "review_rating": "1",
        "review_title": "The absolute pits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "hannamyluv",
        "review_rating": "1",
        "review_title": "You have to watch the MST3K version",
        "review_detailed_main": "It is a bad, bad movie but watching while Mystery Science Theater 3000 is commenting on it is AWESOME! MST3K #907. Laughed the whole movie through.\n\nIt is really hard to tell if the movie maker meant it to be this awful, as a commentary on the cheesy genre of almost cute monsters. Some of the script seems to be intentionally satirical, while other parts just seem like a seriously misguided director and writer.\n\nThe actors are so bad that it is hard to believe that they didn't mean to be acting that badly. I have seen 5th graders attempting Shakespeare that was better.\n\nDon't watch this straight . Bad, bad, bad. But it makes great comedy fodder for MST3K."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mad_hatter_007",
        "review_rating": "1",
        "review_title": "Laugh, or hara-kiri?",
        "review_detailed_main": "For the love of Christ, do _not_ watch anything other than the MST3K version of this \"film.\" After watching \"Hobgoblins,\" I wasn't sure whether to laugh or commit hara-kiri. This movie exerts an eerie fascination that makes you want to keep watching it, even as you know it's rotting your sanity away. The rake fight, the puppet-monsters, the hand grenade...these themes will haunt your dreams and anthropology papers for years to come. The plot, allegedly about a bunch of gremlin-creatures that grant your wishes with a nasty twist, has no continuity. The viewer is never sure what is going on, knowing only that it is wretched. The Club Scum scenes are almost unwatchable due to horribleness. Viewed with friends, you'll all provide even more hilarious commentary in order to keep yourselves sane. Only if you watch this movie alone can you fully understand the horror that is \"Hobgoblins.\" Worst. Movie. Ever."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "cLoNe",
        "review_rating": "1",
        "review_title": "It's so bad that it's good!",
        "review_detailed_main": "I watched it in \"Mystery Science Theater 3000\", so I'm not sure it will be fun to watch it without the funny one-line comments from the MST3000 puppets... It's seems like a very bad combination of Gremlins (note: Gremlins is one of my favorite movies of all times), Critters and an early 80's teen party movie. It's all done very badly: The script, the direction, the cast EVERYTHING. But it's so bad that it's good. Better watch it with friends!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mark.waltz",
        "review_rating": "1",
        "review_title": "Stupid is as screenwriters write.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Lestyr",
        "review_rating": "1",
        "review_title": "AAUUUUUUUUUGHHHHHHH!",
        "review_detailed_main": "There are exactly four films which compete in my contest for the worst film ever. At number four, we have \"Puma Man\", an incomprehensible pathetically written piece of Aztec-Alien-Pumaman junk. At number three, we have \"The Incredibly Strange Creatures Who Stopped Living and Became Crazy Mixed-Up Zombies.\" This is the most second most boring film, period. At number two, we have \"Revenge of the Teenage Vixens from Outer Space,\" NOT on MST3K (Sorry, guys, but it's gotta go on there sometime), which had the second worst special effects ever. And what was number one? The movie that beat all these films in the aforementioned categories, \"Hobgoblins.\" Not only does it have the worst script, the worst moving along of tale, and the worst special effects, but it puts up \"Revenge\" actors for the Oscars. Can ANYTHING even compare to the infamous \"Club Scum\" scene? WHO MADE THIS THING? I want to know! So horrid, not even MST3K can fully save us from its wrath. Watch it at your own risk!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "zmaturin",
        "review_rating": "",
        "review_title": "You know, there's a point where it stops being a movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Sequels!",
        "review_rating": "2",
        "review_title": "If you're lucky, you can see the puppeteers' hands!",
        "review_detailed_main": "This movie doesn't deserve to be the third worst movie ever made. This movie is too unintentionally funny. It's the fifth worst. The main problem with this movie is not that it doesn't make any sense, it's that I understand the sense that it does make, and that's creeping me out!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "kevin_robbins",
        "review_rating": "3",
        "review_title": "This is a lazily made critters like movie that's not really worth your time",
        "review_detailed_main": "Hobgoblins (1988) is a movie I recently watched on Tubi. The storyline follows a research facility with a section kept from people where hobgoblins reside. One day the wrong new security guard ventures to that section and accidentally releases them. He will need to work with an old security guard and some friends to capture them.\n\nThis movie is directed by Rick Sloane (Blood Theatre) and stars Paige Sullivan (Superior Court), Billy Frank (Seabiscuit), Tamara Clatterbuck (Days of Our Lives), Duane Whitaker (Pulp Fiction) and Jeffrey Culver (Virgin High).\n\nThe storyline and execution of this is an obvious Critters ripoff. The special effects are awful and the creatures are painfully obvious puppets. Some of the scenarios in this are funny. The guy obsessed with phone sex had me cracking up. However, the dancing in this is painful to watch.\n\nOverall this is a lazily made critters like movie that's not really worth your time. I'd score this a 3/10 and recommend skipping it."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "SithApprentice",
        "review_rating": "1",
        "review_title": "Shockingly awful",
        "review_detailed_main": "Thanks to everyone's favorite movie riffing show of the 90s, good old Mystery Science Theater 3000, movie lovers worldwide have been able to experience some of the worst dreck cinema has to offer. With artistic abominations such as \"Manos\": The Hands of Fate, \"Space Mutiny\", \"The Wild World of Batwoman\" or \"Robot Holocaust\", our understanding of bad movies has changed completely - next to these pitiful excuses for motion pictures, Ed Wood's \"Plan 9 from Outer Space\" looks like sci-fi extravaganza, and \"Glen or Glenda\" like a serious contender for an academy award nomination.\n\nBut just when I thought that movies can't get any worse than, say, \"Manos\", MST3K unearths another cinematic catastrophe that lowers the bar even further - if that even sounds like a possible feat. In this particular case, \"Hobgoblins\" was the movie that surprised in a most displeasing manner...\n\nBut let me start with the, ahem, \"story\". Our protagonist is a teenager named Kevin, and life hasn't been too kind to him. Apart from being plagued by the most insensitive girlfriend imaginable, he has to make a living as a security guard on an abandoned movie lot, together with old McCreedy, who has been working on the lot for decades. One night, while walking through the halls of the studio, Kevin stumbles over a vault, and being the moron he is, he immediately opens the vault and thus releases...THE HOBGOBLINS! As McCreedy reveals, these small, green critters once arrived on the lot from outer space, but due to their unfortunate ability to kill people by making their fantasies come true, McCreedy imprisoned them within the vault (because, you know, killing and getting rid of the problem them would have made too much sense...). Now, it is up to Kevin to kill the creatures before they can do serious harm to his (utterly idiotic) friends or anyone else...\n\nFrom the moment you first see the Hobgoblins, you know that this flick is nothing more than a cheap rip-off of 80s hits like \"Gremlins\" or \"Critters\", and to be fair, this could have worked and provided us with mindless low-budget fun. But unfortunately, what we got instead turns out to be a disaster of epic proportions. First of all, what's with the design and look of the creatures? The makers of this film obviously didn't even attempt to make them look passable, since all we see painfully obvious hand-puppets that move in a terribly awkward manner and look absolutely pathetic. But trust me, they're not the biggest problem this movie has. Even worse is their peculiar ability. Honestly, it sounds like a decent concept on paper, but the fantasies the creatures make real are...well, unspeakable. Kyle, for example, a pitiful loser and friend of Kevin, is phone-sex addict, and thus the creatures lure him into a date with the supposed girl behind the voice. And to kill him, the illusion-girl (fittingly called Fantazia...) tries to push the car she and Kyle are in over a cliff...o-kay. As if that wasn't dumb enough already, we also witness Amy (Kevin's icy \"girlfriend\") fantasizing about becoming a stripper in \"Club Scum\" (no kidding) or sex-addict Daphne fantasizing about making sweet love to her army-friend Nick within his car...well, you can tell that the script-writers were not only inept, but quite naughty as well. Sure, it's just a sci-fi flick, so maybe I sound overly critical, but the story of this mess is just painful. It's full of logical errors and moronic characters acting dumb to advance the plot, and just wait till the end of the film...ugh.\n\nAs I mentioned earlier, the creature design already reveals how ineptly made this film is, but this is just the tip of the iceberg. Apparently, none of the folks involved had any knowledge about professional film-making. Pace, camera-work and storytelling are just chaotic, and the best example can be found during a scene in Club Scum: the characters are calmly sitting at a table and listening to a band performing. And this goes on for about 2 minutes. No kidding, we have the same camera angle for 2 straight minutes focusing on the stage, as if it was supposed to be a shameless advertisement for the band. No need to mention other action scenes such as the infamous garden-rake fight that is dumb in itself already and goes on for what seems like an eternity.\n\nAnd the actors? Don't get me started on them...throughout the entire movie, all you see are pure amateurs, stumbling awkwardly through this mess and delivering their lines in the worst way possible - just the icing on the cake in this film.\n\nHaving seen the likes of \"Robot Holocaust\" and now this, I highly doubt that there are worse movies the 80s have to offer. This movie more than deserves its place in the IMDb bottom 100, and I'd go as far as saying that it should remain there for years to come...I refuse to believe that movies could possibly get worse than this."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Gafke",
        "review_rating": "1",
        "review_title": "Abysmal",
        "review_detailed_main": "A young weenie gets a job as a security guard at an old film studio and unwittingly releases a vicious horde of HOBGOBLINS! The alien creatures have the ability to kill people by granting them their dearest wishes. Thus, the weenie's uptight girlfriend, another virginal weenie and an oily dork all end up being victimized by the furry muppets...though sadly, none of them die. Weenie #1 must save the day and battle the hobgoblins with the help of the elderly security guard he works with, who has been keeping the goblins secretly imprisoned all these years!\n\nTerrible acting, hideous fashions, worse music and totally unsympathetic characters who all deserve to die make this almost unwatchable. Worse are the hobgoblins themselves; immobile puppets that have to be held and shook by the actors to create the illusion of menacing life. Hard to believe that anyone in this mess made it out unscathed, but watch for Duane Whitaker (Pulp Fiction & The Devils Rejects) in the ridiculous Club Scum sequence.\n\nCheap, idiotic and painful. Redeemed only by the commentary of Mike and the 'bots. A big fat ZERO on a scale of 10."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "summer1967lovechild",
        "review_rating": "1",
        "review_title": "Komedy!",
        "review_detailed_main": "\"Hobgoblins\" is, without a doubt in my mind, the worst movie ever made (yes, it is worse than \"Manos\"). Combine misogynistic non-humor with ridiculous hand puppets that wouldn't fool a house cat, and you've got this steaming pile of garbage. I mean, what the hell was Rick Sloane aiming for with this \"film?\" Horror? Comedy? Well, he failed. The acting is positively atrocious, there is no plot whatsoever to speak of, and the characters are so unlikeable that you want to watch them all suffer horrible, agonizing deaths. The only way to view this movie without your head exploding is with the help of the late, great \"Mystery Science Theater 3000.\" The movie is so bad that it makes for a great episode of MST3K."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "JoshuaM",
        "review_rating": "1",
        "review_title": "Perfect \"Mystery Science Theater\" fare!",
        "review_detailed_main": "I saw this film on \"Mystery Science Theater\" ... and if there ever was a better film to be the target of derision, I have yet to see it. Absolutely and unintentionally hilarious in its lack of talent, inspiration, and originality. Crow and Tom did a much better job on a \"review\" than I could ever do, so watch for the \"MST\" episode on re-runs!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "parkerbcn",
        "review_rating": "5",
        "review_title": "Quite fun!",
        "review_detailed_main": "One of the many \"little creatures\" films spawning from the success of \"Gremlins\" in the 80s. This one is sometimes considered one of the worst pictures ever made and as always that categorization is very debatable. The movie is really bad, but it never even tries to be good and it's quite fun with the right (wrong?) frame of mind: with the unarticulated creatures, the ridiculous group of characters and some music highlights, like the musical punctuation of every hit or strike."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "sccrwsmr",
        "review_rating": "",
        "review_title": "NO NO NO NO",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "RufusT",
        "review_rating": "1",
        "review_title": "Absolutely awful.",
        "review_detailed_main": "How do people get the money to make things like this? Surely no one figures to get their investment back.\n\nSecondly, why do people make things like this?\n\nTotally devoid of anything remotely resembling entertainment value, this piece of dreck appears to have been made purely as an excuse to ruin some perfectly good film stock.\n\nPutrid script, nonexistent direction, abysmal effects, acting that would shame the worst community theater group, and an apparent contempt for the audience watching it, HOBGOBLINS fails on every conceivable level, even by the low, low standards of low (no) budget filmmaking.\n\nAnd I use the term filmmaking here in the loosest of possible terms.\n\nAppalling, absolutely appalling."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Blue Raven",
        "review_rating": "1",
        "review_title": "This so-called film makes all the \"Chuckie\" movies look like Oscar-winning masterpieces.",
        "review_detailed_main": "Description: Corny, utterly stupid and worthless. It's so cheap and lame, it'll make you wonder why these abnormally dumb people even wasted 2 months or so to spend a budget (I'm guessing this...) probably no more than 700 dollars to make this movie. It was just hysterical to watch with or without Mystery Science Theater. I am giving you the best advice in the world:\n\nSpare yourself, spare your time, life, and money, by NOT--I repeat, NOT even ponder about whether you should see this movie. This movie is so corny, it'll make your face turn purple of outraged boredom. If you have a one-digit IQ, then be my guest and watch this absolutely despicable movie. You might actually admire it. (Like I said before, IF you have a one-digit IQ)\n\nWith about 12 actors of your own, a few puppets you bought at a garage sale, and of course cameras and music, I gaurentee you'll make a slightly more entertaining home video than this piece of absolute crap."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "PJS-5",
        "review_rating": "1",
        "review_title": "0:0 out of 5 stars,1 completely imcompetent bloated gremlins-ripoff mess.",
        "review_detailed_main": "Now shall I start off here,actually I think i'll start with the positive true the film got 1 step higher than \"Manos the hands of Fate\" in fact 1st place in the bottom 100 of the IMDb but I honestly thought this was a crum b of a bit better why because at least the storyline was actually noticeable so you can tell what the sam hill its suppose to be (incompetently-made storyline but it's actually there),not for the rest of my review 1st the \"hobgoblins\" were placed as plush doll ripoffs of the spectacular \"Gremlin's\",2nd the whole mess wouldn't of started if somebody actually locked the dang vault door,3rd the group of teenagers more looked like the dopier-cheap versions of the \"Save by the bell\" teen crew(without lisa(lark voorhes) thank you very much),3rd actually the security guard(old one) didn't do such a bad performance but that ain't enough to save this wretched film at all (not even enough to compare this to other lousy films),4th the plot twists are 100% purly idiotic,5th feminists are going to have a loud complaining fit on this trash(the nice girl ends up doing slut strip dancing & even well enjoys being treated like a slut,& I won't talk about that freaky lust-crazed(for her boyfriend) highly skinny girl),I'd like on the MST3K episode of this movie M&TB did an interview with Rob Sloane(the director of this trash) where mike held up the cutout of RS,crow provided the voice,& servo asked RS such questions like \"Were you on crack when you made this movie?\",I'm rather surprised they didn't do such things like this on other B-movie directors like Hal P. Warren(Manos the hands of Fate),Arch Hall Sr.(Eegah!) & other such infamous presumably never been in film school directors,but one thing to see is that if you mild down the noticeable plot this film would truly have gone into the level of \"Manos the Hands of Fate\""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mike g.-2",
        "review_rating": "1",
        "review_title": "OH......MY!",
        "review_detailed_main": "Never, and I mean never, have I seen anything like this. It is just unreal as to how atrocious this thing was. The only logical conclusion I could come to was that Rick Sloan intentionally made it like this. There is no possible way something this bad could have been made by accident. Sloan knew he wasn't rich enough to make a great movie, so instead he sets out to make something so bad that noone will ever forget it. Usually bad movies fade from memory fast because they're so uninteresting, but not this one. This one actually blew your mind with it's stupidity. If this movie was made to be bad, then Rick Sloan is a cinematic genius.\n\n."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Miss K",
        "review_rating": "1",
        "review_title": "I'm a lucky man !!",
        "review_detailed_main": "After reading all the rave reviews this movie got, I just felt compelled to see it. And guess what ; my local video store had a mint, original , without the 'MST3k' dubbing, copy DUBBED in French.. Am I not lucky ??? I was bracing myself hard with my brother to see one of the most horrid movie there is....And let me tell you, I haven't laughed this hard since....oh..since a long long time...\n\nThis film is so ridiculous its scary and baffling to try and imagine how these people could actually have sat through a post production phase and actually decided to go to print.\n\nWhere can I start : well, let's start at the beginning. The first scene is the one where I laughed the most.. There's this old guy and a kid in a studio who are supposed to insure the security of the place, arguing over a telephone call which the kid didn't pick up but should have, and the scene goes on and on about this, AND THIS IS THE INTRO !! I mean what were these guys thinking !! WHO CARES ABOUT NO ONE PICKING UP THE PHONE !! Is this relevant in any way to the story ???? (which I won't bother explaining cause there isn't any)\n\nThe other scene where I had difficulty containing my laughter was the Rake fight scene. There's the hero who is called a dweeb by his girlfriend, and to prove his worth, tries to fight one of his so called pals in the front garden with rakes. And let me tell you, Darth Vader and Obi Wan are wussies compared to these two individuals. During at least 5 minutes, you can see the SAME ATTACK, WITH THE SAME DEFENSE MOVE, repeated and repeated while the girlfriends stand and watch 'in horror'..HAHAHA...\n\nThere are so many scenes I could talk about here, it would take all day. If you have the god given chance to rent this one, DO IT! It's the best worst movie I have ever seen."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "kosmasp",
        "review_rating": "1",
        "review_title": "Gobbel-Di-Gob",
        "review_detailed_main": "Where to start? That this hasn't aged well? That should be apparent quickly, though to be fair, there are worse movies when it comes to aging. And even the format and quality wasn't top notch back then, so I guess it didn't lose too much. Trying to cash in on Gremlins and/or Critters, this never really achieves that goal or any other comedy goal it set out.\n\nThen again, comedy is in the eye of the beholder, so some will find this quite funny. Especially if they have watched it back then and have a romantic memory of it. It tries to be funny and if you let yourself you can have fun with it. Especially considering all the actors who had to \"wrestle\" with puppets - holding them and shaking them side to side ... it's ridiculous. But maybe funny if you have the right state of mind ... still objectively speaking this isn't any good"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "thetitanicrupert",
        "review_rating": "4",
        "review_title": "A Star for Each Hobgoblin",
        "review_detailed_main": "As an aging man, I heavily relate to the old guard McReady. Guarding his personal demons for thirty years after serving in our nation's military mirrors my own life experiences. When I was in the army during Korea my sergeant ordered me to jump on a grenade or else he would shoot me in the head. I too combusted like Nikki and share the same \"30 seconds of heaven\" \"van stamina.\" It was enough for my multiple wives.\n\nThe Kevin character (The college boy with the salmon colored shorts) reminded me of my grandson. I too have gotten bills from Fantasia whenever he comes to my love-shack. I hope one day he can marry her and start a wonderful family in Winnepeg, CA.\n\nWonderful creatures.\n\n-Rupert Gindersburg (M, 87)"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "aesgaard41",
        "review_rating": "1",
        "review_title": "Yuck !",
        "review_detailed_main": "Why was this movie made ? First off, it is typical trash from Rick \"Slap-It-Together-And-Make-It-Work\" Sloane. The so-called monsters are stuffed toys, and not very scary ones, being shaken by people off screen. None of the actresses are remotely attractive and the plot is a car wreck. as a rip-off of \"Gremlins,\" nothing has been contributed that remotely resembles a script and the so-called fantasies as well as the one-joke characters, are just not believeable. There is no reality or foundation of order required in this weak comedy. Just face it, except for the MST3K version, this just isn't worth seeing."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Op_Prime",
        "review_rating": "",
        "review_title": "Thank the lord for MST3K!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "randhuck",
        "review_rating": "1",
        "review_title": "Best MST3K episode ever!",
        "review_detailed_main": "My favorite quote from Crow was, when the car was going off the cliff, \"The movie is so bad, even the car wants to get out of it!\"\n\nThis had to be the funniest movie I have ever seen. It was seriously out there to scare you, which makes it even funnier! If it weren't for Mystery Science Theater I wouldn't be here today! :-P"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "NateW",
        "review_rating": "1",
        "review_title": "Possibly the worst movie ever",
        "review_detailed_main": "There's a lot of things I'd like to say about this piece of trash, but I'll make it quick. This movie sucks, and sucks very, VERY bad. Everything that could be be bad about this movie was bad. Whoever thought the puppets(which were supposed to be mind controlling aliens)were convincing ought to be checked into rehab. This makes 'Plan 9' look like Citizen Kane. Fortunately I saw this on MST3K(which is about the only way you could sit through something like this)and it made for, I think, the best episode of the series. We should all take a lesson from Pearl: whenever someone misbehaves, just sit them down and make them watch Hobgoblins. But then again, who deserves that kind of punishment?"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "MundaneNoodle",
        "review_rating": "2",
        "review_title": "Revoltingly funny, make that unfunny",
        "review_detailed_main": "Good grief! While I still maintain that Manos: The Hands of Fate is the worst piece of mental torture available, Hobgoblins came awfully close. This...this...thing insults the audience at every opportunity.\n\nAt least films like Space Mutiny and Future War can be enjoyed on mst3k, this one was a struggle to get through. I was literally writhing on the couch in anguish. This thing managed to embarrass me - alone!\n\nEven if you are a die-hard MST3K fan and have made it your mission to see every single experiment, think twice about seeing this one.\n\nIt's that bad."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "sethn172",
        "review_rating": "1",
        "review_title": "Ooh...creepy!!!!!",
        "review_detailed_main": "Yeah, that best sums it all up.\n\n\"Hobgoblins\" is, by far, the most retro-like of all the recent horror film classics out there. I think the people that made this movie have done a very great job making it look like an original 1950s horror classic like \"The Blob!\" Who can remember that drive-in classic about what else but...a blob! This movie is like that, except - instead of a blob, we've got hobgoblins! Watch this movie as originally intended (in a real theater), then watch it on \"Mystery Science Theater 3000\" and notice the differences! Sorry, but I'm giving this one star because this is an MST3K movie!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Matrixgirl04K10",
        "review_rating": "1",
        "review_title": "Dear God...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "kylesellars-33776",
        "review_rating": "1",
        "review_title": "You can tell how bad a movie is just by looking at the trailer",
        "review_detailed_main": "well You can tell how bad a movie is just by looking at the trailer i can already tell that this is a Gremlins ripoff Just by looking at the trailer The horrible acting The hobgoblins while i'm on the subject the hobgoblins aren't even puppets,more like fuzzy throw-pillows There's a movie on YouTube that is way better then this Called Damien Demento IV - Full Movie - By Kyle Sellars Just copy and paste the title or right click and highlight the text and click the option that says Search Google For \"Damien Demento IV - Full Movie - By Kyle Sellars\" Either way works Damien Demento IV might not be famous it might have 40 views 3 likes and 0 dislikes and yes the hobgoblins movie on youtube has 169,368 views 578 likes and 63 dislikes but Damien Demento IV has more positive reviews on YouTube then hobgoblins and not as many dislikes."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "TalesfromTheCryptfan",
        "review_rating": "2",
        "review_title": "A ghastly experience worth viewing only on MST3K!",
        "review_detailed_main": "A newbie security guard at a Hollywood studio is getting training from an old security worker that has been working for 30 years, unfortunately as he chases after a crook he accidentally releases a horde of magical creatures from the old film vault as they begin to cause mayhem. They seem to have a magical power to find a person, tap into his/her mind and create wild yet dangerous fantasies, however they are attracted to bright light and can be killed but they have be destroyed before dawn or else it's too late.\n\nA movie so bad that it makes \"Leonard part 6\" look like an Oscar winner, Rick Sloane should be ashamed for making this piece of crap rip-off of \"Gremlins\". Thank the good lord that MST3K crew riffed on this garbage, maybe they have suffered for this worst sin of a movie to hit the screen no thanks to Rick Sloane.\n\nIf you want a fun \"Gremlins\" inspired movie, see \"Critters 1 & 2\" instead but watch this ONLY in the Mystery Science Theater 3000 version which i give a Five reels out of and the Un-MST3K version Zero reels."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "tutt6079",
        "review_rating": "",
        "review_title": "i wish i was a hobgoblin!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "homer_simpson91",
        "review_rating": "1",
        "review_title": "One of the worst",
        "review_detailed_main": "I do not exaggerate when I say HOBGOBLINS is the worst movie I've ever seen in my entire life. This movie has everything wrong with it. Horrible acting (it's no wonder that just about all the leads have never been in another picture), terrible cinematography, very bad directing, bad editing, horrific dialogue and a bad story. Rick Sloane must be the anti-Christ to make this film. If you see it, I'm sure you'll agree.\n\n1/10"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Rebochan",
        "review_rating": "1",
        "review_title": "Almost as much fun as running into a wall",
        "review_detailed_main": "This movie should not be viewed unless you are trying to kill yourself. I think this movie could actually cause severe brain damage. The main characters are the whiny non-hero Kevin, Amy, his bratty, ungodly conservative girlfriend, Kyle, a dork in red shorts who enjoys phone sex, Daphne, a scrawny, horny girl who is supposed to be \"cool\" and has no sense of how to dress, and her oversexed boyfriend Nick, an army recruit who can make an innuendo out of anything. No, I'm not a pervert, that's REALLY how the movie goes. The movie itself is an over-sexed rip-off of 1986's Gremlins, only you'll never find a trace of Gizmo anywhere. No, these Hobgoblins, unleashed by Wimpy Man (I'm sorry, Kevin), make someone's wildest dreams come true, and then kill the victims. Yes, you guessed it-Eventually, they wind up in a strip club, where the nerdy Amy's greatest dream is revealed-She wants to be a stripper! Look, I watched this flick via MST3K, and even with Mike Nelson, Tom Servo, and Crow T. Robot making a laughing-stock out of this cinematic trainwreck and it still made me bleed from both eyes. Not really, but I wish I had. I'm not giving you anymore plot, because reliving it gives me this great urge to drive a pitchfork through my brain. Besides, it's not like there's a plot worth mentioning. They should put a Surgeon's General Warning on this film."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "agfw",
        "review_rating": "2",
        "review_title": "Goblin Hobs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "The Buried Life",
        "review_rating": "1",
        "review_title": "Intentionally Bad, but...",
        "review_detailed_main": "... Bad at being intentionally bad...\n\nThis little gem shot straight onto the MST3k big screen. While it's obvious the movie isn't trying to be taken seriously (Hopefully that their goal, anyway...), the movie is still plain bad. Hell, it makes Leprechaun In Space look big budgeted...\n\nIn short: Paint my muscle car prune colored!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "dcb-4",
        "review_rating": "2",
        "review_title": "They hope you saw Gremlins 1 & 2, and still crave more!",
        "review_detailed_main": "Remember Gremlins? Wasn't that a fun movie? And Gremlins 2: Electric Gremlinpoo? Or whatever? Wasn't that one fun, too? Well here comes a movie from some people who hoped you saw Gremlins 1 & 2, Ghoulies 1 through 4, Troll 1 & 2, and even some of the lesser Muppet movies, and yet still crave more!!!! Somehow, a bunch of hobgoblins have been locked up in a film vault in a film studio (coincidence? I don't think so...), and they must be kept in there or the mayhem they cause will destroy the earth.\n\nSo, someone is constantly leaving the door open.\n\nNo, seriously. Every time they go towards the vault, the door is already open.\n\nThe hobgoblins mostly do things to your mind, that way they don't have to actually interact with people, because....Well that stuff's expensive! There's also about five people in the movie, and all of about five sets. Not much happens. Perfect for riffing. I saw this as part of Elvira's 13 Nights of Halloween on Hulu, but MST3K did a much better job. Either way, don't watch it without a guide. It could be dangerous to your mental health."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Fishbait",
        "review_rating": "1",
        "review_title": "Deep hurting.",
        "review_detailed_main": "As a movie, this makes a good episode of \"Mystery Science Theater 3000.\" That is the only good thing about this movie. A directorial debut by Rick \"Vice Academy\" Sloane, this movie is hilariously bad when it tries to be horror, and painfully atrocious when it tries to be a comedy. Full of misogynist themes, obvious \"Gremlins\" rip-offs, and a few lousy eighties songs to round it out, \"Hobgoblins\" is a movie to be avoided. With a movie like \"Manos: The Hands of Fate\" you at least get the feeling that someone on the set cared about the film and the plot. There's no comfort here, this is obviously a cheap, cynical attempt to cash in to the \"camp B-movie\" trend of the eighties, and fails even as a fun popcorn movie."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "HBK-MST",
        "review_rating": "1",
        "review_title": "Maybe films should be made by \"FILM-MAKERS\" from now on...",
        "review_detailed_main": "In my opinion the worst movie ever made. Although Rick Sloane made this disgusting movie, I do want to thank him for making Mystery Science Theater 3000 possible. Without movies like Hobgoblins, there would be no MST3K (sniff, sniff). Don't ever think about seeing this movie unless it includes Mike, Tom Servo, and Crow sitting in front of the screen making their trademark wise-cracks.\n\nGet well soon, HBK!!!"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Crowbot-2",
        "review_rating": "1",
        "review_title": "I've met Rick Sloane",
        "review_detailed_main": "Yep.. this is definatly up there with some of the worst of the MSTifyed movies, but I have definately seen worse. Think Gremlins rated R. Well anyway, I met Rick Sloane at some sci-fi convention, that amazingly, he was lecturing at! It was one of those really low budget conventions, where everything goes, an everyone brought in something (if you want to see crap, you should have of seen what some friends and I brought in).\n\nHe seemed like a very nice guy, he was very cool about my questions and comments on Hobgoblins, and he even told me not to take it seriously, and said he loved the MST3K version!\n\nAll in all, Rick Sloane knew what he was doing. And I think was meant to bad like Mars Attacks. So I guess I'm standing up for this movie and giving it a 5, and betraying all my fellow MSTies. Sorry guys."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "NotHopeless",
        "review_rating": "",
        "review_title": "I can't believe I'm saying this...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "ThorbyB",
        "review_rating": "1",
        "review_title": "Worst Movie in HISTORY",
        "review_detailed_main": "This movie is tragic. Tragic, because it was produced. Tragic, because it was distributed. Tragic, because at least a few of the people associated with it are still alive. Heck, it's sad that ANYONE was associated with it at all.\n\nNot only does this movie suffer from an incoherent plot, poor characters, and bad special effects, it seems as those the very film quality was designed to create headaches. Moreover, based on the greasy and unwholesome sexuality, the feeling is that the directors or writers would prefer to be doing some sort of pornography, but no one would finance them.\n\nThe plot is based around the title hobgoblins escaping from a safe in an old building and running around killing people with their minds. Eventually, they get involved with a 70 year old, incompetent security guard, and a bunch of really weird teenagers (from whom the lewdness is derived). There's a little more detail, but I refuse to think about it. So would you."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "existentialist21",
        "review_rating": "1",
        "review_title": "What a waste of film.",
        "review_detailed_main": "This movie sucked--out all my sympathies for the actors in this film. What were they thinking. The plot insulted the intelligence of the audience. And the \"special effects\" amounted to silly hand puppets controlled by Rick Sloane's incompetent buddies (you could see the arms of the \"puppeteers\"). The film used to make this horrid movie would have had better use as a table decoration, than as a \"cinematic feature\". If you want to experience true B-movie horror, then watch Ghoulies. At least it was tolerable. And I must not forget MST3K! Their take on this movie mirrors my own. But to sum up my feelings: the plot stinks (there is none), the special effects are appalling (plush dolls Sloane probably bought at his local discount toy store), and the acting is pathetic(they will be \"assummed into B-Movie heaven\")."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Olly-4",
        "review_rating": "1",
        "review_title": "Here comes the pain!",
        "review_detailed_main": "For those of you who are fans of Mystery Science Theater 3000, Sifl and Olly, and other such fare, here is proof that a puppet show can hurt you, and hurt you bad.\n\nWhy one would want to see this 90 minute ode to misogyny without the one-liners of Mike, Servo, and Crow is beyond me. But I guess it does take all types to make the world, eh?"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "emma-20",
        "review_rating": "1",
        "review_title": "no oh god no",
        "review_detailed_main": "This is the worst movie I've ever seen.It wasn't even good on MST3K."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Greenman-3",
        "review_rating": "1",
        "review_title": "stink very much bad",
        "review_detailed_main": "Movie BAD!!!!!!!!!! Bad acting Bad puppets Bad fight scenes with lawn utensils Stay away at all costs"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "bbjzilla-25345",
        "review_rating": "4",
        "review_title": "Pops' Corn on the Hobgoblin.",
        "review_detailed_main": "Ultra low budget Gremlins ripoff at least has a truly genius concept; what if rather than just wanting to cause mayhem, they wanted to expose your deepest fantasies no matter how degrading, before sucking your soul or something. Like alien bedbugs.\n\nWith plenty of room for development the makers of this nonsense clearly went with their first draft as their is nothing else going on, jokes are thin, effects are poor (the hobgoblins look like cuddly toys on sticks and have as much nuance) and in the hands of a better filmmaker, more time or investing of talent could have be more entertaining.\n\nContinuing the Gremlins theme there's even a Rambo spoof, and I wonder how much of this Joe Dante saw before Gremlins 2 as the little critters magical powers are ripe for exploiting different film styles as each character explores their fantasies.\n\nSadly most of the fantasies here involve repressed sexuality and in many ways it's like a porno with no porn but at least it's fun watching people lose then rediscover their inhibitions without worrying about real life."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Ultimex_Varptuner",
        "review_rating": "1",
        "review_title": "The Most Meaningless Experience Imaginable.",
        "review_detailed_main": "It is at the point where the character 'Pixie' lollops across the floor of Club Scum. She's moving like demented totem-pole on legs, her stupid Marge Simpson hairdo standing up a clear six inches higher than her arms which are raised at right angles. She moves in a bizarre extended gait that tries (and fails) to register her horror at the appearance of the hobgoblins. The purported dive of a club across which she runs is actually some form of cafeteria, replete with plastic tables, a serving hatch instead of a bar and punctuated with advertisements for products such as 'beer' and 'sex' highlighted by tinsel.\n\n'Good day old chap. Can I have a beer and sex please?'\n\nIt is at this moment that mentally I pack my bags and give up on Hobgoblins.\n\nDon't think I'm stupid, deluded or both. I went into this with my eyes open having read each and every one of the reviews posted on IMDb. For some reason though, I thought I knew best. Okay, so you all thought it was soul-splittingly bad, but I like bad films. I'll like it. I even took the bold decision to watch the non-MST3K version, so sure was I that it's badness would translate as good.\n\nSadly, it isn't a question of simply bad or good.\n\nObviously this film isn't good. The directing is beyond inept, the acting non-existent and there is no pacing, no tension and no humour to speak of.\n\nTechnically however, I couldn't call this film bad either. For a film to be bad it has to try and fail but hobgoblins doesn't even try\u0085 anything. Any action, any opportunity for a set piece or anything which might further the plot simply comes and goes without event, solution or explanation. Take for example the scene in the house where the main characters first encounter the hobgoblins: They don't even try to pretend that they are actually being attacked, instead simply hold the puppets while delivering their lines dead pan.\n\nIt took me some time to work out how to classify this uniquely unenjoyable experience but in the end I came to the conclusion that it isn't actually a movie. It's just a series of random scenes on DVD. Like watching a DVD of some paint drying.\n\nOther reviewers have mentioned bad parts of this film which to me sounded like they might be quite fun. For example the rake fight, the odious slut (who actually isn't even that), the horrible big-arsed bloke who's addicted to sex lines and the crappy puppets but the truth of the matter is that Hobgoblins is so profoundly meaningless and without personality that these inept features fail to even raise a derisive smile.\n\nHobgoblins is a vacuum of an experience that I beg you to never, ever embark upon no matter what the temptation."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "geminiredblue",
        "review_rating": "2",
        "review_title": "An Accident at the Studio!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "One of the best MST3K episodes!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "shaykelliher",
        "review_rating": "1",
        "review_title": "Amazingly Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "john_q_public_69",
        "review_rating": "1",
        "review_title": "What A Steaming Pile!!!",
        "review_detailed_main": "It may have been the director's dream to make this movie but it turned out to be my nightmare. I don't know which was better, the ten minute rake fight, or the guy who catches on fire because he lands on a hand grenade and then winds up alive in the last scene with only some black soot on himself. I am usually not very critical of plot details but what the hell?!? Oh well, at least I wasn't watching \"The District\" on television."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "alpha13",
        "review_rating": "2",
        "review_title": "what hasn't been said about how bad it is?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "TCurtis9192",
        "review_rating": "1",
        "review_title": "\"HOBGOBLINS\"",
        "review_detailed_main": "\"HOBGOBLINS\" (1988, Sloane) is a sad waste of a film. Yes it's badly made but, in my opinion, it's not funny as well.\n\nBeing a fan of rubber puppets I enjoyed that aspect of the film but everything around them was a failure. Direction, music, acting, plot, pacing, it all fails to generate much of anything. No horror, no comedy, no suspense, no relief, just nothing.\n\nAs far as \"GREMLINS\" (1984, Dante) ripoffs go this is unbelievable. It's amazing they used real cars to be honest."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Jordan-11",
        "review_rating": "1",
        "review_title": "How Did They Do It?",
        "review_detailed_main": "It is incomprehensible that this movie was approved by anyone, anywhere, under any circumstances. Forget \"Plan 9 from Outer Space,\" forget \"Manos, the Hands of Fate,\" forget even \"Yusei Oji\" (also known as \"Prince of Space\"). Those three films are brilliant masterworks compared to the brutally poor \"Hobgoblins.\" I can only hope that writer/director/producer Rick Sloane is an unrecognized genius past his classical stage and into his abstract stage. To loosely paraphrase a well-recognized theater critic who spoke of a similarly bad work: \"There are now two types of people: those who have seen 'Hobgoblins,' and the lucky ones.\" May the gods of cinema save us from another film like this stinker. Amen."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "rauud",
        "review_rating": "1",
        "review_title": "Hand puppets are bad for your skin.",
        "review_detailed_main": "I saw this movie for the first time, as I'm sure many of you have, on MST3K. All I can say is that I cannot imagine the amounts alcohol consumed during the making of this film. My reaction to this movie was threefold. 1) I questioned the notion of a forgiving and good natured god. If one truly did exist, then why was this movie ever made, I asked myself. 2) I questioned the existence of the devil as well. Trust me folks, even the Man-Goat himself would not allow something this bad past the gates of hell. 3) I developed a rash on the back of my neck. I have every reason to suspect that it was the movie itself that did this to me. If you don't believe me then just watch it yourself and see what happens to you. If you too develop the \"Club Scum Special\" as I did, douse it in every antifungal agent known to man."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Leto-13",
        "review_rating": "1",
        "review_title": "Disgusting",
        "review_detailed_main": "How can I describe this vile, repulsive film? Vile and repulsive are probably the best ways. Definitely indicative of the sort of quasi-porno/\"comedy\" movies (if such term can be used) that Rick Sloane would go on to make. Every single character in this movie makes me want to retch. Watching it without the buffering effects of the MST3K crew may be dangerous and is not recommended."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "predator_silver77",
        "review_rating": "1",
        "review_title": "Wow don't know if it can get any worse!",
        "review_detailed_main": "Plot: Now that's a laugh, Something this movie doesn't have is a plot.\n\nMy Spiel: Okay let me throw it down here. A old security guard has a new recruit to train, and takes him threw the normal routine and the new guard notices a area which should be permanently guarded or so the old security guard says. Well Some how..... Just trying to explain this super cheese fest of a movie is bad enough, so work with me here. A ½ of 10 review is too good for this movie. Many people will probably think this is a rip off of \"Gremlins\" or \"Critters\", But in order for it to be a rip off it needs a story, plot, and the creatures are just pain ridicules. about 90% of this movie the director probably just said screw it and just started filming random stuff. But I'm getting away from the story. \"HAHAHA\" I said Story...\" Hobgoblins & Story should never be used in the same sentence. Let me try to focus here. This so called secret totally secure area in which these 2 security guards must protect, Has a giant Safe and is being locked by a twist tie lock. Yes, I said twist tie the same thing that holds air out of your bread. Heck a 2 year old could sneak in this safe. But hiding in this safe are creatures so horrible and deadly, they have the power to warp people in a deadly fantasy illusion which eventually kill's the idiot victim, But what they mostly do is run away and drive in golf carts. \"Wait it gets better\" The director obviously couldn't figure out how to make these little creatures actually move/run/walk and film at the same time so how you know they get from here to there. All you hear is a scamper noise and the terrible actors in this $h1t fest look at there feet and go, wow did you see that! Yes Horrible and deadly is right to your eyes. These creatures spend all the time running and trying to cause mayhem to places you wouldn't give two $h1t's about. Then to end this super cheese fest which can be seen in the picture on the page, They have a mini pod space craft which magically appears out of thin air. I really have nothing good to say about this movie, except the \"Mystery Science Theater 3000\" group made fun of this horrible movie making it at least someone enjoyable to watch. But making fun of this movie is like pooping on poop, it should not be attempted.\n\nHOBGOBLINS (1988) Review: ½/10"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "waltos_1999",
        "review_rating": "",
        "review_title": "It's so bad, even the robots want to get out of it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "mgoodwin97-489-952691",
        "review_rating": "3",
        "review_title": "Slightly cuter than a mogwai fed after midnight",
        "review_detailed_main": "I was going to give it two stars, but I bumped it up to three because of how adorable the hobgoblins are."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Fei Hung",
        "review_rating": "1",
        "review_title": "If you have to watch it.....at least catch the MST3K version",
        "review_detailed_main": "I didn't think it was possible for a horror comedy film to fail so abysmally on both fronts....really awful. The fact that it doesn't take itself seriously (usually a good thing) works against it, primarily because the actors are so wooden you really would swear they are reading cue cards. On the upshot though.....the MST3K version, as always, has a few laughs...."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "rickm-4",
        "review_rating": "1",
        "review_title": "Like watching a train wreck in slow-motion",
        "review_detailed_main": "This movie is so bad, it's almost breathtaking. Every time something happened I thought, this is the low point, it can't possibly get any worse--then it did. The special effects have got to be some of the worst I've ever seen in a movie, the 'hero' (I use that term VERY loosely) is a complete spaz, the attempts at comedy are awful. At least it provided the MST3K guys with a lot of material. Watch this at your own risk."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Leofwine_draca",
        "review_rating": "2",
        "review_title": "Poor Gremlins clone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "thehardyboyz2043",
        "review_rating": "1",
        "review_title": "When idiots try to act...",
        "review_detailed_main": "this is the result. A piece of trash movie that doesn't deserve to even be classified as a movie, it's just a bunch of stuff on a film reel, that makes no sense whatsoever. Well back to the actors, which from the get go seem to be just a bunch of friends who thought they would get a little amount of money together and try to make a movie that would be a great horror film. Well it's a great horror anyway, nevermind being a film. There's plenty of horrific acting in \"Hobgoblins,\" but the worse is the main guy named Richard, who is just way too much of a weakling to even sorta root for. Well, when you cast a bunch of friends and try to make the film scary, on a less than shoestring budget, no less, this is what will happen. Oh well at least the MST3K version was hilarious. But this is still a horrid movie, that deserves all the bashing it gets. 9 for the MST version."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "lurk3000",
        "review_rating": "1",
        "review_title": "Paint my muscle car prune colored please!",
        "review_detailed_main": "What a tragic waste of the human spirit. The \"director\" Ric Sloane deserves a special level of Hell for this. The \"movie\" would have been completely un-watchable if it were not for MST3K. Thank God for Mike and the 'bots who rip Hobgoblins to shreds. The crew of the Satellite of Love went above and beyond the call of duty! I wonder how embarrassed the cast is about this?"
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "gbobeck",
        "review_rating": "1",
        "review_title": "This movie is the worst of the worst of the worst...",
        "review_detailed_main": "Hobgoblins... what a concept. Rick Sloan was a master with this film. He had the brilliance to produce a film with actors that couldn't act. On top of that, he chose to write a script based on some sort of bad acid trip gone serriously wrong. Put it together, you end up with a film that sucks more than a warehouse filled with suction cups and vaccum cleaners. This movie was very painful. The pain it caused is about equal to the pain caused by having your genitals carved out with a spoon, and then having the entire wound covered with salt and Hydrochloric acid."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "wink_man01",
        "review_rating": "1",
        "review_title": "Please tell me this was a joke!!!",
        "review_detailed_main": "Even for the cocaine laced 1980's this is a pathetic. I don't understand why someone would want to waste celluloid, time, effort, money, and audience brain cells to make such drivel. If your going to make a comedy, make it funny. If you want to film trash like this keep it to yourself. If you're going to release it as a joke like this: DON'T!!! I mean, it was a joke right? Someone please tell me this was a joke. please."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "craig_vandertie",
        "review_rating": "1",
        "review_title": "Sounds like a lame and pathetically sad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "InzyWimzy",
        "review_rating": "1",
        "review_title": "Gremlins under influence of mushrooms",
        "review_detailed_main": "Hee hee hee. This movie is so bad that it doesn't even try to hide the fact that it sucks big time. I remember the day I first saw this on MST. Sun was shining, looked like a good day. then, I saw this product of Rick Sloane which consisted of horrible plush dolls wreaking havoc in the crappy 80s fest land. Kevin, wussy extraordinaire, tries to impress his girlfriend, manages an assistant security guard job, fights with rakes, and plenty more stuff in this very badly made series of images. No plot or story is needed. Obviously no acting is necessary as the film proves. An army guy and his sex crazed girl will make you wanna leap off a cliff, and the dorky friend who gets his kicks off phone sex will make you say, \" He has got some nice red shorts\". Plus, I really hated the old security guard and wished he had an accident in his supermarket cart. Just when you think it's over, wait until the Club Scum scene. Ask for Road Rash.\n\nI advise that after viewing this film, a good month to regain senses and sanity. And if you see Rick Sloane, give him a good kick to the groin to show how much we appreciate this crapsterpiece called Hobgoblins."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "cluny",
        "review_rating": "1",
        "review_title": "Worst Film of... any year",
        "review_detailed_main": "This type of garbage makes you wonder what kind of things are allowed to be passed off as \"movies\". If you have not seen this movie, consider yourself lucky and do yourself the favor of never, ever, EVER watching this trash.\n\nThis movie disgraces even the \"1\" in the rating scale."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "thorin_t",
        "review_rating": "1",
        "review_title": "The Mystery Science Theater riffing is almost moot.",
        "review_detailed_main": "Of course you're in good hands with Mike & the Bots, but this movie ridicules itself. Could it be worse than Manos: Hands of Fate, almost universally considered to be the worst movie ever riffed by Mystery Science Theater? The argument can definitely be made.\n\nThough at least 75% of this movie is meandering aimlessly, the other 25% is either revolting you or making you feel embarrassed to be a human being. For instance, there were at least 30 parking shots. The technical: Sound is horrible, lighting is stomach-turning, acting and dialoge are excruciatingly clunky and awkward, and the big brawl in Club Scum is enough to make Ed Wood cringe. The sets are joke: a few people's houses, a bar, and an abandoned warehouse--all standard issue from stereotype catalogs.\n\nThe writers of this film worked their hearts out and really carried it through, though. Hahaha, just a little joke. There were no writers.\n\nThough it attempts to forage a trace of redemption is from its sense of humor about itself, it's hopeless. Don't try to be entertained by this film. If, like Servo, at the opening title you mistake it for the end credits, please, please, take no extraordinary measures to refrain from extricating yourself from whatever viewing area you may be occupying.\n\nThis film is simply one of the worst pieces of cinematic trash ever. Most human beings couldn't make a film this bad if they tried. If you invent a time machine, I implore you to go back to 1980 and kill Rick Sloan, and please don't get sidetracked and just kick him in the shin instead."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "petewadeisreal",
        "review_rating": "2",
        "review_title": "Watch with Elvira",
        "review_detailed_main": "I watch a lot of awful but even with Elvira, this one is a tough sit. Stick with Ghoulies II."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "HBK-MST",
        "review_rating": "1",
        "review_title": "Worst Movie Ever!",
        "review_detailed_main": "Let's make a rule that, from now on, films have to be made by FILM-MAKERS (Sorry, Servo, I had to steal that line). This movie is pathetic, disgusting, and stupid. Don't ever watch this movie unless it's in episode 907 of Mystery Science Theater 3000 because if you do, it may cause blindness or death (Again, I stole a line from MST3K). But, it does make for the best episode of MST ever (in my opinion)."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "ryan-38",
        "review_rating": "1",
        "review_title": "The Worst Film of All Time",
        "review_detailed_main": "What can I say about \"Hobgoblins\" that hasn't be said in this space already? This god-awful piece of soul-destroying trash would have made me slam my head against the wall for hours during and after viewing in a feeble and desperate attempt to forget the mind-numbing spectacle upon the screen had it not been for the earth's three true saviors: Mike Nelson, Tom Servo and Crow T. Robot. Without MST3K, public showings of this film would have to be considered a crime against humanity. However, thanks to the noble folks at Best Brains (who were forced to watch this \"film\" numerous times in a single week for preparation) we have the MST version of \"Hobgoblins:\" one of the funniest things I've ever seen. Thank you so much guys. If the show really does end this summer, there will be no end to my grief.\n\nIf someone reading this is thinking \"Oh, how bad could one film possibly be? He's just exaggerating because MST is supposed to show the worst films ever,\" you don't have to take my word for it. Go out and rent the \"straight\" (Crow-less) version, provided it is allowed to exist somewhere. If you can so much as keep your synapses functioning during it, you have a tolerance for awfulness I would fear more than envy. Just try it. I dare you. If the \"rake fight scene\" doesn't get you, the \"'piglicker' scene\" will. If you get through all that and are able to survive Amy's striptease without jokes, I never want to meet you.\n\nFor anyone else who has seen \"Hobgoblins\" and not read the cast and crew info, Rick Sloane has made TEN (10--count 'em!) movies since this one. The most recent one was 3 years ago -- he could conceivably be working on a new one right now! The degree to which this disturbs me cannot be expressed by mere words. Though someone on this page has already used Crow's comment from the show, I think it more than bears repeating: \"Can we agree that from now on, films have to make by FILMMAKERS?\"\n\nTo summarize: \"Hobgoblins\" is the worst movie ever. Anyone who has seen it will agree with me: the subject is now closed to any and all debate for the remainder of human history. I have nothing more to say."
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "ZombieFan",
        "review_rating": "",
        "review_title": "Hobgoblins, Hobgoblins what do you do with those Hobgoblins.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Orchrist",
        "review_rating": "",
        "review_title": "Dated, Warped, and Pathetic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "SpiderPants",
        "review_rating": "",
        "review_title": "B-Movies Unite",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "hayden2009",
        "review_rating": "",
        "review_title": "MST3k/ hobgoblins",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "bobjohndave",
        "review_rating": "",
        "review_title": "HUH? MUST BE THE PIZZA GUY!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "BHorrorWriter",
        "review_rating": "",
        "review_title": "PG rated \"Horror\" movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "valkyriery",
        "review_rating": "",
        "review_title": "What a load of CRAP!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "shivermetimbers15",
        "review_rating": "",
        "review_title": "Ow. My brain. I think it's shrunk.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Drizzt-3",
        "review_rating": "",
        "review_title": "Hobgoblins is like other movies..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Torgo-7",
        "review_rating": "",
        "review_title": "Why can't I save a few hundred for a guitar, but Rick Sloane gets to make a movie. Proof the world isn't fair.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "jomobes",
        "review_rating": "",
        "review_title": "Could a movie possibly be worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Jonah14",
        "review_rating": "",
        "review_title": "Not to be taken seriously",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "HermanHumpMD",
        "review_rating": "",
        "review_title": "One Of The Best Films Since WW2.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Dethcharm",
        "review_rating": "",
        "review_title": "\"That Bleach-Blonde Witch Almost Killed You!\"...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Weapon0",
        "review_rating": "",
        "review_title": "DEEP HURTING DEEP HURTING",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "DaveInIndiana",
        "review_rating": "",
        "review_title": "Really bad, but funny, with the worst puppets in a movie--ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "russ_15",
        "review_rating": "",
        "review_title": "Definitive garbage film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "knuckleskid",
        "review_rating": "",
        "review_title": "\"The inspiration for Hobgoblins was like a stout...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "The Only Thing Scary Here Is That I Actually Watched This.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "ashspicefilms",
        "review_rating": "",
        "review_title": "So god-awful bad its hillarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "raptor_2",
        "review_rating": "",
        "review_title": "Hi Satan! What, You Hated This Movie Too?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "divaclv",
        "review_rating": "",
        "review_title": "Quite possibly, the worst thing to happen to a theater since John Wilkes Booth.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Kelli-5",
        "review_rating": "",
        "review_title": "Dear God! How could anyone make something so horrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Luminar",
        "review_rating": "",
        "review_title": "Yet another movie only made enjoyable by MST3K",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "splatvinny",
        "review_rating": "",
        "review_title": "Entertaining but awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "dgalloway",
        "review_rating": "",
        "review_title": "Damn you, Gremlins! Damn you!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "forebore-2",
        "review_rating": "",
        "review_title": "The Worst Movie I've Ever Seen!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Rat Man",
        "review_rating": "",
        "review_title": "So Bad it's Funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "illogik",
        "review_rating": "",
        "review_title": "Guilty pleasure..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Apearlo",
        "review_rating": "",
        "review_title": "A Hurtful Gremlins Rip-Off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Aoife-2",
        "review_rating": "",
        "review_title": "Can one not giggle?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Allyourbase5",
        "review_rating": "",
        "review_title": "Simply awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Stanze",
        "review_rating": "",
        "review_title": "Bad, Horrid, Terrible I could on & on ......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "corgansp",
        "review_rating": "",
        "review_title": "Rick Sloane may be the anti-Speilberg",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0089280",
        "movie_name": "Hobgoblins",
        "movie_rating": "2.2",
        "review_username": "Frizzy-2",
        "review_rating": "",
        "review_title": "I needed a barf bag.",
        "review_detailed_main": ""
    }
]