[
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Movie-12",
        "review_rating": "4",
        "review_title": "Visually enticing and well acted, but poorly executes good ideas. ** out of ****.",
        "review_detailed_main": "THE ASTRONAUT'S WIFE / (1999) **\n\nJohnny Depp plays a NASA astronaut named Spencer Armacost who, while on a space mission, losses contact with Earth for two minutes. He and his colleague, Alex Streck (Nick Cassavetes), return home to their spouses, Jillian Armacost (Charlize Theron) and Natalie Streck (Donna Murphy). Bizarre episodes begin to occur with Alex, leaving Jillian suspicious of her husband's condition. As her husband's strange behavior increases, Jillian begins to question what really happened in those 120 seconds.\n\n\"The Astronaut's Wife,\" written and directed by Rand Ravich, poorly executes good ideas. We have imaginative and potentially suspenseful ideas with this film's concepts behind such happenings in two minutes as Spencer and Alex are in galactic boundaries. The gradual increase in Spencer's unusual behavior depicts effective suspense-but thorough introduction of the characters does not take place, nor do we witness the key events in which the rest of the move hinges upon. Consequently, \"The Astronaut's Wife\" does not work.\n\nThe film's first act is full of incidences, characters, and subplots. Clearly too many things happen too early in the story. Within the first thirty minutes the production attempts to develop two separate relationships, shows us the atmosphere of a teacher's workplace, something bizarre transpires out of earth's orbit, a decision is made to resign and move to New York, a suicide takes place, a character mysteriously dies, and probably more. I just couldn't follow the plot.\n\nI liked the eerie, supernatural overtones located throughout the production. The film is smart to reveal the right amounts of information at the precise time. There is also a certain style to \"The Astronaut's Wife,\" containing an elusive mood, a weirdly intriguing design, and some tense and unusual camera angles. The movie becomes more interesting as we reach the closing.\n\nCharlize Theron has been in a lot of movies lately, but \"The Astronaut's Wife\" is her first leading role. She seems to have come out of left field in 1997 with the comedy \"Trail and Error.\" Afterwards, she contributed larger performances in \"The Devil's Advocate,\" \"Celebrity,\" \"Mighty Joe Young,\" and most recently \"The Cider House Rules,\" and \"Reindeer Games.\" Her role in \"The Astronaut's Wife\" is a little more complex than her past credits, excluding her enticing and believable acting job in \"The Devil's Advocate.\" She presents the traumatized Jillian Armacost with the perfect blend of zest and tragic confusion.\n\nDepp and Theron conjure a chemistry-rich couple. The movie very clearly takes Jillian's point of view instead of allowing us to know mysteries with Spencer. This stays consistent and focused, but sometimes leaves us pondering about unexplained events.\n\n\"The Astronaut's Wife\" builds for an awe-inducing conclusion through revealing and intriguing dialogue and an omnipresent undertone. The film suggests a form of extraterrestrial is behind the deaths of several characters as well as the strange behavior of Spencer, but we learn the truth only in the end. Call \"The Astronaut's Wife\" an unusual \"The X Files\" episode featuring a cliffhanger conclusion and a supernatural climax. The movie must have appeared really exciting on script. If only more capable filmmakers would have claimed this production we may have had a real winner. Instead audiences feel disappointment and failure, potential is wasted and originality is underscored"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "6",
        "review_title": "Eerie and thrilling film about a pair of shuttle astronauts return Earth with unexpected consequences",
        "review_detailed_main": "It deals with a space shuttle in orbit and two astronauts leave their spacecraft to carry out a routine mission : to repair a damaged satellite when there's an explosion , later on they forced to go back Earth after NASA loses contact for two mysterious minutes . Astronauts Spencer Armacost (Johnny Depp) and Alex Streck (Nick Cassavetes) were outside the spacecraft when the surprising incident happened. But they aren't the same guys after they go back from a nearly fatal accident . Armacost seems to be unaffected ; however , his wife Jillian (Charlize Theron) , a Florida school teacher , feels weird activities and subtle changes in him . Over time , Armacost's unsettling mistress Jillian to be afraid of his strange behaviour . As his obsession knows no bounds and he becomes increasingly violent , putting Jillian's life in danger . As he begins to threaten her with possesive and violent acts . Egged on by a previous NASA employee (Joe Morton) , the fiercely strongwilled woman starts to believe that her husband is something else . Jillian also learns that she is pregnant , as time progresses she begins to feel like the lives inside of her are not of this world . Look at this \"man\" and Beware! There is nothing human about him except his desires! See The Thing Without A Face . How well do you know the one you love? Imagine the face of terror is the one you love . Witness the birth of pure evil.\n\nLong in atmosphere but short on momentum and plot , the meandering script is fleshed out by nuanced performances . Ravich's decent filmmaking fills the antiseptic interiors of the marriage's Manhattan designer apartment with a terrifying menace , but regrettably the slow-burn intrigue is extinguished when too much is revealed at just the wrong moment . The picture blends Sci-fi/horror themes , taking parts here and there of extraterrestrial invasion as ¨Species¨ adding terrifying moments , as Charlize Teron is also very much like her beleagured wife in ¨The devil's advocate¨since everyone seems to think Jillian's nuts , as well as things get very ¨Rosemary's Baby¨ style . Charlize Theron gives a passable acting as a disturbing woman who becomes pregnant with twins from a strange astronaut , holding doubts if carrying extraterrestrial parasites , she is by turns , sympathetically unhinged and vulnerable . While Johnny Depp is really creepy and disturbing as an astronaut with dark purports. As Johnny Depp is more credible in quirky characters in quirky films .Remaining support cast is pretty good , such as Nick Cassavetes , Donna Murphy , Clea Duvall , Samantha Eggar , Tom Noonan , Gary Grubbs , Blair Brown , among others .\n\nIt contains a moving and nail-biting musical score by George S. Clinton with plenty of thrilling and suspenseful moments . As well as colorful and adequate cinematography by recently deceased Allen Daviau . The motion picture was professionally made by Rand Ravich , though with no originality and it has some flaws and gaps . This is his only film but he has written/produced TV series as Crisis , Second chance , Time tunnel and Life . Rating : 5.5/10 . Passable and acceptable Science-Fiction/Horror movie"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Bernie4444",
        "review_rating": "5",
        "review_title": "No depth but fun for kibitzing",
        "review_detailed_main": "An astronaut has some sort of weird experience in space. He comes back acting funny. Does anyone notice? Not until he goes off the deep end. How will it all end?\n\nJust because this is one-dimensional and predictable does not mean you can not still say \"stay in the car.\" And you do not think having twins is spooky? Rosemary's Baby never grew up to be a pilot. Yeah, and such common names as Spencer Armacost; whatever happened to Igor or Jeffery Dhalmer? They are put in a quiet space, so you have time to think about what happened (or did not happen) and you call it dull. Do you think that they would intentionally make a bad movie?\n\nInterestingly enough the actors, including Johnny Depp and Charlize Theron, for better or worse have made some memorable movies. So, it is interesting to speculate how they were lured into this particular film.\n\nIf you can believe the premise of this film then the next film to watch is ,"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "",
        "review_title": "highly derivative sci-fi film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "krdement",
        "review_rating": "3",
        "review_title": "Wasted Potential with Good Cast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "perfectbond",
        "review_rating": "7",
        "review_title": "Payoff could've been better",
        "review_detailed_main": "Up to about ninety percent through the film, The Astronaut's seems to be on course to being something special. Leads Depp and Theron are very convincing in their roles and they are backed by a very competent supporting cast led by the always reliable Joe Morton (T2, Speed, Bounce, Paycheck, Smallville). The special effects and cinematography are well done and the pacing and building of suspense entice the viewer to unravel the mystery along with the protagonist. Unfortunately the revelation doesn't quite live up to the buildup leaving the viewer more than a little dissatisfied. Despite the letdown I still recommend this movie on the strength of the performances and on the fact that is a rare hybrid of the science fiction and thriller genres. 7/10."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jamesowen-2",
        "review_rating": "1",
        "review_title": "An insult",
        "review_detailed_main": "There is scene in this movie in which a stroke is medically referred to as \"a severe insult to the brain\". A line which describes this entire film far better than any reviewer possibly could.\n\nObviously influenced by The X-Files, the first thing that strikes the viewer is the invasive use of tense mood music. If the Astronaut's Wife is opening a fridge there is a string quartet behind anxiously heralding a danger which subsequently doesn't exist. In a TV show like The X-Files it's a trick used to great affect because it's stylistic and the shows exhibit a degree of wit and imagination that relieve us from the pointless tension. Neither of those saving graces feature in this film.\n\nThe characters are poorly drawn, we're constantly told Spencer (The Astronaut) has changed since his last mission into space. We need to be told this so often because we're deprived of witnessing very much of his prior personality. And throughout the story Jillian (The Wife) never functions as anything more than a paranoid wreck, even before she suspects that something is really wrong.\n\nFans of Depp and Theron will be as disappointed as the rest of us. Johnny's flyboy astronaut is utterly out of place since we all know true spacemen are stiff and boring scientists, yet this guy is exhuberant like the barnstorming 1950's test pilots that never really existed. God only knows what hewas thinking with this part. And Charlize, throughout she never lifts above the catatonic. Literally, and I mean this folks, there is nothing more to her performance than the bags under her eyes and hers is the lead character, our heroine for crying out loud! That's beyond appalling.\n\nAs a thriller there is never a comfort break in this pretentious sci-fi flick that asks us to care for a character it's impossible engage with. It's non-stop, we're expected to be in the edge of our seat with every single scene, and if the plot doesn't supply the drama a 'bus' (that's the Hollywood term for a false shock) will. They are countless, and soon annoying. The same can be said for the way The Wife is mysteriously at the front of every crowd during key moments of action, which is one of the other cheap dramatic tricks overused by a really really bad director.\n\nUntil recently writer/director Rand Ravich hadn't been in charge of a film since this 1999 failure, you'll know why.\n\nFifteen years ago this was the kind of film that made a frustrated Quentin Tarantino decide he really needed to begin making his own.\n\nIt's diabolical."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Cephyran",
        "review_rating": "7",
        "review_title": "Average at best; better than some....",
        "review_detailed_main": "I have to say, I always enjoy Johnny Depp's work. He is a chameleon; an actor who can take literally any role, who can step outside the boundaries of typecasting. And, his performance in this film is in no way weaker than any other character; it is merely a role that not many are likely to recall when asked about him. The film builds decently enough. Depp and Theron play a married couple, and a significant element of stress begins to grow on Theron following Depp's events during an orbital assignment given to his character.\n\nI also like Charlize Theron; my one nitpick is how she seems to always find her way into these 'tormented woman' roles, like in the Devil's Advocate. Her skills are not necessarily hindered by this repetitiveness; I just find it a redundancy she needs to work beyond. Those of you watching this film for a horror-themed thriller are going to be mostly put off. This film really does not rely to such an extent the horror mechanisms; rather it builds the tension through a number of strictly dialogue scenes, using the plot to intrigue rather than scare tactics.\n\nThe ending - quite literally, the last twenty minutes, is the only place you're likely to see what may be called horror. I will not give away what happens here; you have to watch it and see. All I will say is that the ending left me anticipating more. That said, my overall opinion is this movie is satisfactory at best, not a true stand out in the annals of cinema history, but certainly not one of the poorest examples of the profession."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Embley",
        "review_rating": "1",
        "review_title": "Annoying pile of s**t....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "niflheimr-66-177082",
        "review_rating": "7",
        "review_title": "Good acting, entertaining story, better than expected",
        "review_detailed_main": "Before watching this movie, I was slightly put off by the other reviews.. I thought it was perhaps one of those movies that you can either love or hate but no one fully understands it.. but no.. it isn't the most brilliant movie ever, but it's good! the story is a bit simple, but entertaining enough! Makes you tense like any thriller should, makes you wait what turns out. Some compare it to Rosemary's baby but from the space, although I think I know where this comparison comes from, I strongly disagree. And I need to add that Astronaut's Wife in my opinion is a far more entertaining movie to watch than Rosemary's baby. Overall pleasant way to spend your time.. Just don't expect a masterpiece and you will enjoy it."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "michaelRokeefe",
        "review_rating": "3",
        "review_title": "Slow burn to ignition; very light payload.",
        "review_detailed_main": "Spencer Armacost, played by Johnny Depp, and a fellow astronaut are lost outside their space shuttle for two minutes. NASA is alarmed and bring the men back. One dies and the other causes suspicion about his actions. Armacost's lovely wife (Charlize Theron)becomes pregnant; expecting twins. But something is strange, something is amiss.\n\nThis is a slow ride to an abrupt, teaser of a thriller ending. Depp and Theron have both turned in better performances elsewhere. The little sister, played by Clea DuVall, showed the most emotion. Joe Morton and Blair Brown were also featured. This had the potential, but missed the target on splash down."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "mmr07",
        "review_rating": "8",
        "review_title": "Could have been a Classic Thriller",
        "review_detailed_main": "I watched this movie yesterday, and I was hooked to its haunting story till the end. First I have to say the performances were excellent, Johnny Depp still surprises me with his variety of roles, I can't imagine he could have done the hilarious role of Captain Jack Sparrow after this scary role.\n\nHis eyes were acting more than any part of his body and you could feel the slight change in his character through the stillness of his eyes. Charlize Theron gave a better performance than her Devil's advocate role although they had the same criteria, the disturbed wife. But her genuine agonizing performance distinguished her in this movie.\n\nI noticed the music was a major pillar in this movie, it was like another main character in this movie, the editing was great also especially the scene in the subway. The story was an original also, it had good turn ups and twists.\n\nThe movie had all the right elements in general and it certainly doesn't deserve a 4.7 on the imdb. I think the voters were greatly disappointed after seeing all those good elements destroyed by the cheesy and typical ending that only producers could have had a part with, in order to make another sequel.\n\nThe ending by all means was bad, it destroyed the originality of the story and the tension build up. I give it an 7.5 for all the good elements, it would reached a 9.0 if the ending was different."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "callanvass",
        "review_rating": "7",
        "review_title": "An underrated effort, very reminiscent of Rosemary's Baby.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rprew",
        "review_rating": "1",
        "review_title": "A waste of time",
        "review_detailed_main": "Someone said Plan 9 From Outer Space had met it's match. I disagree. Plan 9 may have lacked a plot, had worse acting, a lower budget, worst in class special effects, etc., but at least Plan 9 From Outer Space was pathetic in a hilarious way. This movie was just plain pathetic. Very predicable, a weak plot supported by poor scripting, performance done way below the capabilities of the actors, and I'm not sure whether or not there was a director on the set. Maybe he wasn't feeling well and spent most of his time in the john. I watched this while taking a break from cleaning the garage. I should have kept working. Don't waste your time."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Nice patient delivery and good ending even if it leaves unsatisfactory questions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "larythpikl",
        "review_rating": "1",
        "review_title": "THIS MOVIE SUCKED!!!!!",
        "review_detailed_main": "This was the most horrible movie I have ever seen in my life! It was so boring and it dragged on forever and the end even sucked horribly. I don't know what johny depp was thinking when he agreed to be a star in this movie. This movie was a disappointment and only worth seeing if you want to go to sleep or waste money!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Meredith-7",
        "review_rating": "7",
        "review_title": "Strange and eerie",
        "review_detailed_main": "I quite liked this film. It certainly was different to what I had expected. but this proved to be a good thing. It is very slow building, but at the same time I found it really captivating. The plot unravels quite slowly, and in time what is unexplained to begin with soon becomes clearer. Its not so much the acting in this film that make it good, its more the cinematography and the feel and flavour the director gave to the film. There are some parts which after the film has ended still seem to be unexplained, or clearly don't make sense. Unfortunately they have paved the way for a sequel- although I think that would be a very bad idea. Not that much actually happens in The Astronauts Wife, but what it may lacks in story (being what is actually explained), it makes up for in atmosphere."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Junker-2",
        "review_rating": "1",
        "review_title": "Move over \"Plan 9...\"",
        "review_detailed_main": "Move over \"Plan 9 From Outer Space.\" You've got company.\n\nThis movie is simply atrocious. In fact, comparing it to \"Plan 9...\" is actually an insult to the memory of Ed Wood. Unlike Wood's movies, this isn't even enjoyable on a \"so bad it's good\" basis. \"The Astronaut's Wife\" is just so bad it's bad.\n\nJohnny Depp, in the biggest mistake of his life, plays the too, too perfect astronaut husband of Charlize Theron. Depp never utters one line of sincere dialogue in the entire movie. Instead he wanders around like a zombie stopping every once in a while to say something oh so romantic to his wife.\n\nTheron fares even worse. One moment she is playing the whimpering wife; the next she is barking out orders. (\"Then take me to someone who can!\" is one of the worst lines of dialogue I have ever heard.) It would be nice to blame all of Theron's ineptness in this movie to bad writing and directing, but I fear there is another reason. Behind that incredible beauty is a woman who simply doesn't know how to act.\n\nI could go on blasting this movie, but why bother? Just remember this fair warning: Next time you're in the video store and you see this movie on the shelf, don't be fooled. You may really like science fiction, you may love Johnny Depp and Charlize Theron, but leave this turkey on the shelf. Let it slowly decompose and go back to wherever it came from."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Seestern",
        "review_rating": "7",
        "review_title": "Not so bad at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "wryroy",
        "review_rating": "1",
        "review_title": "In space, nobody can hear you snore...",
        "review_detailed_main": "Just thinking about this world-class DUD is making me sleepy...but before I pass out completely, I feel obligated to let all of you fellow cinema-buffs out there know that Mr. Depp also starred in another highly un-entertaining, non-thrilling movie called \"The Ninth Gate.\" Avoid both these movies like the plague...I bet either one of these major-league mediocrities could put a speed freak to sleep in no time at all."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Nilsosmar-2",
        "review_rating": "7",
        "review_title": "A reasonably good movie, well acted",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "joelx3",
        "review_rating": "1",
        "review_title": "dull and boring",
        "review_detailed_main": "this movie is one of the most dull and boring movies ever. i kept looking at my watch thinking this movie must be over 3 hours long. it isn't, thankfully. in my opinion there is nothing redeemable about this flick. none of the characters are likeable. there is little character development. what little special effects there are, don't happen until the end of the movie. and they too are dull. don't waste your time on this flick at all. don't even read the book or rent the video. they should start fining people in hollywood for ripping people off."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ryanmccarthy-87095",
        "review_rating": "8",
        "review_title": "Well designed thriller. See for yourself.",
        "review_detailed_main": "Like several others, I'm flabbergasted at the negative critic and user reviews. It should have earned at least a 6.6.\n\nJohnny Depp charms the audience as the dreamiest husband/NASA astronaut who has returned to earth after a mysterious ordeal labeled one of the most shocking incidents in NASA history. However, we see changes (are we really though?) in his personality unfold through the eyes of Charlize Theron, his unassuming wife. What really happened up there? Did they merely lose oxygen and die and come back to life? Is Charlize out of her mind?\n\nI won't go into more. And word of advice, don't watch the trailer because it gives the mystery away."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Rio Babe",
        "review_rating": "6",
        "review_title": "Not as terrible as some make it out to be",
        "review_detailed_main": "I can admit that I went into this movie thinking I would dislike it -- By looking over these user comments, how could I not? However, I was actually surprised as I found myself enjoying the slow paced suspense and the beautiful atmosphere.\n\nI am definitely not a big sci-fi fan, so perhaps that influences my opinion. I can look back at my thoughts of many \"sci-fi\" flicks, and I know I tend to enjoy the more atmospheric, narrative pictures better than the in-your-face special effects blockbusters.\n\nI disagree with many of the other people here who left comments, because I feel this movie is definitely worth viewing. However, if you are looking for a lot of explosions and fancy alien makeup and special effects, look somewhere else.\n\nThe only thing I can really say I wanted more from was the ending. Not only did it leave a terrible taste in my mouth, it also left me confused and a bit unsatisfied. The plans of these other-worldly creatures were never explained to us. Sequel, perhaps?"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "wupi",
        "review_rating": "1",
        "review_title": "X-Files...no!, Aliens...no!, 6th sense...no!",
        "review_detailed_main": "Johnny Depp & Charlize Theron mixed with A little bit of X-Files, a bit of Aliens and a bit of 6th sense, and results...When the movie ends you'll be saying \"And....., Who......What.......\"?"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "zinedine_mirkwood",
        "review_rating": "",
        "review_title": "Aaaaah...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Skippy-64",
        "review_rating": "1",
        "review_title": "Can I rate this movie -1000000000000 ???? DANG-IT!",
        "review_detailed_main": "I read the back side of the case, and thought, well, let's give it a try. I always like this good ol' aliens trying to take over.\n\nTurns out my amazement, that nothing actually happens at all. In the end you don't know what or who they are, or what they want, how they will achieve it, anything!!!!\n\nThey attempt to build up tension, but basically all they did was annoy me with some way below standard plot that makes the aliens all-powerful, impossible to recognize, understand or anything!\n\nCRAP. The most exiting part is where Depp practically rapes his wife, but that is so CRAP. I don't like that kind of stuff at all!\n\nIt has been said before, and I will say it again: You can tell the story by reading the back side of the box, and adding the simple line: that's it.\n\nThere ain't nothing more to it.\n\nDon't bother watching it. I rather spend my time honking the horn in traffic jams!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "kairingler",
        "review_rating": "7",
        "review_title": "lost in space for 2 mins.",
        "review_detailed_main": "Johnny Depp was again does not disappoint, he seems to be getting better and better with every role. Charlize Theron is sexy and very beautiful and is great in her distressed female routine. On a mission in outer space 2 shuttle Astronaut's go outside the craft I believe to do some routine manintence and they briefly lose touch with Houston for about 2 mins. what happened during those 2 minutes we are not sure of,, so the men come back home to earth, to their families,, one of the men immediately get sick and he is put into quarantine, our main character however seems unaffected, till later on his wife seems to notice that he is acting differently, sorta like he is not the same person, well as time goes by she get's pregnant, and at the urging of other astronauts she starts to investigate,, she thinks something inside her is growing, and it's not human she believes., excellent thriller with great acting.."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Chris-185",
        "review_rating": "1",
        "review_title": "Run away from the theatre.",
        "review_detailed_main": "This movie sucked. Run away as fast as you can. If this movie was any worse I might have killed myself as I was watching. Charlize Theron is not even naked in it."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rps-2",
        "review_rating": "6",
        "review_title": "Something a little different",
        "review_detailed_main": "The great appeal of this film is its brilliant production and photography. The innovative camera work and creative lighting produce a dark undercurrent of dread throughout. The plot is a predictable science fiction standard. But it is terribly well done. I could have done without the graphic bonking. But I guess that (and car chases) are now standard Hollywood requirements. Two bonking scenes. But no car chase."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "DP-4",
        "review_rating": "1",
        "review_title": "A Total Disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "sampleman411-1",
        "review_rating": "7",
        "review_title": "Double Jeopardy",
        "review_detailed_main": "A few somewhat interesting surprises in this one... Astronaut Spencer and wife Jillian are expecting twins. Jillian soon realizes that she's part of an intergallactic plot, and that her unborn babies are actually superintelligent extraterrestrials. The DVD states that this film is a \"parody\" of Rosemary's Baby and, understandably, the viewer will recognize the occassional nods to Ira Levin's novel and Roman Polanski's film."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "svyvoda",
        "review_rating": "2",
        "review_title": "Confusing to say the least",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "marydm-43470",
        "review_rating": "10",
        "review_title": "Top notch Sci-fi flick maligned by malignant critics",
        "review_detailed_main": "I just adore this movie. I've seen it several times and just can't understand the panning by critics, who turn a pretty malignant turn of phrase without referring to the cinematic qualities of the film.\n\nIt's super glamorous Depp and Theron, therefore it can't be any good, right?\n\nBloody wrong! They both act rings around the critics, which goes to show that many of them come to watching flicks with preconceptions, which get in the way of actually seeing what's going on on the screen.\n\nAnd yep, Depp and Theron are super lookers here, still in their relative youth, but the subtle under acting does both huge credit. How many actors of the Streep and Hanks school of histrionics could survive the endless close ups and acquit themselves as brilliantly as these two smouldering actors do here? I think the critics are just jealous ugly people, who won't give a good looking star with mega acting chops the time of day.\n\nThe story is not ludicrous, as a Sci-fi premise the plotline of astronauts \"being changed\" by what they \"experience\" in space is perfectly sound, and has much potential for different types of change. Alien possession premises have been handled much less skillfully than they are here. The ending is a perfectly cohesive \"resolution\" narratively and dramatically.\n\nNor is the pace too slow. It takes its time to build the climax, the viewer being \"in the picture\" much earlier than Theron's character, which is a perfectly acceptable, indeed a time-honoured dramatic device since Greek drama in the whole of western theatrical tradition.\n\nCritics rubbishing the movie cos Nick Cassavetes is in it and Theron has a haircut like Mia Farrow's in Rosemary's Baby just shows how desperate some people are to score a clever sound byte. There may very well be an intertextual relationship thematically between that movie and this one, but FHS engage with its elements and build a respectable critical argument instead of just doing smart alec throwaways.\n\nThe film is also a visual treat in every way, classy settings, wardrobe, camera angles etc. The music is appropriately and suggestively sinister.\n\nA great flick to revisit on a slow Friday night at home. Forget the critical poison and enjoy it without shame.\n\nWatching it and relishing it again soon."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Chisel24",
        "review_rating": "7",
        "review_title": "A surprising, visual spectacle",
        "review_detailed_main": "I have to be honest here: I did not expect to like this movie. Largely this was based on the fact that every nationally published reviewer I read stated that THEY expected not to like the film because it was not screened for the press.\n\nOnce again I learn not to listen to the press.\n\nIs \"The Astronaut's Wife\" a shoe-in for an Oscar? No. Is it a groundbreaking new film? No. What it is is a very visually stunning glimpse into two characters masterfully portrayed by Johnny Depp and Charlize Theron.\n\nJohnny Depp has recently been acknowledged as what he is: arguably the best character actor of his generation. Charlize Theron again shines as the wife who slowly allows herself to realize that something is terribly, terribly wrong with what is going on (see \"The Devil's Advocate\"). Both actors feed of the others talent and energy to give us, the viewers, a singularly unique look into the lives of two people turned upside-down.\n\nHowever the real star here is the director, Rand Ravich. This first-time director has been accused by some of creating a film that is 95% setup and 5% payoff. I disagree. I will agree that the film is a slow-burn, but allow yourself to be lost in the images and the careful way that Ravich frames every scene. Without ruining any of the plot, pay particular attention to the love scene where the camera takes the audience literally from side to side of the couple. From a purely visual standpoint, \"The Astronaut's Wife\" is a winner."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rich-247",
        "review_rating": "1",
        "review_title": "Shocking, don't waste your money",
        "review_detailed_main": "The trailer made the movie look promising, and the first 10-20 minutes of the film were interesting. However, it rapidly degenerated into a yawnfest. The film jumped around from scene to scene, there was little or no character development apart from the lead roles, the aliens were almost non-existent and the ending was disappointing to say the least.\n\nAs the credits rolled, you could hear everyone in the cinema give dramatic 'thank god that's over' sighs of relief as they walked out.\n\nDon't waste your money."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "fedor8",
        "review_rating": "",
        "review_title": "When her astronaut husband starts acting strangely, his wife freaks out and does almost nothing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Missallen1234-196-350433",
        "review_rating": "3",
        "review_title": "Everything was awkward",
        "review_detailed_main": "This movie had a lot of the common Hollywood formulas that would make any movie successful: a lot of sex, violence and death, attractive actors, even the magic Negro (Google it).\n\nHowever, it was lacking tremendously in certain areas. The acting was deplorable. I was shocked when I found out that Johnny Depp was commander Spencer. The storyline was awkward and the sex scenes were super awkward. The only positive thing I have to point out was the camera work. The soundtrack was strange too. They could have done so much better, but I could tell this was a relatively low budget film. Not anything I'll be looking at again."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "moviewiz-4",
        "review_rating": "6",
        "review_title": "Not surprising.. too bad",
        "review_detailed_main": "Not a very good one indeed. The story is somehow not exciting at all. We are not shown what happened to the two guys up the space very clearly. only some part is good and well done.\n\nOnly things to admired is the well performance of both leading actor and actress. The rest do not seems as promising at all."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "sexytail",
        "review_rating": "2",
        "review_title": "\"Pineapples!\"*",
        "review_detailed_main": "*During the scene where the rocket launches in \"The Astronaut's Wife\" it cuts from stock footage of a space launch to a very artificial shot of the Earth accompanied by a several children's voices shouting the word \"pineapples\". It turns out to be a transition to a classroom full of schoolchildren naming fruit from around the country to tie in with Johnny Depp calling Charlize Theron a peach. This is the most unintentionally funny and memorable part of the entire film.\n\nThis movie was made in 1999 when Charlize Theron's acting career was starting to takeoff and Jonny Depp's was still coming out of a deep freeze. Together they are the Armacosts, he is a southern sounding pilot turned astronaut and she is the mild mannered school teacher and of course \"The Astronaut's Wife\". They have the exact same haircut. Jillian Armacost likes to watch \"Penny Serenade\" with her husband to get in the mood. Oh, and she has a sister. Now you know everything about the lead characters that a person who watched the movie would know.\n\nAs anyone who watched the preview that played constantly on TV in the summer of 1999 will remember, the plot concerns Johnny Depp coming back from a space shuttle mission infected with an alien parasite and nobody believes in and impregnates Charlize Theron with alien twins who watches a video tape of Joe Morton saying he may have been killed by Depp. In the trailer it took about a minute to tell, but in the movie some of these things are supposed to be a surprise. The result is a very boring drawn out \"suspense\" during which we are supposed to keep \"guessing\" whether Depp is or isn't infected with an alien parasite. Just like with \"Double Jeopardy\" (also 1999) the trailer blew all the plot twists so there's no reason to watch the movie.\n\nI only watched because I'm terminally curious and as usually I got what I paid for. The story is (as was it was popular to point out at the time) as rip-off of \"Rosemary's Baby\" (minus the funny satanic cult) as was Theron's much better 1997 thriller \"The Devil's Advocate\" (with funny satanists). The idea of impending motherhood never really seems concrete just like the \"change\" in Depp's character doesn't either. The trailer hyped up the idea that Jillian is the only one who notices a change in her husband upon his return but in the actual film there isn't a change to notice. Depp's character is underwritten, hardly 2 dimensional. He's the same until Theron suddenly accuses him of being different. The idea that Depp is an astronaut is equally abstract as the only space footage is a dream sequence and as far as I remember they didn't even spend the money to show him in a space suit.\n\nRand Ravich is a weak writer at best and his directing in this film thoroughly justifies it being his only feature length movie. Ravich posed one interesting visual idea with Theron standing in front of a screen showing a video from Depp's landing shuttle after the space accident. It would have been worthy of Nicolas Roeg if it hadn't been ruined by clumsy cutting. In keeping with this all the photography is slapdash and the color is universally hideous. I think the only reason anyone called it \"stylish\" is because the apartment where the Armacosts live is a sterile glass lined set that few of us could actually afford to live in and that none of us are obsessive enough to keep clean.\n\nYou can skip this one without feeling at all bad about it. The only reason there are two stars instead of one is because I laughed when the kids said pineapples."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "slightlymad22",
        "review_rating": "6",
        "review_title": "Misses the Mark",
        "review_detailed_main": "Continuing my plan to watch every Johnny Depp movie in order, I come to The Astronauts Wife.\n\nIf you have not seen it, the trailer gives a lot away. I didn't like this back in 1999, and have never revisited it, despite the dvd sitting in my collection from about 2003. I remember thinking it started off ok and then nose dived. I remember cringing at some of the dialogue a talented actor like Depp was saying!! I still didn't love it this time around, but I did think it was slightly better than I remembered.\n\nI can't fault Depp wanting to try something different each time he made a movie. In fact he should have been applauded for it. But here he is saying some of the most cliched and predictable dialogue, when his career thus far was anything but predictable. Likewise Charline Theron, she is given some awful lines to say. There is a scene where she is contemplating something, and she is talking to herself, and it's awful.\n\nThere is some dodgy cgi and pacing issues too, but it wasn't all bad!! I did like the ending for one thing. I'm surprised I didn't remember it. Overall it is not all bad, but it misses the mark.\n\nThe Astronauts Wife grossed $10 million dollars at the domestic box office failing to land a place on highest 100 grossing movie of the year list."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "JoeyMarie",
        "review_rating": "1",
        "review_title": "Sucked",
        "review_detailed_main": "When the best part in the movie is when the main character is about to commit suicide, THEN you know that the movie SUCKED. This movie was definitely one of the worst Charlize Theron has ever been in along with Johnny Depp. The idea & plot was a good idea, but the writers just didn't know how to develop the story. So basically, don't waste your money on this movie."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "bellino-angelo2014",
        "review_rating": "6",
        "review_title": "Odd mix of sci-fi and thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "DP-4",
        "review_rating": "1",
        "review_title": "Absolutely Horrible!",
        "review_detailed_main": "This was one of the worst films of the 90's. Everything about the film was simply horrific. The acting was bad, the story line was ridiculous and the movie was enough to put the worst insomniac to sleep. The story is about a couple of astronauts that die in space and become possessed by an alien life force. They return to earth with this life force within them, and start killing people. I only wish they would have begun with the crew that wrote and produced this film."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "porazzim42",
        "review_rating": "8",
        "review_title": "An Intelligent Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "FoxFireJ",
        "review_rating": "7",
        "review_title": "A film I actually enjoyed.",
        "review_detailed_main": "I guess the first time I heard of this film was when I was doing a search on Allen Daviau on IMDB. I saw that his next film would be The Astronaut's Wife. I jumped for joy. Here was the man who did some stunning work on Steven Spielberg's ET and Empire of the Sun.(Note: Allen Daviau should have won the Oscar for Empire of the Sun.....) Anyway a year has passed. What did I think of the film. I actually enjoyed it. I knew all the critics panned it, but I decided to go see it. Now then, if you expect this film to be some kind of SFX extravaganza, you're wrong. There are hardly any special effects in the film(except towards the end....but I don't want to give away the ending.......). This is a film that strives more on story than effects. Anyway, I thought the film grew kinda slow towards the middle, but soon it picked up, as pieces to the puzzle of what happened to Johnny Depp's character started to fall into place. Allen Daviau's work on the film was great. I loved the subway sequence in the film. I thought that was beautifuly photographed. Anyway, once the film gets toward its ending, that's when I got excited. I wouldn't mind seeing this film again on video in the near future. It did have its flaws, but in the end, it delivered its story and I walked out of the theatre happy, knowing I got my money's worth."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "aredfish",
        "review_rating": "4",
        "review_title": "Waste of a good cast",
        "review_detailed_main": "When I saw that this movie was rated only 4.8 despite such a strong cast, I was surprised. Now I know why it rates so low. The dialogue is confusing and aimless, and the director loves bizarre camera angles and movements that only serve to distract, rather than to illuminate or reveal.\n\nThe pacing is far too slow. It's been going 40 minutes, and I still don't know what it's about. If I hadn't read the blurb I wouldn't know that Johnny Depp was supposed to be somehow different now that he's back. The movie hasn't made that point yet. And it never will, as far as I'm concerned. It hasn't held my attention and now I'm writing this comment instead.\n\nPurposeless writing and obtrusive, gimmicky direction waste a competent cast and, for all I know, a clever story."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "zilmer1",
        "review_rating": "",
        "review_title": "Worst Critics ever?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Rosemary's Baby's Horrible Space Clone.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Hprog",
        "review_rating": "7",
        "review_title": "Good entertaining.",
        "review_detailed_main": "I saw this movie 'cause I got too late to the cinema that day and couldn't see The Sixth Sense. It is not a deep movie, but it's a nice sci-fi thriller for just being a little frightened for a while and have fun. Charlize Therion it's nice although I didn't like her haircut, and Johnny Depp it's a much better actor than this."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Cine-man-2",
        "review_rating": "2",
        "review_title": "Uhhh....Did I miss something?",
        "review_detailed_main": "Now I can sit here and say that this movie was OK because it was entertaining, but I didnt find it entertaining at all. Was there a point to this movie? If there was, it was missed. I could not seem to take this movie seriously at all. I was fortunate to see it in a special sneak preview, and only one person out of my group of 15 liked it. Now, I have disagreed with people on movies before, but I was not that one person. I could not stand this movie. Half way through the movie, I wanted to leave. This is not the fault of the actors. Hell, Johnny Depp is an awesome actor, but even he could not bring life to a tasteless, bland charecter like the one that he was given. I found the ending to be typical and cliche, and the story itself was nothing new. Do yourself a favor, and see something else. But this is only my opinion."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jsevaj",
        "review_rating": "6",
        "review_title": "Quite good.",
        "review_detailed_main": "I actually enjoyed this film. Someone mentioned that it's 95% setup and 5% payoff. Well, that's what I liked about it. In fact, I could have done without the 5% payoff. We are told that *something* happened to the astronaut while he was in space. As long as this event is left unexplained, the audience is kept in the dark as to how the story will evolve. This is a blissful state of ignorance. It's the same kind of Sci-Fi as \"2001, A Space Odyssey\". Not in terms of the plot, but how the space is used solely to grasp the mystery and the incomprehensible and bring it to the screen. When it's revealed what actually happened to the astronaut, the movie becomes weaker, but doesn't fall apart completely."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "1",
        "review_title": "Terrible sci-fi reworking of Rosemary's Baby",
        "review_detailed_main": "If you've seen ROSEMARY'S BABY, don't watch this film. If you haven't seen ROSEMARY'S BABY, still don't watch this film. For THE ASTRONAUT'S WIFE is one of the worst Hollywood movies I've seen in a good while, a silly, extraordinarily clichéd and terribly over-obvious exercise in supposed paranoia, mystery and ultimately, horror. It's one of those films where the director only has this one film on his C.V., and from the very beginning it's clear he's totally out of his depth.\n\nCharlize Theron is cast in the Mia Farrow role – and made up to look just like her – but proves to be nowhere near as talented. It doesn't help that her character is bland and dull, but Theron herself must take a lot of the blame for creating such an unsympathetic heroine. Her acting is terrible, and it's near impossible to reconcile this boring, wooden actress with the lady who won an Oscar for playing a serial killer in MONSTER.\n\nThe oh-so-slow story involves Johnny Depp going 'missing' in space for a couple of minutes – and returning to Earth a changed man. Of course, it takes his supposedly loving wife a full hour and a half for her to realise this, at which point the ending arrives. It's fair to say that anybody familiar at all with this type of film will be easily able to guess what's going to happen at the end – and sure enough, I was right.\n\nDepp himself appears to be sleepwalking through his part. You can see why he was drawn to the role – it's another chance for him to be weird and clinical – but there's absolutely nothing of interest from him throughout the movie and as a supposedly scary character he's a total failure. The only decent turn comes from the underrated Joe Morton, who bags the few interesting segments in the entire film (and they don't even bother giving him a send-off). Samantha Eggar and Tom Noonan get bit parts while the intensely irritating Clea DuVall bags a meatier role. Avoid."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tabuno",
        "review_rating": "6",
        "review_title": "Oddly Not Up To Par",
        "review_detailed_main": "11 March 2005. Warning: Spoilers. Unfortunately for The Astronaut's Wife, the potential makings of a great horror/sci-fi/mystery/thriller became more of a long, drawn out I don't really know what kind of movie this is. As the DVD case label says, this is a thriller. But as advertised and as the trailer suggests, all of the action is already captured on the previews before one even sees the movie. This thriller with a sci-fi element tossed in is more of a slow moving horror movie or psychological thriller with Johnny Depp doing a decent job of acting here. The edge and tension is maintained in the far or deep background, but the pacing and the various genre elements don't gel in this movie. The movie might have been better served if the whole sci fi scenario had been a red-herring. Six out of Ten Stars."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "slow countdown to weak ignition",
        "review_detailed_main": "Jillian (Charlize Theron) is a teacher and her husband Spencer Armacost (Johnny Depp) is an astronaut. Something goes wrong in his mission. He wakes up from his coma as a changed man. His fellow crewman Alex Streck has a disturbing episode and dies. Alex's wife commits suicide. Spencer leaves NASA for the private sector. Jillian feels lost and then she gets pregnant with twins. NASA Representative Sherman Reese (Joe Morton) comes to her with dire warnings.\n\nIt's a really slow really long countdown. The drama has no bite. The movie has no tension. It turns into Rosemary's Baby midway through but this is nowhere near the classic horror. Johnny Depp doesn't have the menace. It's missing the paranoia. It's never in doubt about Spencer. The climax is less than climatic. It's a mostly weak film."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "dontnod",
        "review_rating": "8",
        "review_title": "Underrated Eerie Sci-Fi Thriller About Love And Trust",
        "review_detailed_main": "\"The Astronaut's Wife,\" written and directed by Rand Ravich, has a creepy a suspenseful idea at its heart: what if the one you love is no longer the same person. Or have you lost your sanity.\n\nJohnny Depp plays NASA astronaut Spencer Armacost who, while on a space mission experiences an explosion and loses contact with Earth for two minutes. He and his copilot, Alex Streck (Nick Cassavetes), return home to their wives, Jillian Armacost (Charlize Theron) and Natalie Streck (Donna Murphy) and something is not quite right.\n\n\"The Astronaut's Wife\" builds around the suspicion that something strange happened during those two minutes, or is it Charlize Theron's sanity. It's a psychological Sci-Fi thriller not a million miles away from Andrzej Zulawski's Possession.\n\nIgnore the bad reviews. This movie will be respected in time."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Brokensoulx",
        "review_rating": "7",
        "review_title": "Watched for stars, disappointing ending. But great for Depp fans",
        "review_detailed_main": "Bought the movie recently I will admit for Johnny Depp, it has great visuals, great acting and a great cast. Visually pleasing and very gripping storyline, my heart was pounding at times. Storyline had a lot more potential than it ended, but I think it's open to enterpritation, I can say it's worth a watch and generally wasn't a bad film at all. All I can say really is a quick short lived disappointing ending, but worth a watch for any Johnny Depp fans. Different side to Johnnys usual portrayed characters which was great to see a different side to him. All in all I'd give the movie a 7/10. Reasons being I would have liked to have had a better ending, it seemed too short for my liking. Had a lot more potential and storyline was a little confusing with the ending ending the way it did"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "shaunalease",
        "review_rating": "1",
        "review_title": "the rise and....fall of our decade",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "johnnywagner-09971",
        "review_rating": "",
        "review_title": "Lack of pacing and direction make this a missed opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "blanche-2",
        "review_rating": "5",
        "review_title": "Rosemary's Baby Meets It Came from Outer Space",
        "review_detailed_main": "Well, I'm giving \"The Astronaut's Wife\" a 5 but I'm not happy about it. I'm doing it because I think Charlize Theron and Johnny Depp make a sexy couple, and if it hadn't been for them, you could have seen this as a USA channel made for TV movie. This film not only BOMBED at the box office, but even with video rentals, it still hasn't made back what it cost to make the film.\n\nDepp plays an astronaut named Spencer who, along with his partner, are lost in space for two minutes when they are out of contact with the ground. Depp's partner dies a violent death once back on earth, and his wife commits suicide. I can't believe a huge Broadway star like Donna Murphy put whatever that thing was, a radio (I think) between her legs - did she think no one would see this? Anyway, there's Charlize with this Mia hairdo - then Spencer makes love to her and he's so rough, it hurts ... Well, you can take it from there. You don't even have to watch the rest of the film.\n\nDepp apparently uses the images of certain people sometimes to help him with a role - I think his image here is the King himself. Clean shaven, a little more filled out than we're used to, and with those smoldering eyes and that twang in his voice, Depp is to die for. But he really doesn't do much. The acting burden is on Charlize, who looks exquisite (lots of closeups of her lips) and acts her role very well, creating a sympathetic character. But one who, alas, you already know too much about if you've ever seen \"Rosemary's Baby.\" Nine years later, these actors have gone on to bigger and better things. Remember the next time you see one of them in a movie - they paid their dues."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Bored_Dragon",
        "review_rating": "6",
        "review_title": "Disappointment",
        "review_detailed_main": "In the beginning, it reminded me of \"The Devil's Advocate\", then \"Rosemary's Baby\" and Alien\". It's a shame that mixing those cult movies resulted in unpresentable and mediocre SF drama. Even Johnny Depp could not save this failure.\n\n6/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Audax67",
        "review_rating": "4",
        "review_title": "Learn some basic physics, for Pete's sake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "wes-connors",
        "review_rating": "7",
        "review_title": "Pray for Rosemary's Babies in Orbit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "smatysia",
        "review_rating": "5",
        "review_title": "Ultimately disappointing, a good premise wasted",
        "review_detailed_main": "Ultimately disappointing, a good premise wasted. I thought Depp and Theron played their roles well, but their roles just weren't that good. While there was a certain amount of exposition near the end, there was an opportunity to make a great sci-fi flick, but the filmmakers passed on it to make it just a backdrop to a psychological thriller. It generated a fair amount of suspense, so it isn't a complete waste of time. Check it out on cable, maybe, but don't waste any money. Grade: C-"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "851222",
        "review_rating": "6",
        "review_title": "Good premised but poor excecution",
        "review_detailed_main": "Greetings from Lithuania.\n\nI saw \"The Astronaut's Wife\" (1999) few times since its release back in 1999, and i honestly have no clue why i saw it for a second time. It is perhaps because premise of this movie was good. I really liked the concept. But the storytelling, script and directing were poor. Even great actors in lead roles couldn't save this movie from being very forgettable. On a paper it sounded promising, yet reality wasn't kind to this project.\n\nOverall, \"The Astronaut's Wife\" (1999) is a forgettable and very mediocre flick which is not terrible or bad, but it is very disappointing considering two great leads."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Boba_Fett1138",
        "review_rating": "5",
        "review_title": "Lackluster, typical, genre movie.",
        "review_detailed_main": "The movie had the right atmosphere and certainly the right actors to make this a good genre movie, only problem is, nothing ever happens in this movie! The movie is clearly a thriller but the movie does never gets tense and lacks in good thriller moments.\n\nThe movie has a good and tense mysterious atmosphere at first but the movie does nothing further to exploit this after its opening. For too long nothing really happens in the movie, also because the husband in fact really isn't acting that weird and suspicious as before the accident in space. Certainly not enough to become afraid of him and not even the ending of the movie can really change this.\n\nThe reason that this movie also doesn't work is because the motivations aren't clear. It makes the entire story and movie feel rather pointless and makes it unclear. Also when the wife learns that her husband is possibly an alien, she doesn't investigate but she is in constant denial. Is it tense and interesting to watch a character who is in constant denial? Of course it's not. Not even for a paranoid kind of atmosphere also because we as the viewer already know that something happened and went wrong with the husband. It all makes the movie quite ridicules to watch, though it's definitely a professionally made movie with some good acting in it.\n\nWe get to see Johnny Depp in a role and movie we normally wouldn't see him play. It seemed like Johnny wanted to play a villain for a change. He does this will and his acting deserved a better script to go with it. Charlize Theron also shows her skills, in a movie before her real years of fame and awards. There also are some good supporting actors in some much smaller roles, such as Clea DuVall, Gary Grubbs, Joe Morton and actor turned director Nick Cassavetes.\n\nThe movie is a typical genre movie and I was happy and satisfied enough to give this movie an 6 out of 10 rating but then came the ending. What an horrible and totally weak ending it was! It downgraded the movie and even made it more ridicules than it already was.\n\nNo wonder Rand Ravich never directed or wrote a theatrical movie ever since.\n\n5/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "combat-babe",
        "review_rating": "8",
        "review_title": "I liked this movie a lot. True, I only watched because of Johnny, but I still thought it was great.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "poolandrews",
        "review_rating": "6",
        "review_title": "Watchable sci-fi drama.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "fredit-43004",
        "review_rating": "5",
        "review_title": "Great Twilight Zone episode",
        "review_detailed_main": "This film's plot and story could easily be distilled into a wonderful 22-minute script for a Twilight Zone episode. Or perhaps a short sci-fi B movie from the 50s.\n\nI thought the acting was fine, and the production values were superb. But my overall impression is that there were a lot of plot complications but not really much of a plot.\n\nAs noted by other comments, there were some good ideas lurking in this script, but the major deficiency is that those ideas were not developed and presented in an entertaining way, so as to keep the audience's attention.\n\nI saw this film in a cinema when it was first released 25 years ago. I watched it again tonight, in case there was something I missed back then. On this second viewing, I find I didn't miss a lot."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Rosemary's Baby meets The Devil's Advocate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "elshikh4",
        "review_rating": "5",
        "review_title": "The Hairstyle of Charlize Theron, The Secret of Tommy Lee Jones, and The Fact About Actual Alien worked in This Movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "LeonLouisRicci",
        "review_rating": "7",
        "review_title": "Totally Tense Truly Horrifying Horror Show\u0085Relentless Suspense...Underrated",
        "review_detailed_main": "Here's a Theory Why Everyone on the Planet Hated This One. At Least Everyone On This Planet. It's Got Two Popular and Attractive Actors Playing a Very Unlikeable Pretty Boy Astronaut That is Abusive to His Beautiful, Trophy Wife That is in a State of Panic and Depression Through Most of the Film.\n\nNot Going to Sit Well with the Popcorn Crowd. Especially Couples Who Came for Some Cheap Scares and Silly Sci-Fi. This is Nothing of the Sort. It is a Relentlessly Downbeat, Creepy, Scary Time At the Movies.\n\nThe Suspense is Unbearable at Times and There is Virtually No Relief. This is a Horror Show and Most of it is Horrifying and Grates on a Psychological and Emotional Level that is Distinctively Disturbing. It Will Remind Some of Polanski's Rosemary's Baby (1968) and it is Similar in Tone, to The Devil's Advocate (1997) Without the Humor.\n\nIf You Can Take It, This is Quite an Onslaught of Unordinary Chills. It is a Cousin to the X-Files, a Popular TV-Show from the Decade, but More Unsettling, Kinda Like Millennium, an X-Files Cousin of Its Own, an Underrated and Definitely Downbeat TV-Show from Chris Carter and the X-Files Team that Lasted Three Seasons.\n\nThis is an Underrated, Well Mounted Movie that is Worth a Watch If You Can Stand the Tension."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Boyo-2",
        "review_rating": "3",
        "review_title": "Kept waiting for it to suck...then it did",
        "review_detailed_main": "I did not mind this movie during the first half-hour. It was slow moving but I assumed that the payoff would be worthwhile. Then it slowly got going, then it got stupid and then it got really stupid. So now I know why all the bad reviews exist.\n\nIts not the fault of the actors who give it all they have. Charlize has tears in her eyes for the entire second half, while Johnny's character inexplicably turns evil, and the transformation is not at all subtle.\n\nSince I got bored, I started thinking about the actors in the cast and realized the supporting cast has (somewhat) similar credits on their resume. It was great to see Samantha Eggar again and kind of funny that she plays an obstetrician. She had a difficult birth, to say the least, in David Cronenberg's \"The Brood\". Blair Brown suffered through William Hurt in \"Altered States\", Clea Duvall battled aliens in \"The Faculty\" and Joe Morton in \"T2\"...well, you know what he does. Are these in-jokes, like Charlize's haircut resembling Mia Farrow's in \"Rosemary's Baby\"? And Johnny sounding a lot like Elvis? Who knows, but if this movie was half as good as the ones I mentioned, I'd be the first to say it was needlessly panned. But the bad reviews are justified."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "inhisgrace0072005",
        "review_rating": "7",
        "review_title": "Well, I Liked This Movie.",
        "review_detailed_main": "This movie is visually and mentally stimulating. One needs only to have a very vivid imagination and the ability to enjoy the multifaceted ability of Johnny Depp, which some comment on him being 'wooden' or 'his worst acting yet' or 'not a bad boy', is a good movie.\n\nI was able to relate, to a degree, to Johnny's character, for I dated a guy who was very much like Commander Spencer Armacost. Additionally, it was very easy then to understand Charlize Theron's character, Jillian Armacost. That is why I liked this movie....I could relate to the two major characters.\n\nA few things left me (and perhaps others) in the dark:\n\n1) The outer space shots did not make much sense. Just a little more information might have helped us understand the alien. It not clear why it (or they) is trying to take over earth. Is it for taking over the earth or the space program or both.\n\n2) Captain Alex Streck, Nick Cassavetes, is also taken over by an alien in space. Though it is not quite understood why he went through such physical trauma and Spencer did not.\n\n3) Joe Morton, who plays Sherman Reese, the NASA Representative, does an okay job playing his character. Again, this movie does not explain, to any degree of satisfaction, what Mr. Reese knows.\n\n4) The character of Nan, Jillian's sister, seems to have no reason for being in the movie. Except a useless filler used in detergents?\n\n5) I found it interesting that an old radio, in the Armacost's apartment was used as the main 'stereo' system.....I could go on abit about the details....but no need to be that picky.\n\nBravo on the cinematography, to an extent! The best edited scene, in my opinion, is when Spencer kisses Jillian at the company party in New York. They are against a wall..the camera tilts, until we see the characters lying prone and we see them on their bed, at home of course. Very well done. It made me dizzy in the theater.\n\nIf you can get into the main characters and put yourself in the right mindset for this movie, it will be an interesting view. But, if you are looking for a BIG SCARE this is not the film. The fear is very subtle."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Prismark10",
        "review_rating": "3",
        "review_title": "Maybe baby",
        "review_detailed_main": "The Astronaut's Wife is a poor reworking of Rosemary's Baby with a modern twist. Just to ram it home, Nick Cassavetes is in this whose dad appeared in Rosemary's Baby.\n\nTwo astronauts are repairing a satellite. There is an explosion and a two minute radio blackout where contact is lost with NASA. The two astronauts return home to their wives but they seem different. One of them dies and his wife later commits suicide.\n\nJillian (Charlize Theron) a teacher slowly realises that something is not quite right with her husband Spencer (Johnny Depp.) I think it is the way he suddenly materialises out of nowhere. Jillian falls pregnant with twins and an ex NASA employee warns her that something happened to the two astronauts in space. He also tells her that the other astronaut's wife was also pregnant with twins.\n\nRand Ravich does an abysmal job as writer and director. The film is too derivative. Theron is too bland, Depp is just too sinister like John Cassavetes was in Rosemary's Baby."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Tweekums",
        "review_rating": "7",
        "review_title": "Solid if slow moving chiller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tedman",
        "review_rating": "1",
        "review_title": "Don't Waste your Time or Money on this Loser",
        "review_detailed_main": "What an awful film. The plot is as weak and thin as water. I was horribly disappointed. While the attraction for movie goers is beautiful Charlize Theron and Handsome Johnny Depp, little else is impressive. I felt as if the movie would never end. The alien plot is never fully revealed. While movies that allow one to imagine an ending are usually enjoyable, this one is a complete abomination. DO NOT WASTE YOUR TIME!!! DO NOT SEE THIS FILM ON HBO or RENTAL!! There is only one film that my wife and I have seen lately that was worse---THE Avengers. Please take this good advice and see Sixth Sense instead."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Sidney_Strode",
        "review_rating": "10",
        "review_title": "A really underrated movie which deserves a second look",
        "review_detailed_main": "An astronaut goes in space where he almost dies. After he comes back on Earth to his wife he's not the same man...or is he still a man. Yes, when you first read it it does sound kind of simple. But believe me this movie is more than it appears to be. Have you watched Rosemary's Baby. I think that movie is Rosemary's Baby of the 90's. The directing is really good. The quick shots the slow motion, it's just really well used. The acting was not the greatest, but it came really close. Charlize Theron is just so beautiful and charismatic you can't help it but you feel so sorry for her, for what she's going through. Johnny Depp is a wonderful actor. He's so convincing as the wonderful husband and later as the evil and cruel...um..alien if you may call it.He just owns the screen and keeps you glued to it for the whole movie. The movie itself is all about subtlety, all about the little thing you have to pay attention to fully understand the movie."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "steve-862",
        "review_rating": "7",
        "review_title": "Stylish modern day Rosemary's Baby",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rod-61",
        "review_rating": "1",
        "review_title": "You'll have more fun at the Dentist",
        "review_detailed_main": "If you loved Sphere or Lost in Space this movie's for you. Johnny Depp has finally gone Hollywood in this sad and poorly acted drama. It's not sexy, scary, or interesting. Be prepared for two hours of boredom without any payoff. Not even recommended as a rental."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Gary-161",
        "review_rating": "",
        "review_title": "She's looking good, Houston....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "newton7",
        "review_rating": "2",
        "review_title": "A blatant rip-off",
        "review_detailed_main": "This movie is a blatant rip-off of Nigel Kneale's The Quatermass Experiment, which started life as a 1950s BBC TV serial and ended up as Hammer Films' first feature. Unfortunately, the makers of this film did not have any of Nigel Kneale's story-telling skills. The pace is painfully slow with far too much dialogue-heavy exposition at the start. There is the usual gratuitous sex scene and the whole thing plods on to its conclusion without making any impression other than disappointment. If Hollywood wants to do a remake of this tale, then lets have Professor Quatermass, the hapless Victor Caroon and the rest of the original characters back, together with a good screenwriter, a good director, an editor with a sense of pace and full credit to the originator of the story - Nigel Kneale!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jaytom20",
        "review_rating": "7",
        "review_title": "Give it a chance",
        "review_detailed_main": "This is a drama not a sci-fi, I watched it thinking the latter but was not disappointed(in the end) when it was the former. Jonny Depp was as adept as usual and the gorgeous girl well..gorgeous\n\nAfter watching 35mins of this film I got real bored, so I looked it up here at IMDb while the film was still playing and discovered a 4.8 rating. I was about to switch it off when I thought i'll check out the comments, after seeing a good review I decided to give it a chance, it slowly picked up and became quite intense I was not disappointed to have checked here for reviews first before giving up.\n\nGive it a chance and you too will be awaiting a sequel"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "masalsky",
        "review_rating": "1",
        "review_title": "Taking Up Space",
        "review_detailed_main": "\"The Astronaut's Wife\" is far and away the worst movie I've seen this year. Aside from actually nothing of interest actually happening in the movie, we have to put up with the incredibly annoying camera work. I can only guess that director Ravich was at the top of his class in film school, and that's how this stinker got green-lighted. Every single scene is in some architecturally interesting room so that Ravich can shoot from different angles. The main characters even live in one of those impossibly expensive New York City apartments that we've come to expect from over-produced films.\n\nTheron is adequate in the lead role, but Johnny Depp is stiff as a board and seems to wish he was anywhere else than filming this movie. I know I felt like I wanted to be anywhere but in this theater."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "davispittman",
        "review_rating": "6",
        "review_title": "Charlize is the best part",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Harold711",
        "review_rating": "2",
        "review_title": "Rosemary's Baby lives",
        "review_detailed_main": "This is generally a depressing movie. There were virtually no surprises. A monster movie where the monster wins. The heroine shows absolutely no class. The bad guy could read her mind except at the end. Very poor."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "sonofhades",
        "review_rating": "7",
        "review_title": "If you love Sci-Fi & haven't seen Rosemary's baby, then consider this",
        "review_detailed_main": "I have to be honest on it. I rated this movie 7/10 because it is slightly on the sci-fi genre and I happen to like sci-fi movies a lot. Ok, I would have given it 6/10 were it a horror movie, since the plot is neatly ripped off from Rosemary's Baby.\n\nThe modernization of RB would not be a bad idea, but placing the movie to sci-fi genre was probably more than adequate for this \"thriller\". It was worth watching, gave some food for thought, yet failed to thrill at any point. I kind of liked the end of the story a bit more than average thriller. + I'd be inclined to give a movie bonus points for not having an idiotic car chase scene like 99% of thriller genre movies :)"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Theo Robertson",
        "review_rating": "4",
        "review_title": "Boring",
        "review_detailed_main": "I was under the impression THE ASTRONAUT`S WIFE was going to be a cross between THE QUATERMASS EXPERIMENT and ROSEMARY`S BABY but strictly speaking it`s not , it`s more of a talkie drama . There are sci-fi elements involved like you might find in the rather dismal OUTER LIMITS series from the 1990s but that`s not the main plot . In several places this feels more like a \" Woman who doesn`t want a baby by her husband \" type of plot that you see in many TVMs , so be warned that if you`re expecting a science fiction horror film like I was you`re going to be very disappointed .\n\nOn a technical front THE ASTRONAUT`S WIFE isn`t a total failure because the editing and cinematography are very much above average , though the acting is very wooden and Johnny Depp is not bad guy material , and as I said there`s very little that will appeal to someone expecting a few frights"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "chris-474",
        "review_rating": "8",
        "review_title": "Watchable suspense movie",
        "review_detailed_main": "The Astronaut's Wife starring a somewhat stale Charlize Theron and Johnny Depp is quite different in its attempt to thrill the audience than other mainstream suspense/thriller movies. It's very suspenseful in parts (too few though) but severely lacking in dialogue and good acting in others. It's hard to judge this film because for long periods at a time you are either being bored by it or being thrilled by it. This is mainly due to the screenplay which seemed to have been written without much thought and due to the acting which centers around Charlize Theron. She is new to big roles such as this and it seemed to take a while for her to get into as it appeared that she was rather uncomfortable in some scenes. However, for the last hour or so she was quite good as she allowed the audience to sympathize with her and hold hope for her character. Overall, I thought this was too long for the quite limited storyline but the story was interesting enough to watch through and not be bored by the end."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rupie",
        "review_rating": "6",
        "review_title": "not all that bad",
        "review_detailed_main": "The consensus of opinion here led me to expect a dog, but I found myself interested and engaged, even if it rather quickly became apparent what was going on. I agree with those who saw the echoes of \"Rosemary's Baby\" here; if the makers of the movie wished to avoid those associations they should have selected a hairstyle for Miss Theron that was not such a spitting double of Mia Farrow's in that flick. Altogether, not a bad sci-fi thriller, though."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "CharltonBoy",
        "review_rating": "2",
        "review_title": "Yawn zzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz",
        "review_detailed_main": "I suppose Johnny Depp had hois reasons for starring in this movie.Perhaps the script looked interesting when he first read it, perhaps it was because he was along side Charlize Theron. What ever the reason i bet he regreted it after watching the finished article. This movie is just awful. It is depressing, boring and a complete waste of time. The story is dull and the acting is lousy. The most annoying thing is that the wife played by Charlize Theron pouts and cry's her way depressingly through this and it feels like you are living for and hour and a half with a woman suffering from severe PMT. If i was the Husband i would have walked out on the bitch a long time before the aliens got hold of me. Who ever decided to make this movies should be the next person on the shuttle and left at the space station for 2 years with no entertainment so he can see how bad it is for us to watch this rubbish. 2 out of 10."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Josh-161",
        "review_rating": "",
        "review_title": "Poetic, interesting drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Nimbo",
        "review_rating": "1",
        "review_title": "Worse than AWFUL.",
        "review_detailed_main": "All around this was a disappointment. It never is clear why she has a quizzical look on her face. And she needs further acting classes. Theron so far has little talent. Her grimaces are always the same. Depp is a let down. \"What's Eating Gilbert Grape\" and \"Donnie Brasco\" reveal his abilities. Perhaps it is the whole film that needs re-writing. There are a few chilling moments but I kept rooting for the bad guy. This was not time well spent. I wish there were a way to show negative numbers. I would have chosen \"-10\", really, really awful."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ArtistGrl",
        "review_rating": "7",
        "review_title": "Disappointing",
        "review_detailed_main": "The idea for this film sounded very promising, it was directed well and was quite suspenseful at times. Yet, it kept building up for some kind of a great resolution that never came. Certain things were totally unreasonable and remained so. Overall, with a few changes to the script, it had the potential to be much much better. 6/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "CherryBlossomBoy",
        "review_rating": "1",
        "review_title": "Exceptionally bad movie... Depp at his worst",
        "review_detailed_main": "I usually prefer to praise movies, rather than criticise, but I can't help it about this one.\n\nFirst, thanks to this movie, I found out how much I dislike Johny Depp and his faceless appearance. He is good and interesting only in movies that had good directors (and even there his partners steal the show). And in badly directed and badly scripted movies he can't do anything at all.\n\nThe director is so bad that he doesn't even know how to work with actors, instead he just lets them do \"their things\" expecting them to pull the script out. As a result, the black NASA guy overacts and improvises a lot, Charlize Theron does too much in her role of scared whiny wife, and Johnny Depp does nothing at all, except twisting his jaw and twirling his eyebrows once in a while. But you can't really blame them as they probably had no idea what their characters were about and where the director wanted movie to go to.\n\nAnd there was really nothing to work with as the story is shallow, the dialogs are childish and the characters are unappealing (or the actors made them so). Other aspects of director work are bad too: camera movement is often illogical, changing pace all the time. Some scenes are too slow, other are too fast and overedited. Introducing alien CGI at the end of the movie is damaging to the mood of the film.\n\nIt could have been such a nice horror movie with every possible intelligent underline there is. A sci-fi story about mankind trying to deal with something beyond comprehension, a metaphor on alienation and abuse among married couples, even a psycho drama about a mentally ill character (the wife) who doesn't know where her illusions end and the reality begins. The movie opened all those themes but deals effectively with none. It's not even intriguing enough to provoke the viewer to draw his own conclusions.\n\nThe only conclusion I drew from the movie is (bad joke ahead): don't play with electricity near water."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "gridoon",
        "review_rating": "7",
        "review_title": "You can't go wrong with this utterly absorbing thriller...if you skip the final 5 minutes.",
        "review_detailed_main": "The problem with \"The Astronaut's Wife\" is the same problem that plagues many well-made thrillers: when the set-up is so good, the ending will more often than not turn out to be somewhat unfulfilling. That's the case here, too. The rest of the movie, however, is an absorbing, at times terrific sci-fi thriller. Rand Ravich's direction is inventive (notice the \"sex scene\") and unconventional; he has a knack for finding the little detail that matters in almost every scene and then drawing your attention to it (though he does succumb to some regrettable \"false scares\"). Johnny Depp is disappointingly bland and unmenacing as \"the astronaut\", but Charlize Theron is utterly captivating as his wife; of course with such breathtaking beauty it's easy for her to capture the camera's attention, but she's also expressive enough to hold it. You simply can't take your eyes off her - which is a good thing too, since she appears in practically every scene of the film! (**1/2)"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "mrbishop77",
        "review_rating": "2",
        "review_title": "Think Rosemarys baby, with Johnny Depp in space, and braindead.",
        "review_detailed_main": "In one of the most blatant ripoffs I have seen in a while, this movie moved me into tears. Awful movie that only succeeds in reminding me that there is a reason that you get movies for free from Blockbuster if you work there (I was when this came out), cause maybe they do realize the immense amount of c**p that comes out today (no they don't, they need some incentive to keep you there). Mr. Depp, one of my favorite actors, must have needed some cash. Made me want to throw the tape across the room and out the window. Bad script, Charlize Theron (one of the worst actress's ever), and evil babies from space that want to fly jet planes. This movie is a mess."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lastliberal",
        "review_rating": "7",
        "review_title": "Not sure what to make of this",
        "review_detailed_main": "I give this a 7, which is recommendation to see, but I feel I am being generous. I only say that because I like Johnny Depp and Charlize Theron and am impressed by their range. Depp appears to be just going through the motions in the beginning, but becomes more of what I expect towards the end. Charlize is good throughout and really did some damn fine acting towards the end. The ending was crap as far as I was concerned. I guess that is what you expect from sci-fi, but I just didn't like it. Joe Morton did a good job as the NASA engineer who discovered that something was wrong. Watch for the acting, not the story."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Big B-10",
        "review_rating": "2",
        "review_title": "Very slow",
        "review_detailed_main": "The film was very slow in evolving, providing too many questions and few answers. Theron once again played the helpless wife, at least this time her husband could act. The film never really explains exactly what occured, which left me unsatisfied and tired. Neat camera shots, but a poor piece of work."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jukebox-2",
        "review_rating": "8",
        "review_title": "The end of the world, slowly",
        "review_detailed_main": "Reminiscent of Rosemary's Baby, but still good.\n\nThe major technical flaw is the incursion of the alien signal into the two astronauts. Its not well explained and the little explanation there is, makes little sense.\n\nThe wife's character also seems inconsistent in several places. Women know their husbands VERY well and small behavior changes are obvious to them. Yet when she is offered evidence of what might have happened she is afraid, not curious, and shuns the meeting. Naturally this changes as the story unfolds.\n\nHer attempt to kill her husband is set up like a suicide attempt (to fool us, the audience), but badly backfires on her and the aliens triumph - for a change."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Astronauts Babies",
        "review_detailed_main": "You may feel like this is something familiar, especially if you've seen a very famous Roman Polanski movie. Now this gives you explanations and it may seem more \"realistic\" than the other movie, what this having its inciting incedent in outer space where we have no idea what is possible (on the other hand, it is quite a stretched fantasy).\n\nJohnny Depp in a serious role and Charlize Theron trying to find a truth to her character and a woman that struggles with decisions she has to make, about her and her ... loved ones. Suspense is there, cliches are there and predictability is quite obviously there too. Still engaging and fun to a degree"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "danielrachael",
        "review_rating": "4",
        "review_title": "Average Depp movie hampered by pace and a lack of direction",
        "review_detailed_main": "The Astronaut's wife is a strange film to review. It isn't a great film- heck, I don't remember much of it, but it isn't bad either. The plot is basically Rosemary's baby in a science fiction template. Johnny Depp and Charlize Theron play a married couple about to have a baby when Depp, an astronaut is assigned a space mission. Something happens out there and although he returns in one shape something is amiss. The film is slow paced and doesn't really go anywhere, from what I remember. This is a film that should be considered only if nothing else interests you in the science fiction catalogue."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Johnny Depp and Charlize Theron cannot even salvage this script.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "osprey-4",
        "review_rating": "2",
        "review_title": "A big disappointment. More like a schmaltzy made-for-TV movie",
        "review_detailed_main": "This movie was portrayed in previews as being something clever and intriguing, maybe even really creepy and scary, but it was a real letdown and came across like a very long, drawn out, slow-moving soap opera."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ozjeppe",
        "review_rating": "6",
        "review_title": "Cross between \"X-files\" and \"Rosemary's baby\" is genuinely creepy... ..",
        "review_detailed_main": "Astronaut Depp has mysterious accident on a space repair mission - and on return to earth, strange and unpleasant things occur as he reunites with his increasingly suffering wife Theron...\n\nSlow to kick in and establish exactly what kind of movie it is, but when it does, I'm hooked: Genuinely straight and creepy paranoia thriller comes off as a sort of cross between \"The X-files\" and \"Rosemary's baby\"... that admittedly barely touches credibility, but hey - did \"Rosemary's...\" ever, to be good as well? If this had been made as an early \"Twilight Zone\"-episode, it probably would've been a series classic! Nice colorful cinematography and reliable performances adds to its uncomfortable, seeping mood.\n\n6 out of 10 from Ozjeppe"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "AKS-6",
        "review_rating": "5",
        "review_title": "Better than I expected",
        "review_detailed_main": "When I rented \"The Astronaut's Wife\" I was convinced it was going to be pure trash, mainly because I had read so many bad reviews and because of the 4.7 average here at IMDb. Then again, I had also seen the trailer quite a few times and that made the film look very interesting. So, I ended up renting it despite all the reviews (and hey, as a true film fan I really don't care what other people say, I like to form my own opinions about films).\n\nThe trailer definitely promised too much, and the negative reviews were too negative. I actually thought that the film was quite interesting, although it could have been more suspenseful. The acting was okay, but the production design (ultra modern, it seems) created a distance between me as a viewer and the characters. With such cold production design, how am I able to see the warmth in Charlize Theron's character? If the makers of the film tried to set her warmth off against the cold design it didn't work. While the p.d. worked for Depp's character it certainly let Theron's down.\n\nHowever, in the end I quite liked the film, even though it is very far from a masterpiece and the ending certainly wasn't great. (5/10)"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "wdllofzepia",
        "review_rating": "6",
        "review_title": "Could have been so much better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Hey_Sweden",
        "review_rating": "5",
        "review_title": "Not bad, but nothing particularly interesting here.",
        "review_detailed_main": "Screenwriter Rand Ravich (\"Candyman: Farewell to the Flesh\") debuts as feature director here with this so-so sci-fi thriller. Charlize Theron is almost the whole show as Jillian Armacost, a second grade teacher and the wife to astronaut Spencer Armacost (Johnny Depp). One of his space missions appears to go very bad; although he and his comrade (Nick Cassavetes) return and seem to be fine, the indications that all is NOT alright soon start occurring. Then Jillian becomes increasingly unhinged by her husbands' out-of-character behavior.\n\nRavichs' script does have some decent ideas in it, but he probably should have handed it off to a more seasoned filmmaker. As it is, this is largely a very serious film that DOES have its moments, but it's a long, drawn-out narrative that puts a LOT of set-up into an underwhelming finale. This viewer can see how others find this film disappointing. It's a waste of an effectively somber mood and a good score by George S. Clinton.\n\nTheron is the main reason to watch. As she had previously proved in \"The Devils' Advocate\", she has substance to go with her sex appeal and can easily add gravitas to her material. Depp is fine, starting out subtly and making it more and more clear that he's not who he appears to be. They're surrounded by capable & familiar supporting players, with Joe Morton a standout as an exposition provider who's come somewhat unglued. Clea DuVall, Donna Murphy, Samantha Eggar, Gary Grubbs, Blair Brown, Tom Noonan, and Tom O'Brien also appear.\n\nThis one could be chalked up as a \"nice try, but no cigar\" type of story. It had some potential - and is technically well-made - but it leaves the viewer less than completely satisfied.\n\nFive out of 10."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Anonymous_Maxine",
        "review_rating": "6",
        "review_title": "Not a great film in any sense, The Astronaut's Wife is entertaining in the sense that you feel you are being led up to an excellent climax, but when it is eventually reached, it is disappointing and retrospe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jamesfranklin77",
        "review_rating": "4",
        "review_title": "interesting idea but dull!",
        "review_detailed_main": "look, i'm not a sci-fi fan, but i do enjoy a good thriller and i can appreciate a good movie. The Astronaut's Wife is not a bad movie, it's just incredibly dull. An astronaut (Johnny Depp) goes up to space and when he comes back down, strange things go on and his wife starts wondering if this is really her husband? This could have been good, it's well made and also quite well acted, but nothing ever happens until the last 5 or 10 minutes. Spend your well earned cash on watching something else!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tolake",
        "review_rating": "9",
        "review_title": "15 years after the movie came out",
        "review_detailed_main": "I have come to appreciate a good sci-fi that does not hurt your eyes with 2 hours of CGI and high speed rapid fire images at the cost of a decent story.\n\nThis is a wonderful role of non-weirdness for Johnny Depp and Charlize Theron has a wonderful presences in every role that she takes on. I cannot wait to see her in Fury Road.\n\nThere are also many well acted secondary roles, including Joe Morton and Clea Duvall and Blair Brown.\n\nI love good science fiction and that is what this is. It hearkens back to the science fiction writers that I grew up with, like Isaac Asimov and Arthur C. Clarke and Robert A. Heinlein.\n\nWith so much to choose from these days online, in the theater, on TV and decades of science fiction in the media, this is a good one to burn a couple of hours with, like a good book, a cup of coffee and a pack of smokes, when I did smoke."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "FabioPirovano",
        "review_rating": "6",
        "review_title": "Could be developed better but",
        "review_detailed_main": "This film play about the fear of unknow, helped by a Amazing and STUNNING Cinematography by Allen Daviau ASC,one of reason why worth be watching! The story could be developed better but is an example how sci-fi could be see from a more intimistic and human side,without too much special effects...like was the oldiest sci fi movie,and that was a great effort."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "4",
        "review_title": "the year that Johnny Depp got surrounded by evil",
        "review_detailed_main": "All three of the movies in which Johnny Depp appeared in 1999 depicted him coming in contact with something spooky. His most famous movie that year was Tim Burton's \"Sleepy Hollow\", which cast him as Ichabod Crane. A lesser known one was Roman Polanski's confusing flick \"The Ninth Gate\", where Depp played a rare book dealer who acquires a book that's said to summon the Devil.\n\nAnd then there was \"The Astronaut's Wife\". Most people have called this one a \"Rosemary's Baby\" knockoff. Overall it was what I expected. A \"Rosemary's Baby\" knockoff that I liked was the 1974 TV movie \"The Stranger Within\", starring Barbara Eden as a pregnant woman who starts behaving strangely (you may have thought it impossible, but Barbara Eden CAN look terrifying).\n\nWorth seeing as long as you know what you're getting. The rest of the cast includes Charlize Theron, Joe Morton, Nick Cassavetes, Donna Murphy (more recently known as the voice of Mother Gothel in Disney's \"Tangled\"), Samantha Eggar and Blair Brown."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "J-78",
        "review_rating": "",
        "review_title": "A Misunderstood Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "LazySod",
        "review_rating": "2",
        "review_title": "The shortest way to go from bored to irritated",
        "review_detailed_main": "A couple of astronauts is fixing a satellite in outer space. Suddenly all communication with the base on earth is broken. Two minutes later the communication is back online and the astronauts are taken back to earth. Once they get back on earth one of them starts acting quite strangely and drops dead. The other doesn't start to act very strangely until his wife discovers she is pregnant, basically much too late.\n\nAnd so ends the summary because the rest of this awful movie can be derived easily. It's after all a very basic SF monster movie which has taken the worst scenes of some of the best SF monster movies ever made (Alien, Species) and the worst scenes from the worst SF monster movies ever made (Virus etc..). In short: it starts to be boring, and ends irritating."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Seraphion",
        "review_rating": "6",
        "review_title": "A decent thriller and mystery mix",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "B_E_A_C_H_B_E_L_L_E",
        "review_rating": "5",
        "review_title": "To the point",
        "review_detailed_main": "Ah...where was the plot? Talk about weak! I only enjoyed this movie visually. Yes, visually. Nice to look at. No plot. None. Maybe if it had had a plot... Did I mention, there is no plot?"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "doktoras",
        "review_rating": "6",
        "review_title": "Could be better...",
        "review_detailed_main": "I am not sure, what was that put me off with this movie. I like Johny Depp, the central idea is rather good (although not original), but neither the script, nor the acting, nor the rythm was what it should be. Both Depp and Charlize Theron act as if they are bored (especially Depp -but that must be bad directing), Joe Morton, although good in the supporting role of a NASA exec who knows what is going on, is not enough and all the rest of the cast just walk on and off camera being just part of the set. With a couple of really good actors, this could be a good theater play, but for 109 minutes on the silver screen it is tiring. Still, it is not boring and I already know some people who actually liked it very much -one more proof that it takes all kinds."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Shiva-11",
        "review_rating": "4",
        "review_title": "Out of this world movie runs out of air.",
        "review_detailed_main": "The Astronaut's Wife: two astronauts (Johnny Depp and Nick Cassavetes)are attacked while on a space walk and the experience changes them -literally.\n\nTo get a feel for this movie, you need to take bits and pieces from Species, Fallen, and the Omen, then put them on a shelf until the concoction goes bad. The plot (if you can call it that) wanders aimlessly until it makes a vain attempt to tie up everything at the end of the movie, but by then you simply do not care.\n\nDepp has breathed life in to some amazing characters; Donnie Brasco, Ed Wood, Don Juan DeMarco (my guilty favorite) to name a few. Unfortunately he's also had roles in messes like \"Fear and Loathing in Las Vegas\" and this one (maybe he needs a new agent?).\n\nAs for Charlize Theron, who demonstrated nascent talent in \"Two Days in The Valley\", and \"The Devil's Advocate\" her abilities are completely wasted in the one dimensional character she's saddled with here.\n\nMiss it."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "flying_poodle",
        "review_rating": "6",
        "review_title": "Acting not to blame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "kevin c",
        "review_rating": "3",
        "review_title": "CRASH LANDING",
        "review_detailed_main": "This film is an okay effort, if you don't take it too seriously. The ending is a bit of a let-down, but you stick with it up until then.\n\nThere are nods towards \"Rosemary's Baby\" : WHY?? And Depp is obviously going through the motions on auto-pilot. Don't rush to the video store, but catch it on satellite if you've got not much on."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Rainey-Dawn",
        "review_rating": "9",
        "review_title": "A Great Sci-Fi Horror Film",
        "review_detailed_main": "And I will say it again \"A Great Sci-Fi Horror Film\". Extremely creepy and suspenseful!\n\nWhen I first saw the film I had not a clue as to what is was about - no idea of the story plot. I thought it was maybe a romantic type of a science fiction film because of the film title - maybe a romantic drama about an astronaut and his wife. Well, in a way it is but not exactly as I was thinking - it was so much better than I had in mind!\n\nThe movie keep me in suspense throughout the film... and I was shocked at the ending! If you like alien type of films mixed with thrilling horror then you might like this movie.\n\n9/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Reviews_of_the_Dead",
        "review_rating": "7",
        "review_title": "Review for the Astronaut's Wife",
        "review_detailed_main": "This was a film that I vaguely remember coming out, but I didn't see it until years later. I would have been 12 years old in 1999. I would be unable to drive so unless it caught my attention to rent, it went unnoticed. This was watched since it was in the Horror Show Guide encyclopedia that I'm working through. My rewatch was done with my wife, Jaime, for our podcast, Depp Dive: A Depper Look at Johnny's Feature Filmography.\n\nSynopsis: after an explosion in space and after a two-minute radio-out period, two astronauts return home to their wives. They're not quite the same as they were though.\n\nWe start this by getting to know our main couple. One of the astronauts from the synopsis is Commander Spencer Armacost (Johnny Depp, and he's married to an elementary school teacher, Jillian (Charlize Theron). He is about to go on a mission into space. Jillian is proud and terrified but being strong to help steal his nerves. Spencer is going up with Capt. Alex Streck (Nick Cassavetes).\n\nThings are going smoothly until a night that Jillian is cooking dinner for her and her sister, Nan (Clea DuVall). A news report catches her eye. NASA lost radio contact with the crew. They then send Sherman Reese (Joe Morton). Jillian wants more information, but they're limited to what they can share. She is taken to a room to wait with Alex's wife, Natalie (Donna Murphy). What we learn is that for 2 minutes, they lost contact and there was an explosion.\n\nThey return safe to Earth and go back to living their lives. Dr. Patraba (Samantha Eggar) and her team oversee confirming that they are healthy. All the tests are coming back healthy. As the synopsis states though, there is something off about both. The other couple seem to bicker constantly. Spencer decides he no longer wants to be a pilot, which was his dream from the beginning. He now wants to move to New York City to be an executive for an aeronautics company. We learn that this city was one he used to hate and this position is something he knows nothing about.\n\nJillian cannot prove what her fears are though. She thinks there is something off about her husband. She becomes pregnant and learns that she is having twins. She also has a history of mental illness so she is distrustful of her thoughts. It doesn't help that Natalie does something during a party that rocks everyone to the core. She has to figure out the truth and if Spencer is still truly the man she married, or did something happen during the brief time in space.\n\nThat is where I'll leave my recap and introduction to the characters. Where I want to start is that I'm glad that I gave this movie a rewatch. I knew that it has solid premises. It isn't one that is new. I've seen other films where we have an unreliable narrator, having someone who is pregnant and distrustful of things around her. This feels like it is a combination of Rosemary's Baby with Village of the Damned.\n\nWith that all set up, where I want to delve first would be in our lead character of Jillian. We learn through things with her sister and her talking to a doctor that she had a dark stretch. She was suicidal and Spencer was there for her. I do like setting that up. Nan loves him and thinks that her sister is so lucky for having met him. That helps with the tension here since it confirms that we might not be able to trust her. There is also pregnancy brain, which Jaime has acknowledged me. That also is contributing to what she thinks.\n\nWhere I then want to go is bringing back up the connection with Village of the Damned. Before getting into that more, I love that this movie confirms what is happening here. What works even better for what I've already discussed with Jillian, it takes a long stretch before its reveal. That is good to build that tension and make us consider that our lead is insane. What we're getting here is like the older movie that I've been referencing. They are in the womb, but we see that they might have powers or at least, a hive mind. That works for me.\n\nLet me then shift away from the story to discuss the acting. I thought that Theron was solid here. It is interesting that this is like her role in The Devil's Advocate. The only difference is that instead of making her a secondary character, we are following her instead. She's good at showing what is needed for the role. Depp is in a more subdued role for him. He is more brooding and shows up at different times which makes it creepy. Morton is solid as the one who needs to convince Jillian before it is too late. DuVall works in her role along with Murphy, Cassavetes, Eggar, Gary Grubbs and Tom Noonan. No one is great here, but they work for what is needed.\n\nAll that is left then is filmmaking. I thought that the cinematography was good. They do good things when Jillian gets disoriented. It make us feel that way as well. How they frame things work as well. How this is shot works. We don't get much in the way of effects. It also isn't that type of movie. I will say, there is something at the end that didn't look great and doesn't hold up now. That would be the only gripe. Other than that, the soundtrack fit what was needed.\n\nIn conclusion, this movie is better than I remember it being. I don't think that it is great though still. The story is fine. An issue there is that this is a story that has been done before, just better. I still like combining elements for different things here. The acting is solid. Theron leading the way with a solid cast around her. This is made well enough. The cinematography and framing leading the way there. There are decent things with the effects, but there is CGI that doesn't hold up. This is a forgettable movie that is still solid if you like these types.\n\nMy Rating: 6.5 out of 10."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rmarkd",
        "review_rating": "2",
        "review_title": "Awful! Do not watch!",
        "review_detailed_main": "So far, the worst movie I've seen in 1999. The basic premise behind the movie is very interesting, and a great sci-fi novel and movie can be made of it. This movie was not it.\n\nThis movie moved in jerks. It started interestingly enough but just sat there, boring the audience. It went nowhere fast and did progressed like a snail in a strong head wind.\n\nI wasn't the only one. I could hear couples in the audience, each blaming the other for making them watch this \"movie\".\n\nI wanted to ask for my money back."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "badgerboy97",
        "review_rating": "",
        "review_title": "Certainly No Masterpiece, But....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Michael-96",
        "review_rating": "2",
        "review_title": "Not what it could have been",
        "review_detailed_main": "The feeling I came away with from The Astronaut's Wife is that it simply isn't what it could have been. A good plot premise and fair acting from the cast is let down by poor script, dreadful special effects, and one of the most painful endings written solely to cater for a sequel that I've yet seen! The end result is a movie that is a total disappointment - the best I can say for it is that it will fill an evening if you can find nothing better to do. It should have been so much more..."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "cadburypg",
        "review_rating": "3",
        "review_title": "Waste of fine actors",
        "review_detailed_main": "This movie shouldn't have been made. I wonder if the writer and the director had any insight into what they were dealing with. Seems like they had an idea of a space and alien thriller which they made into a movie before it took any concrete shape. What started on a promising note becomes completely lost and shallow. Johnny Depp is a complete miscast as an astronaut. His expressions are too casual for an astronaut and he seems like he has no business being in a sci-fi movie. Even the actor cast as his fellow astronaut looks more like a mercenary. Depp did manage to look a bit creepy when the mystery is out. Theron fares better and is more convincing as a 2nd grade teacher and the chemistry between herself and Depp is pretty good. The plot is wanting in substance and lacks the impact of a haunting and creepy thriller about alien invasion. It fails to make the point of how chilling an alien invasion could be or how easily progress of science could be the doom of mankind. Hell, it even fails to cut a mark about how suddenly a young happily married couple's life is devastated. It was nothing more than a waste of time watching this movie."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "elise_lam107",
        "review_rating": "6",
        "review_title": "Film Tactics in The Astronaut's Wife",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "IonicBreezeMachine",
        "review_rating": "4",
        "review_title": "A rich premise, but undermined by a turgid pace and lack of thrills",
        "review_detailed_main": "Second grade teacher Jillian Armacost (Charlize Theron) is the dedicated wife of astronaut Commander Spencer Armacost (Johnny Depp) on a shuttle mission to repair a damaged satellite, Spencer and fellow astronaut and friend Alex Streck (Nick Cassavetes) experience a complication during the mission where contact was lost between them and mission control for two minutes. However despite the turmoil, Spencer and Alex manage to return to Earth safely. While Spencer initially seems fine, he decides much to Jillian's surprise the time has come for him to leave NASA and take a job at an aerospace company in New York, however Alex Streck suffers a fatal stroke while his wife Natalie (Donna Murphy) commits suicide soon thereafter. As Jillian struggles to adjust to life in New York, she soon finds herself pregnant with Spencer's twin children but over time finds herself wondering if the Spencer who returned is the one she married.\n\nThe Astronaut's Wife is a 1999 science fiction thriller written and directed by Rand Ravich. The film was a high priority for New Line Cinema who'd acquired the script, described as a modern update on Rosemary's Baby, after several other studios expressed interest in it. The film was fast tracked into production with both Depp and Theron secured for the leads within a few months of the script's acquisition. Made for $75 million, the film proved to be a box office bomb opening in ninth place behind several holdovers as The Sixth Sense continued to dominate the top spot with the film only making $19 million worldwide. Critical reception was equally dismal with many critics making unfavorable comparisons to Rosemary's Baby and criticizing the slow pace. The Astronaut's Wife on paper seems to have a solid high concept hook for a thriller, but in practice it's a turgid experience with few surprises that sleepily lumbers to a foregone conclusion.\n\nIf you boil down The Astronaut's Wife down to its most basic components, the film features a female protagonist stuck in an abusive relationship with an added sci-fi element of her husband \"no longer being who he says he is\" and there are individual moments where that does come through such as the sex scene that instigates the plot, the controlling nature of Spencer as a character, or Jillian feeling no sense of clam or peace and very much isolated from friends or family. Despite the richness of such a premise in playing for thrills, the movie makes a fatal mistake from the get go as the hour long leadup features very little of anything really happening while the film plays at a consistently dreary and dull manner. A major factor that undermines the effectiveness of this film's plot is we were never really given the opportunity to see Spencer and Jillian as a couple before he went into space (outside of a very brief and not that sexy sex scene) and when Spencer does come back from his mission there should be a sense that something is maybe a little off from how we knew him originally, but because we didn't know him originally it just doesn't hit where it should. The movie briefly comes to life with Joe Morton's Sherman Reese entering the story as a NASA scientist who tries to warn Jillian, but he's really the only part of the movie where any actual thrills come through and once he's gone so too are the thrills. At two hours the movie really feels its length because the characters are so flat and there's some excess bloat to this movie such as with Spencer developing a new jet that feels unnecessary because it has nothing to do with Jillian's pregnancy and just feels like a distraction from what we should be focusing on.\n\nThe Astronaut's Wife feels like a first draft that was rushed into production without proper thought as to how to make it actually work on screen. If you gave some additional re-writes to this material you could see a good movie coming from this premise but as is: it's a threadbare exercise that might have enough plot for a one off episode of The X-Files or Outer Limits."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "grnbaum19",
        "review_rating": "6",
        "review_title": "better than expected",
        "review_detailed_main": "This movie never really got too slow, which was good, because the plot wasn't too original. Minor suspense here and there kept me going, although i just didn't dig charlize theron's haircut. I gave it a 6, maybe even a 7, i'll have to check my vote history, but it wasn't a bad flick."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "gavin6942",
        "review_rating": "5",
        "review_title": "Good Premise, But Feels Stale",
        "review_detailed_main": "After an explosion in space and subsequent two-minute radio-out period, two astronauts return home to their wives. But they are not the same as they were.\n\nThis is definitely not one of the more enjoyable performances from Johnny Depp, and comes across as off-putting and creepy. I understand this was partially the point, but even so it does nothing to highlight the talents of Mr. Depp.\n\nAlthough I cannot say what the film reminds me of, it seems like something I have seen before. The plot is so obvious, it just feels derivative and stale. Has this been done before? Is this a remake and we just don't know? And why is not all that good if the plot is interesting?"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "priscillaliang",
        "review_rating": "10",
        "review_title": "CREEPY!!!!",
        "review_detailed_main": "Charlize Theron continues her pat hand in the manner of Devil's Advocate with this spine-tingling thriller where all is not what you think--or even what you thought you might think. Once again playing the fragile and loyal wife, this time against the deadpan Johnny Depp in one his spookiest roles to date, Theron delivers dramatic twists and turns that will leave viewers feeling they just got off an adults only roller coaster.\n\nFor his part Depp is dead on, performing his role as a provider yet becoming increasingly distant as if he were still stuck outside his orbiter in outer space. What happened out there? Nobody, even NASA, seems to know--or at least wants to tell.\n\nDirector Rand Ravich of Candyman fame uses taut editing, mind blowing sound effects, and extreme close up camera angles to keep the suspense taut to the very end. And then the unexpected ending will leave you guessing even more. This is a great date flick when you want to grab on to your honey!\n\nWhile both Theron and Depp were to go on to even bigger roles, this one was overlooked as a near classic in the science fiction category. Ten of ten."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Lee-112",
        "review_rating": "6",
        "review_title": "Could've been better",
        "review_detailed_main": "I was hoping this movie was going to be good, but it wasn't. I think it could've been way better. It was kind of slow, but it kept me watching, and at the end is where I REALLY felt that the movie was \"retarded\". I'm not going to give anything away, but it's just like the average ending these days.\n\nCharlize Theron was pretty good in it though. If it wasn't so slow and kind of lost my interest through it, and if the ending was better, I think this movie could've been actually good. But since it's not, I think I gave it a 5."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "nnywig",
        "review_rating": "2",
        "review_title": "Should have been a twilight zone episode",
        "review_detailed_main": "Most of the movie is spent marking time until the ending scene.\n\nIf this had been a 1/2 hour twilight zone episode, I would rate it an 8 because the gist of the story is interesting enough to justify spending 30 minutes watching."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Dethcharm",
        "review_rating": "",
        "review_title": "Ground Control To Captain Jack...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "griffty1982",
        "review_rating": "3",
        "review_title": "What!!!!",
        "review_detailed_main": "Could have been so much better. Was OK till the end and it just didn't explain anything about why this plane was being built, why the twins were going to be flying it. Why did one astronaut die and the other live. Why they kept saying he's inside me. Johnny Depp played his part well although all the way through it felt like the directors wanted Ray Leota to play his part. He sounded exactly like Ray and even looked like him. As for Charlize Theron, did she think it was a sequel to The Devil's Advocate, her character was the same. Should have had someone else play the part, would have been better. At the end of the film i found it a complete waste of time. A disappointment as the description was good, had good potential but was ruined by bad directing and lack of explanation."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "misscath-02668",
        "review_rating": "6",
        "review_title": "I liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rach77",
        "review_rating": "2",
        "review_title": "really bad, holes in story, no actor chemistry",
        "review_detailed_main": "This movie was absolutely terrible. The script was utter trash. Most of the lines that were supposed to be intense and/or creepy were outright laughable. The story had huge gaping holes in it, they never tell you the hows and the whys of what you are seeing. No time is given to develop Johnny Depp's character, so when he goes through \"the change\" you can't tell because you don't know what he was like before. Charlize gives a decent performance, but i still feel that she was miss cast. She never seems to get the emotion quite right. Johnny and Charlize have absolutely NO on screen chemistry. The only thing i liked was the direction, i have to say there were some very cool shots in this film."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lionel25",
        "review_rating": "6",
        "review_title": "Decently made but without any tastes",
        "review_detailed_main": "I do think that Johnny Depp is a very good actor, even one of the best of his generation and Charlize Theron is for most of the time amazing, too, so you would think that the encounter of such actors would bring you an unforgettable moment of cinema? You're wrong! Jonny Depp is far from being amazing here, he even fails to deliver an average performance with his character's palette of expression limited to a cold face and a once in a while smile. Charlize pretty much play the samecharacter than in the Devil's advocate but seems even more insecure andweeps for most part of the picture. Concerning the storyline, the pace of the film is so slow that you will find yourself falling asleep after a couple of minutes. So why a 6? Because cinematographically speaking, it has no plot hole and descent shots. In a word it is decently made but without any tastes."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Metamorf",
        "review_rating": "2",
        "review_title": "Long, boring non-thriller.",
        "review_detailed_main": "This is the kind of movie I have seen over and over and continues to hold a complete lack of inspiration for me.\n\nCharlize Theron made much better of a similar role in 'Devil's Advocate, The (1997)' and as a villain, Johnny Depp is about as menacing as a carrot.\n\nInterminable Dross -- 2/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "33Ford",
        "review_rating": "6",
        "review_title": "Very slow....but Charllize looks great.",
        "review_detailed_main": "I knew absolutely nothing about this film before I saw it other than the fact that Charlize Theron was in it. While she looks absolutely fabulous through most of the movie, and her acting, I thought, was one of the best things in the film, overall it was slow and not very involving.\n\nIn the later stages of the film after she becomes pregnant Charlize Theron's face becomes very puffy and not too attractive. Reminded me of her role in the The Devil's Advocate. I wonder how they did that to her face? Then there is one scene where she and Johnny Depp are making love and there is a closeup of his hand caressing her face. I couldn't believe that he had dirty, ragged fingernails. C'mon Johnny....you can afford a manicure.\n\nAs others have mentioned there was zero chemistry between Theron and Depp. In fact, he is pretty wooden throughout the whole film. Despite other comments to the contrary, I thought Theron was not only well cast in this role, but did a terrific acting job.\n\nBut for me, the entire mood of the film from start to finish is very unsettling. I never felt comfortable watching it. But the menace that is an underlying factor throughout the film is very subtle....probably too subtle. For me the film would have had a lot more zip if it had been a little more in my face.\n\nThe cinematography is outstanding with some very creative camera-work. The cinematographer loved close ups up Charlize Theron's lips. Not a bad subject in my view. The apartment the couple live in after they move to New York is incredible. I would say the rent on something like that would be about ten or fifteen grand a month.\n\nFrankly, for me, other than the opportunity to view Ms. Theron, who I feel is the most appealing actress working today, the film was largely a waste of time and the ending was a let down."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Monroe-2",
        "review_rating": "2",
        "review_title": "Houston, we have a problem...",
        "review_detailed_main": "This movie definitely did not live up to it's potential. This could have been one heck of a scary movie. However, I kept waiting and waiting for the plot to progress...and it just hopelessly fizzled out. My fiance, my friend and I came up with a better ending on the car ride home from the movie theater than the one the movie had. Who test screened this movie?!? The saving grace (the only reason I didn't waste $8.50) was the cinematography. There was some excellent camera work. Like I said before, it definitely didn't live up to it's potential."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "mademoisellefontaine2009",
        "review_rating": "8",
        "review_title": "Lowkey sci-fi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "sol1218",
        "review_rating": "6",
        "review_title": "Space Children",
        "review_detailed_main": "**SPOILERS** Outer space Rosemary's Baby-like shocker that holds together pretty well until the final few minutes when you would expect the movie to deliver the goods and only end up getting a second-rate and very confusing, or a complete let-down, surprise ending. Being sent into orbit on the space shuttle astronauts Spencer Armacost and Alex Streck, Jhonny Depp & Nick Cassavetes, are almost killed as their repairing the shuttle while in space. Being cut off for over two minutes, from the main NASA monitoring station in Huston, it was at first assumed that the two were killed in an explosion outside the shuttle. Later it was confirmed that both Spencer and Alex were all right and the shuttle mission was aborted with the two astronauts brought back to earth. Something happened up there to the two spacemen that was to come very very close to home, their wives, when they returned.\n\nBoth of the astronauts wives Jillian & Natalie, Charlize Theron & Donna Murphy, at first don't notice any change in their husbands, Spencer & Alex, appearances or conduct only that their horny as hell. At the first possible chance the returning astronauts had had they, at least in the scene between Spencer and Jillian,pounced upon their wives like wild animals in heat and brutally make love to them as if they haven't seen or touched their wives , or any other woman, in years!\n\nIt's later at an out-door party that Alex, after having a fight with Natalie, goes berserk and collapses and dies from a massive heart-attack. Later Natalie despondent over her husbands sudden death commits suicide by electrocuting herself in the bathtub while both Spencer and Jillian are there at her home visiting and trying to comfort her over her tragic loss.\n\nMoving to New York City Spencer gets a job working for Jackson McLaren's, Tom Noonan, aerospace company and things just couldn't be better for the happy young couple. It's when Jillian gets pregnant and is later told that she's to give birth to twins by her physician Dr. Patraba,Samantha Eggar, that strange things start to happen to her. This all leads Jillian to believe that the person that she's married to, Spencer Armacost, isn't the man that she thinks he is in fact he isn't a man at all!\n\nThe movie quickly moves to from where Jillian has absolutely no suspicion of her husbands sinister plans for her and her future children to where she's terrified at just the very sight of him. Being contacted by former NASA insider Sherman Reese,Tom Morton,Jillian is told that her husband is not human and that his body and mind were taken over by some unknown and unseen alien force while he and Alex were in outer space! A force that's anything but friendly towards her or any one else on earth.\n\nJillian thinking at first that Reese is some kind of nut still can't dismiss the shocking and personal information that Reese knows about her being pregnant with twins. Reese also knew that Natalie was also pregnant at the time of her suicide, that was kept from the public, and she also was to give birth to twins; how on earth could Reese have known all this unless he was telling the truth?\n\nReese trying to get all the secret and shocking information about Specer to Jillian, before he feels that he'd be silenced forever, information that proves that Spencer's not who she thinks he is from top-secret NASA documents ,that Reese smuggled out before he was fired from his job. All of Reese's efforts come to a crashing end when he's intercepted by Spencer at a local New York City subway station where the drop, or pick up, by Jillian was supposed to take place and is never seen and heard from again with Spencer, instead of the out of sight and hidden Jillian, taking off with his briefcase.\n\nGetting a key from Reese in the mail it leads Jillian to a storage building where he kept as a back up, something he learned from working at NASA, information about the truth of Spencer's origins. Jillian now more then ever is convinced that her husband is not only not of this earth but later when Jillian finds out that her sister Nan, Clea Duvall, who was last seen at her and Spencer's apartment was missing she suspected that her once \"sweet kind and loving\" husband is a murderer as well.\n\nThe movie looked like it was going to be a better then average thriller but fizzled at the end with a very convoluted final that destroyed all the tension that was building up in the film. Your left wondering what exactly the ending was all about with a complete turn around, as well as new hairdo, in what Jillian was actually trying to achieve in stopping her husband and his offspring's the evil space twins from gaining a foothold, so that they can later take control, of the US NASA space program."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "terjeber",
        "review_rating": "1",
        "review_title": "What a piece of garbage.",
        "review_detailed_main": "Incredibly stupid story, incredibly bad female lead actress, uninspired and lazy Johnny Depp, paired with a lousy production team and annoying clipping. This is the worst movie I have seen this year. I'd rather see The Out-of-Towners 10 times in a row while having teeth pulled than see this again.\n\nWe meet an astronaut and his wife. He has had an accident in space, and has a bit of a strange behavior when he returns. Why? Well, he has apparently had an alien encounter in space, and... Well, if you are into masochism, go find out. My advice is not to try to find out however."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "WinterMaiden",
        "review_rating": "",
        "review_title": "Rosemary's Baby? Yup (and why not?)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "preppy-2",
        "review_rating": "4",
        "review_title": "Long, slow, boring",
        "review_detailed_main": "Textbook example of how NOT to do a horror film. Take a decent premise (is her husband possessed by a monster from outer space?), slow it down as much as possible, instruct EVERYBODY to act like they're on Valium, throw in a lot of \"artsy\" camera shots like it's an art film, and give us one of the worst endings in cinema history and you've got one of the lousiest horror films ever! This film will (hopefully) be soon forgotten. Go see \"I Married a Monster from Outer Space\" instead."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "sddavis63",
        "review_rating": "6",
        "review_title": "The Cast Is Good; The Story Is Lacking",
        "review_detailed_main": "With Johnny Depp and Charlize Theron heading up the cast I was ready for a pretty good ride with this. I like both Depp and Theron. She, especially, is one of my favourites. In this both were cast a little bit against character, which made things even more interesting in some ways. Depp wasn't his usual quirky character that we've come to associate with him through his many collaborations with director Tim Burton. Working here with a director other than Burton, Depp's character is more serious and has more depth (and Depp actually reminded me a little bit of Matthew McConaughey in this); Spencer Armacost is mysterious rather than quirky. As Spencer's wife Jillian, Theron breaks away from her usual \"strong\" woman persona and plays a much more vulnerable character who gradually realizes that she's caught up in something out of her control. Both Depp and Theron were quite good, although perhaps the best (if limited) performance in the movie was from Joe Morton as Sherman Reese, a NASA official who figures out the mystery that's going on here, but who no one takes seriously. His limited performance in his later encounters with Jillian as he tries to explain to her what's happening was actually riveting.\n\nThe story has Spencer as an astronaut who survives some type of accident in space but was completely out of touch with NASA for two minutes. He returns to earth and everything seems normal. The question is - what happened during those two minutes? Neither Spencer nor his partner Alex (Nick Cassavetes) will talk about it. The story and the mystery unfold slowly (frankly, too slowly for my liking.) There's really very little to hold your attention through most of the first hour or so of this. Just vague hints of something being not quite right - but maybe Spencer just has a bad case of PTSD from his experience. There are surprises. Alex's unexpected death and his wife's totally unexpected suicide afterward add to the growing feeling that something's not right. Reese's re-introduction as the ex-NASA employee trying to warn Jillian probably represents the high point of the movie. The mystery (although we kind of suspected all along) is revealed and then it's a matter of seeing how it turns out. There's a spurt of energy and drama after that one hour mark as the movie picks up steam. Somehow, though, that dissipated rather quickly. The ending was - to me at least - unsatisfying; the last scene left too much up in the air.\n\nBasically, the performances are good, and there's a fair bit of potential in the story, and I appreciated seeing Depp and Theron in what were - for them - unconventional roles. The story was lacking though. It needed more meat, and it needed more tying up at the end."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "PyrolyticCarbon",
        "review_rating": "5",
        "review_title": "Looks nice, but fails in the horrorscare department.",
        "review_detailed_main": "A great story, and very nicely shot with great lighting and a nicely active camera. It's an interesting story too, and Charlize Theron is so believable in character, and gorgeous! Johnny Depp does manage to unnerve you superbly in this role, yet his accent did nothing but annoy me throughout.\n\nThe story didn't seem to make enough of the accessories to the plot, for instance the missing two minutes in space, the noises on the radio. These sidelines could have done so much to make the story creepier, yet they were brushed aside. Even the new job, although seeming highly relevant, is made nothing of.\n\nThe ending. Well, it seemed like a rushed one, and a bit of an anti-climax. I'll say no more.\n\nNot too bad for some easy entertainment, there's a couple of bits that are quite good, but don't expect too much."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "redkiwi",
        "review_rating": "6",
        "review_title": "Very tiresome",
        "review_detailed_main": "This is an interesting concept that could have been so much better. Depp, an astronaut, is invaded by an alien life force while lost in a 2 minute window in space.\n\nThere were immense possibilities to this, but it became a standard Hollywood story of demonisation that was as predictable as it was over long by the end.\n\nTheron does well [and is gorgeous], but Depp fails to achieve the heights of some of his other recent work.\n\nDefinitely worth a miss, average at very best."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "el_nickster",
        "review_rating": "3",
        "review_title": "Cosmic stink-bomb.",
        "review_detailed_main": "This is a long, dull movie which rips off numerous other horror movies.\n\nIt is kind of a cross between \"The Devil's Advocate\" and \"Rosemary's Baby.\" Those were pretty good movies, however, and this one stinks. Johnny Dep comes home from space different. He is somehow evil. His wife knows something isn't right. The they decide to move from Florida to New York, which is evil (just like moving from Florida to New York is evil in \"Devil's Advocate\"). Then she gets pregnant. That is also evil. In fact, Mr. Depp is an alien, and his wife is carrying his alien child. Big surprise. There is a moderately good sex scene in this movie, but it isn't worth renting in my book."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "laurel_mdock14",
        "review_rating": "6",
        "review_title": "Film Recommendation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "clara-17",
        "review_rating": "1",
        "review_title": "Electrocute me for seeing this thing!",
        "review_detailed_main": "I really hope the central actors got paid well... Why else would they hurt their resumes with this definite piece of dribble? I would pay good money to see the director of The Astronaut's Wife fry in an electrical accident of some sort (hopefully, in his own kitchen while cooking a steak bought with my money after seeing his film). Then again, I've already wasted good money renting his pathetic film on DVD, so I guess I will just not return the DVD, but instead, fry it in an electrical accident on my kitchen stove. Please don't do yourself a disservice and view this film!\n\n1/10 stars for sure"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "desteed",
        "review_rating": "10",
        "review_title": "Great! Matrix status.",
        "review_detailed_main": "It is not very often that I can throughly enjoy a movie from beginning to end. This movie was excellent. Charlize and Johnny were perfect!!!! The story was very original and it left me stringing along in all the right places. I am going to recommend this one to every true movie watcher that comes along."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lucy_brindley",
        "review_rating": "6",
        "review_title": "Suspenseful film isn't particularly good or bad",
        "review_detailed_main": "Formulaic thriller features the usual \"wife is mentality ill and not to be believed\" storyline but when viewed through the lens of domestic violence and reproductive freedom, this film can be quite chilling. Alien infection storyline aside, there's a lot to unpack with how the main character is systematically isolated and depicted as mentally unstable and how this is then used to control her and stop her from seeking help. Acting ranged from terrible (Depp) to pretty engaging (Theron). Storyline hold very few surprises and uses familiar tropes but is definitely worth a watch and not nearly as dull as reviews make it seem. Minimal CG hasn't aged terribly but the fashion sure has. Nice-paced suspense and Theron's acting lifts this one to a 6."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "baseballgirl",
        "review_rating": "3",
        "review_title": "Not a good movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Nefi",
        "review_rating": "",
        "review_title": "Well done Scott Terek for your excellent review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lase-protect",
        "review_rating": "3",
        "review_title": "Very Poor",
        "review_detailed_main": "26 / 100 (on first view) People seem to hold Jonny Depp in overly high regard. I can't unfortunately. I'm not denying he's a good actor, but people generally talk about him like if he's in something, it's brilliant. This is a good example.\n\nI rated this 26 on first view, that usually means I'm even more critical on second viewing, but I doubt there'll be a second time for this.\n\nIt's everything I hate about the human subconscious really. This desire to be scared in a safe manor in the comfort of a cinema seat with a box of toffee popcorn and a car waiting in the car park to get one safely home. This nurturing of the Thanatos Complex.\n\nI missed the first half hour but this might have been a good thing. The female actor who's name I've no wish to know was perfect for a film of this calibre / genre. Perfect as in appalling, like the genre. I can imagine it was marketed as a thriller but it's trying to be a horror so I'd label it a horror and leave it on those shelves. A sci-fi horror. (If I'd have seen that I wouldn't have bothered watching it) It was off to a head start within the first five minutes and had me thinking \"see this is good, straight away it's got me thinking, what happened in space\" of course you never get to see really. But gradually the optimism faded.\n\nI can't help but see the parallels between what happens In this film and anti-natal depression and wonder if that's what this films really all about. I've experienced post-natal depression and the similarities portrayed in the film were harrowing, albeit with some 'far-out' story-lines to keep the film deceptive.\n\nI wouldn't have reviewed this, but wanted to see if anyone else had spotted this sub-plot. Maybe I'm imagining it.\n\nIt could have been superb I think."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "cisco1978",
        "review_rating": "3",
        "review_title": "Good Acting- Terrible Film (Spoiler Warning)",
        "review_detailed_main": "Despite the performances of both Theron and Depp this movie was pretty bad, it was for the most part, boring and when it wasn't boring it was depressing.\n\nThe final straw that made me feel I was absolutely cheated by watching it to the end to see what happens, was the awful ending itself.\n\nTalk about cheating the viewer out of any satisfaction at all.\n\nI cant for the life of me figure out why the script writers thought that having Jilian become the very thing she was trying to destroy by becoming possessed by the alien being would be a good thing for the movie.\n\nJilians masterstroke of setting up the water to pour in behind Spencer from the bath as he thought he was carefully avoiding the puddle from the sink was totally undone when she pulled her feet out of the water and was taken over.\n\nAlso those creepy little kids of hers at the end was enough to want you to throw something at the TV.\n\nOne to put on the never to watch list unless you enjoy feeling totally cheated at the end of a movie."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "vlevensonnd-1",
        "review_rating": "3",
        "review_title": "Tripe & Drival - Disgraceful Waste of Good Talent",
        "review_detailed_main": "I saw this for the 1st time last night - I've seen it on the movie rentals shelf for years but never brought myself to rent it. I know better then to go against my better judgment, but I had only 30 minutes to pick out movies and race home because supper was still in the oven. Sighhhhh..... I'll try to never be in such a hurry again.\n\nThis reminded me of a modern version of Rosemary's Baby, and just as dense. Charlize Theron, however, did a far better job of acting then did Mia Farrow, whom I never considered to be an actress of any significance. Her acting was the only plus to this movie. Johnny certainly couldn't pull it off. With the less then educated script, and stupid remarks of him \"living there\" and pointing to his wife's gut, truly left much to be desired. Then of course the completely brainless ending with evil triumphing over good, is always the sludge on top of the sh_ _ cake. Don't waste your time on this. There are far better movies out there that can capture your interests."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "packard8",
        "review_rating": "1",
        "review_title": "Ruins the term \"Psycological Thriller\"",
        "review_detailed_main": "When a movie is grossly low on plot, a tactic is to develop sympathetic characters, backstories, etc. to enhance the interest of the film. This film is horrifically low on plot, and they decide to bore you to death clumsily trying to develop a love story between two unlikable characters with totally superfluous supporting cast. I hated everyone in this film on a deeply personal level. They made me want to eliminate them all myself, from the lame friendship between Depp and his co-astronaut and his pukey wife, to the pukey sister of the equally pukey and whiney Theron. I am actually getting upset just writing this review. The other reason the producers of this turkey owe me 2 hours of my life back plus an apology is that on the box it is dubbed a \"psychological thriller\". Sounds good, right? No, it is not, as I don't consider a psychological thriller a movie where you simply wait around for something to happen and nothing ever does until the last 2 minutes of the film. If that is the case then sitting at my desk in my office all day is a \"psycological thriller\"-mind numbingly dull and maddening. You guys involved in this movie are jerks for foisting this turd upon an innocent public."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "bhanel",
        "review_rating": "8",
        "review_title": "Creepy",
        "review_detailed_main": "Creepy film. Beautifully photographed, with very evocative images, conveying moods and impressions very well.\n\nIt's not for you if you expect a lot of action, because it's more in the horror-suspense, \"happens in your head\" tradition.\n\nAlthough the ending was a bit weak, this one will haunt me a long time."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "phulla",
        "review_rating": "4",
        "review_title": "Weak story and slow paced",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "TexMetal4JC",
        "review_rating": "",
        "review_title": "Left me speechless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Luluhalabaloo",
        "review_rating": "3",
        "review_title": "If only I hadn't already seen Devil's Advocate...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ersel",
        "review_rating": "3",
        "review_title": "The main subject was neglected.",
        "review_detailed_main": "I've seen this movie on a preview before the actual premiere in the cinemas. The movie was pretty much as I expected (or rather pretty less). Actually the only good things were the main characters played by Depp and the beauty from Devils Advocate. The plot was already known half-way the movie (it was an easy guess), the director didn't make any suspense/thriller of it and the main reason why people go to this movie (the alien & its mission) was neglected tremendously. And above all, it didn't have a happy end, but more like a funny joke... so, there could be a sequel, but let's hope NOT!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "mustican",
        "review_rating": "3",
        "review_title": "Dull, Slow and Uneventful",
        "review_detailed_main": "The Astronaut's Wife is the proof that not every big budget Hollywood movie is supposed to be successful. What a shame that such great actors like Johhny Depp and Charlize Theron have been wasted. If we look at the bright side, without them this film could have been a torture. I found the movie quite dull and slow. It doesn't give us a clue how Commender Spencer Armacost is like before his journey to space. Automatically, the audience thinks that he is a loving husband, devoted to his wife and job. Fair enough, we don't need to go through deep character analysis. What we see is a disconnection from the earth for only twelve seconds!! It sounds interesting but doesn't give a push to the film. It takes a new step when one of the astronauts die a few months after the incident. Now Com. Spencer is the only witness what has happened back in there. His wife Jillian starts to get worried as he starts acting in a weird way. But soon after everything is normal again as she gets pregnant for twins. But is Commender Armacost really want this babies to start family with his wife or to start breeding of new species.? Jillian has to find out what has happened to her husband in that twelve seconds. More she is curious, more people are killed. At the end of the film, we have a classic ending, good against bad which stands somewhere between sci-fi and horror. Of course, good wins as usual and film credits start by not saying but implying that we all have spent two hours for nothing. Such a shame that the director has everything to make this work. Budget, stars, could-have-been a decent storyline. Unfortunately, he ant make it work. At least not for me. * out of *****"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "3",
        "review_title": "I expected a bit more from this considering the stars",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "I_Broke_A_Shoelace_This_",
        "review_rating": "9",
        "review_title": "*shudder*",
        "review_detailed_main": "I enjoyed watching this movie as I pride myself on the fact that I watch almost every movie with an open mind and also that I look beyond the actors and directors and found the deep and chilling plot.\n\nJohnny Depp and Charlize Theron work well together in this film and I felt that the plot was intricate and understandable at the same time. The director does well to combine special effects, unique angles with the cameras used and a phsycologically chilling plot that will leave every astronaut's spouse with doubts of their partner's next mission.\n\nJohnny Depp creates a beautiful villain and is subtle with the Actions of Spencer Armacost so as to slowly release information for the audience but not to give away the whole story. Charlize Theron took the leading role with depth and flare and provides the audience with a spectacular character to empathise with and at the same time has their own doubts about.\n\nI felt the ending was, to say the least, unusual and could have perhaps been better. However, I felt it worked because it is, after all, a Sci-fi thriller and as far as anybody knows-however stupid it may seem- it could always happen that way. No one knows..."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "m-47826",
        "review_rating": "1",
        "review_title": "Rosemary's baby meets Alien...",
        "review_detailed_main": "Charlize Theron even has the pixie cut. But the movie is just so bad and boring. With a dull approach to horror sci-fi. That it made me wonder what they were thinking, releasing this movie. Considering how weak and unimportant it was, it should've been left alone. Even the acting was not good. Both leads are extremely charismatic and good looking, but come on... Some X-Files episodes did it a lot better. In good faith, you can't find valuable upsides to this inexcusable turkey. And that's the only lingering impression about The Astronaut's Wife. That seems to be unsure of what it was, and bound to disappear, after its time of release."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Renaldo Matlin",
        "review_rating": "",
        "review_title": "Zzzzzzzzzzzzzzzzz...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Rosettes",
        "review_rating": "3",
        "review_title": "One or two good points.......and a mass of bad ones",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Ergens",
        "review_rating": "4",
        "review_title": "Potential, but a Tragic End - Contains Spoiler",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Yonhap S",
        "review_rating": "5",
        "review_title": "lack of concrete plot, just nifty atmosphere",
        "review_detailed_main": "After watching this movie, one cannot help the feeling that what we've seen is all there is. Questions as to why there are twins or why Johnny Depp's character is obsessed with building a plane are unanswered. You can also guess who dies in the story. We also have a Dr. Ruth-like doctor (what in the heck?!). I also got annoyed at the \"bad guys see everything\" element (just like Arlington Road) here when Joe Morton and Charlize Theron were supposed to meet. If he's busy trying to build the plane, why is he just about everywhere in New York? I guess the problem is that the story just focuses on the character title only. However, there's so many other things going on in the story, and we really want to know why, we are just supposed to accept it. Duh.\n\nThe verdict: 2.5 of 5 stars."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "kustom135",
        "review_rating": "5",
        "review_title": "*sigh* Yet another sci-fi botch-up!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Fanky Malloon",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Great film. Intelligent, beautiful, good suspense. Enjoyed the references to Rosemary's Baby. Loved seeing Theron get all stressed looking, when she started the movie so beautiful. Great movie for Hitchcock lovers. The only thing I would've changed was making the husband's character not seem guilty. If the viewer was kept wondering, longer, whether the wife was nuts or really onto something, it would've been even cooler.\n\nI don't get why some reviewers say the movie didn't make sense.\n\n9/10."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "~Blade~",
        "review_rating": "5",
        "review_title": "Surely \"Invasion of the Body Snatchers\" is better",
        "review_detailed_main": "The idea of people who become \"strange\" 'cos of alien force or energy or whatelse is not new: this is the main reason i didn't like this movie. Then, i think that the first 50 minutes could be summerized in 20... too many boring situations and so that the only way to make the movie not definitely ugly is its final (even if not original). If you wanna see a great thriller/horror movie, take a look to \"Invasion of the Body Snatchers\"..."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Smiles1121",
        "review_rating": "",
        "review_title": "I've seen better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "blaircam",
        "review_rating": "3",
        "review_title": "Almost completely unwatchable",
        "review_detailed_main": "Not only was this film unoriginal and predictable it was also terminally slow and uneventful. This is nearly 2 hours of nothing! I really ought to bill the producers for my time. Now Depp and Theron are usually capable actors and they are tolerable here, but they have absolutely nothing to work with. I was longing for the end after about 30 mins. My vote 3/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rollernerd",
        "review_rating": "4",
        "review_title": "B Grade Sci-FI Thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "TK1312",
        "review_rating": "5",
        "review_title": "Rosemary's Baby Rip Off",
        "review_detailed_main": "I just saw The Astronaut's Wife. It was very disappointing. No suspense, no good acting, weak plot. The whole movie is a Rosemary's Baby rip off. Polanski's movie is a lot better, watch this instead. Disappointing. 3/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Philaura",
        "review_rating": "9",
        "review_title": "I Loved It! Honestly!",
        "review_detailed_main": "First let me say, if users had not spoiled the suspense for me by giving away what happens in this film, I would have been thoroughly taken in by the thriller. So thanks a lot everyone for that. But regardless of missing out on the anticipation of the reveal of what is really going on, I still loved this film.\n\nWhat can I say? After reading all of the negative reviews listed here, I am at a loss. I guess I should have known, as most of the films I have rented due to rave reviews have sorely disappointed me. But don't get me started there. I guess my heart beats to a different drum.\n\nFirst of all this is \"the Director's Film\". What a visual, emotional feast. They say a picture is worth a thousand words and Ravich's film is an outstanding example of this. For example: the close up of the beautiful slender fingers of Charleze Theron's fingers gently touching the rattling glass of the window as her husband's spacecraft blasts from the launch pad. This film was artistic shots end to end. Rich colors, beauty, unusual angles and camera movements, and always intense emotion seeping from the picture you are viewing.\n\nI have no problem with either of the stars acting, I thought Theron was excellent and stunning throughout. Depp was fine, a little off and cold, but his character was off and cold. The two of them made a beautiful team of leading lady and man.\n\nThe script was well written. Intelligent and realistic. And for those that complained that it was just a rehash of other sci-fi hits, I beg to differ. There is a concept that is explained (for those who were still paying attention) that was the basis for all that was happening. That concept was new and original in my experience of science fiction movie viewing. There was definite similarities to other films, but the foundation was a frightening new thought.\n\nThe complaints about unanswered questions - I found enough answers to questions for the film to be satisfying in that area. I had no trouble following right down the line. And a sequel (in my book) is a fantastic idea and very possible the way things were left.\n\nAs for the ending. I found the very last scene to this film to be anti-climactic to the scene just prior which was outstanding and the real punch to the end of the film. It was unexpected, frightening and excellently done. The very last scene was just a \"wrap up scene\" which I personally would have done slightly differently, but I certainly wouldn't \"dis\" it the way others have.\n\nMy only real complaint was the scene that shows the 2 missing minutes in space. It was washed out colors and unimaginitively done as though some amature put it together in a last minute rush to help out the real artists that put together the rest of the film.\n\nAs an artistic, suspense - not action - genre science fiction film I would recommend this one very highly."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jeanie-5",
        "review_rating": "3",
        "review_title": "Could Have Been",
        "review_detailed_main": "I went to this movie primarily to see Johnny Depp, whom I have found to be a superb character actor (Gilbert Grape, Donnie Brasco, Don Juan DeMarco, Sam in \"Benny and Joon\" and others are uniquely crafted and memorable). While I could recognize his craftsmanship as Spencer Armacost, I did not always \"get\" him, rarely liked him, experienced him as tentative, and felt he was overshadowed by the actress in the title role. I found Charlize Theron stunning, a rare beauty, and a solid actress, though I did not always \"get\" her, either. Since the plot was faulty, I found that giving my attention to the characters was a far better strategy than being frustrated with the inadequacies of the script. Some of the camera work was a bit strange and strained -- while it didn't quite make me dizzy, I was overly distracted by it. Come to think of it, perhaps that is simply a technique to distract the audience so that we will not notice that it is not a very good flick. The only two people in the audience who were scared by this would-be thriller sat behind my companion and me. It made me laugh (quietly, of course, as I feel each of us is entitled to have our own unique experience) that they could shriek at such inane actions. I haven't decided if the movie was fast or slow for me, but of one thing I am certain, it is NOT a \"thriller\" and it could have been. Ah yes, that's it, this movie \"could have been\" very good"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "deftno9",
        "review_rating": "",
        "review_title": "Snooore",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jrfranklin01",
        "review_rating": "3",
        "review_title": "Southern Depp With Aliens",
        "review_detailed_main": "Spencer Armacost (Johnny Depp) is one of the top astronauts working at NASA. When contact is lost on a routine space mission, something happens that changes Armacost and endangers our planet.\n\n\"The Astronaut's Wife\" as the title suggests is really about Spencer's wife, Jillian Armacost (Charlize Theron). Her character is reminiscent of her role as Mary Ann Lomax in \"The Devil's Advocate\". She is supportive of her husband but begins (ironically) to suffer all sorts of afflictions as a result of his job. It takes a bit to get used to Depp with a southern accent and to see Theron in one of her early more subdued roles (especially after you've seen \"The Italian Job\").\n\nThe film brings a simple alien abduction/possession plot in, which sadly seems to drag out until the end. I think the director was still trying to keep the audience second guessing, but this works to no avail as the film's direction is pretty basic and easy to figure out. I won't spoil anything other than to say the ending isn't a happy one and is rather hokey to boot. Clea Du Vall makes a few brief appearances as Jillian's sister, Nan. 3/10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Spleen",
        "review_rating": "2",
        "review_title": "I feel a dull, throbbing pain in the back of my head",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "5",
        "review_title": "Something happened up there....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "baumer",
        "review_rating": "3",
        "review_title": "A big fat mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "kethera",
        "review_rating": "9",
        "review_title": "Well done sci-fi in the classic sense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "weberpr",
        "review_rating": "4",
        "review_title": "An Astronauts Wife",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tigergirl98",
        "review_rating": "",
        "review_title": "Modern-day \"Rosemary's Baby\" sans suspense and horror",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "chuckles-18",
        "review_rating": "4",
        "review_title": "DVD for sale",
        "review_detailed_main": "A cheesy outerspace oriented rip-off of Rosemary's Baby. The sets on this film must have cost $4 each. The space shuttle scene is done well, but the rest of the film is very lackluster. I didn't expect much from the film. Lo and behold."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "JamieF",
        "review_rating": "3",
        "review_title": "Johnny Depp shouldn't have done this.",
        "review_detailed_main": "Seen The Devil's Advocate? Charlize Theron plays the same character. Let's see, she and her husband move to New York from Florida and she starts to wonder if she's going nuts because her husband is acting funny... only this time it's her sister who visits instead of her mother in law, and he's an astronaut instead of a lawyer. Yawn.\n\nI am a big Johnny Depp fan, and I usually expect great things from him. This isn't one of them. He's basically just a stoic guy with a southern accent in this, who starts to act aggressively toward his wife. I don't know if it's just the script or if he didn't work on developing the character enough, but there just isn't a lot of complexity to this character for him to work with.\n\nThis could very easily be a short film, as in 20 minutes long, but instead it drags on and on. I get it, she's scared. I get it, something happened to the two astronauts when they were out of contact for two minutes. I was not emotionally involved by the end and I just kept watching out of curiosity... as in, OK, how is this dog going to end, what's the big secret about what happened up there and why he's acting so strangely? Big disappointment, I wish I had just given up 30 minutes in and done something entertaining with my time."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "dexter-3",
        "review_rating": "4",
        "review_title": "\"Rosemary's Baby\" makes \"Contact\"...",
        "review_detailed_main": "This film owes a great debt to both of the films mentioned above. The review by Brian Orndorf hits many of the main issues, and he's right when he notes that viewers are left wondering, \"Why wasn't this a better film?\"\n\nAnyway, it is beautifully shot, has an interesting premise, a startling conclusion, but not a lot else. Mostly, though, it has Joe Morton, one of America's best character actors. He is excellent here (as usual), and his work with John Sayles means he always brings something extra to all of his characters. (My favorite line of his was, \"ALWAYS have a backup.\") And there is one excellent scene, about 20 minutes before the conclusion, that makes for one of the best space shots ever.\n\nAnyway, \"coulda shoulda woulda\" been better. A \"4.\""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "zulu934",
        "review_rating": "3",
        "review_title": "A good B movie idea - Poorly executed",
        "review_detailed_main": "I had read some of the poor reviews for this film prior to watching it so I knew what to expect. This film has a really good (though far from original) plot involving two astronauts whose bodies are taken over while on a space mission. The aliens (occupying the bodies of the astronauts) return to earth and proceed to impregnate their wives with alien sperm. The women both become pregnant with twins, who are expected to become pilots for an alien designed spacecraft (This was all only vaguely explained in the movie). The wives, of course, do not know this initially. The movie is really quite similar in many ways to Rosemary's baby in that the alien occupied astronauts are protective of their host wives who were chosen to have their offspring. It also takes place in New York to add to the similarities. The real problem with this movie is that the the sense of menace is not sufficiently built up in the three quarters of the movie. When Johnny Depp returns from space, he does not seem any different then when he left. Towards the end of the film, he finally starts showing his colors, but there should have been some signs early on. It is almost as if the Director forgot to tell Mr. Depp that he was supposed to be an alien, and then noticed the problem after it was too late. In summary, I could not recommend this film, even as a video rental. It lacks an adequate build up in suspense, and the rational behind the aliens motives was not fully explained in the film."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "gothmogslayer",
        "review_rating": "8",
        "review_title": "Certainly underrated",
        "review_detailed_main": "After checking the rating for this movie, I prepared myself for a boring and dull movie, but instead found quite the opposite. The best side of the movie was actors (Jonny Depp and Charlize Theron) who really made the movie alive. The story wasn't bad either, with slowly building up pressure and having nice little twitches and ending as well. If you like psychological movie with some Sci-Fi in it, then you wont be disappointed. Only thing I found little bit annoying about this movie was, that at some points the storyline was scrolled forward too roughly. My overall rating is 8 out of 10 and recommend it to all who like to see Jonny Depp in action in a fine movie."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jordondave-28085",
        "review_rating": "2",
        "review_title": "May have worked as a 25 minute \"Twilight Zone\" episode but not as a feature film",
        "review_detailed_main": "(1999) The Astronaut's Wife THRILLER/ MYSTERY/ SCIENCE-FICTION\n\nWritten and directed by Rand Ravich starring Johnny Depp as Commander Spencer whose just came back from on a space mission, acting like a different person from who he was before, especially to his wife Jillian played by Charlize Theron. And the film dwells on this question for almost two hours, on whether anything happened to him while on the mission, or is or isn't it really him. The problem is that this spoof would work well on a 24 minute stint for a \"Twilight Zone\" episode than it would be to make a film about an answer of a question, viewers would've figured it out way before the film is even over."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "JoeyP",
        "review_rating": "",
        "review_title": "It's not a bad movie . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Justin-62",
        "review_rating": "3",
        "review_title": "Wait for the video",
        "review_detailed_main": "Although I have seen worse movies (Knock Off, The Avengers), The Astronaut's Wife is a very boring movie. The plot takes too long to develop, and the characters are not very interesting.\n\nAbout the best thing I can say for this movie is that it didn't have the annoying scream from the preview."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "DTL",
        "review_rating": "4",
        "review_title": "Houston we DEFINITELY have a problem!",
        "review_detailed_main": "What happens if you cross ROSEMARY'S BABY with ALIEN, THE OMEN, THE RIGHT STUFF and EYES WIDE SHUT? You would get a very strange hybrid thriller, sci-fi, demonic, sex drama called THE ASTRONAUT'S WIFE. It stars Charlize Theron in the title role with Johnny Depp as the Astronaut. The story begins when Rocket Boy Depp is about to go up on a NASA mission and is leaving his very sexy wife Theron behind. Quicker than you can say \"Houston, we have a problem\" Depp and his partner are lost in space for a total of two minutes. They are retrieved and brought back to Earth. What happened during that two minutes is the mystery that this film is about. All appears to be well, but because of the eerie music, the brooding, moody lighting and weird camera angles we know better. The mystery that takes ninety minutes to unwind but I feel certain that all of you will have it figured out much sooner than that. Although this film has a few thrills a lovely performance from Theron, who by the way is quite easy on the eyes, an interesting turn by Joe Morton in a supporting role, it left me as cold as EYES WIDE SHUT did earlier this summer. A's W has a similar feel as EWS in its strange look, so if you liked that one, you may enjoy the ASTRONAUT'S WIFE. All in all I wish I had passed the shuttle and taken the bus."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "frankwhat",
        "review_rating": "3",
        "review_title": "Didn't like",
        "review_detailed_main": "I wasn't a fan of this movie at all. I thought it was boring, pointless, and took forever just to prove how stupid it was. The only redeeming value was that the acting was good (Charlize never performs badly and Johnny Depp plays a good creep probably because he's like that in real life would be my guess). But even the acting couldn't save this one. The plot was somewhat original but it didn't really do anything with it and instead it just wallowed in stupidity. I think this movie intended to be just a tribute to those famous ones in the past but it did a bad job regardless. Just making a good movie would have more than sufficed in its place, to say the least. Some parts were so unbelievable that it lost effectiveness while it wasn't even halfway through. This movie could have definitely been something but it fell short on almost every front. It had the good cast, a decent idea, and the right kind of mindset but in the end it didn't work.\n\nFinal Incite:\n\nMovies: I would've killed myself if I paid for a ticket to see this!\n\nDVD Purchase: Even though it's down to $5.50 at Wal-Mart I'd still steer clear.\n\nRental: Resist!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "djdrock",
        "review_rating": "5",
        "review_title": "And the point of this film was?",
        "review_detailed_main": "Up until the last few minutes, I thought the movie was pretty good. And then...the ending hit me in the head like an asteroid, and made me dizzy. I was thinking, okay, what the hell happened here? I mean come on! This film seemed to have no purpose, kind of like a Celine Dion video. If the directors intent was to make you think, well he did. It made me think that the budget ran out at the end of production."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "cgprncs",
        "review_rating": "8",
        "review_title": "Pretty darn good movie",
        "review_detailed_main": "Went in expecting to waste away six dollars, however with the intelligence in the screen writing coupled with the events in the movie that could possibly in real life happen, I left the theater with chills and content. Johnny Dep played his role excellent, and the other cast of characters came across as real people. Overall a great movie."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "huggy_bear",
        "review_rating": "3",
        "review_title": "Oh, Really Boring...",
        "review_detailed_main": "This is one the was highly recommended by a co-worker, so I went out and bought it. I had never heard of it before, so I was looking forward to spending a saturday night watching a nice, creepy, science fiction movie. WRONG!! What really happened is that I lost my $20 I put on this crap, and was bored to tears watching patiently for this yawner to develop into something of a movie. God, watching this was painful. Not scarey or creepy at all. Please, don't make the same mistake I made, stay the hell away from this one."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Geofbob",
        "review_rating": "",
        "review_title": "Charlize looking good in plotless movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "venerados",
        "review_rating": "2",
        "review_title": "My Uneducated Opinion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "simon-146",
        "review_rating": "4",
        "review_title": "Forget about it",
        "review_detailed_main": "Well, dear Roger Ebert said all that can be said in a positive note about this film (I love Ebert and his very young enthusiasm as well as his great compassion). There is nothing in this movie that you have not seen in a hundred vampire movies already. Johnny Depp is as dry as ever, the sets are great, the story is lousy. I would suggest Hollywood to stop making movies about space misteries. It seems that human imagination has run dry about that subject."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "clydfrog",
        "review_rating": "3",
        "review_title": "What is expected?",
        "review_detailed_main": "I rented this movie just for something to waist time with and this is a small lead in. 2 astronauts go into space to fix a satellite and for a 2-minute period all transmissions with the crew are lost. In that brief 2 minutes something changes the lives of the 2 astronauts and their wives. Suspicions arise about the mysterious 2 minutes as well as the obvious change that Charlize Theron (character wife of Johnny Depp) sees in her husband. `The Astronauts Wife' was an odd movie, not to the point of extreme oddity that makes the movie so weird it is intriguing. This movie was odd to the point of losing interest in the flick up until the 2nd half of the show. At that point you want to know if the movie ends the way you think it will. It was interesting to see Johnny Depp on the darker side of the spectrum."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "4",
        "review_title": "Pretty shoddy",
        "review_detailed_main": "If not much else, The Astronaut's Wife allows for Johnny Depp to ramp up the creep factor nicely, playing severely disturbed NASA Commander Spencer Armacost, who has returned from a mission a little... different than when he set out. Upon a repair excursion on the space station, he came in contact with some strange phenomena which we never really see, apart from his reactions. He returns safely, and behaves normally enough for while, then starts to act very strangely indeed. His wife (Charlize Theron) notices first and slowly begins to feel terror towards him as he gets stranger and almost violent towards her. It's a silly premise that's given the head on treatment by writer/director Rand Ravich. There really isn't anywhere to go with such a setup but into generic thriller motions, which the film does, albeit in style. It's stunning visual work, to be sure, wit a silk smooth palette and aubern dominated color scheme that almost calls to mind Giger in places, which may have been their intention upon entering this genre. The story itself, however, is vague and muddled, while needlessly unleasent in others. Depp is fun to watch, clearly having fun going berserk inch by inch, Theron reliably solid yet without much to do except be scared and mistreated. Clea Duvall has a nice bit as her sister and one half of the woman's intuition that tries to smoke out whatever is hiding behind those perfect brown Depp eyes. Filling out the NASA roster is a nice assortment including Joe Morton, Nick Cassavetes and the great Tom Noonan. It's pleasing to the eye, if failing somewhat to satisfy elsewhere, and serves as a good enough thriller, that may have been great with a better script."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "FlickJunkie-2",
        "review_rating": "8",
        "review_title": "Unoriginal story but great filmmaking",
        "review_detailed_main": "I rented this film without much in the way of expectations. I am not a big sci-fi fan and even less of a horror fan, I was prepared to be underwhelmed. In fact, I was extremely impressed, not with the story, but with the filmmaking, particularly the direction by Rand Ravich.\n\nThe story was a patchwork of a lot of different worn out sci-fi themes. There was the \"alien takes over the human\" theme, the \"alien dwells among us\" theme and of course, \"the evil baby gestating in the good and pure mother\" theme. Suffice it to say that this wasn't fresh material. But let's be honest; how many stories are really fresh material? Why are we suckers for the same old romantic comedy storylines again and again and yet we expect that sci-fi must be completely novel to be good?\n\nWhat is outstanding about this film is the suspense. I haven't seen a film that was so effective as a suspense film in quite some time. It was effective because of daring use of the camera by Ravich that visually left me begging for relief in scene after scene. Actually, if there is any criticism of this film it is the fact that the suspense was too well done. It wears the viewer out without sufficient mental rest stops.\n\nRavich's use of extreme close ups, wide angle shots, rapid camera movements, odd perspectives, and tight sets produces a sense of relentless suspense that made me want jump into the screen and yell at the characters. For some, this was probably overwhelming and tedious. It seems that viewers today want pace, novelty and surprises. Yes, we knew Spencer (Johnny Depp) was now an alien. Yes, we knew that Jillian (Charlize Theron) had alien babies growing inside her. What we didn't know was what she was going to do about it and what he was going to do about her. So I thought the story was ultimately effective in achieving its goal...thrilling suspense.\n\nWhat this film lacked was a hideous monster and a lot of blood and gore. This is why it wasn't popular in my opinion because these are staples of today's mass market viewer. This is the very reason I thought it was excellent because it produced fear and anticipation, not by what was seen, but by what was unseen.\n\nFrom an acting perspective, this was a shining moment for Charlize Theron. This was a very demanding film for a female lead and she handled it like a pro. Her part demanded a full range of emotions from sweet adoring wife to the terror of a caged animal and she delivered the most complete performance I've seen from her to date. As a matter of fact, Theron so controlled the screen that Johnny Depp didn't really have much to do except give the occasional menacing look.\n\nI'm going to buck the tide with this one and give it an 8/10. This film was about style. It failed to deliver the obvious and this elusiveness made it unique among all the weird science fiction rip-them-to-shreds hack movies that jam the video store shelves. And that's what I liked most about it."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "TeeBut",
        "review_rating": "4",
        "review_title": "Bit of a fizzler",
        "review_detailed_main": "I won't waste too much of your time, but really, ... DON'T BOTHER. I had heard fairly ordinary reviews for The Astronaut's Wife, but one of the local critics in the paper gave it a pretty good wrap up. And he was nearly right. The first half of the film was quite interesting, and gave you a reason to sit through the rest of the film. But, mediocrity and stupididt came along again, and ruined the remainder. If you're after a bit of intelligent thinking of outer-space happenings, go back to Kubrick's \"2001\", or something like that."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "IMOvies",
        "review_rating": "",
        "review_title": "Mediocre ending blemishes an otherwise good picture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "bek-12",
        "review_rating": "4",
        "review_title": "The Wrong Stuff",
        "review_detailed_main": "Someone should put this movie in a rocket and fire it into space. It's 1/2 Invasion of the Body Snatchers (done poorly) and 1/2 Rosemary's Baby (done even worse), and all confusing. I'm a big sci-fi fan, but Starship Troopers looks like Citizen Kane next to this trash. The only thing scarier than this movie is the thought of a sequel."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "walsh-22",
        "review_rating": "5",
        "review_title": "Average",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rmax304823",
        "review_rating": "4",
        "review_title": "You've Already Seen It.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "esh04676",
        "review_rating": "3",
        "review_title": "where was the Hound of the Baskervilles?",
        "review_detailed_main": "The performances of Theron Depp, and Morton are fine, and they deserve top credit for their valiant work in this mish-mash. Ravich seems to be the one most responsible, writing and directing. What ever did he think he was doing? The IMDb page on goofs says a lot, commenting on such carelessness as the trip to Washington Square that starts at night and ends in broad daylight. Who was in charge here anyway? The pace of this would-be sci-fi thriller is so s-l-o-w. And finally, what about all those strange sets, particularly the huge and dark apartment where the astronaut and his wife live. astronaut A Manhattan apartment that large costs a lot, more than this ex-astronaut could afford. And then there were all those long corridors looking more significant than they were. Just like the movie itself!"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "vasco_cid",
        "review_rating": "9",
        "review_title": "Chilling!",
        "review_detailed_main": "The Best: Everything, it's too touching to have any negative issues. The Worst: The non existence of other movies like this one.\n\nSpencer and Jillian Armacost are a beloved couple, he is the astronaut of the title and she is an elementary school teacher. Spencer goes on a routine mission to repair a satellite. On this mission NASA looses contact with the astronauts for two minutes when no one knows what happened. Spencer comes back and communicates to his wife that he resigned from NASA and a better offer was made, as a jet designer in a New York enterprise. They move to NYC, Jillian becomes pregnant of twins, but Spencer keeps acting weird ever since the day he came from the mysterious mission. Jillian becomes worried and tries to figure out what is going on with his husband and why the twins she carries inside are so important to him.\n\nWriter/Director Rand Ravich develops and directs his own material in a very peculiar way, described by some as slow and boring, and by others as strong and chilling. I have to say that I totally agree with the second one. To be honest, I have never heard of Mr. Ravich before and I've also heard some mixed reviews about this movie, and finding the premise and the actors very good, I decided to buy this movie. After almost two hours I could say that I was completely overwhelmed. The movie may not be completely original but in his genre is the greatest one alongside The Devil's Advocate, also starring Charlize Theron (it seems that Ms. Theron really knows what works to choose). There were some really lame attempts in these past few years to approach this issue but as I said they were just lame, but here, everything was done and choose carefully. The plot is well elaborated the directing is also very competent and the atmosphere was very well achieved and we also felt that creepy feeling sometimes that I'm sure Mr. Ravich was hoping for also thanks to the technical part, the stunning cinematography, and no less stunning production design, the `on-time' editing and so on, and on. If you look carefully after seeing it the movie fulfills every rule that a good thriller or horror film should, a good atmosphere, a threatening environment and a nice twist at the end, and that's precisely the end that makes the movie so great, the twist is awesome although you may have been thinking of it sometime before, but the very last scene is completely unpredictable, reminding all those great horror movies that end the same way. I believe that I can't recommend this film any more than I already did, so moviegoers, relax because this is one of those well crafted movies you don't see very much anymore. 9 out of 10"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "wilsr",
        "review_rating": "1",
        "review_title": "Duh...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "BlackMonk",
        "review_rating": "",
        "review_title": "Good acting for such a flimsy premise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "3",
        "review_title": "The Astronaut's Wife",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lorj",
        "review_rating": "2",
        "review_title": "I did not like this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "shanfloyd",
        "review_rating": "4",
        "review_title": "Given this plot, should have been better.",
        "review_detailed_main": "Being a part of that majority who would never miss a sci-fi thriller starring Johnny Depp and Charlize Theron, one evening I found myself abandoning all my schedule sitting in front of the TV to watch... well, this sounds interesting... \"The Astronaut's Wife\"! Too pity I didn't look for this title earlier in IMDb. So my expectations were in full bloom.\n\nWhat did I get? Over 2 hours of boring incomprehensible gibberish so complex I had to try hard to concentrate on the conversations in the end. The plot was good, no doubt, with a bit of Omen and a tinge of Rosemary's Baby packaged within concepts of evil Aliens. The scenario was intended to be suspenseful, but there's no suspense. In the middle I often told myself \"Ah here comes the thrill.\" But my bad, where was I after all?\n\nIt's not that the actors were bad. Theron was in particular very good as the title lead. Depp does his usual magic. A little bland, but that's how the character is. The major flaw was perhaps in directing or the screenwriters thought they're writing an art film. Filmmakers of sci-fi should probably research more on the mentality of the target audience. Or what makes Spielberg different?"
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Enchorde",
        "review_rating": "8",
        "review_title": "Interesting, well acted thriller",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "IsildursBane",
        "review_rating": "",
        "review_title": "One of the two worst movies ever made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "MovieCraz",
        "review_rating": "8",
        "review_title": "I'm Still Thinking About This Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tmace",
        "review_rating": "",
        "review_title": "needed some work *SPOILERS*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "FiendishDramaturgy",
        "review_rating": "8",
        "review_title": "Beautiful Vision, Great Elements, All Destroyed By A Clichéd And Unimaginative Ending.",
        "review_detailed_main": "Even with the awful, idiotic ending, this film rates well among genre fans. However, the individual elements themselves are not enough to carry this through the lackluster ending this work offers.\n\nIf one can ignore the ending, and ultimately, one cannot, this work was in possession of all the elements to make this a beautiful classic work of horror. The suspense is tense, the story is well timed, the performances are totally believable - idiosyncratic, but believable, and the direction was exemplary.\n\nIt flows well, entertains and compels the viewer to emotionally invest in the characters. It just cannot hold up to its own momentum and seems to fold in on itself at the very end, which is a real shame because otherwise, this was a great film.\n\nIt rates a 7.8/10 even with the awful ending. It could have rated a 9 or higher from...\n\nthe Fiend :."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "larrythecableguy9",
        "review_rating": "",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "kidcolt@hotmail.com",
        "review_rating": "",
        "review_title": "Worst film I've ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ksperrye",
        "review_rating": "8",
        "review_title": "Depp's Spot-On Portrayal Elevates This Film",
        "review_detailed_main": "You can read other reviews for a plot summary, spoilers, opinions about the film's level of derivativeness, and whether all the nods to its predecessors worked or merely served to drag it down. Instead, I want to focus on what I feel is not only the best part of the film, but an example of true acting talent and dedication to the craft that goes beyond simply giving a great performance.\n\nIn \"The Astronaut's Wife\", Johnny Depp gives an authentic, accurate, highly specific, and sublimely believable portrayal of a Florida fly boy turned astronaut. Depp has the body language down, the nuanced inflections in his language and actions, the regional terminology and unique expressions, and he uses them all with effortless perfection.\n\nJohnny Depp has an ear for accents and dialects, but those pertaining to the Southern United States are notoriously difficult to replicate, much less pull off without sounding ridiculous. Notably, Depp absolutely masters this feat, not only for a southern accent but one that is highly specific to a particular region and subgroup of people from North/Central Florida. As a Florida native, it was astounding, slightly eerie, and highly impressive to hear an actor FLAWLESSLY replicate the dialect, vocal tones, inflections, and particular expressions of my family, friends, and neighbors.\n\nActors trying - and failing - at southern accents detract or even ruin productions so frequently that I fail to understand why directors don't insist on a southern accent ban. In contrast, Johnny Depp's flawless accent and layered portrayal of Florida astronaut Spencer Armacost gives this film an authenticity, credibility, and verve that it would not have without him."
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jrarichards",
        "review_rating": "8",
        "review_title": "Good-looking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Aerie-2",
        "review_rating": "",
        "review_title": "Mia Farrow did it better...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "seressac",
        "review_rating": "",
        "review_title": "no pay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Subzero7",
        "review_rating": "",
        "review_title": "Potential not realized.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "bababear",
        "review_rating": "",
        "review_title": "Wow. A thriller with NO thrills. Whoopee.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "fluffykins",
        "review_rating": "",
        "review_title": "my comments are positive coz it's a wkd film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Danny_G13",
        "review_rating": "",
        "review_title": "Entertaining, but not scary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jeanat-1",
        "review_rating": "",
        "review_title": "sex scene",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tommyboy-26",
        "review_rating": "",
        "review_title": "Aliens: soft-core.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "mark-156",
        "review_rating": "",
        "review_title": "Well worth a watch!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "nathantaylor-1",
        "review_rating": "",
        "review_title": "Shame about this one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "dave-419",
        "review_rating": "",
        "review_title": "No need to rush off to see this one...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rohan_g",
        "review_rating": "",
        "review_title": "Houston we have a problem",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "nz man",
        "review_rating": "",
        "review_title": "Some very good points do not make up for a bad story and slowness.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "givantha",
        "review_rating": "",
        "review_title": "SEEK A DIVORCE FROM THIS MOVIE IMMEDIATELY!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "lask",
        "review_rating": "",
        "review_title": "we have a loser!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "eddie-149-786554",
        "review_rating": "",
        "review_title": "The Astronaut's Wife",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "wellthatswhatithinkanyway",
        "review_rating": "",
        "review_title": "Spacy pacing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "jeff-165",
        "review_rating": "",
        "review_title": "TWIN DEPPS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Vynson",
        "review_rating": "",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "FlungHoy",
        "review_rating": "",
        "review_title": "A movie of wonders",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Jalea",
        "review_rating": "",
        "review_title": "Another Point of View",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "sojourn-2",
        "review_rating": "",
        "review_title": "Stay Away",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "gainax98",
        "review_rating": "",
        "review_title": "Bad is an understatement",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "JaneDoe3",
        "review_rating": "",
        "review_title": "So very, very, very, very bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "moviecollector",
        "review_rating": "",
        "review_title": "rather boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "EdRooney",
        "review_rating": "",
        "review_title": "Out Of Orbit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "vespertine",
        "review_rating": "",
        "review_title": "unintentionally comical",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Snake-13",
        "review_rating": "",
        "review_title": "Fascinating idea, sluggish pace (** out of ****)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Sterling-1",
        "review_rating": "",
        "review_title": "Needed a better beginning.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Starlights1987",
        "review_rating": "",
        "review_title": "Strange and Odd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Jack the Ripper1888",
        "review_rating": "",
        "review_title": "Truly chilling.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "The_Film_Cricket",
        "review_rating": "",
        "review_title": "Move on, sister, move on . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "rbrb",
        "review_rating": "",
        "review_title": "Unoriginal Rubbish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "julesrules",
        "review_rating": "",
        "review_title": "copycat of The Devil's Advocate...not as good though",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "walter-17",
        "review_rating": "",
        "review_title": "Finally, a new idea!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Dkish",
        "review_rating": "",
        "review_title": "Charlize Theron is brilliant",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "javier_walker",
        "review_rating": "",
        "review_title": "What were they thinking?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Chris-653",
        "review_rating": "",
        "review_title": "I feel asleep",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "ebert_jr",
        "review_rating": "",
        "review_title": "Huge Dud!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "fparsons",
        "review_rating": "",
        "review_title": "Better as an Outer Limits episode",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "cbellor",
        "review_rating": "",
        "review_title": "THANK YOU RAND RAVICH!!!!!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "noodle_grl",
        "review_rating": "",
        "review_title": "What was the point?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Shifty",
        "review_rating": "",
        "review_title": "Mediocre thriller that never gets off the ground",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "dfranzen70",
        "review_rating": "",
        "review_title": "Space tale told on Earth just misses mark",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "EJK-3",
        "review_rating": "",
        "review_title": "stinkeroo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Big D-2001",
        "review_rating": "",
        "review_title": "Interesting set-up, terrible payoff...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Tooluser",
        "review_rating": "",
        "review_title": "An Interesting,Long Road to A Dull End(Some plot put forth here!!Read with caution!)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "cajunbluesbaby",
        "review_rating": "",
        "review_title": "no direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Delcia80",
        "review_rating": "",
        "review_title": "Very boring!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "cabaret25",
        "review_rating": "",
        "review_title": "Not sure what to say...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Rimbaud90",
        "review_rating": "",
        "review_title": "This movie is BAD!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "tomstcool",
        "review_rating": "",
        "review_title": "Good thriller, not much of a sci-fi movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0138304",
        "movie_name": "The Astronaut's Wife",
        "movie_rating": "5.4",
        "review_username": "Johnny-113",
        "review_rating": "",
        "review_title": "Rosemary's Baby in Space",
        "review_detailed_main": ""
    }
]