[
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "andreas-jacobsson",
        "review_rating": "5",
        "review_title": "Seriously, why all the negativity?",
        "review_detailed_main": "Please people, some objectivity... A movie that does not conform to your personal tastes need not automatically be rated 1 or 2, a rating which I'd take to mean that it is just about the worst kind of crap you have ever laid eyes on (unless of course you really think it is in which case I'd recommend you to \"broaden your cinematic horizons\", but most people tend to exaggerate their opinions based on their emotional bias).\n\nThis is a children's movie, plain and simple, although admittedly a mediocre one in comparison to some of the truly great children's movies. As such there are certainly things about this movie that could have been handled in a more satisfying manner. One positive thing I can mention is the fact that it does not try to be anything but what it is.\n\nNow, I may of course be wrong... It has been a very long time since I were in a position to give any accurate recommendations to the age group targeted by this movie. However, I must admit that what is left of the child within did find parts of it rather entertaining! :)"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "neji107",
        "review_rating": "6",
        "review_title": "Not awful... but not good",
        "review_detailed_main": "Thank goodness The Smurfs was not the god-awful trainwreck everyone made it out to be, or else I would have wasted thirty minutes in line to see another failed cartoon adaptation.\n\nI won't say it's good, but it was surprisingly not bad. Of course, The Smurfs does not exactly have enough substance to hold a full-grown adult's attention for all of its 86 minutes, but it is a surefire hit with the kids. The linear and simple plot follows a small group of Smurfs that get accidentally sucked into a portal to the human world while trying to escape the evil wizard Gargamel (Hank Azaria). The little blue people quickly enlist the help of married couple Patrick (Neil Patrick Harris) and Grace (Jayma Mays) to protect them from Gargamel, who plans to harvest the Smurfs' essence for magical power, and to re-create a portal that only happens once in a blue moon\u0085\n\nThe movie includes some emotional subplots with Papa Smurf and Patrick, who feels he is unready to start his own family; though it all becomes pretty unnecessary in the face of the Smurfs' main goal to return home. Humor, again, mainly appeals to the kids, sporting sight gag after sight gag, but every once in a while there's a clever reference thrown in for the older folks in the audience. Hank Azaria gives about the most cartoonish performance as any villain could, resulting in an upsetting mix of interest and annoyance. On the other hand, where it is used the CGI is incredibly high-quality (i.e. the Smurfs, Gargamel's cat, etc.), and the special effects are designed more specifically for 3-D viewing than in most movies as of late.\n\nI know some people have proclaimed this film to be a bastardization of a childhood cartoon favorite, but I argue that it isn't. The film is very aware of its origins with Peyo and respects that fact. They actually pay direct homage to the creator towards the end of the story. An exact imitation of the cartoon series this movie is not, but it is a fun and well-intentioned take on the story.\n\nThe Smurfs is mildly entertaining, at its best, but it is written with the right spirit and is in no way an injustice against the original series. It offers a nostalgic throwback (with a modern twist) for the adults and an amusing show for the little ones. For the ones in between, I advise avoiding this movie."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Fields201",
        "review_rating": "4",
        "review_title": "Smurfed Away My Money",
        "review_detailed_main": "What was I thinking? I knew this movie was going to be bad, but yet I felt compelled to go see it for myself. I was never really a big fan of the Smurfs cartoon but yet I remember I wanted that Smurfs Atari game so bad. Later I found out that it was horrible but I'm sure I would have loved it as a kid. Why did I go see this?\n\nIt's not completely terrible. Hank Azaria did a very good job playing Gargamel and I could actually see the cartoon counterpart that he was based on. I didn't see this in 3D but I can imagine it would be pretty entertaining to watch in that format. I just didn't pay for the 3D because I didn't want to pay more for a bad film, and I had been suffering with headaches lately. I didn't want to make it worse.\n\nWith that being said, the film centers around the Smurfs escaping from Gargamel who found them in their village. In some weird way, they come across this portal they knew nothing about until that time, and they are forced to go into this portal in order to escape from Gargamel and his CG cat Azriel. There, the Smurfs stumble upon New York City where they find the care of Doogie Houser and his cute, pregnant wife. They must find a way back home while being hunted by Gargamel on the streets of New York, and Doogie is trying to not to get fired from his cosmetics job.\n\nOne of my biggest problems is that I never felt connected to the Smurfs. The only ones that I really knew was Papa Smurf (who can ever forget Papa Smurf anyway), Smurfette and Clumsy Smurf who the only reason why I knew him is because they always reference how clumsy he is, gets left behind, and I knew that he was going to be the hero by the end of it all. Movie 101: If a character in your film is the underdog, he will always prevail in the end. This film is no exception.\n\nThe film is basically sloppy writing through and through, especially in the ending. The film could have ended easily by having the adults handle all the work but we couldn't have a Smurfs climax without having them be the center of it. So they basically just have the adults just stand around somewhere as the Smurfs get their butts kicked by Gargamel.\n\nIt's a kid's film and this film knows it. The kids will eat this up despite probably never seeing the cartoons. It wasn't the worst film I've seen but certainly not the greatest of kid's films. It was directed by Raja Gosnell. I should have stayed far away. Smurf you, Raja."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "drew_atreides",
        "review_rating": "2",
        "review_title": "Let's put it this way: My 5 year old walked out",
        "review_detailed_main": "Took my 5 year old son to see this one at a Saturday Matinée.\n\nI can't remember the last time i saw a more un-engaging kids flick.\n\nMy kid was noticeably bored from the word go, but i'll give him credit he was a trooper through the first half. I've seen him get restless before in the theatre, this one he was more or less falling asleep.\n\nWhen we got to the scene where Gargamel peed in the restaurant i was ready to check out, but i would brave it if my son was having a good time.\n\nWonder of wonders, at that point he turned to me and said \"Dad, i have to go to the bathroom, but when we're done there can we not come back into the theatre and just go home?\"\n\nTells you all you need to know about this one.\n\nDon't waste your time or your money."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "lesleyharris30",
        "review_rating": "7",
        "review_title": "Great family film that will having kids and adults laughing",
        "review_detailed_main": "The Smurfs is a fun and enjoyable family film,the animation and the humor is both terrific,it will have both kids and adults laughing,especially with the terrific acting of Neil Patrick Harris as Patrick Winslow and The Simpsons Hank Azaria as Gargamel,Gargamel was a terrific character in the film especially with his cat Azrael,unlike the cartoon series were Gargamel is nothing more than a bad guy.\n\nSix Smurfs,Papa,Clumsy,Brainy,Grouchy,Gutsy and Smurfette (voiced by Katy Perry),get lost in New York after they go through a portal that leads them to New York City while trying to escape Gargamel and his cat Azrael after Clumsy Smurf leads them to Smurf village,as the group of six are stuck,they live with a couple,Patrick Winslow (Neil Patrick Harris),who isn't one bit happy with the Smurfs living with them, and Grace Winslow (Jayma Mays) who finds the little blue creatures adorable,and the Smurfs wont be able to get back to the Village and escape Gargamel until a Blue Moon,which is very unlikely."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "t_atzmueller",
        "review_rating": "1",
        "review_title": "Hollywood, stop raping our childhood classics!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "inkylotus",
        "review_rating": "",
        "review_title": "No matter how others think, I loved it!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "chris7377",
        "review_rating": "7",
        "review_title": "It's a kids movie, people, not Shakespeare.",
        "review_detailed_main": "I took my 6 yr old daughter to see The Smurfs and she loved it. She laughed and she giggled. The thought Gargamel was especially entertaining and I have to agree. Hank Azaria does a wonderful job as the villain. She wasn't frightened in the least at any time. I'd say the movie was at least for the 6 yr old crowd and older. I just don't believe anyone younger would be interested in the movie.\n\nTo the adults who are saying this movie is crap, a waste of time, boring, idiotic, etc....I say CHILL OUT. It's a kids movie...end of story. Good lord. I only went because my little girl wanted to see it. If you go to it expecting an Oscar contender then you have other issues you need to deal with. Seriously."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Valmont74",
        "review_rating": "1",
        "review_title": "Everyone involved should be thoroughly ashamed of themselves.",
        "review_detailed_main": "I know film makers never set out to make an awful movie. In their heart they start the production with the hopes the final product will be a good one. But after seeing this, I wonder what they really had hoped for. Even during pre-production someone, a producer with some ounce of talent, should have hit the breaks on this one. In the end they all must have realised what a huge pile of toxic waste this is.\n\nIf you're going to make an animated Smurf movie, then do so and let it be animated in it's own Smurf world. Don't involve real humans, animals, locations etc.\n\nThe final product stink and everyone involved should be thoroughly ashamed of themselves."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "tavm",
        "review_rating": "6",
        "review_title": "The Smurfs walks a fine line between cynical exploitation of nostalgia and embracing the heartwarming virtues of the iconic creatures themselves",
        "review_detailed_main": "\"I hated this trip less than expected\" Probably not a direct quote from Grouchy Smurf but it'll do for my summary of the movie itself. 30 years ago, when I was thirteen, I still watched Saturday morning cartoons and \"Smurfs\" was one I remember in particular seeing every week for that season and maybe the next. So when I heard about this film version, I dreaded the result. Well, while I could see some of the cynicism on the part of some of the story of them going to New York and all the trappings that entailed, overall this was a silly (though also pretty amusing) and poignant tribute to those little blue creatures to the point of some of the writers having the Neil Patrick Harris character acknowledging creator Peyo and the country of origin, Belgium. And at least having some classic '80s rock songs like the Run-DMC with Steven Tyler version of \"Walk This Way\" and AC/DC's \"Back in Black\" removes the taste of having that annoying Smurfs theme song (as even acknowledged by a homeless man humming the tune) constantly being run throughout the movie. And adding Jayma Mays and Sofia Vegara and having Hank Azaria as the villainous Gargamel add some charm. So on that note, The Smurfs was a somewhat pleasant time-waster."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "afijamesy2k",
        "review_rating": "1",
        "review_title": "La La La La La, this film is a piece of junk.",
        "review_detailed_main": "The Smurfs 1/2 Star\n\nOf all the bad movies based on cartoon series and comic strips, this has got to be the worst I've ever seen, the story is simple, the smurfs try to get away from gargamel when all of sudden they get time traveled to what you believe New York City of all places then they meet a man played by an embarrassed Neil Patrick Harris who has so good in Clara's heart and TV shows like doogie houser m.d. and how I Met you mother and some other woman to protect the smurfs or else gargamel will turn them into gold for what reason. Now the smurfs I Remember from the cartoon was funny, amazing and had a good heart, this one is just absolutely nasty, truly dreadful and truly, absolutely unnecessary.\n\nThe Acting is in this one is either horrible, waste of talent, (what the hell is katy perry doing in this piece of junk, truly terrible), the screenplay is simply a big mess, the CGI effects are horrible, the 3D is trash, the musical score is full of crap and everything else is truly stupid and here are some things that I Truly hated about this movie\n\nThat one smurf would shake his ass, one smurf would fall into the toilet after he blew his bubble, that the smurfs would also look at a Sony electronic billboard and guess who release this movie,You guess it Columbia pictures, the makers of this film and the same ones who did two dreadfully bad films like Leonard Part 6 and Ishtar in 1987 (87 was a really bad year for Columbia pictures except for la bamba) the makers of this piece of truly dreadful trash oaught to be ashamed of themselves, shame on them and shame on this movie.\n\nand who is owned by Columbia Pictures, you guess it Sony. Kids might like this, because they haven't seen the original cartoons.\n\nPeyo, Don Messick, Hanna-Barbera and others are rolling in their graves as we speak.\n\nThis is the worst movie of the year and one of the worst movies I've ever seen.\n\nA Pure absolute dead zone.\n\nThey outta to be ashamed of themselves."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "UniqueParticle",
        "review_rating": "8",
        "review_title": "Another blast by Roja Gosnell",
        "review_detailed_main": "I like this fun kids movie; not sure why so many others didn't. Sure it's different from the original show, but it's sweet, adventurous, goofy ridiculousness & well voice acted.\n\nI tend to appreciate some films better than most - since I was little I've always seen things differently, I'm an oddball & that's ok! Regardless of any of that this is a decent family flick!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "sddavis63",
        "review_rating": "7",
        "review_title": "An Enjoyable Fantasy",
        "review_detailed_main": "I was never really into The Smurfs and so had very low expectations about this movie, but my 7 year old daughter wanted to see it, so off we went to a vacation trip to the theatre in Norfolk, Virginia. All I can say is that I was pleasantly surprised. It's a movie that will appeal to kids most of all obviously, but still I found it an amusing fantasy with likable characters - both Smurfs and humans. On the human side, Neil Patrick Harris and Jayma Mays were likable enough as Patrick and Grace - the couple who take in a group of Smurfs who are transported to New York City in a strange vortex that opens during a blue moon as they sought to escape from the evil wizard Gargamel (a pretty funny performance from Hank Azaria.) While likable, it's fair to say that Harris and Mays had little of what might be called \"chemistry\" - but that really isn't all that important in a movie directed to kids. On the Smurf side, everybody was fun and there were several pretty well known voices involved, including Jonathon Winters as Papa Smurf and Katy Perry as Smurfette, and it's fair to say that Anton Yelchin was successful in turning Clumsy Smurf into a truly lovable little character.\n\nI would say that the \"Battle of Belvedere\" which was the final conflict between the Smurfs and Gargamel (with Patrick also involved) went on perhaps a bit too long, and there were maybe a few too many scenes in which Gargamel and his cats chased the Smurfs around, but overall this is a kids movie, and to me it seemed as if it was pretty well done. The 3-D effects were also pretty impressive. Going in with low expectations let me experience a pleasant surprise. (7/10)"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "nicknaseef17",
        "review_rating": "3",
        "review_title": "A total disaster",
        "review_detailed_main": "The words above say it all, this film was a total disaster in every way. When I went to go see it with my young cousins I figured they would enjoy it and it might provide a few laughs for an older audience, I didn't laugh once. Even my three cousins (all under 8) didn't laugh. My 7 year old cousins even uttered the words, \"That was stupid.\" as we walked out of the theater. I was very much inclined to agree with him, it was totally pathetic. Although I must admit that it was what I was expecting, but the children wanted to see it so I went, bit mistake. Save your cash people, don't go see this movie. In fact, don't even wait for the DVD...it's not even worth your dollar at redbox."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "dejan-puskas",
        "review_rating": "",
        "review_title": "A well-recorded movie, all in all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "natrc2003",
        "review_rating": "1",
        "review_title": "One Long Advertisement for Sony Products",
        "review_detailed_main": "Some films ought to come with a warning, as in: WARNING: THIS FILM EXISTS FOR NO REASON OTHER THAN TO SELL (X COMPANY)'s PRODUCT.\n\nIt's already bad enough that product placement has become ubiquitous in films and television. It's hard to remember a film or television show that hasn't, in one form or another, served as an advertising platform for one product or another.\n\nAnd of course much of children's television programming has long centered around selling one toy or another.\n\nIn this case, however, the Evil Corporation behind this film took it to a new level : the entire film is itself product placement for pretty much the entire panoply of the company's products. Even worse, a number of essential plot points hinge upon the company's products. At another point, the film takes a 'time out' as it were to incorporate a longish sequence whose only purpose is to push the company's products. (Although there were a number of other corporations' products in the film as well -- no doubt these companies have cross-marketing agreements in place).\n\nTo top it off? I was forced to pay in order for my family to watch this company's hour-and-a-half advertisement. And an entirely mediocre film for all that (see the other reviews for why this film is so bad).\n\nWell, that's the last time I'll take my kids to a film from this company, that's certain.\n\nIf corporations insist on flooding their films with advertisements, how can they insist we pay for them? This film is an excellent argument for film piracy."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Muppetman1029",
        "review_rating": "7",
        "review_title": "I Liked It",
        "review_detailed_main": "I think it's just okay. The plot is nothing new. I mean we've seen it before in Thor & Enchanted, but it's not too bad. Is there anything bad about this. Well, duh! Neil Patrick Harris is pretentious and bland, and some of the humor is bad(Ex. Gargamel Pee Joke). But there is some good stuff about it. The lesson is good. I guess you grow to like Papa, Clumsy,& Grace. There is some funny stuff in this. I kind of agree with Spill.com. Gargamel was pretty funny. I laughed hard during the lord of the rings joke. The CGI is nice. I like the voice acting, with one exception. What the heck is George Lopez doing in this movie? Johnathan Winters was perfectly cast as Papa. Fred Armisen did a good Brainy. Anton Yelchin & Katy Perry already have a Smurf voice. George Lopez is just distracting. Is it great, no. Is it awful, not that much. Is it harmless, yeah. It's better than the chipmunk movies. You can show it to your kids to shut them up and you may get some laughs out of it. Just rent a Pixar movie instead, even if you like it like me."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "gedard1",
        "review_rating": "4",
        "review_title": "Some things shouldn't exist on movies",
        "review_detailed_main": "The Smurfs is other example that not everything is made for exist in movies. Like Garfield and Alvin and the Chipmunks, Smurfs lost all his substances that made it a great show but not a good movie.\n\nThe 3D is bad, don't waste your money. Is like Cars 2, the 3D doesn't give anything to the movie.\n\nThe story is a mixed up between the show and (you guessed it) the real world. But it don't delivers well, it has the same jokes of almost every cartoon movie. Example... New creatures come and make a mess in the life of an human. We have seen that in Alvin, Garfield, Mr. Poppers penguins, etc......\n\nThe voices, well it was good to hear Katy Perry like Smurfette but I don't see a movie only for that.\n\nThe acting is bad... Hank Azaria as Gargamel is lame, bored and plain. Neil Patrick Harris, Jayma Mays and Sofia Vergara should stay in TV Shows (HIMYM, GLEE and Modern Family) and avoid this type of movies.\n\nOverall, Don't waste your money. Is boring, lame and sadly overrated(Katy Perry)"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "chloebetts",
        "review_rating": "7",
        "review_title": "It was good",
        "review_detailed_main": "I think the story was creative. Also I love Neil Patrick Harrison. Overall a good family movie."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "rhettness",
        "review_rating": "1",
        "review_title": "Insulted My Intelligence",
        "review_detailed_main": "Watched this with a bunch of kids on New Years Eve, and it was just so agonizing to suffer through. The attempts at humor didn't even bring a smile to our faces. As an adult, I have low expectations, but even the 8 year old said \"am I supposed to be laughing?\"\n\nIt's smurftastically, smurfing, horrible. The jokes bludgeon your intelligence, forcing you to try, with grimaces, to feel entertained and amused.\n\nThe concept had potential. Cute blue people. Real world. Peril. But it never went anywhere.\n\nI want my buck back from Redbox."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Quietb-1",
        "review_rating": "6",
        "review_title": "Smurf it with the whole family.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "masterkratos666",
        "review_rating": "1",
        "review_title": "A kids movie, i just walked out",
        "review_detailed_main": "the movie is : noisy, have a bad jokes ,made a stupid script, and some performances worthy of the Razzies, if you are a child of 10 years maybe enjoy it, actually thought I was going to be a good movie but \" it's crap\".\n\nwhen I win the ticket to the premiere yesterday thought it was a decent movie at least, but it was stupid of which I ran out of film, if you have children leave them in the room, disgusting movie. all the characters are ridiculous and have nothing to do with the series of 80 's, the humor is stupid and totally unnecessary, the 3D was disgusting in conclusion is a crappy movie 1 / 10"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "elusivedom",
        "review_rating": "8",
        "review_title": "Adequate try on resurrection",
        "review_detailed_main": "I've been knowing the Smurf characters since I was a little kid. I even have a few plushes which were purchased by my siblings many years ago. I also got to see episodes of the TV series over a decade ago just after I got cable.\n\nI never thought the characters would make it to the silver screen. Nevertheless, they did. And when I saw promotional posters of the film, I was somewhat amazed. Unlike the TV series which was in traditional animation, the Smurfs are in CGI and are in a live-action film. By turning the characters CGI, there's some noticeable differences on how their eyes look but it ain't bad anyway.\n\nWhat's the best thing that's applied to the film? Well here's one I have in mind. By selecting Paul Reubens to play Jokey, the filmmakers certainly corrected a flaw that was applied in the TV series. Characters should be played by the right people."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "BloomingtonAdam",
        "review_rating": "6",
        "review_title": "They're smurfs, not cats.",
        "review_detailed_main": "I don't even know what that means! The good news is, it doesn't make a difference. This movie is not out to change the world. If you are looking for award winning acting, you won't find it. If you want a snappy script, you'll have to look elsewhere. On the other hand, if you grew up with the Smurfs like I did, this is not a bad movie.\n\nHank Azaria was amazing as Gargamel, down to the evil voice. I had to actually remind myself at one point that it was him. The makeup was really good and he really had the character down. I wasn't totally impressed with the voice casting. They really could have done better. Actually, the casting overall was weak. I think they just went with some hot names to get people to see this. It didn't kill the movie, but it didn't help it.\n\nAll in all, it's not a bad little diversion. Keeping in mind I've sat through most of the Ernest movies, the pee wee movies, and even some bad martian flicks in the 90s. It's best to walk in with the bar set low so you're not disappointed. I did that, and I enjoyed the 2D version. It may not appeal to younger viewers not acquainted with the Smurfs as there are a fair amount of jokes that only work if you are familiar with them, like Smurfette's dress. Even the scene with Azrael and the cage that falls on her are to give you clues as to what makes them what they were in the cartoon.\n\nIf you have an afternoon to kill and a few extra bucks you could do worse. Just enjoy it for what it is and you'll do OK."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "leah-blackburn",
        "review_rating": "",
        "review_title": "I took my 5 year old son...... and he LOVED it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "EchoMaRinE",
        "review_rating": "5",
        "review_title": "who is the target audience?",
        "review_detailed_main": "Well, I wish I could write something positive but the movie is neither for kids nor for adults. Kids wouldn't even get what is going on and adults may find it childish and boring. So, who is the target audience for this movie? I don't know but definitely not kids. I enjoyed smurfs when I was a kid. They were little, blue and cute characters living in a different world. There was childish action and fun. Also, what made Smurfs enjoyable during our childhood was the forest they live and all this little things they build. This movie carries the story to our time and world (which is an idea I found completely bad). So, all aspects of the magical world they were living in is left behind as well. Moral of the story, weak story and little fun."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Vincent_B",
        "review_rating": "7",
        "review_title": "A Very Smurfy Movie",
        "review_detailed_main": "I took a quick look at some of the \"bad\" reviews and I can't find any basis for giving this movie such a low rating. Most critics are mad that the movie takes the Smurfs into the \"real world\" or complain about the animation. Sorry but I found the movie is mildly entertaining for adults and very entertaining for young children. Let's face it, the movie wasn't made for people much over 12 but maintains some jokes for adults.\n\nIn my opinion Hank Azaria steals the show as the evil Gargamel. His comments to his cat and jokes about the smurfs are hilarious. He made the role his own. Azaria, who mainly does voice overs for the Simpsons, looked and felt the part of the wizard Gargamel. The next actor who \"fit the role\" and did an excellent job was George Lopez in the role of Grouchy.\n\nI never thought much of Neil Patrick Harris stiff cardboard acting and I wish they had someone else in the role. Also there was a lot of voice talent wasted such as Paul Reubens as Jokey who got a scant two lines. Other than this the movie had no real flaws other than the under developed plot.\n\nLittle kids will enjoy watching the Smurfs over and over. I assume most adults will find it amusing at best. I suppose there are the adults that watched the cartoon back before I was born who will have love/hate issues. There is no need to pick the movie apart, it wasn't made to be a blockbuster after all."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Vezon123",
        "review_rating": "1",
        "review_title": "\"Smurfs - insignificant gnats» ©",
        "review_detailed_main": "In the late 1950s, a cartoonist in Belgium by the name of Peyo made a comic strip that featured small blue creatures. When the United States of America caught a glimpse of these comic strips from Belgium, American newspapers translated the strips, and called the little blue creatures \"Smurfs\". Then, in the early 1980s, animation pioneers William Hanna and Joseph Barbera brought the Smurfs to American television, where it became a huge success. Then, in 1983, we got a Smurfs movie entitled \"The Smurfs and the Magic Flute\" where it became a huge success. Now with the age of computers, Hollywood has delivered a more digital version of the cartoon in a movie simply known as \"The Smurfs\". How does it look and hold up to the original creations of Peyo? Not smurfing much. The movie is a really bad mix between live-action and animation that's sure to please kids, but not so much adults. Hollywood tries to make a modern Smurfs movie, but fails miserably.\n\nThe plot of the movie centers on the title characters known as the Smurfs. The leader of the Smurfs is Papa Smurf (Jonathan Winters), who looks like a blue Santa Claus, and he must keep things in balance at the time for the festival of the blue moon. But the evil wizard Gargamel (Hank Azaria) tries to capture these Smurfs for their magical power. Luckily, some of the Smurfs, including Grumpy Smurf, Brainy Smurf, Gutsy Smurf, Clumsy Smurf, and Smurfette (the only female Smurf) escape Gargamel and they fall through a portal that lands them in New York City. Here, the Smurfs meet Patrick Winslow (Neil Patrick Harris) and with him, the Smurfs must try to find a way home. Also, Gargamel comes through the portal with his cat Azrael (Frank Welker) to try and catch the Smurfs to let his evil plan fall through.\n\n\"The Smurfs\" is not a terrible film, but it is just bad. The movie fails at almost every level. While I was watching the film, I found several mistakes that made the movie almost very hard to sit through.\n\nThe first problem I had with the movie was that the story was wretched. We've seen the scenario done better in other films, mainly time travel movies, where the main group of characters are from one time period and end up in the future. Now Hollywood is doing this with the Smurfs? You've got to be kidding me.\n\nThe second problem that I had with the film is that the casting was just poor. For the live-action part, Neil Patrick Harris was not convincing and not believable as the main lead human character. For the animation segments, George Lopez and Katy Perry did not fit their roles as Grumpy Smurf and Smurfette. In fact, the writers of this film actually managed to sneak in a line from one Katy Perry's songs \"I Kissed a Girl\" making an obvious pop culture reference that we do not need.\n\nThe third problem that I had with the film is that if you look at the animation done on the Smurfs on a TV, it looks pretty good. But when see the animation on the big screen, it looks kind of creepy. In fact, Raja Gosnell, the director behind 2002's \"Scooby-Doo\" adaptation, and its squeal \"Scooby-Doo 2: Monster's Unleashed\", could have done a better job at directing this movie.\n\nBut my main problem with the film is the pacing. At 1 hour and 33 minutes, the movie felt very quick and almost jumbled in some areas; this holds true especially at the middle of the film. \"The Smurfs\" had a serious editing problem. If the movie had been shortened by 10 minutes, then it would have worked.\n\nSpeaking of things working, is there anything that I liked about the movie? Well, I did enjoy the opening scene showcasing the Smurf village. I also liked Jonathan Winters' performance of Papa Smurf, being that his was the most believable of all the Smurfs. But the big positive note that made the movie work was Hank Azaria's performance as Gargamel. His acting in this movie was bad, no doubt about that, but it was so funny to watch you can't help but laugh at it. Other than that, \"The Smurfs\" really has nothing going for it.\n\nOverall, \"The Smurfs\" is a poor effort from Hollywood to cash in on a valuable franchise. To me, there wasn't enough potential to keep me interested. As far as summer movies go, this one smurfed up big time."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "mooviefan-891-879574",
        "review_rating": "6",
        "review_title": "come on¡¡¡ its not that bad",
        "review_detailed_main": "I will start saying that I am not even a fan of the Snurfs cartoon and frankly I went to see this because I had nothing else to do. Also, to find out why IMDb reviews assured that this was a complete mess. And honestly,I ve seen worst, and this movie doesn't deserve a 4.5 score. We have to consider that this is a film based on a cartoon about a sorcerer that desperately chases small blue snurfs. What can you expect of that?. Of course is silly and not to deep. But this was not made to surprise the audience it was made for the older ones to remember the cartoon and the young ones to discover it. Now I find some positive thinks on the movie. Hank Azaria as Gargamel has a few good moments that at least made me smile, the art design of the village is colorful and well done ( probably could have been better if the story was developed in the snurfs world) in a few words give it a chance it is an enjoyable family movie"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "bluerabbitgg",
        "review_rating": "1",
        "review_title": "simply put \"Sucked, Worst Film\"",
        "review_detailed_main": "Yes, easy the most hyped And worst movie of the year. Who ever hired the actors needs to be fired. the voices were so bad i wanted to shoot my self every time \"George Lopez\" talked. The plot line was something out of a bad pro communist propaganda film. Not to be an prick but films like this is why kids in America are so damn stupid, Hell watch this movie a couple times and it will give you Autism like the damn plague.\n\n1 out of 10 easy.\n\nif i could do 10 lines for this crap film, I would be running for congress. sorry some damn Pop up is blocking my post. saying i have to say more about a movie that is so simple that the pop corn on the floor of a theater would want to take its own life after seeing this Horrible Film."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ElMaruecan82",
        "review_rating": "7",
        "review_title": "It could have been smurfier, but it smurfed anyway ...",
        "review_detailed_main": "This review is from someone who grew up with the Franco-Belgian Comic book school, and is glad to see the growing appeal of this universe in today's cinema. Yep, it's not just about superheroes, or manga.\n\n\"Smurfs 3D\" \u0085 in New York City \u0085 the kind of plot premises that begs so much for harsh critics, you wouldn't dare to give it the benefit of doubt. Indeed, the whole purpose of the film sounds like the kind of blasphemies that pervert the notion of entertainment, as a simple excuse to provide 3D and special effects driven thrills. But still, with that predisposition to hate the film in your mind, you sit in the movie theater and try to enjoy it on the basis of the 100 minutes you're about to spend. And then something magical happens \u0085\n\n\u0085 I'm not denying that the movie could have been much better, that some aspects are debatable, starting with the presence of that Scottish Smurf. From all the Smurfs that populate the village, why did they come with this one as one of the lead team? Why not Hefty, Handy, Greedy, Lazy, Vanity for The Great Smurf's sake? They were meeting a Marketing Manager in a Cosmetic Company? Why not? Anyway, 100 Smurfs, would have been closer to an Invasion than a 'Coming to America' film, but still, the film could have dealt with other Smurfs characters. Anyway, despite all the critical aspects, there was something I liked in that film, and sorry for the cliché, but the reason is that it had a heart and some parts were very funny.\n\nI know this word is hackneyed and can be applied for any average Disney film, but I was in the theater and I heard kids giggling to Brainy Smurf's comments, Grouchy's eternally killjoy attitude, and Clumsy's \u0085 uh \u0085 clumsiness, I could hear them laughing to Gargamel's misadventures, and his hilarious interactions with Azrael (probably the most memorable character from the film), so I thought to myself: these kids who didn't grew up with the Hanna-Barbera cartoons or never read any Peyo's albums, these kids were discovering MY universe, my good old 80's memories and probably the most cherished part of my childhood. And what was happening was the connection between two generations, I felt like a child again, and these kids were probably going to discover one of the most appealing original universes: the Smurfs.\n\nIf only for this exhilarating ride into childhood, the movie accomplishes something. But let's get back to the 'heart' comment, again, special effects are not used for the sake of them, the movie chooses to focus on one of the most endearing Smurfs: Clumsy, and uses him as a key character to trace an evolution that would inspire all the kids who suffer from lack of self- confidence. It also parallels the Smurfs' mission with the situation of their two hosts, Neil Patrick Harris and Jayma Mays as Patrick and Grace a young couple waiting for a happy event. The couple could have had a kid, an argument before a separation and reconciliation, but no, they love each other and the movie doesn't embarrass itself with the kind of clichés we would have expected. Besides, and thanks to the presence of Smurfs, we're constantly reminded that we're dealing with a child's world, that there's no need to be cynical and to care of plot details.\n\nI know that beyond the presence of the Scottish Smurf, some would point out the fact that the characters seems not to be aware of the existence of Smurfs, so we're ought to believe this is a parallel universe where the Smurfs are unknown. But read this again, and you'll realize how futile this whole thinking process is, it's a film mean for pure enjoyment, and on that level, the film was at least faithful to its trailer, whatever people expected, it was clearly shown in the trailer. I didn't even expect a part set in the village, and I was glad it took a great part of it. Maybe I would have preferred the film to be set IN the village, well, this is an argument I would accept. But overall, the film respected its premise, and I'd rather have a good time watching the Smurfs of 3D and emptying my box of popcorn than scratching my head over the symbolism of a Terrence Malick's film during 15 minutes of beautiful nothingness.\n\nSome clever minds would probably criticize the whole merchandising aspect of the film, as the reason to be of the film, but let's not forget that the Smurfs have always been merchandised, hell, didn't we grew up and play with these figurines when we were kids. All these arguments wouldn't have worked if the movie was a mediocre attempt to resurrect forgotten characters, or just an excuse to provide cheap comic of oppositions moments like the unforgivable \"Visitors in America\" but the story works, with the right dosage of complexity of the plot and simplicity in its resolution, it's not about what happens but how it does, and on that level, both visually and on the writing department, I don't think Peyo would have been ashamed by the results.\n\nA good movie for the kiddies, and the adults who'll watch the film from their kids, or their inner child's perspective, and a great scene-stealing performance by Hank Azaria. The movie is cute, because the Smurfs have always defined cuteness, and it's entertaining, heart- warming, thrilling, and visually delightful. A cute little film we would all watch and leave by whistling the immortal :\"La-lala\", a tune that defines a whole generation."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "StevePulaski",
        "review_rating": "2",
        "review_title": "Objects near, are sadder, and more devastating than they appear",
        "review_detailed_main": "Not only does Hollywood succeed in making a boat-load of money off of these mangy CGI/live-action films, but they continue to destroy the warmth, the special qualities, and the simplistic feeling all of these cartoons had. Alvin and the Chipmunks, Garfield, Scooby-Doo, and Yogi Bear have all been victims to this new tampering of family films and now The Smurfs just got smurfed with.\n\nI judge family films by two simple things; will the kids enjoy it and will the parents enjoy it? Very few films take this small rule into consideration, because it's a very hard thing to do. When parents take their children to films, they usually think \"two hours of day-dreaming.\" But it doesn't have to be that way. Some films, like Shrek and Spy Kids will charm adults as well as children. But CGI-ed features like this easily get bogged down by immaturity, lack of imagination, and big name stars doing the roles of animated creatures.\n\nThe story is The Smurfs get sucked into New York City and are being chased by some creepy magician/wizard, hunchback named Gargamel (Azaria) who wants to kidnap The Smurfs so he can create gold. Meanwhile, The Smurfs get sucked into the real world and land in the clichéd city of New York. This insults the viewer seeing as every film has to include Chicago, Los Angeles, or New York to be relevant.\n\nSo, they get sucked in and go to an advertiser's house where him and his wife (Harris and Mays) live. It doesn't take much before the couple to basically briefly adopt these creatures without asking any questions. If five inch tall blue people wandered in your house would you ask a minute and a half to two minutes worth of questions before welcoming them into your home? Most illogical.\n\nThis is the rare case where this family film will please neither the adults or the children. It may bring a brief smile to the children's face, but their smiles will quickly diminish when they discover the film packs a plot amusing for only a few minutes, characters that grow annoying quickly and don't act out of their names (think of a world where people are called by their stereotypes. IE: nerd, geek, Jew, etc and each one acted like they are said to act). Most likely children aged three to five will find some enjoyment in this, but will not likely be able to sit through this ninety-two minute plot.\n\nOne character that bothered me was the main villain, Gargamel. His appearance is odd, his actions even odder, and his overall presence is awkward and out of place. He has a sidekick cat who he treats like a piece of meat, and that's one thing I can't and will never be able to condone or go unsaid; I hate animal abuse with a passion. I'm well aware the cat is a CGI creation, but the thought of someone doing this to a cat is inexcusable. This cat is beat to hell throughout this film. It is not funny. It is not clever. It is unnecessary.\n\nDirector Raja Gosnell doesn't necessarily have the best filmography out there. He has worked on Home Alone 3, Scooby-Doo and its sequel, Yours, Mine, & Ours, and Beverly Hills Chihuahua. Let those films set the bar for this one.\n\nThere are perks. Neil Patrick Harris does the best he can do under the given circumstances. He seems to resent the idea of playing secondhand man to a bunch of non-existing blue people, but does it with a cheery, yet likable persona. Though he can be good, there are parts, like the big climatic point where he begins to hate The Smurfs, that isn't believable. His anger isn't acted out properly, and the whole scene ruins any sympathy or believability for the characters.\n\nEvery film can be good, it just needs to be in the right hands, in the right directions, and done with the right cast. The Smurfs could've been good if it wasn't CGI mixed with live-action. It is such an out of place, awkwardly made mix that I believe the only two films that did it and did it well were The Spongebob Squarepants Movie and Who Framed Roger Rabbit? If you're going to make a movie about The Smurfs make it one of two ways (1) entirely CGI or (2) classically animated (recommended by me and the audience of America).\n\nIf you think it can't be done, a new-age animated film done in its classic style of animation, watch Winnie the Pooh and tell me I'm wrong.\n\nStarring: Neil Patrick Harris, Jayma Mays, Sofia Vergara, and Hank Azaria. Voiced by: Jonathan Winters, Katy Perry, Anton Yelchin, Frank Welker, Fred Armisen, Alan Cumming, and George Lopez. Directed by: Raja Gosnell."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "LazySod",
        "review_rating": "8",
        "review_title": "Way better than expected",
        "review_detailed_main": "Being Dutch and living close to the Belgian border I grew up reading the comics about The Smurfs, called De Smurfen over here. When I saw the first posters for this film I was thinking it was going to be a disaster - there had been animation films with the smurfs before and none of them came close to the level of the comics and this wasn't even going to be animation, it was going to be half-and-half. When I then saw the first trailers and how the characters looked much like the \"new smurfs\" that were made years after the original series the fear for a disaster got even bigger.\n\nI went to see it anyway because the kid wanted to see it and to my great surprise the film really wasn't half bad. They kept enough of the original theme and characters to bind to the original comic and added enough human interaction to make it funny. Having the story take place in a place and time that is completely unlike the one in the comics makes for a big difference and gives space for extra easy cop-outs to keep the story rolling.\n\nI guess the film isn't any good if you're not known to the original series and aren't a kid, but for my kid and me it worked.\n\n8 out of 10 cats with a piece of ear missing"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "todizzytry",
        "review_rating": "7",
        "review_title": "Glad I didn't decide based on the reviews on here...",
        "review_detailed_main": "I've never reviewed a movie but felt the need to throw this out there. Just finished watching The Smurfs movie with my kids ( 8 year old and 4 year old) and my wife and I have to say that I really liked it. Look, I am not a certified movie critic but this movie was cute in it's own right. It'll probably never win an Oscar or some movie award but it's a good time for the kids. It was enjoyable listening to all the kids in the movie theater \"crack up\" with laughter at parts in the movie and there was even some things that us adults found humorous. Sad to say, but this movie ended up being a pretty good feel good movie and may even be a \"guilty pleasure\" that I wouldn't mind watching with my kids.\n\nIn the end this movie was a lot better than I thought it would be after reading reviews and I'm glad that I didn't win the argument with my wife to see another movie."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "iReviewFilms",
        "review_rating": "4",
        "review_title": "Fanaticalaboutfilms Review: The Smurfs",
        "review_detailed_main": "Despite me trying to be as neutral as possible before settling down to watch a film I found myself preparing for the long haul when I decided to watch The Smurfs. As a kid I never really got into them but did occasionally catch a TV show or two so wasn't flying completely into the unknown like some of the more recent comic book characters that I have reviewed.\n\nUpon entering the world of the Smurfs we find the blue critters relaxing in their mushroom metropolis preparing for the special Blue moon festival. But all is not well- the evil wizard Gargamel (Hank Azaria), after years of searching, has finally found their village. In the ensuing chaos he chases some of the Smurfs out of their village where they are sucked through a vortex and into our world. Determined to capture them so he can harness their Smurf goodness, Gargamel and his cat follow them through. So begins the race to get back to their world before they are captured.\n\nGiven I was expecting the absolute worst, the film managed to lift itself above that lowly bar and not bore me to tears within 20 minutes. Also, somewhat surprisingly, there were a couple of times where my preprepared grimace transformed itself into something resembling a smirk. This was in most part down to the performance of Azaria. It's no Oscar worth performance but is probably the highest you can go whilst acting in something that has so specifically be designed for an audience whose age can be counted on one hand. This brings me to my next point...\n\nWhy does Hollywood think that just because they are making a film for children that it can forego any form of quality. They seem to take the stance that just because their audience is young no effort will be required to keep them entertained and who cares if it's rubbish as it's only a kid's movie- just fill the screen with bright colours and hey presto instant success. I'm not sure if the fact that they think this represents entertainment or that the public actually accept it as such is more worrying to me.\n\nOne thing that slowly ate away at my sanity during The Smurfs is their habit of making sure at least every sentence has the word smurf in it whether it is being used as an insult, during a joke or just replacing a generic word. Most of the time it was used as a tool to get the Smurfs cursing away without affecting the film's U certificate. And if that doesn't worm its way into your head then I challenge even the most anti Smurf amongst you to escape from this film without humming their catchy Smurf tune at least a couple of times after leaving the cinema.\n\nThis is Katy Perry's (Smurfette) first major voyage onto the big screen and I was not convinced much like many of the other voices behind the blue faces. I also don't understand why they felt it necessary to squeeze in her singing part of one of her songs either given that it won't make 5 year old go out and download it. The non CGI cast wasn't much better with the casting guys plan to throw in successful TV actors not having the desired effect as they failed to impress in their roles on the big screen. Neil Patrick Harris especially didn't work as the doting husband.\n\nThe animation just about held up but there were some points when it became obvious that the actors were interacting with themselves rather than the Smurfs particularly when being held or embraced and at other times the Smurfs looked a bit too fake. I can't understand why, if your going to make yourself a CGI fest Smurf movie, you set it in the real world. I'm sure that it would have been a much more enjoyable film if they had stayed in 'Smurfland' and battled Gargamel there.\n\nAs for the story, it was atypical for a children's film keeping the plot quite simple whilst throwing in a sprinkling of slapstick comedy and funny characters to get most of the laughs. I was expecting the adult audience to be completely disengaged but there were some moments that hit the double entendre mark and would have woken the adults whilst flying over the heads of the rest. Don't get me wrong, this is still geared 95% to a kid audience but I was expecting 100% so was pleasantly surprised at the inclusion of a few adult themed jokes.\n\nThe only reason you are going to want to pay to see this would be if you've got yourself a couple of kids as they are bound to enjoy. As for the rest of us, although it wasn't a complete waste of time (think Garfield, Alvin and the Chipmunks) I'd rather go and smurf a smurf. (Let your imaginations run wild- answers on a postcard).\n\nRating: D+ For further reviews feel free to check out: http://www.fanaticalaboutfilms.com"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "I think it is hilarious and entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "johnsonryan13",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "joefletch-16443",
        "review_rating": "7",
        "review_title": "Live action smurfs.",
        "review_detailed_main": "I know this movie isn't the best but at least it offers something. The cgi is good, characters are likeable. The only bad thing is that gargamel is annoying and is not a good villain."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "h-62007-26888",
        "review_rating": "4",
        "review_title": "Sony smurfed up big time",
        "review_detailed_main": "And how did they do so? A live action smurf movie that's no different from other hybrid films of its kind like Alvin and the Chipmunks and Hop.\n\nWhat do I mean by this? Well, the story is about the smurfs escaping from Gargamel yet again, but six of them (consisting of Papa, Gusty, Brainy, Clumsy, Grouchy, and Smurfette) are caught in a portal and are magically transported to New York City. Because in a film that tries to heavily market itself as a family picture with cartoon characters in live action, where else would it be set in order to make itself a big deal? Anyhow, after meeting billboard designer Patrick Winslow and his wife Grace, they now have to try to survive the big bad apple and get back home before Gargamel shows up and takes them away.\n\nIn terms of a story, it's pretty clear that it doesn't offer much to the audience presented. Think about it. It's a human average joe (or two) going through the \"terrible\" perils of life only to then be greeted by an external, non human star of the picture and they would bond. As a result, the story presented is completely unoriginal. Predictable from top to bottom and barely offering anything good to its audience. It doesn't help either that it also fills itself with a dated and almost out-of-touch tone, a forcefully happy feel to it, and a whole lot of blatant product placement. This is mainly evident through the humor, and while not all of this is bad, since some of the gags like with Gargamel are funny, it's the rest of the comedy that falls flat my mostly being consistent of ineffective slapstick and dull pop culture references.\n\nThe animation doesn't make things much better. Well, it does look fine in retrospect of its own thing. Yet for cartoon characters from the 60s, it doesn't look that appealing. In terms of the design, it's not very appealing. Don't get me wrong. I get what they were trying to do and it can look fine when the smurfs are given a texture boost to have them become adjusted to the modern world. However, as much as I admire the work they were doing with it, there's something wrong with the visuals that's kind of unavoidable. Maybe it's just me, but it's how they took the classic cartoon characters and made them...CGI monstrosities. Not to mention that they can come off a bit creepy, especially in the eyes, which are pretty much the stuff of nightmares composed from just staring. However, the other elements of the visuals are pretty decent. The backgrounds look nice, the backdrop of New York City is okay, and the scenes when Gargamel would cast a spell actually look really good.\n\nThese characters aren't that great. The human characters are uninteresting and add little to nothing to the main story, and the smurfs themselves are mainly one-dimensional and only exist to make the film marketable, like Clumsy is the unexpected hero, Papa is the father figure, Smurfette is the girl, and Brainy, Grouchy, and Gusty are additional comic reliefs. As for Gargamel, of all the characters here, he's actually the most tolerable character in this movie. Yes, he's the generic bad guy, but there's something about him that's actually admirable and kind of exciting. He has an enjoyably over the top attitude about getting the smurfs and most of the actual funny moments in the film all come from him, on top of a surprisingly great performance from Hank Azaria. Speaking of which, that's another strength this movie benefits from. While the characters may not be that great, they are led by talented actors that really did a nice job in their roles, like Neil Patrick Harris, Jayma Mays, and Sofia Vergara. I'd even say the majority of the voice cast for the smurfs are great as well like Alan Cumming, Anton Yelchin, George Lopez, and the original voice of Papa Smurf, Jonathan Winters. The one actor I feel like didn't work in her role was Katy Perry as Smurfette, and that's primarily since they only cast her as the role for the sake of marketing.\n\nLook, this movie isn't as bad as its sequel or The Emoji Movie. That's an accomplishment in itself. But even at that, I'd rather sit through The Star or even Hop instead of watching this again."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "wall17",
        "review_rating": "6",
        "review_title": "Better than Expected, and Better than Snide Reviews Might Have You Believe",
        "review_detailed_main": "So, with the disclaimer that this is yes, a formulaic kids' movie, and yes, it's aimed at the nine-and-under set, this is a perfectly fine, even slightly above average film. I have to count myself as a Smurf Hatah from the 80s, and while I'm a bit indifferent to the original comics (they were weird but not weird enough) they were clearly better.\n\nWhat we have here is a moderately smart tongue-in-cheek post-modern appreciation of the fact that the 80s cartoon Smurfs were incredibly annoying - embracing the original characters even as there's a wink -- the Smurfs admitting their singing is incredibly annoying, and then still doing it, rather sweetly and within limits; the Neil Patrick Harris character pointing out the ludicrousness of the weird premise of 98 male smurfs and 1 female smurf and the whole \"Smurf the Smurf, Smurf\" vocabulary so we all can get past it and to the slightly \"blue\" humor (e.g. \"Get the Smurf Out of here\") and all sorts of reflexive jokes, such as Smurfette, voiced by Katy Perry, saying \"I kissed a Smurf...and I liked it!\" The plot is your standard 1960s live action Disney film, in the same vein as The Computer Wore Tennis Shoes or Herbie, that ilk, with the benefit of 21st century CGI mixed in with the live action and the aforementioned post-modern self-reference. They even work in a nice homage to Peyo by having the Smurfs read up on him (and get a solution to one of their problems) in a book about Les Schtroumpfs. And as boring and trite as that may seem to adult reviewers here, it's at the level of monomyth for the seven year olds in the audience.\n\nThe PG is largely for the double entendres that will fly over kids' heads, a little very mild bathroom humor, and extremely cartoonish (appropriately) violence mostly having to do with Gargamel and Azrael getting bonked and zapped as they try to smurf the smurfing Smurfs.\n\nHarris and Hank Azaria do star turns, Harris as the Fred McMurray-everyman-Dad type, and Azaria as Gargamel. There's no nuance or subtlety because THAT'S NOT WHAT KIDS WANT TO SEE IN A MOVIE. Cheers to them for doing them.\n\nIf you insist on being a hipster, content yourself with trying to spot the many visual inside film cinematic quotes. I spotted clever visual quotes from Reservoir Dogs, Braveheart, the Rock, and the Planet of the Apes, among others.\n\nAnd, we get a modestly hip soundtrack running from Vampire Weekend to the Smurfs doing a sort of duet with Run DMC and Neil Patrick via Guitar Hero.\n\nSo stop complaining. What did you expect from a Smurfs live action movie? I expected far less than what I got, which was more entertainment sitting with the kids in the movie theater than I had from the likes of Gnomeo and Juliet."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "briancham1994",
        "review_rating": "3",
        "review_title": "What an abomination",
        "review_detailed_main": "I wasn't expecting much from this film but it wasn't even dumb fun. It's full of gratuitous random antics, toilet humour and product placement that don't even seem entertaining to children. There is barely a semblance of a story and the characters have the intelligence of bricks."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "sokily-usmc44",
        "review_rating": "7",
        "review_title": "Great Family Fun",
        "review_detailed_main": "The family and I loved this movie! For the wife and I It brought back some good past memories and it was awesome sharing it with our kids. For the children (6 and 4) it was all out entertaining! Nothing went over their heads and they the smurfs are just loveable characters! Our teen daughter even loved it because it wasn't overly childish.\n\nBottomline, we had a fun time watching this movie and the smurfs have found a place in our hearts."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jf-42973",
        "review_rating": "5",
        "review_title": "Painfully unfunny and boring",
        "review_detailed_main": "This was a bad film. It can be fun to hate on with friends but otherwise it is just a way to make money with toy merchandise. While Gargamel is the only thing that makes it a little bit enjoyable but not by much. Its boring, unfunny, and as interesting as watching someone moving a brick an inch every 30 minutes."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "imdb-10982",
        "review_rating": "8",
        "review_title": "We loved it",
        "review_detailed_main": "Don't believe all the negative comments here, I really wonder sometimes on IMDb about the mixed ratings. We sat down and watched this with the kids (Boy 7, Girl 9) and everyone loved it.\n\nOur lad found it the funniest but both kids loved the cat and the slapstick comedy. The acting wasn't the best in the world but the film overall was great and we all laughed throughout.\n\nHow on earth this only has 5.2 stars is beyond me when the AWFUlLY butchered, terribly animated and boring Fantastic Mr. Fox gets 7.9 stars.\n\nIf you want a good laugh for all the family then we recommend this.\n\nJolly Fun!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Mikemartins1980",
        "review_rating": "7",
        "review_title": "Worth the time",
        "review_detailed_main": "Lots of fun ! CGI and effects were done really well . Story was a lot better than i anticipated. And the plot twist was exciting . My 3 kids were glued to the screen the whole movie 🎬"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "asherrbh_15",
        "review_rating": "1",
        "review_title": "Let's put it this way, someone could hit every copy with a hammer and I wouldn't be sad",
        "review_detailed_main": "This is just an atrocious movie, it's got no demographic, it's a giant cash grab, I didn't laugh at all Neil Patrick Harris and Hank Azaria are talented actors but they're completely wasted. And the worst thing about this movie, they use smurf in every sentence and it got old after one time, this is probably the most annoying story I've ever seen, this movie sucks so bad."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Hollywood Butchers The Smurfs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "laura71193",
        "review_rating": "1",
        "review_title": "Ohhh what can I say about this movie?",
        "review_detailed_main": "At my school they show different movies every Saturday at 11pm and this movie was playing. I didn't know what to expect but I never thought it would be THAT bad. But it was a million time WORSE than I anticipated. This was the first movie that was physically painful to watch. I was happy it was over and I wish there was a way I could hurt this movie but I can never hurt it the way it hurt me. Bottom line NEVER see this movie! Even Neil Patrick Harris was bad in this movie which was so surprising and disappointing! The script was badly written and I hurt to watch. such great actor doing a horrible movie so this makes them look bad. Its Star Wars Episodes I and II all over again."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "narathip_87",
        "review_rating": "6",
        "review_title": "The Smurf's is a cute film . . . if cute's your thing.",
        "review_detailed_main": "Charming and enjoyable, thanks to lively animation, a strong script, several good jokes and terrific performances from a superb cast."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "lalitdevraj",
        "review_rating": "4",
        "review_title": "Not the best flick for a child",
        "review_detailed_main": "The Smurfs have been a part of history for many current children and adults today. This movie, with a more realistic approach and usage of puns/manipulation in more modern day language and slang may not appeal to all kids in terms of entertainment and understanding. As a teenager, this may not the movie of desire to watch but as I have I am able to comment holistically.\n\nThe casting for the voices of the Smurfs was not of the best choice; there are better enunciating speakers in Hollywood and that's that. As per Neil Patrick Harris and Jayma Mays, they are friendly faces to the target audience, with Neil Patrick Harris being a significant USP for this movie as far as older age groups are concerned.\n\nWith a simple storyline and a interesting cinematography, the movie was pleasing to watch as per the flow of events. From a child's perspective, the movie was a bit higher than comprehensive for a child hence leading to an enjoyable time, but not as much as some, more classic, movies provide."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "svenus-126-196632",
        "review_rating": "7",
        "review_title": "You People Must Be Out Of Your Minds",
        "review_detailed_main": "As a child of the 80's with a BFA in animation I had braced myself for the worst. The film looked HORRIBLE and if my Aunt hadn't wanted to go see it with me for old times sake, I would never had watched it willingly.\n\nThe film was pretty darn awesome.\n\nOkay, so it wasn't Ben-Hur, but it was an all around well crafted movie with nearly 100% correct Smurf lore. What more could a Smurf fan want? One of my only complaints is that George Lopez sounds too much like George Lopez to do animation. Every time he spoke I kept thinking 'why is George Lopez's voice coming out of the screen?' it really distracted from the character.\n\nI'm sorry everyone's kids didn't seem to like it. Perhaps we could get in some fart jokes and Megan Fox bending over a camaro to spice it up.\n\nThe people whose attention can only be held by 500 million explosions and super models are the reason crap like Bay's version of Transformer's got made. Somehow that raked in a ton of money even though the characters are poorly designed, the pacing is horrible, the plot is nonexistent, and Bay couldn't have cared less what Transformer fans really wanted. So I'm confused.\n\nThe Smurf movie was a wonderful, yet cannon adaptation of the original characters we all knew and loved as a child. Even with the modern surroundings they were still true to their roots. THIS IS WHAT YOUR CHILDHOOD WAS ABOUT! You know I used to think they just didn't make movies like they used to.\n\nObviously it's the audience that's gotten tackier and more full of crap, not the film makers."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "tristandetwiler",
        "review_rating": "1",
        "review_title": "I'm not intentionally being harsh on it. This film will make you blue in the face...",
        "review_detailed_main": "Let's give the review system another try, right?\n\nPlot:\n\nThere was a plot? Oh yeah, it's to help get the smurfs back to their world. I guess simple 'nough.\n\nCharacters:\n\nThe human characters are better than The Smurfs themselves. That's kind of sad, really. I actually cared more about the human characters, whose actors were giving half-assed performances, more than the cute blue people. That's how annoying the writers made these cartoon creatures.\n\nVisuals:\n\nCheap CGI and Product Placement EVERYWHERE. I actually lost count just a few minutes after the movie started. I don't think there was one shot without a piece of advertising. (Sony, M&M's, Blu-ray, McDonalds, Rock Band, Yamaha, and more)\n\nEnjoyment:\n\nNothing but eye-rolling, face-palming, and groaning jokes. It is pure cheap entertainment. It would entertain a toddler for a few minutes before they ask you to turn it off.\n\nRewatchability:\n\nIf I ever see this film again ANYWHERE, It's just going to put me in a sour mood. I don't even recommend a first time viewing.\n\nSorry if this review was short, but this film was just awful."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "virindra",
        "review_rating": "7",
        "review_title": "Was nice.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "C-Rex",
        "review_rating": "2",
        "review_title": "Disappointing and Lacklustre",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "TBear6000",
        "review_rating": "8",
        "review_title": "A cute, enjoyable throwback",
        "review_detailed_main": "I don't know why this movie got such negative reviews. Obviously if you don't know what a smurf is or were not a fan of the original cartoon then this movie isn't going to be for you. But for a child of the 80's, like me, I found it delightful. It was a pleasant, nostalgic treat that while modernizing the smurfs a bit stayed true to the original theme and feel of the cartoon I remember. And, in a surprising twist, the film included humor throughout that was not limited to children alone but quite a few things thrown in to amuse the adults. In fact in the theater I was in the adults were laughing more than the children. Overall, I found the movie to be very cute and a thoroughly enjoyable time. Don't let negative reviews put you off. Be the judge for yourself."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "anouk77",
        "review_rating": "6",
        "review_title": "Disappointing but not as bad as expected",
        "review_detailed_main": "This movie is no Oscar material but it's not as bad as I expected it to be after reading some of the reviews.\n\nHank Azaria does pretty well as Gargamel and I loved seeing the Smurf village. The latter is what actually disappointed me in this movie because it's mainly set in our modern New York instead of in the world of the Smurfs so you barely get to see this wonderful place. The story only has a couple of Smurfs in it for the most part and I think that's such a pity! I especially missed Hefty, Jokey, Lazy, Painter, Vanity and Chef!\n\nI honestly think that they should have just taken one or two episodes of the t.v cartoon series and made that into a movie. I would have liked that a lot more because it would have given us a much bigger view on the Smurf's world and it would have created a more original plot for the movie."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "sheppard330",
        "review_rating": "",
        "review_title": "for kids of the 80's and their children alike! family pic. not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ilikechocolatebunnies",
        "review_rating": "1",
        "review_title": "Offensively anti semitic!",
        "review_detailed_main": "This film was as smurfy and schmaltzy as i expected. And I would have enjoyed it. However what I did not expect was the unnecessary, anti-semitic negative stereotype of the villainous wizard Gargamel and his evil cat Azrael. It was reminiscent of the stereotypes published in 1930s Germany. Yes Gargamel was funny, but humour does not make racism acceptable. He could have been funny without all the Fagin mannerisms, yiddish accent and hooked nose. I was really gutted that the filmmakers had put this offensive stereotype into a kids film. I and other adults can probably see it for what it is (racism) but kids just absorb it. By the way, I'm not someone who usually writes reviews, but I feel silence may be viewed as acceptance of these ugly attitudes which are foisted upon unsuspecting audiences."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Fizgig777",
        "review_rating": "7",
        "review_title": "Much, much better than the reviews here!",
        "review_detailed_main": "I don't understand what people who gave this movie such negative reviews were expecting... It's an ANIMATED movie, for pete's sake, not real life. Sure there will be goofs, etc., but, again, it's supposed to be for entertainment, not for picking apart 1 frame rate at a time.\n\nThe best thing about this movie was the superb animation work on the Smurfs themselves. The cat, not so much, but the Smurfs themselves were flawless. They're also adorable =) As far as the plot goes... Yeah, not the best, but, again, this is an animated movie based on a cartoon and I don't think anyone should be expecting plausible story lines.... These types of movies are supposed to entertain. The Smurfs are certainly that =) Quite a few comedic moments and lines keep the movie moving right along. I think the movie has appeal for both kids and adults -- though young kids may not be able to follow the whole Anjelou part of the plot. But, the action in the movie should keep a normal kid, with a normal attention span, watching and interested. There is also a positive message & lesson{s} to be gleaned from the plot for kids.\n\nThe only thing I really didn't like were the parts of the plot dealing directly with the Anjelou CEO and her direct staff -- not NP Harris' character. They were just so obnoxiously arrogant that I couldn't root for any kind of good outcome for them -- was waiting and hoping for something to fall on the *bleep*. Just couldn't root for NP Harris' character to be able to salvage his job with the company either --- kept hoping he'd end up getting the boot so he could find someone normal to work for.\n\nSO, all in all, don't let the negative reviews here keep you from giving this movie a look-see. It's a fun, lighthearted family movie. Great for adults who remember the Smurfs cartoons from their childhoods, especially =)"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "J-Fields2594",
        "review_rating": "7",
        "review_title": "Good Family Drama!",
        "review_detailed_main": "Come on people, stop over-exaggerating. Its a fun Family Movie. It had its laughs every once and a while. It stayed true to the classic show. The voices where great, the mannerisms such as the use of \"Smurf\" and the singing of their favorite tune is pretty spot on as well.\n\nThe plot was good, i did not see any plot holes. The cgi was pretty amazing, even with the cat. The villain stayed true to the original character as well. Papa Smurf and Smurfetts voices were spot on. Along with Brain and Clumsy, it was a good movie for what its worth. People tend to get a little over-dramatic on IMDb, they give the lowest score possible whenever they can. I think the power of being able to review tends to get to their heads i guess. Stiop being so critical people, its a movie aimed at kids, not overly critical adults."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "FilmMan47",
        "review_rating": "2",
        "review_title": "The Smurfs has great special effects but misses out the plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "Blue fun",
        "review_detailed_main": "I like the smurfs in general. I don't quite remember them exactly as they are portrayed in this. And the movie does use quite a lot of clichés. But it still keeps the fun factor high. It is done nicely for a family movie. Gargamel and the cat are great and the humans fulfill their part nicely.\n\nTry not to think too much about the story (which is plain, if you want to call it something nice). But going into this movie you should expect this. Kids in general will love this (exceptions as stated in another comment are prone to happen of course) and if you let yourself into the vibe of the movie, you might too."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "cgrill8",
        "review_rating": "8",
        "review_title": "A Great Kids movie",
        "review_detailed_main": "We took our 2 kids to see this with varied expectations after reading various reviews. There are SO many nods to the old show, and their creation, Smurfette's creation, I did not have an issue with the plot at all. Yeah take the old He Man plot and insert Smurfs, except, the Smurfs did a much better job with this than He Man ever did. They didn't use the word \"Smurf\" for just censorship, they used it as their verbs also. (Hey, transformers used \"Slag\" in Beast Wars.. what's the difference people, and Beast Wars was TV!?) At the intro we even see a glimpse of the nearby Kingdom where William and PeeWee came from, but the story doesn't go in that direction, obviously. The plot is simple, the violence is minimal, any real cursing is non-existent. So thus many people will hate this movie. No smurfs are killed, there is no blood, nothing gets blown up...well, something does now that I reflect on that. It's a fun little movie with many dry smurf jokes. Loved Grouchy's new love interest, hilarious. My 6 year old girl absolutely LOVED this movie. My 3 year old had an issue with the Smurfs not being in every scene...with his attention span. My wife and I even enjoyed it for what it was as well. No one else could have been picked to be the perfect Gargamel. Azrael was spot on and still my favorite character. So if you have the pitter patter of little feet or little blue feet take them to see this little treat, nothing tasteless here. The \"chamber pot\" scene was even funny. They \"sort of\" leave a possibility of a sequel, so bring in the \"Lone Smurf\" for the sequel! Almost gave it a 7/10, but changed my mind because we haven't seen a movie we could take our kids without being embarrassed about them seeing in a LONG time, plus I'm an old Smurf fan. Not much meat here, but a good clean kids movie you'll see in a LONG time. There may never be another movie made like this one, and the Smurfs look very realistic. Did we 3D? Absolutely... not!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "robinhio84_",
        "review_rating": "7",
        "review_title": "I hated this, so much less then I expected",
        "review_detailed_main": "The Smurfs go Hollywood, that kinda wraps it up! This is not a great movie, however some of the charm and characters do make the move have delightful moment.\n\nStory Summary: The Smurfs get sucked into the real world and of course land in New York, however. Gargamel and Azrael follow them\n\nAnalysis: The Smurfs in the real world will kind give you what you expect a lot of cringe, funny moments and a predictable plot. For young kids it is will most likely be good, but for older kids and adults it has some dull moments.\n\nOne thing that is important to notice is that the second half from the movie outside of its great intro is much better then the beginning.\n\nDialogue: 6/10 hit and miss. Gargamel is very cringe and doesn't capture the feeling of the cartoon one and the human characters are one dimensional. Sofia Vergara does steal the show, being a wicked boss.\n\nActing:6/10 As mentioned Gargamel missed the mark a lot of point and the the other characters have very little interactions with eacher.\n\nVoicecast & Character Depiction: -Grouchy 10/10, never has he been able to get a multilayered personality until this movie.\n\n-Papa Smurf:9/10 this really captures the feeling of Papa Smurf especially in personality.\n\n-Clumsy; 9/10 it feels and sounds like Clumsy -Brainy: 6.5 /10 not to offend, nor stand out. Brainy does have one moment at the end, but it felt like more could have been done with him at least they could have done the classic joke with him -Smurfette: 6/10 it's ok, Smurfette just doesn't really bring it.\n\n-Gutsy: 8/10 Voice acting is great, at first feels like because of him Hefty got robbed, but Gutsy does stand on himself and has some great moments. It's a pity, that the comic writers never included him in the comics afterwards. At least as a guest character.\n\nVisuals (Decor):animation is good, but Smurfette and Azrael don't look great. Somehow it seems nailing a female face is harder, coz sometimes when looking at her, she does not look great.\n\nCostume & Make up: It's alright. Gargamel could have looked a bit more like a real wizard, the outfit is a bit hockey hockey / cosplay.\n\nSpecial Effects: 6/10 It's a kids movie\n\nMusic and background score: 7/10 Not as impactful as you might think\n\nStory, liberties: This movie made me realise that it is much better to leave The Smurfs in their magical forest. What worked for Sonic does not work for everyone. The possibilities of The Smurfs in their own CGI word are much more charming\n\nOverall assessment: This movie will undoubtedly disappoint fans of the comics and 60s and 1981 series. However it is not a bad movie and luckily the second half is better then the part of the movie after leaving the village. While being in New York City is cringe, predictable and sometimes boring- Stand out characters like Grouchy and the newly introduced Gutsy do give a charm next to the recognisable Clumsy and Papa Smurf.\n\nEnd Word: A soft recommendation with a trigger warning for old school fans, this can definitely feel like a bad money grab, but if you look past that, the charming moments are also memorable."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "At first I hated this movie but now im actually enjoying it",
        "review_detailed_main": "OK so its NO masterpiece but hey its entertaining.The story is loosely based on the TV series of the same name created by Ponyo and its about the smurfs who accidentally get sent to our world that is NYC(New York City)where the smurfs(voiced by Katy Perry,the late Johnathan Winters,Jim Cummings,and Kenan Thompson)and meet up with a young couple called Patrick and Grace(Jayma Mays and Neil Patrick Harris)as an evil wizard called Gargomel(played by Hank Azaria)is ruining their land and the Smurfs accidentally stumble across a portal.But with Gargomel and his cat are after the Smurfs its up to the Smurfs two new friends Patrick and Grace to help them get home again.\n\nI know this movie is strictly for kids and its a lame rip off of the 2007 Disney movie Enchanted,but hey if you grew up watching The Smurfs then you'll like it. If not then avoid this one.\n\nThe voice acting was great,even Pop sensation Katy Perry was great as Smurfette and I never knew that Kenan Thompson was in this movie I mean GOD that's the dude from that Kenan and Kel show. The transaction from the CGI Avatar like world to NYC was great.\n\nSure this movie is silly and a tad bit stupid,but hey its not a bad film to watch every once and a while.\n\n5/10"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Troy_Campbell",
        "review_rating": "",
        "review_title": "A steaming pile of smurf.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "erminahotmail",
        "review_rating": "7",
        "review_title": "Yogi Bear is much better",
        "review_detailed_main": "So let's continue the review of the films gone by cartoons now I'm the Smurfs then This film is based on a cartoon called The Smurfs and I won't even explain here Who the Smurfs are So this film The diabolical Gargamel has a plateau to take the magic of the Apple Smurfsit's always the usual cliché that the characters when our world or in New York these are always seen a lot of times in a bunch in other places they go to our world So what do I think of this film Well I know that all people say he's just one of theworst films that ever existed they say it's banal, obvious and very stupid But I want to tell you at least one thing But if you don't know This is a film for children what were you waiting for in a film like this a new Titanic Because in life it can't be all the films of the masterpieces must be acceptedas I am and this children's film came out very well for me so for now it's very good It's the CGI The one about the Smurfs isn't taken very well But you can stand seeing as this is a children's film and then the human characters smile too much sketches and then bad Gargamel for me is avillain made very well and I tell you this film is a thousand times better Yogi Bear because that film left me with nothing but boredom it's like that Smurfs no to conclude rating 7."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "marlop-35314",
        "review_rating": "1",
        "review_title": "Terrible, boring",
        "review_detailed_main": "I thought that garfield was the worst, but the smurfs was horrible\n\n110 millions for doing this?? wow\n\nmy little cousins fell asleep and I die of boredom"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "goeleakansh",
        "review_rating": "6",
        "review_title": "Not as bad people say in the reviews",
        "review_detailed_main": "It doesn't deserve all the 1 and 2 star ratings at all."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Monamai",
        "review_rating": "1",
        "review_title": "What a dissasmurfment",
        "review_detailed_main": "You got it all wrong. This was just the rehearsal. There is no other explanation. The whole movie felt more like 80s slapstick. Like there has been no development in comedy and humor in the last 30 years. I can only imagine, that the makers of this movie were meeting and saying something like this: \"Guys, we have bought the rights for Smurfs. It's a sure sell. Why risk anything at all to make something special? Let's do it the absolutely classic and trivial way, and everybody can go home with their pockets full. High five!\". The only special thing about this movie was, that even they had a lot of jokes, you didn't have one reason to feel entertained."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Enchorde",
        "review_rating": "6",
        "review_title": "Average family movie that actually keeps true to the Smurfs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "flipsy123456789",
        "review_rating": "2",
        "review_title": "Terrible, very bad",
        "review_detailed_main": "What a bad movie! Terrible script, bad jokes that might appeal to small kids, etc. The CGI was good, but that's about it.\n\nWhat i can't believe is that this film won over half a billion bucks. Why? I do not know. Kids? Families?\n\nThe acting is mediocre, even if it includes talented actors like Neil Patrick Harris. The voice-acting was One of the worst i have seen. Gargamel( Hank Azarias's character) was very cheesy and dull and not funny at all. He was a complete idiot.\n\nThe screenplay! Extremely predictable and lazy. The script made me wanna cry. Besides, why couldn't they just have made the movie in Smurfland or whatever instead of the real world. The movie would have probably been better!\n\nAnd the plot! Just bad. Cheesy, clichéd and really dumb. This movie will appeal to small kids, but parents and adults, please don't watch. Waste of time and money. So, in a nutshell, this movie had a dumb and cheesy plot, a screenplay and script that looks like it was made by a 5 year old, mediocre acting, terrible voices, jokes extremely bad, and a terrible premise.\n\nThe only good thing was the CGI."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "PosteLafayetteGav",
        "review_rating": "8",
        "review_title": "Perfect Gargamel",
        "review_detailed_main": "I am amazed that the average Mark for this film is so low. The film is very much made in the spirit of the cartoons and the live action mixed with cartoon special effects works really well. The key thing though is the performance of Hank Azaria as Gargamel. He is perfectly cast, a panto villain. I loved him. Doogie Howser is perfectly likable as is his screen wife. It's a nice film to watch, entertaining and surely ideal for young children. Unfairly ridiculed. It is really quite an old fashioned children's film and it is very colourful and with a lot of goodness. I think that maybe today's cynical world doesn't welcome something like this but that's a shame. If you want a nice easy to watch film for your innocent younger children then this is definitely for you or for adults who have never lost their inner child."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "aswathiwarrier-42555",
        "review_rating": "7",
        "review_title": "Once in a Blue Moon",
        "review_detailed_main": "This expression suddenly means something! Really well made simple movie. Enjoyed watching all the lovely moments. It's a feel good movie, definitely worth a watch. The little smurfs land in New York City due ti clumsy's clumsiness; loved Neil Patrick Harris and Katy Perry. How clumsy has the final say is also amazing!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ofpsmith",
        "review_rating": "4",
        "review_title": "Not funny.",
        "review_detailed_main": "I saw this at summer camp and I looked at my watch maybe 354 times. The story makes no sense, the jokes are not funny, the villain is a complete moron, the cat is on drugs, and the stupid running gag when these little abominations keep saying \"smurf\" makes me want to pull the hair out of my head. It was annoying, unfunny, the smurf characters were horrible, and the villain... what kind of stupid drugged moron is he? How did they get Jonathan Winters? Is must have been the same guy who got Abe Vigoda for Good Burger. Overall the film is not enjoyable. I was just waiting for the film to end the whole annoying time. Avoid this one."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Zulu42",
        "review_rating": "",
        "review_title": "Pretty bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "3",
        "review_title": "Smurf the makers of this mothersmurfin' film.",
        "review_detailed_main": "Once again Hollywood decides to extinguish anything creative about a franchise, and simply set it in our world. The Smurfs have a rich history, but here they are just fish out of water in New York. Yes, you have seen this film before. What's most annoying is that it starts promising. In the land of the Smurfs, with Gargamel even referring to the past by calling Smurfette a traitor, it seemed as though they would be faithful. This is soon dropped for terrible jokes, inexplicable pop culture references, and product placement. Sometimes they even combine all three. For example, The Smurfs hide next to an advertisement for The Blue Man Group, and later for Blu Ray Discs. HAHAHAHAHAHA Bloomin' HA. The pop culture jokes are just absurd. Sure, this is a kids film, so children are supposed to add up that Katy Perry is doing the voice of Smurfette and she just referenced one of her own songs. Are we supposed to think that these characters have seen Brokeback Mountain and Braveheart? It's great to see that Hollywood has a Scottish character that simply must yell out \"Freedom\". Braveheart is 15 years old for Christ's sake. It even has plot points that are suddenly dropped. Nothing comes of Gargamel de-ageing an elderly woman. Nor of him being in prison. He just gets out and wastes a few minutes of a lengthy running time. Neil Patrick Harris looks bored, but at least tries to insert some form of comedy. In the only decent parts of mixing our world with The Smurfs' he questions how they are named and why they continually use Smurf as a verb and an adjective. Stupid on all accounts. Though I did love Azrael and Azaria tried to do something with this tripe."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Kamurai25",
        "review_rating": "6",
        "review_title": "\"Beauty is Only Smurf Deep\"",
        "review_detailed_main": "Decent watch, probably won't watch again, but can recommend.\n\nI grew up watching The Smurfs, the CG Smurf animation is actually pretty good, but there is something about how they're personalized that rubs me the wrong way. Either the delivery is just different enough from the cartoon, or there is something about the Smurfs being in a modern world that I entirely disapprove of, or both.\n\nThis reminds me a lot of \"Yogi Bear\" where in a movie, the title character(s) should be the main focus and the most enjoyable characters. It might have actually worked against them to put Neil Patrick Harris and Jayma Mays in this. I don't think they \"upstaged\" the little blue creatures, but they were, by far, the best parts of this movie, and their story was strong enough it could have been a movie to its own...in fact, I'm sure if I looked hard enough, I could find a \"work is hard, I'm about to get fired, and we're about to have a baby\" movie.\n\nFor something as unique as the Smurfs, the movie puts a lot of money into it not being anything special. They could have saved a lot of money by making it a \"girl running from her angry boyfriend\" movie. They also have NPH specifically degrading the Smurfs for their general positivity in the same manner as the villain: this makes the audience villainize the lead protagonist in this movie, as the Smurfs are relegated to little than hostages in the human movie.\n\nNow, it's not to say that there isn't a certain level of charm to the Smurfs, but it's definitely not the Smurfs I remember, and having such a goofy villain is really all that saves the movie, and even then they go too far with some of the situations he is in."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "studioAT",
        "review_rating": "2",
        "review_title": "Nice attempt, but...",
        "review_detailed_main": "Cartoon characters ending up in the human world - hmm, sounds a bit like Disney's 'Enchanted' to me.\n\nBut no, this is 'The Smurfs', an attempt to bring the beloved Peyo characters into the 21st century, using the latest technology and big name voice cast.\n\nIt sort of works. Most of the voices are well chosen, and Hank Azaria is good fun, but all the jokes are variations, much like the story as outlined above, of things we've seen before.\n\nThe powers that be spend a lot of time saying how they didn't just go for obvious choices when selecting the voice talent, and yet they then go and cast Neil Patrick Harris as the male human lead. They should've searched harder, because for all his talents, he's lost here.\n\nThere is a sequel...which I shan't be watching."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "lamiaa-basyoni",
        "review_rating": "6",
        "review_title": "Wanna spend a nice time .. go for it :)",
        "review_detailed_main": "Remember the funny smurfs from your childhood, and their continuous running from the idiot evil wizard Gargamel and his cat!! Well, this is what you should expect from this movie, the only difference is that the chasing thing is not happening in the Enchanted Forest, but in NY instead, and a nice young couple gets involved in it. Trying to get back home, getting ride of Gargamel, and survive in the dangerous world of humans.. this is it!. Of course The 3D experience add lots of fun, and Gargamel was much more funny being a real person :)) So, if you wanna smurf your self with a smurfviously nice time. you go smurf it. It's a nice smurfing experience. you will smurf it :D"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ironhorse_iv",
        "review_rating": "4",
        "review_title": "La La La La La, this movie is so smurfing stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Thanos_Alfie",
        "review_rating": "6",
        "review_title": "Average movie...",
        "review_detailed_main": "\"The Smurfs\" is an Animation - Comedy movie in which we watch the tiny blue Smurfs coming in our world and especially in the middle of Central Park after the evil wizard Gargamel chases them out of their village. Now the Smurfs have to find their way back to their village before Gargamel tracks them and try to capture them for one more time. A lot of obstacles come in front and the Smurfs have to surpass them in order to return to their village.\n\nI have to admit that since I was a young boy I liked the Smurfs a lot so, I had high expectations from this movie and unfortunately, I was a bit disappointed by it. This movie is simply another average animation movie and nothing more, with a boring plot for even children and some very bad jokes. Despite that, I believe that Raja Gosnell did his best in the direction of this film but it was simply not enough. I liked the interpretations of Neil Patrick Harris who played as Patrick Winslow and Jayma Mays who played as Grace Winslow, and I think that they both did his best and reached their potentials.\n\nIn conclusion, I have to say that \"The Smurfs\" is an average movie and not so interesting. I believe that even children would be bored and wouldn't like it. So, I don't recommend anyone to watch this movie because I believe that you are going to waste your time and also your money. Even if you have children and you want to watch this movie with them, don't, because they won't enjoy it at all."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Horst_In_Translation",
        "review_rating": "4",
        "review_title": "A Clumsy effort",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "craig-158",
        "review_rating": "8",
        "review_title": "Much better than the reviews!",
        "review_detailed_main": "I just watched The Smurfs with my wife, my 10 year old son, and my 5 year old daughter and we all enjoyed the movie very much. I had promised to take my kids to see this after seeing the first preview several months ago and I was concerned with the poor ratings on IMDb and poor critic reviews. However, I have to say that I was pleasantly surprised at how good the film was. It had a good story line and was much funnier than I expected.\n\nThe live characters were cast very well with Hank Azaria playing a perfect Gargamel and the smurf voices were good as well, especially Jonathan Winters as Papa Smurf and Katy Perry as Smurfette (my daughter's favorite).\n\nBottom line, if you have small children or you were a fan of the cartoon growing up, you will enjoy this film."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Coco_2608",
        "review_rating": "7",
        "review_title": "A must watch, for the whole family",
        "review_detailed_main": "Imo this is a great family movie. Gutsy's accent is incredibly funny and always good for a laugh. Grunchy's sayings and comments are really appropriate. The slapstick humor and comedy absolutely get you. Papa Smurf is really accurate to the animated series and it's really interesting to see him in a world he has no idea about. Clumsy is a bit annoying but still cute and his chemistry with Grace is heartwarming. Brainy is also a bit annoying, but the film wouldn't work well without him. Patrick is my favorite character in the film, he is really funny, his jokes and sayings fit the action extremely well. His chemistry with the other \"dad\" is really cute, he and Grace are a really great couple. Patrick is also very caring towards the Smurfs and Grace. For me he is the scene stealer. Gargamel is pure comedy, and the way he and Azrael interact with each other is absolutely funny. He looks incredibly ridiculous, but he's still a good antagonist. The story is not an Tarantino like master piece, but still a great family movie. The ending and the final are good aswell, i always wished to find out about all the other smurfs in their village. I watch this movie once a year and its stil always fun.\n\n7/10 from me."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Mr-Fusion",
        "review_rating": "3",
        "review_title": "Really smurfed the pooch on this one",
        "review_detailed_main": "If \"The Smurfs\" has any faults (and it does), it's that the movie is split between theirs and the human world. Surely there's enough conflict between the little blue cretins and Gargamel that we don't need a whole dimension of human nonsense to prop this up. I think that's the real problem here: nothing works. Not the human actors and certainly not the humor - which is either meme or toilet-based, all of it forced. I've seen my share of cynical CGI kids movie in my time, but even by those standards, this is unwatchable. It sits over there on my shelf because my wife and daughter like it. But I can't get behind them on this.\n\n3/10"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "daffodilcrazy215",
        "review_rating": "",
        "review_title": "Smurf-ariffic!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "worldsworstwryter",
        "review_rating": "3",
        "review_title": "Holy Smurf.",
        "review_detailed_main": "Wow this was bad.\n\nIt's very inoffensive, but perhaps too much, to the point that it's just really bland and safe. We've heard all the jokes before, we've seen all the tropes before, the only new addition is using the word smurf over and over in different sentences without any coherent meaning. But that's not a good thing.\n\nSmall children might enjoy it, but honestly they deserve better entertainment than this. In fact, the same year this came out I can think of 3 far superior kids movies already.\n\nThe only slightly good thing about the movie was the sweet friendship between Smurfette and Grace. Everything else was just totally stale, like a slice of week old bread."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jhpstrydom",
        "review_rating": "6",
        "review_title": "Not a bad movie but did have a problem with two scenes.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "RECB3",
        "review_rating": "5",
        "review_title": "Alright First Instalment Film That Could Have Been Better",
        "review_detailed_main": "This is a good enough first instalment film for all viewers to watch. It seemed that the crew did not add enough effort nor strength when they were creating this film. The storyline of this film was a bit simple and weak. The cast selection was great enough. They did not exactly fully commit nor connect to the storyline nor to their respective characters. The chemistry between the cast members could have been stronger. This first instalment film reveals to viewers that everyone is completely different from each other. During my entire lifetime, I have always been different and I always have been mistreated for that. This is a fine first instalment film for everyone to watch."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Vergilya",
        "review_rating": "6",
        "review_title": "Still entertaining",
        "review_detailed_main": "Because of the bad reviews I avoided watching this movie for a very long time until today when I just felt like 'smurfing' around.\n\nIt was better than I expected and quite entertaining too. If you have watched the TV series before this movie has a little more substance than the usual run around between Gargamel and the smurfs.\n\nThere are a few very familiar faces here especially with the success of some TV series. And it's a pleasure to see them playing roles other than what we know them to be.\n\nWatch it without too much expectations and you may actually enjoy the banter, spoofs and self deprecation and have a smurfy time."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Hellmant",
        "review_rating": "5",
        "review_title": "Annoyingly cheery and full of cheesy jokes but that's to be expected.",
        "review_detailed_main": "'THE SMURFS': Two and a Half Stars (Out of Five)\n\nModern adaptation of the popular comic series created by Belgian cartoonist Peyo in 1958, which was also adapted in to a popular American Saturday morning cartoon show in 1981. The film is done in the popular CGI live action hybrid format that most mainstream kids' films are being turned out in these days and also capitalized on the 3D craze in theaters. It was written by J. David Stem, David N. Weiss, Jay Scherick and David Ronn and directed by Raja Gosnell (who also helmed two 'SCOOBY DOO' films, 'HOME ALONE 3', 'BIG MOMMA'S HOUSE' and 'BEVERLY HILLS CHIHUAHUA' to name a few other awful kid's films he's responsible for). The movie stars the likes of Neil Patrick Harris, Hank Azaria and Sofia Vergara (who's as gorgeous as ever). It's bad but no worse than expected really and is actually pretty faithful to it's source material. So big fans of 'THE SMURFS' shouldn't be disappointed; the movie delivers exactly what it promises.\n\nThe story of the film revolves around six Smurfs (Papa Smurf, Clumsy, Smurfette, Grouchy, Brainy and Gutsy) being sucked in to a vortex and thrown in to modern day New York City while trying to flee Gargamel (Azaria) and his cat Azrael back home in their village. They make friends with a married couple named Patrick (Harris) and Grace (Jayma Mays) and stay with them while Papa tries to figure out the spell (involving a blue moon) to get them home. Patrick and Grace are expecting their first child and Patrick is also dealing with a stressful new job promotion, under a domineering boss (Vergara), in which he has to come up with a successful add campaign in two days. The whole time the Smurfs must avoid Gargamel and Azrael who followed them through the vortex.\n\nThe movie is of course annoyingly cheery and full of cheesy jokes but that's to be expected. It's never really funny but neither was the original cartoon and it should make kids laugh. As far as I can remember it's pretty faithful to the cartoon with the exception of the addition of a new character, Gutsy, who doesn't make a lot of sense considering he's a Scottish character and none of the other Smurfs are ethnic specific. Azaria is well cast as Gargamel and does what he can with the role where as Harris kind of just phones in his performance. I really liked Vergara as the self centered businesswoman; she looks great and gives one of the stronger performances of the film (although I've been a fan of hers for a while, since well before 'MODERN FAMILY'). All in all the film is no better or worse than I expected; it's a waste of time for most viewers but should please small children and fans of the show. There's also, of course, positive messages including strong socialist ideals (like the original comic) and misfit characters (like Clumsy) overcoming weaknesses and finally feeling valued. It might be the best films of Raja's career!\n\nWatch our movie review show 'MOVIE TALK' at: http://www.youtube.com/watch?v=ioQaCI5Qk34"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "adamjohns-42575",
        "review_rating": "6",
        "review_title": "\"I'm Blue Dabadee Dabada!\"",
        "review_detailed_main": "The Smurfs (1) (2011) -\n\nI remember collecting the Smurf figurines from the petrol station and watching the cartoons back in the 80's, but not in any huge detail. As such I was fairly open going in to my first viewing of this film. Having now seen it and it's sequel, as well as the additional 'Smurfs: The Lost Village' (2017) film, I believe that the third effort would have been the best way to launch in to this reboot of the cute little blue fellas. This effort would then have made a more accessible sequel, without necessarily needing Gargamel (Hank Azaria), who could have been replaced by some psychotic New Yorker intent on capturing the Smurfs as part of a freak show or something.\n\nBecause I just didn't feel that there was enough time to establish and get to know the titular characters in their natural habitat before displacing them in Manhattan to cause mayhem and where they are followed by their nemesis and his cat Azriel(Frank Welker).\n\nWith that said, as a film in its own right and pretending that the characters weren't already well known it was quite fun and had some similarities to 'Disney's Enchanted' (2007).\n\nThe Smurfs were well produced by the CGI team and the specific ones that fell in to the special portal that lead to our own dangerous world, were a clever choice and variety that would keep most kids entertained.\n\nIt didn't quite have the class that the original cartoons did, because it was obviously made as a money making, merchandising and franchising idea and it was a typical attempt by Hollywood to make it action filled without sticking to the older formulas or Peyo's original tales, but it definitely shouldn't offend anyone. You could sit and watch it with your Granny or your Kids and not worry that anyone would get upset by it. They definitely wouldn't get scared.\n\nSadly, Hank Azaria lost a bit of my respect for his depiction of Gargamel though, which was akin to the cringey bad guys from films of the seventies and eighties or 'The Power Rangers' (1993). The delivery seemed tacky and amateur and a bit too stagey. I usually love him, but not for this.\n\nAzrael the cat was great however. They didn't overuse him and although his CGI could have been better at times, it wasn't \"Neville On The Broom\" bad.\n\nNeil Patrick Harris, as Patrick and Jayma Mayes playing Grace, did what was needed of them and actually Neil came over quite well, without being too exaggerated, as I've generally found him to be.\n\nWith regards to the voice cast, Anton Yelchin was perfectly cute as Clumsy and I still feel like we lost someone special with the actors passing.\n\nJonathan Winters was the right actor to play Papa Smurf and the majority of the others seemed appropriate in their roles too.\n\nI'm not sure that big names are always needed though. There are so many great voice actors out there that could probably do the work a lot cheaper to allow the budget to be spent elsewhere, maybe on Azrael's animation, that I feel that the celebrities are just a gimmick and only really for the parents, because the kids probably couldn't give two hoots whether Katy Perry voiced Smurfette or not. I suppose it brings the film to the adults attention when she appears on 'Graham Norton Show' (2007-) to talk about the film.\n\nI could watch it again, because it was an easy and simple film that didn't require too much brainpower, but it won't feature too highly on my list, because it didn't exactly push the boundaries of filmmaking and storytelling. I would however rather watch further instalments in the style of the 2017 animated film, because the style just lent itself to their world better and the characters, regardless of the production, will always be fun and cute.\n\n591.81/1000."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "MLDinTN",
        "review_rating": "5",
        "review_title": "more for kids",
        "review_detailed_main": "I can barely remember watching the Smurfs when I was a kid, so it's been many years since I've seen anything about them. They are back in this movie, but it's definitely geared for 10 year olds. In the movie, Clumsy gets sucked through a portal into present day New York City. 5 other smurfs follow to get him back, plus the evil wizard, Gargamel and his cat Azarel. There helped by a couple, Patrick and Grace, in order to get back to their world. So, there's some cute jokes, but like I said, it's more for kids. Gargamle and his cat was the best part, and they should of had him using more spells that lead to disaster. I liked how they used computer effects to give the cat crazy faces and expressions.\n\nFINAL VERDICT: If you are over 13, skip it."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "liudude_123",
        "review_rating": "8",
        "review_title": "Perfectly good children's film",
        "review_detailed_main": "I don't get what all the negativity was about. I watched Smurfs as a kid from 1984-1990, so I know the characters pretty well. I thought the movie was perfectly fine. The new smurfs were OK, fitting their role in the movie (though I didn't know why Hefty smurf couldn't serve the role of Gutsy smurf?).\n\nIn terms of the voices, most of them were fine, Brainy was good match (sufficiently nasally). Narrator smurf was a fine touch, though I originally thought he was Brainy because he's new and no one other smurf used to have glasses. The only voice I thought that didn't work so well was Papa smurf. Papa smurf had a more Santa style voice. Jonathan winters voice was a bit too muted. I know it's a stereotype, but there are some voices you associate with a papa smurf style beard, and Winters doesn't have it.\n\nGargamel was a highlight in the movie. Hank Azaria played a very convincing cartoon villain. Azrael was a little weak initially, but it worked better and better as the movie went on. I could believe that they had chemistry.\n\nIn terms of story, it's a simple story in the same vein as most smurf story lines. Gargamel finds smurf, smurf run away (to real world), smurfs find way to beat Gargamel (and go home with help of nice humans). The movie didn't take itself too seriously and I thought it was a nice touch to work in many of the classic questions about the smurfs (99 - 1 male/female ratio? how did they get their names, etc).\n\nNPH worked perfectly fine in the movie. Half the reason why I saw it was to watch him anyway (frankly, Smurfs wasn't really a part of my childhood that I felt I had to revisit). He was a good human character and had a good crisis for the movie to work through.\n\nIt's actually more of a 7.5, however, I felt that the film was unfairly bashed, so I rounded it up. I thought it was pretty enjoyable movie as long as you don't expect it to change your life or anything."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "EugeneOL",
        "review_rating": "2",
        "review_title": "Absolutely painful",
        "review_detailed_main": "This movie was so joyless and stupid. There is really not much that's worth trying to remember. It's almost as if their intention was to make a parody, but somewhere along the process, the whole \"parody\" aspect was ditched."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "fratzinok",
        "review_rating": "",
        "review_title": "What were you expecting??!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "florinachevaruf",
        "review_rating": "7",
        "review_title": "I don't get what the fuss about this movie it was smurfy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "The Smurfs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "sufyaanrashid95",
        "review_rating": "7",
        "review_title": "A Charming and Family-Friendly Adventure",
        "review_detailed_main": "\"The Smurfs\" is a delightful family movie that brings the beloved blue creatures to life on the big screen. The film follows the Smurfs as they are transported to modern-day New York City, where they must find a way back home before the evil wizard Gargamel captures them.\n\nThe movie boasts a talented cast, with Neil Patrick Harris and Jayma Mays bringing heart and humor to their roles as the human characters, and Hank Azaria delivering a scene-stealing performance as the villainous Gargamel. But it's the Smurfs themselves who steal the show, with their unique personalities and charming antics.\n\nVisually, the film is stunning, with the Smurfs seamlessly integrated into the live-action world. The special effects are impressive, with the Smurfs' blue skin and white hats looking as if they've jumped straight off the pages of a comic book.\n\nBut what really sets \"The Smurfs\" apart is its heart. The film explores themes of friendship, family, and the importance of staying true to oneself, all while maintaining a lighthearted and playful tone. There are plenty of laughs to be had, but also touching moments that will tug at your heartstrings.\n\nOverall, \"The Smurfs\" is a charming and entertaining movie that is perfect for the whole family. Whether you're a longtime fan of the franchise or new to the world of the Smurfs, this film is sure to leave you with a smile on your face."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "robyn-710-767167",
        "review_rating": "5",
        "review_title": "Bleh...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "nickmesafilms",
        "review_rating": "6",
        "review_title": "The Smurfs (2011) - This Movie is Smurfin' Complicated!",
        "review_detailed_main": "The adaptation of the classic cartoon comics by Peyo, \"The Smurfs\", appears on the big screen with a surprise $500 million dollars at the box office. The story tells of the Smurfs being transported to New York City, after trying to escape the clutches of the evil sorcerer Gargamel, portrayed by Hank Azaria. Then, they end up staying under the roof of Neil Patrick Harris and Jayma Mays as a married couple living the suburban life. The Smurfs must find a way to get back home, before being captured by Gargamel. \"The Smurfs\" is the type of movie where anyone of different ages can have different opinions. This could be a fun and exciting movie for the kids, when at the same time, it's a dull and childish movie for adults. I seem to have a mixed reaction to that. \"The Smurfs\" is somewhat of an entertaining film. Hank Azaria is talented for his portrayal of Gargamel, and Neil Patrick Harris delivers some talent as the \"straight\" character. The animation to create the Smurfs looked good, and the voice cast was pretty pleasant, especially Katy Perry as Smurfette. But at the same time, this isn't like an \"excellent\" movie. This movie has it's moments of mishaps. This might be too dull and idiotic for anyone older than the age of 18. But this can also be a sweet and innocent film for kids. It has some family friendly laughs, but it's too careless for adults. If kids and adults had to rate this movie, the kids would give it a 10 out of 10, and the adults would give it a 4 out of 10. So, I have to say that \"The Smurfs\" is a cute and sweet family film for it's younger audiences, but it's not entertaining for the more older kids in the family. \"The Smurfs\", in my review, \"fun for the kids, dumb for the adults\"."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "kino1969",
        "review_rating": "5",
        "review_title": "Not Good. Just Nothing Original or Interesting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "carlypi",
        "review_rating": "9",
        "review_title": "Adorable, Funny and Nostalgic",
        "review_detailed_main": "I don't have any children of my own, but I am a big child myself. Born in the 80s and having grown up watching The Smurfs cartoon on television I was really looking forward to seeing The Smurfs on the big screen and for me it didn't disappoint.\n\nThis movie has got so many awful reviews but let's be honest, it was never going to win an Oscar but it can win the hearts of people who want to enjoy a lighthearted movie with silly giggles along the way.\n\nThe Smurfs stayed true to their cute and happy selves throughout, and the voices of the characters were extremely well suited, especially Jonathan Winters playing Papa Smurf and Katy Perry as Smurfette.\n\nI had a lot of fun watching this movie and would definitely recommend it."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "mitsubishizero",
        "review_rating": "7",
        "review_title": "I enjoyed it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "alexfromhorn",
        "review_rating": "5",
        "review_title": "Disaster for fans but all in all an average movie.",
        "review_detailed_main": "What I liked about this movie: Azrael: The cat sometimes looked so realistic it was hard to tell if animated or not and sometimes it was clearly animated, maybe they used a real cat and animations or maybe only animations I don't't know. But also Azraels behavior was like in the cartoon I liked that. Finished it: Somehow I finished this movie without turning it off and I'm not sure why. Problems I had with this movie: Gargamel: He was too comic-like in his behavior although all other humans appeared to be quite normal, that makes him unrealistic somehow or someone who takes too many drugs or whatever. It's always a problem to take someone young and make him look old, it looks totally fake. His face modifications also looked clearly fake. Scottish Smurf: The strong Smurf, I forgot his name was replaced with the Scottish Smurf who I think never appeared in the cartoon series. Buf even if not he was just annoying. Language: Gargamel and the Smurfs used different words than usual, they tried to imitate the way they talked but it didn't work out. Also there were quite a lot of unfunny oversmurfed cursings that were also annoying because it was always clear what it was really supposed to mean and not appropriate for young audiences. The Smurfs: They didn't look real, their skin, their hair, their eyes it all looked like some kind of clay figures which made them unrealistic. Setting: In the beginning when they were back in their times it looked all very fine and nice and that was totally OK but than to set the whole plot in modern day New York felt like an incredibly uncreative smack in the face of all who loved the smurfs. The Smurfs rapped: What I can say about that, you can see them rap ... The grumpy Smurf: he was not really grumpy or anything which made him unnecessary because he never started a sentence with \"I hate...\" Self-reference: They find themselves being comic-characters ... and they don't bother to explain this. Plot: The plot was weak and there was no message that this movie had like the cartoon series did, every episode had some kind of message like \"don't do this or that because this or that could happen, always treat others well or bla ...\" this movie didn't have that which made it even less valuable.\n\nWell all in all if you look at it just as a movie without it's big back-story of cartoons and comics this movie is average entertainment. For fans of the Smurfs this movie is a disaster."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "rannynm",
        "review_rating": "",
        "review_title": "Kids, Even Older Ones Enjoyed This Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "southdavid",
        "review_rating": "5",
        "review_title": "A bit to Smurf for my Smurf.",
        "review_detailed_main": "Another film watched for the \"How Did This Get Made\" podcast, I was disappointed that I found the film to be mildly bland, rather than dramatically inept.\n\nPursued by the villainous Gargamel (Hank Azaria) a group of Smurfs are transported from their mythical land to present day New York City. As Gargamel continues his evil quest in this strange new world, The Smurfs fall into the lives of advertising executive Patrick (Neil Patrick Harris), who is about to open his most high-profile campaign yet, and whose wife, Grace (Jayma Mays) is pregnant. As the group try and find a way to get home, Patrick tries to decide what's most important to him.\n\nLike I say, blandly, inoffensively, competent are my overall thoughts about \"The Smurfs\". The story makes enough sense to get me through it. The performances are. . . Fine, from the actual human actors anyway. Hank Azaria is game as the film's villain and his interactions with his cat were occasionally reasonably funny. Harris and Mays are fine, even if their stock characters for this sort of fantasy film - seriously, why are so many of these films about advertising executives! The CGI work is OK - I didn't hate the design of the Smurfs as much as some other reviewers have.\n\nI would say that I disliked that the voices of The Smurfs were, almost without exception, just the voice of the person they hired and the only one that wasn't quite, Alan Cumming, was just doing the Mike Myers Scottish voice. We're still not at the point that the wider world seems to appreciate that there's a skill to vocal work and just hiring George Lopez, to come and talk like George Lopez isn't enough. I would also say that it falls into a trap that a lot of animated movies do, of using contemporary references for a cheap laugh, nothing will date a film faster than those.\n\nAgain, it's not a horrendous film, not at all - I was watching with my son, who is 10, and he seemed to reasonably enjoy it and he's the target audience, not a cynical old monster like me. Enough money was spent on it the endeavour that it's capable enough. Never again though."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "sandtonvideo",
        "review_rating": "5",
        "review_title": "I Kissed a Smurf (and It Was Only OK)",
        "review_detailed_main": "A host of recognizable television series faces share the screen with those newly-CGI characters: the lovably aggravating Smurfs. For those who don't know, Smurfs are little blue human-like creatures that stand \"3 apples high\" (I wonder if that means the GM Golden Delicious monstrosities, or petite little all-natural Granny Smiths?). They are happy. Very happy. And they sing when they are happy. Which is nearly always. And they seem to know only one song. ARRGH!! This might explain the antipathy that the evil wizard Gargamel (disappointingly portrayed in a way over-the-top performance by Hank Azaria) feels towards the Smurfs. Also, Smurf essence seems to have some sort of cosmic energy magic qualities, and Gargamel would like to capture all the Smurfs to harness this Smurf essence to make himself the most powerful wizard ever. Whatever.\n\nWhen Clumsy, the Smurf who is, well, clumsy accidentally reveals the location of the hidden Smurf village to Gargamel and his cat familiar, a small group of Smurfs will be sucked through a portal (under the influence of the mystical \"blue moon\") to Central Park in New York City. But Gargamel is so close to his life's ambition that he risks following them through the portal, and the cosmic battle between the forces of Blueness and Ham Acting, sorry, I meant Evil, will continue in the Big Apple.\n\nIt is there that the Smurfs encounter Patrick, a man with a pregnant wife and a erratic, volatile boss who has just promoted him, but will fire him if he doesn't come up with a brilliant idea for a marketing campaign to promote a line of cosmetics products. The Smurfs take refuge with Patrick, and prove to be a distraction (especially when they are singing their one and only song), until finally Patrick loses it and yells, \"I don't want a bunch of little people running around the house!\". His pregnant wife Grace fixes him with a doe-eyed stare (Grace is played by Jayma Mays from GLEE, whose naturally doe-eyed look provoked one of the GLEE characters to remark once when completely drunk, \"I cried when they shot your mother, Bambi\" before vomiting on her feet), and Patrick realizes he has some serious thinking to do about the nature of family and commitment to loving your family through thick-and-then, even if it's not convenient for your career (and even when they sing). Naturally, because he's a good guy, he will come to his senses and help the Smurfs in their efforts to try and defeat Gargamel and figure out how to reopen the portal and return to Smurf-Land (although I'm not entirely sure where that is).\n\nNow, to be serious for a moment, the film is well-constructed technically, the actors do pretty well with pretty inane material (with the exception of Azaria), and there ARE some funny moments. But the film is ponderous in setting up the main action in the beginning, and might lose some young viewers there, and feels padded, as if there were an idea for a Smurf movie, but when the original idea was fleshed out into a script, it only took up only 45 minutes of time, so another 45 minutes of plot-superfluous cuteness were added on: a scene in a toy store where Smurfs are mistaken for toys, a scene where Patrick and the Smurfs bond while playing Guitar Hero. Drum Hero, etc...(product placement there, Sony?), a scene where...well, you get the idea. But the movie picks up steam as it goes along, and ends up better than it starts. The major drawback: the movie may be too plot heavy for younger children, and too silly for older children and parents. But then I have to confess I never understood the attraction of the Smurfs in the first place, so perhaps children will be so in love with the cute Blueness that is the Smurfs that considerations like plot and pace simply don't matter.\n\nMy suggestion is that if your children vociferously clamor to see the film, then they are already under the spell of the Smurf's single happy song, and they'll probably like the movie no matter what. But if they don't clamor, you don't have to push them to see it, and neither do you need to see it, either. Oh, and Katy Perry voices Smurfette to no particular effect, hence the title of the review..."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "4",
        "review_title": "Disappointing, but does have its merits",
        "review_detailed_main": "I am a big fan of The Smurfs, so I was all for seeing this movie, though I was dubious as well. The Smurfs does have its merits, but is rather disappointing too. I will talk about the merits first, while not outstanding the 3D is quite good(I've seen far worse), Hank Azaria is perfect as Gargamel, Jonathan Winters successfully manages to make Papa Smurf the most lively of all the smurfs and Neil Patrick Harris gives a comedic grace to an otherwise banal role. Feelings on the music were mixed, nice and jaunty but forgettable soon after. The editing could have been tighter also. What I didn't like so much about the film was the predictable and rather thin story, the clumsy writing and jokes(including one inappropriate Marilyn Monroe allusion), the rushed pace and that apart from Papa, Gargamel and perhaps Smurfette(though I wasn't entirely sure whether I liked Katy Perry or not, my guess is sometimes yes sometimes no, and I liked how they explained why there was one female smurf character) the characters aren't developed enough or given enough personality to make them properly interesting. In conclusion, has its merits but not recommended. 4/10 Bethany Cox"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "juliamariegallo",
        "review_rating": "4",
        "review_title": "Smurfs - Blue Made-Up Family TV for a not so Cool Life.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "SuzanneMakingReviews",
        "review_rating": "10",
        "review_title": "Great movie... Unfair reviews and rating..",
        "review_detailed_main": "It is a great simple movie, and I was surprised by the reviews and the rating. I mean how couldn't you \"love\" those little cute blue people? I mean, for who reviewed earlier, have you even watched the series of the Smurfs? Everybody, actors and actress were great, the voices were perfect. What did you expect? It is not Harry potter or twilight or any love or horror movie, it is just a movie that I consider it of the few films that just talk about giving, loving and simplicity The real sham is the rating, the movie was perfect: good actors, good voices, good plot and great 3D graphics, the only thing wrong is that people want \"complicated movie\" .\n\nPeople it worth to see it, it is a great movie, and I guarantee you will just get in-love with the movie and the characters, enjoy it ."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "MB-reviewer185",
        "review_rating": "5",
        "review_title": "Little blue people",
        "review_detailed_main": "It's not really that funny and some of the jokes were cringey with hard to watch moments.\n\nThe smurfs looked real enough but I know they are CGI, the only good thing in this is that I liked was Neil Patrick Harris.\n\nBecause Neil Patrick Harris is a good actor."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "tapsmiled",
        "review_rating": "",
        "review_title": "Are you people insane?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "p-28711",
        "review_rating": "2",
        "review_title": "A cynical cashgrab",
        "review_detailed_main": "It's disgusting how much use of product placement is there! The story is super predictable (a bunch of creatures who go into a human city to avoid a villain and don't understand their ways.) The Smurfs themselves are irritating as hell: moving like they're on Red Bull. A horribly executed message of putting other family before work. Work means people earn money to support their families. This plotline has also been done so many times. Even the characters are not just annoying but they are boring as hell and poorly written. The humor is also so desperate and annoying. This movie has no passion."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "capone666",
        "review_rating": "5",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "The Smurfs\n\nThe upside to old cartoons being adapted into Hollywood movies is that adults who watched them in the '80s can sleep through them in the 2000s.\n\nHowever, dozing around the blue-hued imps in this family movie could result in eggs being laid in your belly.\n\nA miniature race of azure anomalies is endangered when a sorcerer, Gargamel (Hank Azaria), discovers their village.\n\nDuring the invasion, their leader Papa Smurf (Jonathan Winters) and others (Kathy Perry, Anton Yelchin, Fred Armisen, Alan Cumming, George Lopez) are transported to modern-day New York.\n\nNow, along with their new human friends (Neil Patrick Harris, Jayma Mays), they must stop Gargamel from gaining untold powers.\n\nBased on the Saturday morning cartoon, The Smurfs stay true to their character designs. But fall short when it comes to an engaging adventure.\n\nBesides, the only thing that should be re-visiting Americans from the 1980s right now should be Reaganomics. (Yellow Light)"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "The Smurfs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Sweet_Honey_Iced_tea",
        "review_rating": "3",
        "review_title": "So smurfing bad!",
        "review_detailed_main": "I thought I was done. I thought the nightmare of cartoon characters from the 20th century becoming Cgi abominations in live action New York City was finally over. But then this smurfing abomination of a film is has no self awareness, no continuity, no passion, no sponteneity, no intrigue, nothing of interest to the audience. The only reason I'm not giving this piece of smurf a zero out of 10 is because it's pretty ironically funny, otherwise? Nothing. Just pure phoned in merchandisable trash suitable for no one over 5 but under drinking age.\n\nThis is a smurfing nigtmare, if you watch it, don't say I warned you!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "thosefries",
        "review_rating": "9",
        "review_title": "So Funny!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "gamecraftvlogs",
        "review_rating": "4",
        "review_title": "I'm going to smurf myself",
        "review_detailed_main": "This movie is so unbelievably atrocious, especially that little nerd with the glasses. He makes the movie so so horribly created, with his scratchy voice and Zero skill to use humor. If I could smurf any of them he would be the first. The plot is horrendous and Gargamel has no motive to be smurfing these Smurfs, which makes it so hard to see why he wants to torture these little twits. If that nerdy guy wasn't in the movie, it would be at least 2.5 instead of 1. That nerdy little thing makes me want to Smurf myself in many ways, including with a few weapons. Gargamel is slightly funny and is the only semi decent character."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "christine_a_daae",
        "review_rating": "",
        "review_title": "Smurfs movie of 2011",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "thegreat_rulz",
        "review_rating": "5",
        "review_title": "I did not know animation movies were custom crafted for children anymore! Alas!",
        "review_detailed_main": "The blue, almost cuddly smurfs of smurf-land are chased upon by an evil wizard Gargamel and by chance they enter into our world, in NYC's central Park's water through a magical vortex. What follows next is how they escape Gargamel's chase and them trying to find their way back to their magical land. With the smurf 'Clumsy' trying to prove himself a 'Hero' with Papa-smurf, Surffette and others. Cute white loined characters each named after their specialty!\n\nNot much about the movie is good but the comic lovers might just like it like a smurf. Gosnell's direction is too weak and screenplay bland. The movie is so made for kids but the fact that every beep word is smurf-ed over and two brief kissing scenes means even they 'd left awed.\n\nEmotions: Throughout-the-movie-joy, care-free, love, responsibility. Hither-tither-casual wisdom.\n\nConclusion/Who should watch it: The young member of your family might even mature after 103 minutes of runtime. 2 year olds and lesser and people who wish to parental guide them. And if you really like to watch these blue characters this weekends, then you might also consider fascinating about Cameron's sequels to Avatar."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "Keep the Smurfs in Smurf Village",
        "review_detailed_main": "Goodness this movie was awful and I think it all spanned from the Smurfs leaving the Smurf village. I loved the Smurfs as a kid--when they were a cartoon and not in New York. Now that they are a CGI creation in a live action world they are so appallingly terrible.\n\nSomehow six smurfs: Papa Smurf (Jonathan Winters), Smurfette (Katy Perry), Gutsy (Alan Cumming), Brainy (Fred Armisen), Grouchy (George Lopez), and Clumsy (Anton Yelchin), were teleported to New York City with Gargamel (Hank Azaria) close behind them. They found themselves under the care of an up and coming ad exec named Patrick (Neil Patrick Harris). Everything that occurred afterward was painfully predictable and fantastically unfunny.\n\nThe first thing that happens when a strange creature enters a person's life is a comedy of errors. Everything goes famously wrong upon first encounter. See \"Alvin and the Chipmunks,\" \" Hop,\" \"Mr. Popper's Penguins,\" or any number of comedies involving a creature and humans.\n\nAfter the series of good intentioned faux pas comes the friendship, then a trial, then the resolution. \"Smurfs\" followed the formula to the T. Throw in some sap and a universal truth or two and you have a movie."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Mysterygeneration",
        "review_rating": "5",
        "review_title": "Blue Magic Unleashed",
        "review_detailed_main": "A popular animation series, The Smurfs, has hilariously made the leap from cartoon to big screen, fusing animated and live-action elements. The movie brings humor and the spirit of the adored characters to contemporary New York City, where the Smurfs are brought to life. For families looking for a little nostalgic cartoon escape, it's a fun watch because of its lively graphics, lovable characters, and sincere heart-even though the plot is predictable and the humor could be more appropriate for a younger age. For families looking for a little animated escape, the film is entertaining to watch because to its colorful images and lovable characters."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "melimelo-3",
        "review_rating": "9",
        "review_title": "Very cute",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Josephpr1990",
        "review_rating": "4",
        "review_title": "OK but not very good",
        "review_detailed_main": "I remember saw this at Cineworld Dublin in August 2011. I thought I found it very entertaining and funny but it's not very good as the comic strip series and cartoon TV programmes especially the one was made by Hanna-Barbera.\n\nIt's kinda dull and mediocre.\n\nIt doesn't even make any sense at all.\n\nI don't know why there are many bad live action films based on popular cartoons (such as The Flintstones, Yogi Bear, Garfield, Scooby-Doo, Teenage Mutant Ninja Turtles, Rocky and Bullwinkle, Mr. Magoo, Casper and even some Disney classics) have been made. I'm sure those franchises have already been ruined.\n\nGo and watch the 1980s cartoon version of The Smurfs instead."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Moviefanstar",
        "review_rating": "10",
        "review_title": "I smurf-ed loved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "aryanous",
        "review_rating": "10",
        "review_title": "So Many negative votes wonder how many actually saw the animated series",
        "review_detailed_main": "The movie is great.. Hank Azaria did an excellent job as Garbage Smell lol.. err Gargamel... love Azrael talking..\n\nThis movie is not for a 5 year old nor for anybody who did not saw the series and understood move the antics that the smurfs involved.. it really made me feel going back to my childhood waiting for 5pm for the smurf broadcast seem all episodes and never got tired of re-runs..\n\nIs unfair to say the movie stinks when this movie is just a continuation of their adventures not like the many fail action live movies of many cartoons changing the original story... in this movie the original story of the smurfs is intact.. is just a great new adventure..\n\nLOVE IT SPECIALLY AZRAEL CUTE EVIL KITTY..."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ItsYourMomma",
        "review_rating": "10",
        "review_title": "Funniest Movie EVER!",
        "review_detailed_main": "This movie is extremely funny and it makes people want to watch it all day. I was laughing every time Azrael the Cat talks to Gargamel, laughs at something, and he is also adorable. My favorite Smurf is Smurfette. Why? Because she was voiced by my hero, my role model, my favorite celebrity, Katy Perry. Not only that, she's really funny at sometimes, like when she flipped Gargamel off behind his back (I think she flipped him off, it could've been the \"I'm watching you\" action). Also I was laughing hard when Clumsy burped out bubbles, Grouchy shouted \"Hey! I'm walking here!\", and when Jokey's present exploded on him. So a 10/10 would be the perfect rating to give it."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "br2000",
        "review_rating": "10",
        "review_title": "great",
        "review_detailed_main": "the 3d was awesome and it jumped out of the screen once and a while the story and the plot was good too. but the smurfs made the movie so i give the smurfs an amazing 10 stars.some people hate this movie on the other hand I love it . it is unique and gives off its own good vibe.Gargamel makes the movie whether getting hit by a bus or flying over central park he will never get the smurfs.Patrick and Emily also play a big part in the smurfs because they also help make this movie special and happy.so you should definitely definitely watch this true blue 3-d mega hit rock on awesome smurfs.also watch this with real d glasses smurf out."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "rhohmann123",
        "review_rating": "10",
        "review_title": "Not a Hater",
        "review_detailed_main": "It's the SMURFS!! obviously not a movie looking for Oscar nominations. Come on haters, why would you go see a movie you know you are going to hate just to complain about it?? Its just meant to be a fun movie about little blue smurfs, who could hate that. I do not know what the haters were thinking they were going to see when they went, but it was Exactly what I thought it was going to be. A fun light hearted movie about Smurfs. I was not there to pick it apart, I was there to relax and enjoy. If you go in knowing you are going to hate it then why go? If you were going to the Smurfs for a riveting Oscar winning performance then u just are not very smart I guess."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ken-mcconaghy",
        "review_rating": "10",
        "review_title": "I smurfing well loved it!",
        "review_detailed_main": "I'm a HUGE fan of kids films - the escapism value is excellent and much superior to other non child friendly films... I should also point out that I'm 31 so it can get a little embarrassing going to the cinema to see them. However, after the first few minutes of this film I was captivated by the little blue guys (and girl). Such a funny film!\n\nI went in with very low expectations - but my brother had recommended it to me (I was a fan of The Smurfs And The Magic Flute when I was growing up - drove my parents crazy because I wanted it on ALL THE TIME!!!) I'm a fan of The Smurfs and have been for a long time... But a big screen movie? Was that really going to work? Damn right it was going to work!\n\nWhat they've done with this film is kept faithful to the original series. The casting of Hank Azaria as Gargamel is legendary - I can't believe anyone else being this good in the role. He's very funny (albeit not very mature), camp and down right lovably nasty.\n\nThe Smurfs themselves are endearing and very cute - by the time the film has finished I wanted my very own Smurf. Where do you get them from? I'll have to consult with Gargamel so I can get one for myself.\n\nThe story is, well okay it's not very original... But it is handled well.\n\nIf anything then this film is a little too saccharine. But I like sweet stuff so that's okay. I urge you to see this film and keep an open mind ."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jaemiewaters",
        "review_rating": "10",
        "review_title": "best movie and best 3D movie",
        "review_detailed_main": "it is one of the best movies and one of the best 3D movies you will enjoy watching this amazing movie it is a super movie it is the perfect family film this is the best animated movie you and your family will enjoy this laugh out loud movie i never saw a movie like this if you like the Smurfs than you will enjoy this movie it is a blast i think this is one of the best movies ever made this is one amazing movie this movie is OK for the kids this is one sweet movie when i went to watch this movie i never laugh that hard in a movie this is a movie that will be more famous the later one in the year it is one of the best 3D movies i never saw a 3D movie like this you will say wow lets watch that again you just have to watch this amazing movie it is a must see for sure it is a funny funny movie it is one of the best family movies ever made it is a amazing movie have a great day everyone"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "RoxHB",
        "review_rating": "10",
        "review_title": "THE SMURFS film is pure smurf-magic!",
        "review_detailed_main": "Director Raja Gosnell brings to life Pierre Culliford \"Peyo\" delightful characters in this charming animated/live-action film. The film is the best mixture of animation and reality that I've seen. Gosnell masterfully captures the world of cartoons and breathes \"real\" life into it with witty dialog, great situational comedy, dazzling color and most of all funny, endearing and brave characters.\n\nHank Azaria performance as Gargamel, the evil wizard, is pure genius! He is the perfect embodiment of a cartoon character; such that his performance seamless blends \u0085 weather in the make-believe land of Smurf Village or in the real life New York City. Arazia's energy explodes onto the screen and like all \"villian\" cartoon characters, perfectly balances his evilness with comedy. And just like in the cartoons, he never gets hurt, even when a huge bus runs him over! The film makes great use of cartoon physics and has a natural sense of comedic timing, resulting in a funny story.\n\nThe Smurfs are brought to life by the voices of the great Jonathan Winters, as Papa Smurf; Katy Perry as Smurfette; George Lopez as Grouchy Smurf; Gary Basaraba as Hefty Smurf; John Oliver as Vanity Smurf; and Alan Cumming as Gutsy Smurf.\n\nIt is a story that will touch you heart, through a simple tale of love, loyalty and a family who realizes what matters most in life."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "brosello",
        "review_rating": "8",
        "review_title": "Pretty Good Movie",
        "review_detailed_main": "Come on folks this is a kids movie. Why is everyone over analyzing this? I thought it was very entertaining and fun. I do agree though that the voices could have been better though. Kids will love the movie, I know mine did. I recall many people criticizing Shrek too. If you are young at heart go see this. If you tend to nit pick movies then this movie is not for you. Gargamel did an excellent job in this movie. I really loved the actor's interpretation. I thought some of the jokes were good though some of them were a bit cheesy. Had it not been for the voices I would have given this movie a bit more. Appearing in New York seemed predictable as most movies end up or take place in New York."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "Perfect Family Fun!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "DarkVulcan29",
        "review_rating": "8",
        "review_title": "The famed blue cartoon characters come to the big screen.",
        "review_detailed_main": "The Smurfs is funnier than Yogi Bear, because Yogi Bear was trying to act funny, rather than just be funny, but The Smurfs knew when to be funny at the right moments, it also has adult jokes than can go over the kids head, except one adult joke I felt was not needed. But non the less it was still an entertaining film.\n\nThe CGI Smurfs are pretty fun to watch. So was Hank Azaria as Gargamal, he quite the scene stealer, he just really gets into the role. Neil Patrick Harris is also good in his role, not overly being funny, but he is funny at the right moments. it also has incredible effects, the best since Garfield and Alvin and The Chipmunks."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "rjfwalker",
        "review_rating": "10",
        "review_title": "Very impressed",
        "review_detailed_main": "Went to a screening yesterday and I was mightily impressed, Incredible 3D, it had a very good storyline that appeals to both young and old. Great voice casting that includes Katy Perry who even sang I kissed a smurf and I liked it!, funny jokes, good references to the old series. I wasn't expecting much , but a lot of time and effort has gone into the detail on this film, i guess that is why it took so long to get to the cinema. New York is a perfect location, Gargamel ( Hank Azaria) plays his part beautifully , Azrael is a fantastic mixture of real life and comedy animation.. ..sure it will do really well. i think we can expect to see sequels coming soon, well i hope so. Well done!!!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "go-to",
        "review_rating": "8",
        "review_title": "My 6 year old daughter laughed lots",
        "review_detailed_main": "In short simple, silly and amusing.\n\nToo many of the reviews I read are clearly disappointed adults (or meant to be adults) who seem to be judging this film as if it were the latest big movie with a cast of elite actors. It's a kids film and my daughter laughed enough for it to have been worth every penny and I laughed a lot too.\n\nThe animation's not perfect. The mix of it with the people doesn't fit perfectly. Me I liked that there's a bad guy and good guys and it's a nice clear split without all the ambiguous shades of grey that too many kids titles get populated with. It doesn't try hard at being anything but a smurf story which I also like.\n\nI've been over generous with an 8 because I think too many people have been too unfair at the other end. Properly a 7."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "theyseemaxrolling",
        "review_rating": "9",
        "review_title": "The Smurfs is AMAZING",
        "review_detailed_main": "The smurfs is an amazing and spectacular movie that can be watched as from a little kid, and even to big kids!The plot starts when the evil wizard Gargamel tries to capture all smurfs to end all their kind,by opening up a portal, but the smurfs don't go with out putting up a fight. The fight is enlightening and very amusing. Sequence of events rise and eagerness is then followed by the audience. This movie is an amazing movie i strictly recommend it to parents of any age or even teenagers or young adults. I rate this movie 9 out of 10 stars because it doesn't leave me or it wont leave any one or any age disappointed. The graphics are amazing and the way the directer interpreted the smurfs with humans and a man made environment is astonishing and this movie if a definitely must see movie. :D"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "bjholt75",
        "review_rating": "",
        "review_title": "...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "celestialbaby23",
        "review_rating": "8",
        "review_title": "Very cute.",
        "review_detailed_main": "Funny, cute and sweet, Just like the cartoons growing up. Loved it."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "j-76675",
        "review_rating": "10",
        "review_title": "Cinematic masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "soporific",
        "review_rating": "9",
        "review_title": "Help save this movie's IMDb score! It is a solid 7 at least...",
        "review_detailed_main": "I've seen this twice now and I really can't fathom the hatred for this smurfy reboot into reality that is The Smurfs. It can only be outrage that the movie wasn't pure animation and totally faithful to exactly what many of us grew up with, but the most tragic thing in terms of the IMDb score is that it IS faithful to the original!\n\nThe adorable little blue and white bundles of joy spend most of the film singing or humming their theme song but it's never overdone and their attitude to life absolutely perfectly spot on and faithful to the original.\n\nI've gone through some of the most-voted comments and am dismayed by the amount of irrationality displayed and the absence of objectivity. In terms of the plot, I'm not sure what more you all expected the writers to come up with to cover the intended age-range of the audience, but I was happy enough and the movie pushed all the right buttons. It's more of a kids film, sure, but there's more than enough to keep adults happy.\n\nI thoroughly enjoyed watching it each time and am choosing my time carefully to show it to my 5 yr old kid. I'll probably add it to his movie list for 8 yr olds.\n\nI'm glad the lowish IMDb score didn't discourage them making a sequel, but I wish it wasn't so far out of whack! I would normally give this an 8 but it's 9 as a protest vote at the score.\n\nWatch this film and see for yourself. And then don't forget to vote!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "arica434",
        "review_rating": "10",
        "review_title": "My family enjoyed it!",
        "review_detailed_main": "My expectations were not good so I went in expecting to be let down but surprisingly I wasn't. I'm 36 and took my children who are 14, 10, and 3 and my sister is 29 and she took her 10 y/o son. Obviously my sister and I grew up on this cartoon but the kids had never even heard of a smurf. There was a tad bit of crude humor for the adults but overall the film kept my attention as some movies I take my children to don't and I laughed quite a bit. My sister, who reminds me of Brainy smurf in every way laughed more than I did so that should say something. She's overly critical of movies and she liked it. My teenager is at that hard-to-please stage and even she enjoyed it. The younger kids had a blast and considering it was the Smurfs, I think they did a great job. George Lopez was hilarious! And azriel the cat was too funny. Some ppl need to lighten up on these critiques. Of course it's their opinion but they act like it should have had Academy-award winning performances...its The Smurfs! Lol! It probably didn't deserve the 10 I gave it but I had to help the overall rating some b/c it's abysmal. I think it's a 7."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "skullislandsurferdotcom",
        "review_rating": "",
        "review_title": "Blue Moan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "TheOtakuX",
        "review_rating": "8",
        "review_title": "Best movie of the year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Clif-3",
        "review_rating": "",
        "review_title": "Good, Happy Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "taliesin-8",
        "review_rating": "9",
        "review_title": "I liked it and so did my two daughters.",
        "review_detailed_main": "This is a movie aimed for children. However, I, as a parent, also enjoyed it. Some of it was pretty standard (insert CGI character fart joke here) but there were also some very touching moments in it - specially if you are a dad.\n\nGo see it with your kids.\n\nOn the other hand, if you are a male teenager with ADHD, skip it and go see something else, WITH EXPLOSIONS.\n\nSome people have been posting very negative reviews, and honestly, this movie doesn't deserve all the bad rap it's getting. It's no Avatar or Citizen Kane, but, come on, relax and enjoy it. I was a smurfs fan when I was a kid, and I liked to see a lot of the elements of the comics brought onto the big screen."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "facebook-124-955845",
        "review_rating": "",
        "review_title": "Its the Smurfs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "samanthamunevar",
        "review_rating": "10",
        "review_title": "my favorite movie of all time",
        "review_detailed_main": "the smurfs was great why did it get bad reviews the movie was so cute and I loved the Carmella and Katy Perry Smurfette what that's on the reasons. I really liked when they showed New York AND THE CUTE BATTLE SCENE WITH GarmelLe. It was really funny I like the jokes it deserves a 10 out of 10 . THE SEQUEL WAS GOOD BUT THIS IS BETTER AND I WANT TO SMURFS THE LOST VILLAGE. THE CGI IS GREAT I ADORE IT I REMMOND THIS MOVE TO ALL."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "robertjasongrant",
        "review_rating": "",
        "review_title": "Great Homage To My Childhood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ashlyn1021",
        "review_rating": "10",
        "review_title": "Amazing Hilarious Loved it!",
        "review_detailed_main": "Wow shocked to see such awful reviews. This is a great movie!!! I went and watched this movie with my husband while we were out of town. We watched it in 3D because the regular showing was sold out!! I love the smurfs and cartoon/clean movies to watch! We loved it laughed the whole time. Great movie date!!!!The cat and Gargamel really cracked us up. I liked the story and how the smurfs made it back home. I can't wait till the Smurfs 2 definitely a great movie to see if you love to laugh, and smile :) I can't wait to buy it on DVD best movie i've seen in a while!! This movie starts out in the smurfs town then they fall through a blue porthole and, get stuck in new york and have to wait for a blue moon before they can get home. Really great movie must see for family's, kids, everyone!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "miss_write_0892",
        "review_rating": "",
        "review_title": "this movie rocks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "ZalmanAran",
        "review_rating": "9",
        "review_title": "The Smurfs are Great!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "shaycvs",
        "review_rating": "",
        "review_title": "Not so Smurfy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jayneuruh",
        "review_rating": "9",
        "review_title": "Fantastic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Bored78",
        "review_rating": "9",
        "review_title": "Can't Believe the Bad Reviews",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "hrc_public",
        "review_rating": "",
        "review_title": "Sure I've seen worse but don't recall where or when",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "trevor-mcinsley",
        "review_rating": "10",
        "review_title": "Excellent. Simply Put.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "mbrach-137-541025",
        "review_rating": "",
        "review_title": "Not a movie for kids (some spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Angels_Review",
        "review_rating": "9",
        "review_title": "Best Movie for All Ages!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "the_upcoming",
        "review_rating": "",
        "review_title": "The Smurfs back on the silver screen: hit for the kids, disappointing for the parents",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "d-allen1-147-455070",
        "review_rating": "8",
        "review_title": "Great kids film, brought back childhood memories",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "c-sierra36",
        "review_rating": "",
        "review_title": "An evil wizard Gargamel chase the blue smurfs out of there village and head to New York City.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Ptpoo",
        "review_rating": "8",
        "review_title": "Accept it for what it is",
        "review_detailed_main": "I was dragged along to this by my nine year old daughter with a sense of impending doom having loathed the Smurfs in their original incarnation in the 1970's and it took years of therapy to get that song out of my head.\n\nI was pleasantly surprised by the quality of the film, the 3D special effects and the script (note the difference between script and plot).\n\nOK, the plot is more \"Lassie, come home\" than \"Crime and Punishment\" but what did you expect? This is a decent piece of children's escapism and my daughter (as well as the dozens of other children in the theatre) loved every minute of it, so I gave it a 8 on her behalf. There are many scenes that are enhanced by the 3D and, as with many of the best films, the bad guy gets the best lines.\n\nIt is already on the Christmas DVD list, but don't tell Molly and spoil the surprise :)"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "saviouz",
        "review_rating": "8",
        "review_title": "Great Animation",
        "review_detailed_main": "Smurfs is a really successful combination of an animation and action film. since I can't remember much about the cartoon versions of Gargamel and the cat, Azrael, I'll just be judging the film. For a movie made by the maker of the awkward Scooby-Doo movie, this movie's actually cool. First, we have the accuracies to the comics. The Smurfs perfectly reflect the personalities that their names.. Hence, the whole movie's about Papa Smurf keeping Clumsy isolated, as he accidentally led him, and the other central characters (plus the villains), into our world. This is where the second conflict plays. The two main human characters, Patrick and Grace Winslow, are expecting parents, as Patrick tries at work to protect his new job as \"Marketing VP\", while temporarily letting the Smurfs stay at his place. Clumsy ends up being the icing on the cake. And finally, this movie is filled with funny moments... I still wonder why it ends up being so this time. Now, this concludes my review. I still wonder why the critics didn't like this film."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "anssir66",
        "review_rating": "8",
        "review_title": "Perfectly alright children's movie",
        "review_detailed_main": "I went to see this with my 7-year-old son and he enjoyed it. I was entertained, as well. This is by no means a bad movie, like some other reviews state; sooner, it fulfills its role very well as family pastime. Definitely recommended; don't believe all the negative reviews on this site, or, at least don't take them too literally. While this is not exactly groundbreaking, it's obvious that the filmmakers seriously aimed at making a good and endearing story and it comes through. The computer smurfs blend well with the real environment. Hank Azaria is a good choice for the role of Gargamel. Really nothing much to complain, go see it for yourself!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jimy23",
        "review_rating": "9",
        "review_title": "More like the Original comic then the cartoon.",
        "review_detailed_main": "I saw this in the theater last Monday I noticed this was in a way more connected to the Belgium comic then the cartoon series. It makes reference to Peyo the Smurfs creator and even has a smurf Belgium comic in the movie. Besides Gutsy smurf there only original smurfs no Sassette no sappy or Grandpa smurf who was voiced by Jonathan Winters who voices Papa smurf in the movie. Hank Azaria put good effort into his role as Gargamel and even has his own subplot which doesn't go anywhere. Like in the cartoon Gargamel is the comedy villain who is still threatening. Katy Perry Is another one who dose good with character Smurfette the Original human characters Neil Patrick Harris Jayma Mays where alright in there roles but i Did not really pay much attention to them. One problem in the movie was the constant Product Placement which was impossible to overlook. well over 100 Product images are plastered on the screen more then the zoo keeper which had a lot. I give it 4 out of 5 stars and i hope there are Sequels in the Future."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "jami429",
        "review_rating": "8",
        "review_title": "smurftastic",
        "review_detailed_main": "Six smurfs (Papa, Gutsy, Smurfette, Brainy, grouchy and clumsy)head out on an adventure that they will never forget.\n\nI wasn't expecting this movie to be good after the reviews I have seen for it. But afterwards, I came out of the cinema and was thinking to myself that I was really glad that I went to go and see it.\n\nIt really did make me laugh; the character Gargamel (played by Hank Azaria) was probably the funniest out of the lot. He was the one that made me want to see more. He was funny from start to finish. I also liked his sidekick Azrial(played by Mr Krinkle).\n\nI have not seen the actual series of the smurfs, so I can not compare the movie to the series. But it is a great film, and I do recommend watching this."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "xanderblue-12178",
        "review_rating": "8",
        "review_title": "Sony is cool.",
        "review_detailed_main": "If Sony is cool, then that means the smurfs are cool.😎"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "JimmyCollins",
        "review_rating": "9",
        "review_title": "A SMURFIN GOOD TIME, i haven't laughed that smurfin much in a long time.",
        "review_detailed_main": "I have read so many bad reviews for The Smurfs, from a lot of different places, IMDb, the newspaper and from friends, so i went with such little expectations and wowee i am so surprised at peoples reactions, i ABSOLUTLELY LOVED IT!!!!! I think people are forgetting that this is a children's film, and i think people are going in expecting The Smurfs from the 80's, newsflash people, its not the 80's anymore, and i think that the filmmakers have adapted the smurf story to the modern day quite well.\n\nThe humor is definitely for the parents as much as the kids, the theater where i saw it had equal amounts of adults and children and there were laughs all round from young and old alike.\n\nThe animation is top notch, so realistic, and so adorable. The characterization of the smurfs is still very much the same, they're still the same sweet lovable characters, they haven't become too trendy and cool over time.\n\nThe casting was also excellent, Neil Patrick Harris and Jayma Mays are just born to be in movies together, factor in that they are both awesome and very cutesy looking they were excellently cast in this film, Jayma Mays is what smurfette would look like if she was human, LOVE HER!!!!! The voice acting is great, but honestly, how hard is it for an actor to voice act, not too difficult i imagine, one thing worth mentioning is the person who voiced Azrael was hilarious, Azrael was one of the best parts of the entire film.\n\nEveryone should stop bagging on this movie and just take it for what it is, a fresh take on and old classic.\n\nA+"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "vivianbaxter-48454",
        "review_rating": "10",
        "review_title": "YAYYYYYYYY",
        "review_detailed_main": "I watched this thousands of times as a child and rightfully so. Every scene with Gargamel is more fulfilling than watching my kids go off to college. The use of the New York landscape is inspiring. Neil Patrick Harris's performance made me fall into a fifteen year coma that just barely ended just because he was so great. And not to mention George Lopez had me drooling the entire movie; move over green m&m. Papa Smurf was a better father than mine ever was. I bet he'd come back with the milk. And I haven't even mentioned the plot yet. It's as if all of the great writers of the past all came together and wrote this majestic movie. If you haven't watched it, you've missed out on some of the best moments of your life. You will love it, your children will love it, your grandparents will love it, your crush will love it. I literally cannot recommend a better movie."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "arun_c94",
        "review_rating": "9",
        "review_title": "gud one",
        "review_detailed_main": "I just watched The Smurfs with my wife, my 10 year old son, and my 5 year old daughter and we all enjoyed the movie very much. I had promised to take my kids to see this after seeing the first preview several months ago and I was concerned with the poor ratings on IMDb and poor critic reviews. However, I have to say that I was pleasantly surprised at how good the film was. It had a good story line and was much funnier than I expected.\n\nThe live characters were cast very well with Hank Azaria playing a perfect Gargamel and the smurf voices were good as well, especially Jonathan Winters as Papa Smurf and Katy Perry as Smurfette (my daughter's favorite).\n\nBottom line, if you have small children or you were a fan of the cartoon growing up, you will enjoy this film."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "nexton",
        "review_rating": "8",
        "review_title": "Fun, Interesting, and full of laughs",
        "review_detailed_main": "Good film, good entertainment, don't expect more from this film, some of actors done it with overacting but that what they've paid for. Funny weird cat, Azaria's even not look like himself in this film, wonder who he is but he's funny too. Good kinship between the smurfs and humans, good for family theme, for kids, children, or even adults. Spend your little time for this film you wont regret it although that will not make you smarter or whatever. Many people said that you better not taking your bucks for this film and thats stupid idea, they got 500 M dollars for this pieces of crap, so mind you not to see this crap, and you will regret it."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "esader",
        "review_rating": "8",
        "review_title": "Great Adaptation, an Smurfs Spirit faithful",
        "review_detailed_main": "I don't have any children of my own, but I am a big child myself. Born in the 80s and having grown up watching The Smurfs cartoon on television I was really looking forward to seeing The Smurfs on the big screen and for me it didn't disappoint.\n\nThis movie has got so many awful reviews but let's be honest, it was never going to win an Oscar but it can win the hearts of people who want to enjoy a lighthearted movie with silly giggles along the way.\n\nThe Smurfs stayed true to their cute and happy selves throughout, and the voices of the characters were extremely well suited.\n\nI had a lot of fun watching this movie and would definitely recommend it."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "magne-242-710829",
        "review_rating": "8",
        "review_title": "Entertaining and action packed!",
        "review_detailed_main": "I took my 6yo daughter to watch this movie, and for what it is, it's very entertaining. Kids are very immediate in their response to what they like and what they don't, and my daughter loved this film!\n\nPersonally, I find it quite fun as well. Maybe it's the child in me, but I found this highly entertaining and action packed. It's required that you accept that this is not rocket science, and just positive escapism.\n\nBut if you do have a playful heart, I bet this won't disappoint you at all. In fact, I have to look very long and hard to find a more entertaining time!"
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "benedictgfw",
        "review_rating": "9",
        "review_title": "One Meme Scene, One Bad Scene",
        "review_detailed_main": "When Gutsy Smurf & Grouchy Smurf Give Brainy A Flying Boot, The Hit The Smurfs Causing Them To Fall Into A Lake, Then The Smurfs Are Dead, It Was So Funny, As Funny & Funny & Even More Funny, Can Someone Post It On The Internet?\n\nBut When The Smurfs Travel To New York, It's More Serious When Raja Gosnell Created The Smurf In A Lake, Funny, Hilarious & Good For Children Who Like The Smurfs\n\nMy Least Favourite Scene Was When Jokey Tried Giving A Present To That Smurf, It Was Strange, The Present Also Exploded Only Half A Bit, Sorry For Anyone Who Likes This Scene, It Was Super Duper Stupid & Bad."
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "Robert_duder",
        "review_rating": "8",
        "review_title": "A fun homage to the Smurfs of yesteryear and brings them to the new generation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "mattkratz",
        "review_rating": "",
        "review_title": ":-)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "",
        "review_title": "For kids, not adults",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "mr-doug",
        "review_rating": "",
        "review_title": "The film is basically sloppy writing through and through",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "unger15",
        "review_rating": "",
        "review_title": "poor kids...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "EmmaDinkins",
        "review_rating": "",
        "review_title": "Chix Chat on Film review: A Smurfing adventure in the Big Apple",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "DICK STEEL",
        "review_rating": "",
        "review_title": "A Nutshell Review: The Smurfs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0472181",
        "movie_name": "The Smurfs",
        "movie_rating": "5.4",
        "review_username": "puppypanda27",
        "review_rating": "",
        "review_title": "Such harsh reviews....but I liked it!",
        "review_detailed_main": ""
    }
]