[
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Well-Made, Well-Acted Motion-Picture!",
        "review_detailed_main": "Sanjay Leela Bhansali's Mangum-Opus 'Bajirao Mastani' finally arrives. Been in the news for more than a decade, this period piece, fortunately, is worth the wait. Its A Well-Made, Well-Acted Motion-Picture, that holds your attention at most times.\n\n'Bajirao Mastani' narrates the story of the Maratha warrior Peshwa Bajirao I of the Maratha Empire (Ranveer Singh) and his second wife Mastani (Deepika Padukone).\n\n'Bajirao Mastani' is epically mounted & Bhansali has Directed the film with enviable ambition. The scale of the film is something to watch! The visual appeal is tremendous. But, what makes 'Bajirao Mastani' further more memorable, is its human-conflict between its primary characters. The relationship of Bajirao & Mastani is sharp, and even the relationship between Bajirao & his first wife Kashibai (Priyanka Chopra), is compelling. Watching the warrior torn between love, politics & religion, often grabs your attention. I was involved in Bajirao's quest to give his women the respect they deserve, despite the evil-heads who intended to ruin it.\n\nHaving said that, 'Bajirao Mastani' isn't without its share of blemishes. While the first-hour is arresting, the second-hour takes a dip & the pace drops. Also, the film overstays its welcome by a good 20-minutes, that certainly needed some trimming. A crisper & sharper second-hour would've only enhanced the overall impact!\n\nThe Screenplay is fierce, but undeniably romantic & emotionally charged. The characters are nicely written out & so are their interactions. But, the second-hour needed a stronger punch. Bhansali's Direction is Grand. Its pure ambition, on celluloid. And the accomplished Filmmaker has handled the film with precision. Cinematography is Magnificent. Editing is mostly good, but it needed to be sharper. Art & Costume Design are flawlessly done. Action-Sequences are fabulously executed. Bhansali's Score is enchanting.\n\nPerformance-Wise: Ranveer Singh is extraordinary Bajirao. The terrific actor sinks his teeth into the part & delvers a phenomenal performance. Right from his flawless Marathi diction, to his correctly done body-language, Ranveer scores a home-run. Deepika Padukone is wonderful as Mastani, portraying her part with complete honesty & understanding. Priyanka Chopra shines as Kashibai. She's in great form here. Tanvi Azmi as Radhabai, Bajirao's widowed mother, is electrifying. Its a pleasure to watch the veteran cast in a role that offers her scope to show her brilliance!\n\nOn the whole, 'Bajirao Mastani' is definitely worth a watch."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "gwat-2",
        "review_rating": "8",
        "review_title": "Wonderful to look at - a great showcase for Indian film",
        "review_detailed_main": "I went to see this film while my wife was at the ballet. I don't watch many Bollywood films, and usually the lighter kind, so I was coming to this film with almost no context. Also, to me, this was a foreign language, subtitled film so I missed any subtleties of language.\n\nI really liked it. It was a true epic, wonderfully staged with seamless CGI and a consistent mellow look and feel to it. The leads (and lots of others) were really handsome/beautiful, and excellent actors. The dancing and singing was great and the story was well told. The costumes were sumptuous - Mughal miniatures come to life.\n\nTo an Australian this was of course an exotic film, so although it was slow there was always something to be looking at and wondering about. On the con side, the Hindu / Moslem theme was hammered home rather obviously, the Brahmin priests were one-dimensionally nasty, and (apart from one boatman) everything took place in a idyllic palace bubble - punctuated by a few battles.\n\nHowever I would recommend this to anyone who wants to enjoy an epic cinematic experience Indian-style."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "singhrohan-89622",
        "review_rating": "8",
        "review_title": "A must watch, complete balance between history and drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Peter_Young",
        "review_rating": "6",
        "review_title": "A stunning visual extravaganza - doesn't really reach the heart content-wise but who cares when it's so impossibly beautiful",
        "review_detailed_main": "Okay, one can expect exactly that with a Sanjay Leela Bhansali. The man sure knows his stuff when it comes to photography and even when something is lacking in the storytelling department, this remains an almost inconsequential detail by the end of the show. This was true for previous Bhansali productions, including Devdas, which was actually a good film in and of itself, while my personal favourite in this regard is probably Saawariya, which was so overwhelmingly stunning I could watch it anytime just for how beautiful it is to look at. Bajirao Mastani is an epic romance, and it definitely works in both story and execution, but it's not a tremendous show as it never really manages to tug at the heartstrings despite its strong story. I wish I could allow myself to get more involved in the story and feel more for the characters and their travails, but it didn't really happen, also probably due to the fact that it's an epic, distant and larger-than-life style of execution, but more because it lacked some depth here and there.\n\nBut again, the visuals, oh the visuals - Bhansali is a true craftsman in this regard, and no one can take it from him. The amazing setting, the props, cinematography, the lighting, the extraordinary, impeccable attention to detail, the symmetry, make for a visual treat the kind of which you rarely see. What about the film itself, you ask? Well, it's interesting and captivating, and the music is phenomenal as well. The three leads are really good, particularly Chopra who gets the meatiest part of a woman driven by jealousy, ego, in spite of which she finds room in her heart for compassion and forgiveness. Deepika is stunning, and Ranveer Singh is a good lead whose every expression is clearly carefully thought out before. It also has a phenomenal Tanvi Azmi whose every turn over the past decade has been impressive. At the end of the day, Bajirao Mastani provides viewers with exactly what they want - entertainment and aesthetic delight, and in this regard, the film is a delightful cinematic experience. Pure delight."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "vrush-69308",
        "review_rating": "10",
        "review_title": "A fantastic and classic epic romance! A must watch!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "jahangirhussain74",
        "review_rating": "",
        "review_title": "Deepika performs below expectations!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Swapnilagarwal",
        "review_rating": "7",
        "review_title": "The visual treat retreats",
        "review_detailed_main": "Another historical tale, a visually authentic one after 'Jodha Akbar'.\n\nTop class performances by all actors - Ranveer outclasses as Bajirao with his awesome acting, 10/10 marathi accent and accurate mannerisms.\n\n\nPriyanka is awesomely graceful and exhibits perfectly, insecurities and mixed emotions of Kashibai.\n\n\n\n\n\n\n\n\n\n\n\n\nOverall its a visual treat for eyes and literally takes you to the medieval era of peshwas, an unexplored terrain in Bollywood so far."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "kyasaar",
        "review_rating": "10",
        "review_title": "'Bajirao Mastani' transforms into 'Bajirao Kashi' - Liberty of cinema ★★★★★",
        "review_detailed_main": "The Story, Overview and Music:\n\nSanjay Leela Bhansali is back with his 12 years old dream he nurtured like a baby titled as 'Bajirao Mastani', which is Bollywood's magnum opus and a reply to Tollywood's Bahubaali. Enthralling from beginning to end, the movie doesn't contain a single boring moment which is a huge plus point for its genre which can often be cumbersome and boring. And that can be large attributed to the visual aesthetics. Each and every frames are picture-perfect shots. From the very opening credits, you know that you are going to travel into a divine universe unraveling the 500 years ago's history (the 1700's). The sets and art direction are so well crafted, huge and super grand. Visual poetry on screen. Kudos to the set designers. The costumes, before describing, I would love to salute Anju Modi (costume designer) and Sanjay's vision of the past. Yes, they have rendered their imagination into a visual bonanza indeed. Ornamental is the perfect word. Every color that was picked for the costumes reflected a mood in addition to visual appeal. Applause! The cinematography is par excellence. The screenplay is multi- dimensional. It leaves you thirsty to know more. The background score is the \"cherries on the cake\". It is soothingly melodious in romantic scenes while explosive in war scenes. The action and the wars are new in Bollywood. First time a movie from Indian has excelled in such scenes. And the dialogues are a marvel. Very few films get you hooked up by its dialogues and Bajirao Mastani is one of them. There are many lines you will take home: the 'Guroor' one is pure cinematic and the 'Cheete ki chaal,..' is beautifully written and used cleverly. As for the music, the album has 10 tracks and SLB as the music director has done a magnificent job. The album is a beautiful blend of Marathi folk and Persian/Muslim influences. So, technically, the film is far superior than any Hindi movie I have seen in the last decade or so. The introductory portions in which they narrate the Peshwa's conquests using semi- animation/CGI were brilliantly performed. It's definitely one of the best of 2015. You are simply left mesmerized. You really are! The story of the film, I'll leave it for you to catch. I won't be a spoiler. I will just say that it is surely a love- triangle but one with a big difference.\n\nStar Performances:\n\nRanveer Singh as the Peshwa Bajirao Ballad.- He is unbelievably good. Looks, body language, Maratha accent, physical strength in the war scenes. Hats off. I was skeptical about Malhari but it fits perfectly fine. His eyes spoke so many feelings. The anger, the love, the guilt, the passion, the pride, simply a WOW. I have always believed he's got a stupendous amount of untapped talent, and boy does this movie bring out the crazy range of acting skills that he possesses. He hit the right notes at all points. Mark my word, his performance shall make you a fan if you are not. This goes as his career best performance. He should win all 'Best Actor' awards for this. Deepika Padukone as the warrior princess is a marvel. She is beautiful, charming and stuns in songs like Deewani Mastani (I heart heart emoticon her in that). Her restrained half-Persian nuanced acting seemed to jump out less. Her character is one-dimensional. That's the minus point. Her biggest weakness being her poor kathak and you will feel sometimes in war scenes, she just lacked it and in romantic scenes, she went quite below par. Maybe due to parallel filming. She is undoubtedly a treat to watch but is overshadowed by Ranveer and Priyanka in acting. Nevertheless, she gives a remarkable performance but not her best. Priyanka Chopra as the Peshwin Queen Kashibai – *Breathe* Kashi was the most complex character of the film. It's an arc immensely enjoyable act at the same time heart- breaking. Kashibai might be an image of helplessness but it takes such strength for a woman to respect and protect the other woman your man fell in love with. Priyanka Chopra is terrific, her intelligently expressive eyes speaking volumes, she stood out in her Marathi intonations and prosody. Her no- nonsense Marathi rhythm was bang-on. Her each expression is layered with a thousand emotions, her dialogue delivery is pitch perfect and even in her dance her footwork is crisp and nimble. She crossed expectations in the film. She gets your eyes teary and your heart in pain. Her scenes are the highlights of the film and she owns them. In confrontation scene with Deepika where she goes \"Dil? Kaisa dil?\" gives you goosebumps. She knows her husband loves Mastani but she loves her husband. She can't hate him. The day she married Bajirao, she swore to support her man in his all decisions that make him happy. She knows her husband is no longer hers yet she doesn't want to lose him. The 'Guroor' scene where she calls her husband and tells him to go with his second wife is the scene of the year. In the climax, she comes to her ill husband but the latter calls her Mastani in hallucination and at that very moment you can feel her. She is devastated yet she pleases her husband by acting like Mastani. The lovers Bajirao and Mastani die but it is Kashi who is left behind all alone in pain. She takes forward the journey and raises Mastani's son as hers together with her two other sons. Priyanka's Kashi is so vivid that Deepika's Mastani pales in her comparison. In short, Priyanka Chopra has given a lifetime performance. You won't believe that the same Ranveer-Priyanka who played siblings in Dil Dhadakne Do have given such a soaring chemistry as husband-wife. Watch out for their love making scene. It's HOT. At the end Ranveer stands out, Deepika shines but Priyanka outshines. She leaves a legacy behind."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "TFan99",
        "review_rating": "7",
        "review_title": "A well-directed movie; Brilliant acting by Ranveer and Priyanka",
        "review_detailed_main": "Nice costumes, great cinematography and good music, lyrics and direction of the movie. Performance-wise: Ranveer Singh and Priyanka Chopra followed by Deepika Padukone. Here are the ratings. Ranveer Singh: A; Priyanka Chopra: A; Deepika Padukone: B+; Overall, a great movie to watch. Ranveer Singh did his career-best performance. That was amazing to watch him prepare for and act as Bajirao. Priyanka Chopra completely eclipsed Deepika Padukone. Bhansali should have switched roles for PC and DP. PC is at her splendid best that showcased her acting brilliance. This was quite evident when the duo danced together. Overall, PC is a much better actor than DP in this movie. Deepika Padukone did whatever she could. Overall, a great movie to watch!!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rohitsaroj33-874-83975",
        "review_rating": "10",
        "review_title": "Priyanka acting was superb Bajirao Mastani a watch movie",
        "review_detailed_main": "Ranveer acting was great direction and music was superb Deepika looking beautiful location screen great a must watch a movie for everyone in your life everything is great go watch... Priyanka Chopra, on the other hand, is the better performer of the two in this film. Priyanka's Kashibai loves her husband to death. Each time Priyanka looks at Ranveer Singh her face lights up like a brightly-lit skyline. When Bajirao falls in love with another woman Kashibai doesn't surrender to destiny. She is no walkover. She protests. She sneers. She is angry. But finally for the sake of her husband's happiness and the larger good, she accepts the situation. Kashibai teaches us the most important lesson of this film. Acceptance of injustice is sometimes the opposite of cowardice. Priyanka conveys all these emotions with near-flawless comprehension of her character's inner world. This is her best to date."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sanwit",
        "review_rating": "6",
        "review_title": "Faux historical with some great acting!",
        "review_detailed_main": "This is undoubtedly one of the better movies to come out of Bollywood this year. And that's saying something, since this year is almost at its end. Tremendous acting from Ranveer's Peshwa Bajirao. This is a pure work of fiction, with some borrowed historical elements. However, Bhansali manages to recreate a believable world, and the actors back him up. Being a musical, the music is from the director himself, and suits the movie. Priyanka as Kashi Bai, and Deepika as Mastani also give no cause for complaints. But Bhansali is getting repetitive with the endings in his movies. No spoilers, but it's always great to watch something new, and not to go to the movie hoping it would not play out like some other movie :("
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "faisalfaves",
        "review_rating": "9",
        "review_title": "What a fantastic movie by Sanjay Leela Bhansali",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "jmoneyjohal",
        "review_rating": "7",
        "review_title": "Bajirao Mastani is SLB's spectacle,its a emotional/tragic love story but comes up short of an masterpiece.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "DareDevilKid",
        "review_rating": "4",
        "review_title": "A Blueprint on Over-Indulgent and Pretentious Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "Great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Shwethascar",
        "review_rating": "7",
        "review_title": "Spectacular visuals but falls short",
        "review_detailed_main": "Watched Bajirao Mastani. Must say I was disappointed. Not because the movie was bad. By any standard of cinematography and direction, it was tremendously beautiful, but then which SLB's movie isn't? Perhaps I had raised the bar for it in my mind too high?\n\nHere's my gripe with the movie: 1. Editing: very shoddy. Scenes just jumped around with little to no transition. There seem to be two stories told in the movie, the triangle love story and the battles. There was no fluidity in the editing between the two. 2. Bajirao and Mastani: in terms of acting, everyone did a good job. However, I felt like I have seen Deepika as Mastani in other movies as well. She was really good but I wanted to see a phenomenal performance (high expectations). Ranvir's acting is probably his career best but it still falls short in a few scenes. Some of it looks forced and tedious. Coming to the characters of these two, it's hard to like a movie and connect with it when you don't feel empathy for the leading characters. The two love struck characters are clearly shown in grey. It is difficult to feel sorrow for the ailing couple when you know that their affair has caused pain to a loving wife. This made me most uncomfortable. When the narrator proclaimed their love as eternal, it didn't resonate with me as their love was infidelity on Bajirao's part. 3. Unnecessary songs: SLB has a knack for incorporating beautiful, visually stimulating songs into his movies. This one is no exception. However, there are a couple of songs like Pinga and Bajirao and boys' celebratory song which stuck out like a sore thumb in terms of placement in the movie. 4. Rushed ending: don't want to get into details and spoil the ending but it looked like SLB was tired of 12 years of thinking and making the movie and he just ended it. 5. Striking similarity to Devdas and a little bit of Jodhaa Akbar: this one may just be me, partly because Devdas is one of my favorite movies of all time and also because I have watched it more than a dozen times. BM has so many similar themes as Devdas. Take the premise of two women longing for love of their man (I agree this is a pretty common theme), the ethereal dialogues, the widowed mother who seems to be a thorn in B and M's love saga, the choreographed duet song-dance spectacle with Mastani and Kashibai, the eventual fall into intoxication of Bajirao (there's even a scene with him in water very much like Devdas towards the end), war strategy inspired by Jodhaa Akbar, the mirror hall song reminds me of maar dala and kaahe ched, etc.\n\nHaving said all the above, I still think it is a good movie, just not SLB's best.\n\nWatch it for Priyanka's brilliant acting as the forgotten Kashibai in a small but significant role. She delivers her lines in full flow, tugs at your heartstrings and makes you feel her pain. Watch it for a beautiful coming together of spectacular costumes and set design, grand music and choreography, larger than life dialogues and theme. Watch it for the movie it is, just don't believe the hype or you're bound to be disappointed. 3/5."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "prashantnakil",
        "review_rating": "10",
        "review_title": "excellent movie. much needed breath of fresh air",
        "review_detailed_main": "this movie helps restore the fast depleting hopes with Bollywood movies. The passion with which this movie is made shines through some class acts from each involved. the animation and sets allow a submerging experience. Ranveer offers a brilliant performance and a very promising future. His accented Hindi and well pronounced Marathi complete him in his role as Bajirao.\n\nDeepika and Priyanka are best fits in their roles and don't feel off track even for a bit. Priyanka does a good job of conveying with her expressions more than her words. The placement of songs is done nicely.\n\na must watch for all moviegoers and history enthusiasts. the movie leaves us all with a good message at the end."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Pramitheus",
        "review_rating": "7",
        "review_title": "Defines Magnificence",
        "review_detailed_main": "This is probably Sanjay Leela Bhansali's most epic and gorgeous movies. Almost perfection in depicting the period in which the movie is set. Plus points of the movie is led by Priyanka Chopra(unexpectedly), Deepika Padukone and Tanvi Azmi. Side roles by Milind Suman was also very well done. Now the thing about Ranveer Singh is that you can see him trying really hard to portray the warrior but it comes off as just an act and that is why it does not seem convincing. There are glimpses of brilliance but most of the time he ends up trying too hard. I will give kudos for his trying to do his best but I really thing Hrithik Roshan would have been a much better casting for the role of Bajirao.\n\nThe movie is a must watch on the big screen especially if you like period dramas and a fan of SLB's style of movies"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "Bajirao-Mastani should be lauded for surreal direction, exemplary CGI and commendable performances",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "warriorspirit",
        "review_rating": "6",
        "review_title": "Will not be remembered as another Heer-Ranjha or Romeo-Juliet",
        "review_detailed_main": "There is a dialogue in the movie, \"From now on people will remember Bajirao Mastani in history\" There are constant self-professed claims throughout the movie of how their love is going to be immortalized. Having watched the movie and then reading a quick blurb of the history of these star-crossed lovers it turns out that they were real people and Bajirao really did love Mastani and built a palace for her(like Shahjahan for Mumtaaz) and he really did come at loggerheads with the people of his own faith. The problem is on celluloid, the manner in which their love story has been presented is so stylized, artificial and choreographed, that I did not believe it was real. I was actually convinced by the end of the movie that it was all fictional and could not possibly have been real.\n\nSo what went wrong? The problem is Bhansali's own self-indulgences overpower the real life story of Baijaro Mastani. Bhansali is notorious for his indulgences in Devdas, Saawariya, Black and Guzzarish, but I have always forgiven him for those indulgences and recognized the works of art he created. But since Ram Leela he has really fallen in his art and his indulgences are becoming gratingly apparent. In this movie he pays homage to his own movies in the lavish musical numbers, 'Kahe Ched Mohe' and 'Dola re Dola\" from Devdas, and this in itself is not problematic, what is problematic he lifted the same choreography styles, the same camera angles and movements, and in the case of 'Pinga' the same situation that leads to the song, of the two leading ladies meeting in a dramatic confrontation and then agreeing to celebrate a religious festival together dancing for the man they both love. But the difference here is, while in Devdas Paro forgives Chandramukhi, here Kashi and Mastani's resentment for each other remains. Furthermore, in Dola re Dola, the impropriety of a courtesan and an aristocrat coming together in dance caused a controversy and uproar, and here nobody bats an eye lid. And in this situation the backstory, the tension and the controversy of Kashi and Mastani dancing together was was much more intense, so it surprises me why Bhansali just glossed it all over. I can sympathize why the Peshwa descendants and historians are protesting. It was not necessary Mr Bhansali, not only did you mutilate history, but it was totally out of character.\n\nThe other indulgences Bhansali makes that ruins the story is in he how paces, directs and scripts the the meetings of Bajirao and Mastani. He is trying to make every meeting, every glance, every word shared sound like Shakespearean poetry and to enhance the profundity, many of their shots are in slow motion and the actors emote with the precision of a puppet. From the moment Bajirao and Mastani meet to the dramatic climax, I did not at once find their love story believable. They were supposedly in love from first sight, a classic trope of stories of star crossed lovers. I think one of the reasons why it did not feel it was real, was because of Bhansali the filmmaker wanting to make his presence felt in every beat.\n\nI consider Bhansali to be one of the best directors in Bollywood, because he has his own unique signature aesthetic that is felt in his movies, every shot is immaculately designed, choreographed, lit and scored. Every sequence shows his craftsmanship. He even matches them to the mood, dialogue, sets and costumes. This is a hallmark of a great filmmaker, but when overdone, it is like seeing the mirrors during a magicians disappearing act. In this movie as a craftsman he exceeds himself -- oh what beautiful sumptuous imagery, gorgeous lighting, epic camera work, brilliant use of CGI. I had no idea Bhansali had such a deft handle on CGI. I found it even better than Rajamouli's 'Baahubali' the few war sequences looked much more realistic and polished. If you compare the volley of arrows sequences side by side from both movies, Bhansali's will come up trumps. Technically, this movie is the best Indian production to date. Bahubali part 2 is going to have a high standard to beat.\n\nRanvir Singh, Deepika and Priyanka give it their all, and while proportionately Deepika and Ranvir get the most screen time, it is Priyanka that emerges the most competent actor, because her acting is more natural. I felt her character the most, in particular when she confronts Bajirao and says \"I gave you my all, but you took away my pride\" Priyanka nails every beat. Ranvir and Deepika, poor things were overshadowed by Bhansali's own indulgences. Still, Ranvir is able to overcome this in the war sequences. Ranvir seems to be a natural in any boisterous scene, whether it is a war dance or an angry battle.\n\nOverall: Mr Bhansali the craftsman exceeds Mr Bhansali the storyteller."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "varun-544-435590",
        "review_rating": "9",
        "review_title": "BajiraoMastani is sheer brilliance!",
        "review_detailed_main": "Bajirao Mastani is sheer brilliance! An epic film that leaves you wanting for more.Realism as a word and theme remains obsolete in the exquisitely crafted world of Sanjay Leela Bhansali's fantasies.Visuals are elephantine.his characteristic style narrates his version of the story in a Mughal-e-azamesque scale of grandiosity, replete with breathtakingly beautiful sets (by Bhansali, Sujit Sriram and Saloni) elaborate and well thought of costumes and accessories (by Anju Modi) and dreamy cinematography. music, screenplay, acting, dialogues and the beautiful story of 3 complex characters - everything is magnificent and spectacular! This movie is poetry in motion, easily one of the most epic tales in Indian history being translated in such a classy yet relatable manner on screen! Each scene and each dialogue gets the viewers completely hooked! People were involved and taken back into the 18th century - such was the appeal of the movie! Ranveer is unbelievable & superlative as Bajirao. Priyanka chopra is amazing & Deepika padukone is just wow! This was your most nuanced performance till date !! Excellent .. !!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "MuviFan73",
        "review_rating": "6",
        "review_title": "...a good attempt in regenerating history.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "avaclub",
        "review_rating": "10",
        "review_title": "Magestic Indian Epic Drama of Bajirao Peshwa not to be missed",
        "review_detailed_main": "Its an excellency of Sanjay Leela Bhansali, #BajiraoMastani is a Magestic Indian Epic Drama of Bajirao Peshwa. Whether its the majestic sets, beautiful music , performances of the star casts Sanjay Sir has excelled in each and every frame. After Baahubali this is one movie which is in Hindi originally that you can feel proud of watching it. Deepika is marvelous, Priyanka is excellent and ranveer singh is extraordinary.The song Deewani Mastani itself is a paisa vasool for the quality moviegoers.The war scenes are of world class and may remind you of any good war movies. Its a beautiful love story weaved in with the war plot.this is one movie which is not to be missed...Go for it"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "murtaza_mma",
        "review_rating": "6",
        "review_title": "A cinematic spectacle marred by sombre tone, languorous pacing and lengthy runtime",
        "review_detailed_main": "Once again Sanjay Leela Bhansali aims for a Shakespearean Tragedy of Epic proportions and once again he falls short by some distance. Having said that, there is no denying that ‪Bajirao Mastani‬ is the definitive cinematic spectacle of the year as far as Hindi cinema is concerned.\n\nThe majestic sets, glittering costumes and swashbuckling performances add up quite well. Perhaps, making the moving in 3D would have been a good choice. Playing the legendary Maratha warrior Peshwa Bajirao, Ranveer Singh delivers the finest performance of his career. The way he takes care of his mannerisms and his Marathi accent in particular is really commendable.\n\nAs for Deepika Padukone, she has never looked prettier on the celluloid. Credit to Bhansali for looking after her leading lady so well. Priyanka Chopra playing the second fiddle to Padukone is solid as ever.\n\nDespite all its merits Bajirao Mastani may leave some cold owing its rather sombre tone, languorous pacing and lengthy runtime. While it may not to the epic that it aims to be, it certainly deserves to be watched.\n\nFor more on the world of cinema, please visit my film blog \"A Potpourri of Vestiges\"."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "amchipandey",
        "review_rating": "4",
        "review_title": "so we now cheer for adultery?",
        "review_detailed_main": "So when did we become a society that roots for cheating couple? Religion and class aside, the basic premise of the film is rooted in adultery. Mastani can call it love, ibaadat, ishq, mohabbat; at the end of the day she forced herself onto Bajirao and his family and 'stole' Kashi's man. Can you really blame the family for getting ticked off? Baji had many chances to stop her advances in their tracts but he was smitten by her and cheated on Kashi. Why have they been treated as heroes and glorify for them for close to 3 hours? Unless we have accepted polygamy as the norm, this movie is a no go from the start. The only reason this is more than a 1/10 is the stunning visuals and cinematography."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "laptoppclaptop",
        "review_rating": "6",
        "review_title": "All form and no content",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "user-81-131504",
        "review_rating": "10",
        "review_title": "Bajirao :An epic masterpiece",
        "review_detailed_main": "What a movie!!! It deserves its place rightfully among all the classics ever made and if any movie has the potential to come close to Mughl-e-Azam ,it is this one.\n\nRight from the script to the direction to the background score everything is spot on. Stellar performances only add cherry to the cake. Deepika Padukone,Ranveer Singh and PC are going to win a lot of awards this season.Bhansali's direction is crisp and boy ,those sets were awesome.Your eyes will be glued to the screen till the movie ends and you will wish that movie never ends.Such beauty!!!\n\nAll in all it is a movie of a lifetime. Don't miss it at any cost !!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mitrajtrath",
        "review_rating": "6",
        "review_title": "Respects its disclaimer more than history!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "imranvahora",
        "review_rating": "10",
        "review_title": "Marvelous performances...from direction to action",
        "review_detailed_main": "This is a wondrous saga...very much needed to revive the image created by \"Ram Leela\" which to me was an epic fail for all; writer, director and actors.....\n\nWhile booking the tickets, I thought there is much similarity between the \"Ram Leela\" and \"Bajirao Mastani\"...the lead characters, the historical plots and even the names of movies...Ram-Bajirao-Ranveer and Leela-Mastani-Deepika.... and hence, I went with the outlook of this one being an epic fail as well...but it turned out to be completely opposite....\n\nSanjay Leela Bansali has, i would say, re-earned his name by working with same actors to create a marvel.....an epic love story after Devdas..I would like to adorn Bajirao Mastani with all the adjectives possible... perfect plot, perfect casting, impeccable direction, splendid screenplay with awesome dialogs awesomely delivered, super graphics and super duper acting by Ranveer, Deepika and Priyanka....\n\nBeing a fan of romantic movies, I am left with another love story to savor...this is going to be on my favorite list from now on....\n\nAnd of course, I love you Deepika....."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ravi-unadkat",
        "review_rating": "7",
        "review_title": "Powerful movie",
        "review_detailed_main": "I found BM powerful movie. Definitely stretched for good 30 minutes but still it had heart at right place and all characters in the movie has given their heart and stand tall among all. You cannot single out a person who did good or bad.\n\nRanveer is revelation. Post his boyish act in Dil Dharkne Do, this was completely different role and he scores brownie points yet again. Just watch him for last 10 minutes and you can see Bajirao & Devdas together.\n\nDeepika is just awesome, she perfectly portrays the complexity she gets thru, her eyes speak more. Love between him and Ranveer looks real but somehow that kills the excitement to see them because we know they are lovers in real life plus their steamy outing of Ramleela of same director is not very old.\n\nPriyanka for me steals the movie. She has multi-layered role. She is bubbly at a times, she is like kid, a dotted wife and daughter in law. She gets chance to show her character on various scenes and shows talent beautifully. All including me thought PC may have made wrong selection of this role but after seeing movie your heart goes out for her. She goes from strength to strength. Her last scene with Ranveer in her room is just awesome. He literally overpowers Ranveer in those moments. Just awesome.\n\nAll rest supporting actors did wonderful, there was no weak acting anywhere. Story was stretched a bit too far as usual Bhansali style :) but sheer artistic presentation win over you. Sometimes you do not see actors in movie but you notice the set up, the sets, costume and colors.\n\nSLB -you have made a proud movie, well done sir. Awaiting for more & more."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "alokgautam-45012",
        "review_rating": "9",
        "review_title": "The best movie of 2015",
        "review_detailed_main": "An excellent piece of hard work by the entire team.\n\nFantastic direction and commendable acting by Ranveer. Equally supported by Dipika and Priyanka.\n\nFight scenes are class apart and really visualize the era it belongs to. Dance, emotions, set design...nothing falls short of the other.\n\nI did not watch old SLB films and this one makes me feel I must watch all now. The best is seeing Ranveer so mature and proving his presence in the lead role. Fully justified.\n\nIts been 24 hrs I watched this movie and it had such powerful impact that it is still running somewhere in the subconscious mind.\n\nOverall a real show of talent by all! Thanks to the entire crew for this remarkable effort and exploring these plots."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "umesh_24194",
        "review_rating": "6",
        "review_title": "Some things bling and something Missing",
        "review_detailed_main": "I was looking forward for the movie since the day it's trailer released.It could've been a shining and an absolute gem but director settles for an unpolished product.The sets,costumes are so detailed and beautiful, every frame is like a painting.The lead actors performances are very good yet the movie doesn't hit the spot. Movie starts with a bang,background score gives you goosebumps.First Half is amazing ,it keeps you wondering what's gonna happen next. Ranveer Singh looks great and convincing as a King,his dialect,body language,everything is tremendous.But as the film progresses bollywood hero takes over (especially in malhari song,where a king is dancing with Bollywood expressions). After interval,\"the triangle\" and family feud keeps on going,which seems a bit drag as there could have been so much more. The biggest problem was the war scenes,strategies were not much(given that Bajirao won 41 wars and was known for his outstanding battle tactics in the world) and the battles shown in the movie are brief. All in all,despite every actors best effort,the movie was not what was expected.It's not so bad but not great either."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "nanoo-shashwat",
        "review_rating": "10",
        "review_title": "Masterpiece by Bhansali Sir",
        "review_detailed_main": "One of the best performance by Bansali Sir Ever .\n\nProject it as the third spin off from a trilogy started from Hum dil de chuke sanam and Devdas where Salman and Shahrukh Stealed the show , but here Deepika did .\n\nRanveer and Priyanka were lovely to watch but Deepika was far better . Belonging to such a strong and non-entertaining genre , it did entertained us and I will highly recommend you to watch this .\n\nSome may have rated it down (Fan wars or something) but believe me , it will show a spike and gradually may end up around 8 or something .\n\nDeserves your bucks and after watching it , you will for sure oblige Bhansali Sir to the magic he brought back that was missing from Bollywood for the past few years .\n\nStory 9/10 Songs 9/10 Dialogues 10/10 Acting 9/10 Direction 10/10\n\nOverall 9/10"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ghuleharsh",
        "review_rating": "",
        "review_title": "excellent movie must watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "tuduashok",
        "review_rating": "6",
        "review_title": "Please do not watch if you cannot digest love movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "lamemoviesguy",
        "review_rating": "4",
        "review_title": "A huge disappointment!",
        "review_detailed_main": "Poor performances from the lead pair, unnecessary melodrama, childish and cheesy dialog, excesses of glitter and slow motion, and worst of all, amateurish direction, completely derail this movie. The source material is really strong and could have led to a classic if properly handled, but the film director and actors fail miserably and make a big mess of it. The only reason I have given the movie even 4 stars is owing to a few good performances, particularly Tanvi Azmi and Priyanka Chopra.\n\nI hope some day a good director will remake the movie with good actors and present this timeless story with all the layers that it potentially carries."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mssharma",
        "review_rating": "6",
        "review_title": "Great drama, not sure of history",
        "review_detailed_main": "It appears that Director used real life story of Bajirao and weaved a great love story around it. A Brahmin by birth, Bajirao who was married to Kashi and cannot marry another woman (SriRama is the example from Puranas and he was Kshatriya. But Bajirao (in the movie at least) gives all kinds of justification for hi love to have an affair and later marry a Muslim woman when his first wife (Kashi) is still alive. As usual people abuse religious rules and twist it to suit their moral failings. Excellent acting and drama, but beware it is reality mixed with fiction similar to Titanic love story. Lot of anti-brahmin moves by Bajirao himself (in the movie). Quite bit of involvement of his mother in ruling the lives of these people. Mastani (Muslim lady lover) had no reason to trap and ruin Bajirao's married life and create rift in the community."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "hilllillian",
        "review_rating": "10",
        "review_title": "Hands down one of the best recent released movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ctowyi",
        "review_rating": "7",
        "review_title": "Sumptuous filmmaking - aesthetics matching the narrative",
        "review_detailed_main": "The film received several accolades at various award ceremonies across India. At the 63rd National Film Awards, Bajirao Mastani received seven awards, including Best Direction and Best Supporting Actress for Azmi. The film received fourteen nominations at the 61st Filmfare Awards, and won nine awards including Best Film, Best Director for Bhansali, Best Actor for Singh, and Best Supporting Actress for Chopra.\n\nI missed this at the cinema but my radar went up with all the big wins. How could I have missed this?\n\nAbsolutely ravishing and resplendently opulent. All the usual stylistics of Sanjay Leela Bhansali are on full display. When the stylistics failed to match the narrative, we get lackluster films like Saawariya, but when it does his films become a feast for the senses like Guzaarish and Black. This movie is in the latter category.\n\nBajirao Mastani is an epic in every sense of the word. Lavish sets, superb cinematography, and characters that are larger than life. The music and dances are amazing. I particularly enjoyed Priyanka Chopra's arc. She brings her character to life in such an unstated way that hits the spot for me. The only misstep for me is the near choking use of symbolism and imagery at the end."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "maria-pervez11",
        "review_rating": "10",
        "review_title": "An excellent SLB signature movie with Ranveer, Deepika n Priyanka at their best",
        "review_detailed_main": "What an amazing movie from SLB once again with beauuuuutiful sets, clothes, music and characters and an amazing story based on true facts, which current Indian cinema is lacking a lot. Acting is superb and the flow of movie is amazing. As always Sanjey movie depicts the depths of a fantasy imagination where even the pain is in beautiful colors. A must watch for people who love good music who love elegant sets and admire the grand ruins. Apart from sets the graphics job is done very well and war scenes are narrated in a true gladiator way. Clothes were drop dead gorgeous. I wish if any of my tailors could make such superb pieces.\n\nDeepika Ranveer and Priyanka did amazing job. Do watch you will remember it for a long time :)"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "thecritiquer",
        "review_rating": "7",
        "review_title": "Extremely well directed and performed, Bajirao is more than a visual treat.",
        "review_detailed_main": "Bajirao Mastani, one of the most awaited films of the year, clashed with a movie with a bigger hype when it released this 18th December. The story is based on Peshwa Bajirao and his second wife Mastani, the daughter of the king of Bundelkhand. The salient feature of this film, very unlike others, is that it doesn't feed opinions to you. As tempted as a person would be to think of Bajirao and Mastani as the real couple before watching the film (given the name of the film), the film, not for a single frame, puts a finger in that direction. Where on one hand it shows the deep love of Bajirao and Mastani, it also showcases, thanks to Priyanka Chopra's extremely good acting skills, Kashi Bai's pain and longing. The movie, in a very classic way, leaves the job of conclusion to the audience.\n\nThe story if based on the Marathi novel 'Rau'. The screenplay is tight in the first half but extremely lose in the second half. The first half has every ingredient necessary for a classic. It has a well written script, hard hitting dialogs, seamlessly fused entertaining and narrative songs. All of this keep you engaged so well that your level of expectations increase a lot for the second half.\n\nThe second half of the film, however, falters. The movie does showcase some good dialogs and good visual poetry, but there isn't much going on. Had the film been 30 minutes shorter, it would have become a classic.\n\nThe songs are soulful and don't interrupt the narrative, the background score was well worked. Editing could have been better. Performances are excellent, each actors plays their roles so well that it is hard to find a flaw. The supporting cast also plays a very good role.\n\nOverall, this film is a must watch for every movie buff. With the holiday season at the rise, this should definitely be the film in your movie list. It a well knit film, with a flawed second half."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "amna-87158",
        "review_rating": "10",
        "review_title": "The film narrates the story of the Maratha warrior Peshwa (Prime Minister) Bajirao I of the Maratha Empire and his second wife Mastani.",
        "review_detailed_main": "It was really refreshing and pleasing to the eye. I could not tear my eyes from the screen the whole time. If you are looking for a love story that is not sappy dipped in damsel in distress stereotypes then this is a must watch. The chemistry between Deepika and Ranveer was sizzling hot. These two are the dynamic pair. I bet in coming years their pairing is going to grab massive attention. I can't even think of another duo playing such strong characters. I particularly loved the cinematography and the visual blast of colors the movie brought to us. The opening scene was superb and the battle ground was realistic for a change for Bollywood movies. Songs were entertaining except \"Pinga\" which i personally didn't like. \"Deewani mastaani\" was my favorite song video. Amazing movie. I am going to go watch it again. Highly recommended."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "pshyams-59489",
        "review_rating": "7",
        "review_title": "Worth watching",
        "review_detailed_main": "Bajirao Mastani has to rank among the better historical movies in recent times.\n\nThe love story of Bajirao and Mastani is not as well known as those of Laila Majnu, Sohni Mahiwal or Heer Ranjha in the Indian folklore. Sanjay Leela Bhansali (SLB) sets out to correct this wrong and does a pretty good job of doing so. This movie is said to have taken over 12 years from conception to delivery. During the intervening period SLB directed Black, Saawariya, Guzarish and Goliyon KIA Raasleela Ram Leela. The experience gained in making these movies has stood him in good stead and shows in BM. True to his reputation, SLB has delivered grandeur on a plate in his latest offering.\n\nWatching Bajirao Mastani on the big screen is like being in the middle of a battlefield. Outstanding cinematography and special effects provide a surreal experience to the viewer, whether it is the battlefield scenes or the scenes set indoors in the Shaniwar Wada fort. Colorful costumes and classic choreography add extra charm to this period drama. The story of the Maratha warrior Bajirao Peshwa and his second wife Mastani does not bear repetition – this has been converted into a highly watchable movie by SLB with some artistic liberties taken in the translation of real to reel.\n\nRanveer as the Peshwa is credible and brings life and energy to the role. He is equally at ease as a superb warrior in the battle scenes as well as the hapless and lovelorn human being torn between the first and second loves of his life and his domineering mother. Priyanka Chopra as Kashibai, his first wife is outstanding. Playful as well as strong, she steals the show in a superbly underplayed role. The disappointment was Deepika's Mastani. In a tailor made role, she appeared to be sleep walking through many scenes. No doubt, she did a great job in the battle scenes, but when it came to emotional scenes where she confronts her bête noire Radhabai (Bajirao's mother) or fiercely protects herself and her son from attackers she appears stone faced. Certainly one expected a lot more from 'Piku'. The surprise element is Tanvi Azmi's Radhabai – just as we all loved to hate Gabbar, so did we hate Radhabai on the screen; a true test of an effective portrayal of a negative character.\n\nAs far as casting goes, one wonders if an exchange of roles between Priyanka and Deepika would have worked better – but then the Ranveer Deepika 'chemistry' also would have had a bearing in the final decision. In an ideal scenario, I would have loved to see Nana Patekar as Bajirao and Rekha as Mastani with Shabana playing Kashibai. All in all, a highly watchable film – even though it drags at times, the cinematic values hold your interest."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ahmadsheri",
        "review_rating": "10",
        "review_title": "This movie deserves an Oscar",
        "review_detailed_main": "I am a documentary and TV producer and director my self and the only thing that I found negative about this film was that it was little slow pace and ending could have been a little better but there were so many positives about this movie that this only one negative didn't really make a difference.\n\nI have never seen Indian Cinema at this much great excellence. Camera angles, frame composition, acting, lighting, editing yet everything was just perfect. Every character was perfectly related to the story and actors did full justice with their character.\n\nKudos to Sajnay Leela Bhansali for such an organized and better than Hollywood production. This movie definitely deserves an Academy.\n\nMr Bhansaali, I am so impressed with your work that I now want to work with you and learn a lot more from you. God bless you."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "altaf42049",
        "review_rating": "7",
        "review_title": "Fantabulous, Audacious and Sheer Romance",
        "review_detailed_main": "Sanjay Leela Bhansali's much awaited epic directional venture 'Bajirao Mastani' is finally out in theaters with the slogan of 'Love is Immortal'. The movie is a continuation to his love saga series and it amply speaks of the talent and abilities of Sanjay. Set in the back drop of 18th century, the whole plot is a joyful combination of supreme direction, classic acting, melodious music and dream cinematography. Ranveer Singh (Bajirao) will definitely earn huge respect from his critics on the basis of his acting talent and dialog delivery in this film. His couple of dialog delivery styles reminds you of Big B and Dilip Kumar. The highlight of the movie is Deepika (Mastani) with her classy acting, pleasant persona, graceful expressions and elegant dance. Undoubtedly she is the unanimous 'Queen of Bollywood' right now. All the characters have been given due importance less Priyanka Chopra (Kashibai) who should have been provided more exposure and opportunity. The film losses momentum in the second half with unnecessary rapid unfolding of events. The war scenes should have been deliberated upon more vigorously. The climax could have been more better and intense. Music should have been more soothing less one song (Deewani Mastani). In a nutshell, this movie gives you many things less than everything. Sanjay has maintained his style of splitting love souls and ensuring that they do meet in the afterlife like his all previous flicks. A great movie with a thumbs up and a big kiss and applause for both Ranveer and Deepika Padukone."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Yasmin_07",
        "review_rating": "2",
        "review_title": "Awful",
        "review_detailed_main": "I cannot stand movies made by this director. First devdas and a couple of other joke films and now this.\n\nMany people might disagree with me, but these films try to capture an image of what life used to be like. However, they fail to show what it was like whatsoever. You cannot get the right clothing, scenery etc and then go ahead and promote a selfish bigamist and claim it is a love story.\n\nMugal e azam should not even be put in the same sentence as this film. It makes me sad to think what period films have become! This classic film had it all. It was so realistic and showed truth. That sort of love existed not the type that THIS movie shows.\n\nI do think that many critics over value movies by certain directors. Sanjay is one of them. Some of his films have great songs but other than that he cannot direct to save his life. And can we please get some decent writers into Bollywood again? You will not beat HAKHK or DDLJ when you promote love that is not realistic!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "koustavavc",
        "review_rating": "7",
        "review_title": "Bajirao Mastani: A perfect collage of individual's perfection",
        "review_detailed_main": "Lots of discussion arises when more than one movie releases on eve of special occasions which are all multi star cast, huge budget and highly expected. People start discussing about which movie should be watch first. This year also it's a same case. There is another big budget multi star cast movie released with BAJIRAO MASTANI. Finally after watching all I would say if you are truly movie maniac you cannot miss this movie at all. 1.Starting with preproduction: Sanjay Leela Bhansali already had this project in his mind around decade ago. This was fulfilled on 2015 only because he had his best team in his side whether it's writing department, production designer or casting is concern. 2. Ranveer Singh is the best choice for the Bajirao's character. The previous actors that director thought of could not might have justified this role. Ranveer's attitude, body language, dialogue delivery and expression was so perfect that it will really make you feel like as if you are actually watching the real Bajirao Ballal. 3.When we talk about Ranveer then the obvious things that comes to mind is Deepika. The real MASTI girl was perfect choice by director to highlight her as reel MASTANI. She absolutely justified herself to be warrior princess. Any one of you watching this movie I am sure that you will be really pleased with character Deepika played. 4. Priyanka Chopra had already proved her skills that how well she can adapt herself in any kind of role she's been offered. The character of Kashibai was by far her best appearances any one may have expected from her. 5.Bhansali has woven some wonderful moments together in this rare piece of art, which deserves appreciation. Every frame is beautifully presented and it works like a visual treat to the audience. 6.When Stunt design in Bollywood movies is concern its the best one man army SHAM KAUSHAL.\n\nI would conclude by saying that when there is individual who are perfect you can expect only the perfect outcome.This results BAJIRAO MASTANI"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rabiaburidi",
        "review_rating": "10",
        "review_title": "Amazing film with great acting, music, costumes and dialogues",
        "review_detailed_main": "I absolutely loved the film. Chose it over Dilwale and did not regret any of it! The movie was fantastic! Ranveer was phenomenal along with Deepika who looked gorgeous. Priyanka also did a wonderful job. Overall it was very entertaining and just beautifully done! I had wished that maybe it would be a bit longer because I felt the ending was cut straight to the chase but it wasn't too bad. The story was beautifully told as well! Ayat by Arijit is a fantastic song along with the others like Deewani Mastani etc. I understand that the story may not be everyone's cup of tea but it was a film that seemed like they tried to perfect the details in and the hero of the film was definitely Ranveer overall. I do not consider myself a Ranveer fan but after today I do respect the guy for his amazing work in Bajirao. Him and Deepika have great chemistry and the storyline that much more believable. Highly recommend it!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "yoggwork",
        "review_rating": "6",
        "review_title": "The pictures are still good",
        "review_detailed_main": "The pictures are still good. The colors, accessories and scenes are in place. Both hostesses have high facial values. It's just that I really don't catch a cold about stories."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Abby_qadir",
        "review_rating": "9",
        "review_title": "Perfection, Excellence, Maginficent.",
        "review_detailed_main": "Bajirao Mastani (2015)\n\nBajirao Mastani Directed and produced by Sanjay Leela Bhansali stars in the lead Ranveer Singh, Deepika Padukone and Priyanka Chopra in the lead.\n\nThe movie was a dream project by Bhansali and have been delayed for several years and with several reasons The story was made keeping in mind Salman & Aishwarya in the lead but got never implemented.\n\nThis is one of the finest and the most ambitious movie by Bhansali. The movie is grand in each and every section. It get's 10/10 from me for every minute I spend watching this. The sets, costumes, CGI, cinematography brilliant.\n\nRanveer singh had put his soul in the character of Bajirao Bhallad. He is magnificent with his Marathi accent and dialogue delivery, He must be sweeping many awards for his role. Deepika looks stunning on screen in the role of Mastani and the acting puts an icing on cake. The chemistry between Ranveer and Deepika is marvelous. Priyanka had done definite efforts for Kashibai and she too succeeded well to deliver a good performance. In supporting cast I personally like Mahesh Manjrekar a lot in the role of Maratha King and Tanvi Azmi as Radhabai.\n\nThe war scenes looks splendid on big screen. Bhansali had put much effort to make his dream project a grand success and He already achieved the same. The first half is good with brilliant background score and music. The second half would be a little bored but you can suffice with great acting skills of Ranveer.\n\nForget other bollywood clichéd movies and see a real piece of cinema where we can feel proud to our Industry and make them proud by praising it.\n\n#Surely_Recommended\n\n8.5/10 or 4/5"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "scottshak_111",
        "review_rating": "7",
        "review_title": "Bajirao Mastani is a charred historical saga fossilized under the Indian beds of parochial rules",
        "review_detailed_main": "Bajirao was a mighty warrior pestered by his own internal wars and trampled over as a social pariah.\n\nSLB is all about the big and the rambunctious. So he took the epic project of helming the lost mercenary. The Peshwa who was on his way to rule India, but was deliberately slowed down by his fumed relationships, muck amplified more by societal manacles and religious hindrances, than by his own reckless head.\n\nRanveer aces the character of Bajirao to perfection. With his natural fluency that never leaves him for a second, a Marathi touch that jackhammers every raised voice with a witty comeback or an intervened split, he wears power with confidence. He is flamboyant in his ways, phlegmatic in his attitude towards a situation, and sheer terror when it comes to threatening his enemies. He dons a natural flair and applies it to everything he does something which is quite rare in Indian cinema. That being said, SLB isn't all quilts either. He does focus on crucial bits in the movie, however overlooks the apparent, taking the audience for granted at times. Like all the fight scenes in the flick are quite mediocre and over-exaggerated. If you are not in the rhythm of the movie, they would all seem almost indigestible. But oddly he cashes in on the audience's emotional frequency and creates a superhuman that was a lost face in history.\n\nThe pace of the movie is outrageously fast, that does raise brows at its editing. You almost want to take a pit-stop to breathe, but then comes gorgeous conversations. Crucial, gut-wrenching dialogues that put the saddle back on the horse. The conversation between Mastani and Kashibai and the one between Kashibai and Bajirao before he goes to war (Heads up for that Krishna-Rukmini bit), hammer the nail further down your heart. Extremely stunning talks that reek of human impotency to set broken things right again!\n\nThe ending of the movie, which could have been smacked by a George R. R. Martin blow, ends up getting stretched beyond limit so that emotional Indian audiences connect. At times, the right emotions appear missing from every character's face. There isn't love and yet love is supposed to be there. So, we have to assume, since they weren't exactly looking smitten.\n\nIf all of the above negative aforementioned vibes get overlooked, Bajirao Mastani ends up being a complete package. You can't just ignore its soothing screenplay that is filled with brilliant dialogues and intercepting comebacks. They are witty, well thought of, and well researched. Some are quite cheesy as well, but they have been all mastered and well executed by the actors.\n\nBajirao Ballal ends as a true hero avalanched under the ruins of his own deeds. He lost one of the most crucial wars of his life, the mental one, as steeds race past him and his deadly blade, in his contorted head and he drowns a mortal instead of an immortal unstoppable warrior. Every penny worth epic!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "si-manoj29",
        "review_rating": "10",
        "review_title": "Masterpiece First Half - Brilliant",
        "review_detailed_main": "Masterpiece First Half Just Brilliant...\n\nBajirao Mastani first half has superb production values. Amazing music, brilliant camera work, beautiful art direction and costumes are the main attractions.\n\nEverything gorgeous, dramatic heartfelt, poetic real...An epic film that leaves you wanting for more in second half...\n\nLarge parts of the first half of Bajirao Mastani appear to serve only one purpose, setting the stage for a explosive second half. the pace of the film quickens considerably after the two women in Bajirao's life come face to face...\n\nIntotal, the film is about the two simultaneous battles subsequently fought by one of the greatest warriors known to this country, the first one to expand the Chhatrapati's empire and the other to gain acceptance for Mastani among his family."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "anilk007",
        "review_rating": "6",
        "review_title": "A Lavish Disappointment",
        "review_detailed_main": "A quality period drama film with lavish sets. The film manages to hold audience attention, however, the ending leaves much to be desired. Battle scenes used CGI and looked artificial. Some good dialogues & performances by Ranvir, Deepika & Priyanka is probably drawing the crowds. A pain to sit through and a benchmark for lavish failures. And to top it all, such garbage receives awards."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "anujufriends",
        "review_rating": "9",
        "review_title": "Amazing direction sets and atmosphere",
        "review_detailed_main": "Sir Sanjay Leela Bhansali is famous for his talents which I mentioned in the summary title. This movie was no exception. It was depicted the way it was meant to be depicted. Acting was flawless and the sets, direction was flawless too. I would like to thank Sanjay for bringing to light the great Maratha warrior 'Peshawar Bajirao Ballal Bhat'. Such an important person in our Indian history and I am sad I never came to know of him till now. Thanks a lot for that. Coming to acting, all the characters should be lauded for their performances. This movie needed equal compassion and commitment from each of them to make it what it is and they delivered the same. Maintaining the flow of antiquity and sets was a difficult thing and the director and his team managed it perfectly. Wars could've been made more realistic if possible but the present war direction was enough to throw its impact as the movie was more about LOVE than wars. Loved it, is my rating !!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "indianature",
        "review_rating": "7",
        "review_title": "Bit of a let down after all those awards it picked up",
        "review_detailed_main": "The DVD of Bajirao Mastani released last week and we watched it last night expecting to be in for a treat after all the awards this film has garnered.\n\n45 minutes into the movie and I was wondering what all the hype was about!\n\nThe story is weak and picks up only after the interval. Except for Priyanka Chopra who was excellent in her role, there is nothing brilliant about the acting as far as the remaining cast is concerned. Both Deepika Padukone and Ranveer Singh sizzled in Bhansali's Ram Leela but there was nothing exceptional about their acting in Bajirao Mastani. One cant help the comparison with Ram Leela which had a much more interesting script, better acting and overall was a better film than Bajirao Mastani.\n\nThe music and dance are of course very good, no doubt about that.\n\nWhat I can not figure out is how Bajirao Mastani picked up so many awards? I can think of at least 5 movies released in the same year which were definitely better. Ranveer Singh did a far better job in Dil Dhadakne Do, as did Deepika in Piku. Bajrangi Bhaijaan was far superior overall.\n\nBajirao Mastani is certainly watchable as \"time pass\" but it is not a brilliant movie by any stretch of the imagination."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "darshans-03874",
        "review_rating": "5",
        "review_title": "Not as good as expected",
        "review_detailed_main": "Well I chose this movie over Dilwale cause I found it sensible to watch a beautiful love story(Or so I thought) over senseless Rohit Shetty's hoopla(Which I am pretty sure of).But I was also a little pessimist as this was a Bhansali movie and my last hook up with Bhansali's Sawariya was a very bitter experience.So keeping that thought aside I went ahead to watch this movie.Well visually it is brilliant.No comments on it.But the emotion between Bajirao and Mastani was not bang on.I never felt they loved each other to the end of the world,and this was the biggest let down.Bhansali failed to get the basic essence right-LOVE.It never struck a chord.Priyanka on the other hand was much more effective and I could feel the emotions attached with her rather than Bajirao and Mastani.Well it is not a bad movie whatsoever, neither it is a good one.But surely I don't regret choosing it over Dilwalae.Well however the climax was really funny.I don't know what Bhansali was trying to portray,it was senseless by the way.Well I think at least it has reaffirmed my belief of not watching any Bhansali movie henceforth."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "affablerohan",
        "review_rating": "6",
        "review_title": "It just touched my heart , but banged my brain .",
        "review_detailed_main": "Now, i applaud Mr.Bhansali for choosing a title like this..because in this era where the generations are forgetting India and into technology so much, i guess this can encourage us to read books about the Indian history .But coming to the movie , this ain't a movie man! the start was very good Ranveer And Priyanka were simply amazing they were the best pick for their roles coming to mastani Deepika did well not great as Ranveer And Priyanka but just after 30 min after film started i felt like i was watching a TV serial, 6 episodes together .The end was not justified , it was like the myths .The climax was like all this is happening in 500 BC .Going in background ,the sets were too showy ..too much, Mr.BHansali is known for the colours he puts in the movie, his sets but this went too much .The story could have been a much warrior like along with love well, actually it was but in the second half it wasn't .The film was entertaining some crisp (justified climax) would make it an inspiring film .But apart this Ranveer And PRiyanka -hats off to you guys amazing performance"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "TheFirstExecutioner",
        "review_rating": "8",
        "review_title": "Bhansali's Best Film",
        "review_detailed_main": "Bajirao Mastani is directed by Sanjay Leela Bhansali and stars Ranveer Singh, Deepika Padukone, and Priyanka Chopra. This movie is fantastic. Bhansali did an excellent job as director. As for the acting, only one word can describe the lead trio's performances: BRILLIANT. All the other actors were also very good as their characters. The story follows Peshwa Bajirao (Singh), who is already married to Kashi (Chopra) but falls in love with Mastani (Padukone). It is definitely well-made movie by Bhansali and the crew. As I was watching, it felt a lot like Ram Leela, also directed by Bhansali and starring Singh and Padukone, but it is so much better.\n\nSingh, Padukone, and Chopra give such convincing performances throughout the movie. I could connect with each one of them and look at their characters' perspectives because of how good the performances were. I actually didn't like Padukone's character (not the performance) for most of the 1st half but I ended up liking her at the end. It is a slow movie so you should be patient while watching. The songs were pretty good and so was the dialogue. There are numerous one-liners and they're all great. The costumes and sets were beautiful and made it really look like Maharastra a few centuries ago. And the music is unforgettably good. Finally, the overall message of unconditional love is really powerful.\n\nNow to the negatives. For some of the scenes, they opted to go without sets and instead CGI or green screen. And it didn't look that good. The battle scenes weren't handled too well either since they opted to use CGI and green screen for these too. I understand they weren't the focus of the movie, but they definitely could have been done better. Also, the ending was a bit disappointing. It turned into a some kind of fantasy and it was extremely abrupt. It didn't feel complete. However, that's about it for the negatives.\n\nEnjoyment is the reason I go to movies and the reason I go to watch movies, not satisfaction. And I really did enjoy watching this movie. It has a few flaws but the majority of it is great. With the competition with Bajirao Mastani and Dilwale, Bajirao is CLEARLY the superior film. Guys go check this one out and leave Dilwale for later.\n\nFrom A+ to F, Bajirao Mastani gets an A-."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "negishrishti",
        "review_rating": "7",
        "review_title": "Bajirao Mastani (2015)",
        "review_detailed_main": "Bajirao Mastani is a period drama directed by Sanjay Leela Bhansali, which incorporates the story of Bajirao Peshwa (Ranveer Singh) of Maratha Emperor who fights Mughals for Chattrapati Sahu (Mahesh Majrekar) and falls in love with a Muslim princess of Bundelkhand, Mastani (Deepika Padukone) when she approaches him to save her kingdom. It does look like a Bhansali's movie with grand sets and traditional attires. The cinematography of the movie is outstanding. Each scene on frame looks like so real and appealing.\n\nSome of the scenes in the movie are truly remarkable, the very first scene where Ranveer rides on a horse with a Maratha flag in his hand leaves a solid impact on the viewers. The visuals are mesmerizing including the last scene of the movie where Ranveer is imagining the warriors coming close to him from the high sea waves and starts fighting.\n\nTalking about the characters, Ranveer Singh as Bajirao Peshwa is phenomenal. After watching this movie I could actually figure out that he can do variety of roles. He does not let go the pride of the Peshwa from his eyes for once. He carries that attitude so well in the whole movie. Deepika as Mastani shines out. She looks gorgeous in that attire with dark eyes and passionate love for Peshwa. She also shows her fighting skills in the movie which deserves appreciation. However, Priyanka Chopra as Kashibai is soft, jolly and forgiving. She does justice to her role for whatever time she is there on the screen.\n\nInitially the story is slow and takes time to get into your shoe. But the post-interval story is more interesting as it holds the audience curiosity to steadily reach the climax. The Shaniwar wada palace twist and the last battle in the movie are some of the epic scenes. Bhansali's music score is also amazing. Two of the songs in the movie like Deewani Masatani and Pringa are in the top Chartbuster list. The movie is for sure one-time watch to see the efforts of the stars and watch them doing extremely different roles."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "SivakumarBalachandran",
        "review_rating": "8",
        "review_title": "Sanjay Leela Bhansali's Magnum opus epic Love story on screen",
        "review_detailed_main": "Bajirao Mastani (2015) Review: Here comes Sanjay Leela Bhansali (a.k.a SLB shortly) with a historical romantic drama that is visually enchanting, musically outstanding and has art works that boasts grandeur, dialogues that speaks authenticity, artists who are competing each other in acting excellence what not frames that is etched or what to say hand crafted by SLB. So I guess nothing more needed here truly SLB becomes the real hero of the movie. Bajirao Mastani is an adapted screenplay of the Marathi novel \"Rau\". The plot focuses the love between the famous Maratha warrior Peshwa (Prime Minister) Bajirao I and his Mistress Later Second wife Mastaini and hence the title. So what we get here is purely is eternal love feel between the leads (which would be love between the Peshwa and his first wife and majorly The Peshwa and second wife. So the war sequences are kept secondary, if you were looking for a warrior plot that's going to speak the 41 wars of the Peshwa sorry this is not the movie. The director sincerely devotes the entire play to the love story wherein we see wars as part of the film. Coming to the performances I am confused who will be rated no 1 because all three leads have done 100% justice to the role. Mastani essayed by the bold and beautiful Deepika Padukone (DP) has lifted the character to a real level such a way the transitions in her characters where so well done. Starts as a warrior for her regime turns to a lover converts to a court dancer which then becomes a wife then subsequently to a mother later a mother who fights again for saving herself. So the way DP has done is fantastic like a role where being feminine and bravery transits side by side. Well done DP this would be one of her best roles in her career. KashiBai the first wife of Bajirao played well by Priyanka chopra who is known for her versatility has done a 100% justice to the role. Particularly a lady who shows emotions of her love sacrificing her love. May it be the innocence she shows in her face or those glazed eyes or the lady who runs first with welcoming plate she was a treat to watch. Though her name was not in the title she had an equal weightage in the movie to score well. Bajirao played by Ranveer Singh has taken the role on his shoulders such a convincing way which makes us say that who else can do better than him. Even though I was very skeptical before the movie that Hrithik Roshan would do justice better than him but I changed instantly by Ranveer's dedication and portrayal. Other notable artists where Tanvi Azmi as Bajirao's mother and the role Chimaji appa. We can see Milind Soman who has not been given the correct amount of screen space so we easily forget him in the film. Music was an integral part of the movie which has given the whole feel through the BGM and noticeable songs where \"Diwani Mastani\" \"Albela Sajan\" and \"Pinga\". The choreography of Diwani Mastani deserves a national award. Art works where top notch by the production designers team. Costumes where speaking nativity. Cinematography took us on a ride to the 17th century. Verdict: Get in to know an eternal 17th century Hindu-Muslim star- crossed love story with no commercial adulteration. SLB fans this is a must watch. My rating would be 8 on 10. NB: Waiting for the next SLB film."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Sanjay leela Bhansali makes a comeback",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "lovelivedance",
        "review_rating": "10",
        "review_title": "Exceptionally Beautiful Film",
        "review_detailed_main": "Bajirao Mastani is an epic love saga of a warrior.It is opulent and can compete with Hollywood movies with it's grand sets and attention to detail. The rich color,the beautiful dresses and the beautiful palaces scream grandeur. The comparison to Hollywood films doesn't stop with the richness of the sets or the dresses but continues with the storytelling.SLB has done an amazing job as the captain of the ship.His movies usually tend to for the lack of a better word bore you in the middle however bajirao is an exception.There is never a dull moment.It is a beautiful poetry in motion which will captivate any cine lovers.SLB has been able to extract the best out of all the cast members.He struck gold with Ranveer. He is the Star of the movie. Ranveer Singh as Bajirao brings life to one of the warriors who I wouldn't have known had it not been for this film.He is brilliant in every single frame. The body language is every bit of a warrior and he nailed the accent. Deepika as Mastani is absolutely brilliant as a love struck warrior.Some of the scenes are heartbreaking and she delivers those with panache.She plays her part very well. Priyanka as Kashi bai is Magnificent in the film.Every scene she in is applaudable. Milind Soman does his part extremely convincingly. Tanvi Azmi is great as well. All in all a great ensemble.\n\nEvery single movie lovers deserve this cinematic experience. It is absolutely brilliant. Ranveer Singh is a force to be reckoned with SLB Take a Bow."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ankitbbd",
        "review_rating": "7",
        "review_title": "Good performances and music",
        "review_detailed_main": "Bajirao Mastani is a 2015 Indian epic historical romance film directed by Sanjay Leela Bhansali, who also composed the music of the film.\n\nRanveer Singh as Bajirao was brilliant.He is a good actor and he should choose more roles like this.Deepika was good but I liked Priyanka's acting more.\n\nAs expected from a Sanjay Leela Bhansali movie,Costumes, sets and cinematography were magnificent. Movie mainly focuses on human relations.\n\nMusic and choreography is nice.\n\nBut there is nothing new in the script as movie shows us simple love story drama that we have seen in many movies.,just the way of showing it was different as the movie is about early 18th century.\n\nThis film won nine Filmfare Awards including Best Film, Best Director, Best Actor, and Best Supporting Actress for Priyanka Chopra."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "purpletruths-44786",
        "review_rating": "10",
        "review_title": "amazing movie",
        "review_detailed_main": "what an amazing movie 10/10 for cinematography amazing poetry Amazing dialogues Amazing Acting by Ranveer - Mind Blowing Amazing Acting by Priyanka & deepika Amazing Dance Amazing Music Amazing Direction Amazing Everything - Plz go ahead & watch it\n\nBajirao Ballal (Balaji) Bhat (Marathi: श्रीमंत बाजीराव बल्लाळ (बाळाजी) भट) (18 August 1700 – 28 April 1740), also known as Bajirao I, was a noted general who served as the Maratha Peshwa (Prime Minister) to the fifth Chhatrapati (Emperor) Chhatrapati Shahu Raje Bhosle of the Maratha Empire from 1720 until Bajirao's death.[3] He is also known as Thorale (Marathi for Elder) Bajirao"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "punky_fish42",
        "review_rating": "7",
        "review_title": "Not as much music and dance as you might have wanted",
        "review_detailed_main": "But it's such a lovely movie. I went into it because I saw a video that was just Malhari and I thought the dancing, costumes and set was stunning in that scene, so I wanted to watch the entire movie. There were only about 4 dance sets in it? And Malhari was far and above the best. I really was hoping for more because the choreography was so great, but I still found myself engrossed in the movie despite that.\n\nThe story is objectively ridiculous and ignores a lot of socio-cultural issues of the time in favor of keeping the questionable romance in the limelight, but you don't go into Bollywood for that kind of critique. It's a fun story told in a fun and visually stunning manner, with a great leading cast, and if you just suspend disbelief for what, 3 hours? Then you'll have a great time.\n\nSo yeah, I wish there were more music numbers, but the soundtrack was still great even in the background and I'm really glad I watched it.\n\n(I enjoyed it like it was worth more stars, but I rate movies objectively, and there were a lot of flaws that I could easily ignore but still make me unable to rate it up there with the best of the best. )"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ragarwal-00921",
        "review_rating": "3",
        "review_title": "Waste of Time",
        "review_detailed_main": "Another example of big name producers and directors, in this case Sanjay Leela Bhansali, who thinks that any chum stewed together makes a soulful chowder.\n\nThe viewers struggle to find their own place as the mellow drama unfolds. The movie is historically insignificant as the director fails to establish any time period or a political backdrop. It is hard to believe that the story had anything to do with history other than names and costumes. The viewer is left wondering if the stage was set for 15th, 17th or the 19th century. It did not even matter. Perhaps the director did not even care about historic significance, even if there were any.\n\nThe movie fails on gore and glory, as at times the hero takes on an entire army with two swords that resemble waist belts, imagine that, waist belts! Other times, the said great armies at war appear no more than half a battalion out for a stroll. There is no ferocity of war, no terror of gore, no anguish or post traumatic stress. Some scenes transition are so bad that you almost wish there were a commercial break.\n\nThe movie fails as a romance as the plot is too busy establishing the ineffective dominance of the alpha male. The hero takes on armies but common peons constantly defy him. Court jesters have more political capital and common priests rule all aspects of his domestic life. Our great hero appears as to be a common desk clerk who is barely more than an errand boy. This man is eventually rendered powerless by a domestic peon, barely old enough to shave. Such a pity.\n\nIt is a shame that two great actresses and all their talents were rendered ineffective and driven to dust. What a shame!\n\nWhat utter nonsense, and what a waste of time. Really!\n\nAnd where did they find this makeup artist? What's up with Padukone's eyebrows ... ewe."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "pearlinasilverbasin",
        "review_rating": "7",
        "review_title": "Beautiful and grand, great acting",
        "review_detailed_main": "Bajirao Mastani follows the story of warlord Bajirao (Ranveer Singh) and princess Mastani (Deepika Padukone) as they fall in love against their own better judgment and the wishes of those around them. Many people are against their relationship, not only because of their different religions, but also because Bajirao is already married to Kashibai (Priyanka Chopra).\n\nThis movie is one of the most beautiful movies I have ever seen. Every single shot is visually rich with beautiful set design, cinematography, colour pallettes and costumes. (Some of the CGI isn't very convincing, though.) Only for this I would already recommend people to watch it. The movie's soundtrack is magnificent too; especially the song Deewani Mastani is a personal favourite of mine. Although I didn't like all of it, it has got nice melodies and is very rhythmic.\n\nWhat I disliked in the movie is (although I hate to admit it) how boring it got. In the first act, there is conflict and good pacing in the story, but in the second act it feels like the story is just meandering towards its ending. Any touching moments felt unearned because it was hard for me to stay invested in the story. Also, they barely age even though the story takes place over 15 years or something?\n\nNevertheless, Bajirao Mastani is a beautiful and touching movie, and I recommend people to watch it."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "shubhranshujoshi",
        "review_rating": "10",
        "review_title": "Bajirao Mastani:an epic historic tale",
        "review_detailed_main": "Guys believe me you will hold the chair after the interval,It's like a unbelievably awesome movie.You can't blink your eyes , the movie is so good. Ranveer Singh has given his best , what i felt.Priyanka Chopra acting will make you think ,make you cry.Deepika Padukone is beautiful in the movie,not so great acted.But The dying scene of Ranveer Singh,you can imagine that how a humane being feel during death.The Deewani song is simply superb.The music is like the blood of the movie and flowing all around the nerves of the scenes.Themovie is bit boring in the first 20 minutes.It started showing charismatic after Deepika is meeting Ranveer.Each and every bit of movie is exceptional.The classical music will take you to a Darbar."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "writevikramojha",
        "review_rating": "10",
        "review_title": "Theatres charging should be charging more to watch this movie",
        "review_detailed_main": "I don't know what happened with real Bajirao Peshwa but after watching this movie, I am really impressed with the whole presentation and emotions attached to this movie. I really felt it's real and this is how everything must have happened. I went to Wiki after watching this movie to know about each character, specially when I came to know shamsher bahadur died at age of 27 some way I felt good that he survived, because in the movie they didn't tell us anything about it...I know movie was about just Bajirao. But thats the kind of interest this movie created in this character. Best thing is it shown the best Hindu/Muslim love story....A real metal!!! Its been made with at most sincerity, I respect that. God bless!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "gsangam",
        "review_rating": "9",
        "review_title": "Another masterpiece from Sanjay Leela Bhansali. A must watch movie",
        "review_detailed_main": "Another masterpiece and stroke of genius from the one of a kind director Sanjay Leela Bhansali. The movie was very well made and depicted the grand cultural aspects, traditions, bravery, costumes, Love, and politics of Maratha reign in 17th century and with the big takeaway that was evident in those times and now that true Love transcends religion, region, traditions and politics. He picturised the great peshwa Baji Rao's story with very creative settings, costumes and character makeup.\n\nGetting into the details, nothing more to say about the superb direction, music and story by Sanjay Leela Bhansali. This is one of his best movies I would say. I hope he makes few more of these masterpieces for us in our lifetime. The acting of Ranveer Singh as Baji Rao, Deepika Padukone as Mastani and Priyanka Chopra as Kashibai, Bajirao's first wife were exceptional. The power-packed screenplay and witty dialogues by Prakash Kapadia were notable. I really enjoyed the dialogues of the characters with the rhyming short verses in sweet Urdu and popular Hindi with Marathi flavor. The costumes, choreography, dialogues and set designs were phenomenal. The music was melodious with at least three very good songs.\n\nWhat could have made the movie even better were that the war scenes could have been filmed better. They were short and not shown with the description of plans using models like other movies have shown for at least one critical war he won. In that way we could have seen how differently and cleverly peshwa Baji Rao thought and executed his war strategies to win all his 41 wars. Also, some maps of his kingdom could have been shown to know how big he made his kingdom from the time he became the peshwa, etc. I felt that detail was missing.\n\nOverall I would say its a very well rounded created movie about one of the legend of Indian history and movies like these help our generation and future generations to appreciate the heritage of the great Indian history and the diversity of religions, cultures, languages and traditions that were integral part of it then, now and I am very confident will continue in future."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ssrirocks",
        "review_rating": "9",
        "review_title": "Live the epic through the excellent fraternity",
        "review_detailed_main": "Complete gratification to the expectations.\n\nA perfect treat for classical-musical-epic-movie lovers from the Indian Shakespeare Sanjay Leela Bhansali.\n\nWhat impressed:\n\nDialogues: Prakash Kapadia way to go!! Those who understand Hindi would get goosebumps often, hearing them all. Highly thought provoking, boundlessly sensible and completely mind-boggling.\n\nSets and locations: My eyes just couldn't stop scanning inch by inch of the screen amazed by the exuberance and flamboyance. A perfect treat for antique and art lovers.\n\nCostumes and accessories: Man! Anju Modi has killed us all. How brilliant and skillful. Excellent dedication is very much evident.\n\nBack ground score and Music: Already its 5/5 from my side.\n\nStory and screenplay: No one can compress a big history into a brief but complete screenplay so brilliantly.Kudos!\n\nAbout casts: Ranveer: 10/5. Initially I was doubting the choice but he has rocked and proved himself. He would go a long way from here on.\n\nPriyanka: Perfect and mind-blowing. Has done 200% justice to her role. Though she didn't hold the title role, by her performance she has over bowled Deepika. Super dedication exhibited in everything. Kudos!\n\nDeepika : Has done justice to whatever she was given except the dance part. Though she is a classical dancer I wonder she left me feeling Priyanka(non-classical) danced better than her. No complaints about her acting and perfectly portrayed the role of a warrior princes.\n\nTanvi Azmi: Mind boggling and brilliant fraternity. No wonder, her experience speaks.\n\nAnd each and every cast have done complete justice to their role.\n\nNo explicit complaints or flaws. Do not miss to live the epic."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Tiresome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "tusharait",
        "review_rating": "9",
        "review_title": "Archetypal Bhansali at his very best.",
        "review_detailed_main": "Bajirao Mastani is the archetypal Bhansali at his very best. With the supreme aura he creates around the characters of his movies, coupled with stupendous cinematography and nearly flawless portrayal, his are kind of movies that continue to maintain the link between the extravagance of Bollywood's initial trendsetters to contemporary storytelling, all as he meticulously makes you see what he wants you to see. To his credit, you can almost always predict the outcome midway, but yet in a rather furtive way he forces you to lurch back into what's going on the screen. And while I'm not sure how accurately the legendary Peshwa and his whims and fancies are depicted, Ranveer Singh sends a shiver down your spine when he howls the war cry or when he snubs his detractors. Much as Priyanka and Deepika get engrossed in their own trances. Such valorous attempts to bring on the screen the magic and glory of heroes from our vivid past - ones who couldn't get deified like a chosen few, should be genuinely appreciated and celebrated."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ankitsharma-44437",
        "review_rating": "10",
        "review_title": "A Fabulous Film with great cast and oussum direction..",
        "review_detailed_main": "Mind blowing film by Sanjay Leela Bhansali, with alluring sets,locations, music, dialog's, acting, Screenplay, intense love , beautiful love story...all of it it is magnificent.\n\nEvery cast give 100%...specially #Ranveer's as warrior his body, actions attitude #Priyanka's expressions of love, jealousy...anger & #Deepika's beauty & chemistry between all three of them is amazing...all capture's heart of a viewer and their acting will we remembered until the end of their careers.The music is pure and quite amazing.\n\nThe film have than expected. I'll definitely watching the movie again , I say you must watch its addictive and appealing, just loved it. I say must watch #BajiraoMastani."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "gauravjdp",
        "review_rating": "10",
        "review_title": "Awesome Movie....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sa_a",
        "review_rating": "9",
        "review_title": "A soul catching film. HIGHLY RECOMMENDED",
        "review_detailed_main": "Bajirao Mastani- 2015 Director: Sanjay Leela Bhansali\n\nBajirao Mastani is a story of Maratha Warrior Peshwa Bajirao and warrior princess Mastani. Mr. Bhansali has made a lifetime record of perfection and magic together. The war scenes in the film are crafted at high scale with awesome dimensions. He is known to paint his artistic and unique thoughts on cinema screens. This Magnum Opus will melt your heart and leave you numb at the end. With Sheer Brilliance of camera work,direction, screenplay and music composition, it is staggeringly prodigious. The dialogues are Huge & Deep. The credit for Splendid cinematography goes to Mr. Sudeep Chatterjee. Just WOW! The decor and sets are majestic, exquisite and extravagant #Bajirao (a.k.a) Ranveer Singh has nailed it with his pageant and superlative performance. Being a hard core warrior and the most precious thing Maratha's ever had; he fought 41 battles and won all of them. The tragedy begins when this warrior won every challenge in his life but lost himself when fell in love with #Mastani. What Intensity, Pride, Courage, Love all in one man Peshwa Bajirao! He has shown tremendous acting skills and left the audience numb with with his heart-catching work. Loved it. I tip my hat to you Ranveer Singh.\n\n#Mastani (a.k.a) Deepika Padukone is a warrior princess and a lover. Mastani was terrifically brave at heart and sword both. Knowing the fact that loving #Bajirao will make her walk on thorns but still she dared to love Peshwa. Charming & deadly gorgeous Deepika has acted with her eyes. Love shines with every expression given by Mastani. She has given unprecedented nuanced performance. The dialogue delivery by Deepika was totally incredible & unbelievable. She gets humiliated countless times by #Bajirao's family but still her love for him never fell an inch.\n\n#Kashibai (a.k.a) Priyanka Chopra So electrifying. She has done complete justice with her character. Kashibai loves her husband to death. Each time she looks at Raao her face lightens up. When Bajirao fell in love with Mastani, his wife Kashibai doesn't surrender to this. She is angry. She is heart-broken, doleful but still she asked Bajirao to save Mastani's life when some men were sent to Mastani Mahal to brutally kill her. Kashibai surely had generous heart and for the sake of her husbands happiness she accepts the situation as she was aware of the fact that #Mastani has become #Bajirao's weakness. Take a Bow Priyanka Chopra .\n\nTanvi Azmi has played the mother of Bajirao. She was the villain and a mother both at the same time. Very skilfully and beautifully she has shown the positives and negatives in one character.\n\nAnju Modi has loaded Ranveer Deepika and Priyanka with the most extraordinary costumes.\n\nMr. Bhansali handles Bajirao's arrogance, Mastani's obsession for Bajirao and Kashi's dignity most sympathetically. Every visual is a Grand painting with music being the soul of the film. The choreographers has put in great energy and marvelous art in making of #Malhari #Pinga and #DeewaniMastani. Every emotion in the film- be it love, virtue or heroism on the battlefield- is translated into grandeur.\n\nAfter #DDLJ I think Bajirao Mastani deserve to stay glued on cinema screens and complete 1000 weeks."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sukh-92191",
        "review_rating": "2",
        "review_title": "Much ado about nothing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "koushikdas508",
        "review_rating": "8",
        "review_title": "A piece of cinematic brilliance by the Masterclass Craftsman SLB !!! Priyanka sparked !",
        "review_detailed_main": "SANJAY LEELA BHANSALI !!! __/\\__ The man who is one of those rare modern directors who firmly believe that film direction is a piece of Art. Baring Saawariya(I didn't watch) & Ram Leela(I didn't like), he directed some renowned Masterclass films like Khamoshi, Hum Dil De Chuke Sanam, Devdas, Black & Guzaarish. Almost all of his directorial had a touch of sheer crafts-work which is worthy to be praised a lot. BAJIRAO MASTANI is also not an exceptional in that perimeter. The ravishing & well-decorated set, spectacular cinematography, brilliance on-screen performances, soulful music, gritty dialogues, creepy story-line & mostly the touch of that mythical direction of the craftsman himself, the one & only SLB. FANTASTIC! (y) Discussing about a historical period drama which is one of my most favourite genres, two criteria are very important. 1) How did that period drama manipulate with the actual events in history? & 2) How many over-the-top scenes are there in that drama?\n\nAnd I must say that SLB's recent directorial venture succeeded in the 2nd perimeter as only 1 or 2 over-the-top scenes are there in the film. & those can be obviously excused as period drama can be 'Larger than life' at times. & For the the 1st criteria which is bit controversial as many people are saying that Kashibai couldn't dance because of her diseases. Nevertheless, excluding that part, the whole scenario of that period of Maratha Peshwa Bajirao I & his love for Mastani of Rajputana clan has been executed perfectly, IMO. Stepping way ahead of his contemporary actors, Mr. Ranveer Singh did a remarkable job which will be remembered for a long time. Miss Deepika Padukone is continuing to shine film by film. Her screen presence was a treat to eyes. But, expectedly, comparatively more experienced Miss Priyanka Chopra stood tall as she has been the soul of the film not only for her screen presence but also for her character which is quite difficult to portray & SLB has chosen the right person for the role, which proved as a master stroke! Tanvi Azmi as Bajirao's mother sparkled among the rests.\n\nOn a nutshell, SLB's Bajirao Mastani is a Grandiose creation which reminiscing the flavour of his previous cinematic colossal like Devdas or Hum Dil De Chuke Sanam. If you a fanatic of Good cinematic creation, then it is surely your 'cup of Tea'. Just loved it !\n\nP.S.: Thanks Torrentz for letting me know that I should definitely go for this film at theaters."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "nig-vab",
        "review_rating": "8",
        "review_title": "Spectacular but had flaws, could have been better...",
        "review_detailed_main": "The movie reminds me of Bhansali's earlier films, Devdas and Ramlila. Each and every scene in this film is just \"Spectacular\" and soothing to eyes. Everyone performed amazing. Deepika looked damn gorgeous.\n\nBut apart from these, the movie had some major flaws and was not able to draw attention of the audiences till the end. Several reasons for it. - Everything except the love story was moving so fast and could not make the right impact. - There was no such war which proved bravery or intelligence of Bajirao. - After entry of Mastani, each 5 minutes duration of movie was followed by a song which was a little irritating. - Movie makers failed to well present the departing of Bajirao & Mastani and the pain of separation or even the cruelty of Nanarao.\n\nI know if the movie is based on some historical events, there is very less scope for improvisation. Still I would say it could have been better.\n\nBut if you loved movies like Devdas, you should definitely not miss it."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "raoadi1014",
        "review_rating": "8",
        "review_title": "Bajirao Mastani is a Magnificent movie!",
        "review_detailed_main": "Bajirao Mastani is Sanjay \"Leela\" Bhansali's most ambitious project which he had initially planned to make with Salman and Kareena in the lead...the film never got made due to various reasons. After reading some positive reviews on this forum and some sites, I decided to watch it without high expectations as I didn't like SLB's previous movie Ram Leela. But after watching BM i have no hesitation in saying that SLB regains his magic touch with BM! Yes! Its a magnificent film!! A film which deserves to be seen only on the big screen because of the spectacular sets, the breathtaking cinematography, beautiful colorful costumes, sheer grandeur exhibited and the fantastic performances from the lead actors. Ranveer Singh as Peshwa Bajirao has given a performance of a lifetime. His dialogue delivery with marathi diction, body language and fighting scenes pack a punch... This is his best performance till date. Same with Deepika...She has acted brilliantly as Mastani. In fact I liked her performance more than Priyanka, who is also very good in the film. Milind Soman has a good substantial role and he does well. The music is okay, it could have been better. Choreography and the picturization of songs was noteworthy! First half is good with includes a terrific war scene, second half could have been bettered with some editing specially towards the climax as the movie drags, but no complains! Overall the movie keeps you hooked on...and one doesn't loose interest. The peshwa culture is shown with authencity and Shaniwar Wada palace, Mastani Mahal shown are fantastic! To sum it all up- BM is a labor of love...everyone has put in their heart and soul in this film which is evident while you see it...Go and watch on the big screen and experience one of the best movies of this year! Great comeback from SLB...he is a very artistic n sensitive director...the K Asif of our times."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "watharkarhemant-12048",
        "review_rating": "8",
        "review_title": "Bajirao Mastani--What a movie!!",
        "review_detailed_main": "It is a very good movie. takes you to the Era Of Peshwai in Maharashtra for while..The movie is having little bit slow pace due to unnecessary songs. But the action scenes and acting takes you to high point of entertainment.The no of battles could have been more rather than romantic scenes. Also the end could have been better..The selection of star cast for characters is perfect, everyone has justified their selection. Music is also nice, stick to the era picturised. Overall its a good movie and must watch in theater at least once. After long time somebody has taken efforts to Produce and Direct such movie in Bollywood...."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "emailaleew",
        "review_rating": "2",
        "review_title": "Sawwariya was better than Bajirao Mastani",
        "review_detailed_main": "I had gone to watch the movie with high expectations as I am a fan of Sanjay Leela BhansalI and had loved all of his previous works, except Sawwariya. I expected the movie to be of the same class as SLB's last Ram Leela. But it was not the case. Before the interval, I got bored as hell. Except for a few scenes the movie is good for nothing. I, seriously have no clue why there is so much hype about the movie. I don't know when was the last time I got that bored. I am not going to forgive the movie makers even if they return the money of my ticket. I advice all to avoid the movie. Even if you are going, do not go with much expectations. A big disappointment, it was. One word: Disastrous."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ruchiverma3",
        "review_rating": "8",
        "review_title": "Excellent Cinematic Experience with blend of Drama and Real Historically Evident Story",
        "review_detailed_main": "Sanjay Leela Bhansali is back again with a great piece of cinema having nice blend of drama and reality.\n\nWithout any delay, right from the beginning the story heads towards the core subject and involves audience with the progressing instances. Music, songs, costumes, background score and performances are just right with perfection at each step.\n\nAt some points I found drama over-powering reality but that goes in the course of moving instances one after the other.\n\nPerformance wise all are good Deepika, Ranveer, Priyanka and Tanvi but what caught my eyes was Priyanka's screen presence and power-packed acting in handful of scenes.\n\nShe deeply depicted the plight of a loyal wife who suddenly needs to deal with her husband's infidelity in the name of adjustment to make it part and parcel of her life.\n\nDeepika was great as an ardent lover and a strong warrior women.\n\nRanveer got the most to do with his one of the best performances portraying an honest army lead who is supposed to be strong at heart but still a person dealing with his love, responsibility and conventional religious beliefs of the time.\n\nAt 2nd half movie looks to be stretched a bit and could be edited to maintain the pace .\n\nOverall, a must watch for all cinema lovers."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "siddharthbarjatya",
        "review_rating": "10",
        "review_title": "Best Bollywood movie of the decade",
        "review_detailed_main": "Undoubtedly, Bhansali's best ever production. Best movie for each of the artists in the movie. Best movie for last 10 years for me. This movie has shocked me and have proved that the wait for it was worth it. Deepika looks awesomely beautiful, Priyanka has shown that she deserves to be rated as the all time great actresses of Bollywood and Ranveer has won everyone's heart. Cinematography is outstanding and we can see each scene at a time without even knowing the story of the movie. This movie has gone beyond the story line and plot and has asked us to go for the real drama and acting. Placement of songs is just right and songs overall are melodious. I bet that after watching the movie no one will ever try to challenge me on any of the point.\n\nI have seen the best movie of my time till now and proud to have one from Bollywood. I just wish Bollywood come out of all the stardom and create such a piece more frequently"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sanssunny",
        "review_rating": "10",
        "review_title": "Bajirao Mastani = AWESOME ACTION + ROMANCE MOVIE!!!!",
        "review_detailed_main": "The whole movie is just a great experience. It builds up nicely. I felt it important to post this review as some reviews just say it is big on costumes. That is not the case. Priyanka Chopra is beautiful and looks great in the Navaari Sari. Deepika looks pretty as a sword wielding princess and Ranbir Singh is strong and Muscular and Great Acting as a warrior. Good story on the Unsung Maratha Heroes who fought the Big Moghul armies and won. Lots of horses, sword fighting and Battles to keep you action fans on the edge. The tussle between the 2 ladies for the heroes affection and the politics that happened in the Peshwa era are an eye opener."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "amankool34",
        "review_rating": "10",
        "review_title": "Something so magnificent that u can't miss ;)",
        "review_detailed_main": "So,here comes one of the most anticipated films of 2015 Bajirao Mastani.! The start is so sensational that it will keep you engrossed in the film. First half is crisp and excellent no complaints but however the film's speed decreases a bit post interval when compared to first half but still u will not get bored because it is also good. Ranveer Singh is just phenomenal and perfect for this role no one could have played this role better than him. The way he perfected Marathi dialect and a warrior's body language is so perfect that u will just love him. Same goes for Priyanka. She succeeds in bringing out the agony and pain of Kashibai. Deepika performs weakest of the three but still she is okay. If confused between Dilwale and Bajirao then please go and watch Bajirao Mastani because films like this need support :) Get ready for phenomenal,grand,majestic,beautiful and emotional ride with this one. You won't be disappointed :)"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "lediscipledessocrates",
        "review_rating": "5",
        "review_title": "In Passing",
        "review_detailed_main": "It is heartening to see that regional cultures and languages are being integrated to create a unified body of literature.\n\nThe most commendable aspect about this movie the linguistic detailing . It was impressive to watch Ranvir Singh delivering dialogue with a appropriate demeanour.\n\nHowever, as always , bollywood reverts to the browbeaten track of glorifying \"Love\" or as we can safely say \" Filmy Love\" .\n\nGiven the solid introduction depicting Baji Rao as a resolute leader and patriot , it seems strange that the director allows weakly developed love angle to hijack the story , abruptly.\n\nThe individual performances are quite alright , but the story line is rather weak .\n\nI am not sure regarding the historical accuracy of the plot and hence would not comment upon it.\n\nThe movie could have been much better had it been been focused. Still, It is a one time watch .\n\nNot a bad effort but then not a stupendous one either."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "gsveto",
        "review_rating": "10",
        "review_title": "now read review thoroughly",
        "review_detailed_main": "This movie starts with extraordinary stuff... every single word spoken in movie goes deep in your mind and heart..... Now visuals best till today...... Songs awesome..... This movie is for classes masses don't like this because it is beyond there brain thinking capabilities........ performance are infinite times better than what i think about these actors.......\n\nThis movie replaces MUGHAL E AZAM..... Now the man behind this SANJAY LEELA BHANSALI sir u steals the show....... As we know Indian cinema they produce very few class movie but sir sanjay boom I personally believe that this movie will be on top of the IMDb list but the problem comes with masses they are unable to get the real depth of movie congratulations indians have proud on this movie"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "shreekara-1995",
        "review_rating": "8",
        "review_title": "Brilliant Art Work",
        "review_detailed_main": "Historical drama movies can easily get connected with the viewers because of its pre known facts about the events and personalities, the excitement to watch those characters on screen rise the curiosity among the viewers, if any director planning to make a movie with much vibrant colors, extravagant sets and wonderful music, dance then obviously the storyline with historical touch would be the good selection, Sanjay Leela Bhansali well known for his colorful movie presentation and lavish sets is back again with his typical film making style, ''Bajirao Mastani'' is the mirror held to this 'art' director's work.\n\n\"Bajirao Mastani'' narrates the story of a Maratha warrior and covers his act of valor and bravery in a soon start and focuses much on Bajirao and Mastani's relationship and the remaining plot revolves around the further building situations, Ranveer Singh with his carrier defining performance bewitches the viewers and gave a try in getting into a new form from his typical image, but he never missed in enchanting his typical charm in even such historical role, Deepika looks amazing and gave her wonderful act as Mastani, she provides full justice to her role, whether it might be in showing off soft side and affectionate part of the role or getting into the rhythm of actions and fights, she has given her best, Priyanka seems much convincing as Kashibhai, as it was much challenging and quite tricky role, she is to be appreciated for her tremendous acting.\n\nMr. Director Bhasali with his grandeur story narration bought another beautiful work on screen, every frame is a piece of art and a grand viewing treat to the audience, it might be the scene of showing Peshwa's glory in wars or presenting the emotions through dance and music he does it wonderfully, importance were given to each and every peculiar aspects in the frame, music are very good and syncs so perfectly with every frames, cinematography by Sudeep Chatterji is marvelous, dialogues and the character presentation on screen are honorable points of this colorful art."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "maulin5",
        "review_rating": "9",
        "review_title": "Bhansali Ne Public Ko Movie Dee Hai, Timepass Nahi!",
        "review_detailed_main": "First of all, let me clarify one thing that I'm not a fan of Sanjay Leela Bhansali. So, this is a very genuine review of his latest film. Story is based on Bajirao and Mastani's love story. History is somehow different, but, the film is classic. The sets and costumes of Bhansali's film are always wonderful. This time I found that the major plus point of the film is dialogues. Though performances wise, all the actors have done a great job. But, then also, the impact of the dialogues is very much high. I remember that I used to say something as the appreciation in every two-three minutes, because every one is delivering sharped and pointed one liners. Which can attack you on your head but leaves the scratches in your heart. Music is wonderful. Because of the promo song of Deewani Mastani which was used to be shown in the theater before the release, has made me to watch this on the silver screen. Pinga is also a delight watch. Remo has choreographed it really well. Aayat is nice. The new version of Albela Sajan is also there. Malhari is very energetic. I don't like only Mohe Rang Do Laal. I think most of the viewers may get bore during that song. Lyrics are suitable. Ranveer Singh has delivered an award winning performance. May be this year, all awards will be given to him, as I don't know any other good male competitor is there, except Sushant for Bakshy. I don't like Deepika, so if I write something about her, you may get angry on me. I like Priyanka, and she has given a fine supportive performance. Though, I want to see more, but, she is perfect in this role, as it has many shades of an Indian woman. Tanvi Aazmi as Bajirao's mother, has given a powerful performance. All the others are suitable. Irrfan's magical voice is there, too. Scenes are very dramatic as well as real. So, you may find that it is just a story, but, will definitely connect with the characters as the film runs. I don't find it boring. May be first half is slightly longer. Climax is superb. There is some emotional touch in it that my eyes get wet. Sanjay has given a super-hit movie. It's up to public now. Skip Dilwale. Go and watch this, you will love it for sure. May be I'll go for the second time, too. As Bhansali Ne Public Ko Movie Dee Hai, Timepass Nahi!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rajendrasinghpatel",
        "review_rating": "10",
        "review_title": "Awesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys rocked",
        "review_detailed_main": "Awesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys rocked.\n\nAwesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys . Awesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys Awesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys rockedAwesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys rocked. Awesome Awesome Awesome Movie. Thanks Bhansali for creating such a legend movie. Ranveer, Priyanka & Deepika you guys rocked"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "dineshprakash",
        "review_rating": "4",
        "review_title": "Spectacular but very slow and shallow",
        "review_detailed_main": "Director Mr. Sanjay Leela Bhansali means every frame must have been like painting and it is true here also but he got carried away in visually grandeur rather that enhancing emotional quotient. Screenplay by Prakash Kapadia and Director himself, is either flat, repetitive or over board, like the scene where Baji Rao puts hid hot dagger on Mastani wound, what was the purpose of conceiving it, was it for care, cure or just an excuse for first hug!? After being touched with hot dagger I am unable to understand how can one think of love and even with that person!? In intro scene she also gives a cut mark which was one note above. Dialogues by Prakash Kapadiya are gems, very meaningful and worthy. Like when Mastani justifies the value of color, or confront conversation between Kashi Bai and Mastani are fantastic. I couldn't get the walking in pond metaphor, like Baji Rao walking in home pond when he meets Nizam of Dakkhin, then meeting with Mastani and then Kashi Bai pulling him into a pond to walk? In anger, love and care always he prefers to walk in water!!! In any emotional scenes it rains heavily, it is an easy way for any creative person to think rain scenes, when they are unable to make audience to shed tears by inducing correct emotions they try to hide behind rain drops. I was just untouched with the main love track of Baji Rao and Mastani. It was very shallowly established. A scene, where Kashi Bai tries to blow off Deeya in front of Baji Rao is very good, fresh and has loads of emotions but then goes over board in another metaphor by showing ageless small cut mark on neck of Baji Rao by Mastani, because it was done by his love interest? Very often film faintly reminds of Mughl-E-Azan and prominently Devdas, even in back ground, dance of both rival heroines or in dialogues, climax just hammer you to must remind. First half is very slow, pre climax is intense and emotional but again drags badly in over stretched climax. Rather than showing good scenes to establish character or conflict they just start showing songs, which worsens the already slow pace. Performance wise Ranveer Singh as Baji Rao, is OK. Somehow I am not totally convinced by his performance of portraying such a historical heavy character but he needs special appreciation for his fine nuances of Marathi accent in dialogues. Deepika Padukone as Mastani, is par excellence. She is just astonishing in every frame with full of emotions on face and in voice. Priyanka Chopda as Kashi Bai, is very impressive. Milind Soman is good. Music by Director himself is OK. Two tracks \"Main Deewani Mastani\" and \"Aayat\" are melodious."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "anilkumaroct-86786",
        "review_rating": "9",
        "review_title": "Splendid and Grand",
        "review_detailed_main": "Bajirao Peshwa is portrayed really in an exceptional manner. He was a great warrior and that is completely realized in the movie. Sanjay leela Bhansali has done an extra-ordinary job by doing emphasis on love story of Peshwa and Mastani without giving up the impression of a great warrior-ship of Peshwa. I like Mastani's role the most. It can be clearly seen that she was born and lived for Bajirao. Deepika did a proper justification to the role. Wikipedia also says she lived as long as Peshwa lived. Both hearts beat together and stop together. Ranveer Singh was also splendid, so was Priyanka Chopra. There was certainly some exaggeration and mutation of facts to make the movie more interesting. But more or less, Movie goes what Wikipedia says. Hats off to the entire team. I had a great great time watching the movie."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "parinitaa",
        "review_rating": "9",
        "review_title": "The Tale of Love, Passion and Sacrifice",
        "review_detailed_main": "Sanjay Leela Bhansali has gone out and created magic on screen once again! This film is absolutely brilliant - in terms of performances,cinematography,sets and depiction of story.\n\nRanveer Singh has proved again that he is an intense actor in the way he walks the talk of being Bajirao! His portrayal of the character is outstanding. The authenticity that he has brought to being Peshwa is fantastic. You can feel the winning streak, love and the pain.\n\nMastani (Deepika Padukone) looks quintessentially beautiful with the perfect glow and costumes. Deepika has outperformed herself in this character. Her eyes speak volumes when playing Mastani in showcasing the bravery, self-respect, passion and sacrifice for love.\n\nPriyanka Chopra (Kashibai) has played the loving and hurting wife beautifully. Although sidelined, she marks her presence in the film.\n\nTanvi Azmi (Radhabai) reminded me of Ila Arun (Mahamanga) in Jodha Akbar as the i-know-what-is-best-for-my- son mother. Strong and unrelenting, she has shown her versatility as an actor.\n\nMilind Soman has yet made another small yet powerful appearance and did make an impression.\n\nOverall, the film is yet another love story set in the 18th century and will transform you to that era. The costumes and sets are beautifully chosen. If you like loves stories, it's a treat for you!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "kishchand",
        "review_rating": "10",
        "review_title": "Bollywood finally hits the mark with raw human aspects.",
        "review_detailed_main": "Living all my life overseas I rarely get excited for a Bollywood production, though there have been a few in the past that have been nothing short of amazing and after watching Bajirao Mastani I am proud to say that this film tops all of them.\n\nWithout going into much detail (so you can not only watch but experience for yourself) the only downsides I found was a few ex-machimas and a slightly slow narrative which eventually fallout and allow the narrative of the gorgeous film to play out perfectly.\n\nThe film is epic and grand from the simplest forms, from the sight of mere lighting to the grand and visually pleasing battles the film hits a home run on the technical side along with amazing and thrilling background score to tie the constant moving imagery together.\n\nIts not hard to fall in love with the cast and their formula shows on screen from simple laughs of Bajirao to the tears of Mastani, all characters are interesting and drive to give you an insight in the real life emotions of an old empire film - and that's what sold me - the human aspect.\n\nThe songs, costume, dialogue is something everyone tends to write about and I have yet to see a person dig deep to find a theme, idea or aspect bit I am proud to say I found one and that is the simple human aspect of the film.\n\nBajirao was once a powerful empire and Ranveer Singh does well to show the rulers human side. We see his imperfections, his flaws, his ignorance and corniness and it's something we can connect with.\n\nAfter watching so many 'masala films' I am proud to say Bajirao Mastani far exceeded my expectations and after a slight dull start the film flows into a dramatic experience in which I've wanted from Bollywood. I love this film and the reception of the film is open for debate but remember a beautiful gem is only found once and Sanjay Leela-Bhansali will only make a few films in his life and Bajirao Mastani is that silver lining, not only for him but for Bollywood. Even my foreign friends loved the culture, the colors, the raw power of the film that is Bajirao Mastani"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "agouchteelmehdi",
        "review_rating": "10",
        "review_title": "Film of the year... or maybe of the decade !!!",
        "review_detailed_main": "I was waiting for a nice movie... now i think that i watched the best film OF MY LIFE !!! Everything is perfect, actors, acting, artistic direction, song ... Sanjay Leela Bhansali created with Bajirao Mastani the summum of his art ! Actors did an amazing job, they acted with body, eyes... we feel that everything is tremendously deep !!! I think that every one should see this movie at least 5 to 6 time each year, and it should be learned in every cinema school because it will show to the futur generation of every discipline in the cinema ( sound, costume, realization, scenario, dialogue, actors... ) what a masterpiece is or should be. Bajirao Mastani IS THE FILM OF 2015 & THE FILM OF MY LIFE Thank You mr Sanjay Leela Bhansali."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rupeshkr-14888",
        "review_rating": "1",
        "review_title": "An undefeated hero becomes Devdas in Bhansali Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "engashutoshec",
        "review_rating": "10",
        "review_title": "This Movie is Sheer Class",
        "review_detailed_main": "Picture Perfect. This movie has not even a single dull moment. I became a fan of Ranveer Singh. Those who will miss this in 70 mm will regret for life. I never really liked Ramleela, But I will respect SLB after this a lot. Priyanka has portrait all the conflicting emotions beautifully, Deepika is reigning queen of Bollywood. I would specially like to mention the Fight sequence in which they try to attack Deepika's son. While Fighting Back Her eyes spoke a lot. Picture Perfect. This movie has not even a single dull moment. I became a fan of Ranveer Singh. Those who will miss this in 70 mm will regret for life. I never really liked Ramleela, But I will respect SLB after this a lot. Priyanka has portrait all the conflicting emotions beautifully, Deepika is reigning queen of Bollywood. I would specially like to mention the Fight sequence in which they try to attack Deepika's son. While Fighting Back Her eyes spoke a lot."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sreekrishnagirishkumar",
        "review_rating": "10",
        "review_title": "\"Bajirao\" is dashing in first place while \"Mastani and Kashibai\" is cheering for him... 95/100",
        "review_detailed_main": "First of all, I thank Sanjay Leela Bhansali for making this movie because this movie made me smile (and cry).\n\nThis movie tells us what most romance movies tells us \"Love is eternal, and Castes and Religions are not part of it\". But this movie, also contains something that romance movies doesn't have, none other than epic history. \"Goliyon Ki Rasleela Ram-Leela\" was an OK movie, and this movie is 3 times better than Ram-Leela. All the music was awesome especially \"Deewani Mastani\" and \"Mohe Rang Do Laal\", and Priyanka nailed her role as Kashibai while Deepika as Mastani was satisfactory, although Deepika's dance was really good, made me remind of Devdas, which was also directed by Bhansali. Get a ticket now guys!!!!!!!!!\n\n95%"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "withlovemilind-1",
        "review_rating": "8",
        "review_title": "Ramleela of Deepika & Ranveer Continues......",
        "review_detailed_main": "First thing i need to thank Mr. Bhansali for remaking Ramleela in Bajirao Mastani ,whoever missed Ramleela on big screen must go for this as lightning has struck twice in Bhansali land . The Maverick director has proved that he is Gold ( as shown lavishly in his movie ) and his co-actors are the two diamonds in the sky. With BM the true Indian movie is showcased and would love others in the fraternity to start showcasing the clout our country had over the historians . The stage is set now for to move away from the cheap and crappy Hindi movies , and sadly the time for just another movie with song,dance,comedy,action & srk/salman is gone . Quality cinema is the need of the hour & lets have it . Cheers to Bajirao Mastani ."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ranjaeco",
        "review_rating": "8",
        "review_title": "A magnificent movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "amitkray",
        "review_rating": "5",
        "review_title": "First half is OK but second half is total waste",
        "review_detailed_main": "The movie starts with a good pitch in the first half and it will keep you stick to your seat. The war sequence, the duologue's, the direction everything was superb in first half. But in the second half everything went loose and the theme was totally changed. He didn't stick to one theme. First half full war second half full love and hate sequence. This is not the way you can make viewers glued to their seats. I read about Bajirao in some text books but in this film the story was totally twisted and the main reason for his failure was Mastani. He learned all bad things from her like drinking wine, eating mutton etc etc which is banned for Brahmins. Also the dance sequence by Priyanka and then Ranbir was baseless. Not required at all as the Maratha royals never do that. When you are taking a historical topic don't twist it so badly that good looks bad and bad looks good. SLB needs to learn a lot."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "chatterjeeronak",
        "review_rating": "8",
        "review_title": "Sheer brilliance... The Maratha style !!!!",
        "review_detailed_main": "This is one of those movies which tells you to sit back and enjoy the whole drama. The story is almost real and historic but you know it's a bollywood movie at the end of the day so some manipulations have to be there for the audience and also for the commercial purpose. The sets are pretty fantastic (the thing with all sanjay leela bhansali movies). Personally I liked ranveer's acting the most. he was so good with that marathi accent and priyanka was a delight to watch. Even though deepika did a very nice job, all her dialogues were kind flat and didn't created the kind of passion which ranveer's or priyanka's dialogues created. Still very well played. The movie takes you through a roller coaster of emotions. The 1st half is filled with too many songs. more than which we are ready. it shows the bravery and awesomeness of one of the greatest fighters of maratha empire. Do watch it. it a TREAT!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "swapnilpharate",
        "review_rating": "9",
        "review_title": "If you won't watch it in theater then u will miss one of best movie of decade",
        "review_detailed_main": "Bajirao Mastani is must watch movie especially in theaters to have that feel of Bhansali's spectacular screenplay . You won't enjoy this movie much if you watch on TV. This is one of best love story of year based on true story and overall movie weighs high on all parameters.Lots of lot hard word put in together.I don't know why it got poor ratings. Maybe people now days like only stupid movies which are just entertainment.Throughout movie you won't feel bored or away from events. Back to back events and awesome dialogs will keep you engaged. Leading stars have given their best performances.Every frame movie is so well designed.Kudos to Bhansali. Everyone have done their job very well and justified the characters.Supporting actors needs to be mentioned. I watched two movies back to back - Hollywood movie star wars and Bajirao Mastani . And only movie I remembered was Bajirao Mastani after coming out of theaters. This is must watch. You can skip dilwale to give justice to this movie and hard work."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "svrao-131-445888",
        "review_rating": "8",
        "review_title": "A visual and historical treat!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "souparnorules",
        "review_rating": "8",
        "review_title": "Majestic and beautiful",
        "review_detailed_main": "SLB shows his magic through this movie. Deepika, Ranveer, Priyanka are absolute perfectionists when it comes to acting. Cinematography is great. Costumes and sets in the movie deserve a special praise. Overall, the movie is a visual treat."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Sarita002",
        "review_rating": "1",
        "review_title": "A cliché, immature and superficial mess of a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "eismoc",
        "review_rating": "10",
        "review_title": "A perfect masterpiece on all levels",
        "review_detailed_main": "This movie is the one that I want to see over and over again without feeling bored. The story is perfectly established, keeps getting interesting through all parts. It deals with romance yet not dull, about war but not filled with actions, and historical but not boring. Acting is attractively beautiful, very professional, very precise when it comes to emotional or action parts. There are almost no spices in this movie, so much less than what one would expect. Directing is better than perfect, even the three or four songs within the movie are so beautiful, very enthusiastic, and very well directed.\n\nI know I am using a lot of \"very good\" and \"so beautiful\" words, but the movie deserves even more.\n\nThis movie is one of the best (if not The Best) movies of its category. I am really seeking to learn Hindi language because of this very movie. I strongly advice watching it."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "faraz-47876",
        "review_rating": "9",
        "review_title": "Masterpiece!",
        "review_detailed_main": "The film filled up with emotions, a good story line, good performances(especially RANVEER), fantastic sets and a well handled direction. I'm thankful to Sir Sanjay Leela Bhansali for making this epic. The first half is a bit slower but the second half is pretty much better. Loved it, a must watch film for me. Once again I thank Mr. Bhansali for making such a wonderful film"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rezwanatasnia",
        "review_rating": "8",
        "review_title": "mesmerizing love tale of bajirao with his 1st and 2nd wife . A must watch indeed.",
        "review_detailed_main": "WHAT a story man. lovely acting. seeing the trailer i criticized Priyanka. but her role and acting just changed my views . She was unbelievable. Wonderful. And as usual the chemistry between ran-veer and deepika just stole my heart. Sanjay Leela Bhansali just proved himself with his another mastic love triangle. As expected Ranveer was speechless. Deepika was excellent . But Priyanka was not expected that good . She was just perfect for the role. The music, characters, actors, director, singer everything was just awesome. Bajirao Mastani couldn't be this without this perfect match making package . Bajirao Mastani , in one word \" WoW \" ."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "hanumantpatiljagtap",
        "review_rating": "9",
        "review_title": "Brilliant performances, vibrant sets and breathtaking songs",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "nitknight",
        "review_rating": "1",
        "review_title": "Too bad !! Depicting a hero as a mad man!!!",
        "review_detailed_main": "To be frank I didn't know much about Bajirao till this time. From movie, it seemed like he was a mad ruler, who'll just barge in anywhere, say whatever & ppl will listen. There was no emotions in actors for love, also there was no tact shown in the wars. Thanks to google & wikipedia, I came to know the great legend that he was!!! PLEASE PLEASE don't watch this movie, just read one page on him on wikipedia. He never lost a battle. Not only he was good warrior, but because he had was very good in war tactics. This is clearly missing in this movie. The movie of this scale, this much budget .. at least could have developed the characters.. could have got at least some facts correct!! For one, the royal family women shown as dancing in public!!! How can we even digest this?? But I know people will be there who'll just be blinded by the rich costumes, grand sets, ITEM SONGS ... Go on disgrace your heroes & enjoy!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "hiharshad",
        "review_rating": "10",
        "review_title": "Bajirao-Mastani: The masterstroke of Bhansali",
        "review_detailed_main": "Bajiao Mastani is a magnificent attempt by Bhansali. At the start he paints some ugly strokes with twisted history (thats why the disclaimer), but later takes focus right to the love story and struggle of Bajiao - Mastani.\n\nIt conveys the mighty warrior spirit of Bajiao. Mastani is portrayed with dignity and grace which she truly deserves. Both of these great souls had to go through tremendous pain and torture due to orthodox families, power politics and wicked society in that era. Bhansali makes good use of low light, pale colors to show this.\n\nThe masterstroke of Bhansali comes at the end of the movie. The extreme contrast shown at the climax numbs you for long time and then it makes you think hard; rendering maximum impact.\n\nRanveer Singh, bravo ! He has taken real hard work to portray Bajiao. Deepika (Mastani) and Priyanka (Kashibai) have performed excellently.\n\nBajorao was a visionary who dared to challenge the wrong customs (in religion and society). He was a great warrior, superior war strategist (undefeated in 41 wars) and unsung hero of India. Bhansali waited 12 years to create his dream project and it was totally worth the wait. Hearty congratulations to the team Bajirao-Mastani."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "romessanadeem",
        "review_rating": "8",
        "review_title": "A Work of Art",
        "review_detailed_main": "Sanjay Leela Bhansali is easily one of my favorite directors. He puts in so much work and it usually results in a passionate rendezvous, ripe with energy and color. I walked into the theater with high expectations and I was not disappointed.\n\nWhen it comes to the historical aspects of the film, I can't say much about it since I know little to nothing about how any of the events depicted actually happened in real life but as told by a disclaimer at the beginning of the film, some historical inaccuracies were to be expected.\n\nThe movie begins with Bajirao (Ranveer Singh) being given the title of Shrimant Peshwa after successfully splitting a peacock feather in half using an arrow. Fast forward 10 years and we're introduced to his beautiful wife Kashibai (Priyanka Chopra) who is shown to love her husband to no end. Trouble brews though when he meets Mastani (Deepika Padukone) while traveling to Sironja. Bajirao, struck by Mastani's beauty and dignity, falls head over heels in love with her and she reciprocates the feeling. The movie progresses and tells the story of their love and the struggle and opposition it faces.\n\nOne thing to be noted is that it would have been easy for the film to transcend from the realm of good taste to the pit of tackiness but one of the things I love about Bhansali's work is that he seems to know that the line exists and he treads carefully so as not to risk tipping into gaudiness.\n\nWhile the ending for me was somewhat abrupt and it began to seem a tad overdone (not regarding decoration or costume but action sequences) it compensated by showcasing alluring sets and locations, as well as delivering more than satisfactorily in all other aspects. The script, occasionally including bits of poetry, was well written and carefully crafted.\n\nRanveer Singh, as always was superb and pleasantly animated in the character of Bajirao. Priyanka Chopra's Kashibai was gorgeous and brimming with vivacity and while I can see a younger Madhuri Dixit or Aishwariya Rai playing Kashibai's role, I could not picture anyone but Deepika Padukone playing Mastani. For me, there is no actress who could possibly bring the bold, brazen character of Mastani to life the way she did, mostly because of her own acting chops and partly because of her charming chemistry with Ranveer Singh. Fearless and downright beautiful, Deepika Padukone is undoubtedly the star of the film and shines wonderfully in her grand surroundings. The cast synergizes effectively to produce an engaging plot.\n\nThe cinematography and direction are undeniably glamorous and the overall aesthetic of the film is absolutely stunning. A lot of the shots are pure art; magnificent and exquisite art. The music, specifically \"Pinga\" and \"Deewani Mastani,\" feature impressive choreography and dance performances and may even have you singing along.\n\nOverall, Sanjay Leela Bhansali took every single rupee of the 120 crore budget and utilized it to deliver a film of overwhelming magnificence and creating cinematic excellence of a highly outstanding quality."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "SumanShakya",
        "review_rating": "8",
        "review_title": "A beautiful epic.... nearly flawless",
        "review_detailed_main": "Historical epics have seldom been successful in Indian Cinema as the audiences find it hard to stomach the time period, the diction, and the story they find hard to relate in the present day. \"Razia Sultan\" an epic drama casting a love story of a female emperor and army general Hakut saw a very bad faith in the box-office. (Well, haven't watched \"Razia Sultan\" to write about it) \"Bajirao Mastani\" too is a romantic epic showing the time period of 18th century in which a Pesawa (general), Bajirao, of Maratha fall for a Muslim princess, Mastani, much to the dismay of the society. Although the film describes valor of a general who has fought bravely in over forty battles for the kingdom, the film is more of a historical romantic saga.\n\nThe film is fueled by beautiful sets, lavish costumes, and enchanting music; which just keep you glued to your seats despite the moderate pace of the film. The assets of any historical movie become the historical accuracy and the grandiose of the film itself. I can't comment much on the historical accuracy, but it's commendable that a large canvas has been given to portray a story on Maratha rulers, which hasn't been seen much in the movies except the 1982 movie \"Bal Shivaji\" made by Society of Children's Movies. The film is also commendable for the performances and the direction. The film glitters with the performances of Ranveer Singh as Bajirao, Deepika as Mastani, and Priyanka as Kashibai. But it's clear the story highlights Deepika's role and she equals the performance of Rekha in \"Umrao Jaan.\" Just like Sanjay Leela Bhansali's 'Ram-Leela\" the film becomes a feast for the viewers starved of good sets, and a beautiful story telling, which this film fully delivers. The grandiose of the canvas and the film making quite touches the height of \"Mughal E Azam\" and \"Umrao Jaan.\" If the narration had been done by Amitabh Bachchan instead of Irfan Khan, much of life could have been given to the film.\n\nRating: 3 stars out of 4"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rchandrame",
        "review_rating": "10",
        "review_title": "Epitome of Indian Cinemaking and Grand Story of Bravery, Love and Tragedy",
        "review_detailed_main": "Ranveer and Deepika have done Full Justice to characters of Peshwa Bajirao-I and Mastani. Similar to what Shahrukh & Madhuri did for Devdas. Its even 10x better than scale of Devdas, a Top class Magnum opus based on Love Story of a Warrior. Its must watch for every history Student or who is a bit interested in History. Sanjay Leela Bhansali 's art taste is probably best in current generation of directors. Ranveer has done best performance of his career so far. Deepika's shines with effortless and Natural Grace in this movie. Priyanka (Kashi bai) and Tanvi Azmi ( Mother of Bajirao Peshwa 1) are perfect in their non-lead but very impactful roles. If you know history of Greater India and Maratha Rule between 1700 and 1857 before British conclusively occupied India then You will thoroughly enjoy Hitorical era of 40 years depicted so well, mainly focused on Timeless Love Story of Bajirao and Mastani."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "shkkhurshid",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "really really bad movie seriously speaking almost died after seeing that this movie is made on a budget like 120 crore like seriously this will be your response too i guarantee this movie has even beaten humshakals i must say dipika ranveer both were the only thing to be watched in the movie priyanka was somewhat OK no story awful songs i must say that SLB should quit making films he can just stay at home and watch devdas as after that all he contributed to bollywood was that he increased craps my verdict 0/5 though 0 star is not available so had to give 1 so please ignore this one and watch some comedy like dilwale which is way better songs 0/5 story(too draggy) 1/5 acting 4/5"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "teshan87",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Bajirao Mastani, the best movie of 2015 I would say. The story, acting, music and the efforts put to make this movie are beyond expectations. A very heartfelt story circulates among Peshwa Bajirao, Mastani and Kashibai depicts there is a heart behind every swinging sword and the unconditional love no matter how badly your kins resist. Compared to this masterpiece, which is way better than Devdas from the same director, the Masala hit of the year Dilwale is more like a bedtime story to me. And this is the least advertised Hindi movie in Sri Lanka where the Dilwale is being advertised quite a lot on television. So I suggest every Hindi fan to watch Bajirao Mastani after Dilwale."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "monilhariya",
        "review_rating": "8",
        "review_title": "Mater Piece and History Recreated.....Must Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "orangeballoon",
        "review_rating": "10",
        "review_title": "Felt like I watched a real Indian movie after a long time...",
        "review_detailed_main": "If Jodha Akbar and Devdas had a baby, it would be this movie. Truly excellent from start to finish. From the very first song, I got Mughal- e-Azam feels, which is a true classic that is difficult to beat.\n\nOn the cast... when I came across the song, \"Deewani Mastani\", on YouTube, I was enchanted by Deepika's beauty, an actress I do not normally enjoy seeing on-screen. After watching the movie today, I can say that Deepika honestly radiates throughout it all. She has never looked better. Priyanka Chopra is also someone I am not a huge fan of, but she did a great job in delivering many of the emotional scenes and played her character very well. Then, Ranveer Singh, beyond being just total eye candy, did an AMAZING job in his role too. He was a sincere, confident solider and his acting in the ending scenes is one that will make your heart throb.\n\nEveryone was on their A game. The choreography, the songs, the colors, the setting, the story line -- everything is just so worth it. I feel like after a long time I have watched a true Indian movie. There have been many good ones of course like P.K. and Bajraangi Baijaan but Bajirao Mastani brought the majestic grace of Indian cinema to the screens since arguably Devdas. I would definitely watch it again and recommend to anyone interested in seeing it. Good job to all of the crew!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "joy-dutta35",
        "review_rating": "8",
        "review_title": "Mastani overshadows others in this Bhansali's 18th century saga",
        "review_detailed_main": "Going by the trailer we all expected stunning visuals, beautifully choreographed songs and larger than life romance. Well Bhansali didn't disappoint at all on these fields. What's disappointing is the film's 2nd half (1st half was engaging though) and unnecessarily dragged ending.\n\nRanveer Singh shines as Peshwa Bajirao. He has been give the best dialogues and he executes them really well. His Maratha accent is a cherry on the well baked character. It will be a treat for his fans to watch him as a lover-warrior. Priyanka Chopra played a supporting role (that's what i felt) and she did it flawlessly. Pinga and her love making scene with Bajirao deserves special mention. Deepika excels and proves herself yet again. Its her film. Be it Mastani the warrior, Mastani the lover, Mastani the mother she is splendid in everything. her dialogues were clap worthy. Mastani will remain one of her carrier best performance.\n\nMusic was okay, dance choreography impressive.\n\nBhansali, who is always knows for tampering scripts (be it written dramas or historic ones) has presented this story efficiently. You can blame him for dragging the ending but you will love him for the artistic and grandeur presentation of the same.\n\nMUST WATCH it guys and if you are planning to watch either this or Dilwale, then definitely go for this one, at least for Deepika Padukone."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "benighted2005",
        "review_rating": "5",
        "review_title": "Typical Bhansali Massacre.",
        "review_detailed_main": "I saw Padmaavat and thought it was the best film I saw that year. Then peope started saying watch Bajirao Mastani and see what he has done with this film. I was a bit hopeful of a decent plot. I saw it last night with my wife at home and I found the whole thing ridiculous, predictable. You see - Bhansali's idea of love and romance in films is quite typical. This reminded me of Ram Leela and Devdas - both are painful films to watch. The acting talents of Ranveer and Deepika could not save this ship from sinking. There are several exaggerations made but that is not the issue. The story is quite poor, the songs and dances are great - but like many historical films this made me question why I am spending 150 minutes on it. I am leaving 5 stars because of the sets, the song dances and the modicum of decency maintained by Ranveer. The last 45 minutes should have been deleted. 53 minutes into the film I thought about how bad the timing of the film is. I never call a film slow and so I won't call it slow. It was painfully bad. Watch at your own peril and watch if you are a student of film."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mallutuppad",
        "review_rating": "8",
        "review_title": "Its a wow moment in the cinema hall...mesmerizing experience...",
        "review_detailed_main": "Do not miss the first 15 minutes of the movie,one of the masterpiece of Bollywood cinema,great set up,good costume,beautiful filming,superb dialogue ...i loved this movie to such an extent that i never wrote any movie's review here,but i could not stop my self to create an account and write the review for this awesome movie...every one must must watch this \"Bajirao Mastani\".. The Back ground score also is been very good for the entire movie,songs also played major role in the movie. Specially the song sung by shreya ghoshal Mai deewani deewani is the best song of the movie. I would love to watch this movie again after some time. Sanjay Leela Bhansali ji Hats off. Regards"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "imkutoy",
        "review_rating": "9",
        "review_title": "It's SLB's best work till date.",
        "review_detailed_main": "After watched Bajirao Mastani I must say Salman had done huge mistake of his life. Because in past he left Baazigar then Srk became superstar Now he left Bajirao Mastani , Ranveer sigh becomes superstar It's SLB's best work till date. For my this question to those people if Indian people accepted Jodha Akbar history well , why they are not accepting Bajirao-Mastani???\n\nThe acting is PHENOMENAL! Ranveer Singh has always delivered fabulous performances, but this performance will be remembered until the end of his career as the performance that catapulted him into the hearts of the Indian cinema lovers. He has done a beyond brilliant job and as a viewer, we laugh, cry and root for him throughout the movie! He's the out and out star of the film. Priyanka Chopra is her usual magnificent self, nothing else can be expected of her after delivering award winning performances in Barfi and Mary Kom. She lights up the scenes she's in. It's amazing how she's good at dance, acting and emoting on screen! Her pain as Bajirao's first wife is captivating and makes the viewers feel for her! What else can be said about the ruling queen of Bollywood, Deepika Padukone, that hasn't already been written!! She is a spectacle all by herself! She makes us cry, laugh, weep, and look at her in awe! She's fabulous in the Kathak number, \"mohe rang do Laal\" and she shines in every scene of the film! Especially in the scene where she meets Kashibai and in the scene where she is jailed! Her eyes are truly the window to Mastani's soul! She matches Ranveer''s energy and their chemistry is undoubtedly historic and classic! What fabulous acting! The supporting cast is a marvel in itself, Tanvi Azmi as Bajirao's mother is fantastic! Her acting abilities are par excellence, couldn't have imagined anyone else in that role!\n\nThe music, costumes, scenery, sets and decor are exquisite! Nothing less can be expected from an SLB film! This movie is easily one of the top 5 cinema experiences in the past 10 years! It excels in both content and creativity! I will definitely be watching the movie again, it's simply addictive and outstanding and leaves a lasting impression on the viewers mind."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "aakash-vasa",
        "review_rating": "8",
        "review_title": "Sanjay Leela Bhansali's twelve-years-in-the-making dream project was worth the wait.",
        "review_detailed_main": "Sanjay Leela Bhansali is a showman.\n\nYes, Subhash Ghai has been holding on to that title for quite a while now, but it's high time Bhansali gets his due.\n\nFor Bajirao Mastani, Bhansali's twelve-years-in-the-making dream plays out like a perfectly carved-out setpiece.\n\nDespite being used to the visual grandeur and the beautiful aesthetics on show in every movie of his, one can't help being in awe of the scale at which he shoots each of his frames.\n\nFilming a costume drama is a task of Herculean proportions. Add to that, dramatizing the love story of a fabled Maratha warrior poses another arduous challenge, that of being true to the source material, while exercising creative liberty.\n\nThis is not a film that could be made by any director. Nuanced sensibilities of the kind that Bhansali possesses isn't a gift everyone has. And this skill is on full display. An auteur in the true sense of the word, he takes on the role of director, producer, music composer and storywriter, stamping his distinct style on each frame.\n\nSet in the 1700s, the movie chronicles the rise of Peshwa Bajirao, a man who was undefeated in over 41 battles, and his passionate love story with Bundelkhandi princess Mastani. The eponymous duo, portrayed by Ranveer and Deepika, has to combat Mastani's religion- based ostracization, along with Bajirao's first wife, Kashibai (Chopra) in their bid to be one.\n\nIn terms of performances, Ranveer Singh gives his career's best. His portrayal of Bajirao is bang-on, right from his look to his distinctive Marathi accent. Whether he's swordfighting in battle or giving out orders, dancing exuberantly or romancing either of his wives, Ranveer effortlessly slips into the skin of the character, his natural energy on full display! He might as well start preparing his acceptance speeches.\n\nDeepika's Mastani is graceful and dignified. She looks stunning, and lends her character a beautiful sense of vulnerability. Her chemistry with Ranveer, which was clearly evident in Ram-Leela, is more subdued, but nevertheless, still crackling.\n\nBut it is Priyanka Chopra, who steals the show! Bhansali gives her a meaty role, and she digs into it remarkably. Kashibai's character has almost no reference point in the history books, so it's entirely on Chopra to execute the director's vision. And she does it beautifully. Her journey from being hopelessly besotted with her husband to helplessly coming to terms with the fact that he loves another woman is gut-wrenching.\n\nBhansali's sets are opulent and his war scenes are majestic. The money spent to create this epic clearly shows on screen. There's a slight sense of déjà vu in the action sequences, as we've seen all this earlier this year in Baahubali. But that doesn't take away the fact that it is still a sight to behold.\n\nThe music, while not matching up to the quality of Bhansali's last outing in Ram-Leela, suits the movie just fine. The songs don't seem forced, and along with the thumping background score, they maintain the grandeur of the movie.\n\nHowever, one song in particular, stands out. Deewani Mastani will be the song this movie is remembered for down the ages. The sheer grandeur and scale Bhansali manages to reach is commendable in itself. The song is the pinnacle of the movie, where we see Bajirao irreversibly falling for Mastani, and the beginning of the devastating heartbreak that Kashibai is going to suffer. Again, top notch acting from Chopra.\n\nPeriod dramas are slow-burn and long, and so is Bajirao Mastani, clocking in a 157-minute runtime. The movie could have done better with a tighter screenplay, and certain scenes were definitely unnecessary. Certain characters, like that of Adiya Pancholi, disappear midway through the movie, only to never be seen. The end of the movie feels rushed and overtly anticlimactic. However, these are minor flaws in a truly grand epic.\n\nBajirao Mastani re-establishes Sanjay Leela Bhansali as the master of aesthetics, with his gorgeously lavish sets and his characters' stellar performances. His movie is an epic in every sense of the word.\n\nGo watch it for the trio and their master showman."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "nishthasagar",
        "review_rating": "8",
        "review_title": "A beautifully epic movie",
        "review_detailed_main": "Bajirao Mastani is one of a kind. IT is beautifully created, both in direction and setup. The lead pair has done justice to the role. Specially Priyanka Chopra.\n\nShe portrayed Kashi Bai perfectly.\n\nHer innocence and pure heart can be felt. The music is amazing too.\n\nEfforts put in to this movie can be clearly seen.\n\nHats off to Sanjay Leela Bhansali for creating this epic film. no one has ever created such a movie. I have now started finding better movies through www.flickstree.com. It not only suggests great movies to watch, it also tells where you can watch the movie online.. Highly recommended."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "elaineyuyeenee",
        "review_rating": "1",
        "review_title": "Terrible! Terrible! Terrible!",
        "review_detailed_main": "This movie glorifies adultery. What a corrupt moral!\n\nIt is basically saying extra marital affair is great as long as you fall in love with someone else and it doesn't matter whether or not you already have a wife.\n\nBajirao is cheating on his pregnant wife and the movie is portraying it as an act of romance. WHAT????\n\nThe plot is utterly disgusting that even the visuals of the movie are stunning, they cannot compensate for how terrible the storyline is.\n\nMany parts of the movie also don't make sense, the transition is atrocious. Whenever they don't want to explain why certain things happen, they just play music and dance it away.... very disappointing .\n\nThis is one of the WORST bollywood movie i have ever watched in my life!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ishikasoni",
        "review_rating": "8",
        "review_title": "A heart touching movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "parakhmayank17-162-8662",
        "review_rating": "9",
        "review_title": "one of the best movies of 2015",
        "review_detailed_main": "This movie is a class in itself extremely good first half(second half is a little slow) , amazing sets, awesome songs and Deepika n Ranveer in it what more do u want? Acting was class apart.Ranveer singh as Bajirao does his role with perfection, while Deepika stands out as mastani.Priyanka Chopra plays her part good as well. Movie is about Mbajirao and his love with his second wife Mastani intermingled with some wars which he lead to conquest major parts of India. Sanjay Leela Bhansali's direction is worth mentioning and is pretty good. Malhari and Deewani songs are amazing to watch. Movie is definitely worth watching, Don't miss it!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "bavan-11147",
        "review_rating": "10",
        "review_title": "Bajirao Mastani",
        "review_detailed_main": "Well, I watched IMDb's first mark it was 5.6/10. I thought the film will be more not attractive and boring. Be a hardcore fan of Deepika, I went to the cinema without a huge expectation but just to enjoy Deepika's performance. But at the end, I just got a slap from the director. Because the film was amazing, fresh, colorful, romantic, understanding. Not even a scene was for no reason. Everything was just perfect as I could have been expecting. The film portrays the love between Bajirao and Mastani, a hindu Muslim love in a very past time. Every one's acting was absolutely matured and mastered. They all do justice for their role. Music, editing, cinematography, production designing and everything were in a high level. It's just a kind of film I wanted. Particularly the chemistry between deepika and priyanka were brilliant and pretty as well as between ranveer singh and deepika AND ranveer singh and priyanka. I was amazed by this beautiful epic romantic magnum opus.\n\nI wish the team a great success.\n\nbvn"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "navasaretushar",
        "review_rating": "9",
        "review_title": "A masterpiece of its own type .... A must see treat of this year..",
        "review_detailed_main": "Ranveer Singh .. WOW .. As somebody already said, not a single false note throughout the whole performance. His dialog delivery, ascent, energy, emotions will left you stunned for all scenes. Kashibai and of course Mastani (Deepika), hats off. You will enter the theater with curiosity and will leave with a big WOW. The chemistry is at its peek, songs fabulous and soulful, AAYAT (you grabbed the audience for lifetime).\n\nIncredible work by everybody, sets like beyond the imagination, dialogs are catchy, the grace for movie, the performances of three made Bajirao Mastani a MILESTONE of Bollywood.\n\nAnd yes, Ranveer (now a real Superstar), better you get prepared with all your award wining speeches. Really Happy for you. Importantly a BOW to the genius mind SLB.\n\nOne could hardly resist itself to revisit theaters for incredible cinematic experience.\n\n\"Baajirao Mastani, world will remember you for eternity\""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "nurulaminreason",
        "review_rating": "2",
        "review_title": "There's a plot in the hole.",
        "review_detailed_main": "Not recommend. There's holes everywhere and bits of plots here and there... scattered!!!!!! Not worth the time. Funny VFX, poor storytelling, overall not enjoyable."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "nishanthagfernando",
        "review_rating": "10",
        "review_title": "one of the best movies ever !!!!!!",
        "review_detailed_main": "one of the best movies ever !!!!!! everything perfect. love the songs and acting. Bajirao Mastani is the best best best movie in 2015. this movie won many awards at award shows, and everyone praised, adored, and respected this movie. when comparing this with dilwale, it is clear that dilwale is a sugar ball movie, made for commercial purposes. it has same old story without any kind of success. Bajirao Mastani is the best ever movie in 2015. congratulations for the cast, for their awards. they deserve it. songs of the movie are very beautiful, costumes,sounds, language, acting and everything are perfectly done.this is a movie to watch. Bajirao Mastani is an inspiration movie. good job. really appreciate everything, thank you."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "shyamgarg-48958",
        "review_rating": "10",
        "review_title": "Great story",
        "review_detailed_main": "The great story with the beauty and acting of Deepika Padukone makes it one of the best movies of all time."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "prasannamehare",
        "review_rating": "8",
        "review_title": "Good movie",
        "review_detailed_main": "Good movie The film correctly portrays the rejection of Mastani by the Peshwa family. It is also true that Nana Saheb had tricked Mastani into captivity on the Parvati Hill while Bajirao was away campaigning. But it's highly doubtful if she was chained and tortured like Anarkali of Mughal-e-Azam. And both dying together? Bwahahahaha! The only high point of the movie was its political messaging—that love knows no religion, that religion knows no colour. Nevertheless, the movie has ensured that Bajirao henceforth will only be remembered as the lover of Mastani.It's soaring, searing and visually sumptuous. Bajirao Mastani plays out a like an operatic, swooning, feverish love poem."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "jamila_begum",
        "review_rating": "8",
        "review_title": "MUST WATCH!",
        "review_detailed_main": "I don't usually watch bollywood movies but this defo is a must watch :)"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ever-939-289798",
        "review_rating": "5",
        "review_title": "The trailer is better than the film. Clunky script, poor acting. Watch it only for Priyanka.",
        "review_detailed_main": "I really wanted to like this movie since I liked Bhansali's other work, but the sets and Priyanka are the only good things about Bajirao Mastani.\n\nI couldn't help comparing Bajirao Mastani to Devdas which is also opulent, also features a love triangle, and also has a tragic ending. But Devdas had a really solid plot and beautiful dialogs (it was after all based on a good novel), plus all the three actors did a fantastic job -- you could feel the love and chemistry on the screen. In the case of Bajirao Mastani the script is horribly clunky, the characters are not well fleshed out, the dialogs are poorly written with lots of clichés. Kudos for Priyanka Chopda who managed to create a believable character with believable motives and emotions out of this. She was the only person in this film who spoke naturally and didn't feel fake -- except the kids.\n\nRanveer Singh forgets how to act as soon as any female appears on the set. Till the end I didn't know what Bajirao felt towards his mother and Kashi, I think the actor had no idea either. He seems to have only two modes -- bad-ass warrior or frozen and expressionless. Deepika also disappointed me, she basically does 3-4 variations on the intense scene throughout the film. Neither can do micro-expressions, both \"deliver dialogue\" instead of just speaking, and Deepika has an annoying way of forgetting to breathe in before starting her sentences and then pausing an inhale randomly between words -- a small thing maybe, but it makes her lines sound unnatural (btw inhaling before the start of each sentence is something taught in every acting school).\n\nThe relationship of Bajirao and Mastani was given no chance to develop so I didn't \"buy\" her big love and her rebellion against her parents. A few scenes of them getting to know each other would have been great. It was kind of hard to believe in this great love between them.\n\nSomeone should have told Bhansali that quality trumps quality when it comes to special effects. The CGI fire was pretty awful and distracting even on my low-quality small screen, on the big screen it must have been a joke. Also, who did the awful makeup on Deepika's brows? A couple of obviously-fake shaved heads were also distracting.\n\nThe good things in this movie, apart from Priyanka are the breathtaking sets, the costumes and the beautiful cinematography."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mohdfaizan-69527",
        "review_rating": "10",
        "review_title": "Marvelous storytelling, great acting , mesmerizing visuals",
        "review_detailed_main": "One of finest bollywood movies I have ever watch. Masterpiece of Bhansali."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sweet_rock_a",
        "review_rating": "10",
        "review_title": "Bansali made poetry for the eyes happen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sameerojha-82785",
        "review_rating": "10",
        "review_title": "In the List of Top 3 Bollywood Movie",
        "review_detailed_main": "Those who have rated this Masterpiece below 7 or 8 Must donate their Eyes,Ears and Mind, Because they do know a single word of Movie.\n\nThere is not a single Drawback in the Movie. Best Story,Top Notch Screenplay,Melodious Songs😘😘😘, Full of Emotion,Supreme Acting,Mesmerizing Background Score, Eye Catcher Cinematography,Fantastic Locations, One of All Action.\n\nI was just blown away after Watching this Masterpiece, Watched twice in Theatre.\n\nWatched Many times on my Laptop, Mobile. The movie was just rolling around my Mind for at least a week or so. I recommend this Movie to many People and they were like wow."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "khansu-05988",
        "review_rating": "10",
        "review_title": "Watta!",
        "review_detailed_main": "Fantastic movie, must watch. I am very excited after watching this movie. Ranveer Singh, Deepika Padukone, priyanka chopra omg all were mind blowing."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "alteracc34",
        "review_rating": "4",
        "review_title": "Distorting History for Romance",
        "review_detailed_main": "Mastani as shown in the movie wasn't a Princess nor anywhere close she was a Slave girl, as bought and sold in 18th Century. She was Head of Harem of Bajirao Peshwa, which is located near Pune.... all facts are disorted in the movie just for the sake of Romance.... She also had relations with Bajirao's Brother Chimanji, an was centre to many conspiracies concerning Peshwa family... Hence ultimately executed. Pathetic Movie, so much fuzz for nothing.."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mulberrybay",
        "review_rating": "9",
        "review_title": "Epic tale of romance",
        "review_detailed_main": "Everything about this movie is Epic – the settings, visuals, screenplay, music, choreography, dialogs, acting, story and the direction! The grandeur and romance takes you back in time. It is a masterpiece, in spite of the obvious Bollywood liberties. Acting is restrained and compelling.\n\nRanveer has delivered a fabulous performance. He carries you through all his emotions of power, honor, pride and valor. Priyanka has once again proved herself through splendid and nuanced multifaceted acting. Deepika is captivating throughout. She has used her expressive eyes in a lot of scenes. She is convincing in the fight scenes. She has us enraptured in the Kathak song: Mohe Rang Do Laal. The supporting cast is excellent.\n\nThe visual palette is stunning, best watched on the big screen. The attention to detail is amazing. Some of the songs are masterpieces by themselves in terms of the settings, lighting, choreography, costumes, music and the lyrics. The direction is brilliant whether in the movie's grander moments or more subtle ones.\n\nBajiRao Mastani is an enduring classic - A must buy for your movie library."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sassysneha",
        "review_rating": "9",
        "review_title": "outstanding",
        "review_detailed_main": "This movie restored my faith on Bollywood. With a very gripping storyline and a mesmerising cast I believe that this movie is not being giving its due credits. The storytelling was beautiful and the delivery was even more enticing. It is amazing how, in just some hours this movie can take us to history's land and people and back. Watching this movie i realised that all movies don't need one villain and one hero to be great. The potrayl of each and every character in this movie is very justified and truthful I believe. Though they acted,there was truth in their character. Thanku for making such movies in a \"house full\" of chaos. Congratulations everyone. There comes sometimes such movies that tell you that movies are a beautiful means of storytelling and this is one such breakthrough movie."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "contactnilesh",
        "review_rating": "10",
        "review_title": "Intense, Magnificent, Awesome, Magnum Opus of SB",
        "review_detailed_main": "This is simply an awesome movie, or should I say an awesome experience! Be its star-cast, be its locations, be its sets, be its cinematography, be its direction, be its background score - everything was well planned and congruent with the the theme - an intense love story. Sheer brilliant work of Sanjay who played not only director but also musician. Ranveer, Deepika and Priyanka are brilliant, too. Deepika is getting gorgeous by the day. Your eyes will be pegged on her - only her - when she puts screen on fire in the song Diwanee Mastani. Its been now more than a day I watched it, but the hangover is not finished, in fact it gets stronger as time passed today! Truly a magnum opus of Sanjay Leela - bravo!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "prakash-prajapati",
        "review_rating": "10",
        "review_title": "Excellent movie.. Din't expect this from Sanjay L B.",
        "review_detailed_main": "Yes was good.. Dint expect it from Rabbir and Sanjay lila bhansali... Just took risk wink emoticon but risk was worth of it...\n\nIt has good story, direction , sets.. Dipika did well too but Ranbir takes number... First time i liked his acting.. May be coz movie fits him well... or he really improved.. Priyanka goes unnoticed.. may be outdated now :) sorry to be harsh. Excellent scene of mirror sculpture.. It was really amazing. I have seen this palace in real in Pune /Shanivarwada... it feels great when you see it in reel. i did not remember the story of mastani though, guides tells you pretty much same story. Also in Pune there is an exhibition showing all armor and weapon of Bajirao .. I still remember his sward and armor... they were huge and not normal to life and walk with that. I can just imagine how strong and huge that person would be... and to my surprise Ranbir fits in that role.. Great job Ranbir , Deepika, Sanjay and team.. Wish you all the best."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "pathaktatu",
        "review_rating": "1",
        "review_title": "Overrated",
        "review_detailed_main": "This movie portrays the greatest warrior in the Maratha empire as a retarded lover. This movie is about a warrior, and there is rarely anything about war, also we need to talk about how boring it is, it's a 3-hour long movie with nothing but talking throughout the entire movie. Also, why do the characters react so aggressively when Bajiro was having a second wife, it was very normal for people of nobility at that time to have more than 1 wife, oh I know the answer, secularism. I don't know why, but they need to promote liberalism in every single situation. Ok lastly let's talk about the songs, yeah they were pretty alright."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "tanishkumariinfoaddress",
        "review_rating": "10",
        "review_title": "perfectly directed,acted. Background score like 'ice on the cake '.",
        "review_detailed_main": "After great 'mugal Ae azam' it's very long to see the top class historical drama. Now the wait over. Bajirao mastani with its perfectly making in all field proves K. Asif is not only who will be remembered for his direction. SLB. Down on the knees in front of you sir. Great. if any word greater then Magnum opus I want to give it.. superb. The axe of SLB direction gradually increase its blade.. Hr hr mahadev. Direction is best till today. Act was perfect. Ranveer Singh no doubt no one can replace you. Nice music. And awesome background score. Technical work was excellent. I watch this movie after filmfare announce and Bajirao mastani won C awards. Only one line on my lips Hr hr mahadev."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sprashanthdummy",
        "review_rating": "8",
        "review_title": "Good movie overall - solid performance from the actors, wish the story had more depth",
        "review_detailed_main": "Bajirao Mastani was overall a good movie - it was intended to be a romance-drama period film & it turned out to be exactly so. I wish the story had more depth, like portraying how clever and efficient strategist Bajirao Peshwa was, or indicating more details about his predecessors or successors in the Peshwa clan, or for example what happens to his kids after he passes away... instead it focused mostly on his romantic liaison with Mastani and how his clan were repressive towards her.\n\nHowever it was still overall a very good movie to watch. The performances of the actors were excellent. Ranveer Singh did a fabulous job with his role as Bajirao Peshwa, his acting was flawless and entertaining, though a little bit I wish his role could have gone to a more senior actor like Hrithik Roshan or Aamir Khan (but that is just my opinion). Priyanka Chopra was good, but not great in her role as Bajirao's wife (though she acted really well towards the end). Other actors did a good job too, but for me the biggest star and stellar performer was Deepika Padukone in her role as Mastani. Her acting was thoroughly flawless, professional and an absolute treat to watch. Trust me, you can go watch this movie just for her role...\n\nWill definitely recommended it to my friends and folks."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "parrukhkhan",
        "review_rating": "9",
        "review_title": "Aweinspiring movie... two thumbs up!",
        "review_detailed_main": "Bajirao Mastani has lived up to its billing and would certainly be hard to beat at the awards. Leaving aside the history, every single detail that was captured and shown was pure magic. Starting from the most scenic locations, wonderfully made sets, brilliant selection of costumes and the most amazing camera-work that is yet to find a parallel in recent Bollywood movies. Music did not did not get a warm reception pre-release but after watching the movie I was impressed with the timing and how a song could depict the story was amazing. Dialogue strength and delivery were too good. Finally the background scores were also immaculate.\n\nFinally a visual treat for good quality Bollywood enthusiasts. I have watched it once and I am already planning to watch it again at Cinema."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "kirancool-42724",
        "review_rating": "9",
        "review_title": "A Grand movie from Sanjay Leela Bhansali. Grand Sets, Casting, Great Visualization of 18th Sanctuary, best Hindi Marathi Dialogues... The great Maratha movie",
        "review_detailed_main": "A Grand movie from Sanjay Leela Bhansali. Grand Sets, Casting, Great Visualization of 18th Sanctuary, best Hindi Marathi Dialogues... The great Maratha movie..\n\nRanveer Singh (as Peshwa Bajirao Ballal): I am not big fan of this hero. But he did marvellous job in this film. best as Maratha Worrier. His Hindi Marathi dialogue delivery is perfect. (Bajirao ne Mastani ke sath Mohabbat ki hai Aiyashi nahi / Chite ki Chaal, Baaz Ki Nazar Aur Bajirao Ki Talwar par Sandeh Nahi Karte, Kabhi Bhi Maat De Sakti Hain / Har Har Mahadev / Chhatrapati Shivaji Maharajanchi ekach ichha Hindavi Swarajya / Yodhdhaa Hoon, Thokar Patthar Se Bhi Lage, Tabhi Hath Talvar par Hi Jata Hai). He has won 40 battles against Mughals but unfortunately he lost battle with his own family.\n\nDeepika Padukone (as Mastani): Best costume, best makup, perfect dialogues, perfect performance with sword, Dance Performance and unlimited unconditional heartening love for Great Maratha Peshwa Bajirao. Deepika look like Sparkling Diamond in her three dance performance.\n\nPriyanka Chopra (as Kashibai): Movie is all about Bajiraoand Mastani but Priyanka has done best performance as Kashibai. She looks perfect Peshavinbai with perfect Marathi attire. Her unconditional love for her husband Bajirao Peshwa is markable.\n\nThe Brilliant Tanvi Azmi as Bajirao's mother. Tanvi Azmi has gone completely bald for this role. Mahesh Manjrekar played Maratha Emperor Chhattrapati Shahu from Satara. Vaibhav Tatwawadi payed Bajirao's younger brother, Chimaji Appa, Milind Soman. All has done best for their character. The Best film of 2015. Who are trying to boycott this movie or protesting against it, better you first watch this brilliant movie and then decide.\n\n4.5 star out of 5......"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "g_aparna",
        "review_rating": "4",
        "review_title": "Bajirao Mastani – The cursed life of a courtesan!",
        "review_detailed_main": "Before relating the story let me give you a short background of both the characters – Bajirao and Mastani.\n\nAbout Mastani- Daughter of a Hindu king – known for his womanising tendencies (a debauch basically) and a Muslim courtesan. In spite of being born to a courtesan, Mastani was lucky enough to be born in a rich and affluent environment and thus was trained in horse-riding and even weaponry. Also because daughters spend more time with the mothers, she followed Muslim prayers and rituals – like read namaz etc. Of course being with mother – an ex-courtesan – she probably picked up many nuances that courtesans use to rope in male clients. She learnt dancing and singing and playing musical instruments as well – yup – a mighty versatile lady – being exposed to so many things and also given the freedom to learn so much! About Bajirao – Born in a Brahmin family but trained as a warrior. He took over as the Peshwa (Minister) and was known to have won many battles by virtue of his war strategies and sharp intelligence.\n\nHow they met and invited their doomsday! The enemies are always aware of the weaknesses of those kings who they are about to attack. Mastani's father – a frivolous debauch was an easy prey! When the Moguls threatened to take over the kingdom, Mastani approached Bajirao to help her father. Bajirao helps her...and forgets all about her. She tries to subtly seduce him with her 'typical courtesan' nuances – but nevertheless he leaves her and reaches his territory ...to be welcomed by his wife.\n\nLike mother, like daughter (courtesan's blood after all – they thrive on rich and affluent males for a living) – Mastani packages herself up as a gift (saugaat) and reaches Bajirao's territory. Mastani's parents did not stop her much – the king was not much interested also – after all she was his concubine's daughter – they don't bother much about them! Mastani, being a follower of Islam – did not see any harm in marrying an already married man – in their religion, a male is allowed to marry 4 times in one life time – so from Mastani's point of view – she was doing the right thing.\n\nMastani's horrendous welcome at Bajirao's territory! The supporters and family members of Bajirao – could not tolerate the cheeky behaviour of a repackaged concubine! They were amazed at her brazen and bold approach to become Bajiroa's wife! And thus a new phase of utter humiliation starts for Mastani! She is sent to live in a red light area among prostitutes, then she is given a dilapidated building to live in...she is given the suggestion that she should become a licensed courtesan and dance around wearing transparent cholies (blouses) to seduce males...... later she makes her presence felt and Bajirao comes to know of her arrival – he immediately makes a new palace for her and moves in with her....like sometimes he also visited his wife...but we all know that 'experience makes perfect' – such bold and aggressive females know a lot about 'kamasutra postures' – so Bajirao...a male after all – could not stay away from her charms for long!\n\nBoth wife and concubine give birth of sons. ...but whereas the son born to wife is given respect and his birth is celebrated – the concubine's son is born without any doctor's or nurse's aid – she was totally ostracised from Bajirao's community!\n\nThe immense respect that people had for Bajirao slowly begins to diminish.....and he understood it pretty well too......yet he continued to support her and his son! Revenge of the son – Nanasaheb! At the end, Bajiroa goes to fight a war...and just as soon as he leaves his premises – his older son (born to his legally wedded wife)– Nanasaheb arrests Mastani and throws her in the prison! Mastani's son sees the torture and humiliation of his mother but is unable to do anything about it...he was just a child after all......although one day he too would grow up and probably end the entire dynasty of Bajirao....vengeance is deadly you see!\n\nBajirao is badly wounded – both physically and emotionally ...because his wife had severed her relationship with him...and his subjects attempted to kill his concubine in his presence also...so he knew that he would lose the love of his wife...and the lust of his concubine too!\n\nConclusion:\n\nMastani's father was a debauch womaniser– who must have maligned many women in his life....so his DNA extension (Mastani i.e.) had to go through hell because of the sins of her father!! You see wrath of depressed and ill-treated women (prostitutes) can play havoc on your lives!\n\nMastani's mother was a courtesan – the courtesans are hated by maximum common women (wives, mothers, sisters, daughters) because it is for such courtesans that men of the family ruin themselves – for free booze and women – many males can just do anything!\n\nWomen should be treated with respect – no woman should be made into an item for lust...because such sad and unloved women too become mothers and their children go through hell from early childhood! Such unloved and humiliated children later grow up to cause further decadence of the society! Being a minister, Bajirao should have taken care of the sentiments of his subjects more and should have discarded her proposal to become his concubine!\n\nWe Indians have grown up reading the Ramayana – where Shri Rama sent away his own wife to exile – in spite of agni-pariksha ...that did not happen in Ayodhya though – just keeping the sentiments of his subjects on mind...! People generally follow the king and his ways."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "annisasafanta",
        "review_rating": "8",
        "review_title": "Love never has a happy Ending.",
        "review_detailed_main": "Don't judge me wrong. I've seen Devdas and Goliyon Ki Rasleela RamLeela. Either both of character die, or one of them is. BajiRao Mastani is a magnum opus (they said) I don't wanna explain about this anyway. Here's my review (or comments to the movie)\n\nI don't know about Bajirao and Maharashtra's history, let's presume what SLB brought to us is valid. I found resembles between Radhama and Maham Anga, they just wrong. But let's pretend that marrying into other religion is wrong, what Radhama did to Mastani is out of humanism. I swear, she got my nerves.\n\nA king with two goddesses. It is just easier to presume the whole story with a diagram, Kashibhai is source of Peshwa's strength, while Mastani is the source of his happiness. And Kashi is left with Samsheer Bahadur, and raised him as her own. It needs a lot of courage to do so. So Kashi-bhai just got 2 points.\n\nDeepika Padukone. She is renowned one. What she did to Bajirao Mastani is somehow come to mediocrity. She did it good, but nothing to be proud of. Priyanka Chopra is truly a queen. She deserves it. I mean, being a Lady of the house, means queen. She just doing it right and brilliant despite her busy schedule as well. Ranveer Singh. I recognized his goddamn good acting skill in his Dil Dhadakne Do. Both DDD and BM is a total different genre of movies, but he did it so brilliantly. He is the life of the movies. Even at some point I wonder what really happen between Bajirao and Mastani, but being a Peshwa is another thing. He good at it.\n\nI was too drowned in the story and I can't even give a criticism to the filmmaker. This movie is good in all possible way. Packaging, direction, promotion, story, acting, and casts.\n\nI vote for watch it twice, at least."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Rawal_Afzal",
        "review_rating": "9",
        "review_title": "A warrior who conquered many territories loses a battle at home!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "chiranjivmalla",
        "review_rating": "8",
        "review_title": "Bajjilu Vesukone Bajirao ki...Mutton kottu Mastanamma madhya jarige amara Prema Katha ;) #Troll.",
        "review_detailed_main": "Sorry for the Troll. Jokes Apart, It is a epic love saga between an Indian General, Peshwa Baji Rao I & his second wife Mastani. Seeing the posters & trailers I was in a impression that it will be a war centric drama and of course I read about that in real life BajiRao had fought 41 battles, in which he was never lost not even one battle also. But here Sanjay Leela Bhansali has touched only the Love life of Baji Rao and entire story revolves around the love story between Maratha Peshwa & Muslim girl and the difficulties they face in society because of caste-ism. I have never seen Bhansali's movies in Theatres, this is the first time I have watched his movie. One thing I can say, movie is magnanimous & grandeur. Means each & every frame is like a painting and it is visually so convincing. But people who expect more war scenes in this movie will get disappointed like me ;)\n\nBhansali has done a decent job, but lengthy & slow paced narration will make you yawn sometimes. First half is extremely slow and it has almost 5-6 songs but second half is good and emotionally convincing. Love story between Bajirao & Mastani is one of the highlight. Cinematography & production values are so rich. Music is simply awesome, I really loved these tracks: \"Malhari\" \"Pinga\" \"Gajanana\". Choreography is splendid and so perfectly composed. Very few war sequences in the movies, so no need to talk much about them, because the trailers & posters are little deceiving regarding this. Ranveer as Bajirao is just OK, I felt Hrithik would have been perfectly apt for this role(Personally my feeling, I'm not hurting any Ranveer fans here ;) ), Deepika as Mastani & Priyanka Chopra as Kashi Bai have just excelled in their roles and especially in few emotional scenes, they are just flaw-less. In fact they surpassed Ranveer in many scenes. Milind Soman has got a small role and rest all are just OK.\n\nMostly what I heard is Bhansali movies doesn't have strong stories but his grandeur making saves him. Likewise this movie also. People started comparing this with Rajamouli's Baahubali(Comparison is like: Nakka ki Naagalokam ki unna difference), so stop comparing and watch it with a normal mind set. Overall movie may not be a masterpiece but watchable for onetime."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "shilpabhuiyan",
        "review_rating": "9",
        "review_title": "This movie is what you need in your leisure time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "idaaning",
        "review_rating": "3",
        "review_title": "It is not worthy to film a filthy culture of Islamophobia preached by a racist society",
        "review_detailed_main": "The history of the Peshwas are filled with filthy practices and I wonder why it is necessary to show the world how such dirty minds ruled some parts of our country. A racist mother-in-law denying her daughter-in-law, sending her away from Shanivar wada (palace) to Budhwar Pet (prostitute quarters) is trite enough in Indian culture to find multiple mentions in the daily newspaper. The Peshwas was particularly oppressive against the Dalits, who had to wear spittons in their necks, sweeps in their waist during that regime. I wish Indian directors get a better topic to make a film about that this gory history."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "aneetkukreja",
        "review_rating": "10",
        "review_title": "10 of 10",
        "review_detailed_main": "Kudos to Sanjay Leela bhansali.\n\nEverything is hit, acting, direction, and dialog.\n\nEvery point is to must see, can't miss a single scene. Must watch. Only songs are classic type, liked by classical likers. But movie is never forgettable.\n\nCast selection is also perfect, acting of Ranveer and Dipika outstanding, and obviously their role is main.\n\nI have watched many of Bhansali, but this is going to leave a strong impression on viewers minds.\n\nOne more important thing in this picture is, it doesn't criticize any religion rather give importance to both Hinduism and Muslims. There's one dialogue in movie \"humari ladai dharam (Islam) se ni Mughal saltant se hai\"!\n\nA must watch movie."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "realrajput-58567",
        "review_rating": "10",
        "review_title": "Superb Star Cast !! Extra ordinary Talent shown by all star cast in this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "brijeshhc",
        "review_rating": "10",
        "review_title": "Excellent movie with culture , creation and dressing sense",
        "review_detailed_main": "I personally loved this movie because of the skill i used to observe the objects around characters and inside forts, dressing sense of all characters, cultural binding and historical story line.\n\nThe characters of this movies were completely capable to make it hit at the box office. one of the reason to love Sanjay Leela Bhansali direction is whenever he took any cultural movie like Devdas- Kolkatta theme, Ramleela- Gujarati theme and Bajirao Mastani, he did it too good and tried his best to show their dressing, language ,ancient objects their very own cultural and mixture of culture within traditional songs. I bet that after watching this movie most of us will be interested in reading autobiography of Bajirao Peshwa ."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "parulraizada",
        "review_rating": "10",
        "review_title": "Mesmerizing experience",
        "review_detailed_main": "Each scene is a visual treat. Sets, costumes, songs and background music are breath taking. Brilliant performances by Ranveer, Deepika and Priyanka make it impossible to take eyes off the screen. Great songs and powerful dialogues. I was totally spell bound. Movie is flawless and really high on energy till the song Deewani Mastani. Post this song, narrative is incoherent and repetitive. But all flaws are trivial in comparison to the mesmerizing experience this movie provides to the audience. The richness of Marathi/Indian culture is captured so vividly in each frame. One can just pause on each frame and admire it's intricacies for hours. Simply beautiful."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mdnow",
        "review_rating": "1",
        "review_title": "Bhaaji Pao Biryani ?!.. A Horrible Mess resulted when MUGHAL-E-AZAM + DEVDAS + JODHAA AKBAR served on One Dinner Plate",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mehuljoshi-57524",
        "review_rating": "9",
        "review_title": "Brilliance of Sanjay Leela Bhansali",
        "review_detailed_main": "The title of my review says it all. It's nothing but brilliance of SLB. Every segment of the movie is brilliant, be it music, Art Direction, Focus on details, lyrics of songs. Brilliant performances by all lead characters Ranveer Singh, Deepika, Pryanka. Camera Work is treat to see for anyone who is interested in photography and lighting. Direction and narration is crisp and keeps things tight and moving. Everything about this movie is brilliant except one part - action by Mastani. It is good but could have been better. But still by Bollywood standards it is pretty good. Must watch for anyone who wants to watch quality movie from Bollywood."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "brij-raychanda",
        "review_rating": "9",
        "review_title": "Splendid...Don't miss this one to watch in theater",
        "review_detailed_main": "Bajirao Mastani Review:\n\nThere is a lot to say about this movie but can't cover all this in small review...\n\nWhile trailer I was thinking that movie will be once watch kinda...but SLB & all actors proved me wrong...and I am very happy for that...\n\nMarvelous performances and Hats off to SLB sir... One can easily see what hard-work ranvir singh has done...I can say he lived the character...Deepika was too much effective without saying more dialogues...she was speaking with her eyes...Priyanka was also best choice for kashibai... All other supporting cast has also done their part very well...\n\nGreat movie and can say leave other movies but don't miss this one to watch in theater...\n\nThis movie is writing history in bollywood..."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "chatsaurav",
        "review_rating": "9",
        "review_title": "Brilliant!",
        "review_detailed_main": "Again SLB proves that he is a genius craftsman. Every aspect of the movie is so good that it acts as a hangover for many many days. Thank you so much SLB."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "akshayshinde-07354",
        "review_rating": "10",
        "review_title": "A historical journey",
        "review_detailed_main": "These moive turned to be a milestone in the history of indian cinema. The way the moive is been put keep u on track of the history but at the same time the actor keep u engaged in there love story. The chemistry of the actor is really awesome. When it comes to locations I will surely give them 10 /10 because they really take u to the maratha era and u can even see the finest detailing done. The best and the whole way why the pic hold up strong is there script and dailogue they are very prefectly framed and very well spoken. The picture will never bore you and you can surely watch it multiple times.\n\nA great moive to watch on a nice chilled afternoon"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "surajumarye15",
        "review_rating": "1",
        "review_title": "Bajirao Mastani Movie Review: An impeccable turret of movie-making with a twisted storyline",
        "review_detailed_main": "Though an elucidated disclaimer says that the story depicts the life of Bajirao Peshva and his love story revolving around Mastani, and that the real events have been changed as per the need, for the purpose of storytelling; it doesn't make up for wrong idealizing of what Peshva stood for. It's like saying, \"I'm writing a story based on your life and showing you as a man who brought shame on your family.\" Now, isn't that fiction? Technically, yes it is. But, since I've used your name and portrayed your character through my writing, the whole story points out one name and it's yours, and in it you're a bad person. So yeah, by doing that, I am throwing mud at you. To make myself clear, by altering the real events the writer has in fact done an offense.\n\nI don't know how many people from India have known about Bajirao Peshva, but its distressing to know that people have resorted to believing the story of the film and have painted an image, that's by far, isn't anything like Bajirao. So, other than the manipulation of the story and exploiting the whole Peshva house, the storyline for the film has been neat. The most salient and virtuous aspect on paper are the dialogues. They are the backbone of how the Maratha's used to live, communicate and rule. They are the embodiment and the structure of the Maratha's. Prakash Kapadia, who also assisted in writing the screenplay of the film Katyar Kaljat Ghusli, has also penned down few poetic lines, which increase the magnificence beyond praise.\n\nWhen it comes to directing a historical film, a great responsibility is on the shoulders of the director. More than actors, he needs to be prepared for the guiding the actors, the etiquettes and the manner in which they are supposed to maneuver and act. Personally, I've never seen a director so blended in directing a historical love story. His direction cannot be criticized.\n\nAnd when it comes to acting, Ranveer Singh has left an impact so sturdy, as if it has been engraved on my heart. A fabulous piece of acting from him and it shows. The scene of the last battle, when he walks alone into the army of the opposition and decapitates and destroys a major part of it, is when you'll realize, you've seen something magnificent which cannot be forgotten.\n\nPortraying Mastani, Deepika Padukone has given the performance of her lifetime. She is the dandiest in the film and gives the best judgement to her role. Priyanka Chopra, after her recent success in American T.V. series, Quantico, is captivating beyond measure. Saying that this character played by her is tough, is an understatement. She is a treat to watch.\n\nThe Final Word:\n\nWith picturesque cinematography and mesmerizing acting, the film directed by Sanjay Leela Bhansali touches the heart, though manipulating the story does not do any good. Gathering all the resources and conjuring a movie, which only focuses on the love story of a man, is not a biography but only an aspect of one's life and I invite the youth (of at least our country) to think before believing some apocryphal stories. Showing Peshva dancing, or Kashibai and Mastani dancing together with their sarees wore below the belly button cannot be fathomed or forgotten. There are many flaws in respect of the story and the references made, but the worst thing is, they've created a fiction on the life of Bajirao Peshva; the Savior of Sanatan dharma.\n\nSo for this particular movie I'm going to implement a different rating system.\n\nMy Rating:\n\nActing: 5/5.\n\nDirecting: 4.5/5.\n\nMaterials or references used: 1.5/5.\n\nStory: 0.5/5.\n\nOverall rating: 0.5/5."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rohansirdhillon",
        "review_rating": "10",
        "review_title": "What a movie!",
        "review_detailed_main": "Beautiful in every sense! Beautiful movie, beautiful actors particularly Deepika Padukone, beautiful music particularly Deewani Mastani. A masterpiece of Indian cinema."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "kmente-91985",
        "review_rating": "9",
        "review_title": "powerful dialogues!! acting!!",
        "review_detailed_main": "Ranveer nailed it..deepika and priyanka both are livin the character"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "amitjodha99",
        "review_rating": "10",
        "review_title": "He's amongst the best filmmakers on planet",
        "review_detailed_main": "One thing you would agree post analysing bollywood and world cinema is that there will rarely be a filmmaker as proficient and prolific as Sanjay Leela Bhansali.\n\nOfcourse, there are many historic films, that may exceed Bajirao Mastani in story. But as a film, with the inputs of Sanjay as the director and music producer, and Ranbir and Deepika as the lead actors, this movie is beyond comparison.\n\nIt's a shame that the Rajput community slapped him for making Padmaavat and we stopped seeing this personality of Sanjay, it would be a big loss to Indian film Industry.\n\nBut, rest assured that this is a film that will not only take you back in time, but also leave you there for some time.\n\nYou'd be edged to research more about Bajirao, Mastani, Maratha Empire, Maratha-Rajput relations, Mughal-maratha relations and the entry point of Nizam of Hyderabad and the King of Bundelkhand.\n\nIndian history is ripe with stories and characters, countless kings and kingdoms, stories of extraordinary fervour and valor, take pride in this history while you still can.\n\nIt's amazing that being an outsider from all this, Sanjay as a Jain followed the story and captured the essence of the time so perfectly with this story.\n\nI hope I see a film on Durgadas Rathore, Jaswant Singh Rathore, Ganga Singh Rathore, Rao Shekha and even the Mughals by Sanjay Leela Bhansali, but the IQ of Indian audience or at least some section of it will prevent so much to be produced, and we will have no option but to celebrate mediocrity like Prithvi Raj Chauhan movie or the Panipat one.\n\nRegardless, watch Bajirao Mastani while you can, enjoy the music while you can. It will be unlike anything you'll see ever again, or have seen as yet.\n\nWatch it to understand Indian history, make it a priority if needed."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sam_mukh",
        "review_rating": "8",
        "review_title": "It's a grand representation of a sub-genre that SLB has defined for himself",
        "review_detailed_main": "I saw the movie 2 weeks ago, and returned to IMDb to check on the rating, and and am quite disappointed to see a cumulative rating of 7.2! The reason is that SLB has re-defined 'grand' in his style of filmmaking, and this one truly captures the essence of what he tries to convey in this art form.\n\nAmazing music - Shreya, Vishal Dadlani singing - sometimes lilting, sometimes powerful, Pt. Virju Maharaj providing choreography to Mohe Rang Do Lal... well, Deepika should probably have spent more time on her Kathak lessons.. anyway, it doesn't get much better than that.\n\nLavish production - looks like the unit poured their passion into the visuals and the detail, frame by frame - extraordinary work.\n\nAnd then it's Ranveer Singh - the intensity, strength, physicality, and combining that with sensitivity at the same time. If I knew Peshwa Bajirao, I would think he is guy Ranveer portrayed. I haven't seen tragic hero done any better than that. And that earthy Maratha accent.. where did he pick that from? Authentic, authentic, AUTHENTIC.. is all I would say. For him, the rating is 9.x / 10.. well, Ranveer, my friend, as a critique, I have to hope that you yourself, or someone betters this..\n\nCongratulations, SLB and team - incredibly powerful delivery."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "Motinxy",
        "review_rating": "5",
        "review_title": "aha re",
        "review_detailed_main": "What a stunning story got murdered by the screenplay writer and actors . Remorse."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "magmedia-07621",
        "review_rating": "8",
        "review_title": "Blockbuster",
        "review_detailed_main": "Brilliant soundtrack, dance, action. Perfect storyline, classical views, acting, dialog delivery amazing."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "seriouscritic",
        "review_rating": "10",
        "review_title": "Excellent get away movie",
        "review_detailed_main": "I had lowered my expectation after seeing a 7.2 rating on IMDb. I found that this was a great movie - much more than I expected. I almost felt I was watching a Hollywood period movie. Hats off to SLB for creating this masterpiece. You know a movie is good when few scenes give you goosebumps.. you have lump in your throat..you are totally captivated. This movie does that. Great acting by Ranveer, Deepika, Priyanka and supporting actors. Great cinematography.. dialogues and direction. Overall a well made movie on a tricky subject.. I think the Marathas should be very proud of this movie.. period. So coming back to the 7.2 rating (while writing this review).. who is feeding the bad reviews? surely people who have not watched it.. sad. If you are undecided .. please visit your nearest theatre and watch this.."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "stermix501",
        "review_rating": "10",
        "review_title": "Overflow of color",
        "review_detailed_main": "Following the advise of a non-Indian cinefile, and after a look at the trailer, I gave this a try and I was certainly rewarded. It is certainly not worth an objective 10, however I only mark 1, 5 or 10.\n\nDespite the at times mediocre Cgi the overall production values are extremely good. The director amuses himself and us with many symmetrical images of impressive settings combined with Cgi backrounds to make dreamlike results. Same goes for the costumes.\n\nThe acting of the male protagonist seemed to follow a local perception of a wannabe idolized character, who must look awesome and kickass at any time. What might seem locally awesome, would mostly annoy or have a giggle effect to western audiences. Only at the end of the lengthy 3hours the actor shows some qualities. On the other hand, the triangle wife, mother, lover characters and actrices excell and pull the strings of the entire movie.\n\nThe bollywood traditional inclusion of dancing parts is connected to the scipt with good transitions and will not seem ackward at all.\n\nDespite certain flaws and apparent influences from western film making, the overall product is highly entertaining despite its length. In addition, it is a quite accurate adaptation of historical events"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "steffycyril",
        "review_rating": "10",
        "review_title": "Bajirao ,Mastani and Kashi",
        "review_detailed_main": "The three characters created such a bang in the industry.Hats off to Sanjay Leela BAnsaali.They have applied good sets as that of the era.The way that each persons helplessness is shown is amazing.The camera has captured the war scenes perfectly.Many shots are extended to show its depth and incidence in the play. As for the music,They are soothing and as per the occasion and the background scores!each better than the other. Both the characters shine in their own way.Kashi happily receives mastani to her house and celebrates together with her.A lady's happiness is found to be her husbands happiness. And she knew that in future,mastani will called with baaji.The fact is not about the length but the way in which it is shown.Mastani also dutifully brings presents when baaji cannot come to palace on sons birth even when she knew that she will be insulted.Kashi's conversations with Mastani depicts how much love kashi has for him.Both the womens in his life proved lucky for him. Also she did not break her promise of her country in which if she marries a dagger then she has to live the whole life with the owner of that dagger."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "snaidu422",
        "review_rating": "9",
        "review_title": "Warrior and the women in his life",
        "review_detailed_main": "If it is a Sanjay Leela Bhansali film, the viewer is rest assured that whatever may the storyline be, their eyes would have feast of grandeur-the sets, the costumes and of course ace performances and a stellar cast.\n\nBAJIRAO MASTANI is no different, the movie was in development hell for over 10 years and names like Salman, Hrithik, Sharukh, as well as Kareena, Rani Mukherjee and Bhumika Chawla were associated with it and finally when it hits the screen we have Ranveer Singh, Priyanka Chopra and Deepika Padukone electrocuting the screen.\n\nThe movie starts with a disclaimer that it is actually a semi- fiction based on actual historical characters and we start realizing a quarter into the movie that cinematic liberties were used with complete freedom as there are too many coincidences in the script to make it seem a real.\n\nThe Movie is about Bajirao 1 (Ranveer Singh) and his concubine Mastani (Deepika Padukone)and their scandalous relationship.\n\nBajirao, who is a peshwa (position equivalent to a prime minister) under Chattrapathi Sivaji's grandson Chattrapathi Sahu (Mahesh Manjrekar has a loving wife Kashi Bai (Priyanka Chopra) and a doting mother Radhabai (Tanvi Azmi) and he is a complete family man when he is not the fierce raging warrior in the battlefield.\n\nMastani, the daughter of King Chattrasal of Bundelkhand (Benjamin Gilani) approaches Bajirao for help when her kingdom is attacked by the Allahahabad Pathans. Bajirao impressed by Mastani's approach agrees to help her and wins the battle for her.\n\nKing Chattrasal in gratitude bestows on Bajirao enough wealth that makes the Maratha and his men happy.\n\nMastani then reveals to her father that she is in love with Bajirao and follows him to Pune.\n\nRadhabai does not like her son's relationship with a woman who is rumored to be the king's concubine's daughter and tries hard to sever it, but in vain.\n\nThe film chronicles the struggle of Bajirao with the three women in his life, his wife, his mother and his lover.\n\nPriyanka Chopra chews up the scenery and her co-actors whenever she graces the screen. Her performance is top-notch especially the scenes with Ranveer and Deepika. The scene where she taunts Deepika just before the Pinga dance has all the characteristics of a classic.\n\nTanvi Azmi is perfect as Radhabai and showcases the two sides of her character, on one hand she is a caring mother-in-law to her daughter-in-law Kashi and a loving mother to her sons and on the other, a Manipulative cold blooded scheming woman who coolly plots the exit of her son's lover.\n\nRanveer Singh takes on the role of Bajirao with a confident air and does not falter even once. His performance as the fierce warrior and a man totally in love with his concubine and at the same time has a guilty conscience towards his wife is portrayed with complete perfection\n\nDeepika Padukone has another feather in her already crowded cap, though her Urdu diction falters but that can be overlooked if you look at the fiery performance delivered especially in the closing chapter. She brings to life the character of a woman so blinded by love that she is willing to risk her place in the society for the man she thinks she owns.\n\nPrakash Kapadia's dialogs remind us of the poetic/lyrical dialogs of Mughal-e-azam. Listening to the dialogs is worth the price of the ticket especially the dialogs between Kashibai and Mastani, Mastani and Radhabai and of course Bajirao's dialogs with the Deccan Nizam (Raza Murad)\n\nCinematography by Sudeep Chatterjee is mind blowing and he has managed to capture the grandeur of the majestic sets and assists the director in unfolding a difficult tale on the celluloid.\n\nEditing Rajesh Pandey could have been more crispier, but no complaints here too.\n\nDirection by Sanjay Leela Bhansali is classic as he has managed to extract noteworthy performances from the junior level actors to the stars. He is also the music composer of the film ( a little let down in that department).\n\nI would recommend it to anyone who loves watching movies with grand sets and powerful performances and yes! If you liked Mughal-e-azam, I guess you will fall in love with this one."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "acharynikita",
        "review_rating": "8",
        "review_title": "A must watch!",
        "review_detailed_main": "Beautiful and really heart touching love shown between Bajirao and Mastani. Amazing screenplay and superb cinematography. As always an EPIC from Mr. Sanjay Leela Bhansali. A must watch for sure for every person in love. Of course with your loved one.\n\nThe special effects were heartwarming and not overdo but were perfect for the screens. Apart from sets the graphics job is done very well and war scenes are narrated in a true gladiator way. Clothes were drop dead gorgeous.\n\nDialogues deserves a special round of applause, its just heart touching. Last but not the least, loved the Maratha costumes by Deepika and Priyanka..Surely a must watch for costume lovers. :)"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "coolbreaker-arsh",
        "review_rating": "10",
        "review_title": "Brilliant piece of Artistic Movie Making.",
        "review_detailed_main": "Bajirao Mastani, a beautiful and a well crafted movie. I crave for such good cinema from Bollywood, and I am very impressed. The way the story is told, it has the continuity, though the film is depicted with a full life-time of Bajirao. Brilliant acting by all the actors, they have truly given their best, the story telling, cinematography, each and every single thing is beautiful in its own way.\n\nA few facts about Bajiro and Mastani according to the history(though many of these aren't verified as there is minimum information regarding Mastani in the records)\n\n** Mastani were followers of the Pranami sect, a Bhakti sampradaya that does not distinguish between caste or religion. ** Mastani is daughter of Raja Chhatrasal and Persian Muslim Ruhaani Bai who was a court dancer of the Nizam of Hyderabad ** Chhatrasal offered Mastani to Bajirao as a wife along with a third of his revenue after Bajirao helped him defeat an invading Mughal ** Kashibai and Bajirao had four sons together. ** KashiBai lost the second kid, NanSaheb was the first kid and Raghunath was the third (shown in the movie) ** Bajirao, indeed did win 41 battles consequently. ** Bajirao's death is believed to be due to falling ill from fever (possibly heat stroke) and died during his military campaigns ** Mastani died within a few days of BajiRao's death. One story goes that she committed suicide by sati, another story states that she died of trauma after the husbands death. It is however confirmed that she did not live longer after his death and died in the same year. ** After their death, Kashibai took in and raised their son Shamsher Bahadur."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "virendradafane",
        "review_rating": "8",
        "review_title": "Bajirao Mastani - Marvelous Visual Classic - Worth Watching",
        "review_detailed_main": "\"Bajirao \" is a magnificently unique \"Romantic Historic\" film. Moreover, Bajirao is the definitive historic film of all time. It is hard to imagine that circumstances will ever again combine to make a more spectacular, expensive, and -- yes -- splendid movie. Bansali continues his reputation to deliver what is called \"Frame Excellence.\" Besides all of this, the only negative point of the movie is second half a little slow, and you may feel this could have been little different. It is easy enough to praise director Sanjay Leela Bhansali for his thundering battle scenes, or his delicate love scenes, or the quality of his actors. However, these were almost to be expected. What is extraordinary about \"Bajirao Mastani is that Bhansali was able to take the enormous bulk of Marathi Novel named \"Rau\" and somehow transform it into this great portion of the film without losing control along the way. The trouble with a lot of long history films is that the makers cannot keep everything in hand, and film lose the hold on the audience. The movie focuses more on the Bajirao's passion for Mastani, the beautiful and courageous half Rajput, and half-Muslim princess of Bundelkhand. The movie's opening sequence is as graphic as any war footage I've ever seen. The beauty of the screenplay is that writer is able to bring his epic events down to understandable scale without losing his sense to create an entertaining drama. Also, he delivers magnificent dialogues to portray how men with power behave and oppose the love of Bajirao and due to religion. It is possible to express even the most thoughtful ideas in the simplest words and actions, and that is what writer of Bajirao Mastani does. The film is doubly effective because every character communicates his ideas in feelings, not words. Consider dialogues when Bajirao names his second son as \"Shamsher \" or even when he says, \" Bajirao ne Mastani se Mohabbat kiye hai, aiayshi nahi\" All these dialogues are thoughtfully written which defiantly needs a lot of depth in understanding of history and thought process of the characters. Another impressive part is the use of \"Rain\" and \"Sky\" to display the intensity of the situation and Bajirao's inner battle and fight against his co-religionists. My love for Sanjay Leela Bhansali's attention to detail is never- ending, and I am sure that you will never, ever, going to see anything to equal it. The scenes of battles, where all soldiers are in the same uniform, where it is \"Brahmin Bhoj\" or Classic Shanivarvada, Director and his cinematographer delivers the best. All of the actors playing the men under Bajirao are effective, partly because director resists the temptation to make them crazy \"characters\" and makes them deliberately ordinary. If you want to make hero extraordinary then make other characters ordinary then hero looks far taller. The performances are interesting throughout. All of the actors look a little larger and more heroic than life. About Mastani, she smiles. She is radiant. She is kind, gentle and sexy as well. Bajirao and Mastani are shown as characters in heat always. While she is performing, she displays the love and vibes, and he cares for her and offers her a meeting after that. They are in full view, but nobody ever seems to see them. They make each other very happy whenever they talk. Chemistry is the unconditional love of Bajirao and Mastani, and it makes them unique and lovable. Bhansali made happy choice of an actress of Deepika and Priyanka when he cast them. Audiences applauds both of them during \"Pinga Dance\". Deepika and Priyanka delivers a flawless performance in line with the script. Although, sometimes you may feel Priyanka has been able to steal the show in few lines even though she is not the lead. Forgive me, for my affection for Priyanka Chopra.! All characters in the movie are strong presences, but for me, the key performance in the movie is by Bajirao mothers and that of \"Nana\" as the frightened little interpreters. Both of these is our entry into the reality because both of these sees it clearly that the marriage is not possible due to religion and their love for Kashibai. One major thing that needs to be applauded is that Bajirao stood for his love against the entire world, and such courage is very rare. Despite its length, the movie is not too long. It is as spectacular as a movie can be, and yet it has a human fullness. Considering its cost and the vast effort that went into its making, such a film can be made only once in our time. The wonder, indeed, is that it was made at all."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "smokin_aces19-719-759427",
        "review_rating": "4",
        "review_title": "What else can we expect from Bansali",
        "review_detailed_main": "This movie has nothing to do with Bajirao. If you want to see a love story then go ahead be my guest. But if you are a history lover then please skip this one otherwise you would think that you wasted 3 hours of your life. The cinematic visuals are poor. The stress is more on the love life rather than the war scenes. Acting by Priyanka and the other girl is good along with Mr. Singh. This would be my first review on IMDb and what compelled me to write the review is that People like Bansali would go to any extent to defame Hinduism.\n\nP.S. This movie is a clear cut example of the ideology Bansali has towards his religion."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "e-16811",
        "review_rating": "8",
        "review_title": "For his country, he won all his battle.For his lover, he lost even he himself.",
        "review_detailed_main": "Recommended by my dear friend, i share the same view that it is worth watching though i regard Baahuobali's more attractive. Weakly based on history, Bhansali told the Maratha famous story well still, or at least, it depict it completely and offer us the outside audience a chance to know Indian history, religions and legend. Besides, since love is a theme being ceaselessly written, discussed, screened and extolled, lover's fight against religion, however, is rare and personally, may be the first topic-related movie(may be even 'work') i have watched. Therefore, while watching, many questions occured to me, like why they cannot marry? Was it because of fearing of being tarnished? but i have also heared that it is allowed that lower caste womam marry higher caste man provided that she brought with herself abundant money, or because it is the very existence of such tragedies alike in indian history that gradually the traditional view evolved?(Hope there is no offence word or potential of offencing meaning out of my ignorance of indian culture).So here comes my suggestion that itcan be better if more religious description being added. Apart from the film content itself, i also wonder to know is it true that love can be so powerful that a woman would be empowered to forgo everything only to marry her lover and if so, why( i expect an answer combined with the background )?(And if is so, then i would pity myself, as sb said that it is the person without love most pitiful🙃 for i even don't believe it now🙃) Conclusion, i enjoyed this movie as i expected, so i would like to recommend it to others who'd interested in Indian epic/love legend/war topic-related movie. p.s i really disgust Bajirao's mother the kind of person, oh how much hatred and pity i hold for her. Ignorant, self-serving and firmly thinking herself being smart and right, she was a victim of traditional ideology without self-knowing and soul-searching conscious! If she was a little more kind, then my hatred toward this character can be mitigated, however, what a pity. so this film remind me sth different, Bhansali said he want to explore the difference in history, actually he showed us the similarity thoughout history, ignorance and evil never decease. p.s 2, like my topic, Bajrao won all his battle for his country, butfor his lover, he can do nothing, can i deem this as a defeat of being a man?what's man's opinion toward this kind of defeat(discuss within movie content)?"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "arjunflamingfeather",
        "review_rating": "10",
        "review_title": "BAJIRAO MASTANI",
        "review_detailed_main": "MR AND MRS SMITH RATED TEN ON TEN Sudden death is the term used for reformers coming to give us health and wealth like with PIECES OF STAINED GLASS or jumping from a high roof because her boyfriend had issue."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "jayantjain-38526",
        "review_rating": "8",
        "review_title": "Magnificent in all its parts, but lacks Integrity.",
        "review_detailed_main": "A grand story like that of Bajirao Peshwa can only come from a filmmaker like Sanjay Leela Bhansali. S.L. Bhansali has very effectively used his experience and expertise to embed jewel to the narration. Grand sets, lavish backdrops, niche costumes, sensationalizing music and a perfect cast, the recipe is all set.\n\nBut too much to say and express in too less time. Or the time could well have been managed by giving more importance to the seeds of the love story rather than extra scenes. Editing seems to loose its ends, seems not so crisp.\n\nActing has been marvelous from very actor's part. Ranveer Singh as Bajirao is probably his best, portrays the gravity of his role very well. Deepika Padukone is amazing and elegant with her crisp portrayal of Mastani. Priyanka Chopra is the heart striker. She brings into life the simple yet effective character of KashiBai. All other actors are also very proper with their portrayals.\n\nThe movie is undoubtedly a must watch."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "piyushb-59379",
        "review_rating": "9",
        "review_title": "Amazing - A Must See!",
        "review_detailed_main": "This is an amazing movie. You should not miss a single scene as almost every scene has something interesting or important.\n\nHats off to Sanjay Leela Bhansali for beautifully bringing to life the Maratha Empire along with the Marathi Peshwa culture - the clothes, the accents, the festivals etc.\n\nGreat acting by EVERY SINGLE ACTOR including the supporting cast. Ranveer, Priyanka, Deepika, all shine. Ranveer has a great screen presence, worthy of a brave king. This movie is also a great history lesson.\n\nThe only reason I am not giving 10/10 is due to the songs like Pinga (in reality Kashi bai never danced with Mastani) or even the Peshwa king (Ranveer) shown as dancing in a song which was somewhat unnecessary and not very believable. Thankfully though Ranveer's dance suited a warrior and was not of the sillier type we often see in Bollywood."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "lokapursanjay",
        "review_rating": "5",
        "review_title": "Grand effort damp result",
        "review_detailed_main": "Saw Bajirao Mastani was a bit disappointed. All the grandeur and directorial skills are wasted on a skimpy story and more skimpy imagination of the story writer. What could have been a story of great warrior turns out to be a damp squib. The Peshwa's perplexing personality which is waiting to explode and show it's heroics, implodes with a weak ending. Feel sorry for not depicting the glory fully. The love angle also is more like a documentary with Irfaan ranting on as if he is the spokesperson of inter faith marriage leading to communal harmony. The dead pan expressions of Ranveer and Deepika were vying with each other in proving the chemistry being stronger than that between Helium and Gold (Both representing Helium). PC was the saving grace with an honest portrayal of the wronged wife. The law of average has caught up with hit maker of Black, Khamoshi, Hum Dil De Chuke Sanam and Saavarian, oops the last one was intentional intrusional inclusion to prove law of averages. The sets were grand, the attire classic but not authentic, Puneri queens never showed their belly buttons in nau vaari saari (nine yard sari) the pallu was always over the head, and only visible persona was face, palms and feet. Why great thinkers like SLB forget that pure valor also sells? With a touch of sadness, I perambulated over the possibility of RGV making the remake with Rekha as Mastani (can beat DP black and blue even today with hands down, acting with her eyes only) Jaya Bhaduri as Kashibai, and Amitabh as Bajirao. How I would love to see serious effort being made to blend love and war. Bachpana bahut ho gaya."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "soso-57542",
        "review_rating": "9",
        "review_title": "Amazing film",
        "review_detailed_main": "I like every single detail in this film the music is awesome the decorations the clothes everything is perfect"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "amresh01",
        "review_rating": "10",
        "review_title": "The great Indian classic art amidst clichés'",
        "review_detailed_main": "First of all hats of to Mr Bansali for preserving the art of cinema and displaying the skill that a top notch director can produce. The sets were scintillating. I can challenge it's more beautiful than original era. Some of the frames can be paused and could admire for some time just like a crafted art/architecture. The music, dance, lyrics, acting, costume/jewelry design are worthy of granting top laurels. Deepika looks like an Indian Cleopatra . A beautiful warrior princess.Prianka did a superb role and truly did justice to the character. Ranveer again proved his worth to be among the top in the industry. Must watch movie for any one who admire art and desire to watch top quality film. You won't be disappointed."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "lunpethan",
        "review_rating": "10",
        "review_title": "Beyond Perfection! Sanjay Leela Bhansali!",
        "review_detailed_main": "Sanjay Leela Bhansali Is the best director Bollywood has ever witnessed !!\n\nHis movies are all legendary and cult !\n\nAnd Ranveer Singh is the BEST ACTOR of this era hands down !!\n\nAll others are nothing in front of Ranveer !!!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "yogyaburra",
        "review_rating": "9",
        "review_title": "Brilliant movie!",
        "review_detailed_main": "A complex commentary on power, religion and love during the Maratha period, though there as some exaggeration at times. It is about the efforts of a powerful warrior (Peshwa Bajirao) to break stereotypes held by the public. It was also about a Muslim warrior princess (Mastani) who believes in herself and goes after what she likes with any regard to others opinions and also about a selfless, kind, accepting first wife- Kashi. The struggle is essentially between the ruling class (Peshwa)and religion (Brahmins), reminded me of the High Sparrow saga in Game of Thrones. It demonstrates that love is eternal without boundaries and beautifully shows the limitations that existed at that time."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "goombapizza",
        "review_rating": "4",
        "review_title": "Lovely visuals, not so great script.",
        "review_detailed_main": "The cinematography and choreography were beautiful, just lovely. The main actresses were wonderful. But the story itself was a waste of time; boring and long-winded with a cheesy, ridiculous ending that made no sense. The movie was too long and didn't give any payoff for all the time I spent watching it. The one thing I gained from this movie is having the \"Pinga\" song stuck in my head forever."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sanjay_267",
        "review_rating": "9",
        "review_title": "Absolute masterclass",
        "review_detailed_main": "Sanjay Leela Bhansali will a director to remember, whenever there will be mention of Indian history classics..he is a gem of perfection. Bajirao Mastani is yet another compilation of superb acting,music, screenplay, dialogues,cinematography and directions."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "prafullasrivastav",
        "review_rating": "9",
        "review_title": "Bajirao is treat to watch for cine lovers",
        "review_detailed_main": "Bajirao Mastani's movie review for Late Goers like me :\n\nIf you are going for War movie like Baahubali then Bajirao Mastani is not right pick. As Bhansali already stated that this is the love story of a Warrior. He has tried to show soft and pure heart of tough warrior like Ashutosh Gowariker did in Jodhaa Akbar.\n\nPerformance: Star cast was the biggest gamble from Bhansali's side as earlier Salman and Aishwarya were finaled for lead roles. Ranvir Singh has emerged as trump card from this cinema because he has delivered one the best performance which one was highly anticipated for this type of movie. Now come to Deepika's performance. As she was leading lady of this flick and I would say that she has mesmerized the audience from her true lover and hard core warrior spirit. Priyanka has stunted the audience with her devoted performance. There are terrific small performances from Tanvi, Ayush, Milind and Mahesh. Direction: Bhansali is well known for his direction like he directed Devdas, Hum Dil de chuke Sanam, Black, Guzaarish and Ram Leela. His direction was capable enough to engage the audience in long period drama.\n\nScript: Story has been taken from Marathi book Raau. As this one purely love saga but inclusion of 1-2 more war sequence with add more gravity in the script. Sometime Hindu- Muslim conflict will remind you Jodhaa Akbar.\n\nMusic: Bhansali has tried his label best to make it Musical love story and he has successes in great extent. He wanted to reprise the magic of \"Dola re\" from Devdas to \"Pinga\" with Shreya. Cinematography: Majestic sets added life to magnum opus of Bhansali. Aena mahal was terrific and treat to watch for the audience.\n\nVisual Effects: Climax has brilliant use of Visual effects."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "mithileshwar_thakur",
        "review_rating": "9",
        "review_title": "Bajirao Mastani : A must -watch Ranveer-Deepika-Bhansali masterpiece",
        "review_detailed_main": "Bajirao Mastani, the movie, is a refreshing change from the stale and oft-repeated bollywood scripts played by one Khan or the other . Not being run-of –the mill variety , it has beyond doubt proved to be an important milestone in more ways than one .\n\n1 It has demonstrated yet again that the world of bollywood can very well be ruled by someone other than Khans and Kapoors . All you need is actors with genuine talent & passion and director with vision. 2 Ranveer Singh has come of age and has finally arrived . The way he has got into the character and has shown his passion, involvement and indulgence is simply amazing . He looks all set to stay and rule the bollywood 3 Sanjay Leela Bhansali has proved yet again that when it comes to grandeur , scale & appreciation of sense of history , no one can even afford to come to close to him .\n\nFilm industry would do well to draw quite a few lessons from this movie: 1 Non- masala movies too can be immensely successful commercial venture when backed by brilliant direction and packed with proper script , content and powerful presentation 2 One does not necessarily need to indulge in promotional gimmicks and create artificial demand to hit the bull's eye 3 Historical movies can very well be made without tweaking historical facts & yet be able to grab and hold attention 4 And finally , it is the content & quality of the product that matters the most . Marketing at best can only be a poor substitute , if at all ."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "safiyanuidris",
        "review_rating": "9",
        "review_title": "Favorite movie of 2015",
        "review_detailed_main": "This movie is everything. It's just perfect to me. The chemistry between Deepika Padukone &Ranveer Singh is 🔥 🔥 🔥 🔥"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "animesh-8349",
        "review_rating": "1",
        "review_title": "Very well crafted cinema.",
        "review_detailed_main": "Bajirao Mastani is a piece of art and perfect presentation of this art on to the cinema screen. Ranveer Singh has done a perfect justice with the character of Bajirao. The aggression and confidence that a General has by default and by virtue of what he does is portrayed very finely.\n\nDeepika padukone has done justice with her role to love stricken princess who leaves all her comforts of stately living and goes out in quest of his beloved. Priyanka has very well portrayed the devoted wife along with all the emotions which come out of such a character.\n\nAll in all a very good movie to watch if you want to look into the glorious past of an Indian General and his life events."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sachinkashyapsk-38556",
        "review_rating": "10",
        "review_title": "Fantastic movie",
        "review_detailed_main": "I loved watching this movie starring my favourite actors Ranveer, deepika and Priyanka the most amazing character."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "younuskhanyousufzai",
        "review_rating": "10",
        "review_title": "Outstanding, Brilliant, Speechless, Master Piece...Bajirao Mastani!!!!",
        "review_detailed_main": "aha Can't understand, where to start!! The brilliancy of Director, Actors, Story Writer, Musicians all to cast and crew of the bajirao Mastani all work amazing in this masterpiece. The dialogue was incredible from start to end, i give appreciation for every dialogue and scene of the film to the director and writer.\n\nAll cast gives the there best performance, Specially Ranveer and Deepika Padukone was awesome, then Priyanka Chopra.\n\nI give 10/10 rating to bajirao Mastani. Those who not ye watch bajirao mastani, go and get their ticket watch this highly recommended good film."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "vilontetoyou",
        "review_rating": "10",
        "review_title": "Exceptional movie",
        "review_detailed_main": "Great movie that is paced well (not too slow, and not too fast). The main actors were amazing."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "myvoice-07677",
        "review_rating": "10",
        "review_title": "Watching for Ranveer",
        "review_detailed_main": "Ranveer Singh is one of his kind ...\n\nBrilliant actor"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "sunilsach-14175",
        "review_rating": "5",
        "review_title": "mastani",
        "review_detailed_main": "After watching so many masala films I am proud to say Bajirao Mastani far exceeded my expectations and after a slight dull start the film flows into a dramatic experience in which I've wanted from Bollywood. I love this film and the reception of the film is open for debate but remember a beautiful gem is only found once and Sanjay Leela- Bhansali will only make a few films in his life and Bajirao Mastani is that silver lining, not only for him but for Bollywood. Even my foreign friends loved the culture, the colors, the raw power of the film that is Bajirao Mastan\n\nBajirao was once a powerful empire and Ranveer Singh does well to show the rulers human side. We see his imperfections, his flaws, his ignorance and corniness and it's something we can connect with.\n\n----------------------------------------------------"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "aayushgx",
        "review_rating": "9",
        "review_title": "Enchanted. Mesmerized. Humbled.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "bedhdec",
        "review_rating": "9",
        "review_title": "kashibai the epic saga",
        "review_detailed_main": "Come on just go and gaze into her eyes .u will understand"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "cheks-04602",
        "review_rating": "9",
        "review_title": "Watch it just connect to lyrics of the each song which is a Marvel in itself",
        "review_detailed_main": "No wonder Bansali spent 10 years on this movie. It is just a grand expression of his immense creativity. I have read that it all began with marathi phrase in \"Deewani Mastani\" song which was composed 10 years ahead of release of the movie. I truely believe if you need to make something marvelous you must just keep it close to your heart like a child and sprinkle it with love like creativity each day a little more. All of this effort of Bansali sir has bared fruits in this movie and is a wonder to experience in its true sense. I love each every line of all songs as the are filled with meaning and are interlocked strongly with emotions depicted in the movie. Especially, \"Ab Tohe Jaane Naa Doongi\" having a line \"Ek hain mannat, ek hain dua\", \"Daaye se padhe ya baaye se padh, arsh se farsh tak ishq hain likha\" Translation : You may read from left(as in urdu literature) or you may read from right (Sanskrit literature). Either you can look at sky(as in namaaz) or you could bow down (as in hindu custom) both are just one and the same. Thanks to Sanjay Bhansali, Ranveer Singh, Priyanka Chopra, Deepika Padukone and others for making this wonder possible in Indian Cinema."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "deepak-jeswal",
        "review_rating": "9",
        "review_title": "Nice Film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "poulomihari",
        "review_rating": "4",
        "review_title": "Package is pretty, very little substance inside",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "someshkpr1",
        "review_rating": "10",
        "review_title": "A Grand Epic",
        "review_detailed_main": "Nazar jo teri laagi main deewani ho gayi Kehte hain ye deewani Mastani ho gayi.....\n\nIts a movie ??? no Buddy .. its an experience, a Painting with vivid colors and every frame of this movie is so beautifully crafted that it leaves you mesmerized. From Acting to Direction,Songs,storytelling,Cinematography..... all are above excellent. The best movie of this era and a masterpiece by Lord of the Cinema.. Bhansali... No body of this age has seen \"Real Mastani\" but I,beyond slightest of doubt,can say that she would not have been more beautiful that Deepika, as she portrayed her with all charm,beauty and gravity. Same goes for the \"Chala\" Ranbeer urf \"Bajirao Ballal\" . He has the caliber of a megastar and certainly he has delivered that material in this captivating Saga of Bhansali.. May the Force be with him. Priyanka as usual at his best. God Bless..\n\nIn short, go with blind faith and leap into the world of Love,Romance,Beauty,Bravery and memories ,which would enchant you forever... \"Chalaaa\""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "ashokkamble-25775",
        "review_rating": "9",
        "review_title": "One of the best movie of Bollywood",
        "review_detailed_main": "Cinematography is awesome in this movie which made it epic. Acting and starcast was fab!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "pragnamohapatra",
        "review_rating": "9",
        "review_title": "Movie making at its artistic best",
        "review_detailed_main": "Artistic creation at it best ... few scenes are just poetry in motion. .. the silver screen was canvas and SLB was the artist ... always had a agony that we don't celebrate our hero's. .. we don't recreate the history ... we don't have any replies to troys Gladiators of the world. .. we are not there yet but the Sanjay Leela bhansali creating history the day is not far. After (K)Ram Leela lost confidence is SLB but he is back ... Rajveer, deepika hats off. .. just respect. .. just respect. The time period created by SLB is just awesome, felt to be part of that period. For me a movie is worth if you can still feel like part of it when you walk out of the theatre and BajiraoMastani is one such beautiful Creation.great job team eager to see which character from history ll come alive in next movie of the great director sanjay Leela bansali. ... # BajiraoMastani"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "vitthalmisal",
        "review_rating": "9",
        "review_title": "Amazing movie with twisting some historical events",
        "review_detailed_main": "Some Historical events are completely fictional in the movie which doesn't resemble with reality. But Technically movie was extremely well made sets design was very good worth watching entertainment."
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "evajira-96860",
        "review_rating": "10",
        "review_title": "A Beautifully crafted cinematic master piece!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "disizzgsk",
        "review_rating": "10",
        "review_title": "Unforgettable Love Epic movie made by Bhansali...A Beautiful historical classic story ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "shahannoorani",
        "review_rating": "10",
        "review_title": "Beautiful Masterpiece",
        "review_detailed_main": "Thank You Sanjay Leela Bhansali for delivering an epic movie that will be remembered for years to come!\n\nThe cast, dialogue, cinematography, acting, setting, etc. was superb.\n\nOnly Mr. Bhansali is capable of making a movie like this and this is another reminder of what a great director he indeed is. It is a must watch for the entire family and also provides a great example of love not knowing a religion, but rather true love that only knows and cares about the person.\n\nYou had an entire theater clapping over here and that I do not take part in, nor see very often.\n\nPlease go watch and be prepared to be amazed!"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "molalvani",
        "review_rating": "9",
        "review_title": "Excellent",
        "review_detailed_main": "Riveting. Drama in full form and excellent acting, cinematography, good music making this a gem. Highly recommended. Ranveer and Deepika are a compulsive watch and they are getting better with each outing, together and separately. Priyanka is in full form and delivers a Power packed performance even though she doesn't have title billing. Every character actor is equally good. What opulent and lavish sets! A joy to behold. Sanjay Leela Bhansali's vision has borne fruition and we can only thank him for this great film. I was somewhat reminded of Jodha Akbar with a lead pair equally compelling. Marathi history I don't think has been so well showcased in mainstream Hindi film industry. Please do not miss this film. Its rich in the making and telling, though I wish there was more of Mastani after their marriage and their intimate world, their trials in their boudoir and not just reactions in Shaniwarwada. Ayina Mahal I hope has not been dismantled :)"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "adrijadodo",
        "review_rating": "8",
        "review_title": "Bhansali did it!!!",
        "review_detailed_main": "Sanjay Leela Bhansali's magnum opus film..great directing ,Cinematography.. Great performance by Ranveer Singh,Priyanka chopra. A nearly perfect film.❤"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "aminifatimaaa",
        "review_rating": "9",
        "review_title": "a historical epic- elegant and wholehearted.",
        "review_detailed_main": "Sanjay Leela Bhansali is a master of directing and presents a non-traditional love story through absolutely phenomenal cinematography with well crafted camera angles and movements, beautiful sets, catchy and beautiful songs, amazing use of colour, beautiful costumes, and to finish it all off: a great cast. The film makes you wonder what is the love story and what is the tragedy. You might not love the ending and you might not completely understand the love story, but you will fall in love with the absolute beauty on screen"
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "rogerdarlington",
        "review_rating": "",
        "review_title": "Something enjoyable different for viewers outside India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3735246",
        "movie_name": "Bajirao Mastani",
        "movie_rating": "7.3",
        "review_username": "uprashanthnayak",
        "review_rating": "",
        "review_title": "INTOLERANCE breeds great love stories...",
        "review_detailed_main": ""
    }
]