[
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "Jamie Lee Curtis returns for the pay in fifteen minute opening",
        "review_detailed_main": "Laurie Strode (Jamie Lee Curtis) is catatonic locked in an asylum after the last encounter with Michael Myers. She is faking it and he is still after her. He stabs her in the back and sends her off the roof. Sara Moyer (Bianca Kajlich), Rudy Grimes (Sean Patrick Thomas) and Jen Danzig (Katee Sackhoff) are friends studying in Haddonfield University. Jen signs them up for a reality show at the Myers house. They are joined by Bill Woodlake (Thomas Ian Nicholas), Donna Chang, and Jim Morgan in the show run by Freddie Harris (Busta Rhymes) and Nora Winston (Tyra Banks). Myles Barton is in a chatroom relationship with Sara. Unknown to them, the six reality TV guests are locked in the house with Michael Myers.\n\nDespite any possible retcon, the first fifteen minutes are still the best part of this movie. Jamie Lee Curtis is Halloween every bit as much as Michael Myers. The rest is something else. Whatever it is, it's not Halloween. The reality TV idea is annoying and it gets worst with the intermittent reality TV camera work. I like a few of the actors, but Tyra Banks and Busta Rhymes really lower the likability factor. It's so bad that I am more interested in everybody getting killed. I don't care if any of them survive."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "generichorrorfreak",
        "review_rating": "4",
        "review_title": "blah",
        "review_detailed_main": "Halloween: Resurrection starts off on the wrong foot and it's all downhill from there. Sure they found a clever way to undo the closure of Halloween H2O and make it possible to bring Mike up to his old shenanigans, unfortunately that whole segment is hasty and the rest of the movie's garbage. The \"what really happened\" explanation is just a loophole for making a movie that's neither necessary nor any good, and so I present to you Halloween: Resurrection.\n\nI'm not going to write any spoilers about what happens to Laurie, but I think anyone who loves the original Halloween and its characters will think what they did with her in this movie is crap and only put her in here for the sake of having Laurie in it.\n\nThe characters are plastic. Even by the end of the movie when you get to know all of them a little bit, you don't care enough about them to want to see them escape the wrath of Mike Myers. In fact, you'll probably look forward to their demise at his hands. That's how flat and/or despicable these characters are. Even the lead role doesn't have much personality. She's nice and smart and decent, just like Laurie was in fact, but somehow she doesn't have much personality. I don't think her character was developed enough, otherwise she could have made a good heroine. The rest of the characters are people you pretty much hope get killed off, especially the tech lady played by Tyra Banks and most of the kids that tour the haunted house. Obnoxious people, hastily made characters. And Busta Rhymes plays the typical black dude with a boisterous personality. Not a bad acting job, but what a typical cliché character.\n\nThe technology is another factor. Another case of fusing horror with the fancy gimmick of modern technology (or what was modern in 2002 anyways). Just because we have things like reality shows and phone-texting nowadays does not mean it will make a horror movie any scarier, or realistic, or better at all. Having people emailing and playing on their phones and all in the movie takes away from the good old-fashioned terror you get from something as simple as a lurking shadow or the gleam of a butcher knife.\n\nThere's a couple of notably cool things in the movie, like when Freddy dresses up like Mike Myers while Mike is there in the flesh and you see two Mikes walking one behind the other. Well that was more funny than anything. The scene with the bong was funny too. And the murder scenes are alright and in typical Mike Myers fashion, but otherwise Resurrection bombs as a horror film and leaves you yet again with no closure, except this time you wouldn't really want to see another sequel."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "gavin6942",
        "review_rating": "4",
        "review_title": "Failed Mix of Halloween and Reality Television",
        "review_detailed_main": "Laurie Strode (Jamie Lee Curtis) is now in an asylum, where she awaits the inevitable return of Michael Myers. Myers, after visiting her, returns to his childhood home and makes a nightmare for a group of kids who have decided to film a reality show inside the house.\n\nFirst of all, this film pretends that Halloween 4 through 6 never happened, creating the possibility that the Myers house has been abandoned for decades, rather than lived in by other families. This reboot is a result of the writing on H20, but it was still a bad idea no matter who started it.\n\nSecond, one would think that bringing in Rick Rosenthal would be a good idea. He made \"Halloween 2\", which was probably the last solid part of the franchise. But Rosenthal is clearly not the horror directing master we might have thought, as he approaches this film with a weak vision and sense of style, more emulating MTV than his own work. A quick glance at his credits will explain this: he has spent the last twenty years making teenager-based television rather than horror films.\n\nNext, add Busta Rhymes. Like its previous installment with LL Cool J, this is the point in the series where a rapper is added to the mix. Much like how many horror franchises ultimately ended up in space, many started adding rappers to the cast. Why? I do not know. But it does nothing to help the credibility of the picture. Busta Rhymes and Tyra Banks do not have the appeal for horror fans that other actors would have.\n\nThe POV camera thing is a mess. It looks bad and is more or less a bad idea. Yes, it has worked in such films as \"The Blair Witch Project\" and more recent excursions. It does not work here. Had they cut that aspect out entirely, this film would have been a bit better instantly.\n\nNo horror franchise took as big of a nosedive as \"Halloween\", with this being the final crash landing. Reviews of this film were so poor, and viewer appreciation so weak, it's very unlikely they will ever make another one in the series. Yes, they made the two Rob Zombie films after this, but I just like to pretend that never happened."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "cjlines",
        "review_rating": "1",
        "review_title": "Loud, crass, pointless - an insult to the viewer",
        "review_detailed_main": "What can I say? If I've seen a film worse than this, it certainly doesn't spring to mind right now. I managed to get to the first screening in the local area and, even though the audience was fairly small, I still counted eleven people who walked out at various points in the movie and never came back. Now either Michael Myers slashed them up on their way to the lavatories or, like me, they were bored stiff by this absolute CLUNKER of a flick.\n\nThe plot, or what little semblance there is of one, is simple yet completely ludicrous. An organisation called Dangertainment, headed by the entrepreneurial Freddie Harris (Busta Rhymes), gets together a group of six students (!) to spend the night in serial killer Michael Myers' childhood home, in the hope that they will \"find clues\" as to what drove Myers to kill and kill again. Quite why, 25 years on from the murders, they think they will achieve anything by sending a group of teenagers into a house that, in the real world, would probably have long been demolished, is beyond me. Surely it is the job of police psychologists to dissect the minds of serial killers anyway? The film conveniently forgets the previous five sequels (with the exception of \"H20\"; this gets an irrelevant reference in the gratuitous opening scenes which serve merely as an excuse to waste Jamie Lee Curtis' talents in some customary 'running around' antics) and throws us almost immediately into the environment of the house, where each of the six kids are given a little handy-cam to strap to their heads and told to go searching for clues... You with me so far? Well, that's pretty much all there is to it. Needless to say, Myers himself shows up at the house about 10 minutes into the movie (how? why?) and decides he wants to kill everybody one by one, in the style we've now become accustomed to.\n\nThis paper-thin tale is told so badly, it's almost hard to believe what you're seeing on screen and that anyone was dumb enough to spend time and money filming it. I suppose you could almost see it like a series of noisy soundbites strung together randomly. It keeps things simplistic to the point of being nonsensical, presumably to avoid confusing its target audience of dribbling inbreds. I think I could've written a better, more entertaining and reasonable script myself on the back of a beermat. Nothing is ever explained or justified, no matter how implausible and ridiculous things get, and yet, bogglingly, the film still seems to take itself fairly seriously. It tries desperately to shock with a series of boring but bloody knife murders (nothing we haven't seen ad nauseam in any of the previous films) and innumerable 'false' scares with flashlights and toys falling out of cupboards. It's all so by-the-books and done-to-death that you'd have to have never seen a single horror film in your life to find it even remotely tense or scary.\n\nI think what bugs me the most about the film is just how terribly made it is. Even forgetting the GAPING plot holes, there are loads of obvious continuity errors and a sad, desperate style of direction that seems to drag every scene to the point of agony in a desperate attempt to pad out the already-short running time of the film. The cast do nothing to help things - all the characters are cardboard stereotypes and the ugly, plastic teens seem to be having a battle to see who can be the most skin-crawlingly irritating. I think it ends up as a tie between Katee Sachoff's hyperactive, squeaky airhead and Bianca Kajlich's jitterbug 'heroine', who spends the entire movie simpering and screaming loudly every time someone drops a pin. Oh, for the record, Busta Rhymes is absolutely ATROCIOUS in this. His entire purpose in this movie seems to be to deliver the worst examples of wisecrack-by-numbers dialogue I've ever heard (ie: \"Trick or treat, motherf**ker?\") and he plays his role as a cross between Eddie Murphy and Vin Diesel, but without the charm or charisma of either.\n\nI'd like to say John Carpenter would be ASHAMED to see such a horrible mess made out of his characters, but when you consider the maestro himself is making films almost as bad as this these days, he probably couldn't give a toss so long as the money keeps rolling in. I think this fact in itself proves just how much horror movies have changed since the first \"Halloween\" was made and, to its credit, \"Halloween Resurrection\" would be a perfect example of an \"of its time\" product you could stick in an 'early 21st century' time capsule for future generations to balk at. It is every bit as throwaway and pointless as the culture that spawned it. It is loud, crass and in-your-face constantly, despite having absolutely nothing to say when it gets there - it's like the movie equivalent of an annoying little brat screaming at you, desperate for attention. \"Look at me! Look at me! I'm being noisy and irritating!\"... I would highly advise, for your sanity's sake, that you don't look since, like that annoying child, you'll only encourage it and I, for one, don't think I could cope with another sequel this bad... This film is utter garbage and I fail to think of a single way in which they could've made it any worse. A resounding 0 out of 10."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "Shame on you Rick Rosenthal!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Calicodreamin",
        "review_rating": "2",
        "review_title": "Why?!",
        "review_detailed_main": "Nothing about this movie made any sense, from the lame attempt to connect to the series in the beginning, to the mock Blair witch shaky cam horror show, with people watching at texting?! The dialogue and storyline were poorly written, the acting was terrible, and the leading lady totally useless."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Proof that the 'Halloween' series should not have been resurrected",
        "review_detailed_main": "John Carpenter's 1978 'Halloween' is wholly deserving of its status as a horror classic. To this day it's still one of the freakiest films personally seen and introduced the world to one of horror's most iconic villainous characters Michael Myers.\n\nWhich is why it is such a shame that not only are all of the sequels nowhere near as good but that the decline in quality is so drastic. Ok, the original 'Halloween' is very difficult to follow on from, but most of the sequels could at least looked like effort was made into them. 'Halloween H20' is the one exception and the fourth film is also watchable. 'Halloween: Resurrection' is the worst offender. One of the worst sequels ever, of the genre and any genre, and one of the most pointless.\n\n'Halloween H20' was a perfect place to stop the series, to have it resurrected so badly and in a way that disgraces the 'Halloween' name to intelligence insulting degrees is enough to make the blood boil. The only halfway good thing is Jamie Lee Curtis and she and her iconic character are written out in such a slap in the face way in a scene that is anything but creepy or suspenseful. Sadly that is the one scene that actually feels like it belongs in a 'Halloween' film.\n\nCurtis aside, the acting is absolutely dreadful. By far the worst acted of the sequels, yes worse than the 'Revenge...' and 'Curse...', with the embarrassment that is Busta Rhymes being the biggest offender. The entire cast of characters are far more annoying than Tina in 'Halloween 5: The Revenge of Michael Myers' which is quite a feat.\n\nLaughably awful dialogue, in a script that shouldn't have been approved beyond first draft if even that, can also be found. The film is even more ineptly directed than Halloween 6: The Curse of Michael Myers' and the non-horror scenes in 'Season of the Witch'. Visually, it is far too gimmicky that it severely gets in the way of the atmosphere.\n\nThe music, after improving drastically in 'H20', is even bigger a drawback than in the fifth and sixth films, no it is no longer one of the best assets like it was in the first four films. Here it sounds cheap, goofy and just doesn't fit in placement or in tone. There is nothing remotely creepy, tense, suspenseful or even entertaining here, the deaths cause unintentional laughs, nothing creative or shocking.\n\nThe atmosphere is just ruined by that, gimmicky filming, a paper thin, confusing and ridiculous story that makes absolutely no sense whatsoever, terrible dialogue and acting, intelligence insulting stupidity (Rhymes versus Michael, the nadir of the entire series bar none) and erratic pacing (mostly dull).\n\nIn summary, should never have been made, an unforgivably poor quality and pointless excuse of a sequel and a film. 1/10 (a rare rating for me these days but this deserves it). Bethany Cox"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "william81-1",
        "review_rating": "1",
        "review_title": "Halloween 8 misses the mark big time",
        "review_detailed_main": "Halloween 8 Resurrection should really entitled Halloween 8 destruction of a franchise or how to kill a franchise in 90 minutes. Halloween 8 is an awful movie that is devoided of any orginality or redeeming qualties (Trya Banks is smoking hot, but is little more than an extra with a line or two). Halloween 8 spits on everything that previous movies have worked hard to preserve since John Carpenters genre inventing original, the worst Halloween 8 actually think's it has the goods.\n\nH8 had an impressive budget (due to the healthy box office of the last film) but squanders it on actors that add nothing to the movie but prolong their own dismial carrers. Busta Rhymes actually proves a good leading man until becoming undone by his own ego, most of the other actors have tongue firmly pressed in their check and most phone it in. Jamie Lee Curtis deserves special mention as she almost displays hate for her iconic cult character and cant wait to put to the whole franchise in the past.\n\nAs a fan of the franchise the biggest problem I had was an arrogance to acknowledge previous movies in the series and tries to forge it's own path that leaves Michael Myers holding his dick in his hand. Halloween 8 Resurrection come across as a scream hybrid that wont satisfy casual fans or die hards and as the final reel fades out everyone will be thinking \"That would never happen\"."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mariabaldinger",
        "review_rating": "",
        "review_title": "Busta Rhymes ruined this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "nick121235",
        "review_rating": "6",
        "review_title": "Just trying to be fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Carlo Houtkamp",
        "review_rating": "1",
        "review_title": "If This Is Merely Entertainment (Then Make It So!)",
        "review_detailed_main": "\"They don't make 'em like that anymore,\" friends of the horror genre often remark on their web sites in reference to killer films from the late 1970s and 1980s era. They are right.\n\nIt's not just that sentiments of nostalgia have turned those films into little treasures in our memories. It's because current horror films stink. Not all of them, but plenty or more anyway.\n\nEver since Dwight H. Little last captured the right Halloween spirit and atmosphere in 1988's Halloween 4, the series deteriorated into a ridiculous, messy and pathetic show. I don't care how many fans of the series curse part 3, it was a pleasant watch compared to what came after part 4. Halloween 5 was a complete prank and lacked any sense of storytelling (compliments to Danielle Harris, who managed to perform extremely well under the circumstances). Part 6, well, let's not waste any words on that one. H20 had its moments and decent acting by Jamie Lee Curtis, but a Southern California private school seemed like a poor replacement for Haddonfield. The producers dedicated it to Donald Pleasance, ignoring the fact that his last name was Pleasence (with an E) and had been spelled correctly on all earlier installments that involved his acting. So much for Moustapha Akkad's commitment to the project!\n\nHalloween Resurrection had a nice opening scene. A 1960s home movie at the Myers house, with the sounds of Johnny Angel performed by Shelley Fabares. It was cut. Of course, the Akkads in their infinite wisdom must have thought, why bother young people with an old song from someone they have never even heard of! Let's keep the film simple (and let's take a popular hip hop artist as the lead actor).\n\nBut, thank God, Rick Rosenthal filmed one other decent scene. It involves Jamie Lee Curtis's character hospitalized in a mental institution. This actually is quite a nice scene, with the actress performing wonderfully. It provides a satisfactory and surprisingly original bridge between the events at the end of H20 and the current state of affairs in \"Resurrection\", with Laurie Strode at the end of her wits and a killer still on the loose.\n\nAnd after this? We might as well have left. After the promising Jamie Lee Curtis opening scene there seemed no budget, and more important: no inspiration left to come up with something, anything. It's a bore. It's a drag. The prospect of a replica of the original Myers house showing up is a joke. We're allowed one glimpse, and even on that one occasion it is very unsatisfactory: a big car is parked in front and taking the view, as the camera briefly glances up from a low, moving position. It beats me why they even bothered rebuilding it. The interior scenes can be ignored in this sense: it may have been any old house that Busta Rhymes's character Freddie Harris decided to do his online reality show in. And about these characters: have they ever been this flat in ANY Halloween sequel? NO! The characters in Halloween 5 or 6 were drawn brilliantly compared to what is presented to us here! Okay I realize this is actually pretty much of an achievement. Credit to Larry Brand and Sean Hood. It's amazing. The unimpressive cast (I'm not counting Curtis) is highlighted by 'stars' Busta Rhymes (pop artist who is kindly given the chance to act) and Tyra Banks (model who is kindly given the chance to act). Let's suffice by saying that in this case the actors have been given the roles they deserve.\n\nEnough said. Or... We often are told one should not apply the same criteria to a horror film as the ones that apply to drama or classics. But why on earth not? I admire more than one horror movie, but that does not mean I feel I should appreciate the crappy ones by the grace of the good ones. I can see when a film is made with no heart, no spirit and Resurrection is the key example of that. Furthermore, if these films -as we are told so often by people like Moustapha Akkad- are made for entertainment (read: cashing in) purposes only and not for quality acting, complex storytelling or great photography then why, why, why do they so vigorously renounce that one basic goal, the goal of being entertaining???"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "hustl3r4u",
        "review_rating": "10",
        "review_title": "A great sequel to a great franchise",
        "review_detailed_main": "Halloween: Resurrection so many words can express this movie.\n\nHalloween: Resurrection has to be the best sequel since 2. Brad Loree pulls off \"The Shape\" so excellent, he reminded me of Nick Castle.\n\nI am a big fan of series, I came in with a smile and walk out with one. The movie is my favorite movie right now."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "emilschuster",
        "review_rating": "6",
        "review_title": "Am I the only one who likes this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "labemaster1",
        "review_rating": "1",
        "review_title": "I'm just going to pretend this movie never existed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "slimshady5623",
        "review_rating": "1",
        "review_title": "by far the worst Halloween film",
        "review_detailed_main": "Whoever wrote this must really hate John Carpenter and all the Halloween fans why would someone like Busta Rhymes be in this film and why why one earth have him kung-fu fight Michael Myers. I fell bad for Jamie Lee for being in this film and had to actually die. Have Busta Rhymes die not Laurie Strode. My God if the next movie hadn't been a remake we might have ended up seeing Mr. T and Hulk Hogan Boxing a Wrestling Michael Myers. I am disgusted with Rick Rosenthal and still hate him for letting a rapper Kung-fu fight Michael Myers. Dimension Films Should be Ashamed of themselves for making this movie. Halloween movies are supposed to be good!!!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "c_p_c",
        "review_rating": "2",
        "review_title": "Whats next?...Halloween:The Resurrection H20",
        "review_detailed_main": "There are just some times when a good movie franchise is abused and milked for all it's worth. The first of the series is great and sets the mark ,the 2 occasionally 3 sequels that follow are mediocre and anything after that is just trying to make money of an audience that has no other place to spend their money. I, unfortuantely was a member of that audience, as I paid money to watch HALLOWEEN: RESURRECTION, the 8th installment of the once classic HALLOWEEN franchise.\n\nI don't even no where to start; bad cast, bad acting, boring death scenes (not to sound wierd, but why else do you go see a movie like this), need I go on.\n\nIf you noticed that this movie is mostly made up of celebrities, it is no mistake. This is all the movie has going for it, and yet it fails in that department. The biggest mistake a horror movie can make is when it spends most of its time setting up the big death scenes and then knocks off its characters one right after another. That is exactly what happens in RESSURECTION. Every character w/the exception of 2 die in a consecutive chain that takes up about 20 minutes of the movie and the other hour is spent trying to gather of what little plot exists.\n\nThe horror doesn't stop there. This HALLOWEEN installment doesn't have the style that made the first two so good. With the exception of a somewhat unexpected opening, the movie is poorly put together.\n\nClearly an attempt to make some fast cash off a dying series, HALLOWEEN: RESURRECTION hopefully is the last time Micheal Myers takes the screen. Yet, I am sure there will find some way to bring back the masked killer. There always is a chance that the executives in charge of this franchise will make a good decision and hang up the white mask and throw away the knife. HALLOWEEN: RESURRECTION rates as just a 2/10."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "vasco_cid",
        "review_rating": "1",
        "review_title": "AAAAAAAAHHHHHHHHHHwfull.....",
        "review_detailed_main": "AAWWFFUULLLL doesn't even begin to describe it. I went in expecting something else. But in the Big Brother era, sooner or later there would come a movie about it.\n\nListing all thte things that bothered me would be too boring, but the main thing is the predicability. The movie's end is known beforehand halfway in the movie. You could guess thousands of things before they happened.\n\nThe casting is really, really, really bad. The only ones that emerge are Luke Kirby, Tyra Banks and the eternal Jamie Lee Curtis. The scary scenes aren't scary; the setting is ridiculous and the screenplay: tedious. The only scenes that had potential were Jamie Lee Curtis's cameo and the girls death chase in the basement, not for director's talent, but for John Carpenter's. For his truly fantastic and everlasting Halloween theme.\n\nKeep out."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "cameronclauson",
        "review_rating": "2",
        "review_title": "The Worst Halloween Sequel",
        "review_detailed_main": "I want to start by saying Halloween H20 is my favorite movie in the franchise... That being said, it is only NATURAL for me to not like this one. It retcons the ending and all the characters are bland. If you are thinking \"How bad can it be?\", my answer is \"I'd rather have Myers stab me than watch this movie again\"."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ivc7-1",
        "review_rating": "1",
        "review_title": "Can I give this a 0?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "walteraquilina",
        "review_rating": "",
        "review_title": "Crap in its purest form",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "LinkGoku",
        "review_rating": "6",
        "review_title": "surprisingly a really fun movie to watch",
        "review_detailed_main": "well i wasn't expecting anything special from this movie, but i was actually surprised, the story seemed somewhat thrown together but still half-ways interesting, the acting was good for saying that the only actors i recognized were Jamie Lee Curtis, Busta Rhymes, and Ryan Merriman.. the music was still good, and the whole idea though not a great one, was fun, i also thoroughly enjoyed the way they did the cameras, that was a genius idea.. i recommend this movie to anyone, and i don't understand why so many people don't like this movie, because its loads of fun to watch.. the movie may not have a great story or award winning actors, but its still surprising and fun, thus concludes my review of Halloween Resurrection"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Waste of time finish for an increasingly irrelevant series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "MOTABLAN",
        "review_rating": "10",
        "review_title": "cool",
        "review_detailed_main": "this was one of the best halloween movies i've seen in a long time. the ones before this one were all right but didn't really say much about why michael myers became the way he is. the fact that they were trapped in the house was cool. the killing scenes were good all except one but hey the movie itself and the rest of the killing scenes makes up for it. the ending was kinda trippy and for some reason i sense another halloween movie coming out, but we'll see what happens. by the way, ever notice how the hottest chic always lives at the end? take it easy y'all."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "kirk-246",
        "review_rating": "7",
        "review_title": "Underrated.",
        "review_detailed_main": "Where do I begin with 'Halloween: Resurrection'? Well, I honestly can say that it was a rather enjoyable experience.It's also the most underrated sequel in the series.It really does deserve more than a 3.9.Some people may not agree with me, but since I'm a fan of the franchise, this one was just as enjoyable as some of the others.At least people who hated this movie can agree with me that this sequel is much better than the completely unnecessary 'Halloween III: Season of the Witch'.The death scenes weren't quite as gruesome as Rob Zombie's 'Halloween 2', but they still delivered the goods.So ignore the negative reviews and try to enjoy this movie for what it is.Just don't take it too seriously.It's a slasher movie and nothing else."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "scott-sw",
        "review_rating": "1",
        "review_title": "Terrible.",
        "review_detailed_main": "Halloween Resurrection is one of those movies that is hard to recommend. It has a few hits, but far too many misses, foul balls, and walks. As a real sequel, it follows H20 several years later when Laurie Strode (Jamie Lee Curtis) is now in a mental institution. She has gone permanently crazy. Michael Myers, as to no surprise, shows up to finally do her in. At this point, it seems Halloween Resurrection could have stopped. Not so fast. A crazy reality television producer wants a new reality show. He has several people spend the night in the home of Michael Myers in Haddonfield, Illinois. This is to the chagrin of the town, as well as the resident. After all, this is Michael's home. In any case, the bleached William Shatner mask makes its return to take-out the unwanted guests. There are a few tense moments that give us a little scare, and a little suspense. Still, this is not true to the Halloween myth. Even looking at Halloween 4, 5, and 6, as well as the official trilogy of 1, 2, and 7, Michael Myers has a vendetta against relatives. Once they are eliminated, the rage should be gone. As for this one, there is no \"reaching\" out to the person trapped inside the pathological, methodological madness. That is what really brings this movie down to the real \"slasher\" level. There is no depth of character the Shape offers in previous roles. Worse, there is no protagonist with the relationship. We had Laurie for one set, and Dr. Loomis and Jamie in the other. In other words, there is no real \"hero.\" Finally, just as in H20 (and the remake), there is no guts in release date. This movie is called Halloween. So why is it released in the summer? Apparently, producers had no confidence in the king of Halloween. In any case, we have finally crossed into the Friday the 13th universe where mediocrity is abound. Of course, I think mediocre is generous."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Sleepin_Dragon",
        "review_rating": "4",
        "review_title": "You can't fault them for trying, but it's not good.",
        "review_detailed_main": "The people behind this film tried to give audiences what they wanted, slasher movies had been big news, and the Halloween franchise seemed to fit well for that genre. The opening scenes I really liked, indeed they're the best part of the movie, slick, menacing, and that music is just incredible. Reality TV was still very popular, and you can see why they came up with this plot.\n\nSadly that's the end of the good news, from there on it's downhill, I personally disliked the story, they had no qualms about cheapening the legacy of the great Halloween. It's tacky, the production, plot, characters lack any sense of quality, only the music stands out well. The behaviours of all characters are nonsensical, you keep saying to yourself 'would they really do that?'\n\nThey tried, but failed. 4/10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "rams_lakers",
        "review_rating": "1",
        "review_title": "The most stupid Halloween",
        "review_detailed_main": "As if the other sequels weren't bad enough, this one ranks with the worst movies of all time. A warning to everyone....if you see an idiotic no talent rapper in the opening credits - quickly hit the stop and eject buttons on the VCR-DVD. I'm serious. I'm not even going to name the rapper, he ruined the whole thing. He must've had some kind of influence in the writing because he got to yell put downs at Michael Myers in one scene without getting his throat cut, and in the last pathetic scenes he gets to karate-kick Myers and shock him to death while getting some verbal thrashings in. This alone should make most people want to throw up. The camera work throughout the house was incredibly lame. If you dislike stupid camera effects as much as I do, stay away from this. It was giving me a headache. Jamie Lee was killed off at the beginning, the most likely reason is she wanted this to happen so she wouldn't have to be in any more sequels. Her final kiss goodbye accompanied by the line \"see you in hell\" was terrible. This movie ranks way down there with Charlies Angels: Full Throttle as my all time worst. If I could give it a ZERO I would, but I had to settle for a 1 out of 10. The reviewers who actually liked this movie show how pathetic and simple minded movie goers have become. Don't waste 2 hours of your life, you have been warned."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "PeterJackson",
        "review_rating": "1",
        "review_title": "Gives a new dimension to the word \"tiresome\"",
        "review_detailed_main": "ANOTHER slasher pick? Yes, it's the new Halloween, the 7th or 8th in the series, lost count. No 7th or 8th film in a series is any good, the 4th, 5th and 6th usually aren't neither, but that's ok. Actually, I had some hopes for this film, walking in the theater. The original Halloween was one of the best in the genre, with never-dying Michael Myers entering the big-screen in spectacular fashion. But the second in the series was already far beyond par, and the rest was pure formula (haven't seen any of em though). Then came H20: 20 YEARS LATER, which benefited again from Jamie Lee Curtis' presence. Not a good film, far from being a stand-out in the genre, but at least it had SCREAM-writer Kevin Williamson on the credits, and was actually pretty enjoyable too. So I thought: well, maybe this new Halloween will have some suspense too, maybe some surprises (I'm a sucker for surprises). But what I saw...well, I'm still speechless. This film was even worse than most stupid entries in this genre.\n\nFirst of all, we get a stupid explanation for the fact that Michael is STILL alive (unbelievable if you saw the previous one). Then we get Jamie Lee Curtis in the mental hospital. What happens next, might show her attitude towards the series by now. The beginning has actually nothing to do with the rest of the film, it isn't even a good opening to this film, unlike the SCREAM-intros. Then we get to see the actual film, which is pretty much, like one of the characters puts it, Halloween meets the Osbournes, or Big Brother, or the German movie DAS EXPERIMENT, or whatever. You put the usual bunch of irritating high-school friends in one house, put some cameras on top and let Mike (umm...Michael) Myers do his thing. Is it thrilling? Nope, it just seems Myers is doing a routine slashing in here. There's no suspense at all, just people getting killed like you knew they would. Not hard to guess that the \"smartest\" will survive. Is it funny? Yeah, if you can laugh at lame dialogue and the aforementioned irritating characters. If that's your thing, fine, shows why all these dumb-headed high-school comedies nowadays are such a success. Oh, and it's so dumb-minded that you can't even stop shouting at the screen: \"Oh, come on! As if...\"\n\nBut what could you expect from a movie that was directed by the same man that directed Halloween II? It's so formula that you cannot only predict everything from the first til the last minute, but it's so bad that the last-minute surprise is even more irritating than usual. It's so obvious by now that, indeed, \"Evil never dies\" , that it's even boring to see these people trying to put M.M. to rest, without being ultimately successful. How long will they go on with this and what's the point of making another movie like this if nothing works out in the end. I'm sure Michael must be pretty tired by now. But maybe we get a Halloween: 60 years later, in x years time, where Michael is a geriatric patient, killing off his fellow patients. Maybe that would be a thriller! As far as this one is concerned: it's more of a thrill finding ways to stay awake while Michael is doing his thing than watching this bore. 1/10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "riot4kimber",
        "review_rating": "1",
        "review_title": "The Night He Shouldn't Have Come Home!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "sjhollen",
        "review_rating": "5",
        "review_title": "Comical",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "StreepFan126",
        "review_rating": "",
        "review_title": "Why did they have to ruin it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "TDPAnaconda",
        "review_rating": "6",
        "review_title": "Underrated Nostalgia Fest",
        "review_detailed_main": "While it is for sure dated and very corny, Halloween: Resurrection is an alright film with decent laughs, decent scares and entertaining kills. Michael Myers mask and the theme music are both good updates on the original. The plot, while undeniably generic for the time, is still interesting. It is not the best film in the franchise, but it is probably my favourite because of its nostalgia and humour. The film will hopefully receive more positive reviews in future."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "White_Thunder",
        "review_rating": "1",
        "review_title": "This is terrible,Stay away from this film!!!",
        "review_detailed_main": "Seen it on the pictures and i couldn't wait for it to end,thought id give it another go on DVD with my folks and i was yet again subjected to 86 minutes of pure trash,my parents fell asleep even before it ended! The acting is terrible,Busta rhymes is a joke,there is nothing and i mean nothing new about this entry.It seems the director didn't give a monkey's behind about this film,i would be embarrassed to have my name on the credits.Definitely the worst Halloween film by far!!! I'd rather watch paint dry,at least that would be more interesting...\n\nMichael myers R.I.P (if only) some genius is going to bring out Halloween 9..."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Pumpkin_Man",
        "review_rating": "10",
        "review_title": "Halloween In 'Da Hood!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Tedakin",
        "review_rating": "7",
        "review_title": "Surprising",
        "review_detailed_main": "The first Halloween film is my second favorite movie ever made, right behind The Empire Strikes Back. So I am always anticipating another sequel and this one suprised me. It's one of the best of the series in my opinion, and that's quite amazing when you consider that it's part 8. Unlike the Jason and Freddy movies, Halloween is still a respected franchise that can get known actors and major releases. Michael Myers is the greatest movie slasher ever and this movie reinforces that sentiment. Out of the 8 films in the series this one ranks number 4. Part 1, Part 2, Part 4, Resurrection, H20, 5, 6, and then of course the Myerless 3. Now I guess they need to find a new hero to replace Dr. Loomis and Laurie Strode for part 9."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Zbigniew_Krycsiwiki",
        "review_rating": "1",
        "review_title": "This entire series should just be retitled: \"RetroActively Changing The Previous Film's Ending\"",
        "review_detailed_main": "Every wretched movie in this yawn-inducing series retroactively changes the ending of the previous film, so, it comes as absolutely no surprise that, yet again, this latest, and last, sequel to Carpenter's wildly overrated original begins by retroactively changing the ending of H2O. It is most difficult to care what happens when we know that, no matter what happens, the ending will be changed in the next sequel, which is contractually obligated.\n\nNow get this: it was not The Shape who lost his head at the end of H2O, it was some random ambulance driver, who The Shape dressed in his own clothes and put his mask on before making his escape. Somehow, this random ambulance driver gained superhuman strength, survived being run over by Laurie, assumed a confrontational stance and stared down the van she tried to run him over with for a second time, survived the fall down the hillside, and didn't bother to even try to take his mask off. It was not until *after* she beheaded him that the mask was removed, and we learn of the switch. There are at least SIX completely implausible points in that set up.\n\nWe've been told repeatedly that Myers is trying to kill any living relative. If that is true, then after he kills JLC at the end of her contractually obligated cameo appearance, why doesn't he bother going after her teenage son (from H2O)? Apparently that would make too much sense. He decides to go back to his childhood home, which, by all accounts, should have been demolished decades ago, and hacks up a group of college-aged losers who are there filming a reality programme for internet viewers. Internet viewers who think it is only a Halloween horror film, and shout commentary at their screens, a la Mystery Science Theatre. The producers even tried to add a little bit of \"buddy movie\" here, as one of the viewers helps the lead girl, over the web.\n\nThe overly self-aware casting is overflowing with celeb-retards , with ... I shudder to even type his name, \"Busta Rhymes\" as the token rapper, Tyra (America's Next Top Model) Banks, JLC only along for the ride to add her name value to this enervation, along with various other no-names who will never be heard from again, even if their character survives this one.\n\nThe climax has Myers boringly being set on fire again, and electrocuted, in an ending which made me say \"We already know that won't kill him\", as it rips off Halloween II, co-directed by this film's director, Rick Rosenthal. And of course, the obligatory, contractually obligated set-up for yet another sequel, which, if it ever materialises, will doubtlessly begin by retroactively changing this film's ending.\n\nWhen do we get a sequel which shows Myers going after the Akkads, to finally end this crap?"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "preppy-3",
        "review_rating": "2",
        "review_title": "Why?",
        "review_detailed_main": "The film starts off good with a nice, atmospheric, suspenseful sequence involving Jamie Lee Curtis. Then it falls apart.\n\nA bunch of kids from Haddonfield University decide to stay in Michael Myers childhood home (for scholarship money) overnight and find out why he was the way he was. Michael somehow finds this out and decides to put a stop to it. Also all the kids have little video camera on their shoulders so the film annoyingly keeps going back and forth between video and film.\n\nBasically, it all turns into just another slasher film. The script is horrible--lousy lines along with cardboard characters. All the acting sucks and I hated every single \"character\". Still, the deaths are loud, violent and bloody and some of the stalking scenes do deliver. Also the sound in this film is great and there's a nicely updated version of the score.\n\nSo, it has it moments, but not enough. A 2."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "bensonmum2",
        "review_rating": "3",
        "review_title": "Halloween and Michael should have died with H2O",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "Don't Resurrect This.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "FlashCallahan",
        "review_rating": "2",
        "review_title": "Trick or treat....MoFo!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "utgard14",
        "review_rating": "3",
        "review_title": "Shouldn't have been made",
        "review_detailed_main": "The plot is irrelevant. It's still the same old song and dance. Michael dispatching annoying people right and left. The movie makes no attempt at novelty. It's completely content at being what it is: a bland entry into a franchise that, with the exception of one film, had descended into parody a long time before. The one thing this movie does try to do different with the franchise is that it uses more F bombs than all the other Halloween films put together (before Zombie, of course). This should be no surprise given Busta Rhymes is one of the stars. So yeah...that's something to be proud of.\n\nThe cast is mostly terrible. Jamie Lee Curtis, clearly fed up with Halloween, reprises her iconic role for the sole purpose of seeing her killed off once and for all. You can't really blame her for wanting to be rid of this mess. The rest of the cast is made up of the super annoying Busta Rhymes, the beautiful Tyra Banks, and a host of (at that time) aspiring stars. Of the bunch I would say Bianca Kajlich and Katee Sackhoff comport themselves best. Obviously this movie did nothing to help the careers of anybody involved with it.\n\nRick Rosenthal, who I felt did a decent job way back when with part 2, directs ineptly here. There isn't a memorable scene in the entire movie. It's just a loud, obnoxious mess of a slasher film. I struggle to decide whether this is the worst of the series or part 5 is. Both are excrement. There's also something truly sad about a Halloween movie being so unoriginal that it borrows from or rips off various other movies (Blair Witch Project, Scream, Terminator 2, Peeping Tom). The first Halloween movie was an innovator, not an imitator. It's just sad to see how far the franchise fell by 2002. I also think it was very indicative of the state of horror films at the time."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "tripperM",
        "review_rating": "",
        "review_title": "what the heck?!...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Fernando-Rodrigues",
        "review_rating": "7",
        "review_title": "The 2nd \"assassination\" of Laurie and the Halloween franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "moonspinner55",
        "review_rating": "1",
        "review_title": "\"Inside all of us there lurks a dark, malevolent figure...a kind of boogeyman, if you will.\"",
        "review_detailed_main": "Three years after decapitating the wrong person instead of unstoppable maniac Michael Myers, Laurie Strode (Jamie Lee Curtis, in a cameo) has been committed to an asylum, apparently catatonic but actually lying in wait for Myers to track her down--he does. That's just the prologue, however; the rest of the film is made up of Haddonfield University students taking part in an internet reality show that will deliver them back to Myers' childhood home on Halloween to \"look for answers.\" Directed by the inept Rick Rosenthal (who fumbled \"Halloween II\" in 1981), this generic installment catches viewers up on the previous effort, 1998's \"Halloween H20: 20 Years Later\", utilizing flashbacks--only then to have an intern at the asylum fill us in on Myers' entire criminal history, a checklist of murders. I'm surprised Dimension Films didn't try to save money and plug the whole movie with flashbacks. A stabbing here, a gutting there. Curtis gets off easy; not so the rest of the cast, nor any audience who stays to the end. * from ****"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "horrorfreak3000",
        "review_rating": "10",
        "review_title": "GREAT!!!!!! , warning, contains spoilers!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mike_phoenix64",
        "review_rating": "6",
        "review_title": "OK but not Great",
        "review_detailed_main": "OK so this is the 7th instalment of the Halloween series with our favourite serial killer, Michael Myers.\n\nSame old s**t, different year, a bunch of teenagers meet their gruesome demise at the hands of the Masked, Unstopable killing Machine, Michael Myers.\n\nThere are some (suprisingly) good points to this film, it's well acted by the cast and Michael Myers' costume is pretty much spot on and he acts and looks the part. There are some good death scenes for the hardcore horror fans like myself and some tense moments for all the wimps who scare easy :).\n\nThe only difference with this film to all the other Halloweens is that the others at Least had some form of plot worth watching (to some extent) and getting into, whereas the plot line of this film is basically just a bunch of teenagers (what a surprise) residing in the old home of Michael Myers' house in haddonfeild (wow so original) where he surfaces to kill the unsuspecting trespasser's.\n\nTo make things WORSE they have rap star !!!Bhusta Rhymes doing KUNG FU!!! Say no more! All in all it's not the worst horror film by a long shot but it could have been so much better!!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "fury21",
        "review_rating": "1",
        "review_title": "The worst movie, in an otherwise fantastic series...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "Dedication",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Rainey-Dawn",
        "review_rating": "2",
        "review_title": "Pretty Bad",
        "review_detailed_main": "Halloween 8 (Resurrection) is a continuation of Halloween 7 (H20) - in a way with Laurie and Michael at the beginning of it.\n\nI saw this one once before, a long while back - this one kinda sux quite a bit. Come on, in 7 the guy in the back of the corner's van was dressed and acted just like Michael - Laurie cut off his head and they decided to bring Michael back so they used a lousy excuse that Laurie cut off someone else's head - some dude with 3 kids. Why in the hell was he dressed as Michael and in a body bag then -- this 8 film doesn't even explain it well enough to make since - only that Laurie cut off the head of an innocent man 3 kids at the end of 7. Such BS!!!!\n\nI've reviewed this film before but re-watching it again I have to say it really does SUCK - I was nicer about the earlier review but watching it again I have to revise my review and say this film is horrible and pointless.\n\nReally the only good Halloween stories are parts 1 and 2. Leave out part 3 - it's a separate film. Parts 4, 5, and 6 hit a lull and are for fans and entertainment value only. Parts 7 takes an upturn towards 1 and 2 but not quite as good and 8 Sux.\n\n2/10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "davispittman",
        "review_rating": "1",
        "review_title": "Hey guys, how can we ruin Halloween? Release this god awful mess..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "3",
        "review_title": "Lazy, slipshod, dumb entry in the franchise",
        "review_detailed_main": "Don't get me started on the disaster that is Halloween Resurrection. It's a halloween movie for the MTV crowd, and I mean that in the worst way possible. I've only seen it once, and don't remember much except being appalled, but here's what I do recall: A reality TV production crew heads out to the Myers house a decade after the last recorded murders there, to film a documentary. Murder ensues, as it seems to in these movies. Jamie Lee Curtis briefly returns for a prologue set in a mental institution, probably the only nostalgic bone in the film's body. The rest is a silly bunch of nonsense. And get this, someone in Hollywood left Busta Rhymes's and Tyra Banks's kennels open, and they managed to sneak their way in too. It occurs to me I've never ever written single negative, bashing review in my blog work so far as it's just not something I like to do. I'm a dude who writes about movies, I'm not a critic. So this is a milestone of sorts. Allow me to take full advantage: It's a stinker, a dud, a lazy cash grab unworthy of the name. But me being the franchise completist that I am felt compelled to include it in thus series of posts anyway. Go figure."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Richnlkhd",
        "review_rating": "1",
        "review_title": "What an awful movie!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Butch-Higgins",
        "review_rating": "",
        "review_title": "An amazing achievement: manages to be the VERY WORST of all the \"Halloween\" sequels",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "keoseyan-66002",
        "review_rating": "7",
        "review_title": "A solid new and refreshing take on the Halloween franchise.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Richnlkhd",
        "review_rating": "1",
        "review_title": "A sad disgrace",
        "review_detailed_main": "Having been a huge fan of the Halloween series I was sadly let down by the terrible acting, the screenplay, and the constant reference to the internet. The main star is a rap singer who can't act, and the rest of cast are annoying teenagers that are completely uninteresting. The ten minute introduction was acceptable, but the rest of the movie started and I was left wondering what the hell is this crap. Why did they make this movie? Instead of feeling scared I felt mad, and betrayed. Before long there all in his old house, and its one boring scene after another of long mindless chatter. When the hell is he going to kill all these little friggin snots. Finally the first ones gone. Good. Go get the next one. This was nothing like the original movie where you actually cared about Jamie Lee Curtis getting hurt let alone the sad chance of her dying. This movie bugs. Its almost impossible to watch."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Dr_Coulardeau",
        "review_rating": "10",
        "review_title": "You are the voyeur that is watching you",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ODDBear",
        "review_rating": "6",
        "review_title": "Michael still lives",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ryanpersaud-59415",
        "review_rating": "1",
        "review_title": "Ironically Called \"Resurrection.\"",
        "review_detailed_main": "The Good: This movie should be shown in a \"Filmic Decline: The 2000s as a Case Study.\" You have all the worst trends of the era: shoddy editing, bad music placement, found footage, poor understanding of technology...\n\nThe Bad: The first act of this movie is really just a short film to retcon why Michael Myers is still alive (which is dumb, because he's obviously immortal) and to have Jamie Lee Curtis in the promotional materials, whilst allowing her character to die, as per her wishes. She has no role in this movie. From this first act, I knew this was gonna be bad, because the opening act contradicts the rest of the movie. Why would a livestream take place in the house of an ESCAPED MURDERER who returns to his hometown EVERY YEAR?!\n\nThe rest of the film is one of the worst slasher films I have ever seen. It doesn't feel like a Halloween movie at all; more like an episode of a horror anthology that just so happens to star Michael Myers. The characters are unfathomably stupid and annoying; the final girl literally screams - for no reason - at the sight of anything vaguely \"horrifying\" (like a child in a dog costume) and demonstrates zero instinct for self-preservation. Busta Rhymes is here and...it's pretty obvious he had some demands as to how his character would need to be portrayed to star in this s**tpile. You have everyone: the horny hippie, the blonde bimbo, the creepy weirdo, the good black guy, the bad black guy...13 year old me could have written these characters.\n\nBut, who cares about the victims right? It's all about the big guy. Unfortunately, Michael Myers is laughable in this movie. His mask looks bad, he has 0 screen presence and he seems to have regressed into a dumb animal. He just sorta walks around and swings his knife around, without rhyme or reason.\n\nNot only that, but the filmmakers decided that cutting between a normal film and grainy, almost unwatchable footage was a good idea. That it was also a good idea to cut a million times anytime Michael goes to kill someone, so there's literally no memorable kills here at all.\n\nThe Ugly: Ironically, the film that was supposed to \"resurrect\" the Halloween franchise basically killed it. Even if you don't like the 2018 or 2021 instalments in the franchise, honestly, this franchise has DEFINITELY seen worse."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "boswellshanita",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "planet9",
        "review_rating": "1",
        "review_title": "Should have called this, \"Screw Up the Halloween Series Project.\"",
        "review_detailed_main": "Boy, was I scared when I watched this \"movie\"! Yeah.scared that I would have to sit through the entire.uh, \"film.\" Well since I was watching it with two others I did have to sit through it, although I had to tape my eyelids open with duck tape and have myself tied to the chair to do it.\n\nMichael Myers is submerged by this terrible, stinking entry in this series. I really like the Halloween series, but this one should have never been made the way it was made. The acting is absolutely horrible, the filming is atrocious, and the entertainment value is non-existent.\n\nJamie Lee Curtis is featured in the very beginning, but is only in the film for a very short time(lucky for her), and after this the title comes up. Then it is nothing but downhill all the way to rock bottom.\n\nA group of \"young\" people (it must be tough being a 35 year old teen-ager) is stuck in the old Myers' house doing something. One can never be sure just what they are supposed to be doing except perhaps showing how they cannot act. ALL of these characters are very unlikable, two-dimensional parodies of human beings. One never gets involved with any of them because there is no character development what so ever and no plot to boot! The most obnoxious of the characters is the black guy with the long hair extensions, whose favorite word is, \"motherfu@#a,\" and he mouths it through huge lips (that seemed to have been over-inflated with collagen injections) through the whole mish-mash.\n\nThis movie is NOT scary at all, has no tension, no excitement, and ALL the special effects are ruined by the constant (very irritating) injections of the \"view\" through the characters mini-cams they have attached to their heads (or whatever).\n\nWhat were the makers of this film thinking when they made this piece of crap? I would like to know that, because it seems like they must have been on \"crack,\" or maybe sitting on their cracks when they put this drivel together. Man, it just plain sucks! It is no wonder that this films release was delayed so long, went through so many name changes (this always happens when the makers know they have a loser), and finally emerged only to be stillborn at the box-office.\n\nMaybe if they make another one of these movies for the \"Halloween\" series, the makers will pick some plain, regular people off the street to star in it, because there is no doubt ANYONE chosen off the street would be better at acting than the..uh.\"actors\" who appear in this bomb. The absolute BEST part of this entire movie was when I was rewinding the tape!!!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "loha21",
        "review_rating": "4",
        "review_title": "First 15 minutes are awesome! ....then, not so much...",
        "review_detailed_main": "The first 15 minutes are amazing! They really make you believe you are about to watch the best Halloween movie they made do far!\n\nThen the real movie begins and it has nothing to do at all with the first 15 minutes. It's hugely disappointing and so so bad."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mikeiskorn",
        "review_rating": "3",
        "review_title": "American Pie Meets Halloween",
        "review_detailed_main": "I'm writing my review whilst half way through this film, something I never do. It's such a cheesy film trying to scare the teenagers. The addition of Busta and the preppy guy from American Pie just makes this film a dud for me."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "kga58",
        "review_rating": "4",
        "review_title": "Michael Myers on Fear Factor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "boomcar61",
        "review_rating": "",
        "review_title": "Loose Ends",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "claudio_carvalho",
        "review_rating": "7",
        "review_title": "Not So Bad",
        "review_detailed_main": "Three young men and three young women are invited to spend the night in the house of Michael Myers, in a type of `Big Brother show'. Michael Myers is in the house and the slaughtering of the participants of the show is broadcast transmitted. I really expected a movie worst than that. But in the end, it is not so bad. The problem is again the use of cameras like in `Blair Witch Project'. It shows a total lack of originality of the director, in a formula that is getting the viewers tired. Anyway, the movie is a good entertainment for fans of this series. The participation of Jamie Lee Curtis is minimum. My vote is seven.\n\nTitle (Brazil): `Halloween Ressurreição' (`Halloween Resurrection')"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "the chef",
        "review_rating": "5",
        "review_title": "weak",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "lifehousefan13",
        "review_rating": "10",
        "review_title": "it rocks",
        "review_detailed_main": "this is an awesome film it is the best sequel even better than h20 cant get better than this awesome art work the actors are good the actresses are good this movie is awesome if you havnt seen it than you better see it fast its worth $3 and &5 cents baby it even shows some boobies"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mullen1979",
        "review_rating": "6",
        "review_title": "I love this HALLOWEEN movie",
        "review_detailed_main": "Is it scary? No! It holds nowhere near the tension that accompanies the installments that came before it and I think it enters unprecedented camp/cheese territory. It has some pretty bad dialogue and the acting isn't the best. It's not a HALLOWEEN movie I take on a serious level at all and to be honest I think it's quite ridiculous. But damn, its entertaining and I absolutely love this entry. I feel warm and cozy when I watch this movie, especially in the fall. The blue lighting is constant throughout this movie. Not since HALLOWEEN 4 have I seen that, and done so beautifully. It certainly doesn't carry with it, the dread that came with 4 but its visually stunning. The music score is one of my favorites out of the series. There is a cool crisp feel of the autumn captured here. Busta Rhymes shines in his ridiculousness, so ridiculous for a HALLOWEEN movie, it's almost charming. I could go on about what makes this a bad movie or a bad entry in the franchise, but I cant hide that there is so much to enjoy on an equal level and although it breaks no new ground, my life wouldnt be the same without this movie and I'm so happy it exists. 10 out of a ridiculous 10."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "hamedpacheco",
        "review_rating": "3",
        "review_title": "Would've been a mediocre stand alone film, but it was an absolute disappointment in the series.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "symbioticpsychotic",
        "review_rating": "5",
        "review_title": "No offence Mr. Rosenthal but you suck!",
        "review_detailed_main": "Is it not bad enough that we experienced Rick Rosenthal's travesty of the Halloween series as early as part 2?\n\nIs not enough that we have sat through countless cliched horror films? Why must we be subjected to the same old thing, Rick? Why bloody rip scenes off from John's very fantastic original Halloween and NOT EVEN MAKE THEM SCARY? Can you not think of your own ideas?\n\nAND (forgive me for being so negative), that whole story at the start that showed why Michael was still alive? I mean PUHLEASE! If it was a paramedic in the back of that ambulance and not really Michael at the end of the last film, why in the name of Norman Bates was he trying to kill Jamie Lee? Because he was angry? Because he was p***ed that he accidently washed his white shirt with his coloureds and it came out pink? No wait, he was a jilted lover of Jamie Lee's and wanted revenge. Or maybe he was Donald Pleasance and he figured that the only way to stop Michael was to kill her!\n\nI am so sure that Jamie Lee Curtis said \"Sure I'll do ANOTHER Halloween film but ONLY if you kill me in like 10 minutes so I can NOT come back cause I'm so OVER these films.\"\n\nAnd what's with Michael opening his eyes at the end? - Gee! Michael is not dead, how surprising, I really wasn't expecting that!!!!!!!!! How insulting!\n\nNot only was this film boring, it was cliche ridden and it was no fun. And I really needed to go to the toilet about 30 minutes in and I thought to myself \"no, I won't go cause something really good is going to happen\", and GUESS WHAT?? I peed my pants waiting for like 3 DAYS.\n\nAnyway, I over putting myself through any more pain about this film, although, I must say, Halloween 2 is MUCH better than this fish and that's saying something."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "heil_99",
        "review_rating": "3",
        "review_title": "Best Left for Dead",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Halloween: Resurrection",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "casjoz",
        "review_rating": "1",
        "review_title": "The Worst Of The Worst!",
        "review_detailed_main": "This was the worst of the series by far, I'd rather have watched Halloween 3 again! If Busta Rhymes character was'nt in this it definately would've got a better rating from me! This character was a total ignorant,annoying as hell,I could'nt wait for him to get killed,now that would've made my day! I give this one a 1,only rent if you really want to lose 90 min. of your life.I have no idea what they were thinking when they made this garbage, that's right...they was'nt!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mentalcritic",
        "review_rating": "",
        "review_title": "Still out of ideas, Hollywood?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "AaronCapenBanner",
        "review_rating": "1",
        "review_title": "Is This The End?",
        "review_detailed_main": "Part VIII picks up with narration explaining how Laurie Strode(now a mental patient for three years, still played by Jamie Lee Curtis) did not really kill her brother Michael, who is still alive, and determined to finish her off...\n\nAfterwards, Michael goes(literally) back home on Halloween night, which is being occupied by college students doing a live web cast with their professor for some kind of sociology/filmmaking experiment. Of course, Michael doesn't take kindly to this, and sets out to kill these intruders.\n\nThe plot twist used to bring Michael back from his apparent \"final\" end of Part VII is clever; utterly pointless, crass, and contrived, but clever. Shame the rest of this shoddy, foul-mouthed, unappealing and stupid sequel isn't. A real piece of trash, and possibly the final chapter(but you never know...Part IX could happen one day!)"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Elvis-Del-Valle",
        "review_rating": "7",
        "review_title": "It is still a slasher like the other installments, but with a bit of humor",
        "review_detailed_main": "When I was a little kid, I liked this movie and still I do. It is not the worst in the franchise as they say, but it does have certain setbacks. What I can highlight about this film is the soundtrack, the atmosphere and the death scenes. The only problem I see with this movie is that it contains elements of black humor, which makes this movie seem almost like a parody. It's not the worst because at least it's entertaining, but on a certain level it ranks low in the franchise. In the end it's a regular movie and that's why I give it a 7/10, of course its sin was having been made to get more money."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "TelevisionJunkie",
        "review_rating": "2",
        "review_title": "Often stupid, sometimes clever, and completely unnecessary (SPOILERS ahead)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "j0hn22",
        "review_rating": "8",
        "review_title": "It's, definitely NOT the worst movie of the franchise",
        "review_detailed_main": "First of all, when I first watched the official trailer of the movie I kinda liked it and I had high expectations about it, even though it seemed way different than the previous movies. Eventually, it was as good as I had imagined and I enjoyed it. The plot of the movie was interesting and very different than the previous movies of the franchise. The storyline was kinda well-written and well-explained, even though it was very simple and easy to understand. Sadly, the characters weren't interesting, nor well-developed and they were kinda annoying. The filming location of the movie was mainly, inside Michael's big, creepy house. At least, the killcount of the movie was very bloody and brutal. Michael's appearance was nice in that movie and his mask was kinda similar to the original movies. The opening scene of the movie was definitely unpredictable and kinda shocking. The ending scene was expected and it was similar to the previous movies. It wasn't a scary movie and there weren't any jumpscares, just like the previous movies. Overall, \"Halloween: Resurrection\" was an enjoyable slasher film, full of death scenes, some intense moments and I would definitely recommend it to my friends."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "james362001",
        "review_rating": "6",
        "review_title": "Forget this film and accept the ending of Halloween: H2O.",
        "review_detailed_main": "Horrible \"Halloween\" entry and sequel to Halloween: H2O. The start of this film with Jamie Lee Curtis looked promising, but alas, it ended to quick and the demise of the strong character of \"Laurie\" is unacceptable to me. After this, the film becomes too ridiculous. Very predictable and did not scare me a bit. I would rather forget this film and accept the ending of Halloween: H2O for what it is. Thanks for returning as \"Laurie\" Mrs. Jamie Lee Curtis, but so sorry the rest of the film was bad."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "trashgang",
        "review_rating": "5",
        "review_title": "what goes wrong when you popularize a franchise",
        "review_detailed_main": "Let me answer on my summary, everything can go wrong. First, it picks up were H20 ended so again forget part 3,4,5 and 6. Secondly, money makes the world go around, Jamie Lee Curtis is just in it for a teaser. And last, Michael died in H2O but here they gave a stupid twist to H2O's ending and never explained anything. The only good thing was that they brought back Rick Rosenthal, the director of part 2.\n\nSo Laurie Strode is just in it in the first minutes, the part that makes H2O a bit laughable, but once that's over we see the main storyline. And here we have the popularization of Michael Myers. This has nothing to do with Halloween, I remember pinhead (Hellraiser: Hellworld) being involved in an internet craziness, well, this is nothing else. Just watch Michael's first killing, that's surely based on, and an inside joke, to Peeping Tom's killings with a tripod.\n\nLook, if you go back to the Myers' house than it's just not possible that Michael is still living in that house, abandoned for 20 years. And with the kids running into trouble, nobody goes out to rescue them, even as you can follow their mayhem on the Net! And the way it was filmed is just picking in, again, on mockumentaries and docu style horrors like Blair Witch or FearDotCom. I have seen the 4 endings that were shot and one, the CSI ending was surely made to go further on with the franchise. Katee Sackhoff was in this flick as Jen just to move one year later to the Batllestar Galactica series as Starbuck. Daisy McCrackin, reveals some flesh and there's more red stuff and stabbing then in H2O, so on that part it really looks more Halloween then H2O but still, bad storyline.\n\nUp to this writing Michael didn't reappear if we don't count Rob Zombie's remake with it. Brad Loree did fine as Michael Myers, and the acting was okay, sadly as John Carpenter once said, a good flick needs a good story, and how many franchises died with the popularisation of the main character (remember Freddy!)\n\nGore 2/5 Nudity 1/5 Effects 3/5 Story 2/5 Comedy 0/5"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "molemandavid",
        "review_rating": "2",
        "review_title": "Obscenely Idiotic",
        "review_detailed_main": "The Halloween franchise has never been a big stickler for continuity or quality, but the series hits an all time low with this entry. Poor Jamie Lee Curtis is reduced to a lousy opening cameo that makes absolutely no sense while sporting a long fright wig. As awful and nonsensical as that opening is, it's the high point of the film.\n\nMichael returns home and is understandably upset that the cast and crew of a webcam reality show has set up shop in his old stomping grounds. Naturally, he begins to pick them off one by one (and sometimes two by two), but don't worry - you won't have to sit through any of that awful suspense or those pesky scares. Halloween: Resurrection feels like a classic case of film by commitee. There's no passion whatsoever.\n\nThe best thing one could say is that Tyra Banks doesn't embarrass herself and some of Danny Lux's music cues (including his takes on Carpenter's original score) are pretty decent."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "danjcoll",
        "review_rating": "2",
        "review_title": "A disastrous excuse for a horror... an even worse excuse for a Halloween film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "gabriel_sanchez",
        "review_rating": "2",
        "review_title": "Even Myers is getting tired...",
        "review_detailed_main": "If you've made it this far, you know what you're in for!\n\nBy this point, your mind is already sore. \"Halloween: Resurrection\" is, yet, another sequel on the Halloween franchise.\n\nIt's pretty much the same as its predecessor: \"Halloween H20: 20 Years Later\", though it managed to be worse.\n\nPlot is mediocre, just another excuse to put Michael Myers on-screen again.\n\nAlso, some huge flaws throughout the movie. Those familiar with the series will notice.\n\nOverall, if you're in for watching all the Halloween series out of curiosity, go for it! It's kinda funny to see how things changed through each sequel released.\n\nIf you're looking for some great slasher flick, I'd say \"stay away!\". This movie is only for those fond with Michael Myers franchise, those seeking to watch all the movie series."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "wumbi",
        "review_rating": "1",
        "review_title": "An insult",
        "review_detailed_main": "Yet another pathetic attempt to resurrect the series while insulting Carpenter's legacy. This money grabbing scheme will make you yawn before it shocks you."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Gresh854",
        "review_rating": "2",
        "review_title": "The One Where *SPOILERS* Busta Rhymes Electricutes Michael Myer's In The Nuts To Death...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "lizr-49570",
        "review_rating": "7",
        "review_title": "Drop any expectations",
        "review_detailed_main": "I think that if you can check your expectations at the door and treat it as a separate/side story in the franchise, you can have a lot of fun with this and a more enjoyable experience."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "weezercoke",
        "review_rating": "4",
        "review_title": "So bad it is good?",
        "review_detailed_main": "If you are with horror friends at four am after a case of beer, this can be fun. Sober it can be hard to finish."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "dude2aq@yahoo.com",
        "review_rating": "10",
        "review_title": "Must see! Exlllecent movie!",
        "review_detailed_main": "This was a very good movie.It is a lot better than some of the other sequels.It starts out exciting and stays exciting thoughout the movie.I am also the biggest fan of all the Halloween films except for the third sequel.But in conclusion you must see Halloween Resurrection. It will be one of the best movies you will see this year!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "dormesher-21565",
        "review_rating": "7",
        "review_title": "The guilty pleasure movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "munzur-32605",
        "review_rating": "2",
        "review_title": "Something else",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "danstevon",
        "review_rating": "1",
        "review_title": "Piss Poor",
        "review_detailed_main": "By far the worst of the franchise, some of the fan made Halloween movies on YouTube genuinely put this to shame. It's ridiculous, Michael Myers hair changes in virtually every shot, but most of the time they've given him what I presume was a \"modern\" make over, he has a haircut like he's the singer from Green Day! The film isn't scary, it isn't anything remotely like the previous films. Watch this then immediately watch Rob Zombie's remake (which was the next instalment) and it actually makes you understand why the 2007 film was so violent."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Ownsin",
        "review_rating": "5",
        "review_title": "The Movie is not Very good But its OK",
        "review_detailed_main": "i saw the movie and from what i saw the movie wasn't that good i mean Halloween is all about killing its not as better than the old ones but still its fun to watch i somehow liked watching it I'm a fan of Halloween movies i may not be giving a lot of information here but I'm just saying for all Halloween fans you should watch this this is good to watch if you have nothing to do or bored believe me its an OK movie it talks about teenagers visiting Michael Myeres House and stay in it for 1 day while they are in there they start dieing one by one you should see the movie i don't want to ruin it for you but believe me its a good horror movie to watch and it would be a good tribute for Mustafa Akaad The Producer of Halloween Movies."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ethanbresnett",
        "review_rating": "2",
        "review_title": "One of the worst films I've ever seen",
        "review_detailed_main": "How we ended up with this god awful movie after the fantastic original Halloween (1978) is a crime against film. The instalments in the Halloween franchise have always been below the standard of that original, but I never thought they'd sink this low.\n\nThe opening of the film is so absurd, and seemingly the result of a contractual obligation rather than any storytelling purpose or love of the material. As a result it feels so out of place and disconnected from the rest of the film.\n\nThen there's the main plot, which really has no redeeming features at all. Awful acting. Painful dialogue. Cliche upon cliche. Bad camera work and direction. I was counting the minutes until this film was over.\n\nDespite other films in the franchise often being poor, there was at least always a desire to try and appreciate the characters of the franchise and to build the Michael Myers mythology. In this film however there is no such desire and it suffers drastically as a result."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ThePhantomKiller",
        "review_rating": "1",
        "review_title": "An absolute travesty....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Michael_Pilkington",
        "review_rating": "",
        "review_title": "Almost laughable \"Halloween\" sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Movie-ManDan",
        "review_rating": "7",
        "review_title": "Ignore the First 15 Minutes, Think Of It As A Prequel To H20, Then It Will Become A Guilty Pleasure.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "squidconsumption",
        "review_rating": "1",
        "review_title": "Busta a NO NO!!!!",
        "review_detailed_main": "This movie was horrible. What is up with Busta rhymes doing the karate kicks with the sound effects. I couldn't believe they would put him in a myers movie. It was hilarious seeing Busta karate kicking and wahhing. What the! They couldn't pick a better person? It is ridiculous how bad these movies get. If a person has their head chopped off (Mike Myers in H20) then how are they going to come back. If the creators were smart they would just leave the series alone and stop continuing it. It is only getting worse. When i was 4 and saw the first one i was freaked out. But if a 4 year old saw this one they would start cracking up. Come on. Can it get any worse? Should i have even of asked. If anyone liked this they must have been on serious meds."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "anthonyskett",
        "review_rating": "8",
        "review_title": "Busta saved this movie",
        "review_detailed_main": "Better than most Halloween movies inc the kills. Busta had me in stitches when he made Myers leave the room."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "happyendingrocks",
        "review_rating": "6",
        "review_title": "Next up: P. Diddy battles Michael Myers in a steel cage?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "DaysFan79",
        "review_rating": "1",
        "review_title": "Terrible! Garbabe! A disgrace and disappointment to fans!",
        "review_detailed_main": "When I watched this, I was hoping it was a dream. I wish they would have ended the whole series after H20. The opening sequence with Jaime Lee was fun to watch - she is great in everything she does, we know that, but the rest of it was truly pathetic! Sadly, we no longer have Donald Pleasance who practically kept the films going. Jaime Lee is done with them. So what do we do? We cast a bunch of sorry unknowns who we don't have to pay much, plus a supermodel named Tyra Banks who has only a few lines, plus we put an Oscar worthy rapper (NOT!) in it that loves using the F-word every 2 seconds. The whole idea of using the cameras and a group of stupid, drunk kids at a Halloween party watching the whole thing on a pda/computer screen was so cheesy. And what I enjoyed about the Hallowen films up to this point was that they were cheese-free. The Blair Witch Craze is over - find something fresh guys! And the head chopping scene with the butcher knife was really ridiculous. I loved all the films up to this one. I like the direction they took with H4 and H5. H6 was OK. I hated that they cast another lame unknown in the role of Jaime Lloyd and then killed her off - another dumb idea! Danielle Harris should have been paid what she wanted. Anyway, John Carpenter is probably ashamed and disgusted by what they have done with this series if he watched H8 and I'm sure Donald Pleasance is rolling over in his grave. I hope H9 will be decent, but if they expect to do anything like they did in 8, I will not watch it and the series will be dead. Please let them have a decent plot and some real star-power with decent acting. Whoever came up with the idiotic ideas for this film really needs a hearty slap in the face for stupidity. Give us a break."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "glyptoteque",
        "review_rating": "1",
        "review_title": "Despicable, repulsive, abominable..and the list goes on and on!",
        "review_detailed_main": "There was this \"documentary\" on last night, under the heading of \"Rappers in Horror\". Of course as the title suggested,it dealt with a truly nauseating theme, the long ago(I'm so sorry to say!!)realized possibility of letting spastic, \"hard-ass-mothafucking\" simpletons actually venture into the sacred territory that is horror. A horrible experiment gone absolutely wrong(As if the mere idea of it should evoke any kind of hope. Yeah, right!), and as we all know, in ultra commercial Follywood they simply love to hold on for dear life to anything that is slick, superficial, vomit-inducing, and ergo anything that makes sure the cardboard figures working there gets their hard earned millions. Anyway, back to this sad, sad, show I was talking about. Of course the best thing would have been not to spend one single iota of energy on it, but I figured that I might get some good, unintentional comedy, so why not? And sure as hell, what unfolded itself before my very eyes was a lesson in learning how to phrase a sentence like all good illiterates do; think long and hard before uttering the most simple thought, speak like a lazy drunkard, get your words(or letters for that matter) mixed up, and wait for it....here it comes...Wait...act like this is the way to go, act like you're real tough, when you actually have the vocabulary of a mentally challenged 3-year old!! And that finally brings me to the matter at hand, this turd that is actually smeared inside a DVD-case, lying there, silently waiting, and hoping that some poor fellow will actually get confused, and will alas pass the feces off for a actual film. And if a turd is actually going to look like a proper one, everyone behind, and in front of camera must contribute, and of course here is the catch, without anyone having any knowledge what so ever about it. Now they stand there, thinking they have made a brilliant horror-film, immensely proud, and none the wiser. And of course my reason for bringing up the \"documentary\", is for the sole reason that it featured \"Busta Rhymes\"(Hrmmm...really great name, he,he..) in connection with the crap I'm currently reviewing. And I'm so sorry to inform you all that he was the one that contributed the most to the rancid stench that oozes out of each and every pour of the celluloid. \"Acting\" is undoubtedly a foreign word for this \"gangsta\", but yeaaayh, he brings all his long practiced skills within the rap-genre with him, just to make up for the fact that it would have been more enjoyable having your fingernails torn out, being slowly flayed alive or even to attend a Christian get together, than to watch this oh so tough \"actor\" ever again!! Maybe the FBI should have considered having a rapper on their payroll the next time they want to catch a serial killer, everyone knows now that a few pathetic karate-kicks, and lots and lots of verbal profanity is the way to go when faced with evil. To sum up, appalling acting, appalling script, appalling everything, really. I hear something flushing...."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "This is *so* not what I signed up for",
        "review_detailed_main": "No, like, I mean, *totally*. The series reaches its lowest, and Resurrection ironically enough killed it until Rob Zombie remade them(I haven't watched either of his attempts yet, but I have literally no reason to believe that he handles them well). This was made purely to crap out another sequel, and with how sub-standard it turned out, that does not come close to justifying its existence. The plot is meaningless and full of holes. There is not a single character in this that you can relate to(all are stereotypical and one-note), like, and there's a mere handful of them that you can even stand. They go out of their way to be obnoxious, and you do not feel any sympathy when they die. The acting is utterly unimpressive, for both the names and the unknowns in the cast. Worst are probably the model and the rapper. The music is OK, and the original theme does turn up here and there. This doesn't build up atmosphere, suspense or tension all that well. There are cheap scares, the set-up is forced, and, well, here's a clue for the film-makers who clearly had none: When those in the movie are bored, the viewers are, too. Editing and cinematography are decent at best. The show doesn't make sense; are they only going to do it once a year, on Halloween? There's only the one house, are they picking up a new sensationalist background for each iteration? Is it a one-time thing? Why on Earth do they think they'll be rich, it's not like they have something easy to franchise? This isn't likely to satisfy the least picky of its intended audience. There is plenty of bloody(and at points, gory) violence, relatively frequent strong language, a little sexuality/suggestive material and brief gratuitous nudity. I recommend this solely to those who must watch every single slasher made, regardless of their quality. 1/10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jpkwolf",
        "review_rating": "1",
        "review_title": "Worst movie.. EVER",
        "review_detailed_main": "H20 had good direction, decent acting from most actors and Jamie Lee Curtis did a very good job. It was all a good package with a good story line to end the series. Then what is this? Another Halloween movie. Well go ahead if it's a good sequel but of course it's not. It's a crap movie that cripples the whole series. Everything you could think of is just wrong in this movie. The direction sucks, everyones acting sucks (Even the acting of Jamie Lee Curtis) and it uses stupid and terrible hand camera shots. In H20 the characters behaved in a sensible way but in this lame excuse for a movie nobody does. First they kill off Laurie Strode (Jamie Lees character) which takes away 50% of the interest in this movie. The beginning setting of the movie doesn't make sense at all. Also in the beginning sequence when Laurie could kill Michael she does something that doesn't make sense at all which results in her death in the hands of Michael. Then there is the character of Busta Rhymes. First of all he can't act and his character is lame. Then he goes to kick Michaels ass twice and win which is apparently something that Laurie couldn't do. There are other lame things in this movie like all the kills that Michael does. This is clearly just an attempt to make money with the Halloween series name. Jamie Lee wanted to get out of the series by getting her character killed. I wish they would have at least done it with style or rather NEVER made this trash. H20 was a great and proper ending to the series.\n\nI'm just going to pretend this movie doesn't exist. Maybe the worst movie I have ever seen."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "greenhair77",
        "review_rating": "1",
        "review_title": "This movie sucks",
        "review_detailed_main": "This is definitely not a movie I want to waste any more time or money on. It is totally dissapointing compared to the rest of the Halloween series. There are only three good movies that came from the Halloween series:Halloween, Halloween 2, and Halloween H20. This installment is a disgrace, almost as bad as Halloween 3: Season of the Witch. If you have to see this movie, wait for T.V. if ever."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mcoley-72325",
        "review_rating": "2",
        "review_title": "Was It a contractual obligation to make this movie?",
        "review_detailed_main": "If anyone ever tries to tell you that this is not the worst of the Halloween movies, you need to punch them directly in the face and walk away as briskly as you can."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "OllieSuave-007",
        "review_rating": "7",
        "review_title": "Not the best of the series, but it's still somewhat entertaining and humorous.",
        "review_detailed_main": "The ongoing Halloween series continues with Michael Myers going back to his old house to scare the cast and crew of a reality show that is being filmed and broadcasted from the home. It's more of the same running and slashing stuff, but the live film action via the internet premise was somewhat interesting and you get quite the dose of humor from some of the characters.\n\nThe acting wasn't bad and, at just ending 90 minutes of film time, the movie doesn't drag endlessly. The plot is quite fast paced. And, while the film does leave some unanswered loose ends, is not bad popcorn entertainment.\n\nGrade B-"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "BA_Harrison",
        "review_rating": "4",
        "review_title": "Myers Little Eye.",
        "review_detailed_main": "In order to wring one last drop of blood from this extremely tired series, the makers of Resurrection come up with a really moronic reason for Michael Myers to be still alive, after which they ill-advisedly proceed to kill off Laurie Strode (sacrilege!) and then set-up the lamest possible excuse for yet another teen slaughter—the filming of an internet reality show in the old Myers house (still standing after all of these years).\n\nNow I thought H20 was bad, but this chapter in the Halloween franchise hits an all time low: a dreadful cast (featuring Busta Rhymes and Tyra Banks, ferchristsakes!) pointlessly struggle to make the most of their awful dialogue; the ridiculous plot introduces some truly inane developments (do many suburban houses have a secret network of tunnels running beneath them?); and director Rick Rosenthal chucks in just about every cliché going plus a few dumb ideas of his own for good measure.\n\nBusta Rhymes doing kung fu on Michael is pretty idiotic, but for me, the worst thing about this whole film is the fact that the producers of a reality show go to all the trouble of organising auditions, setting up a website, and installing all manner of electrical equipment, but use cameras that give a picture quality worse than a 10th generation VHS tape that's been left next to a powerful loudspeaker for a week. However, I'm sure you'll find your own favourite reason to dislike this mess: there's plenty to choose from.\n\n3.5 out of 10, rounded up to 4 for the gratuitous bewbz and some brief chainsaw action."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "forgotten_demoness_15",
        "review_rating": "10",
        "review_title": "Great",
        "review_detailed_main": "I like the movie a lot. I like its' graphics for one. I also like this movie a lot because it follows the Halloween series and I feel that the producer has managed to grab the plot of the movie unlike Halloween: Season of the Witch 3rd movie of the Halloween series."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Amohrman25",
        "review_rating": "7",
        "review_title": "Doesn't deserve all the hate it gets.",
        "review_detailed_main": "There are great moments in this movie and it doesn't deserve all the hate it gets. Some of it is necessary, mind you, but most of it isn't. There is great humor and a unique idea that really makes the movie worthwhile. Great kills too and the movie feels ahead of its time with the live-streaming. Busta Rhymes and Tyra Banks are obnoxious, but Busta does have a good scene with Michael. All in all I like this movie, despite all the negative things about it."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "mario_c",
        "review_rating": "4",
        "review_title": "Michael Myers is now a reality-show's star!",
        "review_detailed_main": "Michael Myers is back, but this time he's the star of a reality show! This last movie of the Halloween series is funny\u0085very funny indeed! It brings the \"old\" Michael Myers to the XXI century, to the internet era!... The plot is about a group of teenagers that are chosen to participate in a kind of reality-show broadcasted by the internet, \"The Dangertainment\", which consists in being locked at Michael Myers house, exploring everything that belonged to him\u0085 They thought it would be an amusing entertainment, scaring to the public, but funny to them\u0085 However they are not home alone, and the fun will begin, but for Myers!\n\nThe reality-show's fashion has reached the horror films! It's a movie that reflects nowadays society, always waiting for some reality show in the screen! But, on the other hand I think this movie is also a critic to that\u0085 By a comical point of view it can even be seen as a spoof to the horror flicks, because just to a spoof movie one would mind to create such pathetic idea!\n\nThis movie would be a nice target to the next \"Scary Movie\"\u0085 Producers of spoof movies please take a look on it!\n\nBeside this \"brilliant\" \"pseudo-scary-reality-show\" the movie is a traditional slasher, just one more to the Halloween series\u0085 But could/should we expect something else beyond this \"knife cuts flesh\" from a Halloween series movie? Of course not! So it's an average movie anyway!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "tsatsas",
        "review_rating": "",
        "review_title": "Sad But True",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Thundercats85",
        "review_rating": "1",
        "review_title": "Halloween: Abomination. 20 Years Later...it's worse than you remember",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "cricketbat",
        "review_rating": "4",
        "review_title": "How Do You Do, Fellow Kids?",
        "review_detailed_main": "Halloween: Resurrection is what happens when you have a producer say, \"Hey! Let's make a sequel that appeals to a younger demographic.\" However, in attempting to make this movie \"cool,\" the filmmakers shot (stabbed?) themselves in the foot. Between the questionable choices in casting and the ridiculous plot, this film just feels dated. And it was a poor attempt at a Halloween movie in the first place."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "lostintwinpeaks",
        "review_rating": "2",
        "review_title": "HALLOWEEN: WHATEVER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "matthewssilverhammer",
        "review_rating": "2",
        "review_title": "Bottom of a Sad Slasher Barrel",
        "review_detailed_main": "When I watched the entire Elm Street series last year, I looked forward to revisiting the franchise again one day, even the bad films. That is NOT the case with the Halloween films, and this may be the bottom of the barrel. A dated, lazy and disrespectful piece of hot, ugly garbage, Resurrection has many of the \"so-bad-it's-good\" traits I love in rotten cinema (ridiculous logic, ill-advised comedy, terrible acting) but none of the noble conviction. However, any time Busta Rhymes speaks is pure gold."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "savagerox-39160",
        "review_rating": "6",
        "review_title": "Much better than Halloween Kills",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "1",
        "review_title": "A colossal misfiring that fundamentally betrays the franchise, \"Halloween: Resurrection\" is a shallowly-trendy, sub-par by-the-books slasher flick.",
        "review_detailed_main": "You know a slasher-franchise has reached it's lowest point when an integral scene revolves around an iconic villain such as Michael Myers becoming involved in a cartoonish kung-fu fight (complete with over- the-top Bruce Lee-like screams) against a rapper who was already sort of fading from the public scene even at the time of this film's release. (Btw, that's not spoiling anything.)\n\nBut hey... at least it wasn't set in space, which is where other horror movie franchises seem to want to go to die when they realize they've run out of ideas. (*Cough, cough*... Friday the 13th, Leprechaun, Critters, etc., *cough*) I guess that's sort-of a plus.\n\n\"Halloween: Resurrection\" is a tedious, shallowly-trendy, under- written (and under-directed) and shockingly cartoonish nail in the coffin to what started out as an excellent horror film series. The original was a classic by any measure, and a surprising number of the sequels were actually quite good as well. (In particular the second film, and the 20th Anniversary release \"Halloween H20\", both of which are definitely some of the best slasher-sequels ever made.)\n\nEven at their worst, earlier entries showed quite a bit of class and effort (even when it failed spectacularly, as in films like \"Curse of Michael Myers\"). Whereas this entry is instead keen to deliver the most boringly by-the-books scares and cardboard-flat characters, all while shoehorning in an incredibly dated plot revolving around the internet and reality TV- things that were just starting to take off big at the time. This reveals that the film is little more than a cash-in on the internet/reality-TV crazes, while also trying to capitalize by being part of a recognizable franchise. It's the absolute embodiment of \"hack filmmaking.\"\n\nAnd the true tragedy of this- this film was directed by Rick Rosenthal, who directed the generally very well-received \"Halloween II\", which is arguably one of the strongest entries in the entire franchise. In a shocking 180 degree turn, his return to the franchise results not in another solid sequel, but instead this abomination- the absolute worst in the entire franchise.\n\nAfter a prologue sequence too insulting to long-time franchise fans to even bother summarizing here, we are introduced to our new \"characters\" (a term I use loosely), who are to be featured on an upcoming internet-based reality-TV series. The hook of the show: They are to spend a night exploring the old Michael Myers house in Haddonfield, Illinois. Of course you know that that means: Michael comes home, and decides it's time to pick-off these intruders one-by- one, forcing them to try and fight for their survival.\n\nNothing about this film works.\n\nPerformances are stale, and alternate between irritatingly boring and infuriatingly over-the-top. The worst contender being the aforementioned rapper, Busta Rhymes, who seems to be trying way too hard to convince the world he's a charming, funny, likable actor when he clearly is out of his element. He comes across as a weirdly contrived cartoon-character that has been shoehorned into the film.\n\nThe script (courtesy Larry Band and Sean Hood) is a disheartening and frankly condescending mish-mash of lazy re-hashes from prior films and the forced inclusion of the \"modern\" (aka, dated within six months) elements like the internet/reality-TV angle. \"Modern\" elements which were clearly only included because one of the writers happened to open up the entertainment section of his newspaper one day and see the words \"internet\" and \"reality-TV\" in the headlines, and came under the impression that putting these contrivances in would make the film feel \"timely.\"\n\nAdd to that the obvious indifference on the part of director Rosenthal, and you can tell this film is just a complete mess. The film feels like he couldn't care less about crafting a good thriller. Scenes are shot with the most obnoxiously boring compositions, set design is cliché (Oooo... creepy, grimy hallways... I haven't seen that before in every other horror film ever), poor costume design, etc. Rosenthal just didn't seem to put his heart into any decision made, and it's clear the whole film suffers for it.\n\nHeck. Even the mask used in the film doesn't measure up to previous entries. It's weird, cheap and looks like a bad fan-made piece of costuming, as opposed to a major Hollywood release.\n\nThis is the film that destroyed the franchise. After the stellar prior entry, I had high hopes, and this film seemed like it was purposely going out of it's way to fail to meet any expectation... Even the lowest of expectation.\n\nThis gets a well-deserved 1 out of 10. And I personally find it such a bizarrely poor film, that in no way fits in with the rest of the franchise tonally or stylistically... I don't even count it as canonical."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jacobjohntaylor1",
        "review_rating": "9",
        "review_title": "This is not awful it is a lot better then part 3",
        "review_detailed_main": "This is a great movie. And it an underrated movie. It not awful. But Halloween H20 is a lot better. So is Halloween 9. Halloween the cures of Micheal Myers is better. Halloween 5 the revenge of Micheal Myers is better. Halloween 4 the return of Micheal Myers is better. Halloween II (1981) is better. The original Halloween from 1978 is better. And so is Halloween II (2009). Good movie pertty scary. A lot better then Halloween III seaon of the witch. It is have a good story line. It also had great acting."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "bsmith5552",
        "review_rating": "7",
        "review_title": "Imaginative Sequel!",
        "review_detailed_main": "\"Halloween: Resurrection\" is another in the long list of \"Halloween\" (1978) sequels to be sure, but this one is better than most and uses interesting new cinematic techniques to enhance the horror.\n\nThe story opens with a prologue in which we find out how Michael Myers (Brad Loree) escaped death in the previous installment \"Halloween H2O\" (1998) and what has become of his beleaguered sister Laura (Jamie Lee Curtis). After a couple of grizzly murders we move on to the main story.\n\nThe main body of the film which involves six young people being chosen by promoters Busta Rhymes and Tyra Banks to spend a night in the 25 year old deserted Michael Myers house, with the whole event being captured on video for a web cast over the internet. But of course you know who is also lurking about in the house.\n\nThe six, and I hope I've got this right are Bianca Kajlich as Sara, the main character, Sean Patrick Thomas, Daisy McCrackin (looking like a younger Julianne Moore), Katee Sachoff, Luke Kirby and Thomas Ian Nicholas. Naturally there are the usual bloody murders as one would expect in a Halloween flick. Helping Sara escape the horror is high school student Ryan Merriman, who had established an on-line relationship with her and is watching the proceedings on the web. He is able to warn her through e-mails over their respective cell phones of impending danger.\n\nWhat sets this film apart though, is Director Rick Rosenthal's innovative use of digital video cameras strapped to the head of each of the six actors in the house. As well, there are stationary surveillance cameras scattered throughout the house for added effect. These are actual working cameras that capture the events of the story from six different points of view. The video footage is integrated with the film footage to give the film a more terrifying feel. We see what the characters see including a couple of their own murders.\n\nRosenthal reveals on the DVD that a Special Edition DVD will be forth coming where the viewer can follow any one of the six characters through the ordeal utilizing only the footage shot from their respective video cameras. In other words you can follow the story from six different points of view.\n\nShould be interesting."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Go_For_The_Jugular",
        "review_rating": "3",
        "review_title": "And we're back...to Cr*psville!",
        "review_detailed_main": "After the somewhat decent 'Halloween H20', I thought this franchise was starting to pick up. But it wasn't. Back to the absolute dross that is Michael Myers and all things associated with him.\n\nNot only starring college kids...it looks like it was written, produced, directed and filmed by them too!\n\nVery much 'of its time'...absolutely reeks of the late 90s.\n\nStupid idea, stupid plot, stupid acting!\n\nHow has this franchise lasted so long?"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "youngjacob2002",
        "review_rating": "",
        "review_title": "THE WORST HORROR MOVIE EVER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Boba_Fett1138",
        "review_rating": "4",
        "review_title": "Such a bad concept for an Halloween movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "tysonrowlands",
        "review_rating": "2",
        "review_title": "No Wonder They Had To Reboot",
        "review_detailed_main": "It's admirable how much the filmmakers bend over backwards to try and cancel out the finale of the previous film which found Michael Myers decapitated in a field, but after this bit of creative maneuvering, it becomes just like MTV'S The Real World but with even more vapid characters and little scares. Even a 5 minute appearance by Jamie Lee Curtis doesn't help things and she looks like she can't wait to be elsewhere."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "IonicBreezeMachine",
        "review_rating": "5",
        "review_title": "Not as bad as some have said and a few interesting ideas, even if its ending seems like it has a confused stance",
        "review_detailed_main": "Four years after serial killer Michael Myers (Brad Loree) faked his death by placing a paramedic he muted in his outfit, he has successfully killed his committed sister Laurie Strode (Jamie Lee Curtis) and remains at large. Meanwhile in Michael's home town of Haddonfield, Illinois, internet entertainment company Dangertainment headed by Freddie Harris (Busta Rhymes) and Nora Winston (Tyra Banks) is prepping an internet webcast where 6 people will spend the night in the old Myers' house uncovering clues as to what made him the killer he is. While initially intended to be simulated and theatrical \"reality\", the inclusion of the real Michael Myers makes the danger very real.\n\nWhile Jamie Lee Curtis did Halloween H20: 20 Years Later with the intent on it being the final Halloween film, producer Moustapha Akkad had absolutely no intention of killing his meal ticket and including a contract clause where Michael wouldn't die and additional footage was shot involving Michael switching places with a paramedic that was not shown in H20 but would be used in the sequel. While there were discussions about possibly switching focus to an evil Laurie Strode, these talks never went anywhere and instead the producers brought in writer Paul Freeman to repurpose his already written script involving a serial killer crashing a reality TV setup inspired by the rise in popularity of the genre as well as internet webcasts. Made for a $15 million budget and earning back $37 million, the film was seen as a minor disappointment and would lead to a period of hibernation for the series until the 2007 Rob Zombie reimagining. Resurrection is often considered one of the worst entries in the Halloween series, but it's honestly not that bad and has a few decent ideas even if they aren't all that well executed.\n\nWhile the movie makes some pretty glaring missteps such as Laurie Strode's unceremonious death or an ending speech that seems to be really out of place with Busta Rhymes character lecturing the media on the ethics of sensationalizing a serial killer (one of the moments that John Carpenter pointed to as an embarrassment with the franchise), I actually think the movie's implementation of the webcast/reality show gimmick is reasonably well executed, even down to the casting of Tyra Banks who was an early adopter of the format in real life using it for a web exclusive Victoria's Secret fashion show in 1999. While the Dangertainment contestants aren't the most developed assortment of characters, they honestly aren't annoying and there actually is an interesting and slightly more subtle way they're utilized in a meta sense. A minor character named Myles (Ryan Merriman) is in regular contact with lead character Sara (Bianca Kajlich) under the pseudonym of Deckard who is a viewer of Dangertainment, and while he acts primarily as an observer during the first half of the stream the second half is where it gets more interesting. As Myles/Deckard is a high school freshman and a proxy for the target audience of this kind of movie, the setup in the Myers house is very much like a slasher film setup and Myles like a horror movie viewer. When the movie gets to the halfway point and he's sending Sara messages using what he sees, it's basically a take on audience members shouting at the screen for horror movie characters but we're actually seeing it affect the actions. Maybe I'm giving the film more credit than it deserves but that was an element that I actually kind of liked.\n\nHalloween: Resurrection honestly isn't that bad and I don't think it's earned the level of derision and scorn it's accumulated online. Now I don't think it's perfect and as a slasher it's pretty standard fare that takes quite a few missteps, but I maintain you can do worse in this series such as Halloween 5 which I stand by as the worst of this series (at least that I've seen so far)."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "4",
        "review_title": "Very Bad",
        "review_detailed_main": "Myers has always been fun to watch. The films of the series deteriorated over time. This movie is not good. There was potential, but they didn't use it."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Thanos_Alfie",
        "review_rating": "4",
        "review_title": "Waste of time...",
        "review_detailed_main": "\"Halloween: Resurrection\" is a Thriller - Horror movie and another movie of the \"Halloween\" franchise, in which we watch Michael Myers traveling to Haddonfield to hunt the cast and crew of a reality show.\n\nAfter so many movies I had the expectation to watch something different or new on this movie of the \"Halloween\" franchise but for one more time I was disappointed since something like this did not happen. The interpretation of Jamie Lee Curtis who played for one more time as Laurie Strode was simple but good. The direction which was made by Rick Rosenthal was also simple but he did not succeed to present his main characters so good and the plot of the movie did not help him at all. In conclusion, I have to say that \"Halloween: Resurrection\" is not the best horror movie but also it is not the worst."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jp_91",
        "review_rating": "6",
        "review_title": "Weak sequel with Michael Myers.",
        "review_detailed_main": "Michael Myers is back again but this time the script was a flop, Laurie Strode's fate was awful, the new characters were silly ones. The script based on the early 2000's reality shows was a bad idea, a \"modern\" story (in 2002) for the Halloween franchise was stupid. The good point was Jamie Lee Curtis scenes. I gave to this movie a 6 for a good time I spent watching this when I was a teenager."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "paganborn",
        "review_rating": "4",
        "review_title": "Eight Is Enough!",
        "review_detailed_main": "I wish I could say that this movie lacked any redeemable values... but I have to admit that there were some good moments to be had by anyone who enjoys the genre and the franchise. Unfortunately, these tense and suspenseful moments occur towards the last 20 minutes of the film.\n\nThe story revolves around a reality TV show, owned by Busta Rhymes and produced by Tyra Banks, that puts a group of college students in the old Myers house to unravel the mysteries behind Michael's killing spree. There are an abundance of limp thrills and cheap gore sprinkled with some genuine cleverness. It was great to see Jamie Lee Curtis resurrecting her role as the homicidal maniac's favorite sister, but her part seemed to have been added solely to give credence that the movie is connected to parts 1, 2, and H2O. So, if you are a true Myers fan, rent the video but don't bring out the expensive popcorn.\n\nAnd as for Busta Rhymes' performance... sadly, William Shatner's spray-painted, latex mask out-acted him in every scene!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "martinlisten-386-722024",
        "review_rating": "9",
        "review_title": "What did you think you'd get?",
        "review_detailed_main": "If you came to this movie expecting the Shawshank Redemption, you'd be thuroughly disappointed.\n\nIf you came to watch a teen-scream horror slasher, with a serial killer murdering young pretty people, you'll get exactly that.\n\nIt's not the best one in its genre, but it's solid. Better than most of the previous Halloween movies."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "JanNiggers",
        "review_rating": "6",
        "review_title": "It's an okay movie...?",
        "review_detailed_main": "I saw Halloween H20 before jumping to this movie and It was very pleasant watch for me.\n\nIt's not realy a bad movie but not great either. It's a mix bag.\n\nNow, Halloween H20 was a very boring movie where almost nothing was happening, soundtrack was poor and movie Itself felt unnecessary.\n\nThis movie on the other hand ends the whole saga of Laurie Strode and focuses on Michael Myers being a \"regular\" Slasher.\n\nThe concept of the TV show seems very weak as the contestants video quality is possibly the worst thing in this movie.\n\nBusta Rhymes is a comedy relief in this movie and he plays his role very well.\n\nThe soundtrack feels solid.\n\nThere are moments where movie feels like The Blair Witch Project which can be enjoyable but the camera QUALITY just ruins It.\n\nAgain, this movie is a mixbag."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Juniore",
        "review_rating": "4",
        "review_title": "Derivative, but better than H20",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Ace-38",
        "review_rating": "",
        "review_title": "Poor Script, Rosenthal ruin another \"Halloween\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "acidburn-10",
        "review_rating": "5",
        "review_title": "Halloween Reality TV style",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "fernandoschiavi",
        "review_rating": "3",
        "review_title": "Halloween: Resurrection is tedious from beginnng to the end and ends this second timeline with a sour taste in your mouth. Laurie didn't deserve her fate",
        "review_detailed_main": "Released in 2002, Ressurection continues the story of H20 (1998) in which we all thought it was the end of the franchise. And to be honest, if I had stopped at it, it would have been the perfect end! However, Miramax Films' greed led to an eighth film in the franchise (Seventh by Michael Myers) to be made. As a matter of fact, they wanted to make a side film (as a third, you know?). With a new story, new killer, etc. But the producer Moustapha Akkad didn't want to, because he was afraid of another failure, just as Halloween III had failed, precisely because it was a film that had nothing to do with the story of Myers. The movie's original title would be Halloween: The Homecoming (something like Return Home) and they even considered returning Danielle Harris, Jamie Lloyd of H4 and H5, for a role in the film. However, the producers wanted to ignore the story of these two, just as H20 did, and they also wanted a title that indicated that Michael was alive, to draw attention. That's how the movie turned into Resurrection.\n\nThe story of Halloween: Resurrection begins with Laurie Strode (Jamie Lee Curtis) committed to a sanatorium. She is the sister of psychopath Michael Myers (Brad Loree) and was tormented after a series of confrontations with the killer and feeling guilty for a fatal mistake. Once thinking that she had finally managed to kill her murderous brother (as suggested by the previous film in the franchise), she found that she was wrong and another innocent person ended up falling victim to her vengeful rage. Laurie is now just waiting for a new and inevitable confrontation with the serial killer, an event that is confirmed in a definitive deadly encounter between them in an interesting sequence set on the roof of the psychiatric hospital.\n\nAt the same time, in the psychopath's quiet, small hometown of Haddonfield, Illinois, a group of six young people is selected to participate in a program broadcast live over the internet with the suggestive name of Dangertainment (translated as The House of Panic). Its creator is an opportunistic businessman, Freddie Harris (Busta Rhymes), who, aided by assistant Nora Winston (Tyra Banks), expects high profitability with a reality show that consists of a group of young people spending a night at the house where the famous murderer Michael Myers he lived his childhood, coinciding with the arrival of the traditional Halloween (the famous Halloween). The archetypal group is formed by a discreet psychologist named Sara Moyer (Bianca Kajlich), by ambitious Jenna Danzig (Katee Sackhoff), who exclusively wants fame, by culinary student Rudy Grimes (Sean Patrick Thomas), author of several silly jokes, by disinterested law student Bill Woodlake (Thomas Ian Nicholas), rebellious musician Jim Morgan (Luke Kirby), and beautiful Donna Chang (Daisy McCrackin), who struggles to say clever phrases. With cameras on for an internet broadcast, the group gets to know in detail the former home of the dangerous assassin, and as evil inevitably never dies and finds its way home, Michael Myers is back and ready to clean it up, reemerging from limbo to continue its legacy of blood and horror, increasing the region's death toll, and most importantly to keep the extensive franchise in business.\n\nAlthough the track record is not very positive, it is clear that there is a kind of convention where any new film in the Friday the 13th or Halloween series, or other similar productions, has always received a barrage of unfavorable reviews that is already turning into a cliché repetitive. There are a multitude of types of horror movies, with different proposals and different themes, and all of them always have their good and bad elements. Halloween: Resurrection also has its highs and lows. The film begins by trying to correctly explain the chronology of events for those who do not know more about the fictional universe of the franchise, or for those who do not remember clearly the previous events. And it was clarified that only the original 1978 classic with its immediate 1981 sequel, plus Part 7 (Halloween H20 - Twenty Years Later, 1998), were considered in the story, excluding the other films in the series.\n\nFor starters, it is important to be clear that this new film is the true antithesis of its predecessor: there is nothing innovative, the deaths are not very inventive and every actor who appears on stage seems to be there only to die in the following minutes, without the slightest creativity. There is no effort in search of any kind of verisimilitude. The task of identifying - and rooting for - any character is virtually impossible, as there is no way to believe anything you see. So, how to be scared by what happens on the screen? And a horror film that doesn't provoke fear is certain death - in the worst sense of the expression.\n\nJamie Lee, who makes a small appearance at the beginning, must have at least been well paid - but not enough to make her come back in an eventual sequel, as the script tries to eliminate her for good. The rest of the familiar faces, like rapper Busta Rhymes and top model Tyra Banks, do exactly what you'd expect of them - that is, they play themselves - and take it all as a joke. The girl, Sara (Bianca Kajlich, who has never done anything worthy of note again after this work), knows only how to scream (with the help of the sound effects technician) and run, without showing any other minimally promising quality.\n\nThe film is short, not wasting time with unnecessary situations and quickly the viewer is invited to witness the real horror of a group of young people who are spending a night in Michael Myers' old house, being attacked by the same, who lived in the basement during the recent years and resurfaces to drive the invaders out of their refuge. For those who appreciate violence and blood, there are good scenes of deaths with young people feeling the killer's extraordinary strength and the power of his sharp blade tearing through their bodies. And there is the interesting setting of an abandoned house of damned fame, with its various rooms corroded by the devastating action of time.\n\nIn the story, participants in a television program are taken to spend the night in the house where a famous serial killer lived. What they don't know is that he's back and willing not to let anyone leave the place alive. You've already felt the cliché in the synopsis, haven't you? But that's not the only problem. Besides the absurd decision to make Jamie die at the beginning of the film. The leading role is given to a bunch of insufferable characters, played by the worst possible actors. The reality show model that, in theory, should bring apprehension considering the vision of deaths in real time does not work. On the contrary, it makes you laugh. The decision to shoot handheld was also laughable. The poor quality of the image only frustrates the viewer and never causes tension as those involved must have thought. Of course, if in a horror/suspension movie there is an inability to cause tension, apprehension and fear in the viewer, it won't work.\n\nFurthermore, Troy Hansen's production design creates some obscure and cavernous spaces for characters to circulate, ideal cubicles for Michael Myers to throw the party. These scenographic choices demonstrate spatial control of those involved, but the obviousness of the dialogues and the randomness of the murders make the narrative very predictable and tiresome. Jumpscares are also used and abused, irritating in the too much sound organization of composer Danny Lux's film. Even in moments when nothing happens (much of the film) the soundtrack remains loud, trying to cause a kind of \"suspense\" or pass some level of threat.\n\nIt is also noticed that there are undesirable easy scares, idiotic jokes, huge holes in the script, unlikely situations (the police take action only after the massacre, for example), and the unnecessary scenes of sex and drugs, which, although discreet, it is noted that they were inserted as if it were a must in every teen horror film. As well as the obvious, predictable, and mostly unsatisfactory outcome. The character played by rapper Busta Rhymes is ridiculous and almost unbearable, being a greedy creator of the macabre reality show and responsible for a series of banal phrases of attempts at humor, forcing us to root for Michael Myers to verify the quality of the sharpening of his knife in the flesh of the unfortunate.\n\nDirected by David Geddes, Halloween: Resurrection is deliberately dark in some passages and flirts a lot with the metalinguistic processes of the reality show. There are jokes about fame, nudity, some dialogue that tries to expand the film's reflexive possibilities, but the uneven direction and the script without dramatic rigidity demonstrate that the project for Michael Myers in the cyberculture era was doomed to failure. Halloween: Resurrection is tedious from beginnng to the end and ends this second timeline with a sour taste in your mouth. Laurie didn't deserve her fate, even though Curtis didn't want to be in the spotlight this time."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ADOZER200",
        "review_rating": "4",
        "review_title": "Was this really necessary?!?!?!?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Devil_Boy_80",
        "review_rating": "5",
        "review_title": "...scary...pfft...i think not.",
        "review_detailed_main": "I'll make This Review Short And Sweet The Movie starts off great falls apart in at least the first 10 minutes...boooring...almost as bad halloween 3...in fact i'd probably rather watch Halloween 3 than this.\n\nMichael Killed Laurie and then goes home and randomly kills off people in his house did he somehow forget about other remaining family members john strode, Kerri strode, Danny strode and Jamie's son Steven.\n\nThis Halloween film was not scary and i was quite disappointed\n\nIt was boring and the acting was dumb and corny...really i think they are making the series begin to go downhill i just hope Halloween: Bloodline is good.\n\nThis Halloween is my seventh favorite Halloween film"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "youthandyoungmanhood",
        "review_rating": "1",
        "review_title": "Awful, terrible and annoying",
        "review_detailed_main": "Worst film of the Halloween franchise! Any film with buster rhymes in it should not be watched."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "WillM02",
        "review_rating": "6",
        "review_title": "Nothing new....",
        "review_detailed_main": "A film like this, is a film which doesn't deserve an intensely critical review (like some of the others I've read) nor does it deserve an overwhelmingly positive one. I'm sure the cast and crew involved didn't start filming, believing they would be part of an inspirational, brilliant, award winning cinematic masterpiece. It was just for fun, and of course, carrying on the Myers legacy.\n\nNow this movie is nothing new , nothing special, nothing \"ground-breaking\" It is just your typical slasher movie. This isn't the type of movie that demands for brilliant acting , directing etc, and for me, It was just an entertaining, fun film, with some thrills and kills and a concept that kept me interested as the standard slasher madness played out.\n\nSo as long as you don't expect a revolutionary horror film (Such as the 1978 original) then you can't go wrong with this movie for a bit of late night fun with friends.\n\n6/10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Toronto85",
        "review_rating": "5",
        "review_title": "Halloween: Resurrection",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "rexdaugherty",
        "review_rating": "8",
        "review_title": "well I didn't love or hate it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "cal-music-man",
        "review_rating": "7",
        "review_title": "Whats people's problem with this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "tiernanstevenson",
        "review_rating": "1",
        "review_title": "Ruins H20's amazing ending",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "ichobodcrane",
        "review_rating": "4",
        "review_title": "Not sure what to think.....",
        "review_detailed_main": "Let it be known. I love Halloween. Ever since I saw it as a teenager I've been quite obsessive about it. The music, the mask and Donald Pleasance have never been far from my mind so rating Resurrection has been very tricky.\n\nLet it also be known that I loved 2 and even 3, hated 4, despised 5 loathed 6 and adored H20. So again this made Resurrection trickier still.\n\nI think the best way to do this is via pro's and con's.\n\nPros:\n\nLink to H20 was very well handled indeed. The mask is the best it has been since number 2. Busta Rhymes was most entertaining. Michael on the whole was very effective. (Maybe too mush emphasis was used on him studying death).\n\nCons:\n\nThe beginning was poor. Laurie Strode was too important for it end like that. I felt nothing for any of the victims. I almost felt sorry for Michael, having these idiots in my house would have driven me to murder. The end was awful. We should at least be left with the uncertainty of whether he is dead or not.\n\nSo in the scheme of things Resurrection is fifth best out of eight.\n\nThat boiler suit must be stinking by now!!!"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "buckleym-1",
        "review_rating": "3",
        "review_title": "Same old routine",
        "review_detailed_main": "Okay, you knew it was coming, I knew it was coming, everyone knew it was coming. Michael Myers is back (and I don't mean the \"Austin Powers\" star). He is back home again, killing teenagers in the eighth Halloween film, \"Halloween: Resurrection\". Anyone who saw the seventh one, \"Halloween: H20\", might remember that Myers supposedly had his head cut off by his grown-up sister Laurie (Jamie Lee Curtis) at the end of the film. But since, this is the eighth film, the writers conjured up a way to have Myers slicing his way through yet another picture.\n\nSurprisingly enough the director Rick Rosenthal (\"Halloween II\") and the screenwriters do create a fairly effective show down early on between Michael and sister, Laurie, who has been put in a mental hospital. After the opening few minutes though, the film becomes a mixture of the cliche and predictable. The plot revolves around having six teenagers spend a night over in the old Myers home as part of an online publicity stunt for a website. And surprise, surprise... Michael Myers is home.\n\nThe one trait \"Halloween: Resurrection\" lacks is tension, an obvious key ingredient to so many horror or suspense flicks. What made the first \"Halloween\" by John Carpenter so effective was a mood of genuine terror and tension based upon the unknown. Myers (in that film)appeared, then disappeared, he was basically a ghost and you waited and wonder when he would pop out of the darkness. This film as with virtually all slasher films now, possess none of that terror. Each killing in \"Halloween: Resurrection\" is telegraphed way ahead of time. So either Myers can stare at his victim for hours before he kills them or there will be a small meaningless chase before Myers shows his knife cutting abilities.\n\nThe film has a few other low points, especially in the plot. No one seems to notice the cameraman go missing for hours after being killed and despite a loud scream not a sole hears Bill (Thomas Ian Nicholas) meet his doom either. Although, this doesn't matter too much, since plausibility and the slasher film just don't go together. Then, there is rapper Busta Rhymes. I didn't know whether to laugh or cringe at some of the dialogue he spoke, which was just plain awful and silly at the same time.\n\nThe interesting aspect of this series as a whole, is how little things have changed in terms of the basics of the plot. Sure, some minor details are fixed. The teenagers in \"Halloween: Resurrection\" play on computers and e-mail rather than riding around in cars. There's even a mention of the TV show, \"The Osbournes\" in this movie. Despite the updating in visual and verbal references, little of substance has been added since the original. Michael Myers is still that unkillable boogeyman, and there are still teenagers waiting to be butchered. At least until movie executives stop seeing dollar signs next to the word, \"Halloween\". A 3 out of 10."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "geekofcinema",
        "review_rating": "2",
        "review_title": "The opening and the ending were the best scenes the rest is the worstttttttttttttttt!!!!!!!!!!!!!!!",
        "review_detailed_main": "The opening I loved it because it was continued of Halloween H20 Twenty Years Old and the ending it was also good because finally the movie ends. This movie is one of the worst movies I have seen in my life and the worst movie of the franchise."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "warrenk-14011",
        "review_rating": "4",
        "review_title": "One of the worst",
        "review_detailed_main": "Although this is still a bit better than parts 5 and 6, this is still a flat and uneven entry in the series that is dragged even further down by annoying characters and a ridiculous plus unnecessary story."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "coflorida",
        "review_rating": "2",
        "review_title": "Pure crap",
        "review_detailed_main": "Michael Myers was never cheesy cartoonish character.\n\nwith Chucky and Freddy Krueger one expects a few cheesy laughs here and there. Michael's flicks was serious and all about the kills. Couldn't take this crap seriously seem more like a spoof. and I won't even get started on Busta rhymes"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Screenwhisperer",
        "review_rating": "",
        "review_title": "Not as Bad as Everyone Makes it Out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "brooksy241095",
        "review_rating": "6",
        "review_title": "Not as bad as I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "chrisjakubowski",
        "review_rating": "4",
        "review_title": "Jeeeeeeeeeeez",
        "review_detailed_main": "Well... I pretty sure that I watched this as a kid, but can remember. And that's the biggest problem in the movie. The story is so horrendous, so boring and half assed, that you just tend to forget it afterwards. Nothing matters in this movie. It's just a cluster of scenes in between Michael slashing everybody in sight. The opening scene shows Jamie Lee Curtis locked up in a mental hospital. She's sitting there with a blank and terrified expression on her face and tears are coming down her cheeks. They must've found a footage of the actress right after reading the script and realising that she's contractually bound to star in this pile of crap. She checked out pretty quickly and so does the viewer. I doesn't get any better. We all know what the franchise should be about. This isn't it. This is a bad movie but a terrible Halloween movie"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "laslowhite",
        "review_rating": "7",
        "review_title": "A worthwhile sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "The-Lobstrocity",
        "review_rating": "1",
        "review_title": "Pure, Unadulterated, Comedic Gold",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "otley-19698",
        "review_rating": "1",
        "review_title": "Pointless garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "gamadae",
        "review_rating": "5",
        "review_title": "Another step down",
        "review_detailed_main": "It's a shame that when the series (once again) gets a quality entry and builds up a lot of hype, the next installment comes in a destroys everything. If only the producers would learn from their mistakes."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "drownsoda90",
        "review_rating": "5",
        "review_title": "Silly but still viably entertaining",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "shawny11_2001",
        "review_rating": "",
        "review_title": "Wow...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "marccfantozzi",
        "review_rating": "5",
        "review_title": "Has a few things I liked. But could have been so much better.",
        "review_detailed_main": "Halloween: Resurrection is not a great Halloween film but has a few qualities. The score/sound design is excellent. I loved how the film makers built the Myers house as a set and made it look like the original house. The opening with Laurie didn't make much sense, but I found it enjoyable and it is, by far, the best part of the movie. Michael and his mask were a big improvement over H2O as were the death sequences. I liked that it took place in Haddonfeild. Also the budget and production values were good also.\n\nBut that's about it for the film's qualities. Now for the bad...\n\nHated Busta Rhymes' acting and character. The webcam plot wasn't that good. I would have much preferred Michael going after Laurie's son John and the characters weren't very likable or developed enough (including the main character Sara).\n\nI do enjoy the film a little but it could have been so much better."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "rezahafez",
        "review_rating": "4",
        "review_title": "could have been better",
        "review_detailed_main": "It's really hard to catch any Halloween movie here.I'm lucky cause i get to see 6 out of 8 of the Halloween series.The first was the best and the only sequel that i love is the second one.The others are okay.The latest Halloween by me was just okay,not that good and not that bad.It was entertaining though.I got two complains here 1)the actors here all suck....with the exception of Michael and Jamie Lee Curtis...apart from that i don't see anyone i like...even the heroine..i totally hate her..her deliverance was so fake and the others are unnotable..sure Tyra banks is a hottie but that's it! 2)Let's just say that the fist 20 minutes or so was so a big mistake(people that already see it will understand) I won't spoil anything.But there are some good things in this Halloween like Michael..he was the most spooky Michael i have ever seen and a bit smarter.And the way he kills people was cool,much better than H20.Oh and i love the setting.All in all i would say this Halloween was entertaining so 5/10 i give u...good effort"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jeffhardy1",
        "review_rating": "6",
        "review_title": "Mildly entertaining",
        "review_detailed_main": "For whatever reason, I'm a big fan of the Halloween series so my review may be slightly biased. Then again, who else but a fan would have seen the film or be curious enough to read reviews of it?\n\nThe first Halloween was brilliant. Definately one of the best horror movies ever and a very entertaining and creepy movie. I guess it hooked me for the rest but one of the cool things about Michael Myers is the fact that he is fairly \"real\" for a slasher movie. He is strong and hard to kill but human and he has an M.O. He wants to kill his family and anyone in his way.\n\nAnd that's my biggest problem with this sequel. He's hunting people that are doing an internet show from the house he grew up in (yeah, that'd be real popular - the sad fact is most people don't have broadband connections at home, so why not just make it a tv show? Not a big deal though). There are several instances in the series where Michael ignored people who aren't in his way so this seemed fairly gratuitous. Also, the six kids who are doing the show are just plain boring. Not likeable, not annoying, just THERE. The kills are what you expect out of a horror movie - brutal. Not many \"false scares\" of people bumping into each other fortunately. Still, the kills aren't very inventive. There is nothing here you haven't seen before.\n\nI personally was a little annoyed that it ignored Halloween 4-6. H20 didn't refer to those but it also didn't contradict them. This one has two or three small references that infer that 4-6 never occurred.\n\nAnyway, this one's totally a filler. Nothing significant is added to the mythology in any way. It's just a guy killing people for no real reason. Decent acting and directing, just... no real reason for any of it. I give it a generous 6 out of 10."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "brandonsmuxx",
        "review_rating": "5",
        "review_title": "Could have been great as a Found Footage film",
        "review_detailed_main": "Take out the stupid game show aspect. This takes out Tyra Banks and, more importantly, Busta Rhymes..the single worst character in Halloween history. Instead, have the group film (or even do a live webcast) of them exploring the house. Seeing Michael in the background and lurking in the shadows through a found footage view would have been pretty cool. It's almost like they had that idea then decided they needed some 'star power'. Enter the game show aspect. The idea of inserting humor is good. The idea of inserting horribly unfunny, cringe-worthy, humor is not so good. Also, the Busta Rhymes scene (we all know the one), genuinely made me feel like the franchise died at that moment. It got even worse when Rob Zombie did his best to white trash it up. Thankfully, I think we're on the right path now."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "horrorules",
        "review_rating": "8",
        "review_title": "not perfect, but a masterpiece when compared to Ends.",
        "review_detailed_main": "Ok, let's face it, Resurrection is a stupid movie, it ruins, in part, the beautiful ending of the GREAT Halloween H20, Busta Rhymes is terrible, but it's a damn funny movie, with all its flaws, but it's funny.\n\nThe characters of the boys are hateful and you can't wait for Michael to slaughter them one by one, the claustrophobic setting is interesting, as is the idea that Michael, this time, does not hunt down any of his family, but simply, it protects its territory, some murders are well done, but above all in this film Michael is there, he is present and he is the threat, unlike that pile of garbage that is Halloween Ends, Resurrection does not insult the figure of Michael , he's still the threat, he's dangerous, he's the villain of the film, here there isn't an idiot kid who takes his place after having shattered our balls with his personal problems and with the ridiculous and repulsive love story.\n\nSo say what you will about Resurrection, but it is an objective fact that it is a masterpiece compared to the abomination that Green recently made with Ends."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "cgw-3",
        "review_rating": "7",
        "review_title": "Not a bad movie, although not great either. Just in-between",
        "review_detailed_main": "Michael Myers is back, and you thought he was gone for good! In this eighth installment of the famous `Halloween' series, thought to have died three years after Laurie Strode `assumed' that she hacked her brother's head (we learn from flashbacks that she killed an innocent paramedic), Michael Myers returns to where the killings all started---home. Six teenagers have won a contest, sponsored by Dangertainment, where they must spend Halloween night inside the Myers' residence. They are unaware that the ultimate evil lurks in the house. It is wonderful to hear the theme song, or variations of the John Carpenter theme made popular in 1978, and its always a treat to see Jamie Lee Curtis on the big screen, once again playing Laurie Strode, whose role in this is reduced to nothing but a cameo. Better than your usual slasher flick, one might think, but this is not the best movie or worst movie of the year. Ending leaves door wipe open for `Halloween 9: How Long Will Michael Myers Kill These Innocent People Before He Gets Tired And Gives Up, He's Basically In His 40s By Now.'\n\nOK, maybe that's that the APPROPRIATE subtitle. Speaking of subtitles, they should've stuck with `Halloween: Homecoming'. One reason why they got dinged of the three-star category.\n\nStars: 2.5 out of 4 (Grade: B-) Grade on IMDb: 7.5 out of 10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "tomasjbartha",
        "review_rating": "3",
        "review_title": "Stupid ass movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "pedrobelotecruz",
        "review_rating": "1",
        "review_title": "What?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "happytown79",
        "review_rating": "5",
        "review_title": "New gimmicks breathe life into an old franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Quincey_P_Morris",
        "review_rating": "5",
        "review_title": "Disloyal",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "joshnkentucky",
        "review_rating": "4",
        "review_title": "There needs to be a Remake of this Film",
        "review_detailed_main": "I did not like that Laurie strode had to be killed in Halloween ResuRRedtion after being the main character i think that when this film was made they should have not killed her instead keep her in the whole movie this movie really reminded me a lot of Halloween 6 and how Jamie loyd from H4 and H5 was killed it really did not fit at all it needed to be Redone just like Halloween 6 Needed to be Redone they both were the not so good Films in all of the Halloween series if it were to be Remade it would need to have Jamie lee cuRtis in it before it would Really be a Fantastic film to me Really i thought of how they killed Jamie loyd from Halloween 6 and introduced Brand New characters why would they do this to a Really horrific horror film series why should they mess with it when it already a good series to view on video and DVD for the first time..................."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "absolutetravist",
        "review_rating": "",
        "review_title": "With Almighty Irony Comes the Death of Halloween",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "eric20other2002",
        "review_rating": "7",
        "review_title": "WELCOME BACK RICK ROSENTHAL....",
        "review_detailed_main": "I saw H: Resurrection on its premiere day and was very excited. It was also the last time Jamie Lee Curtis would be in Halloween flick, so I wanted to see her in her movie theatre glory. Like the ad says \"Evil Come Home\" it sure does as Michael slices his way through more unsuspecting trick or treaters. In fact he borrows a type of death from Jason Voorhees kill book. If you get a chance see this film right away. 5 out of 5 stars."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "guse23",
        "review_rating": "5",
        "review_title": "Well, it had some good parts",
        "review_detailed_main": "The beginning starts with a way too easy way of bringing Michael back, showing a lack of effort. It then concludes with a not bad death scene. Now with this type of beginning you expect something big. You hope to see Michael continue on as he always does to rid the world of his blood line. Does that happen? No. Instead he stalks and murders a group of college students who represent a modern version of both the Breakfast Club and the original Halloween cast. The whole movie has no point and seems to completely give up within the last half hour of the movie. Not too different from Jason X (but not as bad). The lead is likable but they write her as if she has some hidden dark past. As if maybe she's met Michael before or possibly had something traumatic happen to her. But of course nothing comes of it. Now Michael is less PG - 13 returning to his bloody roots as is previous movies (head crushing, head stabbing, etc.) Unfortunately the writer didn't fully understand how to write the character of Myers and ruins it. The movie also continues to ignore pt 4 - 6 but making it more noticeable this time. On the ups the movie is nicely directed and has a good scene of suspense, dealing with the main character and her on-line chum. Letter grade: C + at best."
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "Mr_Horror84",
        "review_rating": "10",
        "review_title": "Good Movie or Huge Flop? Definitely a good movie!(SPOILERS)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "jjpurwitsky",
        "review_rating": "6",
        "review_title": "The Halloween Saga: Halloween - Resurrection",
        "review_detailed_main": "Halloween H20: 20 Years Later ended up being the best of the sequels in the Halloween saga. Around the release of H20, the horror industry was in an interesting time. Scream had reinvigorated the slasher (and horror in general) film at the box office. Horror movies were making money and doing well and being talked about. But unlike the original era of slasher films, where they dominated the box office for over a decade, the slasher as king didn't last nearly as long.\n\nIn 1999, one movie came out that reshaped the face of horror. And like the original Halloween in 1978, it was a low budget independent film that went on to break box office records. This movie was The Blair Witch Project and it scared audiences to the tune of $140,000,000, an unheard of number for the type of film it was.\n\nBlair Witch was a found footage, faux documentary horror film. The camera was hand held and shaky and was controlled by the characters in the film. It was shot on film and video and it had a simple story. And like 1978's Halloween, it had no gore, no special effects, a simple story and about an hour and a half of sheer terror.\n\nThat's not to say the slasher film didn't play it's part at the movies. A new Friday the 13th (although now they were 'Jason' movies) film was released, a third Scream came out and a new original slasher style film came out called Final Destination. Horror was doing well and on July 12th, 2002 Halloween returned to the big screen.\n\nHalloween: Resurrection follows the continuing story of H20, and like that film it ignores parts four to six. It turns out that Laurie had chopped off the wrong person's head, not Michael's. Technically this doesn't make sense based on the behaviour of the man behind the mask in the last 10 minutes of H20, but as a Halloween fan, sitting in the audience, one can let it go.\n\nResurrection goes on to wrap up the story of Michael and his sister and introduces a new story line. Michael returns home to Haddonfield, to his house and finds a reality game show being filmed there. Hence he has to knock off the people in his house, one by one and in increasingly gruesome ways. The reality game show allows for Resurrection to throw in a bit of a Blair Witch influence. Each character in the house gets their own camera and thus the view switches back and forth between shaky, video style footage and nicely framed, smooth film footage.\n\nThis makes for an interesting idea, and some cool scenes with Michael making his way through the halls and not being noticed by anyone except the audience, but overall Resurrection fails as a movie. First and foremost it fails because it is not scary. Myers himself works pretty well, he seems looming and scary, he walks the right way and he has the creepy head tilt, but once again he no longer looms in the background for very long. He's always clearly visible and ready to strike. Technically, for Resurrection's given story, this makes sense, but it doesn't work for the scare factor.\n\nLike Halloween II, this film is directed by Rick Rosenthal. When he made part two he had taken Michael Myers and made him less of a realistic monster. He made the second Halloween a film filled with jump scares and didn't capture the tension that the original did. And following H20, he does the same thing here.\n\nBut it isn't only the lack of terror that makes Resurrection ultimately fail. The story is plain and generic (although the first 10 minutes with Jamie Leigh Curtis are pretty good) and the dialogue is pretty poor. Most of the actual dialogue sounds fake and expositional, where the characters instead of sounding like they are talking to each other end up having conversations that spell out the story for the audience.\n\nThe acting for the most part is okay. The acting by the staff at the hospital is sub par but all the leads do a pretty decent job. Although his performance isn't bad, Busta Rhymes does end up sinking the movie some what. His character says some really stupid things and in one scene he does some really cheesy and out of place kung fu poses and noises before he drop kicks Michael Myers. What was Rosenthal thinking when he included that?\n\nAnother really strange omission is a wide shot of the Myer's house. Although it sounds small, a wide shot to show the outside of the house would of helped the atmosphere of the film in many ways. For example, seeing the Myer's house in a wide shot, establishing to the audience that they were back to where it all began could of built up tension, but for some inexplicable reason, all the audience ever gets is interior shots and quick close ups of various outside features.\n\nThe film is rather well shot, with great choreography and editing, especially when you take into account that in addition to the film cameras, there were the six or seven video cameras that were used throughout the film. So the film does flow nicely and never really leaves the audience bored. But when all is said and done, and the end credits start to roll, especially after H20, Halloween: Resurrection sadly end ups leaving one with a strong and overbearing feeling of disappointment.\n\nFilm Rating: 64%\n\nBreakdown (How Halloween: Resurrection scored 64%):\n\nProduction Design: 7 out of 10 Cinematography: 7 out of 10 Re-playability: 6 out of 10 Originality: 6 out of 10 Costumes: 7 out of 10 Directing: 6 out of 10 Editing: 7 out of 10 Acting: 7 out of 10 Music: 7 out of 10 Script: 4 out of 10"
    },
    {
        "movie_id": "tt0220506",
        "movie_name": "Halloween: Resurrection",
        "movie_rating": "3.9",
        "review_username": "capelladewdrop",
        "review_rating": "4",
        "review_title": "Unoriginal, and not in the style of the prequels",
        "review_detailed_main": "This movie was released in 2003, trust them to take a good franchise and make some reality show style garbage as a squeal! Halloween was a classic, this is just like any other Big Brother style horror that was going around in the early 2000s. Had none of the atmosphere of the prequels, Myers himself didn't even seem that scary! The only thing I was glad about in this movie was that Myers wasn't finally killed off by this band of idiots. They tried to kid us at the end though he died in a fire. We've already seen that and it DOESN'T work, so why try to fool the viewer? If you like the early Halloween movies, I do not recommend this as you will be really disappointed. It might scare the tweens of today, but going by other reviews you can tell it is hated by Halloween fans."
    }
]