[
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "mateusmat",
        "review_rating": "1",
        "review_title": "As real as Santa Claus",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "Nightdk",
        "review_rating": "1",
        "review_title": "A thief who uses religion as a weapon to steal from the poor now tries to look good by paying for a movie about himself",
        "review_detailed_main": "The film is not very well produced. it is in the level of the many brazillian Novelas that are mass produced to air every day for months. The story is clearly fake, with hints at supernatural events and the attempt to make the one who paid for it a good person; It hides the facts regarding the way he got rich, by taking people's homes, salary and goods by making promises of riches and blessings. An imoral movie about an imoral person trying to wash away the well documented facts about his rise to power."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "victorasoares",
        "review_rating": "1",
        "review_title": "I think...",
        "review_detailed_main": "While I was watching the movie I only thought it was better to see Pele's film"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "rodlm777-441-234219",
        "review_rating": "1",
        "review_title": "Awful Propaganda Piece - A Terrifying Demonstration Of What Money Can Buy",
        "review_detailed_main": "It's sad to see the art of cinema used for propaganda purposes. Of course it's not the first time, and it won't be the last.\n\nObjectively speaking, this is not a good movie. It lacks quality in all forms of the production: bad direction, barely acceptable acting and photography.\n\nThe script is also lacking, but that's almost forgivable when you realize this is propaganda movie.\n\nSo why this movie has such good ratings?\n\nThis is a propaganda movie, made by a well known church in Brazil. It's a huge, extremely wealthy group, and they have the ability to pull this off. Their intention is, I believe, to both please the ego of their leader, Edir Macedo, and serve as a recruiting tool, to gather more members.\n\nThey, most likely, have thousands of members coming here and writing fake reviews, with text clearly translated using Google Translator or similar services.\n\nAnd I think they will keep coming.\n\nI urge you look into this Church, and why it's so concerning to have this movie here, getting this kind of attention."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "eleudejr",
        "review_rating": "1",
        "review_title": "Fake biography of a religious extremist",
        "review_detailed_main": "Misdirected film, scenery with weak setting, tiring narrative, forced acting and false story. An attempt to create a martyr in the figure of a religious who manipulates people."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "brunojp-99667",
        "review_rating": "2",
        "review_title": "Boring",
        "review_detailed_main": "It's a boring movie. It's not a biographical movie, most scenes do not reflect the reality of Edir Macedo. A movie full of religious cliche. Watch in case of insomnia."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "janeri-06354",
        "review_rating": "1",
        "review_title": "Not very good",
        "review_detailed_main": "Not very good movie, a lot of errors, I really lost my time seeing it."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "fabiolimafsl",
        "review_rating": "1",
        "review_title": "bad movie and fake success",
        "review_detailed_main": "I watch this movie and i can say the people are manipulated for high rating, bad movie, actors and theme."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "rogeriodutrasoares",
        "review_rating": "3",
        "review_title": "Portrays the growth of religion in Brazil from large investments",
        "review_detailed_main": "Unfortunately the film portrays a very bad reality. Unfortunately it was made with money from church donations to spread the gospel in Brazil."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "hmello-49062",
        "review_rating": "1",
        "review_title": "It is pure fiction",
        "review_detailed_main": "Edir Macedo is not a hero like its shown in the film. He's nothing but a corrupt, charlatan and criminal."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "ivonne_mijangos",
        "review_rating": "10",
        "review_title": "It's gonna EXLODE!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "cmartinsaraujo-09668",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "Watching this movie is the worst thing you can do to spend your time on. Full of fanaticism, zealotry and partiality. It only reflects how blind faith and dogmatism can be dangerous and manipulative. Other than that, this movie does not show a biography of someone whose life is blameless, it is more like a brainwashing attempt to cover up a very dubious past."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "mageh",
        "review_rating": "1",
        "review_title": "Propaganda and pure trash",
        "review_detailed_main": "How man of god produces this propaganda movie and pays for it is beyond evil. I hope there is hell, karma since using faith for greed is awfully wrong. I am not even religious person. As for movie itself, just trash, not even mildly entertaining."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "Freethinker_Atheist",
        "review_rating": "1",
        "review_title": "Exploitation of the poor",
        "review_detailed_main": "This is not an independent movie. It is about a Brazilian church owner, but financed by himself (with the money of church goers) to show him in a positive light, while in reality he got billionaire (he is the richest pastor in the world) by exploiting the faith of the poor.\n\nAvoid."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "renanrdesouza",
        "review_rating": "1",
        "review_title": "A martyr?",
        "review_detailed_main": "For the people who know the real story, it's pretty clear they try to pass Edir as some sort of hero, a martyr, That alone makes you want to stop watching the movie less than halfway through it. So do yourself a favor, and don't even start, unless you want to see this as pure fiction and not try to compare it to the real history."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "iboso64",
        "review_rating": "1",
        "review_title": "Garbage propaganda. God should sue.",
        "review_detailed_main": "An absolutely craptacular \"movie.\" I really need to look more closely at the IMDB reviews and not just the overall rating. Self-financed propaganda by a charlatan fleecing the religious minded in Brazil (and elsewhere, apparently). Badly written, directed, acted and whatever else you can be bad at in a movie. The lead looks like a cliche of a pedophile and has zero charisma, even when preaching. Do you want to see a good faith-based movie? Check out \"I Can Only Imagine.\" That movie proves faith-based doesn't have to be synonymous with garbage. Avoid this AND the sequel teased in the Avengers-style stinger at the end of the movie."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "jlalves-35616",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": "This guy is a billionaire, while his faithful often have no money to eat. He built a church that looks more like a mansion. Horrible movie, where the guy's type is masked. Do not watch and use your time to research the fame of Edir Macedo in Brazil."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "cic-41363",
        "review_rating": "1",
        "review_title": "Bad direction and biased storyline",
        "review_detailed_main": "Highly biased story as the main character is the owner of the main sponsor and production company. Not a biopic but an auto-biopic in the end. Also, bad direction that feels very old style and doesn't help much the viewer that doesn't already know the character."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "igornveiga",
        "review_rating": "1",
        "review_title": "meme",
        "review_detailed_main": "This movie being rated 10/10 and being removed by imdb itself as a fraud is really a meme. As a movie lover, it's practically a crime for a movie like this to have been ahead (even for a few days) of movies like The Godfather, The Shawshank Redemption and other classics. Due to this masterpiece imdb has updated its policies. As a Brazilian, I am sad that people have used the platform as a form of fake promotion of an obviously bad product."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "uckgsam",
        "review_rating": "10",
        "review_title": "An uplifting movie about believing in your dreams",
        "review_detailed_main": "After watching the movie, I can easily say that I did find it uplifting. Setting aside the fact at it does deal with religion, what caught my attention was the courage this man had to go out and do what he wanted, to preach!!! It may sound like something so minute, so plain, yet I saw courage to face one's own fears and backlash of others. As I watched, I did not expect any exaggerated effects or extravagant details. Rather, real-life experiences that explain why the bishop and his church has been able to spread into so many parts of the world. With that said, what I came away with is that no matter what, I cannot let others define who I am or stop believing in my dreams, That is why I state that it is an inspiring film!!!"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "marcosaapaulino",
        "review_rating": "1",
        "review_title": "Intolerance against all other forms of religion",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "jfg-98138",
        "review_rating": "4",
        "review_title": "Disappointed!",
        "review_detailed_main": "After reading some of the bad reviews on this movie, I can see why some think it's trash and not true. Honestly, the movie is not bad for Brazilian standards which is why I gave a generous 4 stars. It was nteresting to see how Macedo's life story would play out in the big screen. The setting and cinematography is decent in quality but I found it comedic that most of the character's who I knew personally portrayed in the movie, looked nothing like them in real life except for the actor playing Macedo who shows a good resemblance. I knew Macedo and his family personally from the early years of his church back in 1978. I was disappointed that my family was not mentioned in the movie because we sponsored them to begin his church mission in the U.S. in the early 80's and came to live with us in NY for a period of time. The movie ends with him and Ester in NY with no context of how they got there. If there's a sequel coming, it will be interesting to see how the plot turns out but don't expect a miracle LOL!!! The guy from his humble beginnings and life challenges, definitely dreamed of gaining power and fortune all in the name of the Gospel!"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "imdb-97141",
        "review_rating": "1",
        "review_title": "Review from a Christian",
        "review_detailed_main": "As a Christian who truly knows the Lord, I found this film truly appalling because it is not a proper account of events.\n\nThe attempt to portray authentic Christian behaviour has failed miserably. I would normally stay right away from any person, calling themselves a Christian, who behaved in any way like the hero of this film. Unfortunately he comes across as a deluded nut, a religious zealot, someone one would expect to be repulsive to saint and sinner alike, and who does not appear to know very much about how to care for his wife.\n\nIf I met a person like this I would immediately know that there was, before me, a person with very deep need. He speaks of wanting to save the world. Many people have been seized with a desire to save the world, but history books show us that God always deals very deeply with people he calls, the work of grace in the soul of man takes time, and unfortunately the film fails to portray the passing of very much time at all, or any Godly discipline to speak of in the life of this man.\n\nI would not recommend this film for the purposes of education or relaxation because it is so non-realistic as to be laughable."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "borgolarici",
        "review_rating": "5",
        "review_title": "Fake vibes",
        "review_detailed_main": "I had never heard about this guy before the movie and this movie certainly didn't help me: it looks fake and the actor that plays him reminds of Ted Bundy. A nice story but probably not super realistic"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "amntlvo",
        "review_rating": "10",
        "review_title": "What's with the criticism?",
        "review_detailed_main": "I read diverse reviews on here, but overall if you watch the movie with no prejudice, regardless if you like Edir Macedo or not, you will see it's a great movie. It shows the reality of man who wasn't believed in, was put down, bullied since he was a child (the reality of many) and as an adult the struggles increased, but he prevailed against all odds due to his faith in God.\n\nThe acting is good, the cinematography is excellent, they did a great job with the looks of the movie as a whole, the antique cars, clothing etc.\n\nI didn't see any part of the movie promoting religion, it was quite the contrary, it's against religion and promotes only having a sincere faith towards God as your drive.\n\nI recommend it. I left the movie theatre inspired and motivated to take the right decisions in my life."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "joseburgos-61884",
        "review_rating": "9",
        "review_title": "Honestly Good Movie",
        "review_detailed_main": "This movie IS NOT a propaganda or drama movie to try and make Edir Macedo look good but instead its a movie based on his personal life experiences from early age to adulthood. It shows the hardships he has gone through in his life and a fine adaptation to the books Nothing to Lose.\n\nThe actors show great interpretation of characters as well as good execution of emotions. Cinematography is good and the plot is consistent with the book. Again this isnt a movie based on the history of a country or a drama trying to show a man as a holy person. Instead its the life story of a man who faced many difficulties, and still does, but through his faith and perseverance has overcome them all.\n\nOverall a good movie. Highly recommend to watch it with an open mind and ignore its bad comments."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "rany_x",
        "review_rating": "10",
        "review_title": "Regardless of the criticism, it is a wonderful film.",
        "review_detailed_main": "If you like or don't like Edir Macedo, it doesn't prevent the movie from being wonderful. The plot, the history, the motivation and the teachings, are lessons of life and a revolution in the national cinema. Contrary to criticism I read in the media, the movie doesn't try to create a saint, quite the contrary, the movie show us his failures. (I don't think they even know the definition of saint, to start this conversation) But it's a movie that teaches us to be persistent people and not give up, because in fact, we have nothing to lose by wanting to help other people and dedicate our lives for this. He is a man of faith, independent what ever people of this influential society like it or not. What I \"admire\" is a society that complains about a TV station that commands a country, see the story of a person who was a victim of them and still think it is a lie. So if you want to choose to go on with your blindfold, it's up to you."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "israeldinizdg",
        "review_rating": "9",
        "review_title": "Film with an engaging and inspiring story.",
        "review_detailed_main": "Film with a beautiful story of overcoming, bullying, social prejudice and political-religious.\n\nIn my view, the few negative critics come from people who have hardly noticed the wonderful commitment of research, photography and acting of the actors.\n\nBrazilian production has shown an evolution and insistence on quality worthy of note and recognition."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "leandrolourencio",
        "review_rating": "10",
        "review_title": "Best Movie - Do not let yourself be led by prejudice.",
        "review_detailed_main": "The film is real and transparent with its protagonist. Hold attention from start to finish. A movie for the whole family without focusing on religion, but that ends up showing what it can become: a scenario of war, where one wants to erase the success of the other. Edir Macedo is not a man who wants to be perfect, is a figure who seeks to fulfill his calling and has to fight against those who do not want his victory. With his flaws and often gross tone he does not give up on reaching his goal and this makes the film clear. Impeccable scenery, a little compromised edition due to the size of the story told in just two hours, actors super well on the scene with their characters and a script with background on the history of Brazil and a people, who is often persecuted due to his faith, the film fulfills the mission of showing the side of the story that many did not know. Obviously many will judge without having seen the film just for the superfluous knowledge they get in the Brazilian media. Worth checking out, understanding, and enjoying the movie!"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "jllsinclair",
        "review_rating": "10",
        "review_title": "... and everything to gain",
        "review_detailed_main": "Ok you can see it as propaganda but isnt every angle propaganda. I totally admire him for using the media to counteract other propaganda and tell his story.\n\nA bit sickly sweet in parts for my taste and his wife never seems to take an active tole in anything. But a really good story based on his life and what he was doing.\n\nHe and his church were persecuted because they were too popular. Popular for the powers that be can mean too much power, 'corrupt', 'exploitative'. People must be saved from the saver of souls. Those in power are threatened by people who pull big crowds. Influencing without their control, especially when people are giving then money.\n\nAlthough the money is invested in more churches and the ministry as well as himself and family.\n\nNot sure about the role of Carlos. Is he family? Why is he so ambivalent? He seemed to be in charge of media yet didnt seem totally for them and used footage against them.\n\nWas the church roof collapsing an accident?\n\nBrilliant he was not scared out of action and the way he also used the media in the service of god - if you believe in his uncorruptable faith which I do - especially seeing the real Edir afterwards. He was not afraid to go big and bigger and - why not? After all Jesus had twelve disciples but said to them that after his death 'you will do much more than I have done'. In the age of mass media you dont have to stick to 12.\n\nIt is really good to see a series about faith not just more rape, killing, violence etc that we are served up daily and nightly. We are so used to the usual exploitation in our fictionalised viewing we cant see it for what it is."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "nvunge",
        "review_rating": "10",
        "review_title": "Amazing movie !!",
        "review_detailed_main": "A filme that deals with so many issues that all of us human being go through and how we can all overcome all if we believe in God and in ourselves."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "DavidVN82DF",
        "review_rating": "10",
        "review_title": "Incredible!!",
        "review_detailed_main": "Very good movie!! Incredible!! It shows that even if you are criticized, mocked, rejected, excluded, but choose to serve God and trust in Him with all your heart, God will never set you aside because it is His name that will be glorified."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "bfsdantas-05868",
        "review_rating": "10",
        "review_title": "A film about faith and never giving up.",
        "review_detailed_main": "What to do when everything is against you? This movie shows the answer. A must see for all believers."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "barajasalma",
        "review_rating": "10",
        "review_title": "I know I am going to love it!❤👍",
        "review_detailed_main": "I saw the first 🎥 Nothing to loose! It was a great experience. I can wait to see the 2nd part😏❤"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "delfim-90768",
        "review_rating": "10",
        "review_title": "Great movie :)",
        "review_detailed_main": "Inspirational movie and it's amazing to see BP Edir's life and story unfold. With all the odds against him, he was able to come out on top. Really enoyed it (helped that I could also watch it in the original language as I understand Portuguese haha).\n\nHighly recommended!"
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "mendozaarosa",
        "review_rating": "10",
        "review_title": "Spontaneous movie",
        "review_detailed_main": "It was a speechless movie to watch. It's starts out with the main character being a different kid. Have you been that different kid that stood out in your childhood? Than it goes on for him finding his real purpose in life. He becomes a recognizable leader that even made the catholic leader of Brazil a little shakey."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "xavviv",
        "review_rating": "10",
        "review_title": "Must Watch For Christians!",
        "review_detailed_main": "A very well made movie, for all those who rated negative review of 1 star please watch it all over again, this movie has the best direction, screenplay, cinematograph of the way they've featured the 70s, 80s culture, attires, cars, houses and churches. Moreover the actors have done a fantastic job especially the lead protagonist Edir Macedo, the eagerness and willingness to preach the gospel really made me think about my life.\n\nThis movie will change many lives for sure. There are many new age beliefs in this world which show the pathway for prosperity, greed and luxuries but the end result is eventually we all bend our knees to the Creator and His Son Jesus when things don't work out. And that's exactly what's been portrayed in the movie ..we need to leave all our cares and worries unto to Him.\n\nThe best scene in the movie was when Pastor Edir casts out the demon from one of the character been possessed by evil spirit, which happen in split of a second by using the name of Jesus, unlike movies like The Exorcist and other horror movies which gives so much emphasis to the undying evils but not the word.\n\nI'm not sure if Edir Macedo was a true religious figure who has saved many souls or conned the poor I never heard of him before..but one thing I know for sure this movie has touched my heart.\n\nWill surely watch the sequel with high expectations..."
    },
    {
        "movie_id": "tt6910020",
        "movie_name": "Nothing to Lose",
        "movie_rating": "2.4",
        "review_username": "andrewanm",
        "review_rating": "10",
        "review_title": "I know he is a liar but",
        "review_detailed_main": "I know how this guy has throughout his lifetime twisted the bible and the new testament message. There is nothing about money in the NT, nor about God almighty wanting our money. There is a massive contrast between 1st century non Catholic Church which Jesus left on earth, and this man's religious movement fuelled by money, politics and deception.\n\nOh, by the way, Jesus does not want temples let alone to have his own TV channel!\n\nBut the whole video looked like a genuine and very radical conversion, maybe he was this genuine but after $$$ made him lose his way. So 10* if this really happened to him, persecuted for righteousness sake by the feds, and world mafia, prise God."
    }
]