[
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "laxplaya226",
        "review_rating": "4",
        "review_title": "GARBAGE",
        "review_detailed_main": "Waste of time & money. Stay home and watch Talladega Nights or Step brothers.\n\nAwful forced humor.\n\nShould've known by Will Ferrell's story on Jimmy Kimmell live, of Mark Strongs reaction to hearing about them playing Holmes & Watson, that this would be garbage.\n\nPaper tiger cast at first sight and a true letdown."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "horaciorocha",
        "review_rating": "3",
        "review_title": "Funny, if you like Funny",
        "review_detailed_main": "I dont understand the bad reviews, this is a comedy, a silly comedy of course because Will Ferrel is in it, you have to come in knowing that then you will find it funny, it is silly at times but you will laugh."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Yee_Reviews",
        "review_rating": "4",
        "review_title": "Another Will Ferrell Movie",
        "review_detailed_main": "Good: Like most Will Ferrell movies there are a few chuckles, but most of them fall flat.\n\nBad: The plot is generic. There is rarely any suspense. It is not nearly as creative as many detective movies or shows. Nothing stands out or is memorable.\n\nOverall: An unnecessary Sherlock movie that had no reason to be made. A simplistic movie that has nothing innovative or genuine. Will Ferrell and John C. Reilly play the same goofballs in their other movies, but the lack of story and not much to work with, turn this movie into a waste of good talent. \"Step Brothers\" and \"Talladega Nights\" are a step above this one.\n\n2/5"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "PhelixRoth",
        "review_rating": "1",
        "review_title": "Incredibly lazy, as a comedy and a film in general",
        "review_detailed_main": "I honestly don't hate Reilly or Ferrell. I've seen both of them do fantastic jobs with decent scripts. This film...does not have one of those.\n\nHolmes and Watson could have been great - after all, the Sherlock Holmes character, being such a cultural icon, is ripe for parody. But this movie does NOTHING with its premise. In fact, most of the script could just have been copy-pasted from your standard brainless buddy comedy set in modern America, with barely any changes.\n\nFor one thing, the film has barely any plot - instead, the titular characters simply stumble from one scene to the next, encountering various people of no real consequence (even Moriarty - played by the fantastic Ralph Finnes, a casting choice that would have been so much better in a serious adaptation - is barely in the movie and feels like an afterthought). And sure, not every comedy needs a strong plot; but when you're making a film about Sherlock Holmes, whose very character is built on strong murder mystery plots, you need to at least ATTEMPT to give your parody something of a story.\n\nAnd for another, the jokes are just painful. As mentioned, most of them barely relate to the Sherlock Holmes character at all - they're just standard slapstick jokes transplanted into a Victorian setting, with barely any changes; or else painful attempts at being \"topical\" that'll feel horrendously outdated in a few months. The film makes no real effort to satirise the Holmes character - in fact, it never makes us feel like we're watching Sherlock Holmes or John Watson on the screen at all. Instead, we just feel like we're watching Will Ferrell and John C Reilly faffing around in costumes and putting on dumb accents, and the film never tries to convince us otherwise.\n\nIt's just low-effort tripe beginning to end. Modern comedy feels like a cesspit sometimes."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "It's hard to imagine Will Ferrell and John C. Reilly not being funny....but here it is.",
        "review_detailed_main": "Sherlock Holmes is determined to capture Professor Moriarty. However, Holmes (Will Ferrell) is an idiot and seems to do his best to help Moriarty escape....and having his devoted partner hung instead! And, in doing so, he's allowing Moriarty's plot to kill the Queen to move forward.\n\nOne of my favorite comedies is \"Talladega Nights\" starring Will Ferrell and John C. Reilly. And, while not as funny, their film \"Step Brothers\" also makes me smile. So, you'd think that the pair would pretty much a guarantee of a good laugh....though \"Holmes & Watson\" is ample proof that even this duo can make a dud. And, it all boils down to the script, as \"Holmes & Watson\" hasn't a single laugh in the film. Instead, it resorts to the cheap and disgusting...such as vomiting, an autopsy, male lactation, horse excrement, and urination. Most children could write a script funnier than this bilge.\n\nThe bottom line is that even funny folks need a competent script....and this script is pure crap through and through. Unfunny, mean-spirited and stupid....that's \"Holmes & Watson\". Rarely has a film cost this much and delivered so little.\n\nBy the way, if you watch this film (DON'T), it's obvious they set it up for a sequel. Considering nearly everyone hated \"Holmes & Watson\" the chances of this sequel are pretty much one in a billion (give or take 10)."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "angelinafpalmer",
        "review_rating": "1",
        "review_title": "I was wrong",
        "review_detailed_main": "I always thought giving birth was the most painful thing I would ever experience. I was wrong. Watching 5 minutes of this movie was far more painful."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "boblipton",
        "review_rating": "1",
        "review_title": "Don't Bother",
        "review_detailed_main": "This movie is as bad as its awful reputation. You may cease reading now, since I have imparted everything you need to know about it. I will now blather on for a few lines because other the IMDb would not print this.\n\nIt is poorly written. When I heard the word \"kids\" in the first two minutes to mean small children, and saw girls in a British public school in the 19th century, I thought I was in for a YOUNG EINSTEIN sort of movie. No, it is sloppily, uncaringly written, and nothing about it gives any impression that anyone behind the camera put more than minimal thought into the movie. There are shots that are out of focus.\n\nAh, you say, but how about the jokes. There is one good gag, in which the Robert Downey movies are mocked: overcranked sequences in which Holmes analyses what a course of action will yield..... only to have his analysis turn out long. This gag is done three times. There are also urine jokes, sexual assault jokes, and other examples of juvenile humor which are not elaborated, only repeated.\n\nI've wasted an hour and a half watching this piece of garbage and another ten minutes writing this. That's more than enough."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jeffyancey-66932",
        "review_rating": "1",
        "review_title": "Absolutely Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "andeemartin-81685",
        "review_rating": "6",
        "review_title": "What's actually happening with Hollywood comedies",
        "review_detailed_main": "It's been ten years since Will Farrell and John C Reilly starred in a movie together. Their previous two outtings not only done well at the box office but are now considered to be classic. This movie must have been something many comedy fans have been waiting for... but what went wrong? I don't think I've read such bad reviews for quite sometime. Luckily or some may say unluckily I went to see it before I read anything about the movie. Honestly, I don't think the world needs another Sherlock Holmes spoof, it's been done to death almost as much as spoofing James Bond but I was in the mood for a comedy and this was really my only choice. Comedy at the cinema isn't as easy to come by nowadays I find, so seeing these two guys in a film together again I thought.... it can't be that bad. My honest opinion is... well it isn't that bad. Moments made me laugh, I felt it was paced well and although not as good as their last two movies I felt their fans would get something from it. I do however see why people are disappointed. Ferrell's portrait as Holmes, I can seeing being annoying to many, it's pretty crude for a 12 certificate (UK , guessing PG-13 in the US)..Mostly though I think is the advertising of the rest of the cast. Several actors names are on the posters, they appear in the trailer but are barely in it. Steve Coogan has a cameo at best. Fans of these actors will only come away disappointed. If they were unexpected,I think the audience would come away pleased with their appearances. Like when Bill Murray pops up in 'Zombieland' for example. Overall it made me chuckle a fair bit, which is the point of a comedy and I can't think of many films that have done thst for me this year. Most of the comedies we get are animated (lately far more laughs in a pixar than in a live action movie) or the odd random film like 'tag' which although a better made film than this, I dont think I laughed more. I do miss the days of looking forward to the latest movies from my favourite comic actors like Steve Martin, John Candy, Chevy Chase and even Adam Sandler. I saw Will Farrell as one of the last of this breed. It would be a shame for this misfired movie to ruin his career. I think in years to come it will be seen as more favourable. Also I couldn't help comparing it to the Peter Cook/Dudley Moore 'Hound of the baskervilles' another bomb with a great cast. Actually I say give that movie a go, you may realise this one isn't too bad after all. Hollywood comedy seems in a slump at the moment, we either need to not have our expectations too high or possibly throw movies the way of new talent? Maybe both. After this I'm not sure this pair will get the chance to make other film together. A shame.... who knows though they may need the money and the audience get the long awaited Stepbrothers 2. At least they tried something different I guess, remember the first 'Police Academy' was great but sequels aren't always the way forward."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "daniellawsonrt",
        "review_rating": "1",
        "review_title": "Ruined my popcorn.",
        "review_detailed_main": "I love the experience of going to the movies, loading up with popcorn and Coca-Cola and sitting in big comfy chairs. It doesn't matter if the movie is good or bad. Then Holmes & Watson came along and changed all that. This film is a mess from start to finish, if you're expecting to see another Step Brothers or Talladega Nights, you will be sorely disappointed."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "anitawarnes",
        "review_rating": "10",
        "review_title": "Just a great comedy",
        "review_detailed_main": "I really can't believe all the negative comments on here. This is a great comedy from Will Ferrell and John C Reilly. It is slapstick and silly but just what you expect from these two. It isn't supposed to be an accurate portrayal of Sherlock Holmes and I read one comment that read it isn't 'historically accurate'. No it isn't. It isn't meant to be. It's a COMEDY. I would say if you love slapstick and have enjoyed the other films from these guys then go and see it. I found it very funny and entertaining and that's all it's meant to be."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "TheMovieGoof",
        "review_rating": "7",
        "review_title": "Bad Movie? On the Contrary",
        "review_detailed_main": "This movie was hilarious, I don't know why it received harsh ratings. People take comedies too seriously and lack imagination. Holmes and Watson isnt at the level of Talladega Nights and Step Brothers but still has some great humor in it. If you are wondering if it is worth watching then the answer is YES."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "PinkOval",
        "review_rating": "1",
        "review_title": "First movie I've ever walked out of",
        "review_detailed_main": "Never have I ever been so bored, disgusted, and repulsed by a movie. My family and I collectively decided to walk out about an hour in, realizing what a waste of time this film has been. There are so many better movies in theaters right now- please, please, please stay away from this hot garbage."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "kurtalderman",
        "review_rating": "",
        "review_title": "Just One Redeeming Quality",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "reidiq",
        "review_rating": "1",
        "review_title": "Dumpster Fire",
        "review_detailed_main": "I wish I could rate this movie 0/10. Absolute waste of time. I tried to laugh but was forcing myself in hopes that it would get better."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "MrTeenie",
        "review_rating": "1",
        "review_title": "A waste of time, money and resources",
        "review_detailed_main": "This is what happens when runaway egos have no one around to say no to them. It doesn't deserve any more words spent on it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "VegasB18",
        "review_rating": "1",
        "review_title": "Absolute Garbage",
        "review_detailed_main": "Holmes & Watson is easily the worst movie of the year and quite possibly competes for worst movie of all time. It's unyeildingly bad. The jokes are often recycled and every single one falls flat. The story wanders almost aimlessly and the production value is bottom of the barrel. There is seriously nothing redeeming about this movie. Save your money. This is no Step Brothers. This is pure unadulterated trash."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "alicemorrison-17681",
        "review_rating": "1",
        "review_title": "Supposed to be a comedy?",
        "review_detailed_main": "Watched the whole thing waiting for it to get funny. Never did. Do not recommend at all!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "imdb-23283",
        "review_rating": "1",
        "review_title": "Terrible, wasted a good Xmas visit with my kids",
        "review_detailed_main": "This is a terrible movie. Not funny. The jokes and gags fall flat and why the Trump jokes, American gun jokes, women's pay joke, and general anti-American sentiment? Is this what is seen as funny in Hollywood?? Do not waste your time or money on this movie."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mandonut1",
        "review_rating": "6",
        "review_title": "Do Not Expect Another Step Brothers",
        "review_detailed_main": "If you're looking for another Step Brothers quality movie, you will be disappointed. But I wasn't expecting that. I was expecting cheap, stupid laughs that Will Ferrell and John C. Reilly do so well; and that's what I got. One and done leave your brain at the door comedy. So I was pleased."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "devilish_charm",
        "review_rating": "1",
        "review_title": "BAD MOVIE ALERT! AND NOT FUNNY!",
        "review_detailed_main": "About an hour into the screening of this movie, more and more audiences started collecting their belongings and left the cinema. They were the wise ones, not wanting to waste another second of their precious time on this terrible and unfunny movie. I think Will Ferrell imagined this movie differently in his mind. But what is shown on screen is shockingly unfunny, irritating to watch, and oh so boring! Step brother this is not."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Mihai1983",
        "review_rating": "9",
        "review_title": "Funny comedy",
        "review_detailed_main": "I would begin this review by saying that everything is relative, let's think of abstract art, for example, at first glance you would be temped to say it was painted by a 5 year old child, but because it received the appreciation of some art critics, people have seen this current in a positive light, I think the same thing happened here, people read the negative reviews and the subconscious rated the film as a bad one from start. I personally amused and laughed a lot, is not this the purpose of a comedy ?! If you have a cinematic culture, you're already familiar with the Will Ferrell style and you know the expectations, if you are alergic to peanuts don't eat them. Haters gonna hate anyway."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Kingslaay",
        "review_rating": "7",
        "review_title": "Good laugh",
        "review_detailed_main": "Holmes and Watson was good light hearted fun. It never tries to be anything its not. It knows its a comedy and delivers on it.\n\nIn regards to the negative reviews on here, did you not watch the trailer? If you were expecting a complicated plot or suspense then you'd be disappointed and you're probably one of those people who never read the instructions and then complains when something doesn't work.\n\nHolmes and Watson is not an oscar contender and it never intends to be one but deliver some light hearted comedy. The pitch is simple, it's the holidays and the year is winding up so it's time for some easy and carefree laughs. This film delivers."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "sincityphil",
        "review_rating": "1",
        "review_title": "Please no",
        "review_detailed_main": "Some funny moments, but on a whole. Really quite bad. Plot is everywhere."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "chris-70787",
        "review_rating": "1",
        "review_title": "It is hard to conceive of a worse movie",
        "review_detailed_main": "Oh my god this is just utterly utterly terrible. Every single aspect of it is horrible. There is nothing good about this movie at all. Nothing. Only watch this movie if you despise yourself and want to cause yourself intense psychological pain. It might be useful as a weapon of torture though."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "steve-mason66",
        "review_rating": "1",
        "review_title": "Without doubt, the worst movie I have ever seen",
        "review_detailed_main": "I saw this movie a few days ago, well to be honest I saw the first 20 minutes or so and left. I couldn't take any more. The acting is so bad, I mean ridiculously bad. Two Americans putting on this fake English accent so badly, I assume for comedic effect, which failed drastically. The dialogue is pathetic and childish, and the the story poor. I'm surprised this even got a release. I expected more from Etan Cohen and the crew. This movie has no redeeming features at all. None! Utter garbage, and a waste of time money and effort. The biggest question is, why on Earth did they bother."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mickeymills",
        "review_rating": "1",
        "review_title": "Not sure a film that is not funny can be called a comedy.",
        "review_detailed_main": "It wasn't quite as good as Waterworld, and it was a little better than Piranha 3-Double D. I've thrown away $20 for worse reasons that had nothing to do with a bad film."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "goerge12344",
        "review_rating": "",
        "review_title": "Not great, but not as bad as people say--probably far right-wingers.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "carobertson95",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "This movie was absolute garbage. Me and my family didn't laugh once. Almost everyone in the theatre was trashing the movie afterwards too. I hope to never see this again. Waste of money."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "morethanmerrick",
        "review_rating": "1",
        "review_title": "Wish I could give this a 0.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "timryckman",
        "review_rating": "7",
        "review_title": "Ignore the haters",
        "review_detailed_main": "The flood of 1 out of 10 reviews made me a bit nervous to pay money to see this movie but I love both of these guys. Both me and my fiance went in with low expectations and laughed far more than we expected. If you go in knowing that it's going to be dumb and it's not Step Brothers, you may actually have a decent time."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "andrew_jakobs",
        "review_rating": "1",
        "review_title": "Worst crap ever",
        "review_detailed_main": "I hadn't expected much as it stars Will Ferrell, but this was really REALLY awful. The script is bad, not funny at all. It's a shame as it has a high production value, but the script is just horrificly bad. It can't even be labeled a satire as the jokes just weren't funny (well maybe if you're drunk and stoned out of your head). I wonder who approved the script, and that's just a big shame. Making a Holmes comedy would have been great if they writing and jokes were excellent, previous Holmes comedies have proven it, but the jokes don't reach a stage beyond the piss and sex jokes (and not even funny at that). Such a shame, because if it had a good script/story it would have been a great movie as the cast itself can't be blamed for it. John C. Reilly makes a great Watson, and Ferrell could have been if he didn't play as he always does (I think he had his hand in the script as it has the same kind of awful jokes he normally plays in)."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "cerberuxmusic",
        "review_rating": "10",
        "review_title": "A great SATIRE, not for the easily offended.",
        "review_detailed_main": "Let me start by saying I have NEVER been a fan of Will Ferrell, and seeing all the negative reviews I went into this movie with very low expectations. And I was pleasantly surprised. It reminded me of the hay day of slapstick satirical comedy. It felt right at home with other films of this nature, like The Pink Panther, Monty Python, and even some of Mel Brooks' films, albeit not quite as good as those.\n\nIt never took itself too seriously and was very honest with the humor it wanted to get across. Satire and slapstick abound, the jokes were great and actually pretty clever and well paced.\n\nWill Ferrell did a great job portraying a satirically narcissistic Holmes and John C. Reilly did an amazing job at playing a \"never good enough\" Watson. All of the supporting characters were well cast and never felt out of place, or forced and added a great level of humor to supplement the titular characters.\n\nAll in all, it's a satire by every definition of the word, and if you don't get that, or get offended by everything, stay away from it. Otherwise, turn your brain off and enjoy the ride, it's worth it!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "addisonrwatson",
        "review_rating": "7",
        "review_title": "Classic Will Ferrell and John C. Rilley Comedy",
        "review_detailed_main": "Not too sure why the hate is so heavy on this movie. It's not groundbreaking by any means, but it still had me chuckling a decent amount of times. I was entertained by it. I didn't go in there expecting an oscar though, so maybe that's the problem? I hope the ratings aren't due to the clear political jab of the current dude in office. I could just be being paranoid, but we live in marvaleous times. Who knows!\n\nBottomline: it's not as good as Stepbrothers or Talladega Nights, but you'll laugh if you dig WF and JCR. If you're worried, wait until it hits Redbox."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "joesmith-86385",
        "review_rating": "1",
        "review_title": "No.",
        "review_detailed_main": "Don't do it. Don't even attempt to spend another minute wondering if you should see this god awful movie, just to form an opinion of your own. I literally did you the favor for you. I made a conscious decision to see it, wasting $12 bucks and 92 minutes, neither of which I will EVER get back. Please drink a pint of motor oil instead. It's cheaper, faster and generally better overall for your health."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "NotAFakeReviewer",
        "review_rating": "",
        "review_title": "Can't help but notice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "chiguy17",
        "review_rating": "1",
        "review_title": "Just AWFUL",
        "review_detailed_main": "This is seriously one of the WORST movies I've ever seen. Don't think I'm more than 30 minutes and I just can't stomach any more. This is what happens when a person has too much freedom and creative control when it comes to a script. I have a feeling the majority was just Will Ferrell and John C. Reilly goofing around and improvising.\n\nIt's just the most obvious and lowest brow of humor."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "LaBelle1979",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "This has to be by far the worst movie that Will Farrell and John C. Reilly movie haveeither done. It ranks as bad and Kung Pao: Enter the Fist. It wasn't worth sitting through the first 20 minutes. If you want a movie to put you to sleep, or just flat out bore you beyond measure, than by all means, watch it. If not, save your time and money and do something else. This is a flat out insult to the Sherlock Holmes series of books, movies and shows."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "sansay",
        "review_rating": "1",
        "review_title": "I wanted to leave after 15 minutes",
        "review_detailed_main": "I went to see this movie in a free preview, not knowing much about it other than it was a comedy based on Sherlock Holmes. A friend at work told me \"I looked at the preview, looks like lame humor\". I am usually weary of previews, they often misrepresent movies. So I went. It didn't take long for me to realize what a big mistake that was. After 15 minutes of jokes that fall flat because too big to not fail, I decided I have to get out of here. But I was in the middle, dead center of the theater, and I really hate to disturb other spectators. So I stayed another 15 minutes, until I just couldn't take it anymore. In retrospect, I think one of the problems with this movie is that it makes fun of a genius who is able to figure out what's going on by combining observation, knowledge and logic. It touches the very essence of what makes Sherlock Holmes so interesting and fascinating to most people. It tries to make Sherlock Holmes look like a fool. But everybody knows that Sherlock is anything but a fool."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "southdavid",
        "review_rating": "1",
        "review_title": "The worst film of 2018.",
        "review_detailed_main": "Man I love reviewing the awful ones. Most of what you see these days is alright, competent, good enough that it's nice sometimes to see something so categorically awful - just to get the juices flowing.\n\nWill Ferrell is Sherlock Holmes and John C Reilly is John Watson and they ..... (sigh) .... Actually what are they doing? Moriarty threatens to kill the Queen so they ..... follow up on some leads, I guess. Blunder around in a series of ghastly, tedious, scenes and then mercifully it ends. Then (and I swear this is true) the staff at the cinema congratulate you for making it to the end.\n\nSo why is it so bad? Partially, it's because it has no idea what its core premise is. I wonder if it suffers from being rewritten multiple times since the initial idea with Sacha Baron Cohen. It's never sure whether its Holmes is a genius, a fraud or an idiot - so across the run time he's all three. It feels like the film should have had Watson as the genuine genius, happy for the credit to go to Holmes - but that went out the window when Reilly was cast and now there's no straight man to the pairing, just two idiots tramping from godawful slapstick scenes to witless parody of modern day via a spoof of the Downey Jnr/Jude Law films. It's chocked full of cameos, Steve Coogan, Hugh Laurie and Rob Brydon all of whom add nothing, no humour, no story... just characters coming and going and adding nothing. They do come of better than Kelly Macdonald though, whose cringeworthy version of Mrs Hudson is a particularly and at the end bafflingly, nadir.\n\nAt no point last year would I have believed that \"Sherlock Gnomes\" wouldn't be the worst adaptation of the character that I saw last year. \"Holmes and Watson\" not only topped that, it was the definitely the worst film I saw at all last year, certainly one the worst of the decade and, without hyperbole, indubitably of the worst of all time."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "shark-21087",
        "review_rating": "1",
        "review_title": "Total Trash",
        "review_detailed_main": "I wanted to watch because Will Ferral starred in it, but it's just aweful."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "adrianayers-82278",
        "review_rating": "7",
        "review_title": "The Most Underestimated and Ripped On Movie of the Year!!!",
        "review_detailed_main": "Holmes and Watson, a comedic twist on the amazing detective that has also been portrayed by Robert Downey Jr (Iron Man) and the great Benedict Cumberbath in the English TV Series \"Sherlock.\" Hit with the amazing duo Will Ferrell and John C. Reilly, it was built up to be quite the masterpiece. However as shown by the horribly untrue reviews, they gave it a fate worse then death, a terrible rating of 3.4! I think the duo did a great job giving the serious and intriguing series that so many of us have fallen in love with. I thought it was constantly funny and Will Ferrell brought a very heartily feel to the otherwise dark and impressive detective that is Sherlock Holmes. I was laughing several times during this movie and I was able to watch the whole thing without walking out. I had not even one single thought of leaving this movie. It was totally worth the money and if they made a sequel I would have no problem paying the money to see this again. When it comes out on DVD, I will definitely get it again to watch. I appreciate everyone else reviews to this movie but I definitely give it a way higher review than that! I give it a 7/10! I think you guys should give it a try too!!!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "gcrawfordd",
        "review_rating": "1",
        "review_title": "Couldn't Watch more than 30 minutes",
        "review_detailed_main": "A real dearth of laughs I am afraid. Started off with a good premise - the young Sherlock getting bullied and humiliated at school and deciding to devote his life to logic and truth. After that we see the grown up H&W and from then on the film shambles from one chaotic skit to another with no real point to the whole thing and a bunch of unrelated characters who might in the end get knitted into a narrative. We didn't have the patience to stick with it and switched it off and went to bed."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "krisxyanide",
        "review_rating": "9",
        "review_title": "Pathetic-Awesome!",
        "review_detailed_main": "This was so pathetic...i'll give it a 9. Why? Because i think that they wanted people to vomit from the horribly bad film this was... Will F. doesnt disappoint in stupidity. Love that guy."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "axanderc",
        "review_rating": "7",
        "review_title": "Okay, but...",
        "review_detailed_main": "I just finished the movie. It was good, but expectations were too high. Good acting. Bad writer. It would have done so much better with the writer of taledega nights, and step brothers. (side note: inappropriate to a high extent, and was only funny half the time aka bad payoff)"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "benpaule",
        "review_rating": "1",
        "review_title": "This is NOT Even Laughably Bad",
        "review_detailed_main": "My girlfriend and I went to see this movie despite the reviews. We love stupid Will Ferrell comedies and figured that other reviewers just didn't \"get it.\" We were wrong. Right from the start, this movie is uninspired, boring, graphic, and inconceivable. What sucks the most is that the set is great, the costumes are good, the music is actually incredible, but the writers and the actors were all apparently horribly ill while writing this, because it is nothing but an absolutely horrible fever dream from start to... I'd say to finish, but my girlfriend and I walked out as soon as we hit the \"morgue scene.\"\n\nWill Ferrell and John C. Reilly were so funny in Step Brothers, because they played stupid versions of themselves. Here, Will Ferrell uses a downright offensive British accent, and the directors apparently thought that this would be humorous in itself? This is the only explanation for why anyone thought this movie was funny, because the \"jokes\" are certainly not funny.\n\nIt's like a bad SNL skit that went on for an hour and 30 minutes too long, because there is one joke the whole time, and it never lands; Holmes and Watson are stupid. This doesn't even remotely make sense, let alone make me laugh. I chuckled once. Ok, twice. But I got nothing more than a \"heh\" out. Otherwise, this is not even a film to be laughed at. As soon as Will Ferrell came on screen, I leaned over to my girlfriend and said \"Oh my God... is this going to happen the whole movie?\" I didn't finish it, but I'm pretty sure it did happen the whole movie. That's what I saw.\n\nHow many more times do I need to say it? I LOVE stupid Will Ferrell comedies! I love Step Brothers, Blades of Glory, Talladega Nights, etc., But this movie is uninspired and IN NO WAY IS IT FUNNY. Save your money. Or if you want to put your cash to better use, rip it into pieces, turn on your fireplace, and incinerate it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "xgbart",
        "review_rating": "",
        "review_title": "So silly it was hilarious!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Amazing_Wizard",
        "review_rating": "1",
        "review_title": "Walked out at the vomit scene",
        "review_detailed_main": "I was not laughing during the entire openig act. I hate the characters, the stupidness of Watson and arogance of Sherlock. How they ate the cake even after what was inside was exposed. Then when they started vomiting together, I walked out the cinema. It was that bad."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "JoBloTheMovieCritic",
        "review_rating": "1",
        "review_title": "Holmes & Watson",
        "review_detailed_main": "1/10 - as inexplicably awful as everyone else foretold - an embarrassment to the entire institution of filmmaking"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "suicidea",
        "review_rating": "1",
        "review_title": "Stay away. Far, far away.",
        "review_detailed_main": "It is one thing to laugh at crude humour, a completely other thing to praise crude humour and bash anyone who doesn't like it.\n\nThe comments for this Sherlock Holmes parody really made me wonder. If you like it, great. You find it funny, wonderful. But going so far as to say \"If you don't like this, you don't know what comedy is. You probably have a dull, bland life\" type of stuff? Someone even actually wrote \"If you don't like this movie, your spouse is unhappy with you.\" Really, insecure much?\n\nI love crude, tasteless humour, mind you. What I can't stand is \"See? We made a joke. Get it? Here, we're repeating it in case you missed it, only this time we'll make it louder, and spell it slower\" kind of humour.\n\nIn fact, Holmes & Watson doesn't even have crude or tasteless humour. Or any kind of humour. All it has is references, assuming that \"modern day references in a film that takes place in 1800's will have people laughing like crazy.\"\n\nWhich you will find plenty here. \"Let's make a joke about texting. Get it? It's late 1800's, so there are no cell phones yet, but we're joking about texting. Get it? Oh, now we'll joke about sexting. Har har har. Get it? Here comes a joke about Instagram. Oh, I'm dying from laughter here. Get it? Okay, now we're moving on to jokes about selfies. Get it?\"\n\nThe whole film plays like a single joke extended and repeated for 90 minutes, and unfortunately, it's the joke I mentioned above.\n\nTalented actors like Rob Brydon and Ralph Fiennes do what they can with what they're given, but they can't save a sinking ship alone.\n\nThere's one fair complaint from people who loved this movie (and bashed those who didn't). They say \"Well, it's a Will Ferrell - J. C. Reilly movie, what else do you expect?\" Which sounds reasonable. I thought long and hard, and decided what I want from a comedy film. How about... funny stuff?"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "will_murtagh",
        "review_rating": "1",
        "review_title": "How is a film with this cast so bad?",
        "review_detailed_main": "This film is so bad it gives me energy.\n\nI now feel compelled to warn people who, like us, may be tempted to part with actual cash to watch a Will Ferrell film, purely because it's got Will Ferrell in it... It must be at least 'OK' right? Surely he, and the likes of Coogan and Fiennes wouldn't sign off on this? I can only presume to think this is some sort of social experiment in which everyone is in on it apart from me and my secretly-filmed reactions are all going to end up on Jimmy Fallon... The supposedly untouchable Ferrell spends most of the film wrestling with the English accent at the expense of any glimpse of humour. Old English satire is unforgivingly beyond him, even if the writing had afforded him any chance of making a funny. He simply resorts to the odd Ferrell-esque shriek which comes off as just desperate. It's a painfully damaging blotch to the Ferrell brand. As for Coogan, Lawrie and Fiennes - they all feature very little (and presumably since have collected their pay checks, run for the hills and will claim they were never involved - I would).\n\nSeriously, who wrote this? It's career ending stuff all round. It will win all sorts of 'worst film' awards no doubt. Ferrell, what are you doing?! Embarrassing mate."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jaidanh",
        "review_rating": "1",
        "review_title": "Walked out less than 20 minutes in",
        "review_detailed_main": "My best friend and I saw this film a few days after Christmas back in 2018. We saw the trailer and thought it was gonna be funny. But the film got boring very quickly. The jokes were cheap, bland, and unfunny. I guess my friend felt the same way because within 15 minutes into the film, he turned to me and said, \"Do you wanna leave?\" I agreed, so we got up and walked out. We tried to get refunds but couldn't. We did however get readmission tickets so we could see a free movie next time we went to the cinema."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "selectsoccerboy",
        "review_rating": "7",
        "review_title": "It's a comedy, not an Oscar film people",
        "review_detailed_main": "It's a funny movie, and I'm not sure why people are giving it hate. It's meant to make you laugh, not awe you or inspire you. The plot is odd and so are the characters but the movie is funny. If you don't find it at least half-funny then you probably have an awful and unsophisticated sense of humor. Those that are upset are probably triggered Republicans since they poke fun at Trump a few times! Got over yourselves movie snobs, take it for what it is!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dondroid-39750",
        "review_rating": "1",
        "review_title": "Possibly the worst film ever made.",
        "review_detailed_main": "I have just watched this and now I wish I had used the time to have a root canal without any pain relief. This has to be the worst film EVER made. The \"jokes\" were stale and telegraphed from miles away. The acting even by Will Ferrel standards, was diabolical, don't get me started on the accents, or the weird musical number. I genuinely mean WTF?!?. Made in similar style and 'homage' to the Guy Ritchie Sherlock home movies it clunks from one scene to another with all the finesse of a bulldozer trying to make a house of cards. If I was Guy Ritchie, I'd sue the film makers for every penny. Some genuine talent appear in this movie (Hugh Laurie, Steve Coogan, Ralph 'Commander Waterford' Feinnes) and all I can say, it must of been one hell of a big payday for them, because they would never be associated with anything this awful otherwise. If you watched this high, you'd struggle to enjoy one minute of this gosh awful, stinker of a fetid vomit stained movie. It makes the worst of the worst budget movie made by film students, with no budget, no talent and no skill, look like 'Citizen Kane'. Please, please do not watch this movie. If there is any justice in the world every copy of this would be burned and all memory of its creation scrubbed from exsistance."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "fordham-kelly",
        "review_rating": "9",
        "review_title": "Hilarious",
        "review_detailed_main": "I have read so many bad reviews about this movie and it's obvious haters are going to hate.\n\nI thought this movie was absolutely hilarious. If you loved Talladega Nights and Step Btothers, then go check it out.\n\nThanks for the laughs Will Ferrell and John C. Reilly. I am looking forward to watching it again so I can pick up on the jokes I missed the first time."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "deloudelouvain",
        "review_rating": "7",
        "review_title": "I had fun, like always have with Will Ferrell.",
        "review_detailed_main": "I'm glad I didn't pay too much attention at the extremely bad reviews and the incredible low score Holmes & Watson got here on IMDb. And I'm also glad I'm not the only one that had a good time watching this movie. I just can't help it but when I see Will Ferrell's face I already have to laugh. I laugh with all his movies so I wasn't surprised I did like this movie much more than I'm supposed to when you concider the low ratings. Will Ferrell played Holmes in his typical way, a bit clumsy and dumb but always funny to watch. John C. Reilly was just perfect as Watson, even better than Will Ferrell in my opinion. Holmes & Watson is just another good comedy if you like Will Ferrell's style of humor. If not, too bad..."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "omarmnajdi",
        "review_rating": "1",
        "review_title": "Bad movie!",
        "review_detailed_main": "If I could give it a zero star I would! This movie is boring and I do not recommend anybody to watch it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "marisapuckett-83330",
        "review_rating": "",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jackcampany",
        "review_rating": "1",
        "review_title": "Just mind numbingly boring.",
        "review_detailed_main": "Turned off after 25 minutes and I'm surprised I lasted that long. If you're looking for a step brothers type film... watch step brothers again."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "bmspiker",
        "review_rating": "1",
        "review_title": "We walked out of the theatre it was so bad!",
        "review_detailed_main": "Stupid, stupid, painful to watch! Literally the most stupid movie we've ever seen."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "TheOneThatYouWanted",
        "review_rating": "1",
        "review_title": "The director is an idiot",
        "review_detailed_main": "Two of the best film-comedians of all time and this director manages to make one of the most unfunny films I have ever seen. If I EVER see this director's name on anything, I'm going to not spend a penny on it or change the channel."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Wizard-8",
        "review_rating": "2",
        "review_title": "It could have been worse... but yeah, it's pretty terrible",
        "review_detailed_main": "Normally, I avoid the movies of Will Ferrell and John C. Reilly, because their typical brand of comedy is a kind I simply don't find all that amusing. But I sought out this particular movie of theirs, because I had heard so many ghastly reviews about it labelling it as one of the worst comedies of all time, and I have a penchant for extreme cinematic disasters. So is the movie really all that bad? Well, there were a small handful of gags that did provoke some (very) mild titters from me, but apart from those moments, I did find the movie to be as bad as other have made it out to be. There are some additional attempts at humor in the movie that COULD have worked with better staging and execution, but they are badly botched by writer/director Etan Cohen and the cast. But most of the humor is so lazy, so familiar, and so predictable, that even the best direction and performances could not milk any positive reactions from an audience. I think an additional problem is that Sherlock Holmes has previously been done to death both seriously and comically that it would require a herculean effort to add new life to the character. All that Cohen can seem to do is stuff like make many modern-day references, showing a real desperateness that will be painfully evident to any viewers. Not the worst comedy I have seen, but it all the same sinks to a real low point in the history of Hollywood movie comedies."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "stukerr-41566",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Similar to Zoo Lander 2... terrible!! Unfunny, stupid references to TRUMP (get over it) and long winded scenes that have you begging for them to end! I left about 50 mins into it. These guys are obviously great actors however their performance in this movie is lacking comedy and is more obnoxious. The popcorn was good."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "maxforddollars",
        "review_rating": "7",
        "review_title": "Extremely funny",
        "review_detailed_main": "My family and I, who detest those mainstream comedies such as The Big Bang Theory, Friends, Brooklyn Nine Nine etc. due to their reliance on one liners and lack of genuine comedy, were in stitches at this movie. You may see other reviewers on here denouncing the movie as mindless, plotless and crude, and they're actually not too far off the mark. As far as plot and moviemaking goes, this is no masterpiece. The real appeal of this movie is the hysterical comedy. There are some fantastic political references, some hilarious set pieces, and in general just great comedic moments. The reason most people detest this movie in my opinion is because they were expecting a Robert Downey Jr-esque take on Sherlock Holmes, in that the movie is serious, well-plotted and articulate. Well, what I say to these people is, you've literally got dozens of Sherlock Holmes films to watch for these qualities. What the director of this movie has done is thought outside the box a little, taken a vastly different take on Sherlock Holmes than the endless amount of filmmakers before this. This is a rollicking comedic ride, with the lack of plot more than compensated for by the consistent laughs that you get of it. People don't laugh enough anymore, and it is for this that this film is well worth the watch."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jlp-55052",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "I am a fan of both actors and they stole my money and my time. I will never go to the movies to see these guys in the future. Do NOT waste your time."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "meatswede",
        "review_rating": "9",
        "review_title": "Ham with a side of Ham please",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dancing_neonate",
        "review_rating": "7",
        "review_title": "I don't understand why everyone is so upset",
        "review_detailed_main": "It really wasn't that bad of a movie. Everything was funny but it was family friendly. If people wanted stepbrothers they should've stayed home and watched that. It was PG-13 so people should've know what they were walking into"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "steve_santy",
        "review_rating": "1",
        "review_title": "Embarrassing",
        "review_detailed_main": "How do you possibly ruin getting these two guys on the screen together. The epitome of what Hollywood has become. Embarrassing for them they thought people would like this."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "JohnDeSando",
        "review_rating": "",
        "review_title": "It made ME laugh. Now that's a recommendation.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "devries102001",
        "review_rating": "1",
        "review_title": "Don't waste your time or money",
        "review_detailed_main": "My son (13 yo) picked the family movie for his birthday. In the first 15 minutes of the movie I thought to myself, \"Am I missing something? This is horrible\" we were the only people in the theatre 5 days after it released. I took out my phone in the middle of the movie, which I normally don't do as I think it's rude to the other people around me. I looked up the rating on IMDB and saw the rating of 3.3. There has only been 1 other movie that has prompted me to do this (In the Name of the King) I spent the next hour warning my friends not to waste their time on this movie. The jokes were predictable and boring. They went for the easy punchlines and they fell flat every time."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "quinnnilsson",
        "review_rating": "1",
        "review_title": "This movie plays on an endless loop in hell",
        "review_detailed_main": "Here is my advice to you, if you are currently dating someone and want to break up with them but let them down gently, take them to this movie. I guarantee they will dump you before the movie is over for taking you to see this terrible film. If you are an 8 year old boy you will love this movie."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Noah_Biondi",
        "review_rating": "1",
        "review_title": "Doesn't take a detective to figure out how bad this movie is",
        "review_detailed_main": "Everybody everywhere has been saying that Holmes & Watson is literally one of the most abominable pieces of garbage in cinema. And do you know what? THEY WERE RIGHT! THIS MOVIE IS ABSOLUTE GARBAGE! YOU THINK I'M RAGING NOW? WHEN I LEFT THE FREAKING THEATER, I FELT LIKE BLOWING IT UP! THIS MOVIE IS HORRIBLE!\n\nWhat's the story? Detective Sherlock Holmes and Dr. John Watson join forces to investigate a mysterious murder at Buckingham Palace. It seems like an open-and-shut case as all signs point to Professor James Moriarty, the criminal mastermind and longtime nemesis of the crime-solving duo. When new twists and clues begin to emerge, the world's greatest sleuth and his trusted assistant must now use their legendary wits and ingenious methods to catch the killer before the queen becomes the next victim.\n\nSo what's so terrible about this movie? EVERYTHING!!!!!- well, the worst aspect of this movie has GOT to be the HUMOR. Now, if you're the person who likes silly and mentally insane faces as well as dated pop culture references, then this movie is for you. If you don't appreciate those kind of jokes in your SHERLOCK HOLMES movie, then you're normal. Despite taking place in 1800s London, the things that pass on for comedy in this film is (and I'm not joking either) TAKING SELFIES WITH THE QUEEN. Not only does it make no sense because photography back then was absolute garbage, but it's just not funny. When I saw the trailers for this film, I legitimately thought it was gonna be funny! But it WASN'T! And that made me MAD! Another thing that really sucked about this film was the acting. Despite Will Ferrell and John C. Reilly being a great comedy duo, they were EXTREMELY UNFUNNY in this film. Like I said earlier, there's a ton of annoying and obnoxious pop culture references that aren't even funny in the film, and the duo are responsible for bringing in 85% of this messy dump. And you'd think that although there's all these unfunny jokes that there'd at least be 1 or 2 that legitimately worked, but you're wrong! NOTHING IN THIS FILM WAS FUNNY! In fact, the funniest part of the film was the MPAA screen after the film! So the funniest part of the film wasn't even IN it! MY GOD!\n\nIn conclusion, don't watch this movie. It's horrible in every way. Just don't watch this. There's much better movies that you can get tickets to, like Bumblebee and Aquaman. And apparently, this movie is so bad, even NETFLIX doesn't want it! THAT should be on the POSTER of this film! Don't waste your time and watch a good movie instead."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "robglen",
        "review_rating": "1",
        "review_title": "Worst film I've ever watched.",
        "review_detailed_main": "I'll normally watch any old rubbish, but this is by far the worst film I've ever watched. This is probably the first time I've ever stopped watching a film before the end just because it was so bad. I can't understand how some people are giving it more than 1 star, they surely must be blinded by their fandom of Will Ferrell."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dilsonbelper",
        "review_rating": "1",
        "review_title": "Utter Utter RUBBISH!",
        "review_detailed_main": "This Movie had some laugh out loud moments ??????? WHEN WAS THAT! Did I miss that nano second, or was that the moment I decided to kill myself after watching this garbage for more that 3 minutes. 1 out of 10 is a high score for this IMDB needs to offer a minus rating for such rubbish as this."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "edavids22",
        "review_rating": "7",
        "review_title": "It's a good movie!",
        "review_detailed_main": "I don't care what these people say it is a funny movie and I don't see why people are making a fuss about it, I loved this movie with all its stupid humor. The people in the theater loved it too they laughed at every funny scene and there was no unhappy faces or people walking out. I think people just need to get a sense of humor."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "aronhowell",
        "review_rating": "2",
        "review_title": "Clearly a money-grab",
        "review_detailed_main": "I rated this 2 stars for the number of times I laughed. I knew that this was not going to be a Talladega Nights or Step Brothers but I expected some fresh, easy-going, down-to-earth humor. Instead you get stale plot and thoughtless politically driven jokes. I want to watch sports, movies, TV, or anything that stays away from politics. Whether you're left, right, or just don't care; watching something that steps away from politics would be refreshing and this movie sinks to the level of not so subtle jabs at political topics. Ferrel is a great comedian but this was just an attempt to put him back on our radars by appealing to trending \"hot button\" areas."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "gph-72176",
        "review_rating": "10",
        "review_title": "A laugh a minute",
        "review_detailed_main": "The reviews I've read about this film just go to prove you should never rely on others opinions, my gf and I thought it was funny all the way through, maybe the humour was aimed more at the English, if you like Ferrell and Reilly then watch it, in fact don't even read any reviews just watch it and make your own mind up....I like others would have probably given a 5 but because of the people giving a 1 I'm giving it a 10, just goes to show the rating system on here ain't worth s##t!!!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dickymail",
        "review_rating": "7",
        "review_title": "It's comedy, I laughed, so it did what it says on the tin.",
        "review_detailed_main": "Welllll, after reading all these incredibly negative reviews you'd think it was the worst film ever. Actually it's not, it seems that no one on here seems to get the humour at all. Or is it because I'm British? It was never going to be a work of art, or an Oscar contender. It's the re-pairing of comedy duo Ferrell and Reilly. You know what you're going to get. It's an out and out comedy, nothing more, nothing less. I laughed at quite a lot of it, some of the humour was standard, some silly, some of it hilariously subtle. Don't write this off, go see it, it's nowhere near as bad as all these reviews. 😁"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dude-93140",
        "review_rating": "5",
        "review_title": "Light-hearted nonsense",
        "review_detailed_main": "The low reviews on here say more about the IMDB crowd than the movie itself. Anyone reviewing this with one star is inaccurate and motivated by other influences.\n\nIt's a silly movie. If you enjoy watching Will Ferrell, you will probably enjoy this."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "michaelhollon1138",
        "review_rating": "1",
        "review_title": "Absolute Garbage",
        "review_detailed_main": "This movie is not even worth the fifty words IMDb is making me write in order to leave this review. Will Farrell and John C Reilly must have been fulfilling some sort of contractual obligation when making this stinking pile of hot garbage. An hour and a half that I'll never get back."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "chadk-45495",
        "review_rating": "1",
        "review_title": "Spectacularly, unspeakably abysmal",
        "review_detailed_main": "Simply put, the worst movie I've ever sat through in the theatre. I should have ditched my carpool and ubered home. After Talladega and Step Brothers, how did this happen? Words fail to capture just how dreadful and horrific this putrid dung heap is. It offends every human sensory faculty, even ones you didn't know existed. It represents the flogging, depantsing, humiliating, torturing, and eventual crucifixion of modern cinema."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "knconsulting",
        "review_rating": "1",
        "review_title": "More carp from Cohen",
        "review_detailed_main": "This guy generates more carp than a field of cows. Why does he keep getting hired?!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "andrewcuffcole",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "This duo has always been a classic for me, but for the first time in my life I need to write a review and warn people not to watch this movie Even stoned out of my mind, this movie could not entertain. Just not funny at all, it's like two terrible actors trying to make a movie showing how unfunny they are. Just a terrible snooze fest of a movie don't watch!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "shafiqflynn",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "The only way this movie could possibly be considered funny is if the joke was on me for paying money to watch it. Can I give it a negative rating?"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "katesch-40896",
        "review_rating": "6",
        "review_title": "Really not as bad as most think.",
        "review_detailed_main": "Seriously, if you like weird, slapstick humor, know anything about Sherlock Holmes and the late 19th century, you'll laugh more than a handful of times. Yes, there are dumb parts, granted, but some scenes had me rolling. It's enjoyable. If you don't want to go to the theater, rent it later."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "johnathanfatsie",
        "review_rating": "1",
        "review_title": "Immature Garbage!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "HrSookoll",
        "review_rating": "10",
        "review_title": "Masterpiece in many ways.",
        "review_detailed_main": "This movie is a parodie about Sherlock Holmes movies. And a damn good one. If you are fan of John C Reilly and Will Ferell (like i am) and a fan of Doyle and Holmes and Watson stories (like me), then this is a movie just for you (me!). Every joke and scene is a full joy and those mockings about previous Sherlock movies is very well succeeded. I laughed and had fun. Btw ive seen many Sherlock movies and series, saw many Reilly and Ferell ones, always looking like, are they fading... and have seen previous comedies about Holmes, they were not very funny, was hopin when will someone do a good and funny one. But now they did this and they did it, its a jackpot for fans and for them (and to myself). Only complaint i have is about the end. Why the end? When giving so much fun, who thinks about lets end this? This is not normal behaviour and someone should go to see a someone. If you are new to real comedies what can make piss in your pants, dont be disturbed, piss in pants durng a good comedie movie is ok, really, nobody can smell it coz others have piss in pants too. And its ok if your stomache hurts later. If not, then wasnt a good one. Trust me i know what im talking about."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "josh-antal",
        "review_rating": "7",
        "review_title": "Not the best but good",
        "review_detailed_main": "People need to relax! The exaggerated responses to a decent comedy are rather unnecessary. I enjoyed it. I love Will Ferrell movies and I love Sherlock Holmes. This was not the greatest comedy ever but it was funny.\n\nRelax people and drop the hyperbolic statements!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "joy-oliver",
        "review_rating": "1",
        "review_title": "Truly awful.",
        "review_detailed_main": "Well, I fail to see any humour in this truly awful film. I watched expecting it to be on a par with Step Brothers or Blades of Glory but was sorely disappointed."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "enigma-121-169812",
        "review_rating": "1",
        "review_title": "Ew",
        "review_detailed_main": "It is like watching an episode of Hoarders where they keep feces in a jar, but not as funny."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "smthedorf-71401",
        "review_rating": "1",
        "review_title": "Love Sherlock Holmes. Love most Will Ferrell movies",
        "review_detailed_main": "I could not like this. It was unwatchable. I made it 30 minutes. No laughs. Nothing redeeming. It was awful. Only movie I've seen worse than this was jack and Jill with Adam Sandler."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "flmp",
        "review_rating": "1",
        "review_title": "horrible boring and absolutely not funny",
        "review_detailed_main": "Simply not worth one minute, 3 people did not laugh one single time..."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "shaneisherenow",
        "review_rating": "1",
        "review_title": "A humorous take?",
        "review_detailed_main": "Yeah, no. More like a humourless take. This is one of the biggest embarrassments of 2018 and it's a huge trainwreck of a film. I would rather watch any of the Fifty Shades films. It's awful."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "driftdog",
        "review_rating": "5",
        "review_title": "Different!",
        "review_detailed_main": "Take your brain out, sit back and do not remotely think seriously or how it is so not Sherlock Holmes and doctor Watson. What it is, is a movie that is stupid, senseles and what! There are many real funny moments and it does sort of flow with a story. I have watched many movies and thought how I lost hours of my life but if you take it for what it is, it's ok."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "adamlockyer9",
        "review_rating": "6",
        "review_title": "Better than I thought!",
        "review_detailed_main": "There's no denying it that this movie is pretty bad but its that good bad, you know like Sharknado. Ferrell and Reilly's accents were shocking, acting was terrible and the plot messy. Although some of the jokes actually had me laughing out loud, especially the post drinking scene, where Downey's Sherlock was lampooned. No where as good as Step Brothers but it's still enjoyable, if I were you switch your brain off before watching, you might enjoy it too."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "gmchunt",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Normally love anything with Will Ferrell and John C Reilly, but I would have struggled to laugh if someone had offered me money to do so. And what is up with the audio dubbing?! It's like a badly adapted foreign language movie"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "waite-86788",
        "review_rating": "10",
        "review_title": "Love it!",
        "review_detailed_main": "Honestly, I don't get how everyone doesn't get it?! Love both of these guys and I died laughing! Huge fan of Will and John and the movie was pretty solid. Definitely not Step Brother but didn't expect it to be!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "steveruss2348",
        "review_rating": "7",
        "review_title": "They still have it!",
        "review_detailed_main": "Their chemistry still works. Just as funny as Talladega Night, not as funny as Step Brothers. We laughed through most of the movie. The song was weird, but I'll definitely buy it when the Blu Ray comes out!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "masoudhaghi",
        "review_rating": "1",
        "review_title": "I thought it was a funny movie",
        "review_detailed_main": "When I first heard about this movie with Will Ferrel, I thought it would be an awesome and funny movie. I was horribly wrong and for more than an hour I tortured myself to finish the movie. Basically It was an hour an half long unrelated lousy jokes with references to current society and daily struggles."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mcrodgers2-951-806414",
        "review_rating": "2",
        "review_title": "Lame, Unfunny and Disappointing.",
        "review_detailed_main": "So many talented performers and such potential. All wasted. All of the humor is juvenal and odd, but not odd in a funny way, just odd. The writing is awful and there is nothing clever, just one lame gag after another. I'm a big fan of Will Ferrell and John C. Reilly but not enough to like this unfunny mess."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "fbkathied",
        "review_rating": "1",
        "review_title": "Stupid",
        "review_detailed_main": "I was looking for comedy, not stupidity. I stopped watching after 45 minutes or so. There were several TRULY tasteless scenes that were just disgusting and really not funny."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "msemati06",
        "review_rating": "1",
        "review_title": "You know sometimes when something is so appalling and bad its good? This is so disgusting you will get nauseous and projectile vomit everywhere",
        "review_detailed_main": "You know sometimes when something is so appalling and bad its good? This is so disgusting you will get nauseous and projectile vomit everywhere! Its so impossibly disgusting and terrible I would beat the living hell out of these two goons with a stick if I run into them they wasted my evening!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "brown-phillip",
        "review_rating": "1",
        "review_title": "Absolutely one of the WORST !",
        "review_detailed_main": "NOT STEPBROTHERS or TALLADEGA NIGHTS! Not even close . Reading the mixed reviews, we decided we had to at least try this movie for .99 on ITunes . WRONG! We struggled to continue watching and finally gave up about 40 minutes in . Don't punish yourself, just say no!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "armanreysi",
        "review_rating": "1",
        "review_title": "A whole lotta mess",
        "review_detailed_main": "Why? Why would they do this\n\nWorst movie of the decade"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "stephaniesawula",
        "review_rating": "7",
        "review_title": "Silliness at its best",
        "review_detailed_main": "If you like previous films with these two you will not be disappointed. Very funny, do not be put off by the bad reviews"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "romancastillo",
        "review_rating": "1",
        "review_title": "Cringe-worthy",
        "review_detailed_main": "It'll make you laugh sometimes, but it's mostly cringe-inducing. I went in hoping for something ALMOST as good as the classics provided by Will Ferrel and John C. Reily. It's nowhere close. Don't waste your money, stay away"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "lkristallis-461-702906",
        "review_rating": "10",
        "review_title": "Get a grip quasiintelects",
        "review_detailed_main": "If you liked step Brothers and talatega nights then you'd like this one too. Period"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "thecore13",
        "review_rating": "7",
        "review_title": "As always, don't listen to the negative reviews",
        "review_detailed_main": "This is your typical Will Ferrell romp. You don't go in expecting an award-winning feel-good film of the year. Some of the reviews labeling this as the \"worst film ever\" or \"absolute trash\" clearly haven't sat through anything The Rock has put out this year. Or maybe the Rock is more their bag? Who knows. This doesn't deserve any of the bashing. I miss the days of actual decent film critiques, not whiny, arrogant reviews from 57 year old guys who just figured out how social media commenting works. This movie is actually funny, like a 6/10 Will Ferrell-kinda-funny. Some big, silly awkward laughs. Enjoy the movie for what it is. Not awful. Calm yourselves, haters. I hope someone hugs you."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "tommysmogorzewski",
        "review_rating": "1",
        "review_title": "Rather watch a documentary on paint drying.",
        "review_detailed_main": "The funniest part about this movie??? These reviews. Step brothers is one of my favorite comedies, and this movie may have ruined it for me."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "john-rr-coombes",
        "review_rating": "1",
        "review_title": "Drivel",
        "review_detailed_main": "Not at all funny, did someone actually read the script. I am amazed at it's 3.8 rating."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "husamhamdy",
        "review_rating": "1",
        "review_title": "Will Ferrell should be embarrassed from this garbage",
        "review_detailed_main": "I can't describe how bad this movie is, actually I left the theater after one hour because I couldn't stand it anymore. It's a feeling of anger more than boring, I was very angry because I waste money and time for this piece of garbage. Shame on them"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "garethhunter-55009",
        "review_rating": "1",
        "review_title": "Rubbish",
        "review_detailed_main": "Not funny, awkward and a waste of time, I lasted 30 minutes, I was being charitable because I loved them from step brothers"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "ajrgg3",
        "review_rating": "1",
        "review_title": "I would rather throw myself down stairs than watch this again.",
        "review_detailed_main": "Was expecting so much more from the step-brothers duo but they gave us pure S#!+. Dont waste your time or brain cells."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jcadrvr",
        "review_rating": "1",
        "review_title": "Embarrassing...sell out but Farrel",
        "review_detailed_main": "If I could give less than one star this movie would get it. Not because they weren't a few cheap laughs inbedded in an otherwise lackluster comedy, but because there are two good comedians who have done and know what good work is that totally sold out the people who pay good money to watch their movies. Everybody involved in distributing this movie should be embarrassed but most of all Will Ferrell should be heading back the money he took from his fans. I'd like to say it a different way, but in my opinion he knew well before he released it that this was a dog...same for Reilly."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "movieed1",
        "review_rating": "7",
        "review_title": "Comedic Genius",
        "review_detailed_main": "Don't understand the poor ratings. If one is a Sherlock fan, this spoof is sheer joy. Great set designs, costumes, acting.\n\nSpot on humor IF you are a lover of Sherlock Holmes flicks. The dialogue is well written and quite funny.\n\nNo one is expecting an Oscar winner here. Tight production, great camera work... The leads fly head first into their characters, something many don't do these days. Over the top fun, silly and tongue in cheek.\n\nTop notch supporting cast, and cameo's you can see and feel the cast and crew having fun!\n\nSure its too long, byt who cares? The talent is too good... 3/4 through the leads break in to well written 'broadway style' song... and it works!\n\nProducer Garcia always gices us great comedy...\n\nI guve it a 7 it will last the test of time...."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "andy-486",
        "review_rating": "1",
        "review_title": "Please don't",
        "review_detailed_main": "I don't write many reviews but when a film is as bad as this one it's necessary. I managed to sit through about 45m of it on Netflix but then had to turn it off. I like Ferrell but this is truly appalling with no redeeming features. The so called jokes are terrible, I think it's meant to be spoofing the Downey Holmes moves but falls flat on that front too."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "rewfilmmaker",
        "review_rating": "9",
        "review_title": "Serious sense of humour needed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "chasedover-74530",
        "review_rating": "7",
        "review_title": "It's silly and a fun time",
        "review_detailed_main": "I feel like the bad reviews are from people who wanted to either see this be step brothers 2 or another version of Guy Ritchie's Sherlock Holmes. I liked it I expected not to but it was funny. Stupid? Yeah 100% but not in a bad way. It won't take you back in time on an epic Sherlock mystery adventure layered with dry wit, clever comebacks, and plot twists, but if you want to laugh and not think you are more intelligent than the movie go see it. Everyone in the theater I was in was dying laughing."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "charming_movielover",
        "review_rating": "1",
        "review_title": "Really bad",
        "review_detailed_main": "Probably the worst Sherlock Holmes movie I've ever seen. It's probably the worst Will Ferrell movie too, but it's up there with Step Brothers. None of it was funny. It was just stupid. And it genuinely disrespected a great literary legend."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "pahvou",
        "review_rating": "1",
        "review_title": "Dissapointing",
        "review_detailed_main": "I have been anxiously waiting for this movie. I am death and need CC, hence I had to wait until it's was released to cable TV. Viewing the credits I mistakenly thought Ethan Coen was the writer/directer, which added to my excitement. Just imagine, Will Ferrell, John C Reilly and Ethan Coen. What an incredible combination, although what turned out to be incredible disappointment. I later discovered my first error. It wasn't Ethan Coen, but Etah Cohen. I was heart broken thinking one of the Coen brother's had written and directed this disaster. I didn't think it was possible. So you can imagine my relief it was some one else. But, there was still the question of Ferrell and John C. Reilly. What on earth would motivate them to be a party to such a disaster? And it was a disaster. From the beginning to the ridicules scene where Watson and Homes were at the morgue, were I quickly turned it off."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "privatelyed",
        "review_rating": "2",
        "review_title": "Um, no!",
        "review_detailed_main": "After an early scene with a mosquito (which took a good five minutes of wasted air time) I knew, jolly good, to fast forward to the final five minutes already..and that was that."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Prismark10",
        "review_rating": "1",
        "review_title": "Not got a clue to make you laugh",
        "review_detailed_main": "Holmes & Watson is a silly, outlandish slapstick comedy that also goofs the Robert Downey Holmes movies. It even pokes fun at Trump. Make England Great Again!\n\nThe problem is there have been better comedic takes on the Sherlock Holmes stories such as Without a Clue.\n\nHolmes & Watson is just a race to the bottom of the barrel. It is an ill conceived and unfunny movie.\n\nThe film begins at the trial of Moriarty (Ralph Fiennes) where all the witnesses have mysteriously failed to turn up. Holmes turns up at the last minute and gets Moriarty released.\n\nOfficials from Buckingham Palace hires Holmes as there is a plot to kill Queen Victoria (Pam Ferris) in four days time. The possible suspect is Moriarty. The final action scenes take place during the launch of the Titanic.\n\nFerrell and Reilly are saddled with an idiotic script and terrible direction from Etan Cohen. Ferrell mugs relentlessly to the camera and the film has no clear focus as to what kind of comedy it wants to be."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "FozzyRFC",
        "review_rating": "1",
        "review_title": "***DO*** believe the reviews, really really!",
        "review_detailed_main": "This is an absolute shocker of a movie. Not funny, bad acting, bad script, bad characters, messy direction and painfully outdated humour. Avoid at all costs, there is not one redeeming feature."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "fishermanhossmk",
        "review_rating": "1",
        "review_title": "Truly disappointing!",
        "review_detailed_main": "I have never written a review on IMDb. But this move was truly disappointing. I am a massive Will Ferrell fan. I have enjoyed every one of his movies (even Land of the Lost and Casa de mi Padre). But this movie was truly unfunny. I historically, as my wife and friends tell me, laugh at everything. However, I only laughed once during this entire movie, and I forced myself to do so. I really wanted to love this movie, as I have loved everything that Will Ferrell has put out. I even found ways to call Zoolander 2 enjoyable. But this was painfully unfunny. I can only think that Ferrell was somehow contractually obligated to make this picture. As excited as I was to see another Ferrell and Reilly \"masterpiece\" (Talladega and Step Brothers are both in my top 10), I really hope they find another script worthy of their talents and chemistry. Save your money, see something else."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "skylersimpson-70795",
        "review_rating": "7",
        "review_title": "Not step brothers or talladega but still pretty funny...not sure why everybody hated it.",
        "review_detailed_main": "I saw this movie with my family on Christmas and none of us left the theater disappointed. We weren't blown away or anything. There wasn't a plot that left us in awe or anything like that but I wasn't really expecting one. For all the people who left 1 star reviews calling it the worst movie they've ever seen...not really sure what kind of expectations they were walking into this movie with. I was expecting a Sherlock Holmes spoof that made me laugh and it delivered on those expectations."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Holmes & Watson",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "possum-18733",
        "review_rating": "9",
        "review_title": "It's not as bad as people say",
        "review_detailed_main": "Don't get me wrong, it's not for everybody but it has some funny scenes. I liked it and I'm sure others did too"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "stephenmillerbenjamin",
        "review_rating": "7",
        "review_title": "Good stuff. I guess people hate it because it's not stepbrothers?",
        "review_detailed_main": "I thought it was really funny. It didn't try too hard. It was just a couple guys having fun and being silly. Really don't understand the hate. Best comedy of the year"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "brian1989-366-644029",
        "review_rating": "1",
        "review_title": "Surpise, It Was Absolutely terrible",
        "review_detailed_main": "*no spoilers* Went in having watched many of Ferrell and Reilly's past films knowing/believing most of them to be very funny. This wasn't even close to anything they have made in the past. It was written terribly, the story line had too many characters that weren't properly introduced, there was audio issues with words being spoken and mouths not moving, the accents were bad and weren't funny, and the movie had too much political bs in it.\n\nBut my biggest issue was the political statements made in the movie. I don't care if you're Right/left/middle when it comes to politics...movies, especially comedy, is what people use to escape. An evening to just relax and have fun. This movie was used to poke fun with an agenda that some agree with and some don't agree with that had literally nothing to do with the plot or story line. Pathetic.\n\nMy favorite comedy duo has seriously let me down. This movie wasn't comedy, it was garbage."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jtindahouse",
        "review_rating": "2",
        "review_title": "Close to the worst movie I have ever seen",
        "review_detailed_main": "When you consider the chemistry we know Will Ferrell and John C. Reilly have based on their previous work together, it is almost an impressive feat to make a film this bad starring those two. I've seen some unfunny comedies in my time but it is hard to remember one as terrible as this. Absolutely nothing worked. I kept thinking to myself, what kind of screenwriter wrote this and actually thought it would be funny? How can you think picking up a child's turtle and throwing it as far as you can would ever be worthy of a laugh?\n\nWill Ferrell just can not make a good movie lately. He hasn't made a good one since 2010 with 'The Other Guys'. Considering he was undoubtedly the funniest actor working through the 2000s that is quite astonishing. What went so painfully wrong in his career? He doesn't seem to have the same enthusiasm he had back in the early days. Maybe his love of the industry has dissipated, but whatever the reason is he needs to either turn it around quickly or retire because he is seriously ruining his once epic legacy.\n\nEven if 'Holmes and Watson' wasn't going to be funny they could have at least put a mildly interesting mystery case into the movie to keep it watchable. But nope, apparently not. A 5-year-old could have come up with the plot they chose to use in this film. I'm not exaggerating when I say this was close to the longest 90 minutes of my life. I have never wanted a film to be over so badly.\n\nWere the leads hampered by a PG-13 rating? Possibly, yet that is still no excuse to not even have one funny gag (or even line) in the entire movie. What exactly attracted the two lead actors to take on this project I wonder? Then, as if the film couldn't get any worse, in the last quarter of the runtime they randomly decide to start throwing in some subtle (by which I mean not subtle at all) attacks on President Trump (don't even worry about the film being sets in the 1900s). It is very rare that I ever give a film a rating as low as 2, but there was simply no other option for this abomination. Stay well clear of this one."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "cinemawithcj",
        "review_rating": "1",
        "review_title": "Holmes & Watson - Cinema with CJ Review",
        "review_detailed_main": "Holmes and Watson does not offer high hopes going into it. The film currently sits at 6% on Rotten Tomatoes and at one point had the dreadful honour of being completely at 0%.\n\nWatching it confirms the fact that it is entirely rotten. Which is an absolute shame. Will Ferrell and John C. Reilly are comedy greats and usually together their humour is multiplied...but clearly the problem lies in the script and direction.\n\nBoth duties fall under Etan Cohen, not to be confused with Joel and Ethan Coen and definitely not to be confused with Joel Cohen, writer of Garfield. Of all the Coen/Cohen's in Hollywood, we've found our Paul W.S. Anderson equivalent.\n\nPreviously the filmmaker behind Ferrell vehicle Get Hard, it's amazing to see someone get worse, particularly this worse.\n\nHolmes and Watson has all the trappings of a Sherlock Holmes story and all the trappings of a potentially great comedy handled with the grace of the Running of the Bulls through the World's Largest China Shop. So inefficient and unfunny, it's definitely not great when you look around at the silence caused by the severe lack of jokes in the minutes before the opening credits (except one person in my screening, but there's always gonna be one intergalactic alien trying to fit in as a secret human).\n\nThe film is severely bland and lacking, full of choices that seem completely misguided. Ferrell decides to put on a strange accent for Holmes that doesn't work at all, and Reilly's Watson is overly and unfunnily violent, yet these are choices never dissuaded by the director, which is concerning.\n\nHolmes and Watson has a story, if you can believe that, one where Moriarty (played by the criminally underused and probably overpaid Ralph Fiennes) has a presence, but is harshly pushed to the side in favour of an invisible antagonist you can figure out by spoilers by billing.\n\nOn a completely unrelated note, Kelly MacDonald is in this movie and she continues to be brilliant and brilliantly Scottish in the things that she makes, and while her character is there for a bunch of anachronistic jokes and pushed to the side too, when her arc thins out it feels like it was a good idea made sour at the drop of a hat.\n\nSomewhere, in this movie, there is a joke. I guess. I hope. Much like A Million Ways to Die in the West and other films of that ilk, the only thing that made me laugh was a heavy reference to a much better film that had humour in the fact it took you completely out of the movie you were watching, because it's safer.\n\nHolmes and Watson is a hollow entry to round out the year of comedy movies. Alan Menken and Glenn Slater offer the second closest thing to a joke with an original song that's a parody of their work that's nothing compared to Vanelope's \"I want\" song parody in Ralph Breaks the Internet.\n\nEverything in this movie has been done better and bigger and funnier and smarter. Hell, even the overrated later episodes of BBC's Sherlock itself parodies itself better, even down to a drunk Sherlock scene that doesn't have to stoop so low as this movie does for an attempt of a laugh.\n\nIt joins a bunch of movies I would give no stars to if I could, but the sheer fact that somehow this movie made it from conception to the silver screen is some sort of commendation. Plus it has a Titanic joke that makes no sense, but it makes more sense than the entirety of the film.\n\nAnd before you say something, yes, the majority of jokes in this film are indeed out of time. And out of this world.\n\nWhich is not a good thing.\n\n1 Star."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Irena_Spa",
        "review_rating": "1",
        "review_title": "Shame",
        "review_detailed_main": "It was a ridiculously spending too much money for making a garbage. Probably the director/writer Cohen tried to mock tv show \"Sherlock\", especially for those mathematical geometrical shapes and counting answers, but it doesn't mean anything to us, viewers. Maybe the only acceptable part of the movie, which is a very small one, is that one where they are singing, but even the lines of that song aren't worth listening. So, the whole movie is nothing."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "cristi_holdunu",
        "review_rating": "1",
        "review_title": "Don't know why Will Farrel keeps making movies",
        "review_detailed_main": "I generally avoid the movies he does, but I think this one deserves the golden raspberry award."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "zanesione",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "Tried to watch this on 2 seperate occasions and got 30mins in."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "rkehler3",
        "review_rating": "6",
        "review_title": "Great cast, not so good script - again",
        "review_detailed_main": "Just like Coen & Ferrell's last collaboration, Get Hard (2015), this film has a great cast, but not so good script. The comedy is generated from the chemistry and talent of the actors, and very sparingly from the writing or director's chair.\n\nFerrell has a pretty good track record on buddy comedies (especially with Reilly), Coen is now 0-for-2 with Ferrell. For the sake of their careers, I hope there is no third attempt."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "reinera-78896",
        "review_rating": "1",
        "review_title": "Dumb and cringey",
        "review_detailed_main": "Somehow still manage to bring up Trump even tho it's the 1800s. Nobody in the theater was laughing, never was so close to walking out of a movie."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "donnadriver",
        "review_rating": "10",
        "review_title": "Ya gotta laugh...",
        "review_detailed_main": "I love Will Ferrell and John C Reilly, and I am a Sherlock fan, so when I heard this movie was coming out, it was a no-brainer: I had to see it! Prior to going to see Holmes and Watson, my husband checked the reviews, and found most of them declaring \"thumbs down\", but, hey, EVERYONE I knew LOVED the Titanic movie when it came out, but by the time the main guy in Titanic was going under for the umpteenth time I was ready to push him down myself, so I chose not to judge the Holmes & Watson movie through comments... as I'm sure 'you' are wise enough to do. So, we went, and we laughed, and we got the jokes, and we got the sarcasm, we even got the \"TRUMPed\" remark, and we laughed again. The easily offended may walk away with their noses in the air, but we got the humour, and we laughed again! Needless to say, we're still Ferrell, Reilly, Holmes and Watson fans!\n\nI must say, Ralph Fiennes plays his part so well! The accent he uses stunned me; I never expected that accent to come out of his mouth. I loved it! :D Well done, Mr Fiennes!\n\nAnd Kelly Macdonald!! Good call for Mrs Hudson. It was weird hearing her real accent, lol, but she was great, too!\n\nHugh Laurie, Pam Ferris, Rob Brydon, and Steve Coogan... What can I say; I love them all!!!!!!\n\nAll in all, a great cast, good plot, and a funny movie! I am hoping there will be a second one!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "WatchAndSmile",
        "review_rating": "7",
        "review_title": "Great FUNNY Comedy!!! Don't read reviews of old grumpy people!!",
        "review_detailed_main": "I haven't read any bad reviews that actually coherrently stated why. Those old people or those with no sense of humor expected some kind of kid comedy - I guess they failed to understand this is a DARK COMEDY. It made fun of English people, America, traditions,etc and that's pretty much why those people hated it. Feminists hated for the female jokes. Trump supporters didn't appreciate the stab at the current boy in charge... and English people got very angry for all bellow the belt English jokes ( which are hilarious!!!)\n\nLighten up people. Learn to understand what dark humor and comedy is! If you look pass all the politics and just enjoy the subtle humor, you will LOVE this funny movie! It is very funny. It won't win awards, but it will make you smile if you are into that kind of stuff. In the last couple years FAR FAR worse comedies were rated twice as high and the current rating is just FAKE because of all the people with no sense of humor who brought politics into their reviews.\n\nEnjoy!!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "ronbell-23984",
        "review_rating": "1",
        "review_title": "This is bad movie",
        "review_detailed_main": "It's terrible it really stinks badly. The jokes they try just don't come off at all.\n\nIf you are looking for a comedy Sherlock Holmes movie, look up Without a Clue, it's from 1988 and very funny, everything this movie isn't."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "williamsonandcompany",
        "review_rating": "1",
        "review_title": "Worse movie of all time",
        "review_detailed_main": "What the heck were they thinking? You can't take two decent comedy actors like this and just make a movie, you have to have scripts and better film crew and director. The current political jabs were also in called for and really makes me disappointed in these two actors for adding that to their movies. Plot horrible, acting atrocious, and overall was equal to my worse movie of all time - \"Eaten Alive\""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mgmnak",
        "review_rating": "1",
        "review_title": "Will Ferrel & John C Riely lose their Midas touch",
        "review_detailed_main": "No. No. No. This is abysmal to watch. This kind of slapstick comedy has no room in 2018/19.\n\nIf this is what a 42 million dollar production gets you then I feel for the state of the SONY Executives that signed off on this.\n\nFor a movie this bad, there are totally no \"So bad they are good/funny\" moments. The opening 20 minutes feel like an eternity and I'm afraid this is the last Will Ferrell movie I'll be watching moving forward!\n\nTerrible terrible movie."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dschuster-43709",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": "Most definitely one of, and quite possibly the worst movie I've ever seen. It is not hard to believe at all that theater goers walked out of this one"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "amblerb58",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "I just didn't find it funny at all. Look, im not going to qualify my opinion with crap about how long I've been watching movies or how highly you should regard my sense of humour above all others. I'm just an average guy who, like many of you just likes movies and enjoys a good comedy. Its why i went to see it. But, i didn't find it funny. Not one bit. I was bored throughout. I can honestly say it was the poorest effort of a comedy that i have had the misfortune to sit through. Its only my opinion though.\n\nOne thing though, i have noticed more than one 10/10 reviewer admit that it wasn't worth a 10, but they felt compelled to balance the ratings. Please don't. Give it what you think it deserves and let it stand. If its as good as you think, it will become a cult classic, like so many underrated movies from before."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "FelixOneDE",
        "review_rating": "5",
        "review_title": "A Comedic Take on the Iconic Detective Duo with Mixed Results",
        "review_detailed_main": "\"Holmes & Watson,\" directed by Etan Cohen, is a comedic interpretation of Sir Arthur Conan Doyle's famous detective characters, Sherlock Holmes and Dr. John Watson. While the film attempts to blend classic Holmesian mystery with modern humor, the result is a hit-and-miss affair that struggles to find a consistent comedic rhythm.\n\nWill Ferrell and John C. Reilly star as Sherlock Holmes and Dr. John Watson, respectively. The duo, known for their chemistry in previous collaborations, bring their signature style of humor to these iconic characters. Ferrell's over-the-top portrayal of Holmes and Reilly's bumbling yet earnest Watson are clearly intended to be parodic, but the execution often falls flat, missing the mark in terms of comedic timing and effectiveness.\n\nThe film's premise, which involves Holmes and Watson solving a murder mystery to prevent the assassination of Queen Victoria, sets the stage for a series of comedic escapades. However, the humor is largely reliant on anachronistic gags, slapstick comedy, and modern pop culture references that feel out of place in the Victorian setting. While some jokes land successfully, many others feel forced or overly silly, lacking the wit or subtlety that might have made them more effective.\n\nSupporting performances by actors such as Ralph Fiennes as Moriarty and Rebecca Hall as Dr. Grace Hart add some charm to the film, but their talents are underutilized. The characters are not given enough development or screen time to make a significant impact on the story or the comedy.\n\nVisually, the film does a commendable job of recreating Victorian London, with detailed set designs and costumes that capture the era's essence. However, these aesthetic accomplishments are often overshadowed by the film's inconsistent tone and humor.\n\nThe screenplay struggles to balance the homage to Sherlock Holmes with its modern comedic aspirations. While the idea of a humorous take on the detective genre is promising, the film's execution lacks the cleverness and creativity needed to make it stand out.\n\nOne of the positive aspects of \"Holmes & Watson\" is its willingness to be unabashedly silly and lighthearted. The film doesn't take itself too seriously, which may appeal to viewers looking for a simple, escapist comedy. However, for fans of Sherlock Holmes or those expecting a more intelligent or witty interpretation of the characters, the film may be disappointing.\n\nIn conclusion, \"Holmes & Watson\" is a film with a novel concept but uneven execution. It's a comedy that swings for the fences but often misses, resulting in a final product that is a mixed bag of laughs and misses. It earns a 5 out of 10 for its effort to bring a new comedic twist to the world of Sherlock Holmes, even if it doesn't fully succeed in delivering a consistently entertaining or memorable film."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "view_and_review",
        "review_rating": "6",
        "review_title": "Ricky Bobby Holmes and Cal Naughton Watson",
        "review_detailed_main": "So, if you've seen Talladega Nights then you've seen Holmes and Watson. Will Ferrell and John C. Reilly fall into familiar roles as superior and subordinate but instead of Ricky Bobby and Cal Naughton Jr. they were Sherlock Holmes and Dr. Watson. That's not to say there were no laughs, in fact I laughed plenty, it's just very unoriginal. Now, you may say, \"Of course it's unoriginal. It's Sherlock Holmes.\" That's not what I meant. I mean the fact that they fell into the same type of roles and antics as Talladega Nights made it unoriginal. Add to that an odd musical number out of nowhere and it kind of leaned toward flop status.\n\nI'd say that what saved it were the frequent references to current popular issues such as selfies, women's equality, and our current president. They worked those jokes in there in an overt yet clever way such that you couldn't help but laugh. The overall product lacked distinguishability but Ferrell and Reilly were silly enough to bring about just enough laughs to prevent a fail."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dan_slentz",
        "review_rating": "1",
        "review_title": "Ranks as one of the WORST movies EVER! (I walked out after 1 hr 15 min!) NOT funny!",
        "review_detailed_main": "Ferrell and Reilly can make some funny movies.. but OMG, was this thing even written out as a script of did they just wing it? There had been about 3 movies I considered \"no redeeming quality\".. until I saw this. Now.. there's 4! Might just be me, but I thought comedies were supposed to be funny. John Reilly is actually a talented actor (from Gangs of New York to Chicago to The Aviator, and What's Eating Gilbert Grape, and more), so I have to assume the writing and directing on this just were simply awful that he couldn't make this thing NOT stink! Ferrell certainly CAN be funny, but this sure probably was his worst movie yet (and yes.. the guy has had some bad movies.. AND some really funny movies too!) I think movie studios should start offering refunds for people who don't like the movie. If they did, this would honestly be the 4th movie I'd ever want a refund for seeing! (Guess the saving grace is it's 1 hr 30.. though I wasted 1 hr 15 min). Movie: Painfull UN-funny!!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "dariutamariuta",
        "review_rating": "9",
        "review_title": "Really good",
        "review_detailed_main": "Big fan of all Sherlock films and series. This was very funny and interesting, actors were very good. Recommend watching this."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "ruan-pretorius30",
        "review_rating": "1",
        "review_title": "Even worse than Ghostbusters (2016)",
        "review_detailed_main": "The headline speaks for itself...\n\nUnfunny, ungoofy, un-anything, despite the gratuitous cameos of A-listers"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "bjcoleman35",
        "review_rating": "2",
        "review_title": "Best Way to Watch this Movie",
        "review_detailed_main": "Best way to watch this movie is to not watch it at all. A big swing and a miss from the guys that brought you Step Brothers and Talladega Nights.\n\nAWFUL"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Lam0nt",
        "review_rating": "1",
        "review_title": "Complete GARBAGE",
        "review_detailed_main": "I literally created an account so I could review this \"film\". It has no real storyline, no real humor and no real point. If it would have at least TRIED to keep the same formula as previous films these 2 have done, it would have been much better. The whole film is a series of one liner, crass toilet humor that isn't even funny. Could have been great but was complete trash."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "ubtgkse",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "This movie is one of the worst with a story that is just event after event with no Ryme or reason, really bad acting (mainly will Ferrell), waste of Ralph finnes who is given nothing to do, an ending that makes no sense, and jokes so awful that other bad comedy's look like Monty python in comparison. A complete travisty of a movie that the biggest mystery in it is why was it made and why did I waste my time and money on it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "nevada-689-627700",
        "review_rating": "1",
        "review_title": "Hideous film. Complete insult to a speck of intelligence",
        "review_detailed_main": "This film was made for money. Nothing else. As stupid as it gets. Total waste of time. Burning my money would have felt better than the experience of sitting through this garbage on Christmas"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "sanduemil",
        "review_rating": "1",
        "review_title": "Worst movie I have seen in the last 15 years!",
        "review_detailed_main": "There should be a movie police, that can arrest and send them to a movie court, where a critic aka movie judge can charge them for conning the public and the movie industry. I want my 8 dollars back please"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "imseeg",
        "review_rating": "7",
        "review_title": "Hilarious fresh new take on a wornout detective genre. Hilarious American duo slaughters every bit of sacredness about Sherlock Holmes. And they slaughter it with great wit!",
        "review_detailed_main": "Incredibly UNDESERVED low Imdb rating. Probably due to the politically INCORRECT jokes about feminism, trump, childviolence etc etc. But all the (possibly) offensive jokes are being done with lots of originality, tact and charming wit.\n\nThe other reason why it has such a low Imdb rating could be due to the wrath of the (older adult) english speaking audience who cant stand to watch 2 American actors slaughter every bit of sacredness of the english heritage of Sherlock Holmes. And that sacredness of Sherlock Holmes DOES GET SLAUGHTERED. Bravo! It needed to be slaughtered, to make a fresh new start. To bring back new life to this Sherlock Holmes detective genre, which was nearly bled to death with boring remakes.\n\nIt is an actor's movie, and I mean that very complimentary. However silly everything may get, there is still lots and lots of good acting to be enjoyed by leading and suporting roles. Ralph Fiennes has a great suporting role and so do many other great English actors.\n\nEverything is pretty farcical, but executed with great attention for detail and with marvellous jokes and good acting.Yes, some of the jokes are obnoxious (vomitting, childviolence) but it is done in a very funny way and the obnoxious jokes are only used sparsely. I cant see any fault with this refreshing slaughter of the \"sacred\" Englishness of Sherlock Holmes."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "peter-16563-61664",
        "review_rating": "1",
        "review_title": "Burn your money, or dig a big hole in your backyard",
        "review_detailed_main": "This is the movie you'll watch on Stan in six years time then 10 minutes in you'll decide to watch ANYTHING ELSE, or go and dig a big hole in your backyard.\n\nSave your money, or do something more useful with it, like burning it for heat!\n\n\"Does this review contain spoilers\" IMBD asks!!! Bahahahaha Yep, I call it the worst, most unfunny boringly cheap cinema ever produced."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "marcushopper",
        "review_rating": "9",
        "review_title": "Terrific!",
        "review_detailed_main": "Loved all the politics! Especially the TRUMP jokes, and American gun jokes. This is equally as good as other films. The talledega brothers have down it again. Didn't even need popcorn for this one. Just a hot soda."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "claber",
        "review_rating": "",
        "review_title": "Worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "zardoz-13",
        "review_rating": "7",
        "review_title": "Elementary Nonsense in Varying Degrees of Lunacy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "paulkeegan-32227",
        "review_rating": "1",
        "review_title": "After this film, my Fiancée looked at me and said \"I didn't know a film could be so bad\".",
        "review_detailed_main": "I'll begin at the end; upon leaving the screening of this movie, I was reduced to one word, \"Wow\". I was genuinely staggered by the fact that such a floating turd of a film had somehow managed to hustle itself a cinematic release.\n\nUntil December 27th, 2018 I was of the opinion that I would watch Jon C Reilly in absolutely anything, \"Holmes & Watson\" proved me wrong.\n\nSteve Coogan, Rob Brydon, Rebecca Hall, Pam Ferris, Ralph Feinnes, Hugh Laurie and Kelly Macdonald will all have to wake up every day for the rest of their lives, knowing that they had a hand on this film, the stink of which must cling to them like metaphorical sh#t to a blanket.\n\nSir Arthur Conan Doyle received a writing credit for this film. I just checked; he doesn't have any living descendants who could try to have this black mark expunged from his career."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "danny-prichard",
        "review_rating": "1",
        "review_title": "Horrendous",
        "review_detailed_main": "The only reason I rated this move a 1 out of 10 stars is because negative numbers aren't available. I didn't crack a smile let alone laugh. Will Farrell's flicks just seem to get worse and worse as he plays the same character over and over again. John C. Reilly is a very good actor who for some reason keeps teaming up with the over-the-hill Farrell. The result was this unfunny, irritating mess. The only good thing I can say about this movie was it was only around an hour and a half. Mind you, an hour and a half too long but still, a short movie by today's standards. This is only the second review I've felt compelled to write but this movie was so bad I just had to tell someone. If I had it to do over again I'd watch \"Planes, Trains, and Automobiles\" for maybe the tenth time. Somewhere along the way great comedies, or even adequate comedies, have become a thing of the past."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "sp4wn3r",
        "review_rating": "1",
        "review_title": "Wtf???????",
        "review_detailed_main": "Huge fan of both actors , i really loved their type of humor but this movie is just pure garbage, its embarrassing awkward and stupid"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Horrendous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mrpaskie",
        "review_rating": "1",
        "review_title": "Utterly appalling, don't bother",
        "review_detailed_main": "How on earth did this get made?! Its so bad it's just mind boggling - they must have paid Ralph Fiennes a mountain of cash to ruin his legacy..."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "tonyandsilvia1994",
        "review_rating": "1",
        "review_title": "Abysmal",
        "review_detailed_main": "This is, without doubt, the worst movie I have ever seen. How the heck can a film with Will Ferrell and John C Reilly be so joyless? It would be funny if you're 6 years old, but I don't suppose it's aimed at 6 year olds when it has a brilliant Kelly Macdonald's character as a sex worker.\n\nEveryone involved should be thoroughly ashamed of themselves., and that includes the wonderful Pam Ferris."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "etann-36707",
        "review_rating": "1",
        "review_title": "This just came on TV and found it unwatchable",
        "review_detailed_main": "Had to turn it off about 1/3 the way through, it was one dud joke after another and it was just Will Ferrell hamming it up and ignoring any sense of story. It's just him being himself but it didn't work here. And John C. Reilly who's a much better performer couldn't hold this thing together and you can genuinely see him trying to make the effort.\n\nIt would have been funnier if the story was about a man trying to play Sherlock Holmes in a play and failing miserably at it.\n\nI'm sure the outtake reel is full them endlessly breaking character having more fun making this movie than anyone ever will watching it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "fluffchop",
        "review_rating": "7",
        "review_title": "Very funny",
        "review_detailed_main": "Even in the sourest of moods one may fine solace in this movies' comedy. You will laugh dammit!!! I would love to see a sequel to this. The bit with the Queen at Holmes place. Omg. I just laughed."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mercatura-33267",
        "review_rating": "5",
        "review_title": "Not the greatest, not the worst!",
        "review_detailed_main": "It was ok, I watched it in one session and it even made me laugh a couple of times. Chewing gum for the eyes, not death by a thousand cuts like some people make it oit to be. It was moderately entertaining. So what if the acting was not all that great and the editing was a bit off, who really cares? It is about entertainment and this entertained me for an afternoon. Fun to see some well known actors pop up now and then, like Steve Coogan, he always makes me laugh. At the end of the day it isn't something I would watch again and I will forget all about it soon enough but it wasn't the big pile of poo some people were going on about it. Bunch of whingers, go and watch something else. Just because you don't like it you don't have to score it '1' for goodness sake. Idiots."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "amreltaweel",
        "review_rating": "10",
        "review_title": "Those who love Anchorman 1 and Zoolander 1, will LOVE this movie!",
        "review_detailed_main": "A very very funny, classic Will Ferrell movie.. Those who understand and appreciate the comedy style of comedians such as Will Ferrel, Andy Samberg, will definitely love this movie. I sincerely recommend"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "PurpleProseOfCairo",
        "review_rating": "7",
        "review_title": "Whatever remains, however improbable, must be FUN!",
        "review_detailed_main": "Never mind the cynics, make your own mind about this. I'm not a huge fan of Ferrell - he can be terribly self-indulgent (and there are elements of that here), but when he gets it right he is very funny. Reilly is always good value. They make a great team in this, with some real belly laughs resulting (the accents especially made me guffaw - pronunciations reminiscent of the Gendarme in Brit sitcom 'Allo 'Allo!) The plot is satisfying with a couple of neat surprises and a really good ending/coda. It's exceedingly silly, knockabout fun. Put your brain in neutral and enjoy."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "kevind-64288",
        "review_rating": "1",
        "review_title": "Unwatchable.",
        "review_detailed_main": "Most awful movie I've seen these actors do. Idk how anyone thought it was a good idea to release this.. no respect."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "tattaglia2001",
        "review_rating": "1",
        "review_title": "Soooo Bad",
        "review_detailed_main": "Why spend money on this film. It would be better used in a charity."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "joaquinortiz-54737",
        "review_rating": "1",
        "review_title": "Very awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "robcartwright-26034",
        "review_rating": "1",
        "review_title": "Plain awful",
        "review_detailed_main": "Waste of time.\n\nNot funny.\n\nDon't bother. You will regret it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "ameliajanetaylorhall",
        "review_rating": "2",
        "review_title": "kelly macdonald is the only good thing about this film",
        "review_detailed_main": "Kelly macdonald was the only reason i watched this and remains that way. So bad."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "tomlinsonj",
        "review_rating": "1",
        "review_title": "Abysmal",
        "review_detailed_main": "What an epic letdown. The plot was a mess, the jokes weren't funny (save three or four), and the political humor was polarizing and weak."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "cuackete",
        "review_rating": "",
        "review_title": "You don't wanna know...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "simonhilling",
        "review_rating": "6",
        "review_title": "Really not THAT bad!",
        "review_detailed_main": "After reading a whole bunch of bad reviews on IMDB, we nearly didn't go to see this film but we'd already booked the tickets so went anyway. Glad we ended up going to make our own minds up instead of listening to the other cretins, just jumping on the bandwagon.\n\nWhile this isn't a patch on Step Brothers or Anchorman it's not bad and worth a watch if you usually like this kind of film, even if it's just the one viewing. Plenty of funny cameos and enough laughs."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "TheMovieDoctorful",
        "review_rating": "1",
        "review_title": "Just As Bad As It Looks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "ccarpenter-87742",
        "review_rating": "9",
        "review_title": "Loved It",
        "review_detailed_main": "I loved this film and non-stop laughter in the movie theater."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "cheriesuv",
        "review_rating": "6",
        "review_title": "Not nearly as bad as people are saying",
        "review_detailed_main": "Yes, this movie isn't that great. But it's only an hour and a half, and there are a few laughs and some funny jokes. I saw Howard the Duck in the 80's, and a movie called \"Coffee and Cigarettes\" in the early 2000's, and those are way way ahead of H&W in the \"worst movie ever made\" sweepstakes. The worst thing about this movie is Will Farrell. He is so unbelievably unfunny that he pretty much ruins anything he's in. But if you ignore his lack of talent, you'll find the rest of the movie is rather funny. I laughed a number of times."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "larryham-74581",
        "review_rating": "1",
        "review_title": "One of the worst movies ever made",
        "review_detailed_main": "I'm a huge Will Ferrell fan and have watched his previous works many times over, but he should be ashamed of himself for allowing this trash to be produced. It's worse than just bad acting, plot, directing, etc. It seems to be an attempt by writers to find a way to trash the president and the country and somehow make a movie about it. The entire theater was silent with virtually no laughs produced at all. At one point I found myself almost falling asleep as I kept looking at my watch waiting for this wreckage of a film to end. It's my sincere hope that everyone involved loses money so that such trash is never produced again. I paid $12.50 for a ticket and almost want to take the producers to small claims court to get it back, it was that bad! Not only should you not go to theaters to see this, you should avoid it at all costs even when you can see it on netflix for free."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "lwmswm",
        "review_rating": "1",
        "review_title": "Stinks",
        "review_detailed_main": "Think of the worst thing you have ever smelled. Now multiply it by a trillion. This movie stinks worse than that. I'm tired of Hollywood thinking anyone wants to be subjected to politics when they pay their hard earned money to be entertained. This movie should come with a warning: Not Funny, Not Satirical, Boring, Political. They should pay people to watch it, not the other way aro."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "bartmoser2",
        "review_rating": "1",
        "review_title": "Bored",
        "review_detailed_main": "Hardly anyone in the theater laughed at this. Boring."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "optechfortyeight",
        "review_rating": "1",
        "review_title": "No word in the english language to describe how bad",
        "review_detailed_main": "I wont call this a movie. It is something from the trenches of the most vile mindnumbing, brain cell killing place.\n\nI wont give a review here. Just a warning to please leave this page and dont even concider it. Please, i implore you dont see this, this is probably what the people saw in birdbox"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "acdc_mp3",
        "review_rating": "1",
        "review_title": "Jumpin' Jesus and Mary in a sidecar! What a fecal pile this movie was!",
        "review_detailed_main": "My wife and I watched it yesterday to a packed house. A house packed with vacant space. This should have warned me that the next 90 minutes was going to be minutes I am going to lose forever and have nothing valid happen other than reclining in the comfy theater chair and know my wife is by my side suffering with me.\n\nThe best thing about this movie was the questions it brought up such as \"How did this script ever get a green light for production???\" \"What horrible secrets do the producers know about Will Ferrel and John C. Reilly for them to sign onto this movie???\" and \"Did we really just blow $16 to recline comfortably and absolutely no other reason?\" These questions and many others are what actually made this movie entertaining to us.\n\nI laughed exactly one time at a 3 second portion of the autopsy scene. So 0.000555% of the movie was 10 stars, so it has that going for it.\n\nAll in all, go in drunk, bring some beers with you, expect absolutely nothing funny (except that 0.000555%) and look at your phones for the entirety of the movie and you have yourself a winner!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "Lazy and unfunny.",
        "review_detailed_main": "Honestly I don't get the appeal of Will Farrell. He's just not funny. And while John C Reilly can do decently if given the proper direction, he's wasted here in this movie.\n\nThis is supposed to be a spoof about Sherlock Holmes and Dr. Watson. In it Holmes is a complete narcissist who believes himself to be a great detective because the press says he is. And Watson is reduced to singing Holmes' praises and being abused by him at all turns.\n\nIf you've seen their back and forth in other movies you won't be surprised here. If you haven't and this is your first time, then prepare to be disappointed because it's just not funny.\n\nTo put this into perspective the producers knew this was a dog and wanted to sell it to Netflix because they tend to jump at any chance to get original movies. Netflix turned them down because they felt it was too stupid. Netflix turned them down. This is the same company that produced and showed Adam Sandler's \"The Ridiculous 6\". A movie so bad that I don't know anybody who actually likes it. When the low bar for what you'll take and what you won't is an Adam Sandler movie then you know it's time to pack it in."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "wolfgangnevel-25560",
        "review_rating": "",
        "review_title": "Awful to the core.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "spmact",
        "review_rating": "7",
        "review_title": "A silly take on the classic tale. What did you expect?",
        "review_detailed_main": "When I saw the trailer for this I laughed a few times, which was enough to raise my interest in seeing the movie. Then I read that all the reviews said it was awful and I was surprised because Farrell and Reilly are usually good together.\n\nAfter seeing it I can say that it's not nearly as terrible as people say. I don't get what all the hate was about. Sure, there are some pretty dumb moments, but I was mostly laughing throughout. It's basically a silly/slapstick comedy, which is clear from the trailer.\n\nAlso, I didn't see any of the \"sloppy editing\" and \"shots out of focus\" that's listed in the trivia, and I don't get why people would have walked out en masse as claimed. I've seen far worse.\n\nAll in all I don't know what people were expecting, but if you liked Farrell and Reilly together previously then you'll likely enjoy this as well. It's not quite as good as Step Brothers, but I definitely did not regret watching it."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Pjtaylor-96-138044",
        "review_rating": "5",
        "review_title": "It's intermittently amusing but ultimately average.",
        "review_detailed_main": "There are some amusing moments but, on the whole, 'Holmes & Watson (2018)' is just totally average. It's not as bad as most reviews purport it to be but it's nowhere near as funny or generally accomplished as you'd expect from a reuniting of Ferrell and Reilly - who are both often hilarious in real life and made the excellent 'Step-brothers (2010)' together. The film is not as much a parody as it is a cash-in on the relatively recently lapsed copyright associated with the Sherlock Holmes character and his earliest of stories, making for a strange missed opportunity when it comes to where the laughs are (supposedly) coming from. The piece also leaves something to be desired in terms of its story - in particular, the central 'mystery' - and its character arcs, the latter of which are mostly rushed through in a bizarre (and lazy) musical moment towards the finale. I didn't necessarily dislike the experience while it was occurring, but it's almost instantly forgettable and the handful of successful jokes don't exactly make you howl, either. 5/10"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "bon_eh",
        "review_rating": "10",
        "review_title": "A masterpiece of silly, fun humour!",
        "review_detailed_main": "You will not like this movie if you are: 1. a Trump supporter that gets butthurt over a small 2 minute throw-away joke. 2. A gun-toting American \"patriot\" who gets butthurt over some light-hearted jokes about America 3. A humourless (and might I say, obsolete) movie reviewer, who never gives comedies good reviews anyway (unless they are \"indie\" that is). 4. An obsessive fan of BBC's Sherlock who holds that version as sacred and sees anything having fun with the Holmes story as sacrilege. 5. Someone who just doesn't know how to have fun.\n\nYou will like this film if you are: 1. Someone who knows how to have fun. 2. Someone who understands and enjoys this kind of light-hearted, silly humour. 3. Probably not American, and especially not a Trump supporter. 4. A fan of previous Ferrell movies like Step Brothers etc. 5. Just a stand-up, awesome person."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "kosmasp",
        "review_rating": "6",
        "review_title": "Silly",
        "review_detailed_main": "I'm guessing some won't even read this, but for those who do, even though they feel offended by the movie and my rating: I get it. I felt similar when I saw the depiction of Bruce Lee in Once upon a time in America. And I'm not talking about how he fought or how he looked, but the way he was depicted. Arrogant is one thing (he may or may not have been like this or close to that), but the fact he was made to look as though he wasn't smart (to put it mildly).\n\nHaving said all that, there is more to OuaTiH, something that can hardly be applied here. Because you have quite the silly and really quite questionable depiction of two beloved figures. Not because the filmmakers don't like them, but because they wanted to do something different.\n\nAnd boy is this different. Predictable still and quite the rude humor and a bit dull for some for sure. It's tough to see merits, like the amount of good actors involved in this in smaller roles. You may or may not care, but if you don't adjust yourself into what is going down with this movie, you will have the worst time ...."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "Loving_Silence",
        "review_rating": "1",
        "review_title": "I walked out of the theater.",
        "review_detailed_main": "This is the first time in my life I ever walked out of a theater. This movie is total garbage. Both Will Farrell and John C. Reilly (both of whom I've liked in other films) humiliate themselves in this. I didn't chuckle once! All I was did was cringe at the dumb jokes and idiotic gags. The story was one of the lamest things I've ever seen and the acting just awful. This movie is simply unwatchable. Please do everything you can to avoid it!"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "yourimagery",
        "review_rating": "1",
        "review_title": "Absolutely as bad as they say.",
        "review_detailed_main": "I went to see this without having seen a single review beforehand and expecting it to be somewhere in the ballpark of Stepbrothers humour-wise. Walked out after less than an hour. My girlfriend who will never walk out of a terrible film pretty much grabbed her coat as soon as I mentioned leaving. It is not funny in the slightest and painfully predictable. I normally get frustrated reading 1 star IMBD reviews because in reality there are very few 1 star movies, but this one 100 percent is. The people giving this movie 10 star reviews must be living on a different planet. A trip to the dentist or a child's funeral would be a better option than going to see this film. Everyone involved in making this movie should be ashamed. And shot."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "Dumb and Dumber",
        "review_detailed_main": "Sherlock Holmes (Will Ferrell) and Dr. Watson (John C. Reilly) are best friends since childhood. Holmes was bullied by all the rich kids and Watson was the janitor's son. Professor James Moriarty (Ralph Fiennes) is on trial but Holmes has a revelation. Queen Victoria is under threat. The boys meet American doctor Grace Hart (Rebecca Hall) and her simpleton travel companion Millicent (Lauren Lapkus). Mrs. Martha Hudson (Kelly Macdonald) is the boys' very inappropriate housekeeper.\n\nThis is aggressively unfunny. There is a central problem. Holmes is both super smart and super moronic. In Pink Panther, Clouseau stumbles his way into solving his cases. That's not the case here. Holmes is actually smart and solves his cases deductively. He's also a complete idiot and those two clash at the same time in the same scenes. It's hella confusing. It never comes to solving that central problem. As for the comedy, there is only one funny line in the whole movie. \" I'm actually more taken with the mystery. It's a whodunnit and not necessarily a solvable one. It is however a definable one with specific suspects. So the mystery is better than the comedy and that's not a good thing for this movie. These two are really struggling in this one."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "mikesliff",
        "review_rating": "1",
        "review_title": "Utter disbelief.",
        "review_detailed_main": "I have never rated a movie on IMDB before, but this movie was so god-awfully terrible that I felt compelled to. I cannot emphasize how truly bad this movie was. How such a promising cast could deliver such garbage heaps of cringe-worthy attempts at humor is beyond me. If I could give it negative stars, I would."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "robert-663-381561",
        "review_rating": "1",
        "review_title": "Stunk",
        "review_detailed_main": "Just not good writing. Both are brilliant comedians but the accents were horrible and the jokes were lame"
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "and-58818",
        "review_rating": "1",
        "review_title": "Waste of money",
        "review_detailed_main": "Thought would relax on boxing Day & have a good laugh. Not the case, not funny at all. Left cinema after 30 mins. Absolutely Rubbish."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "VoyagerMN1986",
        "review_rating": "",
        "review_title": "Entertaining if you have an IQ of 80",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "jmanderson-04413",
        "review_rating": "7",
        "review_title": "I don't understand the hate.",
        "review_detailed_main": "Definitely not a 1. I had seen the poor reviews but went cause I am a fan of Will Ferrell. Setting my expectations low I was actually pleasantly suprised. Its a fresh take on Sherlock holmes with plenty of hilarious moments. I think it definitely deserves a higher rating."
    },
    {
        "movie_id": "tt1255919",
        "movie_name": "Holmes & Watson",
        "movie_rating": "3.9",
        "review_username": "kerrinelson-52470",
        "review_rating": "1",
        "review_title": "Save your money",
        "review_detailed_main": "Hard to believe a movie about Sherlock Holmes could be this bad. Simply not worth seeing. The occasional funny moments weren't worth the price of admission."
    }
]