[
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajivsperumal",
        "review_rating": "1",
        "review_title": "The movie should've been named disgRACE 3",
        "review_detailed_main": "Even the mountain dew ad had better graphics than this piece of junk! On a scale of 1 to 10, it'll be 0!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nroy-35581",
        "review_rating": "1",
        "review_title": "Salman Khan Movie directed by Remo D'Souza: Need to say more?",
        "review_detailed_main": "Seems like directed by a really poorly skilled freshman's direction project. Salman Khan should now take some rest now. Daisy Shah should stop doing movies. Jacqueline can keep doing masala movies, she looks stunning as always but fails to deliver. Bobby Deol's blank expression is not his fault. Anil Kapoor - Why in this movie?"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ketgup83",
        "review_rating": "1",
        "review_title": "Race 3 is an insult to Bollywood. Avoid it any cost.",
        "review_detailed_main": "While films like Parmanu, Padmavati, Padman, Sonu Ke Titu Ki Sweety , 102 Not Out, Hichki or even Blackmail were treat to eyes in the first half of 2018 giving hope that Bollywood movies have matured but then there comes a crap like Race 3 that will spoil your mood and you will wonder that if the makers are taking the audience for granted.\n\nRace 3 tells the story of a dispute between a family when Shamsher Singh (Anil Kapoor) decides to give half of his wealth to the adopted son, Sikander Singh (Salman Khan) and the rest of it between his own kids, Suraj (Saqeeb Saleem) and Sanjana (Daisy Shah).\n\nDirected by Remo D'Souza, who has made a decent film ABCD and pathetic ones like A Flying Jatt and ABCD 2, Race 3 is one hell of a journey which you wish to forget once you leave the theater. Right from the opening scene of the film to the climax, forget about logic, even the story is full of potholes. There is some breath of air when Anil Kapoor tells about his plan but again the film goes back to the loop hole and sadly does not recover. The first film Race (2008) was brilliant with solid twist and turns followed by an average Race 2 (2016). Race 3 is a nightmare which you should get over immediately with as it will haunt you, the more you think about it.\n\nNone of songs are good (surprisingly music is composed by brilliant duo Salim - Sulaiman). Action scenes , though few scenes were fine, but again gone overboard. Race 3 is high on production values and less on content. Dialogues are horrible and funny especially - Our business is our business , none of your business. Even the Bhojpuri language used in between the scenes is irritating.\n\nComing to the performances, none of the actors have done justice to their role. I do not understand why Salman Khan is repeating himself, even though he is in Bollywood industry for more than 25 years. The actor, who was superb in films like Dabanng and Sultan, should start experimenting with roles. Anil Kapoor is fine but could have been better. Bobby Deol makes a decent comeback but sadly not enough to leave any impact. Lesser spoken about Saqeeb Salim, Daisy Shah and Jacqueline Fernandez, the better.\n\nOverall, Race 3 is an insult to Bollywood. Avoid it any cost."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "niharkadam",
        "review_rating": "1",
        "review_title": "WORSE THAN EXPECTED",
        "review_detailed_main": "The Movie is absolute trash..only idiot salman khan fans will rate it above 5."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gursharan1551",
        "review_rating": "1",
        "review_title": "Why? Just why?",
        "review_detailed_main": "I don't know what kind of mental conditions these people are suffering from, who are rating this movie 10/10. Why couldn't they just make it simple why this whole addition of crap. Just another crappy amalgamation of the movies which had a better script. I just don't think Salman will make any sensible movies in which he just acts good and doesn't just say mindless dialogues."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "atkinsonfernz",
        "review_rating": "1",
        "review_title": "Save your time money and brain cells from exploding",
        "review_detailed_main": "I guess the Dabangg days for Sallu are over, did not expected this to be Hit but it was purely below average, and spoils the RACE franchise for all its fans. Thriller : LOL No Action: Extra Ordinary Plot: Whats That? Story: Huh? the only saving grace in Anil Kapoor who is as always good to his role.\n\nThis is even bad for those who leave their brains at home to watch movies and the one liners are not worth a comment.\n\nI guess the makers of this movie are a big fan of Vin Diesel as most of the actions are from XXX (Bike) and Fast & Furious esp the \"its all about family\" sheesh... taking about ruining the reputation of a great franchise by imitating it the most unprofessional way.\n\n1.5/ 5 Stars"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "royrajchamp",
        "review_rating": "1",
        "review_title": "Stupidity at its height",
        "review_detailed_main": "I need to rewatch Race 1 and Race 2 to get over this film. Complete torture."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sarsij-nayanam",
        "review_rating": "1",
        "review_title": "Probably the worst ever movie made in Bollywood",
        "review_detailed_main": "This movie is worth not wasting your time. Storyline doesn't exist. Music was tasteless. Acting was considered unimportant. So basically there is action, fashion, and meaningless stardom at play.\n\nAvoid this movie for your own good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "yashomaheshwary",
        "review_rating": "1",
        "review_title": "A flop like Roy! Left during the interview !",
        "review_detailed_main": "There is no script. Action poor. Acting Poor. A strict no! Pleas sav find your money on this one! I wouldn't even rate if possible. Worst ever music! No heads or tails!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "bhargavrathod",
        "review_rating": "1",
        "review_title": "WORST MOVIE OF THE YEAR",
        "review_detailed_main": "THE WORST MOVIE OF THE YEAR I WOULD SAY. A TOTAL WASTE OF MONEY AND TIME."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "derrickjp",
        "review_rating": "",
        "review_title": "Just Why, Bollywood? Why?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "maria-skatova",
        "review_rating": "10",
        "review_title": "It is so awful it is even great",
        "review_detailed_main": "This movie is so bad, it is even good. Not \"The Room\" level good, but close enough. You have all types of Bollywood classics here:\npoorly choreographed slow-mo fights\ntotal confusion about who is who's brother, cousin, nephew, father, uncle, secret child\nscenes that deserve to be in 'top-10 unrealistic Bollywood stunts'\n\n\nYou'll also have fights between bursting from silicon 'martial arts competent' women. You'll also have your forever-35 y.o. Salman, who is 50+ in real life but will probably never ever grow up and get old on screen. Salman will poorly perform in dancing episodes, as usual. Maybe even worse than usual. You will have that awkward moment when a woman puts on jumpsuit for skydiving while driving a truck, and then skydives right from the truck. You will be impressed by Bobby Deol's 6-pack.\n\nYou'll get lost in plot twists within plot twists. Seriously, Mr. Nolan is silently jealously crying with his 'Inception' - 'Race 3' outraces it easily. Everything changes every 10 minutes or so - loyalties, family relationships, loves and hates.\n\nBefore the end Salman will do his thing again. He will rip his t-shirt from his well-oiled body with just 2 fingers. I mean, have you ever tried to rip a perfectly good t-shirt with one hand? I bet you failed. Salman does that every time successfully.\n\nIn the very end Salman will explain everything to those who didn't understand what just happened. You will definitely need that explanation.\n\nAs I said, this movie is so bad it is even good. Because the level of badness is so high, it is piece of the Art of Bad Movies."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dr-israr-ahmed-khan",
        "review_rating": "6",
        "review_title": "Salman khan stardom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abhishekmahajan-34801",
        "review_rating": "1",
        "review_title": "Slow, Lame, Boring, Not even a Typical Salman Khan Movie.",
        "review_detailed_main": "First things first... I liked Sultan, Dabangg, Bajrangi Bhaijaan, even TZH and Kick were entertaining. Salman Khan is known for his stardom, fanbase, court cases except acting. Even his flops Jai Ho and Tubelight have crossed 1.1 billion mark at the box office. Race 3 is a movie which has been trolled the most than any other film of Salman or any other actor. Remo D'Souza was a very bad choice for big budget, multi starrer, action franchise. He is better off with dance related movies, A Flying Jatt was perfect lesson for him. Salman's involvement in Race Franchise, Questionable. Without giving any spoilers, and keeping the fact in mind that Race 3 is big budget movie sold to Distributors at very high price is really half baked, slow, illogical, bumpy and jerky roller coaster ride with hight production values. Good Cinematography, but Ayananka Bose had done better work before. Poor VFX, Prime Focus is good VFX company (see Bang Bang). Budget provided for VFX seems marginal. Performance are average. Music is letdown. Dialogues are wasted. Runtime is 159min too long. Too many songs. Even Abbas Mustan couldn't have pulled off this task (read weak script). They should have kept Saif Ali Khan (loyal to Race Franchise)."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "zulfikaralarakhia",
        "review_rating": "1",
        "review_title": "Disappointed",
        "review_detailed_main": "I should have watched Jurassic World instead, this is not good at all, all they have is the name Salman Khan in it, story, screen play, songs totally rubbish Please learn something from Hollywood, they have but are 30 years behind lol..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anshumansi",
        "review_rating": "1",
        "review_title": "pure garbage",
        "review_detailed_main": "I wish i could rate the movie in minus. salman a person who simply can't act,i still have no clue how he still get's so many movies. bobby, making a come back , well that didn't go so well. Sorry to say but retirement suited you bobby. jacqueline, ba dum tss!! my god apart from glamour she provided absolutely nothing. i can't tell you anymore and i won't even tell you to watch is yourself to know more, because i don't want you to get cancer. Save money, time, and brain cells. watch TMKUC that will provide more entertainment."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "etc-saroj",
        "review_rating": "1",
        "review_title": "0 out of 10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sachinkinhikar",
        "review_rating": "1",
        "review_title": "Complete waste of money....",
        "review_detailed_main": "You gets bored in first 10mins itself... third class movie of the year..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nagendrasingh-43157",
        "review_rating": "1",
        "review_title": "I am sorry negative markings in not allowed",
        "review_detailed_main": "Don't waste your time and money it's all. And don't even waste time On reading about story line in reviews the movie is not so worth even to spend 2 mins reading about what was in the movie. And those giving 10 stars RIP."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sanghmohanty",
        "review_rating": "1",
        "review_title": "Below expectations. Terrible",
        "review_detailed_main": "Why do people make such movies? This is a 2 hrs 40 min of torture. Even a low budget south Indian movie has better stunts and the action in those movies make sense. These producers know Indians are foolish, they will always watch salman khan movie no matter how terrible. Except Anil Kapoor, there is nothing to see in this movie. Hope IMDB had negative ratings"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dalvar-ak47",
        "review_rating": "1",
        "review_title": "This is not a sequel but a combined remake of Race 1, 2 and Hum saath saath hai",
        "review_detailed_main": "We all know that, in late 90s, Salman worked mainly in family films and in late 00s, he did action. And now, when 10s decade is At it's last phase, I feel, Salman Decided to work in a movie which would be an action family movie, so THE LENGENDARY Race 3.\n\nMovie takes the elements of both Races (1 & 2) and HSSH and shows it in the most pathetic and cringeworthy possible.\n\nElements:\n\nRace: Step-siblings, faking death etc\n\nRace 2: Heist, shades of antagonist\n\nHSSH: Joint family, problems between the siblings\n\nYou can say while carving the movie Race, the remaining wastage which was assembled together to make race 2 and the wastage of race 2 was assembled and wastage of HSSH was added to make race 3.\n\nPATHETIC, BORING, MINDLESS, PREDICTABLE AND CRINGWORTHY. These are just few words to honour the movie. Movie had some very pathetic performances, pathetic dialogues, pathetic songs with pathetic lyrics (Heeriye is a good number though) & pathetic storyline. The movie was too slow to be called entertaining, I didn't understand half of the story, no not because it had a very complex and out of the world story, just like that of Nolan's movies, but because I had a good sleep during the movie. Plus songs were so frequent and long that you can't help but sleep, so if you have trouble in sleeping or are insomniac. Please go for Race 3. It was an all and all Salman Khan movie, so I don't need to say how mindless it would be (But movies like tere naam, Saajan and Bajrangi Bhaijaan were way awesome). Twists were too damn predictable, Race series is known for amazing thrills and out of the world twists, but this one had none, yeah the last twist was good, but not amazing as that was also kind of predictable. The dialogues, the songs, the lyrics, the acting, the action scenes... everything about this movie was criminally cringeworthy.\n\nThe best thing about the movie was Bobby Deol and Anil Kapoor. Saif Ali Khan is missed badly and so is Abbas-Mastan.\n\nI request Ramesh Taurani, that if he is in a mood to make Race 4, please continue the Race 2 story and bring back Saif. Let Bobby be there, we have no problem.\n\nI've only one suggestion for you guys. There is a plethora of good movies, Avengers Infinity wars is still running in the theatres. Jurassic World is running. And if nothing, than please save your cash for Sanju, rather than watching this masterpiece of mud.\n\nIn my honest opinion, movies like Ek tha tiger, PRDP, Khiladi 786 and even loha and Gunda are like citizen Kane, Titanic, Godfather and the Shawshank redemption in front of this movie\n\nCompletely avoidable"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nafayawan",
        "review_rating": "",
        "review_title": "Worst storyline",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ramkumar-28288",
        "review_rating": "9",
        "review_title": "Hollywood level 🔥",
        "review_detailed_main": "The action scenes of the films was mindblowing. Haters wan't physics everywhere. They should find physics in KGF 2"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "bonnyjaitly",
        "review_rating": "7",
        "review_title": "Stylised Action , High Gloss and superb Visual Appeal",
        "review_detailed_main": "One word - Salman Khan.... the man can do no wrong ans u gotta see the movie as a mass entertainer and your gonna love it. Don't try to hack into cinematic perfection here.\n\nEnjoy the action , glamour and visual that are astoundingly lovely.\n\nBobby Deol and Anil Kapoor are equally superb in their respective roles and are gonna walk away with maximum kudos. Bobby has never looked better and more chiselled , he really looks like a Greek god in this flick.\n\nSongs specially selfish has been done so well and looks the most visually appealing with Ladakhs beauty being exploited totally.\n\nDirection could have been a tad better citing the taut script with constant twists.\n\nThe rest of the cast is strictly ok , but Saqib does impress with a short role.\n\nOver all it's fun and a thrilling ride to sit back and enjoy yourself in a world of high glamour and style."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mohitcoolkumar96",
        "review_rating": "1",
        "review_title": "Saif Ali Khan was way better than Salman",
        "review_detailed_main": "Saif has the class Salman can never have he is the middle class man stereotyped by himself"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "itransmition",
        "review_rating": "1",
        "review_title": "Race 3 or Poti 3",
        "review_detailed_main": "I wish there was an option for \"0\" rating. What a load of crap. You better stay home and watch your POTI for 2 hours and 40 minutes rather than watching this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "munivenkatappavijay",
        "review_rating": "1",
        "review_title": "Not worth time spent...",
        "review_detailed_main": "Very disappointed by the movie. It's not worth the time and money spent."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pammikaur-70580",
        "review_rating": "1",
        "review_title": "Bakwas film",
        "review_detailed_main": "Please dont watch this.. its better to watch KYA KOOL HAI HUM again.. instead of watching this movie.... if you want divorce your wife , show this movie ... cancer can be cured but serious deseas after watching this movie cannot be cured"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "divakarpsingh",
        "review_rating": "1",
        "review_title": "Remo has spoiled a good franchise",
        "review_detailed_main": "So Remo D'Souza has humble beginnings, he has come from a bitterly poor background and became a good choreographer. Then he tried his hands in direction. If Prabhu Deva can direct movies, then why not him !! However, sometimes we should know our limitations. Direction is very poor element of this film. For Race-3 franchise, you do not expect an idiotic nonsensical movie. After all this is not Welcome or Heraferi franchise. Worst thing in this movie is Dialogues. A smart movie has dialogues where actors say few words, but those are very well polished. Overall, I think Remo should stop trying to be an all rounder, and should to things which he can do well. Also, Salman Khan should not take us for granted. So much of super star-ism."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tarikhavenofuture",
        "review_rating": "1",
        "review_title": "Worst movie of my life",
        "review_detailed_main": "After watching 45 i was done. I wish IMDb has a 0 rating system"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "njoy_dj_joy",
        "review_rating": "1",
        "review_title": "Does it matter what i review",
        "review_detailed_main": "Some people like me when they see movie like this go with mini expectation instead expect worst... but still this movie is worst than expected...so its ridiculous to square fking bore multiplied by stupidity... its so stupid that children cartoons are way more logical.. Salman makes fool of himself trying to behave like Vin deisel of fast and furious .... Remos direction is very bad... no good dialogues .... even songs are so pathetic that you to feel embarrassed watching it.... Also like movie this review is these movie are better than race 3\n\nhumshakals hitmawala Ramu ki aag,Department etc Joker tees mar khan"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aonenaqvee",
        "review_rating": "1",
        "review_title": "Salman Khan does it again!",
        "review_detailed_main": "And by it, I mean create a disastrous, muddled film created solely to feed his ego. The acting is sloppy, the writing is childish at best, and the best part of the film was the end credits. Save your money, and your time, go and watch Incredibles 2 instead"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ajay_manchanda",
        "review_rating": "",
        "review_title": "Irritating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rihanr-42949",
        "review_rating": "9",
        "review_title": "Action ka baap",
        "review_detailed_main": "Movie is fantastic Action DUMDAAR Cute Romance And songs are Blockbuster."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anshpandey",
        "review_rating": "7",
        "review_title": "Far Better than some hollywood over hyped flicks!!!",
        "review_detailed_main": "Race 3 may not be a masterpiece but still it is watchable and a complete family entertainer...go for it with least expectation and u find it more..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shrutipatel-40787",
        "review_rating": "1",
        "review_title": "Worse than the worst movie ever !",
        "review_detailed_main": "Beware, we need to discourage them from making baseless bhaitard movies!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vaibhaviit",
        "review_rating": "1",
        "review_title": "Top 3 contender for WORST movie ever!!!",
        "review_detailed_main": "Bad acting. Bad direction. Bad dialogues. Bad casting. Very bad lyrics. In short a perfect ingredient for a brainless suffering of 160 minutes. Watch it if you are a die hard fan of BHAI and his bad acting with BHAI in nearly every frame of the movie. P.S. Expectation of logic in this movie can be injurious to health.....mental health."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "naveen-tikeriha",
        "review_rating": "1",
        "review_title": "This is more a disaster disappointment than a movie.",
        "review_detailed_main": "Story: you will be waiting for it and you reach the end of movie Star cast: Anil Kapoor does good what he has been doing in this franchise others are just put there because a movie needs characters Songs: LOL Action Stunt: in earlier parts stunts used to come naturally in this no not at all Apart from brain you need to keep your eyes and ears also at home to be in movie hall with this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dev-p-patel8",
        "review_rating": "1",
        "review_title": "Salman should retire",
        "review_detailed_main": "Very bad acting, story, direction and screenplay. It spoils the race movie themes."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "d-he-e",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Save your money.This movie is truly awful, and a waste of three hours."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "amaanullah-khan",
        "review_rating": "1",
        "review_title": "Absolute Trash!",
        "review_detailed_main": "Kudos to the cameraman who had to capture this ordeal which was not only horrific but also poor on cinematography!\n\nThe actors over-acted... The director was mostly into song choreography.. the action sequences were.. well pretty stupid and downright comedy and the dailogue delivery was abysmal!\n\nPlease do not watch it. Don't waste the time and money. Not worth it. Even for a DVD or YouTube release!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "amritraj-97653",
        "review_rating": "1",
        "review_title": "Why is Negative ranking not an option?",
        "review_detailed_main": "Well, one must be a Salman khan's Die hard fan or a chutya to like this movie. This is beyond horrible. You lose your time,money, intellect. No logic, No story. Horrible dialogue, horrible music. Why does Salman need to make a movie when he has so many fans.?? He can record a 3 hours video of himself and release it. His fans will watch that too. They don't need logic or story or anything."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "theHulk655",
        "review_rating": "1",
        "review_title": "Our money is our money none of your money. Race 3 you lose.",
        "review_detailed_main": "What a trash movie with trash story on the big screen. Who are those people, where they come from? The movie is totally flop and garbage. After Tubelight this movie is torture. The movie includes suspense though but the level of suspense is so high that you wouldn't consider it as movie. It's like a joke done to public and fooled public to fill their pockets. It's not entertainment its torture that you have to bear if you are watching.\n\nThe movie doesn't need a discussion it's a simple trash which should be avoided."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sagarverma-28861",
        "review_rating": "",
        "review_title": "Thank god I didn't go to theater for this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aksg-92877",
        "review_rating": "8",
        "review_title": "Stylish and Hollywood type treat by race 3 team",
        "review_detailed_main": "I understand the story is bad..but..u feel Sound fx vfx and Quality of Acting is all superb...anil and Salman bobby kings...daisy i love she is superb like hollywood actress.i enjoyed lots of ..i just impressed by sound background and Presentation and Superb family action mystery.."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nebuchadnezzr",
        "review_rating": "7",
        "review_title": "Very entertaining",
        "review_detailed_main": "This movie is a feel good movie with loads of kick ass action. Hot gals, toned up guys, and photographic scenes. The music break outs are very good, may have over done them a tiny bit, lilbit. Watch this one!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "krishankumar3051995",
        "review_rating": "1",
        "review_title": "Not worth watching",
        "review_detailed_main": "Avoid at any cost , Donate money instead of watching this."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "j_chugh",
        "review_rating": "2",
        "review_title": "You don't just pay money to watch this movie. You pay your intellect, time, logic, brain cells and again more money to pay for pills to kill your headache.",
        "review_detailed_main": "Only and only Anil Kapoor carries his character. Rest of them are just there. Even a Mannequin has more expressions than Salman Khan. I'm not saying this because I don't like Salman Khan. I am saying this as a critique. Go to watch this movie only and only if you can tolerate poor acting, lackluster plot and sheer absence of any effort."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Abbas_Muhammad_cfc",
        "review_rating": "1",
        "review_title": "Boring and Worse than anything",
        "review_detailed_main": "One of the worst movie Salman khan has ever made! only 2 songs are good otherwise one of the worst and most poor storyline and mostly scenes are copied from John Wick 2."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "info-43480",
        "review_rating": "1",
        "review_title": "Worst of worst movie",
        "review_detailed_main": "Salman is a actor not a director, now a days high profile actors interfare in the direction with the director that is why movies are flop, look back in the 90's every actor was good, now same will happen to sharu Khan zero movie, that movie will be also zero."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arunava-sitcal",
        "review_rating": "1",
        "review_title": "Useless",
        "review_detailed_main": "It isn't a movie, it's a torture. Most pathetic. Kuch bhi karega kya."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "singhnirdesh",
        "review_rating": "1",
        "review_title": "This time even dialogues were copied",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashutoshaswaleho",
        "review_rating": "3",
        "review_title": "As expected.",
        "review_detailed_main": "First installment established the genre, suspense. By the second one, it was just a stupidity. And now since the third one's announcement including Salman Khan, i was pretty much sure that it is going to suck. Because bhai is not a suspense movie actor, he's idol of people who love mindless action, no story, just bhai beating up some villain and shooting gunand dancing on songs, and by the way. He still cantcact and dance and certainly can not write lyrics. Now, movie is directed by desouza, who gave Flying jatt. I have one suggestion to him, 'he should stick to his dancing movies'. Other wise story is crap. other Actor actress too cannot act. Overall it sucked"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashutoshaswaleho",
        "review_rating": "3",
        "review_title": "Perfectly average.",
        "review_detailed_main": "Don't listen to 10's, 'cause they are Salman's fan, and don't listen to the 1's, 'cause they're Salman haters. Bhai can't act, it's a truth. and this movie supposed to be a suspense thriller but after some one or two one liners from bhai, it ultimately becomes typical Salman Khan movie. About music, it is below average. You know when Salman Khan can write lyrics, anything can happen. That's exactly what's wrong with this movie. In theatre, its like director has no imagination. I really think that remo should stick to the dancing genre. In acting, anil Kapoor is as usual in his character, but no other actor did justice to their character."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "beingmmb",
        "review_rating": "9",
        "review_title": "Blockbuster Action Bonanza",
        "review_detailed_main": "Race3 are excellent. Action is top-class and the story is also very thrilling with a number of twists. Salman Khan shows some Grey shades. Production value is also top-notch.The only problem is 2 songs which drags it a bit. Watch out for Salman entry scene. in one short its \"Full On Paisa Vasool\""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arwiennarain",
        "review_rating": "7",
        "review_title": "Watch the movie without thinking it's race",
        "review_detailed_main": "It's an average movie that doesn't deserve the hate. I know it doesn't fit the title, it has nothing to do with the originals one, see it as a stand alone that takes place in another universe or something. I would like a sequel but it's better with Saif Khan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dash-80191",
        "review_rating": "2",
        "review_title": "Would skip this one",
        "review_detailed_main": "Ah ! So where do I start ... This movie was nothing but waste of time and money , Extremely predictable plot with some of the worst acting I have seen so far. It's a shame as a lot of people (including me) liked the first two parts of this movie. It's clear that this movie didn't care about the audience but just wanted to create a trilogy. Just earning from the reputation of the first two movies. Songs were pretty mediocre and boring. So , if i were you i would just skip this one."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mrugesh_thaker",
        "review_rating": "1",
        "review_title": "Why ? Just why ?",
        "review_detailed_main": "It has Salman khan so we do expect a movie which needs no brains (just like his fans) but on top of that its boring as well. Now that is bad. Govinda movies were same but they were thoroughly entertaining as Govinda was a good actor and also an exceptional dancer. Salman khan on other hand is below average in all departments.\n\nAvoid at all costs."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sujith-96102",
        "review_rating": "1",
        "review_title": "3rd class...therefore the name : RACE 3",
        "review_detailed_main": "Lost all respect for Remo dsouza today... Never thought he would make a movie just for earning money on the most third class pathetic actor ever born - Salman khan's name... SHAME on the makers of Race 3 SHAME on Salman khan... should join acting academy...but should first be in Jail.. Was just another Employment scheme for out of work actors, as usual by Salman... Really missed you Saif and Abbas-Mustan... Tarnished the name of Race 3 forever...irrepairable dammag!!!!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ssethi-64963",
        "review_rating": "1",
        "review_title": "For the BHAI FANS : Love is blind, but is it dumb as well ?",
        "review_detailed_main": "Many fake 10/10 reviews here to control the overall rating. WARNING : Do not let them fool you. The movie is pathetic. Really questioning the IQs of these people rating 10/10. Are they crazy salman fanatics ? are they part of their marketing team ? or are they fresh out of mental institutions ? Save your money. Most importantly time & emotional balance.\n\nThis movie does not deserve 1% of your money. Please don't waste it. The action scenes are irrelevant unnecessary & way too much. There's no real suspense. The ones still saying this movie is good & worth watching are BHAI FANS. Don't fall for the trap.\n\nAnyone giving this movie more than 1/5 is lying. No entertainment here. Anil kapoor & Salman khan failed big time. All the others can't really act. What a dumb movie. Wasted weekend time that could've been spent well if not for this pathetic 'star power' movie.\n\nNot even about 10% of how well the RACE franchise did before. Now you ll see most of these stars tweet about how well the movie is doing, & how much money they are making. It's a marketing gimmick for those who haven't seen the movie yet, it would make them think this movie must be something. But hang on, calm down, don't do something you'll regret a whole lot later. I feel sorry for these BHAI FANS."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashish-bhugra",
        "review_rating": "1",
        "review_title": "RACE to new lows in cinema",
        "review_detailed_main": "Couldn't imagine a movie to be so unbearable. None, absolutely none of the actors was remotely credible."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "captaincharisma-27771",
        "review_rating": "1",
        "review_title": "No words left to describe this!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gofidas",
        "review_rating": "1",
        "review_title": "As expected !!",
        "review_detailed_main": "Ditto as expected from Salman Khan, I wish I could rate it 1/2 a star just for the presence of Anil Kapoor, worse than expected but ditto as expected from Salman Khan only he can star in such kind of brainless movie.."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "amitmt66",
        "review_rating": "1",
        "review_title": "if have gun, first killed the director n writer, then attempted to suicide :P",
        "review_detailed_main": "If i have option to give negative marking, i will go for it, what a crap movies with lot of asshole actors, n song, ufff, watched in Inox with lot of crowds, but after sometimes I discovered that all are busy with their bf or gf, n doing some sexy things, no one watching the movies .....waste of money n time ..if you want to see it, just download cam version (do not need HD version) in torrent and watch"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nihalqayyumwaheed",
        "review_rating": "9",
        "review_title": "Total destruction",
        "review_detailed_main": "Woahhhhh. I did not see this coming. Salman Khan with a story. Now that's impressive. Every single time your looking at the screen your surprised to see because every scene exceeds your expectations. The entry to the climax keeps u holding on to your chair. And their is nooo way to predict the climax. No one could even think the climax would be that good. The race is known for twists and turns which race 3 provides through out the movie and does it sooo good that your just amazed. The action is off the top. Each action scene is shot with perfection and has beaten Tiger Zinda Hai by a huge margin. Not one car is missing in this movie. You get to see everycsr you could think of. They literally destroyed everything they bought. Let's forget everything and focus on Salman Khan. He is the soul of the movie. He makes the movie so much better that you won't take your eyes off of him. His action sequences and his dialogue deliveries give you goosebumps. Most importantly when he takes of his shirt you will want to fall to the ground. The whole cast has done an amazing job. Bobby dell has made and amazing comeback and I can assure this movie will boost his career to the top once again. Anil Kapoor is at his best. He makes the movie feel so much more races because he's the only familiar face from all the races. Jacqueline looks as good as ever. Her action sequences are just mind blowing. Daisy shah on the other hand does a decent job but isn't showcased much. Saqib Saleem looks like a joke in the movie and looks too weak infront of salman and bobby. The music is really good but it doenst best race2 songs. Lat Lag Gaye has to be the best song from all the races. With race 3 they tried heeriye which was and awesome song and probably the best song of the movie but didn't feel better than Lat Lag Gaye. Apart from that we know that the other races have had some vulgarity but Salman Khan has done an excellent job taking out as much as he could. This movies makes for a family watch and it's as fun as it could get. It's for all ages and it will surely take away ur breathe in ever scene"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajputshri",
        "review_rating": "6",
        "review_title": "Anil kapoor excellent action",
        "review_detailed_main": "Movie worst but anil kapoor action superb in this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "klouds",
        "review_rating": "1",
        "review_title": "Dont Watch @ Gunpoint Also",
        "review_detailed_main": "Everything is wasted in this Movie ...Money, time & peacefulness of mind this movie just ruined the franchise it should not named RACE.\n\nWorst Casting Flop story Disaster Acting\n\nThis movie not deserve any star"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kumaramitkumar-92398",
        "review_rating": "1",
        "review_title": "wORST MOVIE OF 2018",
        "review_detailed_main": "I WASTED 400 RS ON THIS PLATITUDE AND CRINGE FILLED STORY. EVEN DIE HARD SALMAN KHAN FRIENDS WERE DISAPPOINTED WITH THIS. MUSIC IS LITTLE BIT OK. ANIL KAPOOR IS OK. APART FROM THEM, EVERYBODY SUCKED."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "admin-58554",
        "review_rating": "1",
        "review_title": "one of the worst movies in Indian cinema history",
        "review_detailed_main": "One of the worst movies in Indian cinema history. wonder how people watch this kind of movies . Only fans will like this one . Please save your money and donate to needy ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shehzad-essani",
        "review_rating": "1",
        "review_title": "Dumbest movie of the year 2018",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "DeadMan66",
        "review_rating": "1",
        "review_title": "Race 3 ended up in a family dispute. Waste of money, they think people are fool.",
        "review_detailed_main": "The movie from the starting will look like the family dispute. Someone is planning for other, other is for another, another for those(anyone). At last they are making fool to people by showing us garbage which shouldn't be considered as even story. No thrill, no romance only action and planning plotting. The movie doesn't look other than the regular family drama of Saas Bahu. The only difference is of the action scene and some songs.\n\nIts not the acting its the story which I'm very disappointed with. Do whatever you want in the movie and in the last scene give an explanation why you did, like seriously ?? Watching the movie and parsing it is to make fool of yourself. Movie is not worth watching. Chhota Bheem or Tom & Jerry are better than this.\n\nI don't want to give 1 star but the story is such a waste that I had to. Damn man when Bollywood is going to make good story movies."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aqibbutt-69522",
        "review_rating": "1",
        "review_title": "Flop movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashfaq9211",
        "review_rating": "1",
        "review_title": "Was that even a movie?",
        "review_detailed_main": "I was there contemplating, is this some sort of joke? Or is this for real? I felt choked by stupid dialogues and songs, wasted 160 mins of my life on piece of crap. Please save yourself from torture, \" coming from salman khan fan\""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sidharthg",
        "review_rating": "1",
        "review_title": "oh my! Horrible Horrible Horrible!",
        "review_detailed_main": "It's been a while that I've seen a movie with such a disastrous story, acting, action, screenplay, songs & dance! I mean, there is absolutely nothing redeemable about it. All the actors collectively have put in such a terrible acting, specially Anil Kapoor. Hell, all of them were equally crap.\n\nSongs are miserable, and what makes them miserable are the singers! Dance sequences are totally out of sync. The storyline keeps changing, pretending to be a great thriller, but alas, it is nothing but a disaster!\n\nPlease save your money and time, you are better off watching chota bheem!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "marryjone",
        "review_rating": "10",
        "review_title": "One of the best action and suspense thriller !!!",
        "review_detailed_main": "Right from the word start, the movie begins entertaining. The location, actions, acting are marvelous. Just watched in Hong Kong its one of the best..Anil kapoor salman and bobby were in terrific form and the climax was just unexpected. Strongly recommended."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "siddhantswarupmallick",
        "review_rating": "7",
        "review_title": "About the film.",
        "review_detailed_main": "The story was good and the action which was performed by salman khan was really appreciable. The scene were eye catching but the songs did lose everything. The film was full of songs which was really disgusting. At my point of view the film was ok"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Galop_Inferno",
        "review_rating": "1",
        "review_title": "Quite possibly the worst movie of 2018",
        "review_detailed_main": "Race 3, an in-name-only third installment of a wildly successful franchise, has me thinking: Who let the filmmakers attach the name to this steaming pile of crap? It's not quite sure what it wants to be. Like a cross between a heavy-handed soap opera, a heist movie, an over-the-top musical extravaganza and a mindless Michael Bay blockbuster, complete with illogical explosions. By the end of the first extended action sequence, I wanted to tap out but I knew I wasn't getting a refund due to the use of MoviePass so I was in it for the long haul.\n\nClocking in at 160 minutes (standard for an Indian film), we are treated to about a minute of thanks credits before being quickly thrown into the squabbles of this wealthy dysfunctional family, the Singhs. The film gives us a narrative, describing each living member of the family with great detail, as if these characters already existed. It's like watching someone narrate Dallas.\n\nSince almost everyone in the film has more negative qualities than positive, this makes it hard to find someone to relate to. There is one who stands out, Sikander (Salman Khan, who also produces), as a sort of black sheep. Decent performances are given but they're all hindered by the writing, which adds something new on so often one can lose track. I see it as a bizarre parallel to my own work.\n\nI don't have much experience in Indian cinema. Only a few have crossed my path (Dr. Cabbie, Padmaavat and Aiyaary) but this one makes me question the future of my seeking out more. I know there are way better ones out there, and I'll find those.\n\nVisually, the film has a rather blatant abuse of slow motion effects. Even to the smallest of details. This may be due to my lack of viewing but there was a lot of jumping between Hindi and English, and subtitles for both sides. As well as a number of inconsistencies in the translation (some words come out spelled differently, words being capitalized strangely).\n\nDon't get me wrong. I love musicals (I saw The Greatest Showman five times and I embrace all kinds of different selections) but here, the over-the-top flashy theatrical musical numbers felt so out of place and very overlong.\n\nI'll have to seek out some Indian films with repute, and perhaps not go gung ho next time. If there is a Race 4 after this (rumor has it, there will be), I'm afraid I may have to steer clear. 0.5/5."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "irfanahmed-00181",
        "review_rating": "2",
        "review_title": "illogical Action,Worst Songs,Worst Dialogues Why they made this movie??",
        "review_detailed_main": "Illogical Action,Worst Songs,Worst Dialogues Why they made this movie?? ONLY STORY IS GOOD...But Acting of all actors included Salman except Anil Kapoor is worst and sucks PLEASE DONT WASTE 2 AND HALF HOURS OF YOUR LIFE..!!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "taru_massey",
        "review_rating": "1",
        "review_title": "Our brain is our brain..none of Salman's Brain!",
        "review_detailed_main": "Nothing could be worst than this, I am grateful I didnt spend money to buy this ticket. I am so glad that I didn't complete the movie rather I couldn't sit and watch for more than 15 mins...utterly disgusting movie which makes no sense..now even I don't have a clue what to write what not to write... no sense movie for nonsense Salman's Fan....I have no idea..this movie was to make other co-stars carrer"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Kolmritic",
        "review_rating": "2",
        "review_title": "Miserable movie. Forgettable.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "1",
        "review_title": "Sallu came to destroy it.",
        "review_detailed_main": "Sallu is by far the worst actor. With race 3 he completely took creative control and messed the whole thing up. He is involved in the script, dialogues and song lyrics. He made a mess everywhere. A guy with zero talent thinks he's so talented that he messed about in all creative areas of filmmaking and look what we have. I hope the original producers realise there mistake and just hire the original team if they wish to make another race movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arnav-07971",
        "review_rating": "1",
        "review_title": "that was an amazing movie",
        "review_detailed_main": "When i went to watch this movie,i felt amazing because i just won the race..i came out of theater very first...i am so happy that i am still alive writing this review after winning that deathly race..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rishabhkadam",
        "review_rating": "1",
        "review_title": "Stay away as far as you can!!!",
        "review_detailed_main": "This movie has a bad plot,terrible acting and the direction is just below average.Total nonsense can be a perfect way to describe this film.Just don't waste your time and money on this film."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "thevarshanmuga",
        "review_rating": "1",
        "review_title": "1 Star for the Memes",
        "review_detailed_main": "People rating this movie 10/10 should be jailed. Apart from Anil kapoor nothing is good about this movie even the Hit song Allah Duhai is also been spoiled."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "limonhowikor",
        "review_rating": "8",
        "review_title": "Few hundred SRK fans trolling out of jealousy.",
        "review_detailed_main": "The movie starts with a bang, like Race 2. Than narrator briefly introduces all the characters and the Race starts. Like previous films this film also has many twist and turns but in my opinion screenwriting of previous films were slightly better. First half is slow coz Salman, Bobby , Anil , Sakib , Daisy all is in lead character so its bound to be slow, coz they had to build those characters and all the lead done good job. There are some unnecessary fight scenes too. Story is bit incomplete but it has a story. Those who are saying that there is no story are SRK fan or Salman haters who wants this film to flop but this film will be a hit, coz it almost has everything to be a entertainer. So go and watch this film in theatre."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "virajmane",
        "review_rating": "6",
        "review_title": "Race and Race 2 was good than this",
        "review_detailed_main": "Movie is overall average songs are bad storyline is below average and overall overrated movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "prith-14919",
        "review_rating": "1",
        "review_title": "crappy",
        "review_detailed_main": "Crappy to the power infinite.. cant help it . crappiest one in crappy town"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "neelaakaash",
        "review_rating": "1",
        "review_title": "1 out of 10 is generous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "prafullasrivastav",
        "review_rating": "4",
        "review_title": "Pathetic combo of Prem Ratan Dhan Payo(Family drama) and Race series(Action)",
        "review_detailed_main": "**Direction:** After making 2-3 Dance driven film, **Remo D'Souza** wants to try his hand in action genre. His first action and Super hero flick **A Flying Jatt** was flop at box-office. This time he got golden opportunity as he has to direct one well established franchise and there is Super Star **Salman Khan** in lead role. **Performance:** This action thriller belong to Salman Only. Other actor has done just justice with their role. Daisy Shah and Jacqueline Fernandez have done brilliant action sequence than dialogue delivery. **Bobby Deol** has good supporting role. Anil Kapoor was less utilized. Saqib's role was not written well. Freddy has small role like Cameo. **Script:** There was no script at all, only action sequence without any logic and plot. Sometime Action thriller turn into family drama like Prem Ratan Dhan Payo. So many flaws in the story telling. **Action:** Action Sequences and Chase sequences were really breath taking. Fight between Daisy Shah and Jacqueline Fernandez was good one. **Cinematography:** This one is another good thing about Race 3 apart from Action sequences. **Ayananka Bose** has done a terrific camera work. **Music:** Race 3 has worst music of last 10 years of Salman Khan. There are lots of experiment done on music as there are many singers and lyricist for each song. Even Salman Khan has written 2 songs where Lulia has sing those songs as well. **Box-office:** It is expected to earn 30-35 crores on opening day. As word of mouth is negative so it will take 3-4 days to complete 100 crores Box-office collection. It will be really tough to cross 200 crores mark in Indian Box office. **Last Words:** Prevention is better than cure."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kingkhanalert",
        "review_rating": "1",
        "review_title": "Worst movie of the decade",
        "review_detailed_main": "I am a fan of salman but this time he is not good at all. Race 3 team spoils race series. Saif was too good in this series"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aj_you",
        "review_rating": "1",
        "review_title": "Nothing to watch in this!!!",
        "review_detailed_main": "Worst story/movie of 2018 bollywood No Logic, everything happens whenever and whatever time! This movie is for 10 year old kids !! in short > billion bullets were shot not even one hit the hero. now you can guess how the movie is LOL (1 star for Atif aslam song and clothes )"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shubham-varshney007",
        "review_rating": "2",
        "review_title": "Every thing Illogical",
        "review_detailed_main": "A perfect senseless movie. First of all SK's movies are senseless and only senseless people go to watch his movies to waste their money. When it comes to action I'm like what the hell is happening everybody shooting with their guns but no bullet even touches the character and when character shoots then everybody dies. In this movie SK is acting like he is the Super Man no body can harm him.It's just Total waste of money if you go to watch this movie in theater. Watch only when it comes on TV."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sahel_kapoor1993",
        "review_rating": "2",
        "review_title": "Possibly the worst movie of salman khan",
        "review_detailed_main": "Salman khan has done many bad movies in the past, but race 3 surpasses all of them and sets a new benchmark thanks to Remo D'souza.\n\nWhen the movie was announced I was pretty sad that Saif Ali Khan was not reprising his role. However the film was marketed as a stand alone film that has nothing to do with the movies in the franchise. The movie has no connection to the race universe and therefore is not a true sequel.\n\nIn addition, the direction is very poor, the movie has no build up, no layering, no character development and having seem the previous films of the director I can only concluded that he should quit direction as it is not his cup of tea."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rifat_ahmed",
        "review_rating": "1",
        "review_title": "Typical Salman Khan Movie!",
        "review_detailed_main": "I wish I could sue Salman Khan and bring back my time and money for this garbage. This movie has to be one of worst movie I've ever seen, I have no clue what the movie is all about and Salman has finally given up that he can't act after Tubelight bombed at the BO so he's back to his comfort sit of making rubbish and 90s style movies. If it wasn't for Anil Kapoor this movie would have been more torture but he kinda holds the movie together. Music was pathetic, screenplay was speechless and acting just out of this world, I'd love to know where they learn their acting from and basically just close that academy or theatre. Remo sir please quit direction because yhh have no clue what to do films is not all about actions scenes and pretty women dancing please leave this industry and go to a jungle. I would I could give this movie -10 but from me 1/10. Horrible Experience!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sahilntc",
        "review_rating": "10",
        "review_title": "Balancinho",
        "review_detailed_main": "Questioned my existence after watching trailer. Questioned Humanity Existence after watching this 3/10 score."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sanakmajumdar",
        "review_rating": "2",
        "review_title": "A few random twists, cars flying can't make a good film.",
        "review_detailed_main": "I've been a fan of popcorn entertainment films. No one can deny that even Salman Khan shines when he works with a capable director Remo D'souza is definitely not one of those directors. Salman Khan described the film as and action film with a little 'Hum Aapke Hain Kaun' even if the film was something like that it would have been far more entertaining. All the other characters are one note except Anil Kapoor who seems to enjoy killing people on screen and having a gala time. As it turns out the most meme worthy moment of the film is not Daisy Shah going \" Our business is our business none of your business\" it's actually Saqib Saleem adding 'bro' at the end of every sentence. Being one of the young adults out there let me say it for the record that WE DON'T TALK LIKE THAT. The problem with Race 3 is that you cannot make a film just to show case the super-stardom of your lead actor I thought that we had stopped making such films."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ankitbhatnagarmail",
        "review_rating": "2",
        "review_title": "Only 1 Time watch movie, But not in late night show.",
        "review_detailed_main": "Dear IMDBérs,\n\nI saw this movie last night in PVR Star Mall Gurgaon, at the 10.10pm show. Believe me, I'm very much disappointed by the performance of all characters, especially Jacqueline and Salman Khan.\n\nI think Salman should think before signing any films because these days his films not performing well. And slowly Salman will lose his shine.\n\nWhen we talk about the storyline, So in one sentence - \"No Story at all\".\n\nSongs were un-understandable. I think after getting the good success of ABCD, Remo think they can do anything. But REMO Sir, it's India, anything can happen at any time.\n\nBobby Deol, Daisy Shah, and another guy, don't know how to act, and this we all knows. :-)\n\nThat's it.\n\nNow think twice before going to watch Race 3 - \"Worst movie of 2018\"."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "samgh-34794",
        "review_rating": "1",
        "review_title": "Bogus",
        "review_detailed_main": "Is there an option for zero rating?? Cuz this doesn't deserve anything more than 0! It's an insult to film making!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sachinbubun-756-585733",
        "review_rating": "1",
        "review_title": "Salman khan should retire",
        "review_detailed_main": "Story is awful. Acting and dialogue worst. The songs are repeated with worst lyrics and dance."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "atulrai",
        "review_rating": "1",
        "review_title": "Worst Film",
        "review_detailed_main": "No Story... Just Car Chase and Crash... total waste of money. I am seeing here some people have given 10 ratings...wow who are those guys?? My family came out in the middle of the movie. I think Remo should stick to dance movies only... Today I have spend more than 1000 Rs. for this torture. Music is also not that good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jittu20032000",
        "review_rating": "1",
        "review_title": "INJUSTICE TO THE ORIGINAL RACE",
        "review_detailed_main": "The movie is lame. its like salman was trying to make a family movie about love and brotherhood. Lame movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "contactpranaysur",
        "review_rating": "1",
        "review_title": "Don't buy movie tickets so that you need to kill yourself after seeing the movie .",
        "review_detailed_main": "Worst movie ! This is another proof that sow stupid and idioyii can a movie be . Illiterate fanbase of Salman made this movie earn but it's absolutely nonsense ! Don't waste money on it ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "iamracersk",
        "review_rating": "1",
        "review_title": "Worst disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sahildesai-08714",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "It just was amazing cause it kept me on the edge of my seat"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chaitanyagulhane",
        "review_rating": "7",
        "review_title": "Some else name had to be given",
        "review_detailed_main": "No doubt that the movie is good but only concern is that the name it has is not suitable. All the actors have done their job very well."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "priyodit",
        "review_rating": "1",
        "review_title": "Race 3 is Soldier reborn",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "DesiBaba",
        "review_rating": "3",
        "review_title": "Too much focus on style without any substance.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nnk-39990",
        "review_rating": "3",
        "review_title": "Bad Movie !",
        "review_detailed_main": "I did not enjoy the movie , it turned out to be a horrible one , climax of the movie was good , missed Saif ali Khan !"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "DhruvinPatel2021",
        "review_rating": "1",
        "review_title": "Till when this torture continue ?",
        "review_detailed_main": "Worst movie. do not waste your time and money. we should now speak up for such movies where the focus is only on one actor, that too criminal."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "neetabora",
        "review_rating": "1",
        "review_title": "Wish we could rate 0",
        "review_detailed_main": "First of all, couldn't get watch entire movie, had to leave in between. Second, I feel sympathy for Salmaan Khan, he pathetically need to retire. Can't go on with an uncomfortable body and tight attires where he can only move his mouth. This movie is targeted for either no-brainer hardcore Sallu fans or people with no sense of a good bollywood movie. Once you start watching sensible movies, you'll feel like banning Salmaan from bollywood. Even kids in India are smarter while choosing their movies. I have no words for people who gave 10 to this."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "somye",
        "review_rating": "1",
        "review_title": "Another Crap Like Tubelight",
        "review_detailed_main": "What the hell is wrong with Salman Khan. He is moving away from content driven films like Bajrangi BhaiJaan & Sultan & Eik Tha Tiger. This movie is a waste of money; they have made blunders in storyline. Man what a rip off!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "totsrus",
        "review_rating": "1",
        "review_title": "I wish I could give 0 star",
        "review_detailed_main": "This is the worst Salman Khan movie I have ever seen. I had to leave right after intermission because I couldn't tolerate it anymore. Worst part was that I took my kids to the movies as I thought it's a Salman Khan's movie so it would be clean and good for the kids. I'm embarrassed in front of my kids. I'm salman's fan but this movie is a total let down. No one was good in the movie..not even Salman Khan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gauravbhanderi231",
        "review_rating": "1",
        "review_title": "Absolute crap",
        "review_detailed_main": "I dont even want to waste writing about this. This is really really stupid movie, i have no idea why anyone in their right mind would like this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hitman_tahir",
        "review_rating": "10",
        "review_title": "Speechless!!",
        "review_detailed_main": "This movie is amazing. You wont be disappointed. People who are rating it below 5 are maybe just jealous of the cast. Im not even a salman khan fan at all. But after bajrangi bhaijaan and this movie i am a fan. Enjoy."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ogaleabhishek-54885",
        "review_rating": "7",
        "review_title": "Average",
        "review_detailed_main": "Race 3 is a average entertainer movie 2nd half of movie is very interesting and gripping it's a one time watch movie Action : 3/5 VFX : 4/5 Acting : 3.5/5 Story : 2/5 Songs : 1/5."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "csrendra",
        "review_rating": "1",
        "review_title": "Worst Movie of the year",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sukhwalsiddharth2",
        "review_rating": "1",
        "review_title": "One of the worst movies ever made in Bollywood",
        "review_detailed_main": "The movie has major flaws. Some of them are:- 1. Pointless Story 2. Poor quality action/fighting scenes 3. Too many unnecessary songs at any random point 4. Relies completely on Salman Khan star fan following 5. Too much overacting 6. Poor dialogues 7. Poor comedy"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shubhjune",
        "review_rating": "1",
        "review_title": "Perfect",
        "review_detailed_main": "Best movie ever watched but doesn't really have any perfect plot"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vidyasagar-99742",
        "review_rating": "1",
        "review_title": "Haven't watched the movie",
        "review_detailed_main": "Neither planning to And don't need to , to give a rating"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chetanrparekh",
        "review_rating": "2",
        "review_title": "Horrible... Don't waste your time and money",
        "review_detailed_main": "It's high time that Bollywood realised that they need a good script and a good story. Simple.... What on earth are these guys thinking when they release the 3rd edition of the successful movie that people are fools and they will just accept whatever is dished out to them\n\nRemo needs to quit directing and concentrate on his dancing.\n\nSalman, you need advice on which movie to do... Seriously\n\nDialogs are best described in one line - Crap\n\nSo save your time... Please"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vjnambu",
        "review_rating": "1",
        "review_title": "Faece 3",
        "review_detailed_main": "Plus: Production values\n\nMinus: Story Screenplay Dialogues Direction Acting Songs Action Length\n\nVerdict: Congrats Sallu bhai and remo for destroying a good franchise."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mukherjeeavirupam",
        "review_rating": "3",
        "review_title": "Save your money.",
        "review_detailed_main": "If you are a smart person, you shouldn't be wasting your money to watch this movie in a theater. If u watch movies just for the not so needed actions and all the obnoxious thrills and don't care about the story and acting, then you will never get a better choice than this one. And lastly, if you are a fan of good Hollywood action movies and advice you not to watch this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mrnileshppatel",
        "review_rating": "2",
        "review_title": "Waste of time and Money",
        "review_detailed_main": "Script is too weak in entire film . Just show off khan and highfi of prodiction . Nothing else. I don't understand why the big star is choosing like this script? In Bollywood they have to bring something new and realistic which audience can digest."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ostilsharma",
        "review_rating": "10",
        "review_title": "Ostil Sharma Race Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "drsarafhospital",
        "review_rating": "7",
        "review_title": "A Good Movie but definitely not the best of Salman Khan and race series.",
        "review_detailed_main": "RATING-6.5/10 The movie went off with a good start and the characters unfold by the time of interval but it is disappointing as a race film and too many songs not reqhired which reduces the thrill."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vaibhav-axd",
        "review_rating": "1",
        "review_title": "Total Disaster..",
        "review_detailed_main": "First thing I want to Ask producers of this movie is Why do they make such nonsensical movie ? The Story Makes No sense at all. Twists are illogical. Action sequence are not upto mark. Screenplay and direction cant be worse than this. Only good this about this movie is it ends. Anil kapoor's acting was ok. Salman's Acting was abysmal. People were comparing its music with Dhinchak Pooja I guess that what happens when Salman writes and sings songs too. This Movie is Prime Example of how a movie should not be made.\n\nWARNING: THIS MOVIE MAY CAUSE SEVERE HEADACHE"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pokhrelnarhari",
        "review_rating": "1",
        "review_title": "Salman Khan!!!",
        "review_detailed_main": "Does this name even need an explanation to know the movie has no premise, logic, plot, or a good direction? Well, judge them for yourselves. And looking at the IMDb ratings of his movies, he will need another lifetime to be half as good as Hritik Roshan. The hope of him being a good actor should just not be a thing. RACE 3 is a perfect example of it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sumanthm-53954",
        "review_rating": "1",
        "review_title": "Run!",
        "review_detailed_main": "For your life and sanity! This movie is a nonstop sequence of twists and turns--in, unfortunately, all the wrong ways. This is certainly one of the worst movies I've seen--ever. I'm giving it one star instead of none simply because some of the stunt scenes seem like they had some effort. By the way, the action scenes in this movie may indeed be the worst of any of Salman's \"magic masala\" action flicks. This movie seems more like a trailer than an actual cinematic piece. It's plot is virtually non-existent considering the incessant attempts to just thwart the reader's each and every prediction on what happens next. Remo D'Souza has gone out of control here. Anil Kapoor is a relief to see on screen, but other than that and the occasional eye-catcher, everything else is a blurry, poorly envisioned, excuse for a fusion of Hum Saath Saath Hain and The Fast and the Furious. I will conclude this with a very accurate comment I found on YouTube about this horrendous film. Race 1: Akshaye Khanna gets screwed, Race 2: John Abraham gets screwed, Race 3: Audience gets screwed!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abhineet150",
        "review_rating": "2",
        "review_title": "Don't waste time even if you Get a free Ticket",
        "review_detailed_main": "The movie is no sense movie. Missed the direction from Abbas Mastan. Remo Dsouza should rather be choregraphing the dance and not directing the action scenes.Its good to see a Choregrapher trying to be a director and Remo was good with the ABCD movie series but cannot make any sense with the action. Audience could have lived without action had the story been good enough but write from the story to dialogue delivery to songs like selfish nothing was in place that could have made the movie magical experience.\n\nAtif Aslam voice is wonderful but Lulia sucks and the lyrics created is really Selfish which was a sequel to 'chal beta selfish le le re'.Pun intended\n\nJacqueline,Daisy,Bobby just looked like puppets as usual because Salman movie is a one man show. Anil kapoor had some role to play which he tried to do justice with but movie and story didn't gave him much opportunity to express.\n\nSongs even the remake of Allah duhai is easy to forget.\n\nAt last save your time. One thing is for sure Salman looks Old now."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arjuncshekartheofficial",
        "review_rating": "1",
        "review_title": "Race 3 Honest review: Sincerely I had stopped watching Bollywood movies completely, after watching this movie.",
        "review_detailed_main": "To be frankly I must say, Race 3 had inspired me to stop watching Bollywood movies forever. The worst movie ever made, I had saw a Dialog \"Ours business is our Business, none of your business\", WTF is this? Is this a movie?! Unnecessary action scenes and BGM is extremely worst. To be frankly, the movie doesn't have a story. To be frank Mr. Remo D Souza , I'm gonna watch my regional film which is getting better in story and content than your useless movies."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mikey79",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Why does salman khan even bother anymore...? He's about as realistic an action hero as Santa Claus and just as fat. Watching him puff his way through probably the worst fight scenes in Bollywood history in this film is just an embarrassment. That first \"took forever\" fight where he just appears through a roof wearing an uncomfy suit to accentuate his tubbiness was painful, while his younger sidekicks kick box their way through an army...awful.\n\nIndians just watch Hollywood films now and rip them off it seems. This made fast and furious look good and that's saying something as it's totally laughable."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kevinparmar681",
        "review_rating": "3",
        "review_title": "RATED 3 FOR PRODUCTION VALUE",
        "review_detailed_main": "SON : MOM I WANT TO WATCH FAST AND FURIOUS MOM : DON'T WORRY WE HAVE FAST AND FURIOUS AT HOME \"FAST AND FURIOUS AT HOME\"\n\nYa'll really should be ashamed of making movies like this ,you literally have the best people working for you in the industry and this is the best you come up with? No wonder indian cinema has become nothing but a laughing stock ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "neoanderson12",
        "review_rating": "2",
        "review_title": "its just like taking all brand of whiskey out there, mixing and serving it to the audience",
        "review_detailed_main": "This is how i summed up the movie. It basically goes to great length to show the audience how the characters are \"daring\" and love the adrenaline rush. Hell if there is a scene in the movie where they need to move a pen from one place to another, they will make damn sure that its as dramatic and action driven as it can be.\n\nThis movie should be placed in the special category: \"putting best actors and lots of money does not make a good movie\""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "leifugynokseg",
        "review_rating": "9",
        "review_title": "Action movie, love and revenge. You will like it.",
        "review_detailed_main": "This is a very good action film. Salman Khan is competitive in this kind of movies. Entertainment at next level."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "asadkhan0810",
        "review_rating": "3",
        "review_title": "Avoidable",
        "review_detailed_main": "Race 3 is nothing like the original Race movie. This is new yet complete nonsense. This movie had a good budget which is clearly visible throughout the movie but the makers didn't spend a rupee on its story.\n\nI've liked few of Salman Khan's movie's before but one can clearly see the lack of efforts delivered by Salman. It's like he's not even trying to make the scene appear convincing. It's just insulting to the viewers.\n\nThe only actor who's done a good job is Anil Kapoor rest everyone badly needs acting lessons.\n\nThe storyline is okay but the movie is terribly made which doesn't make the suspense feel like suspense. Also, the lead role dying and coming back needs to stop in the Race franchise, it's happened in every movie.\n\nThe movie doesn't have any good action sequence either to qualify for action genre, this movie is a family drama.\n\nThis movie is for kids who wishes to see some fancy cars and a tourism ad for the United Arab Emirates."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "varun-76528",
        "review_rating": "1",
        "review_title": "Utter nonsense",
        "review_detailed_main": "Message to Remo. Our business (Movie Choreography) is our business none (Movie Direction) of your business. I have stopped watching Salman Khan movies strictly after this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "utk_utk",
        "review_rating": "1",
        "review_title": "Tough competition to MSG movies.",
        "review_detailed_main": "There can be nothing worse to a Salman Khan flick. It's terribly awful.Copying Hollywood went wrong."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mohit-rathod13",
        "review_rating": "1",
        "review_title": "Worst! movie",
        "review_detailed_main": "Biggest mistake of my life to watch this movie. Worst! movie ever."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rhiturajb",
        "review_rating": "1",
        "review_title": "Worst acting and direction",
        "review_detailed_main": "It's the worst combination of actors and director. Director just copies script from Hollywood and pastes it here. Actors doesn't know what they're doing and the whole movie turns out to be a crap. This movie shouldn't have been made in the first place. Is there a negative rating on IMDb?"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "amithjp-40859",
        "review_rating": "1",
        "review_title": "Total bakvaas",
        "review_detailed_main": "The entire team should be embarrassed for making such a bakvaas movie. I hope they donated all the money to charity. Cannot believe this vast came together for this. All absolutely waste."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "satyamagarwal100",
        "review_rating": "1",
        "review_title": "Avoid watching the movie at any cost",
        "review_detailed_main": "This movie is a insult to Bollywood. Movie should be banned as it is so boring."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "saqibomer-cs",
        "review_rating": "1",
        "review_title": "Horrible storyline and too many songs",
        "review_detailed_main": "This movie is total waste of time. One of the worst movies I have seen. Directors and producers should know that flying cars and horrible story lines and twists not always come out good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ldevi",
        "review_rating": "10",
        "review_title": "Better than expected..",
        "review_detailed_main": "When I first saw the trailer I wasn't impressed. But movie was Pretty good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nkpatta",
        "review_rating": "1",
        "review_title": "Hope there was a -1 review option",
        "review_detailed_main": "Worst movie ever made in the history of Bollywood. Shame on the director and the whole crew to accept a story like that. What was that man, really ? ?? Why Remo D Souza ?? Please stop making movies man. Please work on dancing."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "charithmadushan",
        "review_rating": "2",
        "review_title": "Flop for Salman Khan",
        "review_detailed_main": "Total waste of time with unrealistic events and incidents!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nomanalivenow",
        "review_rating": "1",
        "review_title": "What was that?",
        "review_detailed_main": "Well well well, before I start off, lemme finish it off with one word. GARBAGE. Damn man what was that all about. Feel like committing suicide by watching it again. Total piece of trash."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "krishabh-35133",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "Horrible horrible horrible horrible horrible horrible horrible"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajibnarayandey",
        "review_rating": "3",
        "review_title": "Improve Remo ji",
        "review_detailed_main": "Vaihaat film in world Instead u can watch Zombie Reddy or sarpaata parambarai. Now wht i say? 👍👍😭😭"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shivamvishrockstar",
        "review_rating": "1",
        "review_title": "I never Watch This Movie..",
        "review_detailed_main": "Yes I never watch This Movie But I am Sure this is worst movie.....jo 1 se jyada star diye h vo madharchod h"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "AzizAlami",
        "review_rating": "1",
        "review_title": "Usual Lame bollywood",
        "review_detailed_main": "Salman king of overacting ! Worst script!poor action ! Pointless! Worst director! Avoid it at all cost ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sksdking",
        "review_rating": "1",
        "review_title": "Total waste of money",
        "review_detailed_main": "The whole movie whether it's for viewers or for Producers, its a total waste of money.... predictable story, so over the top action and non- entertaining music, nothing is good about the movie....with this much budget a good movie could have been made but they just wasted all this.and finally, Bhai if you don't want to act just don't do a movie, why to do it unwillingly...."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ayushg-03017",
        "review_rating": "10",
        "review_title": "Bhai's madness",
        "review_detailed_main": "As a bhai fan, I feel highly honoured that I got to watch this movie. The moment when I tear my shirt in the theatre was surreal for me. I hope bhai keeps contributing to the cinema through movies like these. Wating for race 4. Hail bhai the great."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nosubject-81818",
        "review_rating": "1",
        "review_title": "Total Rubbish !!",
        "review_detailed_main": "Absolutely rubbish !! My trash is better to look at than this piece of garbage with salmon khan in it who I can not stand! Why did they not continue with Saif Ali Khan who completely owned it !! He was the main lead both Race 1 and 2 did an amazing job !! That's where the producers went completely wrong. What's the point bringing all the characters but not the main one what a joke! Can not express the frustration !!! There is no point creating a movie sequel with out the main guy who did an incredible job in the first 2 !! Over all story line is trash and what makes it worse is having Salmon Khan as the lead which completely throws the interest out of the window !"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rishirish",
        "review_rating": "1",
        "review_title": "why 2.1? It should have 0.1 Rating!",
        "review_detailed_main": "The movie is just so bad! The lyrics, the dialogues, the acting, the dance, the cinematography, the direction, the actors. Everything is just out of the place!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "giridharreddy-74599",
        "review_rating": "1",
        "review_title": "Give me back my brain cells",
        "review_detailed_main": "No logic, No brain, no common sense is put into this film. I laughed at the wrong time and cried at the wrong time. I hated every dialogue that came out of the actors' mouths, especially when they say, 'bro'. It was so cringe that I fell off my sofa. I want to punch the actors who played the twins., especially the girl, her make up was drooling from her face and she looked ugly as hell. Salman Khan did a very atrocious acting. The two things that are good in this movie are the locations and cinematography. The director should not make another movie again, please stop with your illogical and dumb movies."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "wwwaviavinash",
        "review_rating": "1",
        "review_title": "One star only anil Kapoor",
        "review_detailed_main": "Aise movie kuyn banate ho. I love Only race first part All sequels are wrost ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "CINEBIND",
        "review_rating": "1",
        "review_title": "What a waste of my time (0/10)",
        "review_detailed_main": "This movie should be named as 'Our Stupidity is our Stupidity, watching this movie is your stupidity'\n\nRemo D'Souza should not be allowed to make movies.\n\nThere is no story, it's just bunch of people telling bunch of stuff to each other which don't make sense. And ridiculous plot twists.\n\nLaughable screenplay if that actually exist in this movie. The songs can give you migraine. Every one in the film don't care at all for the movie.\n\nIt's a big budget expenses which you won't see any productivity.\n\nI want the 2:30 hrs of my life back after watching this god awful thing.\n\nI could have taken nap or brought stuff for house rather watching this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "omkarbanerjee-16133",
        "review_rating": "1",
        "review_title": "WORST THAN BLUE WHALE GAME",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "beta-08539",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Over-stylized tripe.\n\nI usually really enjoy Bollywood films and unlike most Americans, I've seen hundreds of the films. Sure, there have been a few stinkers here and there but nothing like \"Race 3\" because this film has the distinction of being the only Indian film now on the infamous Bottom 100 list on IMDB. With a pathetically low score of only 2.1, it really is a film that few people have loved! Will I be yet another person who thinks this is an absolutely terrible film??\n\nYes. I thought the film was terrible as well and for two big reasons. First, the entire story is about a family of monsters. Don't get the wrong idea, they aren't literally monsters but rich folks who are arms merchants who will sell to ANYONE and who are all lethal killing machines. The father built up the company and apparently trained his twin son and daughter to be self-absorbed murder machines as well as his adopted son. During the course of the movie, they murder dozens and dozens--with an ease that would scare away the Terminator and they look as if they just walked off the cover of 'Vogue\" or \"GQ\"!! They are simply evil scum...and the movie seems to romanticize them and it's also really hard to care about anyone in the film. Second, the film is over-stylized to the point that it was ridiculous. The fights were downright silly--with too much slo-mo, mid-air spins, bullets having no effect on any of them and all while wearing the most stylish fashions. It seemed silly...really silly...especially when one of them literally jumped from thousands of feet to join in the fight while wearing a bat-like suit and then crashing into the warehouse. He and his sibs then wiped out a veritable army of well armed soldiers...and none of them broke a sweat nor got injured!! I really wish instead they had spent less time and money in making these ridiculous fight scenes and simply filmed them as if the leads were humans and not gods!! It was simply ludicrous...and seemed almost like watching the Kardashians starring in a super-over stylized Bond film!! Laughable to say the least.\n\nI lay all the blame for me hating this movie on the director and producers. They never showed ANY restraint and should have dialed back on the crazy super-human aspects of the movie as well as the constant blaring music and super-wealthy locations and costumes. None of them seemed to wonder if they were creating a film that was less an entertaining drama and more an unintentional but unlikable comedy. Oh, and I didn't even mention the song and dance numbers. They ARE common in Indian pictures...but the amount of auto-tuning they did make for some weird techno-sounding singing....though the dancing itself was pretty typical for Bollywood.\n\nRarely have I seen this much money spent to create a film this dumb.\n\n3 out of 7 found this helpful."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "harshj-71594",
        "review_rating": "1",
        "review_title": "Not Worth Watching",
        "review_detailed_main": "This movie is not worth watching even on television. Can't Understand why some people are mad about salman khan.Childish dialogues,bad storyline,bad acting especially by Daisy Shah and Salman Khan.Anil Kapoor tried to save the film but failed to do so."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "insurelicence",
        "review_rating": "10",
        "review_title": "Movie was Fantastic",
        "review_detailed_main": "I am really very happy after seen this movie. every seen and suspect in this movie are really interested i would like this movie better then both race 1 and race 2..\n\nlovely movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "saptesh786",
        "review_rating": "1",
        "review_title": "Boring : Styles than thriller",
        "review_detailed_main": "It is a movie that appears every fight scene with styles rather than thrill. And styles impressed you ? Never. I say honestly that I was enjoying last fight scene of Salman Khan with not feeling any tension like a child playing a game. Anil kapoor looking very tired and no spark of acting. Who makes such bloody directors ? What is use of acting institutions in India ? To making such foolish movies ? One and another. When those directors will learn from Hollywood ? In such story they would make a interesting movie. The bad side of this that people also making hit such hopeless movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sdrose-41994",
        "review_rating": "1",
        "review_title": "LOL",
        "review_detailed_main": "Another one in the list of Tees mar khan , himmatwala etc..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ghoshsoham",
        "review_rating": "1",
        "review_title": "RACE 3 is a perfect garbage of stardom and foolishness mixed together.",
        "review_detailed_main": "It's easy to run alone in the field and win the race, and that's what happens with Salman Khan every year on Eid. I am not a hater of Salman Khan, I am a hater of horrible movies. Tiger Zinda Hai was pretty good, but this one proved to be horrible.\n\nFor making a sensible and watchable movie we need a proper storyline (I doubt, whether Race 3 had any) a set of actors who can act (I need a microscope to find one out there) and songs which we could hum for a couple of days (Let's not talk anymore about the songs, because I cannot find a single thing to appreciate about them, I mean, none of them are worth hearing twice).\n\nHow can we forget the \"meme - worthy\" dialogues and the \"beautiful\" lyrics written by the megastar Salman Khan?!\n\n\"Our business is our business, none of your business\". \"Ik baar baby selfish hoke apne liye jiyo na.\"\n\nNow let's talk about the previous two movies of the Race series: -Race was absolutely brilliant, let's say it proves \"Old is Gold\". Race 2 was my favourite. Race is Saif Ali Khan's and it will only be his. Race without Saif, Dabangg without Salman and Dhoom without Hrithik is meaningless. Believe me, save your money. Please don't waste it on Race 3.\n\nInstead, watch Sanju on 29th June. Practically, there is nothing good about this movie except the beautiful cars shown flying. Salman here is a cluless stuntsman. Now, he should realise that stardom does not make a movie, a proper storyline and fine acting makes one.\n\nI would rate this movie 1 out of 10.\n\nRatings of the songs: -\n\n(1) Heeriye: 1.5 out of 5 (2) Selfish: 0.5 out of 5 (3) Allah Duhaai Hai: 2.5 out of 5 (4) Party Chale On: 0.5 out of 5\n\nOverall: Horrible (1 out of 5)\n\nRating: -\n\nDirection: 0.5/5 Dialogues: 0.5/5 Screenplay: 0.5/ 5 Music: 1.0 / 5 Action: 2.0 / 5 Visual appeal: 1.5 / 5\n\nOverall: Disaster (1.0 out of 5)\n\nBox office prediction: - (Lifetime) 200 to 220 crores in India because I know that even after saying this much, insensible Salman fans will go and watch this movie and make this crap a blockbuster.\n\nThat's my review for Race 3."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "Over-stylized tripe.",
        "review_detailed_main": "I usually really enjoy Bollywood films and unlike most Americans, I've seen hundreds of the films. Sure, there have been a few stinkers here and there but nothing like \"Race 3\" because this film has the distinction of being the only Indian film now on the infamous Bottom 100 list on IMDB. With a pathetically low score of only 2.1, it really is a film that few people have loved! Will I be yet another person who thinks this is an absolutely terrible film??\n\nYes. I thought the film was terrible as well and for two big reasons. First, the entire story is about a family of monsters. Don't get the wrong idea, they aren't literally monsters but rich folks who are arms merchants who will sell to ANYONE and who are all lethal killing machines. The father built up the company and apparently trained his twin son and daughter to be self-absorbed murder machines as well as his adopted son. During the course of the movie, they murder dozens and dozens--with an ease that would scare away the Terminator and they look as if they just walked off the cover of 'Vogue\" or \"GQ\"!! They are simply evil scum...and the movie seems to romanticize them and it's also really hard to care about anyone in the film. Second, the film is over-stylized to the point that it was ridiculous. The fights were downright silly--with too much slo-mo, mid-air spins, bullets having no effect on any of them and all while wearing the most stylish fashions. It seemed silly...really silly...especially when one of them literally jumped from thousands of feet to join in the fight while wearing a bat-like suit and then crashing into the warehouse. He and his sibs then wiped out a veritable army of well armed soldiers...and none of them broke a sweat nor got injured!! I really wish instead they had spent less time and money in making these ridiculous fight scenes and simply filmed them as if the leads were humans and not gods!! It was simply ludicrous...and seemed almost like watching the Kardashians starring in a super-over stylized Bond film!! Laughable to say the least.\n\nI lay all the blame for me hating this movie on the director and producers. They never showed ANY restraint and should have dialed back on the crazy super-human aspects of the movie as well as the constant blaring music and super-wealthy locations and costumes. None of them seemed to wonder if they were creating a film that was less an entertaining drama and more an unintentional but unlikable comedy. Oh, and I didn't even mention the song and dance numbers. They ARE common in Indian pictures...but the amount of auto-tuning they did make for some weird techno-sounding singing....though the dancing itself was pretty typical for Bollywood.\n\nRarely have I seen this much money spent to create a film this dumb."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Arnie93",
        "review_rating": "1",
        "review_title": "Zero was not an option so 1",
        "review_detailed_main": "Wow if this money was given to a better story and director it would have been better than this pile of s**t. I have never liked Salman Khan as an actor now I hate him even more. This is what is ruining Hindi movies reputation world wide."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rk-12541",
        "review_rating": "1",
        "review_title": "Really ??",
        "review_detailed_main": "1st of All, Its a big no, its not late 60's in bollywood where you can afford good action directors, and such dialogues Gosh come on man, it was supposed to surpass Race, and Race 2 but this is Pure Crap, even a bhojpuri film would've been done better."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "swissritzfreelancer",
        "review_rating": "1",
        "review_title": "Its DisgRACE",
        "review_detailed_main": "Its worst Salman movie in years. I think the last bad movie was Main Aur Mrs Khanna. He is very lazy in this movie, first half is snooze feast. Movie picks in last 40 mins but by that time, your brain is fried so much that you don't care what is going on.\n\nLazy movie, Salman doesn't care , Daisy is in most of the movie . Very bad songs . I found love and Selfish are hillarious."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nikhilsikka",
        "review_rating": "4",
        "review_title": "brainless! not a Race film",
        "review_detailed_main": "It will not be wrong to say that this film is nowhere a race series but forcefully titled just to cash in the brand RACE. A poor attempt to make a family drama into such a hugely betrayal drama genre, just because of Salman Khan and brand RACE it covered up the production cost it is a big mistake done by everyone involved. it is SALMAN SALMAN and just SALMAN all the go."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ahussain110",
        "review_rating": "10",
        "review_title": "Haters or What!!",
        "review_detailed_main": "Not a bad action movie. A bit of thrill and suspense but what do you expect it's Bollywood. Instead of down graded a movie which is full of action you folks should be supporting Bollywood Goreh ke chamchey.Eh Salman is Salman, Bobby deol is back, some new actors, Nice Indian actress forgot her name \"shame\", Anil kapoor is alway's good at whatever role he plays. Songs are advanced but not typical. Over all in support of Bollywood and Apne I'm giving this 10* keep the good work up you will make it at the end. Learn of your mistakes and better yourself's........"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "omiazad",
        "review_rating": "2",
        "review_title": "Salman Khan should chose his movies carefully",
        "review_detailed_main": "The making of the movie is very bad. Sorry for being so straight forward. Feels like someone got enormous amount of money and did not have any place to spend all those money, so decided to make this movie with high budget cast. Spent all the money on cast and action, but not on story. I did not understand how come Salman Khan signed the movie. Even I believe some of the shots have been taken with DSLR with wrong frame rate. I gave it 2 stars because I usually give 1 to the movies I cannot finish. So consider this as 1 any ways."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rehmankhilji",
        "review_rating": "1",
        "review_title": "Absurd and ridiculous",
        "review_detailed_main": "Salman Khan is a brand name and that is only reason movie made some money. Rest is completely horrible, overly done, stupid and simply ridiculous. Movie has many stupid direction, idiotic dialogues and timeless songs. Firstly the made a huge cast, over and huge cast, further had no idea how to adjust them in movie timeline. The Mastan bro's at least know how to make an action movie and if a twist is required how to place it. In this addition of Race there is more than one twist, every character is having a twist and in the end movie is complete disaster and nothing else. One of the villains, as there are so many, having two female body guards who are displayed everything else in the movie but body guards. Over use of cars for no reason at all, guns and heli's and fights are simply stupid. Lastly, as always topless fight of Salman Khan is there. Daisy shah highly unimpressive, Anil Kapoor Wasted and Remo D'Souza stick with dances please. This is not your thing. Jacqueline Fernandez, lara croft outfit in the end, STUPID."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "iSatchit",
        "review_rating": "1",
        "review_title": "Stay away",
        "review_detailed_main": "I was really bored and I had nothing to do , so i thought to watch this movie. It was one of the biggest mistake of this year. Stay away , its not worth it"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "thefilmyexpress",
        "review_rating": "2",
        "review_title": "Worst Bollywood Movie of 2018",
        "review_detailed_main": "I Think This is biggest Flop Bollywood Movie of 2018. thefilmyexpress.com"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aanishjangra",
        "review_rating": "3",
        "review_title": "The word \"Pathetic\" finds a new meaning",
        "review_detailed_main": "This movie has just decimated the whole franchise of Race. Before interval, we keep wondering why the hell are we even in this theatre. The \"illogical and dumb\" twists after interval have made me rate it 3/10. And please dont even talk about the songs. First of all, they have been placed randomly just everywhere. Secondly, who the hell writes those lyrics?? Which drug do they inhale before writing such cringeworthy songs?? If you're planning to watch this movie, please abandom the plan right now. It's crap. And your hard-earned money will just encourage them to produce more such rubbish."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "cosmicbadal",
        "review_rating": "1",
        "review_title": "Lol Movie of Era",
        "review_detailed_main": "106 cr in 3 days a big big lol. big joke business. Bakwaaas movie. Bakwaas Acting, Bakwaas Direction, Bakwaaas Songs, Bakwaas Actors. Money is buying everything."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arjun-87198",
        "review_rating": "1",
        "review_title": "A clear winner in the race for \"the most pathetic film ever\"",
        "review_detailed_main": "A successful franchise,huge star cast, holiday release and SALMAN KHAN. \"Race 3\" has all the ingredients to make a perfect blockbuster masala entertainer and hopes to be Salman Khan's 4th entrant into the coveted 300 cr club. So does the 3rd film in the \"Race\" series match up to its predessors and the hype generated?. Lets find out.\n\nStory: First of all, there is no story to review so this section should have been left blank. There is literally no plot, the characters are flat and one dimensional, there is no conflict, while watching the film I was wondering whether the person who wrote the film has any knowledge of basic storytelling or any sense of creativity. The dialouges are cring-worthy and it seems they were written by a 4th grader. The plot twists which are a trademark of the Race franchise are predictable and plain stupid.Even the most loyal of Salman Khan fans will find it hard to digest this joke of a screenplay which is lost in this 130 crore disaster of a film.\n\nDirection,Editing,Production: I think Remo D Souza should just stick to being a choreographer as Direction is clearly not his cup of tea. His take of the Race series is a huge downgrade from that of Abbas-Mustan who gave the Race series its own trademark feel. The intelligent story telling of Abbas Mustan is clearly missing.You know a disaster is bound to happen when you give a below average director, a weak script and thats exactly what happened. The production design and Cinematography is top notch and slick which gives the film a stylish look.\n\nActing: Even an AI Robot can offer more expressions and better dialouge delivery than Salman Khan in this film. Salman Khan's casting is a complete misfit and you will definitely miss the suave Ranveer Singh played by Saif Ali Khan. Salman Khan comes out as a sore thumb and its pretty evident that he just sleep walked through the film. Unfortunately, Bobby Deol has made a forgettable comeback and he has again proved that he simply cant act. Daisy Shah and Jacquline Fernandes have simply been cast to up the glamour quotient of the film. Even a talented actor like Saqib Saleem is wasted. Only Anil Kapoor's performance is the sole saving grace of the film and he has done a commendable job given the pathetic script he was given to act for.\n\nMusic: This has to be one of the most ridiculous soundtracks of all time. Each and every song is just plain bad with even worse lyrics. The Allah Duhai hai theme song is the only hummable track in this disaster of an album.\n\nUnderline: No style and No substance. The film has clearly lost the race against its predessors and even a stupid Race 2 looks like Inception in front of this film.The only race this film wins is for \"worst movie of the year\" and its just June."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sansbrahma",
        "review_rating": "1",
        "review_title": "Totally waste of money..",
        "review_detailed_main": "It is one of the worse movie i have ever seen in my life"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "zefmaani",
        "review_rating": "10",
        "review_title": "A Fantastic Action Thriller Film",
        "review_detailed_main": "Today, I watched the biggest Bollywood action thriller film ever made. #SalmanKhan has outdone Vin Diesel in style, action and dialogue delivery.\n\nEven if you are not a #SalmanKhan fan, the film gives you an exciting story, marvelous cinematography and great performances in Anil Kapoor, Bobby Deol and Freddy Daruwala.\n\nJacqueline makes the film hotter with her dances and actions. The highlights of the film I would say is the never seen actions which are picturized at grand scale.\n\nSalman is top notch, Anil Kapoor is pitch perfect in the film and most importantly, #Remo D'Souza surprises you with his sharpe direction.\n\nBecause I liked it very much and enjoyed it a lot, I give it 10/10. Go and watch it even if you are not a traditional Bollywood movie goer or Salman Khan. It will entertain you a lot and you will have a great day a great weekend discussing every bit of the film.\n\nRace3 will be a blockbuster film. My business rating for the weekend in India is 125 crores becoming the highest grossing weekend and 330 to 350 crore lifetime in India and $25-30Million in overseas.\n\nI watched it in 3D and it was another experience altogether. It is a clean family film with no embarrassing moment."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arnavratan",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Pathetic. It had random plot twists that didn't make any sense. Nothing about the movie justified the name. It's painful to think about the movie while writing the review. Save yourselves some time and don't watch this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "keshab-60114",
        "review_rating": "2",
        "review_title": "Big Loss to the industry",
        "review_detailed_main": "Why the film was even made I don't know.Why I been for this movie, that is also I don't know. It self from the starting you will get to know that this film is a pure garbage. Acting direction, songs are below average. In few scenes you will feel like I can act better than Salman, though I don't know why the person sitting next to me is clapping(may be a fan) I won't lie, I love the climax. Don't go for this movie and if you go don't go for 3D. There was no screenplay in the film, all are just doing their own things and It's really annoying to watch salman for 2 hours. Selfish song can kill you, better take loo time. It's just a high budget film with unnecessary stunts and blowing off cars. Childrens below 15 might like the film. Better go for veere di weeding ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "deysauradeep",
        "review_rating": "1",
        "review_title": "Director and actors should get their brain checked.",
        "review_detailed_main": "One of the worst movies of all time. Bollywood just hit a new low. The director of this movie and the talentless but famous actor Salman Khan should first decide whether to make movies or make spoof videos because clearly, they have completely failed to grasp that \"tatti\" cannot be passed off as serious movies."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mr_mohsinbaig",
        "review_rating": "3",
        "review_title": "dishaaoooo movie",
        "review_detailed_main": "No race in movie. story do ! keep twisting every 5 mins with extra action, wealth and kind of romance. poor acting other then anil kapoor. songs are average."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "parakhmayank17",
        "review_rating": "3",
        "review_title": "Insult to the Bollywood industry",
        "review_detailed_main": "The movie is so bad that you would seriously regret going to the theater. The awful movie is intermingled with songs that is even worst than the movie. The movie at times is so bad that, you can't judge which actor is the worst. Acting: The best acting is by Daisy Shah. So it's so obvious that the entire cast is either overacting or not trying at all. Salman Khan and Bobby Deal are horrible fit in the movie. to top it all even Anil Kapoor seemed to be overacting.I would have rated it 1 but the additional 2 stars are for the actresses who did a decent job. Direction: Remo D'Souza is by far the worst director for the race series. He's just blown as many cars as he could and tried to show the lead actors ripped and thought it would make a great movie. Music: Awful, awful, awful!!!! No better words to describe. This is perhaps the worst compilation of songs in a film ever. Script: In the name of twist and turns they serve old stale movies as a combo!!! Best to avoid this nerve wrecking film !!!!! This film is an insult to Bollywood movies !!!!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "seokishore",
        "review_rating": "1",
        "review_title": "Save Money- Save Time- Don't Watch Race -3",
        "review_detailed_main": "Saif Ali Khan is Best for this Race Movie not Salman Khan. No story, wrong casting only Anil kapoor acting is good. Totally time and money waste."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mohit_sinsniwal",
        "review_rating": "3",
        "review_title": "The movie should've been named disgRACE 3",
        "review_detailed_main": "While films like Parmanu, Padmavati, Padman, Sonu Ke Titu Ki Sweety , 102 Not Out, Hichki or even Blackmail were treat to eyes in the first half of 2018 giving hope that Bollywood movies have matured but then there comes a crap like Race 3 that will spoil your mood and you will wonder that if the makers are taking the audience for granted.\n\nRace 3 tells the story of a dispute between a family when Shamsher Singh (Anil Kapoor) decides to give half of his wealth to the adopted son, Sikander Singh (Salman Khan) and the rest of it between his own kids, Suraj (Saqeeb Saleem) and Sanjana (Daisy Shah).\n\nDirected by Remo D'Souza, who has made a decent film ABCD and pathetic ones like A Flying Jatt and ABCD 2, Race 3 is one hell of a journey which you wish to forget once you leave the theater. Right from the opening scene of the film to the climax, forget about logic, even the story is full of potholes. There is some breath of air when Anil Kapoor tells about his plan but again the film goes back to the loop hole and sadly does not recover. The first film Race (2008) was brilliant with solid twist and turns followed by an average Race 2 (2016). Race 3 is a nightmare which you should get over immediately with as it will haunt you, the more you think about it.\n\nNone of songs are good (surprisingly music is composed by brilliant duo Salim - Sulaiman). Action scenes , though few scenes were fine, but again gone overboard. Race 3 is high on production values and less on content. Dialogues are horrible and funny especially - Our business is our business , none of your business. Even the Bhojpuri language used in between the scenes is irritating.\n\nComing to the performances, none of the actors have done justice to their role. I do not understand why Salman Khan is repeating himself, even though he is in Bollywood industry for more than 25 years. The actor, who was superb in films like Dabanng and Sultan, should start experimenting with roles. Anil Kapoor is fine but could have been better. Bobby Deol makes a decent comeback but sadly not enough to leave any impact. Lesser spoken about Saqeeb Salim, Daisy Shah and Jacqueline Fernandez, the better.\n\nOverall, Race 3 is an insult to Bollywood. Avoid it any cost."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "marufmaruf",
        "review_rating": "1",
        "review_title": "Best Bad Movie of this YEAR 2018",
        "review_detailed_main": "It can't get any worse than this. Pathetically mind boggling piles of Garbage actions filled in this movie. The director should be BAN from Bollywood forever!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mitulgajera",
        "review_rating": "10",
        "review_title": "Mega Blockbuster of the year...10 on 10",
        "review_detailed_main": "RACE 3 is a excellent masala entertainer and Fully Paisa vasool and Seet-Maar Movie of the year. It has High octane action , Powerfull Visual and cinematography , awesome 3d effects , good songs and It's Salman Show all the way with Mysterious twists till the end...U can't guess about the suspense till climax and it will be shocking.Anil Kapoor and Bobby Deol also steal the show.Bobby is back with a bang,Go with your family.Don't miss it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shohag-54801",
        "review_rating": "1",
        "review_title": "Worst Movie Ever!",
        "review_detailed_main": "It will be classic Worst movie! Salman khan became poor actor! No #1 Flop movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashish-38731",
        "review_rating": "2",
        "review_title": "Race 3 is out of Race!!!",
        "review_detailed_main": "Though I am huge fan of Salman but i personally didn't find the movie worth watching .The movie is based on cliche family drama with deception ,secrets and unwanted twists ,which lacks the soul and creativity. Just fight scenes and cars wouldn't make people happy."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mansimrat",
        "review_rating": "3",
        "review_title": "Below Average",
        "review_detailed_main": "Though tried to create a lot of thrill n suspense but failed. Stunts and action sequence are not up to the mark.There is no sign of acting except for anil kapoor. You should see this flick if you are a bhai fan .Otherwise it is waste of money and time. Instead of it you should go for Jurassic world. It is at least enjoyable."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "bvnisarga",
        "review_rating": "1",
        "review_title": "Style with no Substance",
        "review_detailed_main": "Where do I even start about Race 3??? There is not one positive aspect. To be expected to watch this, just because it has Salman Khan is basically saying that the makers of this film are treating the audience as mindless idiots. Throughout the movie, I felt exasperated, angry and harassed. The ridiculous songs with the stupid 'hinglish' lyrics made me want to pull my hair out. There is no plot, no acting and no direction. The original 'Race' franchise is fun and cheesy but this movie was complete torture. I wish I could un-see Race 3 and get my precious time back."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "guptajai-13454",
        "review_rating": "5",
        "review_title": "Not up to the mark.",
        "review_detailed_main": "Story - Totally a loose story. The secrets are also not revealed properly.The shocking reaction of people about secret revealing is absent there. Acting - Only Anil Kapoor has done wonderful acting. Direction-Remo has done a average direction.. As he had got this film very late so he doesn't got time to work on it. Music - Only two songs Heeriye and Party on and on are good. Whats good-Screenplay and cinematography are wonderful. Whats bad-Story, Editing, Unnecessary addition of songs. Watch or not - If you are totally free and want to see good action .. So you can go and watch."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nasir-mahmood44",
        "review_rating": "1",
        "review_title": "Poor in each and every area.",
        "review_detailed_main": "Poor Direction, Poor Direction, Poor Direction, Poor Acting, Poor Action, Poor Cinematography, Poor songs, name any area and its poor. A complete disaster. After 15 mins into movie half of our group decided to leave. Poor Cast. A drone camera took 50 times arial shots of abu dhabi. Aneel kapoor was wearing sweater and coat in 50 degree temperature. Where was director's mind? Bullets Bullets Bullets and non sense bullets. Complete senseless action. Lack of detail."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "wittyrandhir",
        "review_rating": "1",
        "review_title": "Worst movie to be ever made on this planet",
        "review_detailed_main": "Great work Remo, Great work Sallu Bhai and Great work by Daisy Shah.. And good work by all the other actors.. You guys are terrible actors and directors. Go and please find some other profession."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "neetabora",
        "review_rating": "1",
        "review_title": "Remo you're the worst director!",
        "review_detailed_main": "No physics, no logic, no story, no sense, just pure frustration is this entire movie. I adored Remo for his dancing skills but this movie prooves he's the most pathetic director. Please read the reviews and just stop directing bollywood movies. I wish iMDB started 0 rating. **Puke**"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hitman_tahir",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": "This is an amazing movie. Salman khan has done it once again. Please dont hate. Just appreciate. Eid mubarak."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "adityavishwak",
        "review_rating": "1",
        "review_title": "# NO_more_Salman_movies_ever",
        "review_detailed_main": "Went to watch this movie just because of the franchise reput, but it was more of a mindless Salman promo video than a thriller .\n\n# NO_more_Salman_movies_ever"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "poornaharitha",
        "review_rating": "1",
        "review_title": "You can't take it",
        "review_detailed_main": "Trust me just after 5min of the movie you will come to know that you cant resist watching anymore. There is no content, nothing makes sense at all from the start of the movie. I only liked Anil kapoor's acting in the movie, Salman's acting was with no sense of emotions and fake."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sumanth-05484",
        "review_rating": "1",
        "review_title": "Watch it for your Guilty Pleasure",
        "review_detailed_main": "Wow really It is So Entertaining , Stunts are Crazy, And Those Twists wow Really Nolan Level Twists.\n\nPlease Put Your Brain Aside And Watch this Movie.\n\nIf you have a Guilty Pleasure of watching Cringy Contents then You should Watch this."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Marvelofindia",
        "review_rating": "1",
        "review_title": "Another Bollywood thrash",
        "review_detailed_main": "Without large hindi speaking belt .. They can't earn single dollar in anywhere .. They takes audience for granted ..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mohsinahmad78692",
        "review_rating": "1",
        "review_title": "Wrost movie of the year",
        "review_detailed_main": "Wrost as wrost movie of salmaan..it is first movie who get me body pain..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ujjwalbennington",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Never waste your internet data and money on this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "1",
        "review_title": "Watch at your own risk",
        "review_detailed_main": "1. Rip logic.\n\n2. Rip story.\n\n3. Rip dialogue.\n\nWatch carefully. After all your money is your money, none of our money 😂"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shuvendukool",
        "review_rating": "1",
        "review_title": "Simply Pathetic",
        "review_detailed_main": "I don't understand a simple thing, why Bollywood accepts an idiotic pathetic and disgusting movie like this. I don't even want to spell the name of it. Indian audience should definitely boycott this kind of movies which doesn't add any value neither to the society nor the Bollywood industry. It's quite obvious with the fact that Google shows salman Khan as the worst actor not because of this movie, the fact of the matter remains that he is one of the worst actors in Bollywood. The significant job of any actor should be only Acting nothing beyond that and Salman Khan is one of those who actually doesn't know any kind of Acting. Public should be clever enough to judge which kind of movies to watch. This movie franchisee in any way is worst and don't resemble anything which adds value or form of entertainment to the society. Audience shouldn't waste money on movies like this!!!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "cdcrb",
        "review_rating": "8",
        "review_title": "lots of fun",
        "review_detailed_main": "One up man ship personified in a family of schemers. lots of musical numbers. sort of james bondish. I had a good time. I don't understand all the negative reviews."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "muzahid-13629",
        "review_rating": "1",
        "review_title": "worst movie of 2018",
        "review_detailed_main": "We didn't expect movie like this from super star salman khan & anil kapoor! west of time and money. un professional work can be noticed everywhere in movie. remo is not a good director but i wasn't knew that he's such kind of bad director!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "uday-27970",
        "review_rating": "1",
        "review_title": "disaster movie of salman and team",
        "review_detailed_main": "Very bad movie and script selection by salman khan and worst direction of remo d souza. waste of 3 hours in your life. no songs, no dailogues and no music.\n\nOnly suitable for salman hardcore fans."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "designribs",
        "review_rating": "1",
        "review_title": "Save your time money and brain cells from exploding",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashish-48601",
        "review_rating": "1",
        "review_title": "Pretty sad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shreeshachatra",
        "review_rating": "1",
        "review_title": "I gave 1 star because there was not an option to give it any less than that",
        "review_detailed_main": "Absolute garbage and pathetic. If you ever feel you are the worst actor, just see this movie and you will feel better"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anasbmm",
        "review_rating": "1",
        "review_title": "Worst movie ever!!!!!",
        "review_detailed_main": "Please dont waste ur time and money, id rate 0 if i had the option. get over bhai already he cant act, full of overacting and stupid dialogues"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashokkrajput",
        "review_rating": "1",
        "review_title": "Crap movie !",
        "review_detailed_main": "This is a crap only, i you want to suffer with mental torture, you can go with it"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mmgamerhouse",
        "review_rating": "1",
        "review_title": "What is this",
        "review_detailed_main": "Just what, this movie is better of not being watched. Idek what just happened"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "iersadali",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hchhabra-22167",
        "review_rating": "1",
        "review_title": "DON'T WATCH THIS!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nikhilpatel-06355",
        "review_rating": "1",
        "review_title": "worst bollywood movie ever",
        "review_detailed_main": "Worst bollywood movie ever. they spoiled the actual Race series. don't watch at list one time. advice every one to never watch this movie. now a day Indian generation on wrong way. because there are so many movies like parmanu is the best movie but no one cares. they are blindly follow some particular actor. wasting of time and money."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "salemali-86587",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Worst movie Salman khan was my favorite hero but really this movie is a shot. Plz don't waste time in this movie I don't know what happen to Salman bhai his movies were too good in older times put now a days😪 I don't know what happen to him."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ayanbosetatai",
        "review_rating": "1",
        "review_title": "I wish 0 I could rate for",
        "review_detailed_main": "This happens when someone takes audience for granted, it's a mental torture."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "siddhantawaits",
        "review_rating": "1",
        "review_title": "Worst movie ever made in Indian cinema",
        "review_detailed_main": "Baseless story. Only slow motion TikTok type scenes. I am a huge fan of Salman Khan. But being honest this movie is the worst movie of SK. Do not waste time and money. Humble request to you all. Stay safe from this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rahulshuklabu",
        "review_rating": "1",
        "review_title": "Number One Movie. Giving it 1 Star",
        "review_detailed_main": "This is the finest movie made in long time. Given his past, Salmaan had it coming. Deserves 1 star , the best rating."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "saifalikhan-47526",
        "review_rating": "1",
        "review_title": "Cartoons",
        "review_detailed_main": "Aah I am watching movie or drama of some morons..what are you doing salman?I believed you but you disappointed me...I will never forget this torture"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "moumitasarkar-92100",
        "review_rating": "1",
        "review_title": "Don't watch this 3rd class Movie",
        "review_detailed_main": "Worst Movie Ever. I wish I could give 0 ratings. They just wasted their time and our time as well."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "diwanevasant",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "Best movie i think very very superb and invincible . so guys see first and deside . i think just like a paisavasul movie . enjoyable incridible and full of action film."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shivangtiwari-81436",
        "review_rating": "1",
        "review_title": "Pandemic",
        "review_detailed_main": "We faced bigger pandemic than corona back in 2018 itself."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "a-arora62",
        "review_rating": "1",
        "review_title": "race franchise was killed by salman :/",
        "review_detailed_main": "If only I could give zero stars, salman khan thinks he give a twist ending at the film. what was this some 90s melodrama ? film tried to launch boby deol as film star again but I think his face expression do not want to work again. After watching Race i feel kind of bad for deol family overall. and that bojpuri accent all tried. guys! you are spending so much on the movie hire a professional to teach you something. logic left this film in first 10 minute."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ishitanayak-42235",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shashanklashkare",
        "review_rating": "1",
        "review_title": "Action was ok ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abhishekbora-95639",
        "review_rating": "5",
        "review_title": "Superhit movie",
        "review_detailed_main": "Movie give good msg about family.\n\nActing was good Story line is normal."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nehapd118",
        "review_rating": "1",
        "review_title": "Worst movie of all times",
        "review_detailed_main": "Worst movie in indian history, performances were shameful !!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kushal-091064",
        "review_rating": "1",
        "review_title": "Spoils the RACE franchise.",
        "review_detailed_main": "But then I knew it as soon as I knew about the team's plan to rope-in Salman. Salman is not an actor, he is an entertainer. Like jokers are. People go to the movies to laugh at him, and he surely does not make that difficult. But RACE was more than that. It was never meant to be a comedy where you laugh at a joker performing funny acts. Sadly, now it has become exactly that. Message to salman, if he ever reads the reviews he gets (it's not like he has anything important to do in life except ruining other people's careers): Bhai have some self-realization, you are not an actor, you never were. Papa ki wajah se ban gaye actor, ab papa se kaho naya business chalu karwa dein, your brothers knew this a long time ago. Tum bhi chhod do yar, besharmi ki bhi hadd hoti hai."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sharmaas",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "One line review- wrost bollywood movie ever with heavy budget"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rahultailor-90298",
        "review_rating": "10",
        "review_title": "Zindagi ki race",
        "review_detailed_main": "Not as bad as what people are reviewing it as. Has all the ingredients of the Race franchise with some suspense, with some great acting by the star cast especially by Anil Kapoor"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "its_Suvo",
        "review_rating": "1",
        "review_title": "AWFULL MOVIE !",
        "review_detailed_main": "Another CRAP by Director d souza. Nothing to say ,though franchise belong to Mindless action blockbuster genre , previous films r really enjoyable."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jainamshah-84292",
        "review_rating": "1",
        "review_title": "Reviews are interesting than movie.",
        "review_detailed_main": "This movie is so good,I couldn't resist from giving it 1 star."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajeshpanchal-97166",
        "review_rating": "1",
        "review_title": "TORTURE MOVIE",
        "review_detailed_main": "FIRST HALF OK SECOND HALF IS BIG TORTURE ONLY BOBBY DEOL ACTION IS SUPER DUPER HIR"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sanam-27348",
        "review_rating": "1",
        "review_title": "Worst Movie in the Series!",
        "review_detailed_main": "Race and Race 2 were amazing! Saif Ali Khan was best for this role and Salman didn't suit this action role at all! Missed Saif a lot!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sushantshinde51",
        "review_rating": "5",
        "review_title": "Be Selfish, Don't watch it!",
        "review_detailed_main": "Race 3 is an action thriller film directed by Remo D'Souza and produced under Salman Khan Films. The film stars Anil Kapoor, Salman Khan, and Bobby Deol in the prominent roles. It is the third installment of Race film series.\n\nAs per the story is considered the film has no connection to its previous installments. It is the standalone film which revolves around a 'Singh' family that deals in worldwide arms dealings and crimes. Shamsher Singh (Anil Kapoor), the head of the family, a ruthless boss, runs this business with his twin children Sanjana (Daisy Shah) and Suraj (Saqib Saleem), and his nephew Sikander (Salman Khan). Being older among these siblings, Sikander always gets all the work delegated to him and gets all the appreciation from Shamsher, which eventually makes Sanjana and Suraj feel envious and jealous against Sikander. Bobby Deol plays the role of Yash, a loyal and dangerous henchman of a 'Singh' family. And Jacqueline Fernandez plays the role of Jessica, a woman with secrets, and Sikander's love interest. What follows next in the film is a game of love, deception, greed, and revenge.\n\nFirst of all, the absence of Saif Ali Khan from the film totally takes away the feel of previous Race films. The film is the unwanted and unnecessary installment in the Race film series. The film is filled with a nonsensical storyline, a lot of plot holes, totally useless songs, some over the top action sequences, shirtless Salman Khan, and yes, shirtless Bobby Deol as well. Jacqueline and Daisy are just the eye candies in the film. There is nothing notable in the film, except the climax of the film and Anil Kapoor's performance. The film is a polished hyper-realistic dumb film. It's just like overpriced petrol where filmmakers are literally looting audience.\n\nVerdict : Does not even worth a single watch. Watch it at your own risk."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shirinm",
        "review_rating": "3",
        "review_title": "Wasted time",
        "review_detailed_main": "Some good actors with the exception of Fernandez and Deol wasted on a very convaluted plot . Remo not much of a director either. I wasted my time, you don't have to."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ozilomil",
        "review_rating": "1",
        "review_title": "What a waste! Ridiculous.",
        "review_detailed_main": "This is not race 3, don't waste your time watching it. I don't know why they chase the race movies with RETIRED and OVERRATED Salman Khan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sauravkumar-06190",
        "review_rating": "1",
        "review_title": "Not good story",
        "review_detailed_main": "Race and race 2 are better story.\n\nSaif ali Khan is perfect for race sequal film.\n\nIt's fully awkward story and wrong direction and wrong acting fully overrated acting in this film by salman khan. The first two sequel of race series is worth watching. Don't watch this movie don't watch this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sanakhan-91137",
        "review_rating": "10",
        "review_title": "Excellent Thriller Movie.",
        "review_detailed_main": "Today, I watched the biggest Bollywood action thriller film ever made. #SalmanKhan has outdone Vin Diesel in style, action and dialogue delivery.\n\nEven if you are not a #SalmanKhan fan, the film gives you an exciting story, marvelous cinematography and great performances in Anil Kapoor, Bobby Deol and Freddy Daruwala.\n\nJacqueline makes the film hotter with her dances and actions. The highlights of the film I would say is the never seen actions which are picturized at grand scale.\n\nSalman is top notch, Anil Kapoor is pitch perfect in the film and most importantly, #Remo D'Souza surprises you with his sharpe direction.\n\nBecause I liked it very much and enjoyed it a lot, I give it 10/10. Go and watch it even if you are not a traditional Bollywood movie goer or Salman Khan. It will entertain you a lot and you will have a great day a great weekend discussing every bit of the film.\n\nRace3 will be a blockbuster film. My business rating for the weekend in India is 125 crores becoming the highest grossing weekend and 330 to 350 crore lifetime in India and $25-30Million in overseas.\n\nI watched it in 3D and it was another experience altogether. It is a clean family film with no embarrassing moment. Excellent movie RACE 3."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shoaibmushtaq",
        "review_rating": "1",
        "review_title": "Totally waste of time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mzalvi",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chuckxx",
        "review_rating": "2",
        "review_title": "Indian delusion of grandeur",
        "review_detailed_main": "Totally stupid story, idiotic superman like actions. If the idiotic bollywood singing and dancing is cut out then an mediocre action movie of 90 minutes would be left. CGI is bad and many too often used for unrealistc blow ups en masse."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "trishsuraj",
        "review_rating": "1",
        "review_title": "Don't watch it",
        "review_detailed_main": "Please don't watch it. You may become mental person after watching this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mycrazytop",
        "review_rating": "1",
        "review_title": "what have i done",
        "review_detailed_main": "Plz kill me i dont wanna live any more after watching this.try so hard to copy hollywood veryyyyy bad acting and trust me there is not story just bkvas plz dont waste your time"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vineethingorani",
        "review_rating": "1",
        "review_title": "Pathetic.",
        "review_detailed_main": "So pathetic it doesn't deserve a review. But I just needed everyone to know it's pathetic."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mridulm84",
        "review_rating": "1",
        "review_title": "Flop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "paulwalters-24",
        "review_rating": "1",
        "review_title": "Oh, The Humanity!",
        "review_detailed_main": "This is why aliens don't visit earth. People are becoming more and more dumb by watching this type of crap. Even good actors look bad in this movie because this movie has bad script. And bad actors look even worse the more you watch them. I somehow gathered all my strength and patience to watch this despite bad reviews, on Amazon prime videos, and thanks to them, I didn't have to waste money to suffer this cringe fest.\n\nRace 3 is 2 1/2 hours of human embarrassment. Basically a launch party, trying to introduce new faces(or more accurately, feces) in Bollywood under the banner of Salman Khan. It seriously makes me question the mentality of public, who went out in droves to watch this pile of crap.\n\nAction scenes are complete disgrace to the brand of action movies. Trying to copy some of the best scenes from other movies, and failing in each of them with flying colors. No one knows how to properly make green screen CGI. I mean even small youtubers are making movie quality CGI with way less resources.\n\nAll in all, if you are feeling a bit depressed, go watch this movie, you'll fell better knowing you can act better and write better stories. Oh wait, you might get more depressed knowing this movie made 280cr while you drag your ass to work everyday to make ends meet. Ciao!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ShyamNTK",
        "review_rating": "1",
        "review_title": "They warned us right from the starting credits",
        "review_detailed_main": "During the beginning credits, there was a background humming which said something like 'Oh no, oooh noooo...'. Guess it was a last warning to the viewers, in the hope that they would change their minds and stop watching the film right there."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mukhopadhyay-arka01",
        "review_rating": "1",
        "review_title": "Rarely comes a movie which you can hardly watch for 20 minutes",
        "review_detailed_main": "Rarely comes a movie which me and my wife can't stand for 20-30 minutes! After sitting in front of the TV and all the time scrolling our phones also we finally called it a day after 25 minutes , I guess!\n\nI am a generous rater as you can see from my other reviews but this is utter rubbish!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jaheenahmed",
        "review_rating": "1",
        "review_title": "Crap",
        "review_detailed_main": "Salman Khan nowadays only makes movies for earning money, this movie hasn't any type of connection with the Race franchise, Remo d'Souza should stay as choreographer not as a director, his movies doesn't have any type of storylines for example ABCD that movie has no storyline just has number dance and songs to run the movie and of course it had Prabhudeva and Ganesh Acharya. But this movie is totally unbearable, awful songs, cringey dialogues, too many plot holes, too much action that will gave you headache and acting is worse actors like Anil Kapoor couldn't save this movie and the supporting cast were also awful and Freddy Daruwala hasn't any thing to do in this film. Even Salman Khan fans will hate. Avoid at all cost from this movie\n\n1/10 stars"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "eslam4330",
        "review_rating": "1",
        "review_title": "one of the worst movies in history",
        "review_detailed_main": "There is No script,very bad acting.it is not a movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chaitanyachotu",
        "review_rating": "1",
        "review_title": "Hahahahahahahahah",
        "review_detailed_main": "Big disaster, please dont waste time by watching this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "siddhu308",
        "review_rating": "1",
        "review_title": "Bhi ka movie h bhi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abhishekmirgude",
        "review_rating": "1",
        "review_title": "Just boring time pass",
        "review_detailed_main": "The legacy Saif Ali Khan have left in the Race franchise is unmatchable. This movie doesn't have that level of acting, dialogues direction or even story was too repetitive. So don't waste your time unless you forced to do so."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pratik-pati902",
        "review_rating": "1",
        "review_title": "Watched for almost 20 minutes.",
        "review_detailed_main": "Salman Khan's fans have made this movie's rating 2.1 honestly the movie doesn't deserve to be a 2.1 star movie. If possible i would have given 0.03 star for this movie. Believe me the 20 mins i watched this movie i felt like i was trapped in it and thought already its been 4-5 hours have passed. Salman Khan should retire and should be in jail. He should be banned from India for this movie. And Romeo D'souza is the worst director of all time. He doesn't know a thing about direction. My 4 year old little brother can direct better than him. The Flaying Jatt , Race 3 & Humsakals like movies are defining a new low standard for Bollywood movies. People involved in these movies are making Bollywood suck."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "clivenem",
        "review_rating": "10",
        "review_title": "Great Movie.",
        "review_detailed_main": "Once in a while comes a movie like Race 3, it was a memorable film by Remo Sir. I would seriously recommend this movie as a must watch. Already waiting for the DVD, so I can be the first to purchase it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shivam-74899",
        "review_rating": "1",
        "review_title": "worst movie ever seen",
        "review_detailed_main": "Really my money got wasted...i dont know why salman khan act in such a waste script...only brand will not work ...thre shud be some content also in the picture."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aseem-shopping",
        "review_rating": "5",
        "review_title": "Race brand damaged",
        "review_detailed_main": "The story is good but the direction and screenplay are bad. That's damaged the movie. The twists are good. One time watch for original Race fame."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Rafayat619",
        "review_rating": "1",
        "review_title": "Pure joke !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajapandarp",
        "review_rating": "1",
        "review_title": "Best movie of the decade",
        "review_detailed_main": "This is a clut classic 💜 Best of the best 🍒 the movie Bollywood deserves. Somebody pls get this movie an Oscar!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jayita-36590",
        "review_rating": "1",
        "review_title": "It's so bad, it's funny",
        "review_detailed_main": "Bad acting, bad direction, bad choreography (with Remo as director, at least that cud hv bn better), bad dialogues... Bad almost everything except some of the songs... Ridiculous movie... Salman is the most ridiculous part of the movie..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "alshamsshamim",
        "review_rating": "1",
        "review_title": "race without saif isn't RACE actually",
        "review_detailed_main": "Lame story , lame acting . saif was parfect . another Worse one from salman"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gtmkumar766",
        "review_rating": "1",
        "review_title": "Pls provide negative rating",
        "review_detailed_main": "It's my dearest request to all to have a system of negative rating also so that we can measure absurdity and out of the box non sense of these superstars who dare to think themselves as invincibles."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sarjupeerchandra",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "I don't know what kind of mental conditions these people are suffering from, who are rating this movie 10/10. Why couldn't they just make it simple why this whole addition of crap. Just another crappy amalgamation of the movies which had a better script."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "indrajitmajumder-18660",
        "review_rating": "10",
        "review_title": "Good but not as race 1&2",
        "review_detailed_main": "Good movie,first of all it is masala commercial movie so don't find out logic.It is fully entertainment movie and don't listen who rate 1 or 2 star.In my opinion you enjoy this movie but it has lack of suspense and thriller which had previous race franchise."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "akshaykumargurumath",
        "review_rating": "5",
        "review_title": "Honest review",
        "review_detailed_main": "Movie 1St half isn't so good as expected which has boring songs and bit slow and second half has some twist and turns makes which saves movie and the one song from last franchise makes feel better\n\nDon't listen to trolls who thinks that they are English movie buff and don't even know ABC of cinema\n\nGo watch it with your fam and friends movies are for entertainment And people who are who are rating 1 star and all this doesn't make Hollywood critic and hating Bollywood movies doesn't make you exotic one"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "springsunnywinter",
        "review_rating": "5",
        "review_title": "Race 3 came in 3rd place of the trilogy",
        "review_detailed_main": "I really liked the first 2 race films mainly because they were directed by Abbas-Mustan but they didn't return for the 3rd instalment which was a big disappointment.\n\nThis is just a different movie with \"Race\" in the title that tried really hard to be intelligent but just ended up being plain dumb fun and I didn't even bother to link all of the character's motives with one an other as the film makers clearly didn't as well. It was like they are changing their minds rather than making sure they know who's side they are on.\n\nThe action was the only thing that saved the movie but some it is was cheesy and the first wing suit stunt looked faker than a PS1 game.\n\nIt was good to see Bobby Deol back which is what I liked about it and you can tell that he was well prepared for the role after a long come back.\n\nThe songs were not only bad but was a huge misfit for this kind of movie, probably for any Bollywood movie as they were mostly romantic songs and this is supposed to be an action thriller. The songs were a total waste and appeared every 10 minutes.\n\nIf there is anything that I learned from this movie is that if anyone betrays you then you should sing a song to them, I talking about the Allah Duhai Hai song.\n\nOverall this is nothing more than a time-pass movie if your not a Salman Khan fan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "zalavadiyakalpita",
        "review_rating": "1",
        "review_title": "When the Indian Cinema & Audience will grow and get some sense",
        "review_detailed_main": "I would never go for the movie like this, but I had to go because my boss wished to Go! What a extra-ordinarily horrible movie. So pathetic, so poor, so damn worst that I dont even wish to waste my time to write this review.\n\nIn one line -- Even if you love Mindless Salman movies, Dont go for this one. I beg you."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jubssss112",
        "review_rating": "1",
        "review_title": "Dont waste your precious time.",
        "review_detailed_main": "Not even worth a single watch.. don't waste money to see it at the multiplex.. watch it online for free."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "romit-38298",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "Only watched the trailer and it emanates to be a disaster"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rakin-44849",
        "review_rating": "1",
        "review_title": "Sucks....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "beevenkat",
        "review_rating": "4",
        "review_title": "its just as bad",
        "review_detailed_main": "Dont get influenced by the poor ratings. #Race3 is not an exceptionally bad film, its just as bad as any other #salmankhan film. Theres no story, but there r silly dialogues. Theres no logic, but there r eye catching locales. Theres no music, but theres a lot of noise. Theres no acting, but there r ridiculous stunts. If #bobbydeol thought of re-launching himself with this film, then its not happening. No wonder the original hero #saifalikhan stayed away. Rating 2/5."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "GypsiB",
        "review_rating": "3",
        "review_title": "This Is One to Miss",
        "review_detailed_main": "Shamsher Singh (Anil Kapoor), arms dealer, has three children: twins Sanjana (Daisy Shah) and Suraj (Saqib Saleem) , and step-son Sikander (Salman Khan). The twins begrudge Sikander his share of their mother's fortune, as well as their father's partiality and set out to kill him.\n\nBobby Deol plays Sikander's friend Yash, and Jacqueline Fernandez plays Jessica, the love interest.\n\nI was set to love this film, based on the great trailer. Sadly, I was immensely disappointed. The plot is so convoluted with twists and allegiance changes that it ceases making sense and becomes farcical. The conversation is stilted and banal. The music is simply terrible--bad enough that I fast-forwarded through the songs. Ferdandez and Shah are dressed in the most trashy of clothing. I'm giving the movie three stars because the film work, action scenes, and special effects were quite good. Other than that, this movie is one to avoid. Frankly, I suggest watching the trailer instead; you won't miss a thing.\n\nP.S. This comes from a devoted Salman Khan fan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jaidevrathod",
        "review_rating": "10",
        "review_title": "Wasn't good but u can't all it bad",
        "review_detailed_main": "Cmon people u people are talking about the action scenes it was far better than movies like baaghi series and others songs were rubbish except for Allah duhai which was good story was average but not a thrilling one...and acting was like people are saying a joke whenever salman is in a movie the directors try to put everything on salmans shoulder they don't put their efforts remo should not direct movies and salman should do movies like bharat Sultan Bajrangi bhaijaan tiger series pliz."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "erisedwitch45",
        "review_rating": "1",
        "review_title": "Bollywood \"A-list\" movies are getting worse and worse",
        "review_detailed_main": "I understand the humungous fan following Salman has so no wonder this movie will be a major Box office hit, raking in the moolah and breaking records as well, despite of that I will write my review here.\n\nSalman's acting (or lack thereof) is blatantly visible in this movie. I think earlier he used to try (at leats), now he doesn't even bother. An actor is supposed to be the character but here, his persona outshines and overshadows the character or even the story. Saqib Salim who is a decent actor made to say the word \"bro\" after each and every dialogue so much so that it becomes cringeworthy. Bobby Deol is average, Daisy, Jacquline are... like they are in their other movies - all glam no skill. Anil Kapoor is the only one who can hold his own.\n\nThe plot is contrived (which was true for earlier Race movies too) but this movie doesn't even put any effort. Be it pulling off a supposedly dangerous heist which is wrapped up in a song sequence with the actors just walking in slow motion to look cool. At least some effort should have been shown- some action scene, some nail-biting suspense but we get nothing. All the maker focussed on was getting Salman, getting the other actors to walk in slo-mo to look cool and blowing up expensive cars.\n\nThe songs... I don't even know where to begin. I was shocked that a big-budget movie couldn't even afford a decent lyricist till I saw that Salman has penned a couple of the songs himself. Just do a quick google search of Selfish and I found love - 2 \"gems\". Even the title track has been mashed and made bad.\n\nI thought Race 1 was okay, Race 2 was going downhill but still bearable but Race 3 just touches the bottom of it. Non-existent story-lines, bad acting, \"star\" kids etc is what Bollywood has been reduced to now."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "AnishMisra",
        "review_rating": "2",
        "review_title": "Race 3 review",
        "review_detailed_main": "Race 3 is a film directed by Remo D'Souza. I am one of the few people who was impressed by the trailer and was hopeful that this film was going to be a sheer blockbuster. But then the promotions of the film started that reduced my interest in the film. After watching the film yesterday, I can say that I have watched the worst film anyone could make.\n\nPlot: Things suddenly begin to change for the Singh family when Jessica Gomes enters their lives.\n\nStory and direction: I remember in 2008 when the first instalment came out and me being quite excited when no one talked about the film. The film surprised everyone and subsequently a sequel came out in 2013 which was not as good as its predecessor. But still the film worked for its convincing plot and setting. Let me get one thing straight. This film had the makings of a blockbuster. The set pieces of the film looked quite awesome and set the screens to be blazing on film. But alas, that's where the excitement stops. The plot is so weak and paper thin that it couldn't invest me for a second. There were so many things that the makers packed into this film that it felt irritating after some time. Watching the film, I felt that given a director's job I could have done a better job. Remo D'Souza just spoils the whole film. He just tries every formula in the book without giving his own input that would make the film standout in comparison to others. Many scenes felt so impossible that I wondered how the writer thought of putting it in the script (if there was one). The dialogues were already trolled even before the film released but I can say there are plenty more. Not as a Salman Khan fan, I was disappointed more as an action film fan. The stunts looked so amateurish (considering a Hollywood action director was hired). There was a lot of green screen and stunts dumbed down for the Indian audiences. Even I could know the difference between the actors and their stunt doubles. Slow motion has been used a lot which negated the possible effect the scene should have.\n\nPerformances: Anil Kapoor was top notch and maybe the possible reason why this film was still bearable. Salman Khan was his usual. We know Jacqueline's acting skills and as to why she is taken in films. Bobby Deol basically does nothing in the film. Daisy Shah was horrible. Saqib Saleem and Rajesh Sharma were wasted. Sharat Saxena did good with what was given.\n\nMusic: Salman Khan, who is known for providing chartbusters, fails miserably in this department. None of the songs felt natural or good. It felt like they were compensating for the lack of story. If I had to pick out the worst song it would be the Salman Khan written and performed song 'I Found Love'. Salman Khan should stop writing songs after this experience and stop taking Iulia Vantur to sing songs. The BGM works in places but I have heard better.\n\nWorst Scene: It would be any scene where Anil Kapoor and any other character converse in Bhojpuri. It felt very forced and funny. The dialogues were full of trash.\n\nVerdict: Salman Khan should have thought even before investing a huge amount in a film like this. If that wasn't enough, he hired Remo as the director (we all know what happened with FLYING JATT). The makers have announced a sequel to this film. Hopefully they understand what they are doing. RACE 3 was more a comedy film than an action thriller. It is the worst film this franchise has to offer.\n\nI am going with a 2/10."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "GypsiB",
        "review_rating": "3",
        "review_title": "What a Disappointment",
        "review_detailed_main": "Shamsher Singh (Anil Kapoor), arms dealer, has three children: twins Sanjana (Daisy Shah) and Suraj (Saqib Saleem) , and step-son Sikander (Salman Khan). The twins begrudge Sikander his share of their mother's fortune, as well as their father's partiality and set out to kill him.\n\nBobby Deol plays Sikander's friend Yash, and Jacqueline Fernandez plays Jessica, the love interest.\n\nI was set to love this film, based on the great trailer. Sadly, I was immensely disappointed. The plot is so convoluted with twists and allegiance changes that it ceases making sense and becomes farcical. The conversation is stilted and banal. The music is simply terrible--bad enough that I fast-forwarded through the songs. Ferdandez and Shah are dressed in the most trashy of clothing. I'm giving the movie two stars because the film work, action scenes, and special effects were quite good. Other than that, this movie is one to avoid. Frankly, I suggest watching the trailer instead; you won't miss a thing.\n\nP.S. This comes from a devoted Salman Khan fan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "akhilsyngal",
        "review_rating": "1",
        "review_title": "Stupidity at its peak",
        "review_detailed_main": "A senseless film with no story , unneccesary & repeated songs . Interestingly this movie is a super hit in India which me as an Indian fells shameful."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "verandarguptaa",
        "review_rating": "1",
        "review_title": "Fbydkhky",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "zeekzetak",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "Ruined a good race movie series ! No match for Saif Ali Khan !"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gajananjadhav-79909",
        "review_rating": "1",
        "review_title": "Disgust",
        "review_detailed_main": "It not even deserves to be called as 'movie'. Very poor script and execution. Logic doesn't exist for the makers."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sharsh-26239",
        "review_rating": "1",
        "review_title": "Salman bhai ne dhokha de diya !! I really miss Saif.",
        "review_detailed_main": "Bakwas movie! save your money, save your time. Dont go to the cinema wait for the sanju and satya mev jayate. ghar beth k football world cup dekho."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "avantikaroy-74046",
        "review_rating": "10",
        "review_title": "Why so much hatred ? Watch before posting review !",
        "review_detailed_main": "Why so much hatred ? Watch before posting review ! Why so much hatred on this movie. I wonder whether people really watched this movie before giving 1-star ratings. I'm surprised not even single point they liked in this movie. This means when you keep negativity in mind everything looks negative. The sheer collections of this movie in India alone prove how much this movie liked by common movie lover."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tony-35828",
        "review_rating": "1",
        "review_title": "Tati flim of the year",
        "review_detailed_main": "Tati flim of the year. Ghatiya actor Salman khan of the year and over acting ki to hash hee par kar di..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "bobandlulureview",
        "review_rating": "4",
        "review_title": "RACE 3- ALLAH DUHAAI HAIN!!!",
        "review_detailed_main": "PLOT: This film too, like its predecessors, has an ensemble cast. Characters involved - Rich, old illegal arms dealer (Anil Kapoor), his step son (Salman Khan), his twins (Daisy Shah and Saqib Saleem), the family's Man Friday (Bobby Deol) and the eye candy (Jacqueline Fernandez).\n\nIllegal arms dealer has been wrongly driven out of his country and his sole aim is to return to his native village with a clean chit and to do this he needs to indulge in more criminal activity such as stealing a 'hard disk' that has illegally recorded sleazy videos of politicians and then blackmailing these politicians. To help him with this task, he has his children who are all trained fighters and have each others' backs on the field. But all is not well at home. The twins want the step son out of the way as their father favours him over them. Step son has brief affair with eye candy and then they break up only to have her return back to his life after few days/months/years (we don't know). Man Friday oscillates in his loyalty towards step son and twins.\n\nWill illegal arms dealer return to his village? Will arm candy and step son have a 'happily ever after'? Whom does Man Friday finally stand up for? Who will survive- the twins or the step son?\n\nOh Salman, you've ruined this movie and turned into a big-budget Dabangg! The film begins with each character being introduced by a voice over and that is when things begin to go downhill. When you have someone do a voice over in the film, that person ought to have a great voice and not sound like a railway announcement.\n\nThe USP of the Race series has always been the action packed scenes, the larger than life stunt sequences and the twists in the plot. Race 3 has all of this but fails to impress due to poor acting, even worse direction, abysmal script and unrealistic scenes. I am fine with one person taking down an entire truckload of trained militia by himself but how in God's name does Salman manage to jump off a high rise building in a wingsuit, manoeuvre through buildings across town (while still flying) and land into the warehouse where his siblings are fighting? I have never been a big fan of Salman's movies but this one really annoyed me as I went to the theatre with high expectations.\n\nSalman looks like a stocky potato and lacks the panache that Saif Ali Khan had in the previous movies.\n\nI feel terrible saying this but Daisy Shah is really annoying. Despite her cool stunt moves and her brilliant aerial dance, she has failed at trying to pass off as an uber cool, 25 year old scheming daredevil.\n\nJacqueline is just being umm.... Jacqueline in the movie. (Chittiyan kalaiyan veh)\n\nHowever, feminists rejoice. For a change, this film has action scenes with women in them, that do not involve name calling and hair pulling. *eye roll*\n\nWould you believe this, I have nothing bad to say about Bobby Deol!\n\n(Oh, I forgot to mention the other twin. Yeah, he has some scenes too.)\n\nAnil Kapoor was definitely the saving grace and the good news is that the way the film ended, it would appear that Anil Kapoor shall make a comeback and thankfully not Salman Khan!\n\nI sometimes still croon the songs from Race 1. The songs in this movie are unremarkable and the lyrics are so lame (tried thinking of a more professional word than lame, but lame describes it the best) especially the song \"Selfish\" and what do you know! The lyrics to the song have been penned by Salman!\n\nDid I mention the script? LAME. Remo, please stick to being a choreographer. P.S: Remo D'Souza is the director of the movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "yaseenmyp",
        "review_rating": "1",
        "review_title": "Just a horrible film",
        "review_detailed_main": "No storyline, no acting, no entertainment, only bad acting and worst performances from the cast. Remo is a worst director ever."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Ibuk",
        "review_rating": "4",
        "review_title": "Race 3- Quite simply a headache inducing experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "guptajai",
        "review_rating": "4",
        "review_title": "Not up to the mark.",
        "review_detailed_main": "Story - Totally a loose story. The secrets are also not revealed properly.The shocking reaction of people about secret revealing is absent there. Acting - Only Anil Kapoor has done wonderful acting. Direction - Remo has done average direction... As he had got this film very late so he doesn't got time to work on it. Music - Only two songs Heeriye and Party on and on are good. Whats good-Screenplay and cinematography are wonderful. Whats bad-Story, Editing, Unnecessary addition of songs. Watch or not - Do not watch if you are expecting some good thrill and Suspense... and if you want to see good action so you can go."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "keshavmeena-48230",
        "review_rating": "1",
        "review_title": "Selmon boi",
        "review_detailed_main": "Worst movie of the year . It's so disgusting . So bad & stroryline is also missing ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "manman-57708",
        "review_rating": "4",
        "review_title": "Blockbuster",
        "review_detailed_main": "Race 3 is a master piece. Salman is so natural in his acting, it flows like water in the stream, so soothing to eyes. Bobby deol, Jacqueline Fernandez and Jai actress are at their best. Remo D'Souza should get Oscar for his brilliant direction. The only drawback of the movie is Anil Kapoor. A must watch..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "upreti-10987",
        "review_rating": "1",
        "review_title": "No story only Boby's and Anil's acting",
        "review_detailed_main": "Here I gave it 1 star because of only Boby's and Anil Kapoor's acting otherwise nothing in this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rpsadarangani-30356",
        "review_rating": "10",
        "review_title": "Fun action movie",
        "review_detailed_main": "I thought it was a good action movie. My girlfriend and I went and we both liked it. Granted we like movies like the fast and furious franchise but over all we just thought it was a fun watch."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tanmaygumaste",
        "review_rating": "1",
        "review_title": "Worst Story",
        "review_detailed_main": "Given star.. Kyuki uske niche kuch option nahi tha.. Salman khan has spoiled race brand with his out of the world acting, lyrics writing and singing."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anandktripathi",
        "review_rating": "1",
        "review_title": "Tried for 3 days to watch it on Amazon Prime but not courageous enough to finish it",
        "review_detailed_main": "Tried for 3 days to watch it on Amazon Prime but not courageous enough to finish it. Need few more days to gather the stamina again to complete it. Salute to the people who rated it 10/10 here, with that kind of dedication they can turn this world upside down if they choose to. I will rate this movie to -10 (minus ten) if possible."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "piyushthakur-93888",
        "review_rating": "1",
        "review_title": "Dangerous than CORONA VIRUS",
        "review_detailed_main": "Avoid at all costs.\n\nRubbish acting, waste of time and irritating songs."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "varun_gupta86",
        "review_rating": "1",
        "review_title": "Bogus movie ever made",
        "review_detailed_main": "This is by far the worst movie ever created in Bollywood. NO sense, no script, unnecessary action, don't know why on earth this movie got released. AVOID THIS MOVIE"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hema-00128",
        "review_rating": "1",
        "review_title": "This is the worst movie ever i have watched",
        "review_detailed_main": "What kind of chutiypa is done by salman khan. He thinks he is like tom cruise but in reality he is not like tom cruise leg's soil"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "brilliantjasper-48425",
        "review_rating": "1",
        "review_title": "Chee",
        "review_detailed_main": "Worst film I have watched so far! Worst film of 2018! Save your money! Save your brain! Don't just watch."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rohitkarekar",
        "review_rating": "1",
        "review_title": "Waste Of Time",
        "review_detailed_main": "Bakwas storyline Salman Khan acting was pathetic. Salman Khan don't know to act just a waste of time for me and others. Don't Watch this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mahmoodafifa",
        "review_rating": "1",
        "review_title": "Pure disappointment",
        "review_detailed_main": "Just one word: DISAPPOINTMENT! 2018 gave us a lot of good films like Andhadun, Sonu Ki titu ka sweetly, blackmail and so on. Even if there are flop movies, the songs were good. But this film doesn't have any of the qualities mentioned above.in half of the film , I feel asleep. Why not fall asleep? Because the movie was boring with very dull acting. Didn't expect this Salman Khan. Although I am not a big fan of him, I enjoyed some of his old movies like hum aapke hain Kuan , sultan and so on. This is just crap! No climax, no emotions, no passion. Just the people came to do whatever they had to do and say GOOD NIGHT. Just one advice: don't watch this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajashahrukh-35006",
        "review_rating": "1",
        "review_title": "Zero stars. Makes should be jailed for toturing the audience",
        "review_detailed_main": "Utterly stupid and nonsense film. Salman Khan should leave acting after this movie. He just want to show that he is a macho man in his every film. Only brainless people watch such films."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sawaniharminder",
        "review_rating": "1",
        "review_title": "Wahiyat",
        "review_detailed_main": "Wahiyat. Ye Bollywood wale Hum logon ko Chutiya samajhte hain."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "prashcancerian",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "No logic in this utter waste of time , non sense movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "babaradhe",
        "review_rating": "1",
        "review_title": "Excellent job",
        "review_detailed_main": "Now people will know how to waste time and money. Amazing Acting, wow"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shyamgoyner-26504",
        "review_rating": "1",
        "review_title": "Why....Just Why?",
        "review_detailed_main": "I don't understand why would anybody make this movie. Race franchise getting worse after worse and after this movie i think it come to worst."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "divyasinha-58938",
        "review_rating": "1",
        "review_title": "Tatti Movie",
        "review_detailed_main": "I want to give no star and only this review. That's it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Daniel_Mukherjee",
        "review_rating": "1",
        "review_title": "Never Watchable",
        "review_detailed_main": "Dont try to watch this movie... Its pain in the eye.. 1st movie to done everything wrong... from direction to casting everything is terrible.. Very bad movie... Don't waste Your Time on this..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Natasha0705",
        "review_rating": "4",
        "review_title": "Overall, the BRAND Salman Khan speaks for itself at the box office but Race 3 doesn't really leave a mark in the film archives.",
        "review_detailed_main": "RACE 3\n\nDuration : 160 Minutes Genre : Action Thriller\n\nCAST Salman Khan : He plays Sikander Singh. Salman is now more known to be a brand name then an actor. Anil Kapoor : Plays Shamsher Singh, the weapon manufacturer, who holds up the Singh empire. Anil as we all know, is like fine wine, turns better with time. Bobby Deol : He plays Yash, Sikander's right hand. Bobby Deol is back with a bang, and gives an impressive comeback. Saqib Salim, Daisy Shah and Jacqueline Fernandez were suitable in their respective roles.\n\nPLOT Being the 3rd installment of the Race series, Race 3 doesn't really impress. The storyline is basically about family rivalry, but choreographer turned Director Remo D'Souza doesn't execute it well. Abbas Mustan definitely did better direction in the first 2 movies.\n\nSOUNDTRACK Unlike Race & Race 2, the tracks of Race 3 are a mess. Only the theme song Allah Duhai Hai is impressive."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rasneet-angel",
        "review_rating": "9",
        "review_title": "awesome movie",
        "review_detailed_main": "I enjoyed this movie a lot and the action sequences were excellent and the climax scenes were just amazing as usual."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "MG_MasterG",
        "review_rating": "2",
        "review_title": "Bad acting, bad direction, waste of time!",
        "review_detailed_main": "Surprised at how bad this movie is. No saving grace, despite Anil Kapoor and Salman Khan in the star cast.\n\nThe basic plot and the twists are not bad. But the direction, screenplay, dialogue delivery - nothing seems to be right in this movie. The movie deserves a low rating that it has on IMDb."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mriganka-85455",
        "review_rating": "1",
        "review_title": "Hopeless movie",
        "review_detailed_main": "Booring story.\n\nActions have no logic Complete disaster movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "crazylovervicky",
        "review_rating": "1",
        "review_title": "craaaaapppppppp",
        "review_detailed_main": "Audience after witnessing Selmon's performance : I want refund.\n\n\n\nThere should be a refund policy. It's a must."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anjoyshougrakpam",
        "review_rating": "2",
        "review_title": "Comedy show",
        "review_detailed_main": "The slowest race ever😂😂👍. Next time make some quality movie. And apply some physics."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tarjmehta",
        "review_rating": "1",
        "review_title": "I have better one line story",
        "review_detailed_main": "At the end when selmon bhai completes the dialogue and... Saif Ali Khan comes and says \"Ye race meri thi aur meri hi rahegi\"\n\nWould have earned more respect."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "prithvishah-61565",
        "review_rating": "1",
        "review_title": "Worst movie of Salman Khan",
        "review_detailed_main": "Whole movie script and acting of Salman Khan is worst"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vipinbhskr-94643",
        "review_rating": "1",
        "review_title": "Tatti movie",
        "review_detailed_main": "There is all over tatti tatti , how dare i to watched this dumb junk"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kumarom-34980",
        "review_rating": "1",
        "review_title": "Worst movie of the century",
        "review_detailed_main": "I wish i could rate in -ve stars.. This movie is a trash"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "iamtarikulsheikh",
        "review_rating": "9",
        "review_title": "Average",
        "review_detailed_main": "It's below average movie, totally unhappy ,We don't want Movie Like This ,"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sthaanand",
        "review_rating": "1",
        "review_title": "Worst ever made in Bollywood",
        "review_detailed_main": "Salman should resign the Bollywood. He should get married as soon as possible while his gun is work!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shashankshekharr",
        "review_rating": "1",
        "review_title": "Top actors make fun of themselves",
        "review_detailed_main": "Within the first half an hour of the movie you get into the clear picture as to what the actual motive must have been behind the making of such a rare movie as not always do you get to watch a movie where reputed actors do their best to make fun of themselves and get insulted and that too by spending (not investing) in millions."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "s-saluja72",
        "review_rating": "1",
        "review_title": "Stupid Actor, Drug Smugglers, Murderers are making movies in Bollywood.",
        "review_detailed_main": "Stupid Actor, Drug Smugglers, Murderers are making movies in Bollywood.\n\nThey are neither creative, not good at acting."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rajatbiswal",
        "review_rating": "1",
        "review_title": "Garbage Movie 3rd class acting",
        "review_detailed_main": "Everything is full of garbage. Don't watch this movie & save yourself. No one wants to watch bad movies, but this one is worst. Salman Khan is 3rd grade actor too."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vasuawasthiup",
        "review_rating": "1",
        "review_title": "Bar as expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sarandivyam",
        "review_rating": "3",
        "review_title": "honest review",
        "review_detailed_main": "Race 3 was released on 15th June 2018 and is a thriller film directed by Remo D'Souza and produced under Tips Films and Salman Khan films. It is distributed by Tips films, Salman Khan Films, and Yash Raj Films. This film is considered to be a reboot to the race franchise. Although it has a sparsely related plot to the previous film. This film stars Anil Kapoor and Jacqueline Fernandez who have previously performed in this franchise and Salman Khan Bobby Deol, Saqib Saleem, and Daisy Shah as the new entrants in the franchise. This is the presently last and the worst part in my view in the whole franchise and I primarily think that the failure of this film is due to Salman Khan because he interferes in every sphere of filmmaking whether it be the direction or it is a screenplay. The story has become a thing of past in Salman Khan films and as I say that story is the core of any movie and so I give this film a very negative rating. This film lags in the storyline as well as in the presentation too. individual performances of actors are fine and the music is also average. I don't advise my readers to watch this movie as it could lead to severe headaches."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "adnanemon",
        "review_rating": "2",
        "review_title": "Brainless logic",
        "review_detailed_main": "Director damage his brain before starting shoot, bla bla bla faul movi, totally waste off time"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tanvirdawah",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Mother father of physics. Nonsense. Faul acting. Worse dialogue. Bad punchlines waste of time. Dont watch it"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Magow-Intermean",
        "review_rating": "10",
        "review_title": "Race 3 REVIEW",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "beinggauravsinha",
        "review_rating": "5",
        "review_title": "Not fit in race franchise",
        "review_detailed_main": "Poor story and average screenplay ruin the movie ... second half is good and action is good but not so much ..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "garydivya",
        "review_rating": "2",
        "review_title": "Race to foolishness",
        "review_detailed_main": "The director has completely spoiled the Race Franchise. No characterisation, no storyline, over the top dialogues with hamming by the entire cast. One of the worst Salman Movies."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sonuroy786",
        "review_rating": "5",
        "review_title": "Worst By Bhaijaan",
        "review_detailed_main": "This is the worst movie of salman bhaijaan. Action scene was ridiculous. Bobby's acting was also ridiculous............."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "maniskkarangnani",
        "review_rating": "1",
        "review_title": "Istg even Adam Devine could've played Salman Khan's role better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "munirhashmi",
        "review_rating": "2",
        "review_title": "Weird",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rieeekhanse",
        "review_rating": "1",
        "review_title": "Wrost Movie",
        "review_detailed_main": "Wrost movie in the entire Bollywood history. Remo should be fined for this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abhishekraman81",
        "review_rating": "4",
        "review_title": "Action.One time watch.",
        "review_detailed_main": "An action movie starring Salman khan, Jacqueline Fernandez,Anil Kapoor.A cat and mouse game with a lot of twists.."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "deeprauteladr",
        "review_rating": "4",
        "review_title": "Not satisfied",
        "review_detailed_main": "Not a story to waste your time and money on. Tried to do Hollywood action, but salman didn't do any work on that part."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kalrakabir-44602",
        "review_rating": "10",
        "review_title": "Race 3 is a hit movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "divyanshumasulkar",
        "review_rating": "1",
        "review_title": "what a utter garbage?",
        "review_detailed_main": "Latterly no script, Full on GOT Relationship, i can do better Acting then that/////"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "SaltedPopcornMovieReviews",
        "review_rating": "3",
        "review_title": "Race 3 Movie Review by #SaltedPopcorn",
        "review_detailed_main": "Race 3 Movie Review by #SaltedPopcorn\n\nIt's a general phenomena that Salman Khan fans love Salman Khan movies even when he literally craps in his movies. But Race 3 is a movie which, even Salman Khan fans would not be able to endure.\n\nRace franchise has suffered a lot after its first part. Race 2 was a bit worse than Race and Race 3 is an utter nonsense movie with king of Nonsense himself Salman Khan. Thanks to Salman Khan And Remo D Soua for spoiling and devastating this franchise completely. Race 3 is story of a family headed by Anil Kapoor and is involved in manufacturing of Arms. Salman, Daisy Shah, Saqeeb Salim and Bobby Deol are part of this family. Though all of them try to act smarter than each other, in reality, every one's character is even more stupid than others.\n\nRace 3 is a no script, no acting, no common sense movie. Which character is with whom and what does every character want, it's beyond understanding till end of the movie.\n\nDirector Remo D Souza should know that he has disastrous direction skills. He is better being a judge is some kids Dance show rather than giving headaches to people by making F.A.L.T.U movies like ABCD, ABCD 2 and many other failed immature films.\n\nRace 3 is an amateur attempt to put some glamour and action into a boring script. It's overridden by overacting. In every 10 minutes, songs keep breaking the script (whatsoever is there). This Race lasts so long that people start leaving theater on the first chance they get.\n\nOverall, this movie should be strictly avoided not only in theaters but at home also. It's not a race of being smarter, it's a race of being stupid. More than Race, it's Disgrace.\n\nSpend your time either at home or watch Jurassic Park again. There, Dinosaurs have acted better than this bunch of actors.\n\nSaif, I dint know you could also be missed so much in some movie. Race was outrightly yours and must be yours.\n\nStars- 1.5/5"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "patelankur-68764",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Dont not watch this plz Its my opinion. And plz help me to find 0 star rating for this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "satender-s-chaudhary",
        "review_rating": "1",
        "review_title": "Your worst action flick",
        "review_detailed_main": "No story, no acting, no direction, made a cheap movie which might look glamorous on screen and hoping that Salman Khan's fans will pay to watch it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nokohtro",
        "review_rating": "1",
        "review_title": "😂",
        "review_detailed_main": "Plz don't make movie.\n\nSallu vai plz don't act and get married."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nishith_rout",
        "review_rating": "1",
        "review_title": "Just sleep! don't watch this movie.",
        "review_detailed_main": "You will feel happy if you sleep instead of watching this movie. Everything about this movie is so bad that I can't specify everything. The acting, cinematography, drama, the fighting scene, everything is bad. This movie just destroyed the Race franchise."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sibaprasadsamantaray",
        "review_rating": "5",
        "review_title": "1tym watch",
        "review_detailed_main": "Salman always best 😍 Anil sir rockzzz Bobby rockzz Film demerits #unusual songs #screenplay Film merits #only Salman Khan Ek baar ye movie dekh sakte hai 😍"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "samiljeet",
        "review_rating": "1",
        "review_title": "Disgrace to Bollywood and art",
        "review_detailed_main": "Demo d souza thinks when there is Salman khan movie will be a hit and it actually did because rather than seeing movies like neerja ,pink and talvar Indian audience will prefer this type of movie the acting was so pathetic Salman khan just keeps 1 expression from the start to the ending the girls were okay doing what actresses do in Salman film as usual just dancing on Item numbers and cry. anil Kapoor is the only place where you can breathe and say this movie has talent in it the plot is messed up from being race to a daily soap of family drama . songs written by the great Salman khan is rubbish All the songs are half in Hindi and English I mean seriously? Whyyyyy? action sequences were good but I still can't understand why?"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nib-06152",
        "review_rating": "10",
        "review_title": "Best movie of Race franchise",
        "review_detailed_main": "Salman is the King of Box Office. Wonderful movie, songs are good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aliking-32721",
        "review_rating": "1",
        "review_title": "Cringe movie",
        "review_detailed_main": "Review: \"Race 3 is a cringe-inducing mess of a film that insults the intelligence of its audience. From poorly written dialogue to nonsensical plot twists, this movie is a prime example of how not to make a Bollywood action thriller. The performances are lackluster, with even the usually reliable Salman Khan failing to save this train wreck. The action sequences are over-the-top and cartoonish, and the attempts at humor fall flat. Overall, Race 3 is a forgettable film that should be avoided at all cost Review: \"Race 3 is a cinematic catastrophe that defies logic and coherence at every turn. With a plot thinner than tissue paper and characters shallower than puddles, this film fails to engage on any level. Salman Khan's charisma alone cannot salvage the train wreck of lazy writing, wooden acting, and cringe-worthy dialogue. The action sequences are so ludicrously staged that they border on parody, and the attempts at emotional depth are laughable. Race 3 is a cinematic black hole, sucking away two and a half hours of your life that you'll never get back.\""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pankajbhatia-48132",
        "review_rating": "1",
        "review_title": "Complete trash",
        "review_detailed_main": "Absolute waste of time, please avoid it completely."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mouryasen",
        "review_rating": "1",
        "review_title": "Is there any option for minus rating?",
        "review_detailed_main": "Hopeless & worthless, time to allow new actors in the frame."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kumardevsvarshney",
        "review_rating": "1",
        "review_title": "What a disgusting movie",
        "review_detailed_main": "Movie action song are wrost.\n\nPhysics is death in this movie. And acting of salman khan is hillirious acting.\n\nOther cast also flop performance."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ibdpiskillinglife",
        "review_rating": "1",
        "review_title": "Bloody race out of your seat as soon as possible.",
        "review_detailed_main": "Race 3, a film where we all lose the race for its patience. Nothing there in this film and it doesn't even give a 0.1% percent justice to its previous sequels. Even trash can be recycled but this movie cant. So much of good cast for nothing. Only one star for one good twist in the film. Other than that, this movie shouldn't even exist. As usual, if they give more than 5 stars for this film, that is only for Bhai fans. Don't fall into that trap kindly."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Lavnishkrsharma",
        "review_rating": "2",
        "review_title": "Watch it when you have nothing else to do..",
        "review_detailed_main": "The movie is all about Salman Khan, no story, no good music, nothing at all. Just like Race 2, this piece is also full of over suspense, and random sequences."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shalinu",
        "review_rating": "1",
        "review_title": "Don't Watch",
        "review_detailed_main": "Don't waste your time. Nothing to see here. It looks and sounds like a family drama with overacting on display by our own super star."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jeetstrespasser",
        "review_rating": "2",
        "review_title": "2 because I like Jackie",
        "review_detailed_main": "I love Salman as being human and Remo as a choreographer but why do they have to steal one of the very few successful thriller franchise and freaking spoil it like this. From Abbas Mastan and Saif to Remo and Salman, this is one shitty movie. Just why?"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gei-16231",
        "review_rating": "10",
        "review_title": "Best movie of Race series",
        "review_detailed_main": "Race 3 is the best one of all Race movies. Salman's charm made it a great watch. The songs are wonderful."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "riken-71653",
        "review_rating": "1",
        "review_title": "I wish I could have choose the option zero",
        "review_detailed_main": "This is what happens when you don't remove Saif from the movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "varghesejunior",
        "review_rating": "2",
        "review_title": "Such a shame to make such films nowadays",
        "review_detailed_main": "What is the logic behind this film? It has no link with reality.\n\nThe film is a spin off from the prequels, but it does no justice to either.\n\nHow can a person fly like Superman from Cambodia to Abu Dhabi? In this era how can the makers expect even kids to believe this kind of stuff?\n\nJust some fake action scenes, special effects, special effects, some sleaze, and above all some hype some songs don't make a good film. Much more goes into that.\n\nThere is of course some suspense and twists and turns, as in the prequels, but the effect of that is simply buffered by the nonsense protrayed otherwise. Just too many coincidences between the characters throughout the film !!\n\nIt's so true that all that glitters is not gold, and this film highlights that saying."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ramkumarsingh-25206",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": "Poor story and dialogues. Anil Kapoor's acting is good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "yogendrayp",
        "review_rating": "4",
        "review_title": "Bad movie.",
        "review_detailed_main": "The script of movie is bad. The action is very bad. Nothinng is to watch in this movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sailuhara",
        "review_rating": "1",
        "review_title": "Horrible movie",
        "review_detailed_main": "Horrible, ridiculous movie. Time for Salman to retire"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Roxy_Rocks_For_You",
        "review_rating": "1",
        "review_title": "LOL",
        "review_detailed_main": "No words to describe!!\n\nOnly watch it when you got nothing to do in this world."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ahsankenway-44688",
        "review_rating": "3",
        "review_title": "What is is this",
        "review_detailed_main": "By adding Salman Khan, it got illogical and much of the film is made like fast and furious and got not much story especially anil kapoor character background turning villain was a very poor choice"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "itscs-667-107256",
        "review_rating": "2",
        "review_title": "Ultimate talent is required",
        "review_detailed_main": "To actually promise a lot and keep you interested and deliver nothing. I was totally bored and upset. It looked like Mr. Khan has decided to go on a vacation with with film crew and decided to shoot a home video for memories. Big people can throw their money into drain; the way they want."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "loveliverpool-30699",
        "review_rating": "10",
        "review_title": "Best movie Bhai rocks",
        "review_detailed_main": "Best movie watched it 10 time. Salamn great best acting best story."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "fatimabano",
        "review_rating": "1",
        "review_title": "This is the trainwreck that occurs when bollywood tries to imitate hollywood",
        "review_detailed_main": "Salman khan has emphasised it very well that he is the centerpoint and main focus of the movie. Unfortunately he has emphasized completely on the look and materialistic feel to the movie, every scene and clip frame is a new set a new grandious and luxury scene. Not only does everything look too overly perfect it doesnt flow with the first race movies where the story lines are the main focus point and not the limitlessness of cars, money and guns. A movie especially one that is in the race trilogy should have been meticulously thought out and instead salman khan has just tried to show the world he has all the cars and power he wants, and its a clear portrayal of him trying to emphasize his power in bollywood, and unfortunatley it has all backfired and these reviews are evidence of that. Its sad to see so much money wasted on a movie that should have been the third and lucky movie in the franchise of race, it should have overturned the most of all the movies and instead its truly shocking lol. too much money not enough brains."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "teja990",
        "review_rating": "2",
        "review_title": "The guide to how not to direct an action thriller film",
        "review_detailed_main": "Over the top action sequences with utterly zero logic and sequences which will make a 2d animation action scene EPIC. The story is basically ZERO with an unnecessary craving for twists which obviously looks forced. It is almost like since this is race franchise Twist toh banta hai boss and that thinking precisely is what makes the film that many times horrible. The acting is so awkward including sallu bhai and this is being said by a die hard fan of salman khan. There are two integral characters in the film which were portrayed by Oscar deserving actors namely Daisy shah and I dont even know the name of that guy who potrayed the characters so bad it almost makes Laugh out Loud every time they start trying to act. Music is right up there on the horrific scale and the lyrics are such a pain to the brain, they literally make no sense. What surprised me more was the choreography. One of the topmost choreographers of the country is directing the film and the innovation or freshness you expect in the choreography is non existent. The direction was anyways even worse than the horrible choreography. The production values are ok and bad when you compare to the budget they had in hand. In one sentence this is a film which doesnt deserve anyone's time and if you still plan to watch it get ready for the guide to how not to direct a film."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "zaheer-warrior",
        "review_rating": "1",
        "review_title": "Horrible, Disgraceful, waste of time",
        "review_detailed_main": "It's really sad that Salman Khan would lure his fans to such a waste of time. Being a huge salman khan fan myself, I am very disappointed to watch this movie. It has no story, no action(believe me), no comedy, no good songs, nothing at all. Its sad to see all the money wasted in this movie for nothing."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sridhar-e",
        "review_rating": "1",
        "review_title": "Worst of the worst",
        "review_detailed_main": "One of the worst movies I have ever seen. Race part 1 was very good. The sequel was somewhat palletable. But this one is simply unwatchable. The only thing that is half decent about this movie is the cinematography. It has been shot in beautiful locales. Give this movie a hard pass"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ritikmangal-67895",
        "review_rating": "1",
        "review_title": "bakwaasmovie.jpg",
        "review_detailed_main": "-10 star. Salman and tony kakkar together should be declared as pandemic 2.0."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "trinu",
        "review_rating": "2",
        "review_title": "Save your time",
        "review_detailed_main": "Save your time money and energy by not going in this movie. It is a horrible movie with no climax and hardly any thrill."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "schhari",
        "review_rating": "1",
        "review_title": "Feeling sorry",
        "review_detailed_main": "Worst movie with worst acting. Skskksmsksksmskksk Ujsjksksk Sjsikskskk."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kirikminchu",
        "review_rating": "4",
        "review_title": "Worth A Watch For *Salmanians*",
        "review_detailed_main": "A good movie to watch without searching for logic.... I found it worth a watch of 159 minutes by skipping the hard-to-listen songs and the badly directed action... Its bad to watch Salman As the son of Anil Kapoor, i remember them acting as friends in Biwi No. 1 and Now they are father and son ! Though Anil said it was experimental, that doesnt prove to be good as the story doesnt support it The twists were said to be the plus point of the film but they only become the minus points... Bobby Deol's character was full of confusion for me...... Once again, as said before, its worth a watch for salmanians, the car-lovers and non-finders of logic"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "skazharuddin-26032",
        "review_rating": "10",
        "review_title": "Blockbuster Race 3",
        "review_detailed_main": "Salman Khan Swag Acting, and Anil Sir actiing masters peace... Blockbuster action.. boby also well job.. entertainment Blockbuster,"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "deveshmaisuria",
        "review_rating": "4",
        "review_title": "I knew it already. This film is just bad.",
        "review_detailed_main": "So Race 3 hits the theaters and I went to see it. What I would say is that this movie is just a waste from scene to scene. Remo D'Souza did a very very bad job making this film. This film didn't even had a good story but in fact it was incredibly bad. At least Flying Jatt was a little bit better than this one but the direction stays the same for these films. Salman Khan's acting was so bad that you will not believe that he'll do this type of acting. Jacqueline was totally not needed in this movie and so is the other actors and actresses like Bobby Deol, Daisy Shah and Saqib Saleem. The only good thing about this movie was Anil Kapoor as how his character was more focused than anyone elses. Let's talk about the action in this movie. The action was very bad because it won't look as realistic as how Race 2's action sequences was. But then again it was also pointless. Also I think that this is one of the worst films of Salman Khan. And I also don't get why he would do these types of films.\n\nAnyways I would give this movie a 4/10 because I think that this movie showed that it is going to be bad from the trailer and the then movie itself was very bad compared to the trailer."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abinkurian-41513",
        "review_rating": "2",
        "review_title": "Wrose movie",
        "review_detailed_main": "Very bad movie for watching Remo D'Souza the director doesn't have common sense."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "brilliantjasper-48425",
        "review_rating": "1",
        "review_title": "Chee",
        "review_detailed_main": "Disgusting film...don't just watch. Please save urself by not watching race 3."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dev_rajdx",
        "review_rating": "1",
        "review_title": "Tatti movie",
        "review_detailed_main": "Salman should quit acting. This is horrible, freaking headache man."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "skmgamer",
        "review_rating": "1",
        "review_title": "Review",
        "review_detailed_main": "Repeated story. Bad action. First thing the great actors like salmon bhai can't able to make race 3 away from negative comments. So you all can understand how the worst was the film. I will not suggest you to watch this movie. If want to watch then watch on your on risks. The acting was so owsm in the movie the it get an achievement of the worst movie time of all times."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "boobooc-06588",
        "review_rating": "1",
        "review_title": "What a crap !!",
        "review_detailed_main": "Is this what we expected from Salman A. Khan ? What a shame bollywood !! Salman Khan should be banned to act."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tarjmehta",
        "review_rating": "1",
        "review_title": "Bawasir",
        "review_detailed_main": "Worst, non-sense, zero story, zero acting.\n\nHow even they think this movie will be watched! I could not even watch full trailer.\n\nI had to watch this at my friend's house otherwise I would have never seen this movie.\n\nWhy selmon bhai why!\n\nEven cast, director, producer needs to be ashamed of!\n\nCan't even think about action director!"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mukulrathi-40213",
        "review_rating": "1",
        "review_title": "Salman bhai has lost the plot",
        "review_detailed_main": "Salman bhai is doing the films which are doing bad to his career. Choosing wrong scripts and wrong director."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ramkumar-84186",
        "review_rating": "10",
        "review_title": "Complete Masala film 🔥🔥🔥",
        "review_detailed_main": "If you love hollywood type actions then this movie is for you ❤"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "VeeHarshu",
        "review_rating": "1",
        "review_title": "Worst movie of the Year",
        "review_detailed_main": "And the most boring movie of the Year. Nothing else to say."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "muqbool",
        "review_rating": "3",
        "review_title": "Don't bother",
        "review_detailed_main": "Forget it unless you like i) the Race franchise ii) Salman 6 pack iii) Bugatti Veyron"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "farhankhan203",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Utter garbage don't watch do something constructive"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "salmankhanoteri",
        "review_rating": "5",
        "review_title": "Good or bad can't decide",
        "review_detailed_main": "It is not very good movie compared to race 1 and race 2 but it's very good on movie direction but failed because of bad casting and too much twisted story."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashwinimishra-00612",
        "review_rating": "1",
        "review_title": "The worst package of director story actor",
        "review_detailed_main": "Remo sir please don't try to direct again. This is the worst movie I've ever scene."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pancholimanoj",
        "review_rating": "1",
        "review_title": "salman khan one of the worst movie",
        "review_detailed_main": "One of the worst movie i have ever seen . salman and cast specially daisy shah and saqib salman has spoil the hall movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vksmaurya",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Illogical story and scenes worst screenplay.. Only made for salman khan mad fans.."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chatsaurav",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": "It's a Tatti. Saridon recommended right in the first five mins."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sanandanaggarwal",
        "review_rating": "10",
        "review_title": "Good movie just too many songs",
        "review_detailed_main": "Salman khan looks stylish...casting is a bit of a issue and remo putting songs at wrong places and too often.u have salman khan,dont make him dance.just let him stand and do his thing and you'll have a good movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "RuRu6",
        "review_rating": "1",
        "review_title": "Dont ever watch this movie",
        "review_detailed_main": "A total waste of time. Not even worth 1/10! I was so disgusted. My expectation was that the movie would not be as great as race 1 which is a 10/10 or maybe not as good as race 2 which I would rate as 7/10 but at least 5/10. Ong this is a total flop. The fights scene between daisy and jacqueline made me scratch my eyes. 😐"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "iruparun",
        "review_rating": "1",
        "review_title": "Worst film of the decade",
        "review_detailed_main": "Directer ruins up physics. How can someone be so dumped minded I don't know. There is no story no action worth praising there is nothing in this flipin film."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sachin-02327",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Worst movie ever i see Worst movie ever i see Worst movie ever i see Worst movie ever i see Worst movie ever i see Worst movie ever i see"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shazadilyas",
        "review_rating": "2",
        "review_title": "DisgRACE",
        "review_detailed_main": "Title says it all. Nonsense switched off after 25 mins."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ctksqbg",
        "review_rating": "1",
        "review_title": "Waist of time n money",
        "review_detailed_main": "Waist of time n money Waist of time n money Waist of time n money Waist of time n money."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dragstarapache",
        "review_rating": "1",
        "review_title": "Worst movie of all time",
        "review_detailed_main": "When physics commits suicide. Selmon Bhoi seriously needs to learn driving."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anubhavadarsh",
        "review_rating": "1",
        "review_title": "Selmon Bhoi",
        "review_detailed_main": "Only for rickshaw wala n bhoi fans. It's just cringe nothing near to a descent movie, poor story,acting,actions everything."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "samarveersingh-18907",
        "review_rating": "2",
        "review_title": "Flop!",
        "review_detailed_main": "Bakwas ever after (Tubelight), Salman Khan is very intrested to make flop movies why he is making is fans too feel bakwas while seeing race 3."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "anand-sk0901",
        "review_rating": "1",
        "review_title": "Tatti muvie",
        "review_detailed_main": "Tatti hai Yeh ekdum tatti. Bohot badi tatti.bohot ghatia tatti"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aakashvishwakarma",
        "review_rating": "1",
        "review_title": "One of the worst",
        "review_detailed_main": "Awful storyline horrible action scene worst acting."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "subhammitra",
        "review_rating": "1",
        "review_title": "Bogus.",
        "review_detailed_main": "Not a good Film , Bogus film of the year , not upto the mark , not worth watching , Better watch sensible films , Garbage less."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pseudononymous-62722",
        "review_rating": "1",
        "review_title": "Physically revolted.",
        "review_detailed_main": "This guy. Why does he exist? This irrelevant Grampa of Bollywood needs to stop making movies. Idiot."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aziza-ismail1",
        "review_rating": "5",
        "review_title": "A substandard effort",
        "review_detailed_main": "Ok I get all the hate and negative reviews, and I understand totally why but rating it below 4/10 is too harsh. First of all the original directors should have never been replaced, they are what makes Race franchise a successful one, if you look at the previous works they own this genre of suspense and thrillers. Although Race 2 was a little behind the original Race in film making, it stills stands out minus the fashion show.\n\nThis Race 3 has the elements and potential but is made for all the wrong reasons namely Salman Khans showcase. He is an entertaining actor no doubt and I like his movies but this was a wrong move that killed the Race franchise. Race is all about the thrilling ride and the shocking twist of betrayal, however Race 3 falls flat in this department, its reveal and twist isnt shocking and everything was just messed up. The ideas were there but it couldnt be woven in its screenplay, the director seem not to know where he going with this movie. It gets too messy and the events during the film does not tie up fully at the end.\n\nThe rest of the cast are just there to add more confusion and bad acting. Anil Kapoor is decent and Salman is just average, seen better films of his. Jacqueline is just there for sake of having a beautiful actress in the film with no meaty parts, Daisy is average and Saqeeb is irritating. A good actor like Bobby Deol is wasted.\n\nMusic was below par compared to other 2 films but still enjoyable. For a big budget film better looking locations should have been used. Nevertheless it is still a movie that has good action scenes and maybe enjoy if you ignore all the flaws and potholes in the story and the below average script and actors."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "singhshivam-95002",
        "review_rating": "1",
        "review_title": "Selmon khuni type ki movie hai .",
        "review_detailed_main": "This movie is very rubbish. Don't watch this movie, please save your time."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "gurbeantsi",
        "review_rating": "1",
        "review_title": "don't waste your time",
        "review_detailed_main": "Have never left a bad review on a movie so had to go out of my way to leave one. save your time and money and don't bother watching this. trust me, you're not missing out."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "lokeshlalla",
        "review_rating": "1",
        "review_title": "Worst movie of the century",
        "review_detailed_main": "Everything about this movie is pathetic from music to lyrics to singing by the great bhaijan. Acting, story, plot, twists everything is disastrous"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "umar-18884",
        "review_rating": "10",
        "review_title": "Blockbuster",
        "review_detailed_main": "Just salman khan has rocked the movie if this movie would have amir or srk the. It wont touch 100cr"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "n_bhagiya",
        "review_rating": "2",
        "review_title": "One of the worst Salman Khan films ever..",
        "review_detailed_main": "And so it was speculated and it proved to be right...Salman Khan has ruined one of the most loved film franchises by entering in it and making it the worst film of the franchise by putting bad songs,bad actors and just everything bad...I hate Salman for doing this and the truth is Saif was the best choice for the franchise.."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aisehifaltuid",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "As said, a third class movie om third class script by a third class director on the verge of third class south indian movie style with third class superstar of third class audience. Pathetic."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ritugoelk",
        "review_rating": "1",
        "review_title": "Please do not watch!",
        "review_detailed_main": "The most pathetic film i have ever watched. Just wasted my 3 hours. !!! Please please dont watch. I wish there was an option to give negatice rating."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "dobariyaanil",
        "review_rating": "1",
        "review_title": "Wrost movie",
        "review_detailed_main": "Dont watch Waste of time, wrost actor. One more bakwas movie of bollywood."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ayyanahmad-99744",
        "review_rating": "1",
        "review_title": "Bad crap",
        "review_detailed_main": "Rubbish film race 2 was much better and the actors were disappointing"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nisunishu",
        "review_rating": "4",
        "review_title": "Black mark on Race franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rahamanosij",
        "review_rating": "1",
        "review_title": "Not watchable",
        "review_detailed_main": "Saw it in amazon prime. I wish I could have saved the time to watch a better movie or series. What can I say normally I don't give any review but after watching the movie I thought I should give a review for taking audience granted by some producers and actors. They think if we sign some super star then script, director, content doesn't matter. I hope after srk's one by one flop if Salman also get one by one flop then those producers will understand. What the hell was that seriously. 1st time ever I missed saif ali khan. Wrost possible direction, Wrost possible acting, Wrost possible script, nothing was good not even the songs. Total waste of time."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jainrishabhjain-24336",
        "review_rating": "1",
        "review_title": "Worst film",
        "review_detailed_main": "Worst film ever i have ever watched in my life how someone can crear this kind of film."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nkajal",
        "review_rating": "10",
        "review_title": "Awesome as always Salman Khan",
        "review_detailed_main": "This loves has everything we all are looking for and salman is there so no need to check anything, just watch it and enjoy. Wonderful songs and stunt is perfect. If some ppl do not like it then they should not watch this good movie but can't judge from some ppl. I like it and will watch it again."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arunsinghmzn-13509",
        "review_rating": "1",
        "review_title": "Full of time waste",
        "review_detailed_main": "Illogical movie, illogical story, illogical acting, illogical dialogues, all in all everything is illogical in this movie . I dont know why these kind of movies are making in india. These movies bringing down the image of indian cinema. People who have brain kindly Dont watch this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "spdeshatwad",
        "review_rating": "1",
        "review_title": "Funniest movie ever😂😂😂",
        "review_detailed_main": "Gajab hai bhai, bajab.litrally the worst movie ever.it just cant get more worse. This is pure waste of money making such huge disaster"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ceeedeee",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "This movie is bad and just gives you an headache . Nothing is good in this movie and songs randomly appear. After the movie got over I have so many questions. Biggest one why was this made."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "poonamvssburla",
        "review_rating": "1",
        "review_title": "Add a 0 star or better a MINUS 😒😒😒",
        "review_detailed_main": "Why isn't there a 0 star !!!!!!!!😠 There is something called a retirement .Plz retire and stop tormenting people with these baseless, meaningless, sub standard clichéd storylines without even backing it up with good acting ..."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "shaleenjain-29883",
        "review_rating": "1",
        "review_title": "An Absolute Must Watch",
        "review_detailed_main": "Not because it is a great movie, but to witness how senseless a movie could be. This movie will definitely raise your ratings for the other worst movies that you have seen in your lifetime. A Tough competitor to all of them."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tonitinsood",
        "review_rating": "1",
        "review_title": "A sad comedy of errors",
        "review_detailed_main": "Race 3 can only be described as 'uggh'. The movie limped and wallowed from the very beginning and never really got off. It was an attempt at a masala movie with some poorly executed acting, direction and storyline. The storyline infact was altogether missing.\n\nRace has been a solid franchise delivering 2 thrilling fast paced action movies, backed by slick editing and well crafted action and dance sequence. This movie is unlike the others at best a disgrace to the franchise. The action sequences are a bore, cliched, trite scenes.\n\nThe star cast seems wasted and the impressive balance between the hero and goons which was the underpinning of the Race series, completely missing. Veteran actors with salt grey hair are being paired with absolute novices, making it seem fake and dubious. The dialogues and song sequences are absolutely shallow, a lazy concoction of english and hindi with little thought or consideration to meaning.\n\nBut more than anything the movie sinks because of poor and inattentive direction. Remo lives up to his talent of vomitting shoddy, half baked, cliched movies to audiences. Fast paced action sequences are immediately followed by absolutely slow listless songs, making it seem like bumpy edits with no continuation. Storyline was probably trashed long before the shoot and impulsive, knee-jerk shoots were knit together to create a semblance of a storyline.\n\nBut the true artistic talent is revealed in corporate sponsorships with Marriot, Dell and many other tobacco companies finding mention and feature.\n\nOverall, its sad to see A Grade actors concurring to work in such a movie. It is doled to audiences, in a brazen manner, ridiculing and deriding their intellect. Suggestive that audience only merit such movies and will wallow it up in favor of big star cast."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "onlineamar",
        "review_rating": "1",
        "review_title": "He won't be called an actor. Becase he can't do acting.",
        "review_detailed_main": "Solemon is so dull. He even can't do acting. Very rubbish.\n\nThe film is as usual boring and third class. It has nothing to watch."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sandeepnaga2000",
        "review_rating": "1",
        "review_title": "Illogical",
        "review_detailed_main": "Illogical movie with no content. Feel sad for the producers"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "osamailm3",
        "review_rating": "10",
        "review_title": "Race 3 An Excellent Family Movie",
        "review_detailed_main": "Race 3 is the most anticipated movie of the year 2018 of Salman Khan. This movie has magical twists and extra Ordinary Visual effects. On top of that its a family movie which is too good. It is running excellent in Overseas Box office and in Pakistan as well. Despite of the negative reviews from haters who get paid from the other bollywood actors who are jealous from the success of Salman Khan. The most beautiful thing about this movies is that you can watch it with your whole family. This is the beauty of Salman Khan's Movies always. That is the reason this movie is successfully running on Indian Box Office, Overseas Box Office. In Pakistan Race 3 is setting up new records and hopefully it will break all the records worldwide and in India & Pakistan as well. Please go and watch this movie with your family. Its a good entertaining movie. Remember Salman is the most powerful character of the Movie. Movie has an excellent family story along with excellent twists which is a beauty of Race series. We are waiting for ace 4 release and hope that Salman will work in it again. Love you Salman and Race 3 team."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "nivesingh",
        "review_rating": "1",
        "review_title": "Watch it for bobby deol",
        "review_detailed_main": "I watched it for bobby deol and I was not disappointed. It is good to see him in a movie after such a long time. Else, there's nothing in this movie, it's imitated the action from hollywood movies and has otherwise nothing to offer."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "indiangamer-22879",
        "review_rating": "1",
        "review_title": "-100 rating but I cannot give it",
        "review_detailed_main": "Worst film ever Worst film ever Worst film ever Worst film ever Worst film ever."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "vipulhadiya15",
        "review_rating": "1",
        "review_title": "I wish i could unseen this moview",
        "review_detailed_main": "I am sure they started the movie without story and asked to actors to do whatever they want to do without context. well their business is their business, none of my business."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Husna-Malik",
        "review_rating": "1",
        "review_title": "An eyesore",
        "review_detailed_main": "Race 3 is a mere show-reel for Salman Khan fans. Poorly directed, with a ridiculous plot and sub-par acting, synonymous of Salman Khan. It makes you question your mind as to why on earth you'd sit through this torture."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chathura7",
        "review_rating": "1",
        "review_title": "Worst ever",
        "review_detailed_main": "Please INDIA don't make such kind of movies. It is better to smash our eyes rather than watching this movie. Totally sucks !"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rishad_bd",
        "review_rating": "1",
        "review_title": "Disappointment",
        "review_detailed_main": "Number 1 best worst movie. Go somewhere and never come back."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "jonathanmichaeltmp-92433",
        "review_rating": "1",
        "review_title": "very awful movies",
        "review_detailed_main": "Boring movie, if i able give negetive ratting i would have"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "darkmaster-29686",
        "review_rating": "1",
        "review_title": "Bhai Bhai Bhai - superb acting",
        "review_detailed_main": "I dont know what came into the mind of producers to cast Salman Khan in a franchise like this big. Why wasnt this movie banned for making people mentally ill after watching the flick on theatres."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hrishikeshd-42216",
        "review_rating": "10",
        "review_title": "Its all about the style",
        "review_detailed_main": "One thing you should understand before watching any salman khan action movie it only entertainment purposes and nothing to do with any other aspects of so called cenema he is Entertainment and this movie is full of it"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "kazumithapa",
        "review_rating": "1",
        "review_title": "Race 3",
        "review_detailed_main": "I hate this movie because there is impossible scense are done which is not in real life . Only a song is nice . Other this is wrost ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "monkey-king-907-930172",
        "review_rating": "1",
        "review_title": "Best film ever",
        "review_detailed_main": "This movie was amazing. I loved it. But my head was sore after watching it. I took a couple of paracetamols and went to sleep. The next day my head continued to throb; even my eyes were watering. I didn't think much of it all until a week later when it continued to persist.\n\nI went to my doctor who did a few check-ups: an x-day of my head, an ophthalmoscopy of my eyes etc. A few days later, I was called back in to discuss my results. The doctor asked what I had been doing before my headaches started. I told him I was watching Salman's best film to date, Race 3. \"Go figures,\" he said. He handed me the results. I'm back home now with cataracts in both my eyes and a tumour the size of a small plum in my head...\n\nWould still watch again. Proud of you Salman."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "tanshusuman",
        "review_rating": "1",
        "review_title": "One of the worst movie of Salman",
        "review_detailed_main": "Don't watch this .As in this movie nothing is new . All characters are sluggish in their acting & plot also . There is huge difference between all its sequels. Only Anil Kapoor is quite fascinating in his character with his white beard."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "bijoyds20",
        "review_rating": "1",
        "review_title": "Its an Aweful and a genuine boring Movie",
        "review_detailed_main": "Not because everyone says its a worst movie, I am rating it so low ,but I have wasted couple of hours to watch this movie and I genuinely felt the boredom And was irritated by looking at all the characters who did an aweful and really bad job.. overall its a worst movie"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chandanimanoj-23622",
        "review_rating": "4",
        "review_title": "Worst acting",
        "review_detailed_main": "Boring movie worst acting by all the actors.first half is quite impossible to understand."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "rocksonbrosaurs",
        "review_rating": "1",
        "review_title": "Selmon bhai should stop acting",
        "review_detailed_main": "Worst movie ever. Trust me. Selmon bhi should stop acting.. He can't act. He's the worst actor ever in the world."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "abhisheksarkar901",
        "review_rating": "1",
        "review_title": "It literally gave me severe headache",
        "review_detailed_main": "I felt nauseous halfway through the movie. How can someone with a brain invest thier money and time making this crap."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "aagarwalravi",
        "review_rating": "1",
        "review_title": "A must watch",
        "review_detailed_main": "This is a must watch movie. It is a movie ahead of its time. Far far away in a world unknown when we will not have movies with any story/acting/plot and this one would become a cult movie then. If you haven't seen it yet, please watch it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "osamailm3",
        "review_rating": "10",
        "review_title": "Race 3 a Best Family Movie",
        "review_detailed_main": "Lots of haters are saying that Race 3 is an action Prem Ratan Dhan payo Drama. For their Information Salman Khan always give preferences to Family Values and Unity of Family. He always thinks that peace can be made at any level. He knows that there are enemies and haters in a family but if we want, we can make peace and friendship again in the family. Peace can be made even among fatal enemies if we want to do it with Positive thinking and positive heart. Thats why in Climax of movie he made peace with the enemy. Thats why we call Salman Khan Being Human ( A man with Golden heart). His movies can be watched by little one, elders, youngsters. It does not contain vulgarity. I watched this movie again today and found this good point in the movie. This is the reason people in overseas markets who miss their family and dear ones a lot while living away from India, Pakistan and other Countries are liking this movie a lot. Lets try to make peace and remove grudges against the people with which we are not in good terms. Lets watch this move again and again. Make it a Block Buster movie of the year 2018. Weekend is coming lets share this message again and again. And lets watch this movie again and set new records for Race 3."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "pawarsagar-75575",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Ridiculous,ghatiya acting,ghatiya movie and worst story."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "virajdivekar",
        "review_rating": "1",
        "review_title": "BAD DIRECTION",
        "review_detailed_main": "RACE was good till it was directed my Abbas Mastaan! Dance direction was still good.. until u came into movies Remo sir! Bad direction ; Bad movie ! I think we just should do things we are good at !"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "captainr-53858",
        "review_rating": "1",
        "review_title": "Thumbs down.",
        "review_detailed_main": "Infact Salman is a festival born. He always releases movies in festival since wanted."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "fozankhan-21170",
        "review_rating": "8",
        "review_title": "\"Race 3\" (2018) - An Entertaining Action Extravaganza with Star Power",
        "review_detailed_main": "\"Race 3,\" the third installment in the popular \"Race\" franchise, is a high-octane action thriller that promises adrenaline-pumping sequences, glamorous settings, and an ensemble cast of Bollywood's biggest stars. Directed by Remo D'Souza, this film boasts sleek action, stunning locations, and a plot filled with twists and turns.\n\nStory and Direction: \"Race 3\" introduces us to the world of the Singh family, led by Shamsher Singh, played by Anil Kapoor. When the family gets entangled in a web of deceit and betrayal, Salman Khan's character, Sikander Singh, becomes the center of the action. The film takes the audience on a roller-coaster ride of suspense, betrayal, and jaw-dropping action sequences. Remo D'Souza's direction ensures that the story moves at a brisk pace, maintaining the audience's attention throughout.\n\nCinematography: The film boasts breathtaking cinematography by Ayananka Bose, capturing picturesque locales from exotic foreign cities to lavish interiors. The slick camerawork beautifully complements the stylish action sequences and adds a grandeur to the film's presentation.\n\nActing: The star-studded cast of \"Race 3\" delivers charismatic performances. Salman Khan brings his trademark charm and swag to the role of Sikander Singh, making him a larger-than-life character. Anil Kapoor's portrayal of Shamsher Singh is suave and compelling, while Jacqueline Fernandez, Daisy Shah, Bobby Deol, and Saqib Saleem infuse energy into their respective roles. The ensemble chemistry adds to the film's entertainment value.\n\nBackground Music: The film's background score, composed by Salim-Sulaiman, heightens the intensity of the action sequences and enhances the overall drama. The music is well-suited to the genre and effectively elevates the film's thrilling moments.\n\nEditing and Pacing: The editing by Rameshwar S. Bhagat keeps the narrative tight, maintaining a steady flow of action and suspense. The film's pacing, although occasionally over-the-top, manages to hold the audience's attention, creating a gripping cinematic experience.\n\nAction and Stunts: \"Race 3\" is packed with adrenaline-fueled action and breathtaking stunts, choreographed by Anal Arasu and Tom Struthers. From high-octane car chases to jaw-dropping hand-to-hand combat, the film delivers on the promise of a thrilling action spectacle. Salman Khan's action sequences are a highlight, showcasing his charisma as an action hero.\n\nDialogues: The film features a mix of intense and dramatic dialogues that suit the genre. Some lines may become memorable for fans of the franchise, adding to the film's quotable moments.\n\nIn conclusion, \"Race 3\" is a larger-than-life action extravaganza that serves its purpose of providing entertaining popcorn entertainment. While the film might not be without flaws, it delivers on the promise of action, drama, and star power, making it an engaging watch for fans of the franchise and enthusiasts of action-packed Bollywood films."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "barcacatalunia",
        "review_rating": "9",
        "review_title": "Full Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mayanksharma-10171",
        "review_rating": "9",
        "review_title": "Good one time watch",
        "review_detailed_main": "First half sucks, songs are terrible but second half is watchable"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sagarhossaink-99869",
        "review_rating": "9",
        "review_title": "Entertaining !!",
        "review_detailed_main": "\"We live in a box of space and time. Movies are windows in its walls. They allow us to enter other minds, not simply in the sense of identifying with the characters, although that is an important part of it, but by seeing the world as another person sees it.\""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "fozankhan-85285",
        "review_rating": "8",
        "review_title": "Review of race 3",
        "review_detailed_main": "The main culprit of the movie is script . The script could have been a bit better. During race 3 interview Salman revealed that he said that there should be some changes in the script . Due to the script the film doesn't seem that enjoying or extraordinary. \"Family\" word is use so many time throughout the movie . Audiences got confused whether they are watching race 3 or prem ratan dhan payo. Race 3 lacks of that race series feel . Though race 3 talks about so much of family. It fails to connect with family. Saif Ali Khan should be in place of Salman Khan. As Salman is not suitable for suspense thriller . As suspense thriller shows sometime protagonists as antagonist. So Saif Ali Khan should have been in place of Salman Khan. Bobby deol and saqib saleem role can be interchanged . I mean Bobby deol as anil Kapoor's son . I mean who wanna see this . And he doesn't look like his son . Overall acting are good of all actors .salman Khan did justice to the role.Jacqueline Fernandez also did justice to the role and people who say she can't act should see this movie .3 songs are good Heeriye,Allah duhai hai,I found love. background score was amazing loved it .direction was also good . Overall it's a 1 time watch movie .and you can watch this movie on lazy Sunday or when your getting bored ."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "ashufouzdar",
        "review_rating": "10",
        "review_title": "Love salman khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "mandalsaurav-51608",
        "review_rating": "9",
        "review_title": "Very good movie",
        "review_detailed_main": "Watch it with your family. The era of salman khan."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "suhism",
        "review_rating": "9",
        "review_title": "Spectacular Family Blockbuster.",
        "review_detailed_main": "It may not be better than Saaho but this is one of Salman Khan's best films and the cast was extremely amazing. In terms of action and drama. This was excellent. There may have not been so much comedy or romance. But it still deserves good credit."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "technagar",
        "review_rating": "9",
        "review_title": "race 3💩💩💩",
        "review_detailed_main": "What to say about movie bad aspects Action happend for starting 35 minutes and that was also worst puthetic acting worst songs written by salman khan songs after songs cringy plot twist no story slow motion entries characters removing gogles for no reasons cringy dialouges 2/10 for anil kapoor . Cringy direction by remo d souza puthetic sequal. Salman khan made this movie to give work to unemployed people of industry. In short the movie is full of bad plot teist that will squize ur mind and this movie will make u realize why u invested ur time and money in this pogo cartoon or simply movie with also bad vfx."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "hasank-25105",
        "review_rating": "10",
        "review_title": "Best movie if u can action lover",
        "review_detailed_main": "Those who love movies can definitely watch this movie.\n\nLike watching the picture Those who are making bad comments about the film also believe in extremism.\n\nOf course, those who see the pictures will not read the reviews here. You will see the pictures after checking and sorting, you will definitely like it."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "saifullahmuhammad-96609",
        "review_rating": "8",
        "review_title": "HIGHLY UNDERRATED due to the wrong choice of director",
        "review_detailed_main": "First of all for all those referring to Salman as being a wrong choice for this film need to remember what a big disappointment Race 2 was taking into consideration its predecessor Race both which had Saif Ali Khan. This movie was particularly anticipated and did not meet the expectations of the audience at all. Like every film this one had its flaws as well but what truly degraded the movie and its presentation as a whole was it's direction in my opinion. Remo D Souza who had previously directed the ABCD franchise was not a good option for this action thriller. Had it been Abbas Mustan it would've been a much engaging and crisp film with the same script and screenplay. 2 songs Heeriye and the Allah duhai hai revamped version were excellent rest was total crap and could have been edited out. Party chale on was good though. Acting was bizarre and out of place by everyone besides Salman, Anil and Jacqueline. Salman and Anil kapoor carried the film throughout on their shoulders. Costumes and locations were exquisite. Some dialogues and direction again was extremely poor. This film had potential but the repulsive execution is its weakness. Action was new, stylish and extremely watchable. Opportunity gone wasted. My rating is based on the fact if you just take this as a standalone film and not part of the race franchise. Race 3 while being a big miss, earned est 303 Cr at the box office which is just a reinforcement of the fact that Salman Khan is the Biggest Megastar Of India in this decade. Lets see how far he goes."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "arifhasanthebest",
        "review_rating": "10",
        "review_title": "Not bad Story very good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sauhardjajoria",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "Awesome movie a must watch one should watch it on a big screen"
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "alifarddin",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Those who love movies will definitely watch this.\n\nNo one should watch bad and false comments movie.\n\nThey will judge for themselves by watching the movie.\n\nMany people here did not give a good review of this movie, because they are Salman Sir's hater's So, everyone watch this movie."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "chunchunmarilol",
        "review_rating": "10",
        "review_title": "A Blockbuster Selmon Boi movie",
        "review_detailed_main": "Selmon bhoi is our Bhokpuri guy. The intense emosion he brought in the movie really touched my heart. Anil Kapoor is the ultra stud who has done it with his bhabhi which is a dream for many middle class bois . Daisy Shah had no business in the movie. Jacqueline is so seductive that bhoi even took her to her farmhouse. Lord Bobby DJ is the master mind, he is the real son of Shamsher singh (sorry for spoilers). So overall it was a great suspense movie but wanted to see selmon bhois Driver's entry. Jis race se mujhe nikalne ki baat kar rahe ye bewakoof nahi jaante ki me us race ka sikandar hoon. SELMON we LoVEeeeee U <3."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "sidaksidak",
        "review_rating": "10",
        "review_title": "What a movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "Mir_Rock",
        "review_rating": "9",
        "review_title": "Watch then decide",
        "review_detailed_main": "I am not sure why so many people left negative reviews but I thought the movie was pretty good. The action was good, plot had twists and overall was a good Bollywood entertainment package."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "breathx",
        "review_rating": "10",
        "review_title": "What a great movie by salman bhai",
        "review_detailed_main": "His acting is great and dailog killing script is too good."
    },
    {
        "movie_id": "tt7431594",
        "movie_name": "Race 3",
        "movie_rating": "1.9",
        "review_username": "usmancknaz-367-517486",
        "review_rating": "",
        "review_title": "Worst ever Film",
        "review_detailed_main": ""
    }
]