[
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "ashutosh-06",
        "review_rating": "7",
        "review_title": "Really good for a one time watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "6",
        "review_title": "A good family drama and watchable entertainer for many reasons",
        "review_detailed_main": "BROTHERS Review- After watching trailer i was thinking,why did they give 'Brothers' title to this film. Now i got my answer after watching this movie. A complete mixture of good story+quite interesting screenplay+good listen-able music+family emotions and kick ass action scenes. Movie starts very slow, took almost first 30 minutes to settle as if we can easily watch movie after half an hour. Then movie takes pace, involved us in their story and suddenly interval appears. 1st half left us with excitement what will happen in 2nd half and then 2nd half glued us to our seats till the end. 2nd half never drags for a minute. Martial art training scenes, fighters fight and little bit thrills completely immersed everyone in the movie. But i really think the climax could have been better don't know why makers did not think about any other way to end the movie. Anyways its not that important cause these things are avoidable. Acting wise Akshay Kumar and Siddhart Malhotra both delivers power packed performances. I repeat both delivers power packed performances not quality performances cause their characters was made to do so. We all have seen Akshay doing martial arts many times before but this time its much bigger and Siddhart also joins him this time. Jackie shines all the way with his old dramatic role. Jaqueline role is small she didn't got too much to do but still whatever she has done is quite okay. Other star cast were strictly okay. Music is not huge hit but each and every song is situational so leaves much better impact. 'Gaaye Ja' sounds one of the most melodious song in its particular scene. 'Mary' is catchy massy song and plays much better in theater. Overall a fairly good music to movie's genre. Screenplay was very loose in 1st half but very tight in 2nd half. Movie runtime is 155 minutes long and its not useful at all. They could have easily reduced it by 10-15 minutes. Direction is fairly good, He already had remake in hand so he doesn't have anything to try any experience. Still he has made a fairly watchable movie. Overall a good entertaining family drama with never seen before martial arts in bollywood. Its like experiencing fighting show in theater. I don't think anyone will leave theater with disappointment. Being an Akshay fan i say its must watch movie but being neutral i say its not must watch but definitely an one time watch for all. Only kids and senior citizens can skip it otherwise its for all ages and for all kind of audience. Go and watch this 1 time watchable entertainer and enjoy your time. 7* stars by me :) (y)"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "eminent-archit",
        "review_rating": "6",
        "review_title": "Movie Review: Brothers",
        "review_detailed_main": "For starters, brothers is the official remake of the critically acclaimed American sports drama Warrior. The good thing is that the remake retains some of the key scenes from the original but fails to create the same impact. Like the one where Garson gets drunk and Monty puts him to sleep. The same scene in the original had great emotional value but same cannot be said over here. Brothers takes a 'beating' (pun intended) due to its languid pace. The first half indulges itself into establishing the characters and their back story. It could've been well short by 20 minutes. Director Karan Malhotra does a good job with the back story. The first half also includes a meaningless item number which is only there to show that there can be a sequel to Chikni Chameli too.\n\nThe films picks up pace in the second half when the championship starts. The fights are well choreographed and chances are that you'll be clapping at some points while David is fighting. As far as the performances are concerned, Siddharth Malhotra does not quite sport the physique Tom Hardy had and also fails to express that vexation. He does do well in a few scenes. Jackie Shroff is good in his role but again nowhere close to Nick Nolte's nuanced performance which earned him an Oscar Nomination. His dialogues become inaudible sometimes, and his mannerism get repetitive. Jacqueline Fernandez is adequate in a de glam look and the supporting cast also is okay barring A very annoying Raj Zutshi. But the film rests on the shoulders of Akshay Kumar. The actor looks the part with a dashing salt pepper look and gives an excellently restrained performance. He owns the film. He exudes such warmth and helplessness in The final bout with his Brother. Although the final bout could've been better. A special mention for the background score for infusing life into the proceedings.\n\nI'm going with 2 out of 5 for director Karan Malhotra's Brothers. The film lacks tear jerking moments and is a bit too long. Watch it for Akshay Kumar's sincere performance."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "anupapu8",
        "review_rating": "6",
        "review_title": "Why Cant Bollywood can produce a real action film..",
        "review_detailed_main": "BROTHERS - WARRIOR the movie which has been remade as Brothers is one of my favorite Hollywood action film. And the reason why i liked it because it has fights choreographed so well that they looked real ,no CGI , no weapons only real fight . And i was excited when i heard that Karan Malhotra is remaking it who made such a delightful Agneepath remake. But i was scared with the question that can Bollywood make those fights look as good as compared to the Hollywood version . Then again the movie has been produced by Dharma production and FOX stars , they could have easily hired a Hollywood action director . But that's not the case. I guess they have thought keeping the budget low will be the good idea. Or may be they have thought Indian audience doesn't have high standard on 'One on One MMA' fights. But they forgot that Indian youth is totally opened to Hollywood movies . Our standards are high now , I my self is not satisfied with this. Not a single good fight was their. In all the action sequences the Camera and the Background music are shaking much more then the Fighter themselves , just for making the fighting intense which actually are not good at all . Its like Come On Man i have seen Akhsay doing better moves in non action films , he is not that old for being incapable of doing action scenes.. Its totally the fault of action choreographer , in fact even in 90s Akhsay have done better then this. In one scene Shidharth's character just punch his opponent's chin and the opponent who was double of his weight lost the fight on that single punch.. That scene was not at all believable , instead i was laughing on it , as it was just done because same has been done in the Hollywood version , the only difference is that the physic what Tom Hardy had in WARRIOR was much better , and with his great expression his punch was believable. Here is one more , in another fight one fighter just kick his opponent and his opponent flies 4 metre away to the cage boundary. Does that really happens in real world. But wait m not finished , in a sequence a Chinese fighter did a move in the air(which was yes correctly done) and Akshay dodges it by sliding down , that scene is so badly edited that its clearly visible the move and the dodge has been done separately and than both the scenes has been combined to show together. I mean why to do such scenes which you cant show correctly. Why not just stay on the ground and use your hands and legs to punch and kick and dodge like Martial Arts does. That's better to watch as compared to computer effect and flying with the help of rope. And yes the last fight between brothers which everyone has been waiting. My god , with Brothers India has beaten its own record of being melodramatic . Earlier we have seen Melodrama in emotional and romantic scenes but in Brothers you will see Melodrama in an action scene. Seriously saying , it all depend on how much your standards are high with action sequences , if you don't watch Hollywood film , don't know much about how real MMA fight look like then you have like the fights in brothers as i have seen people blowing whistle in there . All the above things i have written was just about the second half from which i had great expectations . But the first half was even worse. All the back story in Warrior which has been discussed by two brothers in it withing 10 mins has been shown in long 1 hr in this Bollywood version. Which could have been good if not stretched so long. \"Why not to concentrate on MMA if the movie is made on it\" , \"o wait Indian audience like back stories and tear jerking moments , so let fill the whole first half with sad melodramatic scenes\". In between that long stretched first half there were two beautifully picturized songs 'Sapna Jahan' & 'Gaaye Jaa' and one badly presented song MERA NAAM MARY in which Kareena was just walking here and there not even dancing. Seriously the song was no where close to Chikni Chameli from Agneepath. One good thing which was there in WARRIOR that both the brothers have their strong reasons to enter the tournament so the audience also get confused that which of the brother they were gonna support as both of them needs the money. But in brothers only one brother will get strong reason and from the start the audience will support him only not the other one. When it comes to acting Akhsay was good , but just good , not great like he was in Holiday or in Baby . Shidhart was totally miscast. I cant understand why he keep selecting such dark characters. He doesn't have the experience to do such characters. Just bulking up the body is not enough. Akhsay could have been better in Shidhart's character as angry young brother. And Hellooooo can any body tell me why the Hell VIDYUT JAMWAL is not in this movie if he can do such great action sequences by himself. I just cant figure out answer to that question. About Jackie shroff he has been given the character of the father for which Nick Nolte in Warrior has got Oscar nomination , but Jackie over did it. Haven't done justice with it. I am truly disappointed with Karan Malhotra who has according to me made a better Agneepath (yes the old one was classic but just because of Big B) out of the old one with a better story. 6.3/10. By ANuP APu KuMaR"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "Indian_Joker",
        "review_rating": "8",
        "review_title": "Hating Bollywood for no reason and saying Hollywood is great doesn't make your life look extraordinary awesome... So please Stop!!!",
        "review_detailed_main": "First of all I saw Warrior and it is great. I can see a lot of drama making people saying Hollywood is greater than Bollywood. But you know what, they have big budgets, developed technology and have discovered so much in Film Industry. Bollywood has nothing like that. So please think about it and stop comparing.\n\nComing to this film, I so think that this is a good effort by Karan Malhotra remaking Hollywood to show Bollywood \"Gawar\" fans (Hollywood Lovers Think So...).\n\n>Akshay Kumar as David delivered best as 3rd film after Baby and Gabbar Is Back. He is doing awesome movies these days. His Training & Martial-Arts scenes are absolute breathtaking. Khiladi at his best. >Siddharth Malhotra as Monty is awesome. Just one thing kept dissing me is that he doesn't have a body like Tom Hardy has in Warrior but still manages to defeat by punching them once.You cannot digest this thing. >Jacquline as Jenny is supportive + a good wife and mother. >Jackie has done a good work too.\n\nThere are some emotional scenes in the first part but the second just races towards end with a good plot scene. So if you haven't watched Warrior, this is the best thing you'll see. And if you have watched, better ask Hollywood attention diggers what to do!!!"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "jmoneyjohal",
        "review_rating": "7",
        "review_title": "A bloody emotional saga, Brothers is easily the best technical action film made in India.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "satender-s-chaudhary",
        "review_rating": "4",
        "review_title": "Brothers is a remake of WARRIORS but it is no WARRIORS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "rahulbnk30",
        "review_rating": "9",
        "review_title": "Worth a watch, don't miss",
        "review_detailed_main": "A movie which has emotion,drama,love,fight. Screenplay was good. may be there was some mistakes but that can be overlooked.. Music was good. \"Sapna Jahan\" & \"brothers anthem\" both are simply awesome but there was no need of that item song by Kareena Kapoor. AKshay Kumar is giving his best year probably. Uff what a superb actor he is & he was doing bad film like Entertainment,joker etc & was killing his acting skills. Hope he will do only sensible films from now on. Sid was looking like a beast who has no emotion, only knows how to fight, fight & fight & thats what his character demanded. Jackie Sroff, Asutosh Rana & Jacquline was also good at their small roles. Direction was good enough for the film. specially those fight sequences were really good. Overall worth a watch."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "r96sk",
        "review_rating": "6",
        "review_title": "It nails the heart, but",
        "review_detailed_main": "It nails the heart, but everything else about 'Brothers' is yawnful.\n\nThe film manages to make you care for Akshay Kumar's character David, as well as for Sidharth Malhotra's Monty but it's skewed heavily towards Kumar. Away from them though, it's poorly crafted storytelling in regards to the sporting and siblings/father parts of the plot.\n\nIt also goes on for too long, my version of the film - via Colors Cineplex - only ran for around two hours... I'm not sure where the apparent extra thirty or so minutes went, though I'm kinda glad as that extra portion would probably put my rating much lower. At least the music is nice.\n\nThere are many better Hindi sport dramas out there."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "abhisheksharma-92954",
        "review_rating": "1",
        "review_title": "Slow and boring",
        "review_detailed_main": "So its an official remake of Hollywood flick Warrior..Really?? Well its hard to believe Because not in a single frame this movie is even half as close to Tom hardy\" warrior.i never had a huge expectation from this movie but still i went in the theater with mixed expectation since i had really liked warrior.Where warrior was very well written and executed,brothers on the other hand lacks that treatment.Warrior was so intelligent and brothers is so dumb.Till the movie reaches interval,we all were wondering what is actually happening and then the second half came which was even more dumber.It has a weak plot that did not progress and eventually it collapsed down under its own weight offering just some blood shedding action scenes,but i would recommend you to watch TNA any time.This movie is simply avoidable,go and watch warrior instead.The music is also very boring and couldn't hold well for the movie,Siddharth had tried to act hard but all in vain.Its unimaginative how such a bowl of movie can be made from a movie like warrior.LAst time the combination of Karan Malhotra and Karan Johar worked well for Agneepath,but sadly it could not happen this time."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "madil62",
        "review_rating": "10",
        "review_title": "Very Good Movie ..... At Least Worth Your Time and Money",
        "review_detailed_main": "The Karan Malhotra Directed Movie is a Brilliant Mixture of Emotions and Action. Akshay Kumar-Sidharth Malhotra's Flick has the ability to grip your mind for the whole 156 Minutes. Karan Malhotra has directed it Brilliantly and the Duo(Akshay-Sid) has executed marvelously. According to me, Everything in the movie is perfect. From the Love of David for Monty to the Hate Monty Develops for the Elder Brother. The Tournament R2F is a revolutionary idea in the field of Street Fighting. The Villains and goons of the street become the hero of the country. For Me, The Fights of Monty were the best parts of the movie. Like how he knocks out the champion with just one punch and the next fighter within the first round. The Attitude of Monty was perfect too. Like How he Quits the ring even before the decision of the referee. Also David proves to be the most cleverest fighter of the tournament. He defends himself in the first and second round and then attacks in the third round when the opponent is tired. The Love of Jenny for David and the Affection of David for her daughter was remarkable. The guilt of Gary Fernendez, the hate-and-then-love of David for His Father, the Item Number of Katrina Kaif, The Choice of Fighters, the inspiration of the two brothers, the upsets of the tournament and everything was perfect and I would recommend this Movie as a must watch for everyone. I guess this is another 100-cror movie from Sidharth Malhotra after Ek Villain."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "saajid1723",
        "review_rating": "7",
        "review_title": "Superb Movie",
        "review_detailed_main": "The movie was just awesome.. first of all jakie shroff acting was so awesome in the first half specially. Akshay Kumar was just was outstanding with some emotion scenes and u can see in this movie why his khiladi of bollywood the way his performed stunts is just superb.sidhart had angry young man look he was so rough in the movie. jaquleine doesn't have a big part to play in the movie.. story was well mixed it takes it own time in first half to settle down (may feel bit of bored) but songs like \"mera naam mary\", \"Sapna Jahan\", \"gaye jaa\" are awesome to hear so u don't feel bored. Gaye jaa is just superb (Heartouching lyrics and the scenes too).. Second half is out and out fight so entertaining. u have to just sit whsitle and clap. second half is so fast u will feel like movie finished so soon.\n\nits a family entertainer go with family enjoy with brother. its a great watch don't miss it :)\n\ni go with 4.5/5"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "bollywoodirect",
        "review_rating": "3",
        "review_title": "Use your Right to Stay Away!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "avatar007",
        "review_rating": "",
        "review_title": "Neither a REBOOT nor a REMAKE. Only \"Inspired By\" Hollywood's WARRIOR. An Original Story well worth it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "sarathpillaijl",
        "review_rating": "6",
        "review_title": "Short review",
        "review_detailed_main": "Too much drama for a sports film. The punchy adrenaline rush that you expect from this genre is missing in this film. The cast has done wonders in making me feel good about this movie. The backstory is a plus, without the backstory i dont think this movie has anything good. There was one fight scene that delivered the right emotions,the rest were put together to stretch the movie. And that too is another negative, this film could have easily been trimmed, since the cast is capable they didn't have to extend the scenes to deliver the emotions. The direction and screenplay was awesome. The fight scenes were well choreographed except for some parts but its required for the Bollywood touch. The cast is superb. The story is wonderful, especially the backstory which fitted right in the movie. I see that they have taken inspiration from many movies in this genre. Overall an above average movie"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "reyaazkh",
        "review_rating": "9",
        "review_title": "Really good remake and even better movie!",
        "review_detailed_main": "Let's get the obvious out of the way, brothers is not better than warrior and that's a good thing. First of all it needs to be noted that brothers is not a rip off of warrior but a fully licensed remake of the Hollywood movie. Now onto the movie itself. Brothers which stars Akshay Kumar, Jackie Shroff & Sidharth Malhotra in the lead roles is a movie which promises big things, and wishes to please many audiences and it succeeds exceptionally. The movie is able to set up an emotional back story for the lead up to main events of the film which is the R2F. What this movie does differently to warrior is it provides insight into the history of the the lead characters and the reason behind conflict, it also alters the story to suit a Bollywood audience and try a few things differently. The movies biggest asset is without a doubt the actors, each of the three leads are able to portray their characters with the conviction, emotion and physicality that is required of them. Be it Jackie showing us his regret and conviction, Sidharth showing his anger and motivation or Akshay who provides us his emotion and motivation, each actor excels in their roles. Special mention must be given to Akshay and Sidharth whose training has certainly not gone unnoticed and made the movie all the more engaging, which brings us to the next point the fighting is solid, this movie contains fighting like never before in Bollywood and succeeds and providing edge of our seat action. The songs of the movie are good setting up the emotions, back story or the training, however the Mary song seems to be there just to showcase Kareena Kapoor. The story and screenplay along with the script are superb and credit must certainly be given to Karan Malhotra for directing this movie extremely well. My only issue with the movie is that a few things could've been cut like the Mary song which feels forced and a waste of time, or been worked around to provide more. Overall this movie is a must watch for the story, script, screenplay and most importantly the actors who do full justice to their roles and will definitely be written down in their filmographys as one of the best films and a must watch. Do not go into this movie wishing to compare it to warrior because then you are asking yourself to not enjoy this, instead go into this wanting to watch a Bollywood movie that isn't your typical masala film and instead a family drama as well as a sport drama. Definitely a must watch!"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "ajaytawrani",
        "review_rating": "7",
        "review_title": "Let's not compare 'Brothers' with 'Warrior\"",
        "review_detailed_main": "Firstly hats off to the people who've watched 'Warrior'. Indeed it is a good movie. Now, let's speak of 'Brothers'. Too many emotional scenes in the movie especially the 1st half which kinda felt excessive for most of the youth viewers. Second half of the movie is of course with lot of fight sequence yet it was disappointing especially when we have Akshay Kumar in the lead. Not to blame him when we have the action choreographer or directors around. Yes, there were few mind-blowing scenes of him yet nothing that you can carry with you home after the movie ends. In terms of acting, I'm not a fan of Jackie Shroff yet I personally find his best performance after 'Gardish'. Shefali Shah & Jaqueline Fernandes both justify their little yet important roles. From the start until the end of the movie one person who impresses is Akshay & the one who disappoints is 'Siddharth Malhotra' i.e., from acting to the action in the movie. Though I don't want to compare the characters with the ones in 'Warrior' yet 'David' is the upgraded version of 'Brendon' however don't find 'Monty' anywhere near to 'Tommy'. SAD. I wish we could see more of Ashutosh Rana especially when he was playing a important role. Watch it for Akshay Kumar, Jackie shroff, Shefali Shah, the background score, the 1st of its kind action scenes & plz, plz ignore Siddharth Malhotra & Kareena Kapoor."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "usamakhurshid",
        "review_rating": "1",
        "review_title": "i would suggest watching movie Warrior before this.",
        "review_detailed_main": "i was a bit angry, and was my primary reason for writing this review.the main thing i can say about this movie is that its a total worthless copy of the movie Warrior, i mean the basic thing about any movie is its plot and story and if u cant even get your own plot or story then u probably should stop making movies.And really its not that India doesn't have good writers or good stories to be told, so why copy.\n\nBesides copying the story from another movie lets review the other things. its got great songs that i gotta say no doubt on that. and the direction is pretty good too. the acting i gotta say was not that up to the mark but then again i automatically start comparing it with the movie Warrior which was phenomenally directed written and the actors did pretty amazing as well."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "pawanfeverbaba",
        "review_rating": "8",
        "review_title": "A Very Good effort",
        "review_detailed_main": "Karan Malhotra , the director of new Agneepath had impressed me with his intense and focus in direction in his first film. It was to the point and he has a knack of extracting great performances from his cast. But there is a self-indulgence in him which he is unable to control in some of the films important junctures. He had plenty of them in Agneepath climax and it is there in plenty all throughout brothers especially in first half. I don't have a problem with slow pace . It helps invest ourselves into the characters. I loved pace of Drishyam , gone girl, Shawshank redemption and so on. But I am not a fan of overstretched scenes which is the case in a lot of scenes of brothers. Jackie Shroff is a drunkard who has doting wife/son and a step son. we get it in the first instance. WE get the lives and turbulence of each of them in first instance. There is no need to slow down and stretch them so much. Karan has tweaked the character of tom hardy who had a rather coolness about himself that he dint care about any of his family members. here Sid is shown as a \"dutiful\" son which is filmy and reduces the complexity of the character. No fault of Sid Malhotra who has done very well in is role. The heart of the film lies in R2F ( meant to be UFC of real world) championship. The training montage of Akshay and Sid is awe- inspiring . The action choreography is not just brilliant but 1000000 MILES AHEAD of anything BW has given so far. But every time the adrenaline rush is poised to reach the next level, Karan squanders it by slowing the pace with irrelevant scenes. The fight scenes are so well choreographed but camera-work is not as good. What is the need to show expressions of Jacqueline and Kulbhushan Kharbanda in between, every single time? who cares how they are reacting! we want to see the fights uncut and in flow. The real coolness and brain of brothers is thanks to Eric Brown and Micheal Leher, the action choreographers. Thanks to these two talented people that at least each of the fight scenes has a unique personality and attitude in them. Siddharths fight scenes are about not just about brute force . They reflect a personality of one kind of fighting style. He views his opponents like his brother and thinks of ways to knock him out as fast as possible. While its the reverse for Akshay Kumar. His style is a different personality by itself. His signature moves are about exposing weaknesses of the fighter and then dominating them with technique. In this process, he allows himself to take a few blows if needed. I wish the film was directed by these two instead. Akshay Kumar takes his acting notch above baby and comes up with a subtle yet intense performance. His acting in climax is superb and he is at the peak of his career as an actor. Sidharth Malhotra is avg in first half but comes into his own in the second half. His scene with Jackie Shroff asking him to about the dilemma of his sons is brilliant. Jacqueline is very good as Akshays wife and gives realistic performance though her scenes were just not needed in second half. Jackie Shroff shouts , whispers and irritates in a role which needed someone more mature like Paresh Rawal may be Brothers is a very good effort to remake warrior but it is not entirely satisfying . it could have been a real masterpiece after baby. But its not a film to be missed because of strong performances from Akshay and Sidharth Malhotra. and of course the eye pleasing action scenes for the action junkies"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "jay-techie2007",
        "review_rating": "7",
        "review_title": "Improvisation of Warrior",
        "review_detailed_main": "Story and Screenplay (3/5): It is a story of two brothers turning enemies due circumstances and end up in a face-off at a Mixed Martial Arts competition, where it is a matter of life and death. While the story is highly predictable and quite cliché , the execution has been very good. They made some changes to the flashback story in the Warrior to suit the Indian audience and unlike in Warriors, you don't see any suspense on the background stories of characters in Brothers. They revealed everything right in the first half and the second half is completely dedicated to the \"fight\" which this movie is all about.\n\nThe Fights (4/5): So far, not many bollywood movies have had the amount of violence this movie has. The fights is the centrepiece of the movie and it does reasonably well, in spite of having stunt choreographers from the west. When you compare it with Hollywood movies and even some of Akshay Kumar's own movies like Khiladiyon Ka Khiladi, you realize the level of action could have been better. Director puts in some of the technical jargons around fight moves but there is nothing much more than that.\n\nActing (4/5): The casting of the movie is where I feel it does better than Warrior. The power packed performances of Akshay Kumar and the \"beefy\" Siddharth Malhotra provides the much needed steam to the movie. Siddharth might not have the physique of Tom Hardy but his height and voice does a lot of work for him. Akshay Kumar is impeccable with his expressions throughout the movie. However, the movie is a big let down when it comes to other characters like Jackie Shroff and Jacqueline Fernandez who are off track when it came to acting and dialog delivery. Kareena Kapoor has no work with the ridiculous unwanted item song. The movie could have done away with all the songs.\n\nDirection and Cinematography (3/5): The plot demanded melodrama and the director, Karan Malhotra, exploits it quite well. He has kept the story relatively simple compared to Warriors, making audience focus only on fights in the second half. However, editing sucks big time as the flashback appears in patches and doesn't knit well. The entire first half could have been cut down by about 15-20 minutes with proper editing. The movie required an above average camera-work and that's where it falls flat in the ring.\n\nOverall (3.5/5): Overall, you would enjoy the movie if you haven't watched Warriors. The movie is well made, especially in the second half. I can't see a better casting for the movie among the contemporary lot of actors and Akshay Kumar and Siddharth Malhotra nails it."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "nairtejas",
        "review_rating": "4",
        "review_title": "Supermen & Drama. ♦ 44%",
        "review_detailed_main": "2015 has been a terrible year for Hindi cinema. The official remake of the hit Gavin O'Connor film Warrior (2011), Brothers is a solid example to prove that the previous statement is, in fact, true.\n\nAn alcoholic martial arts trainer (Shroff) accidentally commits a crime that sees his whole family fall apart, giving rise to a rivalry between his two sons, which is irreverently taken inside a wrestling ring. The revelation that one of the two sons was born out of wedlock was the cause of the crime, and continues as a driving cause of the whole story. Now all grown up, David (Kumar), the elder son, is battling for a better pay as a high school teacher, moonlighting as a fighter, to fend for his daughter's critical disease while Monty (Malhotra), alcoholic junior and chip off the old block, is still not over his decades-long familial issues and does specifically nothing for a living. In an international mixed martial arts championship that blooms out of nowhere, David and Monty fight it out through the tough line- up to end up in a one-on-one finale.\n\nI can disclose anything and everything about the film and no one can accuse me of being a spoilsport, because the title itself blurts it out loud what and how the film's climax is going to roll out. There is a lot of melodrama before things actually start to make sense, and by the time it culminates with a predictable ending, one wonders what the film was really about. Was it about the rivalry? Was it about the blood relation? Was it about fooling the audience? The happenings inside the ring are literally unbelievable and while most films in this genre try to wrap it up sooner, this one here has the whole second act dedicated to it. Although the production design is greatly supportive, the fights happen back-to-back, where these so-called supermen flex few muscles and show like they toil harder than Chilean miners by eventually winning. And they want us to believe that. Arr, not happening.\n\nShroff acts fine, but is too loud for his dull character. Malhotra looks confused and seems to be thinking about why he chose the project. Kumar looks hungover from playing the notorious vigilante in his previous Bollywood potboiler Gabbar is Back (2015).\n\nBOTTOM LINE: Brothers is a faintly engaging family drama attached with a random sport. Avoid.\n\nVERDICT: 4 stars out of 10. Another remake bites the dust.\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "shahwaleedbutt",
        "review_rating": "10",
        "review_title": "Don't waste your time while reading reviews, movie deserves your money.",
        "review_detailed_main": "My review for ‪#Brothers‬\n\nSubtle act of Akshay, sensitive performance by Jackie and deadly punches by Sidharth, are reasons good enough to give it a dekho!!!they gave their 200% to it. #Brothers Has both DRAMA and EMOTIONS with a never seen before fight sequences... ‪#AkshayKumar‬ looks like a real MMA fighter & ‪#SidharthMalhotra‬ is so raw and outstanding, looks like he is the next big thing in bollywood. Superb climax, I cried #Brothers proved blood is thicker then hatred 👌what an epic second half. Third masterpiece in a row by Akshay this year. This year belongs to Akshay!! Hattrick!"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "shashwatgupta-57972",
        "review_rating": "7",
        "review_title": "Pulls the heart strings just right",
        "review_detailed_main": "2 estranged brothers. 1 fighting tournament.\n\nR2F is an international MMA tournament brought to India by Peter Braganza. Whilst introducing the concept to a tv anchor, he says something that is the core essence of the film. In a third world country like India, one has to fight on a daily basis to make ends meet. Everyone is fighting different entities, some are fighting external circumstances while some grappling with their inner demons...From the streets, a fighter shall emerge and rightfully show the indomitable fighting spirit symbolic of this country's spirit on the international stage.\n\nAs the film's plot is pretty straightforward, the onus was on the acting and audiovisual effects to serve us the pangs replete of regret, hatred and internal strife within the protagonists, and they have commendably risen to the occasion. Fight scenes were really professional, so was the portrayal of the reception such an event would receive in our country. All actors were on point, but some fights(especially of Monty's) were way over the top, but all in all a brilliant one time watch."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "aashinirdesai",
        "review_rating": "3",
        "review_title": "Bloody emotional drama for no reason",
        "review_detailed_main": "Wasted my Sunday on this...seriously even for action lovers, its not satisfying and action haters, save your money for other good movies...or for \"Sapna jahan\" song, buy 50rs ticket and don't forget to take earphones. Akki Sid and Jacq lovers...they'll watch no matter what others say!! Some characters are useless...some fights are senseless...and typical bollywood drama...nonsense Previous hits like baahubali bajrangi drishyam were perfect and worth watching...After them...this is a disaster I am not a hater of anyone of them but acting level is not so high...we can say its a new Karan-Arjun movie with new background which is worst in every aspect plus the length is so irritating...speed is slow and basic story In short, it is overrated remake...please avoid _/\\_"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "dwaipayan771994",
        "review_rating": "7",
        "review_title": "Good Try but Still Warrior is far better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "divash-rock22",
        "review_rating": "10",
        "review_title": "good movie with top class action and emotions",
        "review_detailed_main": "I like the movie very much. I was xcited for this movie. Movie is little slow in first half. But I don't get bored. When 2half starts and the tournament begins then the whole audience in the hall can't hold their whistle and claps. Especially in that punch from monty in his first fight of tournament. Akshay kumar is simply outstanding he plays the role of David. His action seens look real. Sid also good at the movie. Jacqueline was also good and Jacky sir give his best. The last fight give me goosebumps. Movie was really good having best action scenes that never seen before in b.wood. A must watch Family entertainer for u all."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "garlicpoobreath",
        "review_rating": "6",
        "review_title": "Blood against Blood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "thunderstormvanilla",
        "review_rating": "1",
        "review_title": "Do not watch this movie.",
        "review_detailed_main": "The worst storytelling, very bad acting by most of the cast, irritating background music, clichés, that's brothers for you. I wish I could get those 2.5 hours of my life back or at least my money. Completely irrelevant item number by Kareena kapoor. Very very dull acting by siddharth malhotra. The direction of movie is so awful. It's movies like these that I wonder that after completion do they even show it to a bunch of people to assess it? How do these movies even hit the theaters in the first place? I have no idea why Akshay Kumar agreed for this movie. Nothing almost nothing about this movie is good it's just plain bad except for being unintentionally funny. Please do not make movies like these."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "uditgo",
        "review_rating": "10",
        "review_title": "Outstanding! Will win ur heart! A definite watch.",
        "review_detailed_main": "This movie is certainly d best sports drama of all d ages! With a right amount of action and emotion,,this movie is sure to win the heart of every moviegoer. The second half is actually the best part which has a high octane action sequences. Well directed,and superbly acted,,this is a worth watch! Akshay kumar is sure to add more fans to his kitty with d way he has acted! Sid,jackie and the other fighters ,,everything is just amazing! However, there is melodrama ,,but it suits the texture and theme of the movie. The music of d film is mesmerizing. At a point of time,u might shed tears because of the strings of emotion flowing. And at the end u will come up with saying \"yes this is outstanding! Don't miss this,,I personally recommend."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "Having a miserable first hour, the remake somehow manages to deliver post intermission due to the brothers, their fights and the father well enacted by Jackie Shroff.",
        "review_detailed_main": "Another official remake from Karan Johar's production house with the remake specialist director Karan Malhotra, BROTHERS tries hard to create the same impact generated by English action film WARRIOR (2011). But in the process goes on adding many unwanted, forced elements in its first half diluting the end-result that could have been much better with a more focused vision and quality writing.\n\nUnexpectedly beginning on a slower note, BROTHERS is a big disappointment before the intermission since the director considers his audience still stuck in somewhere around 80-90s who would need a long family detailing with the same old concepts of the other woman, a drunkard husband, a soutela bhai (step-brother) and a deadly accident before moving on to the basic theme. In fact the first half of BROTHERS (partially reminding you of Manmohan Desai-Amitabh's NASEEB) is full of all forced progressions where apart from the family trouble we also have the usual songs, romance and an item number too displaying the sick mentality of the makers quite clearly. Plus one can also easily notice the imbalanced life- description of both the brothers, where the elder one gets a better mileage (being the bigger star) and the younger one is made to play a much weaker character as compared to the original script and treatment of the English film.\n\nBut here, specifically coming back to the inclusion of an item number I would like to raise a socially relevant question to the makers with reference to the fan following of these famous fighters of the sport in India. \"Every socially aware person in the country (as well as abroad) having kid boys in the family very well knows that these fighters of WWF, WWE, RAW and their best selling digital games are actually more famous among the boys in the age group of 8-15.\n\nNow even after knowing the fact, what kind of ailing mentality forced them to add a typical item song featuring Kareena Kapoor doing all those vulgar body movements and striptease in the film remains out of my understanding. Not sure whether this was an idea of Karan Johar or Karan Malhotra. But it was indeed an outcome of a highly confused mindset or from the one who simply wishes to focus on the box office returns or personal relationships but not the target viewers.\"\n\nMoreover the poor first half also makes you think about the substandard writing repeatedly. For instance I would love to know where in Mumbai are these fighter hubs actually (always had this question while watching NASEEB too) and what kind of school hires a teacher with big tattoos all over his body clearly visible to the students. In addition I personally have never been comfortable watching characters talking with their father or mother in 'Tu, Tera, Tuney' lingo disrespectfully.\n\nAnyway if you simply ignore or forget the inferior story progression of BROTHERS in its first half then it isn't that bad remake in its concluding part, as post intermission it strictly follows the path shown by its original and adds some good Indian insertions that work perfectly (like hitting the father in front of the son & a peppy number running in the backdrop during the wins). So where its initial part fails to make any kind of emotional connect with the viewers, the final hour somehow finds a decent grip mainly due to the impressive training sequences and individual fights of both the brothers in their various rounds providing the much awaited excitement, thrill and action to the restless audience.\n\nThe film has an average soundtrack (surprisingly coming from KJO's production house) which was not at all required in the first place. But still it has one fine love song and a catchy anthem, not properly used in the fight sequences. However the impressive cinematography and action together try hard to provide the much needed lift to the film in its final hour. But again here too a highly uneven and ineffective background score keeps pulling it back just at the right moments, when an intelligently chosen piece or an exciting baseline was actually needed the most. Besides, the editing could easily have made the film shorter by 10-12 minutes, avoiding the prolonged sequences in the first half and the repetitive ones in the second.\n\nIn the cast ensemble, it's actually Jackie Shroff who scores the maximum even before Akshay and Sidharth. Especially watch out for him in the finale and in the scene when he gets the sight of his grand-daughter for the first time. Akshay Kumar as the elder brother does complete justice to his role of a son, husband, father, teacher and a tough fighter together. He displays a fine balance playing the various dimensions of his character excelling in the fight & training sequences in particular. Sidharth Malhotra on the other hand, holds himself strong in front of Akshay and Shroff and delivers a matured, praiseworthy performance despite having the weakest role in terms of writing. And adding a bit of nostalgia, the two brothers standing in front of each other in the boxing stance reminded me of JOHNY MERA NAAM's climax with Dev Anand and Pran playing the brothers.\n\nIn the supporting cast, Jacqueline Fernandez is decent as the simple wife and Shefali Shah once again shines in her small role. Ashutosh Rana, Kiran Kumar and Raj Zutshi are just fine, whereas Kareena Kapoor seems to be of no use opting for such kind of item numbers as a low-grade dancer doing a striptease.\n\nIn all, you can easily give it a skip if you are not a big fan of action or ring fights. But the viewers interested in this particular sport form and free style action would mostly enjoy the second half of the movie as a one-time watch alone and nothing else."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "retipser",
        "review_rating": "4",
        "review_title": "If you copy something be honest to admit-credit the original-and lastly plagiarizing a story/movie is fine ,but going beyond that and stealing the originality is preposterous",
        "review_detailed_main": "Movie seems to be good considering the amount of bad movies bollywood dishes out every year,with a great measurement system called box office 100crore. Even the worst of movies (the big khans etc...) get to make 100 crores and they all leave a looootsss to be desired. Unbelievable but ture.\n\nComing back to the \"brothers\" ,if this is how the directors and producers try to win accolades by sheer copying of plot and weakening the script,at least have the decency to credit the original plot. That way,it is easier to see and compare why the movie is good or bad..only from Bollywood point of view.\n\nPlease,don't plagiarize and beat your chest around saying it's a great movie. It's hypocrisy in the name of art."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "premthebhai",
        "review_rating": "10",
        "review_title": "Karan Malhotra's direction is wonderful. He has integrated the action and emotional scenes very beautifully and his use of intercuts is simply remarkable.",
        "review_detailed_main": "Akshay Kumar portrays the angst of an estranged son/brother very effectively. If he is very good in emotional and dramatic scenes, he is simply splendid in the action sequences. He looks every inch the character he plays. Sidharth Malhotra is also very good in a subdued role. He lets his eyes and body do the talking in several scenes – and to good effect. He is excellent in the MMA fights. Jacqueline Fernandez springs a surprise in a non-glamorous role and plays Jenny rather well. Jackie Shroff is absolutely outstanding in a tailor-made role. He is terrific in emotional scenes and may well bag nominations, if not awards, for best supporting actor. Shefali Shah is fantastic as Maria Fernandes. She shows that she is one of the best, in the scene in which she first meets little Monty. Baby Naisha Khanna is cute and endearing. Ashutosh Rana is a delight to watch. The scene in which he abuses David's opponent is superb. Kiran Kumar is good in the role of Peter Braganza. Raj Zutshi and Kavi Shastri are just too lovely as the two commentators. Kulbhushan Kharbanda deserves distinction marks for his wonderful acting in the scenes showing his nervousness while watching the R2F tournament on television.\n\nAjay-Atul's background music is extraordinary. Hemant Chaturvedi's camera-work is remarkable. Justin Yu and Eric Brown's action sequences are of the kind never before seen on the Hindi screen. The fights are literally breathtaking. Sur­esh Selvarajan's production designing shows an eye for detail. Akiv Ali's editing is excellent."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "sunny-jindl2",
        "review_rating": "6",
        "review_title": "Decent action sequence with a vague and sometimes unintentionally funny story",
        "review_detailed_main": "For me Jacqueline Fernandes is the hero of the movie. She makes an impression with very little scree time. The romance and family emotions build between lead man, her and the child are very touching. Akshay Kumar looks old and tired as a fighter. Even his shoulders have drooped and he is no longer the Khiladi we know him to be. It just seems unreal. Siddhartha Malhotra on the other hand looks very promising in the action. The first half is super slow. It seems like you are watching a 1980s DVD is slow motion. The action picks up in second half, but the final scenes are the biggest undoing of the movie. Those who will watch the climax will know why I feel its unintentionally funny. One time watch as this is a sports movie after a long time."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "binthaider-755-822849",
        "review_rating": "5",
        "review_title": "! and then right at the flipping end David tells Monty to stop?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "srivastava-ritesh55",
        "review_rating": "10",
        "review_title": "worth watching...",
        "review_detailed_main": "Brothers is mixture of all love, emotion, care, respect and most importantly lots of action in fight. Story is as like 80's-90's movie type but karan malhotra directed it well as like Agneepath. Akshay looks like a mature man. Jackie is seriously have different look what he never did in his life. and yes sid, he performed very well. Jackline (no cmnt), and the cute little girl seriously spread all her cuteness in these hours. A worth to watch. Don't search reviews of movie here or there. just watch it by yourself and decide by urself. As lots of people loved happy new year and ra.one and kick, ek tha tiger, and ready also... bt the truth is known by al... So just go and watch it. u'll love it."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "A Melodramatic Mess!",
        "review_detailed_main": "A remake of the 2011 Hollywood film Warrior, 'Brothers', despite some powerful moments, is A Melodramatic Mess! Its an emotionally manipulated ride, that only works in limited doses. While it borrow's Warrior's premise, it somehow, fails to borrow its soul!\n\n'Brothers' Synopsis: Two estranged brothers, with a haunting childhood, face each other on a MMA battleground, with their Father by their side.\n\n'Brothers' has a nice first-hour, where the emotional heft of its characters leaves an impression. You can feel the inner anger & frustration among its protagonists & even some of the sequences, particularly the flashback, are handled well.\n\nBut, the second-hour disappoints. The story shifts to an MMA battleground & all you see is a fight after fight. The monotony sets in & the even the culmination, where the Brothers clash against each other, is a bit too melodramatic. The drama & the narrative just don't work in this hour. In short, the first-hour keeps you going, but the second-hour leaves you disheartened.\n\nSiddharth-Garima's Adapted Screenplay is strictly average. Seriously, why is this story so high on melodrama? Even Warrior had strong emotions, but it wasn't melodramatic. The Writing needed to be better & more like the original! Karan Malhotra's Direction is alright. Cinematography & Editing are good. The MMA Fight-Sequences have been choreographed superbly. Ajay-Atul's Score is pretty decent.\n\nPerformance-Wise: Akshay Kumar is in form. The actor delivers a restrained, mature performance, that only works on his advantage. Sidharth Malhotra adapts the physicality of the part, but gives no depth to the character. Jackie Shroff is reduced into crying almost throughout the film. Jacqueline Fernandez is wasted. Shefali Shah is excellent in a cameo. Ashutosh Rana is a joy to watch, as always. Kiran Kumar is adequate. Kareena Kapoor Khan sizzles in an item number.\n\nOn the whole, 'Brothers' isn't without its moments, but it could've been so much more."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "nibonburman",
        "review_rating": "10",
        "review_title": "Excellent Movie of 2015",
        "review_detailed_main": "Best performance by each and every character in the film. Great story Great direction Great acting Great cinematography Great editing a complete family entertainer movie. A complete package of lots of emotions, action, drama and sports. Watch this movie in theaters near you and you will be amazed to see a brilliant Bollywood movie in so many years. The movie teaches real meaning of life related to common mans family. Watch this movie and you will like it at any cost... Enjoy Guys...\n\nDIRECTION = 5 STARS\n\nMOVIE = 5 STARS\n\nSOUND = 5 STARS\n\nMUSIC = 5 STARS\n\nSTORY = 5 STARS\n\nACTING = 5 STARS\n\nEDITING = 5 STARS\n\nBROTHERS U ROCK..."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "ahwaan_padhee",
        "review_rating": "5",
        "review_title": "BROTHERS Review",
        "review_detailed_main": "Official remake of the 2011 Hollywood drama, WARRIOR , BROTHERS which is helmed by Dharma Productions is the story of two estranged half-siblings who vent out their hatred for each other in the fight arena. David(Akshay Kumar) and Monty(Siddharth Malhotra)come face to face in the ultimate fight in a one-of-its-kind championship.\n\nA businessman, Peter Braganza ( Kiran Kumar, brimming with sartorial elegance)sees tremendous avenue in legalizing street-fighting and proposes to bring the Mixed Martial Art to India, in the form of an IPL-Style competition, R2F(Right to Fight).While the elder brother ,David, who is suspended from his teacher-ship job sees this as an opportunity to earn quick bucks for his ailing daughter, the younger one, Monty, seeks this as a medium to combat his inner demons and boost up his self-esteem. Both the brothers have street-fighting running in their blood, and a sea of pent-up anger and resentment owing to an incident which had turned them against one another. While the prison-returned father, Gary(Jackkie Shroff) who was once a martial- art trainer , stays with Monty, his attempts of reconciliation with the embittered David turn futile.\n\nWeighed down by a clichéd screenplay and an old-school treatment which shadow the excruciatingly slow first-half, Brothers is somewhat salvaged by the skillfully staged ring fights which build the momentum in the second half. The sets are flashy , the duels are gruesome, detailed and boast of international standards. While staying faithful to the original template, Karan Malhotra makes some manipulations to amp up the emotional content which appear heavily superficial and gives us an 80's feel. That's where Brothers go wrong; He misses out in emulating the tumultuous relationships in the dysfunctional family and thereby we don't invest much in their emotional conflicts. Neither do the cheesy running commentary during the fights(Raj Zutshi hams it up) entice us nor the monstrous opponents qualify for an intimidating impact. They however evoke deja vu with names like Luka( Remember Apne?),Gamma and Hammer. Adding on to the exasperation, is the regressive item number by Kareena Kapoor Khan which by no standards match up to Chikni Chameli.\n\nSincere and genuine performances by Akshay Kumar and Siddharth Malhotra who also look convincing with their beefed-up musculature, adds to film's strengths. Karan also employs the montages of the training and physical regimes to its benefits. Akshay is terrific in his understated self, who beats his opponents in calculative precision. He makes David's grief and anxiety for his suffering daughter palpable.On the other hand, Siddharth is impulsive and spews a volcanic rage in each of the sequences, thereby giving a sharp and vulnerable edge to Monty's character. When one brother punches the other in a fracas, the pain is actually inflicted on the father. This sentiment surfaces naturally with the competent portrayal of Gary by Jackkie Shroff. Initially as the alcoholic husband and then as the repenting father, he is first-rate. But in some of the scenes, he goes over-the-top with the paroxysms of hallucinations of his dead wife.\n\nBlame it on the subject or the script, the female brigade doesn't get much scope here. But Shefali Shah does forge a strong impression in a cameo with her expressive eyes. Jaqueline is sullen most of the time in a de-glam avatar which doesn't go quite well with her persona, except for that scene where she jumps in a fit of excitement on getting the SMS. The supporting ensemble sees the likes of Kulbhushan Kharbanda, Kiran Kumar and Asutosh Rana and it's sad that none of their potentials are exploited fully.\n\nThere is a certain drawback associated with every Desi sports drama flick when the predictability factor looms large, and it's a triumph for the makers when the audience doesn't want either opponent to lose in the fight. This is one aspect, albeit borrowed, which Karan Malhotra nails completely. Brothers, with all its share of punches and kicks, is a good watch for the action lovers."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "jetkot",
        "review_rating": "8",
        "review_title": "Fantastic performances and Brilliant Direction",
        "review_detailed_main": "I do not understand what the critics want Bollywood to do. If they make Entertaining Romantic comedies ; they rate them low. They write that Bollywood does not grow from Song and Dance sequences.\n\nBrothers is surprisingly a very good effort by Karan Malhotra The casting of actors is impeccable. The boys cast as Akshay Kumars and Siddharth Malhotra's childhood really look like them.\n\nJackie Shroff gives a breath-taking performance and you are left to think that such great actors are left with no work because the audience and critics do not appreciate a good performance. Akshay Kumar steals your heart. He has grown tremendously as an actor. Siddharth Malhotra is decent and he can improve Overall a great film"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "annisasafanta",
        "review_rating": "5",
        "review_title": "15 minutes core idea, tough-less ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "omer-41757",
        "review_rating": "10",
        "review_title": "Best movie ever!",
        "review_detailed_main": "This movie was an amazing remake that had been produced with a better story line. In my option this movie is worth watching. It I quite mixed with some violence and some sentimental scenes. If you haven't watched this movie then watch it ASAP! This movie is about two brothers who had a chaotic past due to their father being a negative and drunk man. David was a teacher who was in need of some money, so he decided to join mixed martial arts and compete in the R2F. Monty was a character who just wanted to seek revenge because his brother had ignored him for years because he thought he was the reason of his mothers death. So monty also decided to compete in the R2F so hecould get money. But when monnty was in a meeting where one of the toughest kickboxers were going to compete, he had realised that he was also going to compete with his brother David. This made him even more furious as he found his way to seek revenge ."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "rathodsumit-39251",
        "review_rating": "1",
        "review_title": "Third class remake as always",
        "review_detailed_main": "If you are thinking to watch this movie simply watch original movie warriors.Akshay ruined another masterpiece movie by his spoilt remake."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "rajabmalik",
        "review_rating": "8",
        "review_title": "Brothers",
        "review_detailed_main": "Karan Malhotra , the director of new Agneepath had impressed me with his intense and focus in direction in his first film. It was to the point and he has a knack of extracting great performances from his cast. But there is a self-indulgence in him which he is unable to control in some of the films important junctures. He had plenty of them in Agneepath climax and it is there in plenty all throughout brothers especially in first half. I don't have a problem with slow pace . It helps invest ourselves into the characters. I loved pace of Drishyam , gone girl, Shawshank redemption and so on. But I am not a fan of overstretched scenes which is the case in a lot of scenes of brothers. Jackie Shroff is a drunkard who has doting wife/son and a step son. we get it in the first instance."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "milansingh",
        "review_rating": "1",
        "review_title": "These DIRECTORs, PRODUCERs Must have shame",
        "review_detailed_main": "Entire movie is copied from \"Warriors\" movie. These DIRECTORs, PRODUCERs Must have shame. If you are copping so much at least put the name on credit... No, they like to deceive Indian people, make money and don't care what the world will say of India...\n\nGuys just stop giving credit for these types of full copy movie in Bollywood. These people shows that they don't care about creativeness only lazy and care about coping, deceiving and making money.. For these people we Indian and the name of Bollywood goes down..\n\nI hated the movie from start to end. If you have also watched \"Warriors\" you will see how much the entire thing is copied. Just the difference you will actually find is TOO MUCH DRAMA ."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "faizanahmer-ahmer",
        "review_rating": "10",
        "review_title": "Excellent!",
        "review_detailed_main": "A Must watch Movie Specially for all Fighter lovers. Very Hard Work done By Akshay Kumar, Siddharth Malhotra and team to make this movie. in one movie there is Family Emotion, which is back bone of the movie, there is fight, there is Love for Child, Love for Wife, love for mother... Really the Must Watch movie... It's Also an inspiring and Motivating Movie! it contains beautiful Songs. A emotional song 'Gaye Jaa', A motivational Song 'Brothers Anthem', a Love Song 'Sapna Jahan' and one more Song by Kareena Kapoor Khan 'Mera Naam Mary'. Really the audience was impressed by the movie and in every fight there was huge clap and whistles. The Climax was Tearjerker! Really impressed!!!!!!!!!!"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "itsashutosh-45549",
        "review_rating": "1",
        "review_title": "Another Hollywood copy",
        "review_detailed_main": "This is movie is just a lame copy of Tom Hardy's Warrior 2011. Director karan Malhotra just copied same as in the warriors.."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "kdedhia7",
        "review_rating": "9",
        "review_title": "Bloody Brilliant",
        "review_detailed_main": "The first half is emotional and contains flashback because it has a story. People should keep patience. Director takes his time and tells the story in the first half but now in the second half its complete action. Those fights are so realistic it will give you goosebumps. The stadium ,the commentators, the crowd it looks like a real battle is on. Great stuff man. Akshay Kumar is Excellent. His acting, his body, his emotions. Just amazing. Siddharth what a transformation. That angry young man look is killer bro. Your body , your look your acting is Outstanding. Jackie is brilliant as always. Jacqueline looks beautiful as always. Kareena is a cherry on the cake. Background music is orgasmic. Its a complete roller coaster ride. Director takes his time in the first half and blasts the second half. Don't give a damn about the critics who have disliked this movie because they are just comparing it with Warrior which should not have happened. Its a Bollywood movie and you have to keep that in mind. Film could have been shortened but never the less people are loving it. That matters. Go watch and enjoy this bloody battle."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "samiem41",
        "review_rating": "1",
        "review_title": "Disgusting movie ever made in bollywood",
        "review_detailed_main": "I would have loved to give negative rating. I don't understand which kind of people have voted good for this movie. This is a nightmare movie which can only give you headache.\n\nOnly show this movie to your enemies. This is the first review of mine, found a option to include spoiler..\n\nLet me tell, there is nothing called spoiler in this movie. The entire movie was a spoiler. Disgusting is the word which I would say.\n\nWaste story, waste acting. Someone said that second half is good, hence i waited like a fool for good part.\n\nEven if you subtract 2:25 mins from this movie. That 5 min is still intolerable. Nothing just nothing at all is good.\n\nIts one epic from bollywood like \"Jhoom barabar jhoom, AAG \" People should use this movie against criminals to torture them, nuffin more than that."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "dash-ajit1",
        "review_rating": "10",
        "review_title": "actually better than warrior",
        "review_detailed_main": "brothers give you very clear idea about the family dispute which warrior failed ..as per the name warrior gave priority to fights and brothers more about their relationship.the comparison is over.Now talk about the movie.It is a dark movie and all characters are very dark but still director succeed to show their love and innocence.This movie is made to be the most emotional action movie ever and it is true.It show its respect to original movie and take every thing to a level up at the same time. Akshay kumar is great when it comes to emotion but when comes fight he is more than great .Sidhrat do the do the tom hardy and justify it.Jackie dada is the baap of all gave one of his career best performance. jaqiline also carry his part well.Ashutos rana and shefali shah are the plus points.First half is full of emotion second half is some kick ass action (1hour).The standards of action are international . This movie set a new standard in Indian cinema A MUST WATCH FOR SURE. Do not complain about its drama."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "superindrajit",
        "review_rating": "5",
        "review_title": "An average remake of Warrior",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "jin-khatima",
        "review_rating": "8",
        "review_title": "A worthy re-make of Tom Hardy's 2011 movie 'Warrior'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "iampavan-92166",
        "review_rating": "5",
        "review_title": "Good movie",
        "review_detailed_main": "Brothers is a sports drama directed by Karan Malhotra, it is based on martial art. when trailer came peoples was too much curious about it when movie come it's match 50% thinking of peoples.\n\nAkshay kumar is a martial art player in this movie and showing ultimate body, did a very good job also.\n\nSidharth Malhotra also a martial art player and younger brother of akshay kumar also,\n\nJackie shroff acting as a father of these guys and shroff also done a very good job.\n\nIf I tell about overall the movie, two brothers fight each other without know they are real brother.\n\nI want to see this movie hit on the screens."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "mumbhaaai",
        "review_rating": "9",
        "review_title": "Relationships - In General",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "tahaali54-871-373900",
        "review_rating": "2",
        "review_title": "Not a fighting movie.",
        "review_detailed_main": "Featuring a star-studded cast and boasting a generous budget, this Star Plus drama falls short of expectations. Despite its grand scale, the film lacks genuine action, leaving viewers feeling disconnected from the narrative. Attention to detail is conspicuously absent, with emotional dialogues and bombastic music inserted haphazardly, eliciting more cringes than engagement. I was mislead by the rating and my likeness towards the fighting movie genre into watching this movie. While Bollywood's action flicks can often entertain, this one proved to be a letdown. Akshay Kumar, whom I've admired more for his athleticism, seems woefully underutilised in this film, making for a painful viewing experience."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "mans-90711",
        "review_rating": "10",
        "review_title": "Brothers",
        "review_detailed_main": "Absolutely loved this movie! My favourite movie of Sidharth Malhotra and would watch it again and again if I had to. The fight scenes were epic and storyline culminated happily. The bad thing was that it was maybe little too emotional for a MMA movie but its still cool. Akshay was a badass in this film and Jackie killed it as well. Jaqueline & Kareena fulfilled there roles into the lives of these brothers and all-in-all, I enjoyed this film a lot."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "MsClashKingYT",
        "review_rating": "5",
        "review_title": "Just Like The Rest",
        "review_detailed_main": "The First One Hour Promises us the viewer more then the regular bollywood action film but right after the half hour mark Brothers Turns into any other bollywood FLICK. C+"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "avi-jh80",
        "review_rating": "10",
        "review_title": "This should become true",
        "review_detailed_main": "A brother fighting with another brothers... shows that every relationship in life important.. equally important !!\n\nRegarding fight becoming legal... it has to be legal.. at least.. ilegal fight will be reduced.\n\nMy dream is that even women should get the same type of opportunities in the country. This is My thought.!!\n\nGood movies now a days hav hard time to earn money.. publicity.. bia is seen in watchers as well may be that is the reason This GooD movie did not make much money...Further there are narrow thinking which contributes more. Good movies should be sent outside the countries for non-biased watchers."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "babnos",
        "review_rating": "1",
        "review_title": "A cheap adaption of great movie \"The Warrior\"",
        "review_detailed_main": "Everyone knows that Bollywood writers can't write,their film makers can't think. Their every movie is composed of copied elements,mostly they like to adapt foreign films. This is the whole story of Bollywood. This time,they adapted 'The Warrior\" in traditional way. \"Brothers\", the Bollywood remake,even don't equals the dust of \"Warrior.\n\n\"Brothers\" is a highly slow paced drama film with uninspiring,colourless scenes.Though the acting performance by lead actors was amazing,but overall this film is totally worthless. The length of this film is ridiculous,its not easy to watch 3 Hour film which cannot keep you engaged.\n\nIf you will encourage movies like this one,than you will face even worse experiments from Bollywood in Future.\n\n0.05/10"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "thebesthk",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "I was crying during the whole movie...especially at last scene"
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "tareeq_masood",
        "review_rating": "5",
        "review_title": "One of the best Action movies turned into a cry baby drama!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "maulin5",
        "review_rating": "9",
        "review_title": "Power-packed movie with emotional drawback!",
        "review_detailed_main": "Some movies, especially the remakes, are made for those who didn't watch the original. So, those who already watched Warriors, may not like this one, but, the people like me, who haven't watched the original, will surely love this. Brothers, directed by Karan Malhotra, who directed Agneepath, and got a huge success and fame. I think this is better than that one. This one has repeat value, too. Both the film works good, because the main factor is the story-telling is superb and the second major factor is Music by Ajay-Atul. Ajay and Atul have given a tremendous melodies as a background music composer in this film. The album has three songs. Sapna Jahan is my favorite, and Sonu Nigam's mesmerizing voice appears too good in theater. Merry song is a perfect item song with great melody. And Kareena dances really well. Brothers anthem is average, but, suitable to watch in between, as the practice session has been displayed during that song. Performance wise, Jackie Shroff is outstanding. He has acted better than all other. Akshay Kumar has acted well, too. His expressions during each and every fights are wow. Shefali Shah has a small and impact-full role. Sid looks different, but, he doesn't appeal to me. Though, his fights are sharp and funniest. Jacqueline Fernandez looks beautiful, and delivers what is required, suits in a role of a mother. Ashutosh Rana is good in the mentor's role. I like Karan's direction in both movies. Some people may felt that starting of the movie is slow, some felt that pre interval portion is slow, and only post interval fights are superb. But, they all are wrong. Actually, the film is basically dependent on the first half, the emotional part, which is the main drawback of Brothers, and that will clearly shines out in second part. Second part is watchable and adorable only because of the first half which builds a stronger base to the movie. Climax contains a lot emotion which only few can feel. I'm grateful to Karan, who brought two finest remakes to us. I'm eagerly waiting for his third venture. Till then, will watch his movies again and again. And I don't care about any other reviews, they may like it or not, but I liked Brothers a lot, so do my friends. If you haven't seen yet, just watch and decide."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "rajantwnabashu",
        "review_rating": "10",
        "review_title": "Brothers, is indeed a very good movie.",
        "review_detailed_main": "I totally liked this movie. Loved it . Brothers, is indeed a very good movie."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "ancybenny",
        "review_rating": "10",
        "review_title": "This isn't a Melodramatic Mess!",
        "review_detailed_main": "First of all,let's not compare Brothers with Warrior!This film may not have done a good job on remaking Warrior but its a sure treat for those who haven't watched it.It contains emotion along with action.A few disappointing points may be that its boring in the first half,and the second half has nothing but action.But that doesn't have to be a big thing!.People have to go along with the story.Though the movie is very bloody,and keeps making sounds of bones breaking which is really exaggerated,it's still worth a watch.Jackie Shroff has played his role extremely well and so did Akshay.Sidharth din't have much of a performance to do in this film,he's like a silent guy who doesn't talk much.But he did well too! Jacqueline killed it! Some people have found this movie disappointing,but I have found it a fine remake.Well,I guess its out of theater's,so I suggest those who haven't watched it yet.Stop reading the negative comments and go for it!(I meant to download it :> Once its out In clear print,if you care about the graphics.Warning:This movie is fit only for a one-time watch.Watching it twice wont be enjoyed."
    },
    {
        "movie_id": "tt3802576",
        "movie_name": "Brothers",
        "movie_rating": "6.4",
        "review_username": "Raja79",
        "review_rating": "8",
        "review_title": "Mera Naam Mary!",
        "review_detailed_main": "This movie was overall a very good movie with very unique and interesting songs. The most unique song that stood out to me was \"Mera Naam Mary Hai, Mary Sau Takka Teri Hai\", as I had never seen such an intense song by Kareena before.\n\nKareena is the only actress who can make sweet and wholesome songs like \"Ye Ishq Hai\" in Jab We Met but also create such songs such as Mera Naam Mary in this movie, Brothers.\n\nThis movie revolves around Boxing and has the theme of Boxing, and it was released in 2015. Overall, its a fairly interesting movie with a good pacing, well-written character and good storyline."
    }
]