[
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "claudio_carvalho",
        "review_rating": "6",
        "review_title": "It Works on a Rainy Saturday Afternoon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Allmanjoy15",
        "review_rating": "6",
        "review_title": "\"Legends of the Hidden Temple\" with intelligent gorillas and science",
        "review_detailed_main": "OK, this movie is best watched on a rainy day or when you're pretty bored. The fake looking gorillas were obviously not very well-made, whereas the 1993 film Jurassic Park had familiarized audiences with CG dinosaurs. In fact, CGI was originally planned for the grays, but the technology had not yet been developed to the point where realistic hair could be created. While smooth skinned dinosaurs were possible, hairy apes would have looked inappropriately cartooned. Therefore, animatronics, masks and puppetry had to be utilized. So that was kind of a damper on the special effects as well as Tim Curry's bad acting. The movie could have been a lot better, but it was viewable. If you got over the gorilla puppets and Tim Curry's accent, you have a pretty decent movie. I thought the story was good. It's not Jurassic Park, but it's Michael Crichton. Congo wasn't very realistic, but neither was Jurassic Park. It was like that show \"Legends of the Hidden Temple\" with intelligent gorillas and science. There was action and a plot. So I could sit and watch it. I'll give it (barely) 6 stars."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "FlashCallahan",
        "review_rating": "6",
        "review_title": "Stop eating my sesame cake....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Herbest8",
        "review_rating": "5",
        "review_title": "Think Indiana Jones crossed with Jurrasic Park and add a dash of Star Wars",
        "review_detailed_main": "What can you say about a movie like \"Congo\"? Well, it's silly and underdeveloped with some pretty shabby special effects but god help me, I like it.\n\nThe plot is somewhat episodic as multiple different characters with wildly different motives converge on the Congo. One is a communications technician (played nicely by Lauara Linney) who is looking for her fiancé. Another is a Romanain nut case (played by the fabulous Tim Curry) who is looking for a mythical, lost diamond mine. And the last is a gorilla expert returning a talking gorilla back to her natural habitat. I swear, I'm NOT making this up.\n\nThe cast as a whole is OK. Linney is appealing, Curry turns in a usual fine job, and cameos from Bruce Campbell and Joe Don Baker add to the quirky atmosphere. Special mention should go to Ernie Hudson, who's roguish charm while not as polished as Harrison Ford's, makes a great Clark Gable/Indiana Jones type-explorer.\n\nThe special effects are kind of a mixed bag. The gorillas are obviously stunt-men but the hokeyness is kind of fun. The climax in the temple is also silly but still rousing. Topping all this off, the quirky Jerry Goldsmith score adds considerably to the film as a whole.\n\nAlthough certainly not a classic or even 100% good, \"Congo\" is a cheesy, yet entertaining jungle adventure movie and is worth seeing."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "PhilipJames1980",
        "review_rating": "7",
        "review_title": "Memorably quirky and juvenile; unique and underappreciated",
        "review_detailed_main": "Congo is the first movie on the IMDB for which I am writing a user comment. I am giving it this distinction because, although it is not the best movie I have ever seen, nor my all-time favorite movie, it is one of my personal favorites nonetheless. If I could choose only ten movies to own, or even just five, Congo would be one of them.\n\nBecause so many people dislike Congo, or are at least indifferent to it, I feel compelled to explain why I like it. I like Congo because it's different: in the seven years since I first saw it in June of 1995, I've seen countless other movies, but Congo still retains its uniqueness, I believe. Other movies have tried to duplicate Congo's juvenile sense of adventure and tongue-in-cheek humor (most notably the two Mummy movies), but none of them have surpassed Congo as one of the most gleefully preposterous and deliriously fun yarns I've ever seen.\n\nSo many people have criticized Congo in so many ways that I'm not sure which complaint I should address first. The consensus among most comments seems to be that the character of Amy, the \"talking\" gorilla, pretty much ruins the movie because she is annoying and unconvincing. Although I cannot deny that \"Amy\" is, indeed, a woman in a gorilla costume which is not quite convincing, I should also say (1) that when I first saw Congo, I thought Amy was pretty convincing, and at least acceptable; and (2) convincing gorillas in movies are rare, in my opinion. Rick Baker's work in Gorillas in the Mist and the Mighty Joe Young remake is the best I've seen; and although Amy (created by Stan Winston's team, not Baker's) is inferior to Baker's best work, she's better than some of Baker's apes in Burton's terrible Planet of the Apes remake. If I must choose between Amy, and Tim Roth in an obvious chimpanzee costume, I choose Amy.\n\nAnother common complaint is that the movie Congo is inferior to Michael Crichton's novel, upon which it was based. I read the novel in early 1995, just prior to seeing the movie, and so the book was still fresh in my mind when I saw the movie: and I thought the movie did an excellent job of conveying the essence of the book, and gave the story an offbeat style which sets the movie apart from the book. The movie also has a healthy sense of humor about itself, which Crichton's novel lacks and sorely needs.\n\nI almost forgot the actors! Some people hate Congo simply because it lacks a Mel Gibson or Bruce Willis; nevertheless it does boast a talented and interesting cast of mostly underrated actors. Laura Linney has given good, strong performances in many movies, but I argue that her performance in Congo is still her most entertaining. Dylan Walsh gives an earnest, appealing performance as the earnest, appealing Peter Elliot, whose devotion to Amy (however laughable it is for many viewers) gives the movie some heart. Ernie Hudson gives a clever, unforgettable performance as Munro Kelly; although black, he possesses the mannered speech and condescending attitude of an authentic \"great white hunter,\" one of the movie's best gags. Grant Heslov has little to do, but some of his delivery is terrific (\"Safari? I don't even like picnics!\") Tim Curry is a sheer delight in this movie, giving a campy performance as the monomaniacal Herkermer Homolka, a \"Roumanian philanthropist\" obviously written into the movie (the character does not exist in the novel) to correspond with Wayne Knight's character Dennis Nedry in Jurassic Park. Some people are offended by Curry's performance, and believe it's offensive to Roumanians as well. Here's a tip: anyone offended by anything in Congo takes life (not to mention this movie) way too seriously, and needs to lighten up.\n\nMany people hate Congo simply because it's cheesy. But considering the story (assorted oddballs journey to a site in the African jungle which may be the legendary mines of King Solomon), how could the movie not be cheesy? Did people really expect a movie called Congo to be realistic, believable and compelling? Surely such a movie would be even more cliched and misconceived than the one that was made. John Patrick Shanley's script may be crude and smug, but at least it's fun, and certainly a model of efficiency: Shanley trimmed the novel of subplots (such as a rival expedition, and attempts to decipher the gray gorillas' \"language\") which would have made the movie longer, slower and more pretentious. He added lots of pithy dialogue and made the whole affair an exercise in high camp. The result is a quintessential juvenile adventure that improves upon more bombastic and elaborate efforts like Armageddon. And Frank Marshall's straightforward, low-key direction nicely contrasts with the inherent absurdity of the storyline; a more intense and heavy-handed director would not have been a good choice to helm a movie like Congo.\n\nCongo isn't nearly the terrible movie that many people believe it is. It isn't a movie for everybody or even a movie for most people: but it was created with a certain audience in mind, and many people are simply too serious and high-minded to belong to that audience. Congo and movies like it are cartoons for adults: if you don't like movies with colorful visuals, ridiculous plots and juvenile characters, you should not watch Congo. But if you do like movies with those characteristics, then I submit that Congo is one of the best movies of that kind that I've ever seen."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "albechri",
        "review_rating": "",
        "review_title": "Something's Wrong",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bullions27",
        "review_rating": "4",
        "review_title": "An okay flick...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "canadasbest",
        "review_rating": "7",
        "review_title": "It's B to the core, but for some reason I love it",
        "review_detailed_main": "Don't get me wrong, this is not Oscar worthy in the least, nor does it stand as a particularly entertaining popcorn flick.\n\nI love this movie because of it's incredible cheesiness, from the talking gorilla to Tim Curry's greedy diamond chaser to the absurd diamond laser plot line. I've read Crichton's book and it's quite good, the movie however, misses a lot of the time.\n\nThat being said, I still love watching it, I can't explain it, I guess it's so bad that it's good for a laugh whenever I see it, and watching people devoured by psychopathic gorillas never gets old.\n\nIf you've got friends over, pop this one in and give it the MST3K treatment, you'll have a blast I'm sure.\n\nLike I said, no redeeming value to be had here but if you like watching bad movies just for the heck of it, this may be one to check out.\n\nP.S. Joe Pantoliano's cameo is golden."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "moonspinner55",
        "review_rating": "5",
        "review_title": "Rote, old-fashioned formula from curious modern talents...",
        "review_detailed_main": "Though it did manage to draw in audiences, \"Congo\" plays like an old John Agar flick from the 1950s, a manipulative, special effects-laden co-feature straight off the assembly line. Motley expedition team in Africa (which includes a \"talking\" gorilla) come upon murderous gray apes guarding a lost fortune in diamonds. Adaptation of Michael Crichton's bestseller (by John Patrick Shanley, of all people) has strong talents involved, yet no one can disguise the fact this is a hoary premise culled from the late-late show, full of stock characters, clichés and unsurprising action. However, Amy the Talking Gorilla is a sweet new ingredient, giving the stale plot some much-needed lift. ** from ****"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "JasonXIX",
        "review_rating": "7",
        "review_title": "Tim Curry gets it.",
        "review_detailed_main": "This movie is a great litmus test. It can be used to separate your friends and family into two categories: fun people vs elitist snobs. The type of people that hate this movie are the same ones that want to argue about mise-en-scene in Argento films and the iconography of Bergman.\n\nCongo is a throw back to the days of the drive-in movie. In those simpler times, movies about lost cities, diamonds and killer gorillas were considered fun. Sometimes, movies are just meant to be fun. Tim Curry gets it, why can't you?"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "BandSAboutMovies",
        "review_rating": "4",
        "review_title": "Oh 1995 and your movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "TheBryanWay",
        "review_rating": "8",
        "review_title": "This movie is not as bad as its rating suggests",
        "review_detailed_main": "Congo is rarely mentioned in any discussion about film. It seems like a forgotten artifact, abandoned like King Solomon's mines, discovered only by only those who maintain some fundamental interest; what you find is going to depend on how open you keep your mind. Rest assured, those of you who would rather ignore it aren't going to be missing a diamond, but I'd say an arrowhead isn't out of the question.\n\nI'll dispense with the metaphors: Congo is not a bad film. I watched it many times in my youth and just watched it again yesterday, and the biggest complaint I have is that the original song 'Sounds Of Africa' is awful. I won't summarize the plot or analyze the film in explicit detail, but I will say that it is briskly paced, sharply written, and features solid characterizations, or as solid as they can be in an adventure epic. As an example, Tim Curry has been dismissed too often as the comic relief when he is actually central to the plot and turns in a deliciously dense performance, above and beyond the limitations of his character. Considering the slightly campy tone, the special effects are well above what anyone could expect. Just don't come prepared to judge them based on modern standards or Jurassic Park. Personally, I find physical effects more endearing than CGI anyway.\n\nAs many reviewers have said, it's a film of a bygone era, a lost world story treated as an adventure epic. Clearly it's not Indiana Jones and the tone tends to waver a bit, but it's never boring, and if it had been adapted from the book directly, it would have been. I can't imagine someone watching the airplane SAM scene without being excited by the action, or watching the group's border crossing struggles without at least sporting a grin.\n\nSo, check your ego and check your critical faculties; this is no Citizen Kane and it doesn't pretend to be. Those that harshly criticize it, by my estimation, have a lot to learn about having a good time at the movies."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Dodge-Zombie",
        "review_rating": "7",
        "review_title": "Makes me smile.",
        "review_detailed_main": "I can't speak for anyone else but this movie makes me happy. I know the gorillas aren't real but in my head they are.\n\nIt has a great cast and even though the acting may be comedic the whole way through I personally think it works to make the movie better than it would be had they pushed for an overly serious tone.\n\nHighly recommended."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "fntstcplnt",
        "review_rating": "5",
        "review_title": "Congo (1995)",
        "review_detailed_main": "Directed by Frank Marshall. Starring Laura Linney, Dylan Walsh, Ernie Hudson, Tim Curry, Joe Don Baker, Grant Heslov, Joe Pantoliano, Adewale Akinnuoye-Agbaje, Delroy Lindo, Bruce Campbell. (PG-13)\n\nA team sent by a telecommunications company disappears in central Africa while searching for a rare blue diamond; Linney tags along on a primatologist's (Baker) expedition to return a gorilla to the wild so she can find out what happened to them. Laughable jungle adventure isn't even close to being a good movie, but it's not usually a boring one either; instead, it's a sneaky comedy that can be laughed at with the sort of relish that many other bald-faced laffers fail to inspire. Here we have a person in a gorilla suit wearing a \"glove\" that lets it speak when using sign language; also finds time to skydive, drink martinis and smoke cigars. If this doesn't spark interest, stay far away, but for all others, rest assured there's plenty more. A diamond-focused laser saws through killer apes; Curry trots out a ridiculous Romanian accent and goes nuts with it (he says \"lost city of Zinj\" about a half dozen times, always with tremendous brio, always hysterical); a poor sap literally gets scared to death looking at a gorilla; Linney uses a flare gun to blow up an incoming anti-air missile; and cold-hearted CEO Baker, when asked if he's human, gets to loudly retort, \"I'll be human later!\" The only one who gets to have fun while keeping his or her dignity is Hudson, who brings a droll, Ronald Colman-esque zest to his jungle guide role. A movie that's indefensible on any intellectual or artistic level, but why would anyone have expected otherwise? It's adapted from a Michael Crichton book, after all.\n\n53/100"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "LLAAA4837",
        "review_rating": "",
        "review_title": "This film is special to me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jack_thursby",
        "review_rating": "1",
        "review_title": "People in gorilla suits jumping up and down",
        "review_detailed_main": "Steven Spielberg took a preposterous Michael Crichton novel about resurrecting dinosaurs from DNA samples and gave us \"Jurrasic Park\", a thrilling, exciting adventure/thriller that still holds up today despite the advances in CGI effects since then. The producers of \"Congo\" did the exact opposite, they took an interesting adventure story and turned it into unwatchable dreck.\n\nIf watching people in shabby gorilla suits pretending to be gorillas and failing miserably, while bad actors chew abysmal dialog in a ludicrous plot is your thing, then this is the movie for you. Me? I'll take \"Jurassic Park\" over this crap any day of the week. Life is too short to waste on moronic drivel like \"Congo\".\n\nSome reviewers argue that \"Congo\" is a juvenile movie that's not to be taken seriously, and that it should be enjoyed as the preposterous silly movie that it is. They might have a point if \"Congo\" was actually watchable. To get to those moments of juvenile glee you have to sit through hours (well, its only minutes but it seems like hours) of dull, lifeless set-up... or you can just fast forward to the funny stuff. That does not a good movie make, that's just a few worthwhile moments of comedy in a bad movie.\n\nWatch this garbage at your own risk."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Leofwine_draca",
        "review_rating": "6",
        "review_title": "Likeable adaptation",
        "review_detailed_main": "I've never read the Crichton novel despite being a fan but this film adaptation is pretty fun. I know it's been criticised heavily but I enjoyed the background to the story and Crichton's exploration of cutting-edge science and research as always. The cast members are likeable, Ernie Hudson in particular, and the Bruce Campbell cameo is a nice touch."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "LoupGarouTFTs",
        "review_rating": "5",
        "review_title": "Who's Kafka?!",
        "review_detailed_main": "One of the best lines of the movie . . .\n\nI actually got a kick out of this movie. Heck yes, the effects and the gorilla suits were horrible even for the 1990s, but \"Congo\" was kind of fun to watch. I'm sure it was supposed to be more serious than the average viewer took it to be, but it had some good moments. Amy was awful from the word \"go,\" but the interaction between her and Ross on the plane was great.\n\nErnie Hudson was terrific all the way through the movie, although I think he lost his accent a bit at the end. Like so many, I would have loved to see more of Bruce Campbell and a little less of Dylan Walsh. Congo isn't a great movie, or even a good one, but it wasn't a bad way to spend an afternoon recovering from a 13-hour car trip and a long night waiting for a dog to deliver puppies. Five of ten, just because it made me laugh out loud a couple of times."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "TheLittleSongbird",
        "review_rating": "6",
        "review_title": "Fun but not a masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Psycho Mantis",
        "review_rating": "4",
        "review_title": "Classic B-movie",
        "review_detailed_main": "\"Congo\" takes place in (err) Congo, where we follow an expedition with a bunch of people with different motives into the jungle. Two of them wants to take a talking(!) gorilla back to the jungle where she was once born. A scientist is looking for a diamond that her company badly needs, and she´s also looking for her lost co-worker and ex-boyfriend, who disappeared in the jungles of Congo. With them are also a greedy Romanian (with a very peculiar accent) who wants diamonds for his own. To protect them from various dangers, they´ve hired a sleezy mercenary, who´s got a group of soldiers (who later are revealed to be pretty useless when it comes to fighting). In the jungle they encounter lots of dangers such as bad weather, a spooky indian tribe and a crazy hippo, before they finally face their worst opponent yet: murder gorillas!\n\n\"Congo\" has everything a classic B-movie should have; a silly plot, B-actors, unconvincing special effects, lots of logical gaps in the script and talking gorillas. The movie feels a bit like a roller-coaster at Universal Studios or something, however it´s not a very funny one.\n\nIt begins with an exciting scene in the jungle, but we only get a glimpse of what will come. But after this \"Congo\" soon becomes boring and stupid, with weapons made of diamonds and an irritating gorilla. And in the end everything just collapses and becomes a shoot-em-up flick. The movie has some beautiful sceneries of the African nature, but this doesn´t help the movie much.\n\nThe actors are okay, but Laura Linney and David Hasselhoff-look alike Dylan Walsh are far to pale in the leading roles. Instead, \"Congo\" belongs to the mercenary, played by Ernie Hudson, and the Romanian scoundrel, played by the delightful Tim Curry. These two have some funny moments, and almost makes this a comedy. Since you´ll be laughing out loud when you hear the stupid lines and see the crappy effects, you might actually believe that \"Congo\" is intended to be a comedy. I was also very surprised to see unbilled performances by the two great actors Joe Pantoliano and Delroy Lindo. I mean, what are THEY doing in this mess? Bruce \"Evil Dead\" Campbell has a very small role, but it´s funny to see him in a movie, since we get to see far to little of this great actor, I think.\n\nIt seems to me that those who has read the book \"Congo\" by Michael Crichton were very disappointed with the movie, and really hated it because the book was so much better. I haven´t read the book, so I can´t comment that, but I think that the movie is pretty harmless and if you don´t think too much about it, it´s not THAT bad.\n\n** out of *****"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "moviesleuth2",
        "review_rating": "7",
        "review_title": "A fun, scary adventure flick",
        "review_detailed_main": "\"Congo\" is a lot of fun as long as you don't take it seriously. Because they share the author of the books they are based on, it is perhaps inevitable that in any review of \"Congo\" the film \"Jurassic Park\" will come up sooner or later. Yes, \"Jurassic Park\" vastly surpasses \"Congo\" in quality, but seeing as how the former is debatedly THE best example of a summer action flick, making that statement doesn't necessarily mean that \"Congo\" isn't worth watching.\n\nIn fact, \"Congo\" is a breathtaking thriller, probably only marred by its budget which causes some of the effects to look rather cheap, and descend into the B-movie territory. That being said, director Frank Marshall still manages to not only create a film that not only succeeds as an action film, but at times the tension grows so high that it almost could be labeled as a horror flick (though I highly doubt that that was the intent).\n\nYet there is some justification in labeling \"Congo\" as a horror film (at least in part). There are definitely some moments, particularly in the latter half of the movie, that are actually quite frightening. While the killer gorillas don't necessarily \"look\" scary up close, the savagery in which they attack and brutally murder people is pretty scary. In addition, the gore level is pretty high, especially for a PG-13 rating. The efforts on the part of the filmmakers to avoid an R rating is at times obvious, such as in some of the more brutal gorilla attacks, the picture is fuzzy and in slow-motion (these changes are not successful, and hurt the movie). Even as it is, the levels of terror and gore are high enough to make one wonder whether the PG-13 rating is appropriate.\n\n\"Congo\" is not without its flaws. As I said before, the budget constraints make some of the effects look cheap, and at times lower the film to the B-level range. Also, the film takes a little too long to begin gaining momentum, which at times cause the film to drag (though the payoff in the latter half of the movie is well worth the wait). Finally, it is quite clear that Amy is a person in a gorilla suit (which given the complexity of the character was unavoidable). The killer gorillas don't suffer from the same fate, but they don't look particularly frightening (actually, they look rather sickly, however their actions quickly quash that notion).\n\nFrequently, acting is not a strong point for most action-adventure films, unless the characters are rather unique (as in \"Pirates of the Caribbean\"). However, \"Congo\" is an exception. It features not one, but two standout performances. Tim Curry is great as Herkermer Homolka, the jewel-obsessed \"Romanian philanthropist\" (you can almost see his eyes take the form of diamonds. It's a typical Tim Curry role, but he avoids overdoing it and becoming annoying (which I guess he is, but in a good way).\n\nBut perhaps the biggest surprise is Ernie Hudson as the sarcastic, and ever so slick Monroe Kelly. It's all in the delivery, and Hudson delivers his lines with enough wit and bite to make him easily the most appealing actor in the movie. Had this movie been more popular, it would be reasonable to suspect that Hudson could have been up for an Oscar, as most of the nominees of the said award win for inferior performances. Laura Linney and Dylan Walsh are adequate, but given the staple hero characters they are given, it is probably unfair to expect more than what they give. Grant Heslov plays the neurotic sidekick that he usually plays (see \"True Lies\"), and it is pretty welcoming.\n\nI don't understand why this flopped at the box-office. Perhaps because it had to live up to the reputation of \"Jurassic Park,\" which is more than can be expected of any film."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "HelloTexas11",
        "review_rating": "5",
        "review_title": "poor adaptation of Crichton book; fair entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "occult-69416",
        "review_rating": "9",
        "review_title": "Underrated 90s Gold",
        "review_detailed_main": "Congo is one of my childhood favorites so I decided to check it out to see if this lowly rated film was as good as I remembered it. I actually watched this in Kenya, with Kenyans. They could even understand the Mzungu tribe people in white. We all thought Congo was badass and entertaining. They don't make movies this cool anymore. A talking gorilla that leads a ragtag crew through the jungle in Congo to find a hidden city with diamonds? What's not to like? Get over yourself and appreciate Congo for what it is."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bowmanblue",
        "review_rating": "7",
        "review_title": "So unappreciated",
        "review_detailed_main": "I remember watching 'Congo' in the cinema back in 1995 and I loved it! It was only afterwards did I realise how much other people (and when I say 'other people' I generally mean the critics!) absolutely hated it. And, although I obviously don't agree, I can see why - from a certain point of view.\n\nIn 1993 'Jurassic Park' was epically adapted from a Michael Crichton novel and... well, the Box Office and impact on films and popular culture spoke for itself. Therefore, when 'Congo' was pitched from another Crichton novel, it was 'sold' to the masses as 'Jurassic Park with gorillas.' Yes, if you saw any of the trailers or marketing material around the time of its release, you'd get the impression the human stars were going to be going up against hordes of savage, mutated gorillas in the jungle. And, although that does happen, it can hardly be described as the 'main' portion of the film. In fact... would it be a 'spoiler' to say that the 'bad gorillas' only come into the story in the final act?\n\nWhat 'Congo' is about is a bit of a 'mish-mash.' You have a scientist (Dylan Walsh) who's trained a gorilla to use sign language and to 'speak' through the help of a virtual-reality glove, returning her to the film (in the 'Congo' - surprise!), teaming up with an ex CIA operative (Laura Linney) who's looking for her ex fiancé because he disappeared while searching for a new form of diamond for a telecommunications company. Throw in an eccentric Hungarian (Tim Curry) who's looking for a lost city in the jungle and a suave British local guide (Ernie Hudson) and you generally have a lot going on. Is it any wonder that the film-makers simple figured it would be easier just to sell it as 'Jurassic Park with gorillas?'\n\nHowever, despite having a lot to cover plot-wise, it's actually pretty good. It's not so much about 'man versus mutant gorilla,' rather the group versus everything you'd expect (and more!) to find in that area of the world. You have the local tribes, the harsh elements, corrupt military and hungry, hungry hippos (yes, seriously). First of all, it's an adventure film. The bad gorillas are simply one part of a much bigger film.\n\nIt's no dramatic masterpiece. In fact, Laura Linney and Dylan Walsh are two pretty uninspiring leads. The true outstanding performances come from Ernie Hudson and Tim Curry who - probably - should have been the two leads as their bantering and performances is what makes the film (in terms of human leads).\n\nThe other notable 'cast members' are the gorillas themselves. Although computer effects did wonders at bringing dinosaurs back a few years earlier, the technology still wasn't there to make furry gorillas look realistic, so animatronics and practical effects were used instead. These were masterminded by Stan Winston and, although they aren't perfect, they are as pretty close to holding up today as any film made in 1995.\n\nIf you're expecting a wall-to-wall action film where man must survive against great big, nasty gorillas who are picking them off one by one, then you won't find it here. If, however, you're looking for a good old fashioned action/adventure film that could be watched by all the family on a Saturday afternoon, then this will certainly kill a couple of hours."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ccthemovieman-1",
        "review_rating": "3",
        "review_title": "Lotsa Hype, But Little To Show For It",
        "review_detailed_main": "This was a highly-hyped movie prior to its release, but turned out to be a dud. I never talked to one person who ever liked this movie. I agree: I didn't like it, either. Perhaps one big reason it wasn't a box office success was that it had nothing but unappealing characters in the story.\n\nFor awhile there - I don't know if this is still true - I hadn't any movie in which Laura Linney or Dylan Walsh played anything BUT annoying characters.\n\nThat, and a stupid story, make this film a big disappointment, especially considering that big buildup. Did the filmmakers, with dialog this dumb, really think this was going to be a hit?"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "reggn",
        "review_rating": "",
        "review_title": "AWESOME!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "brigand13",
        "review_rating": "1",
        "review_title": "Atrocious!!!",
        "review_detailed_main": "This is one of the worst blasphemies of Michael Crichton's work to date. The book was a wonderful, intense piece with exceptional characterizations and a delightful story. Very high level and a delight to read.\n\nThe movie on the other hand was a complete waste of money. I'm still not convinced that the person who wrote the script actually took the time to read the book. The movie plays out as though he skimmed the dust jacket and then started writing.\n\nIt's only redeeming feature was the cameo by Bruce Campbell at the beginning of the film. After his character gets killed off, don't bother to watch the rest. It isn't worth the time.\n\nIf you've seen this movie PLEASE read the book. There is no sense in letting this crappy film detract from one of Crichton's best novels.\n\nFor reference, I give this movie a 1 rating, and that is probably being generous."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "gavin6942",
        "review_rating": "6",
        "review_title": "Fun, No Matter What Critics Might Say",
        "review_detailed_main": "When an expedition to the African Congo ends in disaster, a new team is assembled to find out what went wrong.\n\nI saw this film in the theater and recall liking it. It had action, adventure, some horror elements. A great cast. Even Bruce Campbell, who I liked at the time. But watching it again now (2015) twenty years later, I didn't really remember very much, it seems, beyond the killer gorillas.\n\nI had no recollection, for example, of just how bad the gorilla costumes were. Amy (the good gorilla) in particular looks awful. Now, I would rather have a bad suit than bad CGI. So that's good. But it still makes the movie sort of cheesy and has probably caused its stock to decline in recent years."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "elvisbloom",
        "review_rating": "1",
        "review_title": "Amy... Amy hate movie... Amy commit suicide",
        "review_detailed_main": "Anyone who has seen the piece of steaming smelly poo called Congo understands my title. And I feel for you. This movie wasn't just bad. It was painful. The book was stupid, the script was even dumber and the cast was terrible. Dylan Walsh? Rumor has it Julia Roberts dumped your ass cause this movie blew so bad. Huge diamonds? Killer gorillas? Talking gorillas? Hmmm. Sounds like a hit! OH! Tim Curry's accent is so bad in this movie I would prefer being deaf! I recommend this movie to bulimics looking to purge after a heavy meal or Kavorkian patients who just need that one more reason to die. If this is faithful to the book, I would say lets have us a good old fashion Footloose book burning and destroy every copy. If future generations look back and find this garbage, how would we explain ourselves? Listen to the others who hated this movie! Don't watch it! Run away! DO NOT WATCH this movie! If you think it is full of action or suspense or cool effects, YOU ARE WRONG! If you think it blows more cock than Nicole Ritchie, you'd be right. So if you still are going to watch Crapo..,.I Mean Congo, I say do it after you just took 50 Tylenol PM."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Wuchakk",
        "review_rating": "7",
        "review_title": "Good jungle action flick",
        "review_detailed_main": "\"Congo,\" based on Michael Crichton's novel, was a fair hit in the summer of 1995. I didn't get to see it at the time, but I've seen it twice since 2009 and enjoyed it greatly.\n\nTHE STORY: Laura Linney, Dylan Walsh, Tim Curry and Ernie Hudson star in an unlikely expedition into deepest, darkest Africa where they discover King Solomon's secret diamond mine and the killer gorillas bred to guard it. Along for the ride is a female gorilla who's been trained to use sign language which activates a speech synthesizer.\n\nThe film plays out like a less-goofy Indiana Jones flick or \"Jurassic Park\" without dinosaurs or kids and with a better cast.\n\nLaura Linney is a believable female protagonist; She's good-looking but not smokin' hot (e.g. Megan Fox). Dylan Walsh is a likable addition to the cast as the primologist. To the story's credit Linney never has a hot spring scene and there is no real love story in the mix. Not that I would have minded either; it's just refreshing that the film avoids such clichés, maybe because the rest of the story is full of well-worn material. For instance, Tim Curry as the diamond-obsessed creep and the volcano-erupting, temple-colapsing climax.\n\nThe best castmember is Ernie Hudson as Monro Kelly, who takes the reigns of the expedition and refers to himself as \"a great white hunter who happens to be black\" (hee, hee). I don't remember seeing Hudson in any other film or TV show but he's stellar here. He effortlessly commands the safari and responds to the string of dangerous encounters with a confident, bemused detachment.\n\nThe stellar filming locations include Kenya, Tanzania, Uganda, Costa Rico and the Los Angeles County Botanic Garden.\n\nWith the exception of \"Raiders of the Lost Ark,\" which is in a league of its own, \"Congo\" is on par or better than the other Indiana Jones flicks. I actually like it better. Although the hackneyed ending will make you roll your eyes (as well as thrill you), \"Congo\" fits the bill if you're in the mood for a modern jungle action flick. Just keep in mind it's not \"Apocalypse Now\" and was never meant to be.\n\nThe film runs 109 minutes.\n\nGRADE: B"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ironhorse_iv",
        "review_rating": "5",
        "review_title": "This movie made me go ape sh*t!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Mandemus",
        "review_rating": "6",
        "review_title": "I have a soft spot for this movie, but...",
        "review_detailed_main": "The idea is great, the book was a good read, and the film ought to have been great as well. I was disappointed, but I still have a soft spot for this story. They expected Congo to be the next King Kong and there were a good deal of toys, action figures, books, stickers, etc. to sell to the expected hordes of fans. The fans did not materialize and the action figures are an easy buy on the internet.\n\nThe legend of the city of Zinj is a phenomenal idea to work with for a film. Evolved apes is a sure seller. But this movie did not deliver. There were so many missed opportunities and examples of poor writing. For me the ape researcher on the expedition is a bit goofy to be credible. And he is one of the central characters! We are not given much to believe his knowledge or utility to the expedition or to Amy for that matter. This spoils that character. I liked the African actors in the film and was willing to go along with the hunter and his somewhat distracting phony English accent. But somehow, the film did not deliver what it could easily have delivered: action plus thought-provoking story about animal intelligence."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "dkmerriman",
        "review_rating": "5",
        "review_title": "Not even close, never mind a cigar",
        "review_detailed_main": "Comments here are general so as to not reveal any plot or character details of the actual movie. Anyone that has read the book should understand them well enough to know what is being referenced.\n\nThis movie bears only a general resemblance to the Michael Crichton book. Beginning, middle, and end... it's all at considerable odds with the original tale.\n\nThere isn't anywhere near the setup or explanation of what the expedition is for, or why it's happening. The journey is at odds with the story, as are most of the characters (either in personality, presence/absence, and so on). All things considered, I would say that this movie just BARELY qualifies as being 'based' on the book by virtue of being about an expedition that travels to the Congo with a gorilla.\n\nIf you have any expectation of this movie being anything like the excellent Crichton story, you're in for a BIG disappointment.\n\nStill, it's a tolerably decent movie; I'd have given it a higher rating if they hadn't hijacked an otherwise good story."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Benh1003",
        "review_rating": "8",
        "review_title": "A B movie, that does right what so many other movies do wrong that people complain about",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bowmanblue",
        "review_rating": "7",
        "review_title": "A B-movie with a budget",
        "review_detailed_main": "'Congo' never tries to be anything other than a B-movie. The plot is kind of simple. The characters are pretty stereotypical and the dialogue is hardly Shakespeare. In fact, when films are talked about, Congo is always forgotten. It wasn't received that well at its time of release, yet all that doesn't mean it's necessarily a bad film.\n\nYes, it's kind of cheesy, but it's also kind of fun. It's an adventure that follows a group of scientists as they attempt to return a friendly gorilla to her natural habitat (in the Congo, would you believe?). Unfortunately, things don't go their way and they have to contend with everything from corrupt local soldiers to angry hippos and killer gorillas.\n\nIt's one of those adventure movies that could - loosely - be put in the same category as the Indiana Jones movies. Don't get me wrong... it's nowhere near as good as Indy's outings, but, if you're looking for a fun movie that rolls along with plenty of action, then give this a go.\n\nI would say that the only major drawback came from the marketing. If you watch the trailers for it or read the write-up, all it talks about is how the team encounters hostile gorillas. That's the film's selling point. However, the said gorillas don't actually make an appearance until the last twenty-five minutes or so, so, by then, you may be wondering where they are."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "cultfilmfreaksdotcom",
        "review_rating": "1",
        "review_title": "Slowing Ape",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "georg-imdb",
        "review_rating": "",
        "review_title": "If you liked Raiders of the Lost Ark, Star Trek, or Stargate...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Max-Zorin",
        "review_rating": "1",
        "review_title": "One Man and His Monkey",
        "review_detailed_main": "After a string of successful 'a man and his monkey films', which included the seminal \"Every Which Way But Loose\", \"Every Which Way You Can\" and \"Peter's Friends\", the genre fell on hard times. In an effort to rejuvenate this once celebrated area, director Frank Marshall brought Michael Crichton's acclaimed novel to the big screen.\n\nThink 'Gorillas in the Mist' meets 'Tron' minus the box-office clout of Bruce Boxleitner. This is one mans doomed love affair for his talking monkey. Not helped by bad accents (Tim Curry struggles with a Romanian), a baboon of a screenplay, hungry hippos, skydiving primates and Bruce Campbell. Ape-Sh*t."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "The-Sarkologist",
        "review_rating": "7",
        "review_title": "Another, albeit not bad, movie about King Solomon's Mines",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "campy high adventure",
        "review_detailed_main": "A team from a communication company is in Congo on an expedition. They discover a lost city and are massacred. Karen Ross (Laura Linney) is an ex-CIA agent and goes in search of the lost group. She and philanthropist Herkermer Homolka (Tim Curry) fund an expedition of Dr. Peter Elliott (Dylan Walsh) and his assistant Richard (Grant Heslov) from Berkley. They have taught a gorilla named Amy how to sign and with a glove and computer backpack, she can speak. The group is joined by local guide Munro Kelly (Ernie Hudson). At the Lost City of Zinj, they are confronted with a species of gray gorillas.\n\nThis is such an odd movie. It isn't quite quirky enough to be funny. Yet it can't be taken seriously especially with Amy around. It probably needs a comedian to do the comedy and I don't think Tim Curry is quite right. He's too weaselly. The action adventure doesn't really work because none of it seem real. The sets all look fake. I don't mind the gray gorilla group's look. They could look more menacing. Amy is too fake. She's intended as one of the lead characters but she doesn't look good enough. I might like it better if the movie fully embraced its campiness."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "orangehenryviii",
        "review_rating": "7",
        "review_title": "A Goofy Good Time",
        "review_detailed_main": "When a movie opens with a Bruce Campbell cameo as a fanny-pack-sporting explorer you know you are in for a goofy good time. Throw in Tim Curry, Joe Don Baker, a talking gorilla, a volcano, and more fake monkeys than Saturday morning TV in the 70s and it's a party. All this with a Michael Crichton plot and big budget special effects. Thank goodness Spielberg didn't get his hands on this or it may have never turned out to be such ridiculous good fun. If you are are in the mood for a so-bad-its-good/accidentally funny flick, then break out the pop corn and enjoy!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "fmarkland32",
        "review_rating": "1",
        "review_title": "Invincible laser missions...",
        "review_detailed_main": "Congo opens with a laser mission as a group of people are looking to find stolen diamonds and make a laser gun (Or something?) and when the first unit is destroyed, the girlfriend of one of the guys who disappeared leads an attack to find out what happened, also there is a talking ape and scientists. Believe it or not the story is a rip off of Laser Mission and Bruce Li:The Invincible. In Bruce Li:The Invincible, a martial artists fights genetically altered apes, while in Laser Mission the plot is about kidnapping a scientist who can turn a diamond into a laser. Both movies were rotten but actually better than this. What can I say about this stinker, that hasn't already be said? It features one of the most asinine plots and some of the dumbest ideas ever committed to celluloid. I mean this is a movie where people are getting in fights with apes, for goodness sake! It's a terrible movie, indeed it is one of the worst movies I ever saw in a movie theater.\n\n1/2* out of 4-(Awful)"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jonahstewartvaughan",
        "review_rating": "7",
        "review_title": "Congo (1995)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "JayWolfgramm",
        "review_rating": "4",
        "review_title": "Some Corny Enjoyment, But Not Enough",
        "review_detailed_main": "\"Congo\" has an infamous reputation as a train wreck of a movie. I went in knowing the movie was likely going to be awful but was sadly surprised that it wasn't the over the top enjoyable bad I was looking for.\n\nThe movie makes the unforgivable sin of introducing Bruce Campbell, only to do nothing with his character. Throughout the movie, I kept thinking, where's Bruce? But they helped make up for it by include Ernie Hudson and Tim Curry. Tim Curry is an absolute delight, he steals every scene he is in. He is speaking in a crazy accent, rambling off nonsense and is obsessed with diamonds. He helps make this movie memorable.\n\nStan Winston does the costumes in this movie. And yes, it is obvious that they are not actual gorillas they are just people in suits. It can take you out of the scene every time they cut to these gorilla costumes.\n\nThere is one character, who dies of fright in this movie. The actor that plays it, gives 110% to his performance. It is shot and delivered in such a way, that it is one of the most hilarious death scenes I've ever seen. Humor isn't what the director had in mind for the scene, but it is hilarious none the less.\n\nThe rest of the movie is just your basic Jungle B-Movie affair. What makes the movie feel so hollow is by the end, I can't tell you a single thing any character learned or how any character changed. I guess Dr. Karen Ross learned her boss was a jerk, but that was painfully obvious to everyone. Everyone just went to the jungle, hi-jinx ensued, and then they leave.\n\nI think the reason it is looked back upon with such shame is because of all the wasted potential. As Bruce Campbell pointed out, on paper this movie has all the right ingredients. It has Jerry Goldsmith music, is has Stan Winston doing special effects, it has great actors and it is based on a Michael Creighton book. I'm sure producers thought after \"Jurassic Park\" was a big hit in '93, and Lion King's success in '94, they had a slam dunk with a Michael Creighton story based in Africa. But they were then disappointed once the box office rolled in, and audiences were disappointed when all they got was \"Congo\"."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "BA_Harrison",
        "review_rating": "8",
        "review_title": "It's where they drink Um Bongo.",
        "review_detailed_main": "After the mega-success of Spielberg's Jurassic Park in 1993, I imagine that producers were all over author Michael Crichton's back catalogue in search of another potential box-office hit; featuring untamed wilderness, a cute talking gorilla, some far less appealing killer apes, a laser weapon, King Solomon's lost diamond mines, and an exploding volcano, exotic, jungle-based adventure Congo was a natural choice for the block-buster approach.\n\nDirected by Frank Marshall, the film made a healthy profit, but the critics tore the film apart, clearly of the opinion that this heady concoction of action, horror, industrial intrigue, drama and warfare was no match for Mel Gibson in a kilt or a talking pig. But then what do critics know anyway?\n\nThis might not be a superlative piece of cinema—John Patrick Shanley's screenplay conveys no meaningful message, Frank Marshall never advances the art of film-making with his direction, and one needn't bother looking for any Oscar-worthy performances—but Congo still proves to be hugely entertaining nonsense, a whole lot of cheesy, big budget fun, with cool creature effects (the gorilla suits were by FX legend Stan Winston), impressive set design, some decent action set-pieces, a wonderfully camp performance from Tim Curry as Romanian treasure seeker Herkermer Homolka, a neat cameo from Bruce Campbell, lovely Laura Linney and her delightful dimples, and some truly manky monkeys (OK, so technically they're apes, but for the purpose of alliteration, they're monkeys!). And that's got 'entertaining' stamped all over it as far as I am concerned."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "katieadeliawagner",
        "review_rating": "6",
        "review_title": "Good Movie. Kinda Cheesy Parts Though.",
        "review_detailed_main": "So it's really good. It had me on the edge of my seat wanting to know what happens next, Until they were fighting off the big white gorillas. That part got super cheesy. But it's a cute, cleaver, and original storyline. I probably wouldn't watch it a second time, but it was definitely worth watching once. Amy the talking gorilla was the cutest part of the movie for sure and definitely the main reason to watch it. I also Got extra fascinated by the movie once I read that there were actually no real gorillas used in the movie. They look so darn real!!!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "samr-67258",
        "review_rating": "4",
        "review_title": "Laura Linney 10 stars, rest of cast 2",
        "review_detailed_main": "Movie is passable, not good or very good. Interesting plot poorly acted except Laura who is outstanding. Animatronic talking gorilla is the worst part followed closely by men in gorilla costumes and other actors. Fake sets joined with Safari tourist shots. The technology is nicely dated period piece thanks to authors research. The \"natives\" are also a hoot. As is their ceremonial choreography. Too bad they botched Creightons book so badly. A little more attention to his details would have helped greatly. That and less exaggerated characters and dialogue. Or acting classes. A decent time filler."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "frustration",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "iranu-74195",
        "review_rating": "1",
        "review_title": "it was on TV so I watched awhile to remember what utter trash this was",
        "review_detailed_main": "Few people can stand Laura Linney and this was maybe the movie where she set out her Acting \"stall\" that she has sold from ever since. She is up there in the top 5 of \"most turn you off Leading ladies of all time\". Have no idea why she gets parts. Some other reviewers have tried to be be geneorous and say the movie brings happy memories. it does not. This film is an embarrassing, amateur, badly executed, badly shot, badly acted, badly scripted piece of k rap. It is truly apalling at every level. Tim Curry camps-it-up knowing he'd signed up to a turkey - but even his comic act doesn't help. Somebody should burn all the physical and electronic copies of this movie to simply make a little more space in the World. There a few films as bad as this - and unfortunately Linney is in another one of them."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Die Hard-3",
        "review_rating": "6",
        "review_title": "Slightly above average",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "-88",
        "review_rating": "1",
        "review_title": "Smell the steaming jungle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "lavaside-60237",
        "review_rating": "7",
        "review_title": "Never Understood the Hate",
        "review_detailed_main": "A fun, entertaining movie.\n\nI think this film is a victim of coming out when Hollywood was in its prime, and we were all far too spoiled.\n\nThis movie is a 10 compared to what they're putting out these days. Lol I'd watch this on repeat before being forced to watch ANYTHING made in the last 5 years.\n\nTim Curry uses a funny accent that makes him come off as hammy - while Ernie Hudson steals the show.\n\nBut Curry still works for his role, as he plays a huckster.\n\nThey should have had him stop using the accent towards the end, playing it off as part of his character's act.\n\nI have no doubt it turned a lot of people off on the film, when it originally hit the theaters.\n\nAs far as storytelling goes - it's pacing is flawless.\n\nI'd like to add, the film would have benefited greatly from writing in a reason to have Eddie Ventro (Joe Pantoliano uncredited) join them on their journey."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "john-555",
        "review_rating": "1",
        "review_title": "So Bad it's good (Spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "classicsoncall",
        "review_rating": "6",
        "review_title": "\"The myth of the killer ape is true!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "gcd70",
        "review_rating": "5",
        "review_title": "Less than enthralling",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "spookyrat1",
        "review_rating": "8",
        "review_title": "Chasing Amy",
        "review_detailed_main": "I'm happy to play odd man out amongst the many reviewers here who disliked this film, as I, like Roger Ebert apparently, have always found Congo to be entertaining and quite thrilling in the same way as were the big screen jungle adventures of the early 1950's and TV series, such as Jungle Jim.\n\nAdapted quite closely from the best selling book by Michael Crichton, but wisely, never taking itself anywhere near as seriously, Congo is a fun ride, mixing lost cities, buried treasure, volcanoes, earthquakes, African civil wars, satellite technology, lasers, predatory animals and a talking gorilla into one heady, trip. It's tongue is planted very firmly, front and centre in it's cinematic cheek, for which many of the critics and reviewers here, IMO, don't appear to give it sufficient credit. This is very much an adventure comedy, best referenced when the largely African cast join chorally and quite unexpectedly in the singing of California Dreaming, as they paddle rafts down a river.\n\nThis is the film that introduced me to (the very attractive in a natural way) Laura Linney, playing the smart, independent, resilient scientist Karen Ross. It also gave Ernie Hudson what he later described as his favourite role, allowing him to finally and genuinely, share centre stage in a movie (rather than token black support actor) playing Captain Munro Kelly (think of an African - American Stewart Grainger) utilising a delightfully functional mid-Atlantic accent. Mention must be made of the Amy gorilla character, who truly convinces us she is a flesh and blood creature, through being allowed (unlike many of the human characters) to play it pretty much straight, whilst still having some early comic highlights with her primate scientist/trainer played by Dylan Walsh.\n\nThis 1995 production still looks the goods, with suitably exotic location scenes mainly shot in Costa Rica with only some of the concluding special effects looking a little clunky by today's more refined standards.\n\nFinally watch out for the visually spectacular parachuting scenes and the humorous events leading up to it and an uncredited cameo from the always reliable Delroy Lindo playing a money-hungry militia leader."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "neil-douglas2010",
        "review_rating": "7",
        "review_title": "Time mellows",
        "review_detailed_main": "When I first saw this on rental back in 96 I gave this a measly 6 out of 10, so on a rewatch I didn't expect much. Either my ratings have changed or I'm in a better mood but I quite enjoyed. True there's nothing exceptional about the film, but there's nothing truly awful either. Even Tim Curry is ok in this film. After an expedition in Central Africa goes terribly wrong a new team is sent in, including a gorilla. Of course the scientists and explorers are caught in a disaster when certain people (hello Tim Curry) get overly greedy. Joe Pantoliano is criminally underused in an uncredited role, it might've been even better if he was in it longer."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "HBeachBabe",
        "review_rating": "1",
        "review_title": "one of the worst films ever made",
        "review_detailed_main": "I'd give this film a zero if I could. How anyone could rate it any higher is beyond me. Until I saw Rollerball, this was my pick for worst film ever from a major studio with a real budget (claiming Mangler 2 or Leprechaun in the Hood as the worst ever isn't really saying much, those are supposed to be bad)\n\nTim Curry's mom must have needed surgery or something for him to agree to this non-sensical garbage. I'm really not sure what happened here. The novel was great, the director Frank Marshall had a solid track record with Alive and Arachnophobia (perhaps they should have changed the title to 'Africa'), the cast was good and the budget was there. You'd think someone would have bothered to read the script.\n\nYou'd be better off watching Battlefield: Earth again than wasting your time with. Congo makes you long for the return of MST3K"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "clay-8",
        "review_rating": "",
        "review_title": "***1/2 out of ****",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "WOZ inOZ",
        "review_rating": "4",
        "review_title": "Bit of a mess, but still fun.",
        "review_detailed_main": "Lively but unbalanced adventure from the pen of Michael Crichton suffers from studio sets that don't quite make the grade and quirky casting, from Tim Curry's camp Rumanian treasure hunter, to Ernie Hudson's great 'black' hunter, complete with a distinguished English accent that could have been worse, after all there was always Keanu Reeves in 'Dracula'.\n\nThe film also suffers from two bland leads, a talking ape and some shocking over acting from minor performers. Even Frank Marshall's direction seems a little hurried, making the film appear more like a Sunday matinee B-movie from the fifties than it actually is."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "rarepunkrock",
        "review_rating": "6",
        "review_title": "Not That Bad",
        "review_detailed_main": "A lot of people hate Congo. I'm not one of them.\n\nI remember going to see this in the cinema and thinking it was really cool. Obviously, I realise it isn't a masterpiece, but it's good enough to enjoy. In the decades since I watched it on the big screen, I think I've only watched it a handful of times at most, but if it was showing on TV right now, I would probably stick it on.\n\nBruce Campbell's brief appearance at the beginning is probably the best thing about this film, but the downward slope to the end isn't all that steep. I reckon most people would find something to like in this film. Just don't go into it expecting anything close to Jurassic Park."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "chrisbrown6453",
        "review_rating": "3",
        "review_title": "Yikes!",
        "review_detailed_main": "It will be hard to top CONGO as a big turkey. Too bad we can't just pass off this juvenile adventure as kid's stuff, but it's way too violent for the under-12 set. Killer gorillas are guarding the lost African city of Zinj, where the streets are littered with diamonds. These nasty simians of Zinj are not very sociable and bite off the heads of those greedy humans who come looking to get rich quick. The humans also have to deal with a huge, hungry hippo, an erupting volcano, well-armed local militants, and a wide variety of insects, snakes and spiders. Based on a Michael Crichton novel, CONGO is a long, long way from JURASSIC PARK.\n\nJohn Patrick Shanley, who won an Oscar for MOONSTRUCK, gets credit for the ridiculous script. Killer gorillas with typewriters couldn't have done worse. Acting is wildly uneven. Ernie Hudson has some fun with his part as the \"Great White Hunter,\" but Dylan Walsh and Laura Linney are lost in the jungle. Poor Walsh is stuck making goo-goo eyes at a phony-looking, domesticated gorilla named Amy, played by a diminutive gymnast in a hair suit. Thanks to modern technology, Amy can talk. Even worse is poor Tim Curry, who, no doubt, wishes he had stayed in ROCKY HORROR drag. His Romanian accent as Herkermer Homolka could be grounds for a defamation class suit by the people of that country. Then there are the special effects. CONGO reportedly cost in the neighborhood of 60 million dollars, but I'm sure I saw that same cheeseball lava flow in GODZILLA MEETS BIOLANTE."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "LetsReviewThat26",
        "review_rating": "7",
        "review_title": "wonderful film with a great cast",
        "review_detailed_main": "This was a pretty good film. I liked it more than I thought I would with a mix of action and intense scenes. The cast were all good as well. The only thing I didn't like about this was Tim curry's accent he chose because I'm not really sure what that even was. I also loved the craftsman ship of the Amy suit and all the other hybrid apes. They were pretty frightening."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Si_m007",
        "review_rating": "3",
        "review_title": "Utterly dumb, but watchable",
        "review_detailed_main": "I'm really not too sure why people are being so complimentary about this odd movie. Having said that - I did actually sit through the entire 2 hours and can't say it wasn't entirely un-entertaining.\n\nI think the key problem is that Frank Marshall is not a true director and this is clear in the film - he is an experienced producer, so will have seen a movie made many a time, and will understand what goes into the process. But I think this is quite different to being able to truly direct a movie - the direction was competent, but somehow flat and direction-less. Marshall has more experience as a unit or second director, and this came through, I feel, in the finished product - it appeared to be a group of sets that failed to really have any continuity in its feel or its character.\n\nFun, watchable, but good? No."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bejwak",
        "review_rating": "7",
        "review_title": "lighten up",
        "review_detailed_main": "I just watched the DVD version of this movie years after I first saw this movie at the theater. I liked it better with the second viewing. While it is true that most books are better than the movie it is not always so. This book and Sphere were both rotten in my opinion and the movie \"Sphere\" would get a 5/10 from me. However this movie was entertaining and not boring so it gets a 7/10. I don't understand how anyone can justify giving any serious movie a 1 or 2 rating unless they are trying to pull the rating down so one of their favorites is higher rated. I do not agree with a lot of the reviews posted here. Amy never annoyed me and the special effects were not bad. Even the acting was not so bad. Lighten up everybody and enjoy the movie."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "lee_eisenberg",
        "review_rating": "2",
        "review_title": "the book wasn't exactly worth adapting",
        "review_detailed_main": "Poorly acted and poorly directed, \"Congo\" unsuccessfully tries to recreate the feeling of \"Jurassic Park\". But the truth is, the book wasn't all that great either. Still, the movie's first problem is that Tim Curry's character was added; the second problem is that the talking arm was added; the main problem, though, is that the cast members don't create realistic characters. I guarantee that this movie will not make you think that there are killer gorillas anywhere on earth. Also starring Laura Linney (happy birthday, Laura!), Dylan Walsh, Ernie Hudson, Grant Heslov, Joe Don Baker, James Karen and Bruce Campbell; I'm guessing that they don't wish to emphasize this movie in their resumes."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "pfernandez37",
        "review_rating": "10",
        "review_title": "Great Film",
        "review_detailed_main": "I don't care what anybody says. I thought it was a well thought-out storyline and the characters were awesome. Everyone had to love Herkama. He made the whole show. Besides, I've seen a lot worse be treated to Academy awards simply because of directors and the movies weren't that great.\n\nI don't think what the creator was attempting to capture special effects buffs as much as it was telling a basic concept of greed.\n\nIf you like a good story and can grasp the concept of what it is telling you about the wisdom of Solomon then watch this movie with new insight. If not, you deserve Million Dollar Baby!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "columbo123",
        "review_rating": "7",
        "review_title": "Excellent B-movie!",
        "review_detailed_main": "This movie must be appreciated for what it is- an excellent B-movie with a great cast that chews the scenery and spits out preposterous dialogue. The Cast has all of the credentials. Tim Currey, Ernie Hudson, Delroy Lindo, Laura Linney, and Joe Pantoliano are all capable of fine dramatic work. That isn't what is called for here. Bruce Campbell and Joe Don Baker set the tone for this campy-action-comedy. This is a good excuse for good actors to flex thier overacting muscles.\n\nLots of fun"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Superxavier",
        "review_rating": "1",
        "review_title": "avoid",
        "review_detailed_main": "publicity got me to the theatre\n\nadvice will take you away from this waist of time.\n\nvery bad everything.\n\ndo you really want to see a monkey talking with a technological device?\n\nX"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ottaky",
        "review_rating": "",
        "review_title": "A real stinker",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "gavin-thelordofthefu-48-460297",
        "review_rating": "5",
        "review_title": "Not bad, but strictly mediocre in its telling of the book",
        "review_detailed_main": "I've read the book by Michael Crichton once and I actually found it a little graphic in it's violence, but that's what makes it so enjoyable to read. So, when I heard that Frank Marshall, the producer who worked with Steven Spielberg in the Indiana Jones films, directed this adaptation of the book, I thought it was a very cool idea and would catch my very interest, but going through with all the hatred it had, this film didn't hold up for me, but despite going over the Nostalgia Critic review of this film, however, I thought that this is an OK film. Not good, not bad. Just sort of \"There. A test of formal mediocrity.\" I'm surprised that Roger Ebert himself liked this film, but as for me, I'm calling this a guilty pleasure.\n\nThere are a few good things that prevented me for giving this movie a much lower rating. The cinematography is surprisingly superb, the scenery is very nice to look at, and Jerry Goldsmith's music score was very riveting. The strongest aspect goes to the cast. Laura Linney did a good job as the strong lead. Dylan Walsh, although not his best performance, gives a good delivery. Tim Curry, however, was OK. His accent didn't interest me, but hey it's acting. What do you expect? In fact, I really liked him here despite the hammy material he's been given. So, please, critics. Stop criticizing the actor. I felt that Joe Don Baker was so annoying because he does nothing other than overreacting and shouting. The best actors in this movie so far goes to Bruce Campbell for his clever personality and Ernie Hudson for his flawless charm and grin. That's it for my praise.\n\nSo, what do I hate about this movie? Well, there are four problems that didn't leave an impact. First, the Dialogue is easily mediocre. It had some crude material, but at least it had some funny moments (\"Stop eating my sesame cake\"). Second, the plot deviates itself from the book although it had a great atmosphere in some of the scenes. Third, the directing from Frank Marshall was very inconsistent. And fourth, but not the least, is the movie's cheesy special effects and I didn't get why the monkeys jump into the lava near the end of the film which was the most cheesiest moment. Even the scene in the King Solomons Mine scene was very graphic. I mean, getting your head bashed felt pretty real. Shocking, isn't it?\n\nOverall, Congo isn't as horrible as the critics generally said it was, but with a better plot and better special effects, it would have been an astounding film other than a mediocre adaptation of the book written by the same guy who wrote Jurassic Park.\n\nRating: 5.5/10"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "crowrobot",
        "review_rating": "7",
        "review_title": "It's flawed, but it's still fun as heck.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "SPaS",
        "review_rating": "5",
        "review_title": "The last of the summer flicks *** spoilers, if someone cares***",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "gazzo-2",
        "review_rating": "6",
        "review_title": "Something to jump up and down about...",
        "review_detailed_main": "This was good! This one was right outta 'The Rocketeer', 'Stargate', 'Deep Blue Sea', 'the Mummy', 'Independence Day', and I would guess 'Tombstone'-B film, throwback to yesteryear, but with $$$$ and a bigger name cast.\n\nI found this to be fast moving, liked the blue diamond shaft they found, the malevolent apes of grey, the links to Soloman's wealth(hey why not?)-the FX were fine, though its not much more than a bunch of guys in ape suits, did a good job to my thinking all the same.\n\nAnd with the cast-Ernie Hudson, Tim Curry, Laura Linney-how can you go wrong? Joe Don Baker livens up about everything he gets involved with too. Definately worth a look see; if you liked any of the above films I mentioned you will probably like this one too.\n\n*** outta ****, does a good job."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "elu5iv3",
        "review_rating": "4",
        "review_title": "Blah...",
        "review_detailed_main": "Congo: 4/10 (TV)\n\nThis could have been a good movie if you didn't know the \"scary monsters\" of the movie waiting to be unleashed were regular gorillas with white chalk over them and vicious faces. This had some cool moments and characters, but was pretty predictable and often boring. The best part was the interaction between the doctor and his pet gorilla, which was cute."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "vip_ebriega",
        "review_rating": "7",
        "review_title": "Going Bananas!",
        "review_detailed_main": "My Take: A sometimes trite old-fashioned adventure that stays true to its form.\n\nCONGO goes back to the old tradition of adventure movies, refurbishing it with new technology, gadgets and pumping it up with special effects (created by the ILM crew that brought us JURASSIC PARK). At the same time, CONGO brings along the genre's cheesiness, and it quite shows. The gorillas are pretty unconvincing at some parts, which you know are simply guys in gorilla suits acting it out (since, at the time CG has not yet perfected the creation of fur). The screenplay is often filled with mediocre dialog.\n\nThe film is based on Michael Chricton's other bestselling novel and, although I haven't read the book, I'm pretty sure Chricton can't devise such a lousy story. Still, what the heck, I liked this movie. It's fun and very funny. The film takes itself a bit seriously in places it shouldn't, but I liked its nods at old adventure movies. Bring in Johnny Weissmüller and the Tarzan yell! The movie has a gorilla expert (Dylan Walsh) joining an expedition to the dark region of the Congo to return his beloved pet/test subject, a gorilla named Amy. The expedition is also accompanied by Dr. Karen Ross (Laura Linney), who works for a company called Travicom, ordered by her boss (Joe Don Baker) to investigate what has become of the first expedition sent there (as well as another objective). Also along for the trip is a Romanian \"philantrophist\" Herkermer Homolka (Tim Curry, in a Romanian accent). Their \"Great White Hunter\", who happens to be black, is the daring Monroe Kelly (Ernie Hudson from GHOSTBUSTERS).\n\nCONGO is filled with cheesiness. Clichés are there, as are some bits of silliness that is very convincing that this isn't a Chricton creation (as a film that is). But that's just part of the fun. CONGO is a lot of fun if you are willing to suspend your disbelief for two hours (at least). The special effects are pretty good, but the film is still high on adventure. Directed by Frank Marshall, the energy is quite high, and the action scenes are pretty good.\n\nCONGO is quite silly, but that's its heart on the right place.\n\nRating: ***1/2 out of 5."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "MovieAddict2016",
        "review_rating": "3",
        "review_title": "One Of Crichton's Lesser Novels; One Of the Lesser Crichton Films",
        "review_detailed_main": "\"Congo\" is based on the best-selling novel by Michael Crichton, which I thought lacked Crichton's usual charm, smart characters and punch. Well, sorry to say, but the same goes for the film.\n\nHere's the plot:\n\nGreed is bad, this simple morality tale cautions. A megalomaniacal C.E.O. (Joe Don Baker) sends his son into the dangerous African Congo on a quest for a source of diamonds large enough and pure enough to function as powerful laser communications transmitter (or is it laser weapons?). When contact is lost with his son and the team, his daughter-in-law (Laura Linney), a former CIA operative and computer-freak, is sent after them. On her quest, she is accompanied by gee-whiz gadgetry and a few eccentric characters (including a mercenary (Ernie Hudson), a researcher with a talking gorilla (Dylan Walsh), and a a nutty Indiana-Jones-type looking for King Solomon's Mines (Tim Curry). After some narrow escapes from surface-to-air missiles and some African wildlife, they all discover that often what we most want turns out to be the source of our downfall.\n\nThe actors in this movie were not talented. Dylan Walsh acts like a pathetic crybaby, especially at the end; Ernie Hudson is unconvincing (is it no wonder he went on to star in TV films?) and Laura Linney is nothing special. I think I can safely say the only talented actors in this film had very small roles: Joe Don Baker and Tim Curry, an always enjoyable actor (although sometimes scarred for life by constantly being reminded of his \"Rocky Horror Picture\" days).\n\nThis movie also had some other problems, including awful direction style, cheesy dialogue and a just-plain-boring plot, which was completely hashed when compared to Crichton's novel.\n\nNot even Stan Winston's creature effects could save this movie from being a disaster. I am deeply disappointed in this movie; there was not even a campy quality to redeem itself with. It was just plain awful, cheesy, boring and ridiculous, and proves to be one of the worst Crichton book-to-film productions.\n\n2/5 stars -\n\nJohn Ulmer"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "FiendishDramaturgy",
        "review_rating": "8",
        "review_title": "Superior Story, Average Action, Great Atmosphere. All In All, A Good Creature Feature!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "popacopinacap",
        "review_rating": "7",
        "review_title": "Stupid but fun",
        "review_detailed_main": "Congo is a stupid movie that the viewer can have fun with if they don't take it so seriously. The plot is ridiculous, (a talking gorilla?), but the movie is at least different. The acting here is pretty subpar, but Ernie Hudson puts in a pretty good performance. This is definitely not a must see, but if you see it on tv, try it out and see if you like it. ** out of *****"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "TheOtherFool",
        "review_rating": "2",
        "review_title": "Ouch... (spoilers if you care)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "gijoe nut",
        "review_rating": "",
        "review_title": "it's dumb and it doesn't care that it's dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "culwin",
        "review_rating": "5",
        "review_title": "Average",
        "review_detailed_main": "This movie is nothing special, but not as bad as I have heard from critics and others who saw it. I haven't read the book, but can imagine how a good writer might have written this story. The premise sounds interesting, anyhow. I'm not sure exactly went wrong with this movie, but it just didn't work. I wouldn't rush out to see it, but not a bad way to kill 2 hours. Rating: 5 out of 10"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Everum",
        "review_rating": "7",
        "review_title": "Okay interpetation of Crichton",
        "review_detailed_main": "Well I for one did enjoy the movie. The plot was pretty well designed and depicted in the film and the actors did a pretty good job. There were some silly scenes in the movie that could've been easily rectified by an 8-year-old but overall, I enjoyed the movie. I have the tape and it is something I would watch again and again. I rate it 7 out of 10."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "doakish",
        "review_rating": "1",
        "review_title": "The worst movie I have ever seen.",
        "review_detailed_main": "Congo is the only movie that I have almost walked out on. It was horrible. The special effects were embarrassing, and those ape suits looked like they bought them from a bargain-basement costume shop. This movie should have stayed a book. Read the book, and avoid the movie like the plague."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "helpless_dancer",
        "review_rating": "7",
        "review_title": "Didn't think I'd like this one",
        "review_detailed_main": "Unbelievable, ridiculous film, but much better than I thought it would be. It lacked the punch of the Crichton novel, which I felt played a lot more realistically. The special effects animals and the big fight at the end were well done, but it was just a hokey movie over all. Fun and exciting, though."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "patsburg",
        "review_rating": "1",
        "review_title": "The Worst Movie Ever Made",
        "review_detailed_main": "If you can make it through this flick without laughing out loud at the screen, you are a better filmgoer than I.\n\nCount the logic lapses, common-sense leaps, and credibility stretches... betcha need more than two hands!\n\nP.S.: If one more film uses a location that is clearly UCLA, and claims that it is a different university (in this movie's case: Berkeley), I'm going to lose it."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Samiam3",
        "review_rating": "6",
        "review_title": "Goofey mix",
        "review_detailed_main": "I can think of no better way to describe Congo than to call it a wacky mix of all the Spielberg Blockbusters. It has the monstrosity of Jaws, the heart of E.T., the adventurous quality of Raiders, and the science of Jurassic Park.\n\nActually it doesn't achieve any of this, but it tries to. In the end Congo, is reasonably entertaining but as a result of too many clichés, sub-par acting, mediocre special effects, and an overly short running time, it is also pretty cheap. On some level it may work as a satire, of Spielberg. There are times when the movie feels and looks so fake that you find yourself laughing. Perhaps this is intentional.\n\nCongo is B-movie material, but it has some weird and amusing charms to offer. It has lasers, talking gorillas, funny looking temples, hungry hungry Hippos, even hungrier killer apes and more. Even if the story is garbage, it is watchable garbage, and occasionally, almost likable garbage."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bensonmum2",
        "review_rating": "4",
        "review_title": "\"Oh, no! The bad apes have the crystal lasers!\"",
        "review_detailed_main": "I'm going to keep this short - you can read all about Congo all over the internet. I just have a couple of comments - First, Congo's biggest problem is that the movie is all over the place with useless plot threads piled on top of useless plot threads. It tries to do too much. The movie lacks focus. With everything else going on in Congo, the big, bad gray apes have so little screen-time that it's astonishing. The movie was billed as being about killer apes, but they're on screen for a few seconds at the beginning (well, they're sort of on screen) and for about 15 minutes at the end. In between, there's so much nonsense going on that, in reality, has nothing to do with the apes. The whole bit about the assassination of the African leader and all the garbage that happens as a result is a complete waste of time. Congo really needed more ape madness.\n\nSecond, if you read most of the stuff on the internet about Congo, you will no doubt read negative comments about Tim Curry's performance. While I agree that it's over-the-top, it's one of the few things I found enjoyable. He's hysterical. Maybe I'm laughing for all the wrong reasons, but entertainment is entertainment. And really, what were you expecting from Tim Curry? He's an over-the-top ham in everything he ever did - not just Congo."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "filip54",
        "review_rating": "10",
        "review_title": "Stop eating my sesame cake!!!",
        "review_detailed_main": "I don't know why, but I just LOVE this movie!! I remember watching on TV numerous of times a couple of years ago. Now I accidentally found it on Hot Price and just couldn't resist. I still LOVE IT!!! It is funny as hell, some interesting acting(often bad, but that funny bad) like Tim Curry. Favourite scene has got to be when they meet Eric Lindo(that's his name, right) in the jungle and Herkemel starts eating his sesame cake. Right out hilarious!\n\nRecommended to everyone!!\n\n10/10!!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ma-cortes",
        "review_rating": "6",
        "review_title": "A colorful and ordinary adventure story with some picturesque setting",
        "review_detailed_main": "When a mission to the African Congo ends in disaster , a megalomaniacal C.E.O. (Joe Don Baker) sends into the perilous African Congo a new expedition. As a recent team is sent after them when contact with his son (a small part played by Bruce Campbell) is lost . As an expert outfit is assembled to find out what went wrong and in quest for a source of rare diamonds . As a communicating company supervisor (Laura Linney) , a scientific (Dylan Walsh) and his helper (Grant Heslov) to return a talking mountain Gorilla who communicates with sign language to the Congo , her natural habitat , among others (Ernie Hudson , Tim Curry) . Along the way some of the team member out to steal a weird diamond , y and , eventually , they find a lost city , a priceless gem and bloodthirsty mutant gray monkeys .\n\nAfrican jungle horror yarn contains a motley group of eccentric characters such as former C.I.A. operative , along with gee-whiz gadgetry ,accompanied by a mercenary, a researcher with a talking gorilla , his sympathetic assistant , a military , among others . The movie results to be a mixed bag packing jungle movie clichés , undemanding matinee fare , Indiana-Jones-type aventure in which explorers looking for King Solomon's Mines , volcanic eruption , and typical horror Michael Chricton touches come in , too . Here the McGuffin turns out to be a valuable diamond to function as powerful laser communications transmitters or laser weapons . The terrifying elements ensue as the strange gem is guarded by man-eating and creepy monkies spontaneously appearing and causing wreak havoc . There's some interesting idea and fascination in seeing the animatronic talking mountain gorilla called Amy that communicates by means of sign language . Michael Chricton's novel made it all seem plausible but the film has some with no much sense scenes and ridiculous situations . As the yarn doesn't privide the emotion , thrills and intrigue of other Michael Chricton rendition as Andromeda Strain or Jurassik Park .\n\nIt displays a rousing and breathtaking musical score by the always great Jerry Goldsmith . And colorful and lush cinematography by Allen Daviau . This appropriately technology-laden rendition written by John Patrick Shanley was professional but regularly directed by Frank Marshall , delivering usual old-B-movie jungle flick . He married Kathleen Kennedy in 1987, both of them often work with Steven Spielberg . He continued producing memorable films with Spielberg including Poltergeist (1982) and Twilight Zone (1983) (while Kennedy separately produced E.T. (1982)). He worked as executive producer on Indiana Jones (1984), Gremlins (1984), Los Goonies (1985) and the Back to the future (1985) trilogy . And after producing numerous films, he made his feature directing debut with Aracnophobia (1990). In 1993, The Kennedy/Marshall Company was formed and released its first film ¡Viven! (1993), directed by Marshall. His productivity has only increased since then, as he took over primary duties of the production company since Kennedy was named president of Lucasfilm in 2012. Rating : 6/10. Acceptable and passable but neither extraordinary , nor notable , but decent ."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Dar Star",
        "review_rating": "5",
        "review_title": "Not as good as the book, but entertaining enough",
        "review_detailed_main": "Sure the book was way better, but when have I heard that before. The adventure is engrossing enough to overlook the dreadful dialogue. Laura Linney and Ernie Hudson pull off their roles well, but Dylan Walsh's character was very poorly written. I mean this man is a primatologist and acts like he's never been out of his house let alone in a jungle. At one point Peter Elliot asks Munro about monkey mating calls. HELLO, this should be his one area of expertise. Anyway, the elements remaining from the book are enough to make the film enjoyable as long as you don't pay much attention to the script. Note to Joe Don Baker: Look up the meaning of OVER THE TOP."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "todd2u",
        "review_rating": "",
        "review_title": "alright",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "CheekyFreaky",
        "review_rating": "3",
        "review_title": "Subplot List:",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ejonconrad",
        "review_rating": "7",
        "review_title": "Fun. Could have been a lot better",
        "review_detailed_main": "I read the book when it came out, but it took me this long to get around to watching the movie (although it's also possible I saw it a long time ago and completely forgot about it).\n\nIt's definitely a fun movie, but the whole thing has a slapped-together feel with a lot of loose ends and unanswered questions - starting with the whole motivation. It begins with Bruce Campbell in the Congo, reporting via satellite phone to his father/CEO, reporting that he just discovered a large number of \"special diamonds\". In the book, Crichton gets his usual nerd on and explains that these particular diamonds may be the key to a new generation of faster semiconductors - something that was actually credible when the book was written. In the movie, they hint at this by saying \"This will revolutionize communication\", but he also loads one like a bullet into some sort of rifle and turns it into a laser/death ray thingy (huh?). In the end, isn't \"a whole bunch of diamonds\" motivation enough? They could have just left it at that.\n\nCommunication is suddenly cut off on the Congo end, and the father/CEO loses his mind and smashes a golf club through the monitor (he apparently always carries one with him for just this purpose). He launches an expedition, led by Laura Linney, and she starts to pick people up along the way, including a guy with a talking gorilla (!), an expert guide, and Tim Curry as a Romanian - who ends up serving no purpose whatsoever.\n\nIt turns into an old timey jungle adventure, that's fun as long as you don't overthink it, culminating in a not very believable end.\n\nThe highlight is definitely Ernie Hudson (the black Ghostbuster) as the British guide. I would have liked to see a whole string of Indiana Jones-style movies starring his character.\n\nThe low point is Joe Don Baker as the evil father/CEO. His character toggles between saccharine sweetness and full blown freakouts, with nothing in between.\n\nLaura Linney is good, but kind of wasted, and Tim Curry is just kind of goofy.\n\nOne of the reviews talks about the \"low budget\", but $50 million was pretty respectable in 1995. That's almost the budget of the first Jurassic Park; nevertheless, it's definitely a cheap looking B-movie, particularly the gorillas.\n\nBottom line: fun, as long as your expectations aren't too high. I just can't shake the feeling that with a little tweaking and clean-up, this could have been a really memorable movie."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Unfunky_UFO",
        "review_rating": "3",
        "review_title": "Great movie to go with a 6-pack and nothing to do",
        "review_detailed_main": "This movie is beyond bad. In fact, I'd say it makes its way into the realm of enjoyable cheese.\n\nLet's see here: a) bad guys trying to destroy the world, b) a talking gorilla, c) ridiculous plot set in Africa, d) bad CGI, and e) obligatory romantic interest\n\nLooks like a winner to me. This, in an unintentional way, reminds me in a big way of those 60's adventure movies. Lots of bad action, unrealistic special effects, and ridiculous plot lines. When you get down to it, the movie really is just an updated version of the classic adventure movie Mighty Peking Man. Just proves that updated technology can't solve a hackneyed plot.\n\nI recommend grabbing a six pack, a bowl of popcorn, and a few college buddies and laughing your way through this one."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "tonirankin",
        "review_rating": "6",
        "review_title": "Great cast, OK movie",
        "review_detailed_main": "If this movie wasn't so far removed from the source material, it could be better. Congo by Michael Crichton was a great book but they cut it up here to such an extent that it's nearly unrecognizable. And it didn't seem necessary. They added characters and changed motives and yet almost ended up in the same place.\n\nI think the actors did the best they could but it wasn't enough. They needed more to work with. It feels like they just wanted Tim Curry in this movie as a draw but his part was unnecessary and silly.\n\nI probably should have waited longer after reading the book to watch it. Maybe that would have made it seem better."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "sddavis63",
        "review_rating": "3",
        "review_title": "Misses The Mark Completely",
        "review_detailed_main": "Aside from an opening few minutes in the jungles of the Congo in which an expedition looking for diamonds gets wiped out by some strange gorilla-like creatures, this movie really has very little in it that would appeal. It revolves around basically three themes - the scientist who goes to the jungle looking for her former fiancé, the primatologist who wants to return a talking gorilla to her native land and a treasure- hunter who's looking for King Solomon's lost city of diamonds. The three somehow manage to team up to support each other, and we spend significant time watching them traipse through the jungles, with precious little excitement or action taking place. Amy (the talking gorilla) is kind of cute, but I found it hard to believe that this obviously domesticated gorilla would be able to survive in the wild. Still, her story may be the only one of the three that has any appeal as you wonder whether - when the inevitable moment comes when she encounters wild gorilla - she'll choose her own species or the human she's come to love. Yeah. It's kind of a bizarre love story. The \"gorilla-creatures\" from the movie's beginning don't re-appear until the movie's last half hour or so, which means that there's essentially a lot - and I mean A LOT - of filler.\n\nThe movie features some nice sceneries, but an unfortunately second-rate cast that seems to put enough effort into this but never really thoroughly convinces. Ernie Hudson is probably the most familiar face, supported by the likes of Laura Linney and Dylan Walsh and Joe Don Baker, who all work often enough but have never really achieved mega- stardom. There's a minor role for Joe Pantoliano, who I recognized from \"The Sopranos.\"\n\nUnless you really have nothing else to do, this isn't worth the effort of watching. (3/10)"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "PeteB123",
        "review_rating": "6",
        "review_title": "Reading the book made the movie more palatable.",
        "review_detailed_main": "All the characters were either unlikeable or irritating, except for maybe the monkey, and even her synthesized voice got to be irritating.\n\nStill, it's a watchable movie, having watched it three times over the years.\n\nI'll never know if reading the book first affected my opinion of the movie for better or worse. I'd have to erase my mind and watch the movie first to prove that.\n\nEdit: Actually, when I was watching the movie for the first time, I kept thinking that the movie seemed somewhat familiar. Then it occurred to me that I had read a book titled Congo and never made the connection until the end of the movie. So I'm either not very observant or the movie had very little similarity to the book."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ianlouisiana",
        "review_rating": "2",
        "review_title": "King Solomon's Mines meets King Kong.A good idea at the time?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jhmoondance",
        "review_rating": "8",
        "review_title": "Unrealistic apes but still a good movie despite this",
        "review_detailed_main": "Despite the apes glaringly obviously humans in costumes it's an action packed family movie.\n\nA great watch for enthusiastic viewers who enjoy escapist flicks with a decent plot line.\n\nI recommend if you like adventure n apes in the wild lol."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "sfperalta",
        "review_rating": "6",
        "review_title": "Silly, but fun to watch.",
        "review_detailed_main": "I really find this movie entertaining and perhaps unintentionally humerous. Too bad it's based on a fairly good Michael Crichton novel, so must suffer in the comparison. Laura Linney is luminous as always and Ernie Hudson's take on the adventurer and expedition leader is pretty sophisticated. Tim Curry's character of the shady Hungarian seems to have been made up for the movie, as it's not in the novel. A lot of the movie is hack script writing, and filled with terrible movie tropes about the Congo, but somehow still manages to entertain. I would have loved to have seen the version with Sean Connery that Crichton wanted to make. In any case, it's worth kicking back with a bucket of popcorn and diving into this adventure."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "constructionbob",
        "review_rating": "3",
        "review_title": "Flying monkey chunks, baby!",
        "review_detailed_main": "Congo is a very quite bad movie, though I guess it's a little more entertaining than most. Where else can you see a boat get attacked by ravenous hippos? (Prompting the MST3K comment \"Hungry Hungry Hippos!\" from one of my friends :) And Tim Curry's accent as Herkermer Homolka is almost, but not quite as bad as Jon Voight's in Anaconda. The definite highlight of the movie, though, comes in the end where the monkeys all get killed in grisly ways. Some of them even dive into the hot lava for no reason at all. I just wish that annoying 'good' monkey would follow suit. She's incredibly annoying."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "RT Firefly",
        "review_rating": "",
        "review_title": "The best movie since Ishtar",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Scream-11",
        "review_rating": "2",
        "review_title": "This movie makes me want to cry",
        "review_detailed_main": "The book, while not particularly great, was decent, but this movie completely changes it. A lot of the elements of the story are consistent between the book and the movie, but Dr. Ross' character goes from a creatively written character who lives for money and ends up causing the volcanic eruption with her greed to a heart-on-her-sleeve damsel in distress who won't do anything if she even catches the slightest hint that it might be less than noble. When movies change the book that much but keep the same name, it should be a crime."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "djm-11",
        "review_rating": "7",
        "review_title": "Not bad",
        "review_detailed_main": "This was pretty hyped from Jurassic Park, and was ripped by critics. I didn't think it was all that bad. Ernie Hudson stole the show as Monroe. As far as the rest of the characters, I could not get into them. Amy, the ape, was propably my second favorite character. The story itself was good, which saved the movie."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "xredgarnetx",
        "review_rating": "2",
        "review_title": "Awful",
        "review_detailed_main": "CONGO is probably the worst big-budget movie of the 1990s. It is so bad that it is watchable over and over again. A bunch of folks with different agendas probe deep into darkest Africa, where they encounter a temple of riches just like in KING SOLOMON'S MINES -- but with cannibalistic gorillas guarding those riches. On their side, the humans have a \"talking\" gorilla named Amy who helps save the day at one point or another. So much for the plot. The dialogue throughout is witless, the acting almost uniformly atrocious, certainly campy (Tim Curry and Ernie Hudson are both on hand to assure the ham factor), and the special effects abysmal. Wait until you see the cannibalistic gorillas. And the lava! Oh yes, did I mention there's a volcanic eruption to top off the big finale? Laura Linney of all people is along for this bumpiest of rides. What could she have been thinking? This is right around the same time she appeared with Richard Gere and Ed Norton in PRIMAL FEAR, a movie that helped guarantee her stardom."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bayview619",
        "review_rating": "7",
        "review_title": "\"Congo\" introduces Laura Linney to the world.",
        "review_detailed_main": "In the category of films like \"Raiders of the Lost Ark\" and its sequels, \"Congo\" represents a campy adventure story that should rest on its own merits; it is neither a historical account nor an anthropological study, and doesn't purport to be; it is just fun and should be viewed within that framework. Rent it and see for yourself.\n\nThe main joy for me when I saw the film during its original release in theaters was to watch Laura Linney in her first starring role. I knew then that great things were in store for her. Not to mention her having the best dimples on the planet! I am in awe of her body of work on stage, in films, and on TV; and since she just turned 41, I look forward to her continuing to grow in her craft. My most recent experience in that regard was watching her guest-starring appearances on the last 5 episodes of \"Frasier\", in which she stole the show from its regular cast, and gave the series a wonderfully edgy and entertaining finish. Although she is better known for her stage and film roles, her being able to go back and forth among the various actors' venues is refreshing, not to mention her ability to devour both dramatic and comedic roles with equal proficiency. Love 'ya, Laura."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Toolbox",
        "review_rating": "1",
        "review_title": "Why do bad things happen to good books?",
        "review_detailed_main": "Now, it's probably just a testament to Michael Crichton's in-depth writing style that his books translate poorly to film, but this one was just pathetic. Lost World and Sphere were bad, this was painful."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Dr_Coulardeau",
        "review_rating": "7",
        "review_title": "Weissmuller shakes and shudders in his tomb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Crash-46",
        "review_rating": "1",
        "review_title": "One of the worst movies ever",
        "review_detailed_main": "For the most parts, movies adapted from novels loose something in the translation -- not always but a lot of the time. I find Michael Crichton's novels to be extremely entertaining and thought provoking. I only hope his involvement in this travesty of a movie is his name only. It's a terrible adaptation and it's association ruins a very good book. I only wish there was something less than 1 star in the voting."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "abraham-859-499417",
        "review_rating": "9",
        "review_title": "An entertaining trip into Africa",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Atlantima",
        "review_rating": "7",
        "review_title": "It reminds me of A:TLE",
        "review_detailed_main": "Their vehicle is destroyed. They find a lost city. The city is inhabited. (Gorillas...Atlanteans.) Crystals...diamonds. She made a bridge! Talking animal. (OK, Mole's technically human...) Bad guy tries to steal crystal/diamond. Volcano. And, on an unrelated topic, Dylan Walsh looks astoundingly like a hobbit."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "muhammadisnoguru",
        "review_rating": "1",
        "review_title": "I almost shot myself after watching this flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "A modern b-movie without any of the cheesy fun but all the wooden performances, flat dialogue and rubbish plot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "mhorg2018",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "Going ape-show",
        "review_detailed_main": "Or show and tell - literally. Now this has quite a few cliches attached to it and some dialog choices may not be the best. But just the cast alone is quite incredible. And I'm ot even talking about the short appearance of Ash (Bruce Campbell) of Evil Dead fame. That is a bonus for me and anyone else who loves/adores that Dude.\n\nThe story itself is predictable with gullible characters all around. But also quite violent for a mainstream movie. I could more than handle it, I am just warning potential issues some may have with the spikes in effects/violence this includes at times. This is not Monkey Shines mind you! But you have to love animals in general - at least that's what I think.\n\nThe diamond here being the McGuffin of course, but you need an excuse for an expedition, don't you? And once you are on the trip, the entertainment and tension can start."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "gkshaw63",
        "review_rating": "5",
        "review_title": "So Much Potential",
        "review_detailed_main": "Ddisappointing. This is a very good book, but as is the norm, does not play well on the screen. Good actors giving bad performances. Blame the director? Maybe. Definitely watchable but in the way you have background music playing while you watch YouTube vids or read the news."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "alexconsalvos",
        "review_rating": "7",
        "review_title": "My Review of \"Congo.\"",
        "review_detailed_main": "Here is my personal review of the 1995 science-fiction/adventure film \"Congo,\" directed by Frank Marshall and produced by Kathleen Kennedy, based on the novel by \"Jurassic Park\" author Michael Crichton.\n\nTo start this off, I'll lay down the basic plot of the movie: TraviCom is a major electronics/telecommunications company based in Houston, Texas that sends an expedition to the Congo rain forest in Africa. The expedition's goal is to search for a deposit of extremely valuable, rare diamonds that, in the hands of TraviCom, will change the telecommunications industry overnight. However, SOMETHING slaughters the entire expedition party, and that includes the son of the company CEO that TraviCom employee Karen Ross loves. At the insistence of her boss, Karen Ross links up with Peter Elliot, a California primatetologist and his female gorilla, Amy (whom Peter has taught to paint and speak sign language with the help of an electronic glove).\n\nOnce the new expedition reaches Africa, they bring on board Monroe Kelly, a \"great white hunter who happens to be black\" and a Romanian philanthropist named Herkemer Homolka. The expedition faces its fare share of obstacles before finally reaching its destination; the fabled lost city of Zinj, home to the same rare diamonds that the first TraviCom expedition was looking for. Unfortunately for the protagonists, the city of Zinj is home to something deadly: genetically mutated carnivorous gray gorillas, created and trained by the ancient people of Zinj to guard the valuable diamonds. Once the gray gorillas make themselves known, the explorers learn that in the African Congo, YOU ARE THE ENDANGERED SPECIES! If you love Michael Crichton or any movie that takes place in the jungle, this is the movie for you! The story is a well-translated yet slightly different telling of Crichton's story. The characters are well-defined and the acting is on a scale of 1 to 10, a 7. The late special-effects wizard Stan Winston uses amazing, realistic costumes with animatronic masks to breathe life into the signing gorilla Amy and the terrifying gray gorillas. Amy herself is a great character brought to life by both Stan Winston's robotic ape mask and the suit performer who brought out Amy's signing skills out really well. All in all, I love this movie, and everyone who gave it a negative review needs to find a better line of work! Most of \"Congo\" is flawless with two exceptions. One: for a suspense movie, there were only a few scenes of pure suspense and mostly action. There needed to be more scenes of suspense (such as the gray gorillas picking off people without anyone else knowing or more scenes of pure quiet that could've suddenly exploded with a scare). Also, the origin story of the gray gorillas was merely brushed over and not explained in full. There needed to be a fully-detailed explanation of the gray's origins, such as clues throughout the city that would lead up to the discovery of their origins or an autopsy scene to determine what kind of ape they really were.\n\nBesides those two flaws, the rest of \"Congo\" is pure Crichton, pure adventure, and pure fun. I highly recommend this movie to anyone who loves Crichton and good-old-fashioned jungle adventure stories."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "m-47826",
        "review_rating": "3",
        "review_title": "Not striking gold twice.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "mrwarcriminal",
        "review_rating": "7",
        "review_title": "Much better than rated",
        "review_detailed_main": "I really like IMDB. The user reviews are more often than not very agreeable with mine (user reviews anyhow). This is a movie that is much better than its rating. Its no Jurassic Park or Independence Day but it is a fun ride. Excellent cast & they are doing a good job playing their parts convincingly. It has a good pace, lots of action & a pretty good mystery. I liked this movie when it came out & still enjoy it today. This flick is a solid 6.5 but there's no halves so it's gotta be a seven because it's definitely not a six. My six to sevens are movies I enjoy, watch multiple times but fall short of outstanding. 8-9 are Star Wars, Jaws, ET, Jurassic Park, Saving Private Ryan, Sling Blade, Harry Potter, one Flew Over the Cuckoos Nest & a 10 is Empire Strikes Back, Episodes like GOT The Red Wedding just for reference. Give it a chance if you're looking for something to watch. Plus I love Laura Linney. I think she's as pretty as a woman can be when she lets her hair down. Those dimples just kill me."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "\"Congo\" Was Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "UniqueParticle",
        "review_rating": "8",
        "review_title": "Awesome under appreciated sci-fi!",
        "review_detailed_main": "Great unique adventure with a wonderful cast! Laura Linney and others are great. Intriguing story about a talking chimpanzee and potentially finding goodies in the Congo among other things. Unfortunate this movie hasn't been more known although it's got cliches, it's still better than a bunch of other adventure flicks. Surpassed the F-Bomb limit of 2 it was lucky to be rated PG-13."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "hbs",
        "review_rating": "7",
        "review_title": "it's a Jungle Jim movie",
        "review_detailed_main": "This movie is the opposite of art, but it still works for me. I was a big fan of the Republic \"action serials\" that a local TV station ran on Saturday mornings along with Tarzan/Jungle Jim movies and cartoons. I still like things like Commando Cody and \"The Red Skull\", which is why I liked \"The Rocketeer\" and was disappointed that they didn't make a sequel. This movie is of the same genre, but no one involved was even slightly serious when the made it (unlike, say, \"The Rocketeer\"). It's based on a typically idiotic Michael Crichton novel, and the people making it had the good sense to just have fun with it. (With the exception of \"The Great Train Robbery\", I can't think of a single one of his books that hasn't made a truly awful movie which becomes instantly dated.) I think that this is a junky classic."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "artzau",
        "review_rating": "3",
        "review_title": "Disappointing-- possible **SPOILER**",
        "review_detailed_main": "It's hard to believe that the same guy who wrote Jurassic Park, The Andromeda Strain, Time Line and Eaters of the Dead (The 13th Warrior) wrote this container of once used fetid dog food. The premise of the story is bad enough, i.e., apes who learn American Sign Language are able to vocalize through technology but moreover, they retain arcane knowledge that is revealed in their art. But, hey. It's fiction-- even if it's bad fiction. So, for what Crichton was able to do so imaginatively for Jurassic Park fell on its face in this one. OK. Who wins them all? But, then Congo the movie shows up at the theaters and I'm dumb enough to buy a ticket. Whereas the book merely stunk, the movie reeked. Laura Linney was lovely but miscast as a corporate mercenary, Dylan Walsh was completely unbelievable as the primatologist and then the usually wonderful Tim Curry was dreadful as the eccentric Homolka. And, it goes down from there. Storywise, corporate greed in the background of Central Africa's unstable, violent and often brutal politics. My advice is don't rent it and you're watching it on TV on the late show or a rainy day, see if you can find an old rerun of I Love Lucy. It'll be much more entertaining and so much better written."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "enthusiast",
        "review_rating": "",
        "review_title": "Fair to good adaptation of the novel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Aaron1375",
        "review_rating": "3",
        "review_title": "Ugly movie...go away!!!",
        "review_detailed_main": "This is just one of those movies that continually make you groan and that I wished was over. The problems are many and the good points are few. I feel the main problem with this movie is that it has what amounts to a cheesy plot and they try to make it out to be a epic movie, which a movie about super evil monkeys and smart ones that sign just is not epic, it is cheese. When you have cheese you make the movie more fun. Granted, the final scene with the monkeys and that laser was very nice to watch and more of things of that nature was needed. Instead the actors are doing such a serious job that you feel the movie just has a corny plot amid all the serious tension the movie is trying to set up. The plot revolves around a woman trying to find what happened to her missing ex-husband while also searching for some sort of legendary diamonds. She uses these two guys who trained an ape to do sign language and now wish to return her to the wild as cover to get into the country and begin the mediocre adventure of a lifetime. The only things that make this movie somewhat tolerable is Ernie Hudson's character and the laser attack at the end."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ozthegreatat42330",
        "review_rating": "6",
        "review_title": "Frankly my dear I am not all that impressed.",
        "review_detailed_main": "Congo has some cute moments, but it is simply not a great moment, other than Joe Don Baker's histrionics, plugged in directly from a James Bond film or two, and Ernie Hudson's character, this was a film with no star power, which is not always a bad thing, but also a poor script and bad directing, which fails to pull it all together. Add to that Tim Curry's one dimensional performance (he is always the wimpy slug, villain under the rock kind of character.) Give the poor guy a hero role for once so he can really surprise the audience. The character of AMy was about the best acting in the film, and you have to give good marks for the scenery and the sound score. All in all, though, it could have been better, perhaps with a few actors with more name recognition."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Prismark10",
        "review_rating": "3",
        "review_title": "Down in the jungle",
        "review_detailed_main": "Congo is a silly safari adventure. Almost King Solomon Mines meets Jurassic Park (with wild apes and gorillas instead of dinosaurs.) Based on a Michael Crichton novel, this was made when Crichton was hot property back in the 1990s.\n\nDirector Frank Marshall better known as a producer for Steven Spielberg movies was not a strong enough director to make a serious adventure film opting accidentally for camp and cheese.\n\nWhen an expedition to discover rare diamonds in the Congo go missing. A scientist is sent in to find out what happened especially as one of the missing men was her fiancé. She joins a crew that consists of a primatologist who is taking a trained talking gorilla back to the wild and a Romanian treasure hunter trying to locate the lost city of Zinj.\n\nWhen they arrive they meet their expert guide but are captured by a local militia leader and have to bribe themselves out of trouble.\n\nThe guide tells the group that other expeditions to find the 'Lost City of Zinj' have ended in disaster.\n\nLaura Linney and Dylan Walsh are bland in the lead roles, out-acted by the talking gorilla.\n\nIt is left to Tim Curry to ham it up as the Romanian Herkermer Homolka and Ernie Hudson in the great white African adventurer role, Captain Munro Kelly who happens to be black with an English accent. He steals the show in an otherwise bad movie."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "viamillitaris",
        "review_rating": "7",
        "review_title": "Fake",
        "review_detailed_main": "Moon river, Lucy Liu and diamonds're forever. I still remember the punch line one of the main characters in this movie when he said that The Hidden Temple of King Solomon had never existed, so he had to buy diamonds in Tiffany like everybody else. Tim Curry, vampire Clown from Steven King's most popular book is so scary even without make up like in movie It (1990th ). In this movie he plays Romanian explorer who thinks that The Hidden Temple is full of diamonds which protect killer monkeys."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Barney035",
        "review_rating": "3",
        "review_title": "What a waste of money and talent !",
        "review_detailed_main": "I just watched Congo on DVD.In most cases I love these kind of movies but this one is different. It made me write my first comment for a movie on IMDb. I was amazed how such a team of experienced filmmakers could come up with this movie as a result. You can see there was a lot of money for this production but you can't make a good movie if you don't have a good script. And as a producer Frank Marshall gave us plenty of great movies to watch; he never should have tried to become another Spielberg. This one shows how hard it is to make a good movie, maybe you've got all the ingredients but if you can't cook stay out of the kitchen. If Can make a suggestion don't spend your money on this one. If you want to see it watch it on television first and make up your own mind."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "hysteresis101",
        "review_rating": "7",
        "review_title": "Movie accuracy",
        "review_detailed_main": "Given the amount of technological aspects of the authors works, its hard to adapt a movie perfectly. Although I saw the movie for the first time when I was about 10 and fell in love with it. Later when I was in college I decided to read the book. First of all I was pleased and displeased with the movies accuracy. The movie tells the story and the story alone. The details of the movie can never be told except in the book. Basically the story is a guy wants a diamond, someone goes after it, but the real story is in the book. I've read many of the authors works. and the films can never convey what he really meant, Although I think this movie was a better adaptation than say Jurassic Park. The story was kept as accurate as possible given the time the movie was limited. MANY elements were omitted, and side plots were almost non-existent,such as the almost complete involvement in achieving the diamond before rival companies, but in the respect of movie goers who have never read the book, it can provide entertainment and all is well. I personally loved this movie, it was a great achievement and I hope people will enjoy the story."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Africanist",
        "review_rating": "1",
        "review_title": "It should have been marketed as a comedy.",
        "review_detailed_main": "I'm sorry to have to say that as my honest impression, when I know the film makers were serious about what they were doing, but I just couldn't stop laughing by the end of this movie, and neither could my wife. It was so bad it was just bad. I have to give it one star for making me laugh so hard, but that's all."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Guran94",
        "review_rating": "10",
        "review_title": "Why is this movie so underrated?",
        "review_detailed_main": "Why can't movie fans rate a truly great movie like this one and rather prefer Mortal Kombat created in the same year consisting of a completely worse technical side? I'll start from the beginning.\n\nFirst of all, this movie is one of my favorites without any doubt. Similarly like Jurassic Park, even Congo means my childhood to me with amazing experiences spending with this movie.\n\nHonestly, Congo is not for everyone, it contains a lot of brutality, scary moments, sometimes there are comedy elements or just steps of adventure. Besides, I have never understood why people do not like this one, although it has everything that a good movie must have. It is full of perfect CGI, which honestly in that time of creation looked better than comparable with nowadays Jurassic world or other kinds of those movies. Great soundtrack Spirits of Africa by Jerry Goldsmith who's known from Rambo. Actors were pleasant. Ernie Hudson played James Bond in the jungle, Dylan Wallsh a young scientist, who learns gorillas talk with help of modern technology of science, Laura Linney fiancee of Bruce Campbell and Tim Curry as Homolka longing for gold, then what's wrong with Congo? As I mentioned, the plot deserves praise. We have an impressive story about the relationship among a human and a gorilla, however at least this fact was supposed to be rated. To be honest, nothing is wrong with Congo and the filmmakers have done a great job.\n\nI did not find any mistakes I would have to say any bad words for. Maybe if the critics want, the weakest part of Congo belongs to Laura Linney, I would have supposed someone else instead of her, she's not a good actress, but it's too small a problem in order to decrease my ranking."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "kathymcc123",
        "review_rating": "7",
        "review_title": "Good movie with a whinny character",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jdb111001",
        "review_rating": "1",
        "review_title": "Over 200 People gave this a ten?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "tedg",
        "review_rating": "",
        "review_title": "Old Eye, New Eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Mr-Fusion",
        "review_rating": "4",
        "review_title": "I should've gone with the Rifftrax version",
        "review_detailed_main": "I remember going to see this in 1995 (and who with) but details about the movie have always been hazy. I know I walked out of the theater not really sure why I didn't like it, and there's a scene with Laura Linney and some lasers. That's all I remember.\n\nWhich is probably for good reason because it's not very good. You can see the kind of matinee jungle movie they were going for, but they never really *went* for it. There are moments of weirdness sure, but they're few and far between; bizarre line readings, funny accents and whatnot. \"Congo\" has the ingredients for a good bad movie, it just can't quite make the sale.\n\nI did get my hopes up when Ernie Hudson appeared in full adventure mode (he's really the best part), but things just flatlined from them on.\n\nY'know what would've really helped throughout this? Bruce Campbell, the '90s b-movie king. He's here for like two minutes, criminally underused. It's \"The Hudsucker Proxy\" all over again."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "pgetugi",
        "review_rating": "7",
        "review_title": "Was the name Helkemer Homolka inspired by Heinrich Himmler!",
        "review_detailed_main": "I find the two names Helkemer Homolka and Heinrich Himmler rhyming, even in some cases the mannerism, mental state and don't care attitude to people lives-that is when i watch the movie and read about Himmler. When you read History of Third Reich and the second world war: when Himmler's arrest and conviction was imminent for crimes he was party to, too well-he still thought he could negotiate and become the post war German minister of police! Mr Homolka could see death in his eyes but could not let go of his diamonds! Is the rhyming deliberate or merely coincidental Nevertheless Homolka is very funny, especially when he tells Kelly to call him Mr Homolka and not his first name (Helkemer) in retaliation for his earlier rejection by Mr Kelly to allow (Homolka) use his first name."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jewgirl952-627-809996",
        "review_rating": "2",
        "review_title": "More psychological thrilling than anything",
        "review_detailed_main": "I had high hopes for this movie due to the cast of stars. However, I'm very disappointed, because the so-called terror is in the mind, not on the film. It's scarier watching people on a roller coaster!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "epauljohnson",
        "review_rating": "6",
        "review_title": "People realize this is based off of a book, right?",
        "review_detailed_main": "Based on a lot of the really high reviews, I'm guessing they don't realize the film is based off of a book. Saying \"the story line is pretty decent\". The book is great. The movie as a stand alone is pretty decent, a lot of the movie seems really rushed and trying to wrap it up quickly."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jhaggardjr",
        "review_rating": "4",
        "review_title": "Stupid, but never boring",
        "review_detailed_main": "\"Congo\" is without question the silliest adventure film I've ever seen. It's a badly made film even though it's never boring. And boy did I laugh out loud while watching this! It's incredible at how unintetionally hilarious this movie is. \"Congo\" is a movie so ridiculous, so stupid, so idiotic, and so dumb that I found myself cracking up during many scenes. The plot of \"Congo\" is about an expedition that goes into the jungles of Africa who come face-to-face with killer gorillas. Since it's a waste of my time to explain the rest of the goofy plot, I just get down to what's good and bad about \"Congo\". Here's the good stuff. As far as the cast goes, there are only two good performances turned in by Laura Linney as the communications expert looking for her fiance who's disappeared in the African jungle and Ernie Hudson as the group's tour guide. Plus, some of the African scenery looks beautiful with the cinematographer of \"E.T.\" (Allen Daviau) doing the honors here. Now here's the bad stuff (and there's alot of it). The worst acting honors for \"Congo\" go to Tim Curry who gives one of the most laughable film performances of all-time. Curry, speaking with a bad foreign accent, plays a Romanian fortune hunter obsessed with finding a long lost city that Hudson believes does not exist. Another silly character in the film is Amy the talking gorilla, who when having a special speaking device on talks with a schoolgirl voice that's sounds absolutely ridiculous. The screenplay by John Patrick Shanley (based on Michael Crichton's novel) has alot of preposterous dialogue. And it's hard to imagine that Frank Marshall directed this. Marshall, who's first directing effort was the very good horror/comedy \"Arachnophobia\", is a protege of Steven Spielberg. Spielberg, Marshall, and \"Congo\" producer Kathleen Kennedy (Marshall's real-life wife) developed Spielberg's production company Amblin Entertainment during the '80s. Marshall as worked with Spielberg on some of the biggest box-office hits of all-time (he produced the \"Indiana Jones\" trilogy) and scored a huge box-office hit last year on his own as co-producer (with Kennedy) of \"The Sixth Sense\". But I have no idea what Marshall was thinking of when he made \"Congo\". It should have been a thrilling adventure tale but instead turns out to be a comedy of epic proportions. Marshall directed this as if it's a really serious movie. If it's supposed to be serious, why is it so funny? I was constantly laughing at the Tim Curry character because he's made out to be a nut; same goes for the talking gorilla. \"Congo\" has a couple of good things going for it, but it's just too ridiculous.\n\n*1/2 (out of four)"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "MrPaull0324",
        "review_rating": "6",
        "review_title": "Tons of Cheesy Jungle Adventure Fun",
        "review_detailed_main": "This is one of my many guilty pleasures as far as action movies go, probably because I have a preference for jungle adventures in the vein of Tarzan; especially if there's a lost civilization involved.\n\nThe film is based on the 1980 novel by Michael Crichton, which I've read and consider superior to this. TraviCom scientist Dr. Karen Ross (Laura Linney) is sent deep into the Congo rainforest to locate her missing ex-fiancé, Charles Travis (Bruce Campbell) by his father RB Travis (Joe Don Baker), who is after a rare diamond that can revolutionize the communications business. Coincidentally, Dr. Peter Elliot (Dylan Walsh) seeks to bring his sign-language speaking mountain gorilla Amy (voice by Shayna Fox) back to Africa, joined by Romanian philanthropist, Herkermer Homolka (Tim Curry) who is after the lost city of Zinj where the diamonds are located. And so, the two parties meet up, and are led by Captain Monroe Kelly (Ernie Hudson) on a dangerous expedition to find the diamonds.\n\nThe acting ranges from stale to hilariously cheesy. Dylan Walsh was indifferent throughout the movie and has a blank expression on his face, even when he's shooting at the Zinj gorillas. It might have been better if Bruce Campbell played Dr. Elliot instead. Laura Linney is a decent action lady, but she looks puzzled at times and speaks her lines awkwardly. Amy is annoying and she soured the experience for me. It's Tim Curry and Ernie Hudson who carry the film. Curry is so over the top cheesy, you'll love every second he spends onscreen, and Hudson is great with his badass and wise-cracking Clark Gable impersonation. They're obviously fake Romanian (Curry) and British (Hudson) make them even more enjoyable. There are also a few notable cameos, like Delroy Lindo as Captain Wanta with his legendary meme \"Stop eating my sesame cake!\".\n\nThe filming locations ranged from California, Costa Rica, Tanzania, Kenya, and Uganda. The scenery and set designs were impressive, with Matte paintings and miniatures used for the beautifully lush Congo jungle and the city of Zinj; the collapsing ruins and emerging lava pits during the climatic volcanic eruption were the best looking of all.\n\nThe creature effects and designs weren't perfect either, despite Stan Winston being in charge. While Amy and the wild, lowland gorillas and Hippo animatronics look good for 1995, the Zinj gorillas were obviously a mixture of puppets, suits, and animatronics. To be fair, though, CGI was not yet developed enough at the time to make realistic looking gorillas, so this is excusable.\n\nThe action scenes were quite enjoyable. From the frightening, night-time hippo attack to the final battle inside the mines against the Zinj gorillas, the movie doesn't disappoint in keeping the audience hooked. The sound effects were intense and cool sounding, like gunfire and intimidating animals' noises, such as Hippo bellows, birds cooing, and the Zinj gorilla snarls.\n\nStill, if the bad acting and dialogue is too much for you, you might want to try reading the novel instead."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "AaronCapenBanner",
        "review_rating": "4",
        "review_title": "Diamonds & Apes.",
        "review_detailed_main": "Based on Michael Crichton's novel, film is about a research/rescue team sent into the African Congo, and led by Dr. Karen Ross(Laura Linney) that includes Dr. Peter Elliot(Dylan Walsh) who has with him a talking gorilla(due to a new technology in her larynx). Tim Curry and Ernie Hudson play devious characters who are also along for the mission. They are sent to locate the first research team that had apparently located some large and pure diamonds that are worth a fortune to the company funding the expeditions. Complicating matters are the instability of the local government, and a rumored mythical race of apes said to live deep in the jungle. As it turns out, they are no myth...\n\nLightweight adventure yarn is watchable to a point, but too silly and outlandish to succeed, though it remains innocuous."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "toman1kf",
        "review_rating": "10",
        "review_title": "Whats a summary?",
        "review_detailed_main": "Apes and lasers, thats all.\n\nErnie Hudson kicks some behind(edited).\n\nSo does Tim Curry.(of course) I need more \"lines\" i guess.\n\nHeres one.\n\nThis 10 line requirement is oppressive and unfair. Aparantly, our corporate masters at the so called \"IMDb.com\" believe that you all are their slaves. Will we take this? NO! The proletariat shall rise, IMDb.com. The proletariat shall rise.\n\n9 lines.\n\n10 lines, further mucker.(edited)"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "EmperorNortonII",
        "review_rating": "6",
        "review_title": "Putting the \"Gore\" In \"Gorillas\"",
        "review_detailed_main": "I thought \"Congo\" was a little far-fetched as far as sci-fi goes. It's a little hard to swallow a movie with a talking gorilla, even if she needs computer technology to give her speech. There was a little lore about the fabled King Solomon's mines that held my interest. But it was the violence that turned me off. It was about as ugly as the deformed attack gorillas. And Tim Curry seems to be playing a hack villain, as the heavily-accented Herkimer Homolka. I'd say the original novel by Michael Crichton has to be a better book than this movie!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "frenchdi",
        "review_rating": "3",
        "review_title": "Stick to the book",
        "review_detailed_main": "What made Congo so bad was where they made a major deviation from Crichton's book. Rather than a brilliant individual making big mistakes under pressure, we got a psychotic madman for a boss."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "Bedtime for \"Congo\".",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Z3R0",
        "review_rating": "2",
        "review_title": "VERY bad movie of a VERY excellent book",
        "review_detailed_main": "It is a shame that such a great book was turned into such a terrible movie. I could not wait to see this movie after reading the book....it really did not do it justice."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "tbills2",
        "review_rating": "6",
        "review_title": "The Congo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "randy_gibson",
        "review_rating": "2",
        "review_title": "Worst Adaptation Ever?",
        "review_detailed_main": "This is one of Crichton's best books. The characters of Karen Ross, Peter Elliot, Munro, and Amy are beautifully developed and their interactions are exciting, complex, and fast-paced throughout this impressive novel.\n\nAnd about 99.8 percent of that got lost in the film. Seriously, the screenplay AND the directing were horrendous and clearly done by people who could not fathom what was good about the novel. I can't fault the actors because frankly, they never had a chance to make this turkey live up to Crichton's original work. I know good novels, especially those with a science fiction edge, are hard to bring to the screen in a way that lives up to the original. But this may be the absolute worst disparity in quality between novel and screen adaptation ever. The book is really, really good. The movie is just dreadful."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "mrossman-89850",
        "review_rating": "6",
        "review_title": "An ok flick",
        "review_detailed_main": "Really wish it was as good as the book. Good actors though."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Split_Image",
        "review_rating": "1",
        "review_title": "Congo\" is a failure of imagination",
        "review_detailed_main": "Review of Congo (1995)\n\n\"Congo\" isn't just bad-it's a catastrophic misfire that manages to insult its audience, squander its talented cast, and embarrass everyone involved. This movie is proof that even with a budget, source material by Michael Crichton, and a stellar team of actors, you can still create an irredeemable disaster.\n\nLet's start with the biggest tragedy: Tim Curry. A brilliant actor with an illustrious career, Curry is reduced to a cringe-worthy caricature as Herkermer Homolka, a role so cartoonishly absurd it feels like a practical joke. Watching him slum through this embarrassment with a bizarre, unplaceable accent is painful. Curry deserved better than to be forever associated with a film where a talking gorilla named Amy, equipped with a robotic voice glove, is one of the more grounded elements of the story.\n\nAnd then there's the plot-or rather, the lack of one. The film promises an adventure into the depths of the Congo, filled with danger, mystery, and lost cities, but instead, it delivers endless incoherence. The CGI gorillas are laughably bad, even by 1995 standards, and the climax involving \"killer gorillas\" is so anticlimactic it feels like a cruel joke. Let's not forget the laser-shooting diamonds-a plot device so ridiculous it belongs in a Sharknado movie, not a pseudo-scientific thriller.\n\nThe tone oscillates wildly between attempted seriousness and unintentional comedy. Laura Linney's character is a cold corporate archetype without depth, Ernie Hudson tries his best as a charismatic guide but is bogged down by a nonsensical script, and Dylan Walsh might as well have been replaced by a block of wood.\n\nAny critic who gave this movie a positive review needs to sit down, stare into the void, and reassess every life choice that brought them to that point. Did they see the same movie? Did they fall asleep and dream of a better one? Or were they simply paid off by the filmmakers?\n\n\"Congo\" is a failure of imagination, execution, and basic dignity. The only mercy is that it eventually ends, though not without taking two agonizing hours of your life you'll never get back. Tim Curry, if you're reading this: we're sorry this happened to you. We truly are."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "brian3451",
        "review_rating": "1",
        "review_title": "Oh man...",
        "review_detailed_main": "I'm still waiting for this to end. This movie is not good."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "rdoubleoc",
        "review_rating": "10",
        "review_title": "One of the greatest movies ever.",
        "review_detailed_main": "If I was a film critic, this film would definitely be in a lot of top 10 lists.\n\nIt's just so well-made, and has a great plot. Almost every scene is fascinating.\n\nI really cannot explain the low ratings for this movie, as it was a popular hit when it was released (I saw it in the movies, and the audience definitely liked it). I think online reviews are manipulated by big companies, like everything else, which is why I'm leaving this review.\n\nGREAT MOVIE. And I'd defend that with my life and reputation."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "dwpollar",
        "review_rating": "5",
        "review_title": "Entertaining at times, but pretty predictable",
        "review_detailed_main": "1st watched 9/6/1997 - 5 out of 10(Dir-Frank Marshall): Entertaining at times with interesting special effects, but the rest of the time the whole story was pretty predictable and muddled with too many subplots."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Goriot",
        "review_rating": "",
        "review_title": "Journey into mundane!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "thesar-2",
        "review_rating": "3",
        "review_title": "Oingo Congo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jr2187",
        "review_rating": "2",
        "review_title": "It's bad. It's really bad.",
        "review_detailed_main": "Films like Congo make we wonder \"Was the director on acid or did he just give no regard for the film's wellbeing?\""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "CinemaSerf",
        "review_rating": "5",
        "review_title": "Congo",
        "review_detailed_main": "Now I'm usually a fan of Tim Curry but quite what he is doing in this rather weak and feeble hybrid of \"Tarzan\" meets \"King Solomon's Mines\" is anyone's guess. It's all about the search for a lost expedition that was being led by the son of an American industrialist who was seeking diamonds large enough to power a laser (ostensibly for communications purposes, but who really knows?). Anyway, they disappear so it falls to Curry and Laura Linney's \"Dr. Rees\" to follow the sagely guidance of the Quatermain-esque \"Kelly\" (Ernie Hudson) deep into the hostile terrain of the jungle. It's got just about everything required to make it flop, this film. Terrible acting, even worse dialogue - and that's just from the chatty gorilla that all too often saves the day - and some very cheap and cheerful CGI that merely serves to showcase the poor nature of this derivative and rather unremarkable effort. Curry (\"Homolka\") is just not at the races here and Linney brings very little by way of gravitas to her over-scripted role either. It's rated 12 - but perhaps that's referring to the maximum IQ of anyone whom they are hoping will watch? I wouldn't bother if I were you."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "capone666",
        "review_rating": "5",
        "review_title": "The Vidiot Reviews....",
        "review_detailed_main": "Congo\n\nThe reason humans teach gorillas sign language is so they can tell them to release the human child unharmed.\n\nApparently though, the apt ape in this thriller is only hostile towards female competition.\n\nPrimatologist Peter (Dylan Walsh) takes his talking gorilla Amy to Africa after she has a prophetic dream. Along for the ride are an electronics expert (Laura Linney), a philanthropist (Tim Curry) and a local guide (Ernie Hudson), each with their own motive.\n\nEventually Amy's drawings lead the party to a cache of diamonds that have been protected by a race of vicious grey gorillas for ages, including a powerful blue diamond.\n\nWith a laughable premise and even more pathetic special effects behind the man in the monkey suit, this adaptation of the Michael Crichton novel is a low point of 1990s cinema.\n\nLastly, why teach a primate sign language when it's easier to get them to text? Red Light\n\nvidiotreviews.blogspot.ca"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Movie Nuttball",
        "review_rating": "10",
        "review_title": "Congo is a great adventure!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Ben_Cheshire",
        "review_rating": "3",
        "review_title": "Jurassic Park III with Gorillas",
        "review_detailed_main": "Congo is like Michael Christon remade Jurassic Park but with Gorillas being violent and testing the perimeter and killing people and such\n\nYour first hurdle here is that for most of the running time, a gorilla is very clearly being played by a man in a suit. And everyone acts like its a real Gorilla. Then there's the wristband that interprets its gestures into a Stephen Hawking voice and says things a baby would want. Then there's the irresponsible stuff: Gorilla is given a martini, his carer says \"she's allowed one.\" Gorilla is given a cigarette, against her carer's wishes, so he tells her \"Don't inhale!\" I hope nobody uses this movie as a guide to good Gorilla management because who-ee... Then there's the dialogue. Like, there's a sort of heavy type played by Ernie Hudson, who tells the heroes \"I'm your great white hope, I just happen to be black.\" Just non-stop relentlessly bad writing. Dylan Walsh is a complete absence. He is a massive black hole. He's like that character in The Mighty Boosh where people look at him and don't see a face. I'd say the movie suffers 50% total quality degradation because of this guy. Laura Linney is Laura Linney: you're either in camp Laura Linney or you're most moviegoers and would rather it wasn't Laura Linney. I personally would rather it had been Renee Zellweger or Adrienne Barbeau or some dude. Laura Linney is again more minus value. From my perspective, there's nobody in this who is worth watching.\n\nIf this were a movie by the Wayans brothers, I'd probably be giggling. Congo definitely falls into that \"so bad its good\" category, because its made with slick Hollywood filmmaking, and just happens to feature a string of situations and dialogue so ridiculous they provide a good laugh.\n\nWell, I think I've made my point. This is not good."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "scotty-38",
        "review_rating": "",
        "review_title": "WHOA! My my my!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "reverson",
        "review_rating": "2",
        "review_title": "Awful Movie",
        "review_detailed_main": "Yes, I watched it all the way to the end, but what an awful movie. Predictable, unbelieveable, bad script, uneven direction and tempo. There is nothing about this film that I can recommend. Not sure how I made it all of the way through."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "violinjoe",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "This was a horrible book. It was an even more horrible movie. Do not watch this movie. If you find a video or DVD of it, buy it and have a burning party."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "adamrager40",
        "review_rating": "4",
        "review_title": "Ok",
        "review_detailed_main": "Fake accents. Horrible. But movie ok. Interesting story."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "mrs-61102",
        "review_rating": "3",
        "review_title": "1995's Congo is Still To This Day One Great Adventure Of a Film Packed With Action, Suspense Moments And At Times a Good Story.",
        "review_detailed_main": "When Groups Of Very Different Peoples Are On a Quest To Return a Talking Gorilla To Her Born Place in The Jungle But Along The Entire Group Encounter Dangerous Situations From Jumping Out Of a Cargo Plane With Wearing Parachutes, Meeting Hippo Eating Animals And Finally Meeting The Entire Evil Gorilla Family. Get Ready To Go On a Thrilling Adventure With These Group Of Expedition Explorers As They Find Themselves in Extreme Danger. Based On The Novel By Michael Crichton The Arthur Of \"Jurassic Park\" Congo Stars Laura Linney, Dylan Walsh, Ernie Hudson, Jon Don Baker, Adewale Akinnuoye-Agbaje, Tim Curry And Three Special Appreance By Delroy Lindo, Joe Pantoliano And Bruce Campbell, Jerry Goldsmith Who Did a Very Terrific Great Score And There's Stan Winston Who Created All Of The Gorilla Effects For The Film."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "CreeCart",
        "review_rating": "10",
        "review_title": "A movie that will make you laugh. It has some nice scenery and good special effects xcept for the apes lol!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "paulclaassen",
        "review_rating": "4",
        "review_title": "No brainer adventure comedy.",
        "review_detailed_main": "Let's face it; 'Congo' is not a great movie. It is laden with so many flaws and with so many out of place humorist elements - and Tim Curry's comical acting and bad accent - this might be regarded as a comedy, and not the action adventure they were (probably) aiming for. Along with Tim Curry's character, Ernie Hudson was also along for the ride as comic relief.\n\nYes, there's lots of action and adventure and mystery - in the vein of an Indiana Jones movie or 'Romancing the Stone' or 'Jewel of the Nile'. At times, there's just too much humor - so much so that nothing here can be taken seriously. I'm also not sure I like the idea of a talking gorilla. The visual effects were also mediocre, at best.\n\nDespite all the flaws, 'Congo' is still a rather exciting adventure movie, and I do love adventure movies. I suppose this is the type of movie where you're guaranteed to have a good time if you switch off your brain cells. Don't take it seriously, get the popcorn and sit back and enjoy the ride."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "roland-27",
        "review_rating": "",
        "review_title": "Too Violent For Kids But Too Kiddish For Adults",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Ameliex",
        "review_rating": "5",
        "review_title": "Entertaining movie",
        "review_detailed_main": "This movie isn't exactly a Oscar award movie or anything. In the beginning I kept thinking should I turn it off or continue watching. I am glad I continued watching. It is an entertaining movie. It isn't the best but if you are bored one day and like gorilla movies, then this movie is for you. There are scenes that are ridiculous. Some effects are really bad. But it is also a heartwarming movie. Especially the connection with the gorilla ''Amy''. I did enjoy watching this. The gorilla Amy made me continue to watch this movie. Amy was so cute, even if you could tell it is fake etc. Overall an entertaining movie."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "DrLex",
        "review_rating": "3",
        "review_title": "Oh my God, I actually watched this!",
        "review_detailed_main": "This is interesting: I was referred to this movie through another movie's reviews. I was quite sure I never watched this one and I wanted to see why this was supposed to be a bad movie. I still remember the stupid commercials on the radio in 1995 which tried to hype this movie as thrilling and exciting.\n\nNow comes the fun part: after reading a few of the reviews, I started to realize that I have actually watched this movie! This is interesting since there is absolutely no connotation in my brain between the title \"Congo\" and the kind of junk I remember having watched. This ought to mean that the movie was so crappy that I even refused to identify it and just tossed it in my brain's junkyard. I vaguely remember being mildly entertained by the silliness and the cheesy effects of this movie, and the impression of a bunch of mental institution patients trying to re-enact scenes from \"Indiana Jones\". Because I remember having laughed at all this silliness, I still give it a 3.\n\nMy only explanation is that the flashy commercials have caused my brain to imagine a much more exciting movie than it actually was, to such a degree that I refused to believe the thing I watched really was the movie \"Congo\"."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "snwbatz",
        "review_rating": "4",
        "review_title": "A movie that delivers on nothing it promises.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "nybred4",
        "review_rating": "8",
        "review_title": "To overthink this movie gets one nowhere.",
        "review_detailed_main": "Congo reminds me very much lake Placid. It serves up a generous portion of belly laughs. And why not. The talent at hand is willing and capably. And the fact that the flick does not take itself too seriously, is a relief for all concerned. Same as in Lake Placid, which is funnier and peppered with more belly laughs than Congo. The movie's got a quick pace that I found to be \"just right\" with all players having purpose and the main players risking plenty. If, after 30 minutes, you're looking for something more than silly fun, you're a dope. If you're looking for lots of fun, sit back and smile. I loved it."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "vcspike",
        "review_rating": "8",
        "review_title": "A simple, fun, adventure.",
        "review_detailed_main": "I remember when this was coming out, I was like 10 or 11, and somehow I learned Bruce Campbell was in it and recently being consumed by army of darkness (then the evil deads), I couldn't wait to see Campbell in a new movie.\n\nWell, for those of u who haven't seen this, I'll just say, he's not the main character. But I enjoyed the movie very much. And to this day, every time I watch this with whomever, I tend to tell that story.\n\nWeird how things stick with u, but it would seem movie lovers tend to remember portions of their lives by what came out and when, and how it made them feel. The magic of film. What u gonna do?"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ABS-13",
        "review_rating": "8",
        "review_title": "Great B-Movie fun!",
        "review_detailed_main": "The effects are cheesy, the acting is cartoonish and so is the script. But I LOVE this movie for what it is. FUN!! Bruce Campbell has a spectacular cameo, Ernie Hudson and Delroy Lindo have great supporting roles and Tim Curry is hilarious as Herkermer Homolka."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Neverhood",
        "review_rating": "10",
        "review_title": "Best film",
        "review_detailed_main": "I sorry, i writing in czech language. I am from Czech Republic Congo is best film of 1995 year. Good efects, sentry guns is good, Tim Curry is best actor in this film. Fakticky sqìlý filmeèek. Díky re\u009eiséovi za to \u009ee ho natoèil."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "lukem-52760",
        "review_rating": "8",
        "review_title": "A Jungle Adventure Masterpiece From The Beautiful 90's.",
        "review_detailed_main": "I love \"Congo\" i have ever since i saw it at the cinema on that big screen way back in 1995, \"Jurassic park\" was a phenomenal hit & these \"creature feature\" films seemed to have made a comeback, i loved the 90's for movies, this was my era & Congo was a huge film for me!!!\n\nCongo is a fun piece of fantasy escapism & it just brings out the excited kid in me!!! Love Congo.\n\nThe Jungle Adventure movie had a bit of a revival during the 90's with Congo & Anaconda, both are Classic's from my era. I loved watching this big fun popcorn blockbuster at the Cinema. The 90's were amazing for movies, especially big budget B-movie type creature features & Congo is one of the best of that time in movie history.\n\nFirst off i loved the fact that the always underrated Ernie Hudson got a main role as Munroe Kelly & he was so cool as the Hunter/Guide, he made a great leading action hero.\n\nHe has a cool & calm charm & is the best character in the movie & that well spoken British accent was genius.\n\nErnie Hudson has said that this is his best role of his career & i totally agree, it's the best work he's done.\n\nI've liked Ernie Hudson since the Ghostbusters films but of course he was way underused in those but i love his Ghostbusters character Winston Zeddemore.\n\nI would actually go as far as to say that Ernie Hudson is one of the most underrated actors out there.\n\nHe's classed as a \"Character Actor\" meaning he is a bit-part small role acror, but he shouldn't be, given the right film & a chance, he can be great like he is here in \"Congo\" but he is also great in \"The Hand That Rocks The Cradle\" a 90s Thriller & the dark 90s vigilante film The Crow & the Classic Ghostbusters 1&2 & a lot of B-movies but He is always good, no matter how small his role my be. Ernie Hudson is also a very Humble guy that just never got the stardom he deserved, he's a million times better than big \"A-lister\" stars like the Awful \"Tom Cult Cruise\" but for some reason \"Ernie\" never got his true big break? But hey I'm a big fan of the man & enjoy checking out anything if i see his name in the cast, i grew up watching him as the cool, everyman Winston Zeddemore in both Ghostbusters films & from there i just like him & his personality on screen & of course Congo came out & showed me how cool he was as a main leading star!!! But of course it didn't last, i treasure his performances especially in as an average joe blue-collar Ghost buster & as a smooth talking African Jungle Guide taking a team deep into the dangerous Congo.\n\nThe rest of the cast is very good too especially \"Laura Linney\" & \"Tim Curry\" both great actors & give very good performances!!! In fact Congo has one of the best ensemble casts ever with: Bruce Campbell, Laura Linney, Joe Pontaliano, Joe Don Baker, Delroy Lindo, Ernie Hudson, Dylon Walsh, Mary Ellen Trainor, Tim Curry, Grant Heslov & Peter Jason, now that's a Classy Cast right there. Nice seeing all those faces throughout this adventure picture. Congo also has a beautifully touching score by the legendary Jerry Goldsmith. Also lovely scenery & again did i mention an excellent Ernie Hudson. At times Congo feels like very Speilberg & i liked that & it would've considering it's director Frank Marshall has always worked with Speilberg on movies, so some of that magic has rubbed off.\n\nThere also such a nice sense of Adventure in the films tone & atmosphere. Truly i think Congo is way underrated & i like it better than Jurassic Park. There's definitely a cosy & comforting feel to this movie now in 2022, probably the Nostalgia i feel for it & remembering watching it on video in the comfort of my living room.\n\nCongo was Directed by Frank Marshall who had Directed another one of my childhood faves, the 1990 Spider-Thriller-Comedy ARACHNOPHOBIA & I've always loved that film, here the Director uses that fun humour-out-of-fear & scary situations for his Congo film, both have that humour & sense of Adventure, Frank Marshall is a very good Director & has obviously learned alot from his friend Spielberg as he's been his producer on alot of his movies. I grew up on Arachnophobia on video from little & then Congo.\n\nYes the great \"Spielberg\" was producer this time to his friend \"Marshall\" on ARACHNOPHOBIA but didn't on Congo?\n\nThe mutant gorilla effects still look Amazing, animatronics & men in suits, today it would all be c.g.i so I'm very happy it came out in '95!!!\n\nCongo is a big budget B-movie at heart, it's a fun Jungle Adventure & a Creature Feature with a very good cast of unusual actors for a Jungle movie, but the best role & performance in the movie goes to Ernie Hudson.\n\nOne of my personal favourite movies.\n\nA great Jungle Adventure movie, there's heart & a sense of fun, it's pure 90s & should have a \"Cult Classic\" status!!! It's a childhood fave of mine.\n\nERNIE HUDSON is Excellent."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "amityranch",
        "review_rating": "10",
        "review_title": "Congo",
        "review_detailed_main": "I, personally think Congo was an excellent movie. Yes, there was a lot of unbelievable and unrealistic stuff in it, but it was entertaining! Ernie Hudson, Tim Curry And Joe Don Baker All made excellent performances. The music was great as was the scenery. The movie is entertaining and easy to watch. I think every dollar spent making it, showed up in the picture. Congrats to all, especially Marshall & Kennedy! It's east to pick apart a movie but often people don't realize all the work that goes into it. The scenery is especially nice and enjoyable. Ernie Hudson played Monroe Kelly well and believable. Joe Don Baker played a CEO real well too. The Traivs-com headquarters was cool too."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "ashspicefilms",
        "review_rating": "9",
        "review_title": "MUST SEE!! (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jezre_17",
        "review_rating": "8",
        "review_title": "It is good, but it could've had more action",
        "review_detailed_main": "Come on people¡¡¡ it is not that bad. Well, i think that it doesn't deserve a 4. I see this movie for my first time in my house, when i was 10, and i loved it. I was really impressed with the locations, the tone of the movie, and I have to admit that I jumped from my seat when the president's car explode on the airport scene. Now that i´m 18 I still like it, although i think that needs more action sequences.\n\nThe last scene is superb: boiling lava, killer apes, the destruction of the city of zinj, the way all the sets move around, all is very cool.\n\nThe bad thing is that the scene ends, and I'm like: \"What? that's all\" I'm sure that Frank Marshall could've shoot more action sequences. You are staring to get excited and the movie has already ended.\n\nHowever, I'll give it an 8, because it was cool the first time I saw it."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "SquirePM",
        "review_rating": "8",
        "review_title": "Lighten up, everybody!",
        "review_detailed_main": "Congo is a guilty-pleasures movie. If you love watching Ernie Hudson on film, then see this movie. If you love watching bad movies for their HOOTS, see this movie. If you love seeing \"the latest in communications technology\" (a hand-held superlaser) slice through outrageously campy \"white gorillas\" see this movie. ...and it even has Tim Curry with a terrible Bulgar accent, and Joe Pantoliano in an unbilled but entertaining part.\n\nRead all the other reviews here first, and if they put you off don't rent the movie, but I skipped reading the book so I don't care if the movie makes mincemeat of it. Nobody thought they were making great art here. I grin all the way through whenever I watch it."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Mangetou",
        "review_rating": "8",
        "review_title": "Silly, silly romp",
        "review_detailed_main": "Not a serious ounce in this film. From over the top performances through hilarious accents and humourous banter, this film is a charming cheese-fest.\n\nIt is almost as if the initial intention was to make a typically dry Crichton film, but then the good nature of those involved took over and they had a lot more fun. Taking it seriously is clearly a bad idea. I mean - the first actor you see is Bruce Campbell for goodness sake!"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "robertmaybeth",
        "review_rating": "9",
        "review_title": "At only a mere 5 points, this is a sadly under-rated action film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "rivertam26",
        "review_rating": "8",
        "review_title": "Perfectly entertaining",
        "review_detailed_main": "*SPOILERS* Trying to latch onto the blockbuster Jurassic Park franchise, Congo was met with mixed reactions at the summer box office but still managed to be a minor hit. Opening with a sexy Bruce Campbell as its opening kill. We fast forward to ex girlfriend Laura Linney (Exorcism of Emily Rose) going to the Congo to save him. Along with Ernie Hudson (Ghostbusters) donning a cool accent, Tim Curry (Rocky Horror Picture Show) also donning a cool accent, cutie Dylan Walsh (Nip/Tuck) and a friendly talking gorilla named Amy amongst others. The movie is goofy and fun and at times it feels like it's a stage production because of some questionable FX. That being said faults aside of which there are quite a bit from goofy performances to underdeveloped characters and goofy direction to name a few. The movie still works. Its dumb but perfectly entertaining.\n\n4/5"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jonieaglefeather",
        "review_rating": "10",
        "review_title": "Learner",
        "review_detailed_main": "Future advise and outrage adventure! Through the day is nothing like the movies on gorillas today :) \"2021 here!\"\n\n#EpicScene."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Bernie4444",
        "review_rating": "8",
        "review_title": "\"Stop eating my sesame cakes.\"",
        "review_detailed_main": "Herkermer Homolka (Tim Curry) has been looking for the Lost City of Zinj. He is contemplating picking up a few souvenirs when he finds them. Seems that the only one that has been there is Amy (Misty Rosas). However, Amy needs to go home. Her buddy and mentor are economically tapped out. So, they all team up with Dr. Karen Ross (Laura Linney) who just happens to be going in that direction and can afford the travel arrangements. While Karen thinks she is going to save fellow explorers, her boss also has a nefarious plan.\n\nWill Amy go home?\n\nWill Karen find her friend \"alive\"?\n\nDoes the boss's plan come to fruition?\n\nWill Herkermer Homolka get his trinkets or his fingers Zinj'd?\n\nWhat secret does the lost city hold?\n\nLet's face it Tim Curry makes the movie. Not only does he excel in his character but allows others to play off him. Otherwise, this would just be a run-of-the-mill misadventure film. Great accent."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "marcuspalomar",
        "review_rating": "8",
        "review_title": "Sunday afternoon movie",
        "review_detailed_main": "Don't understand the haters as this is a great bit of fun and spot on for a lazy Sunday afternoon.\n\nGet some snacks and a drink and sit back and enjoy.\n\nWon't inspire or shake your soul but it's a great adventure flick with some serious primates who just want to be left alone.\n\nWatching again now and can't wait."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Willard1975",
        "review_rating": "8",
        "review_title": "Hilarious and Wonderful",
        "review_detailed_main": "I'm not going to spoil anything so you can read the synopsis about the plot.\n\nSo i was 20 years old when I first saw this movie. The public Internet was like 5 years old. I was young and impressionable. While the science of the movie is somewhat implausible, it still has a lighthearted story.\n\nGreat VFX for its time. There are a few memorable moments of humor. Tim Curry is hilarious as Mr. Homolka, and the cake scene with Captain Wanta is one of the funniest scenes that has stuck with me all my life.\n\nThe gorilla is well acted, and is adorable. Linney and Walsh do their job well as leads. Hudson, Heslow and a few others do their job as well.\n\nThis is one of the gems from the 90s that you really want to watch, if you can keep away from Facebook, Instagram, TikTok or whatever."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "krakatau-48313",
        "review_rating": "8",
        "review_title": "Adventure in Africa",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Spectator_Consumer",
        "review_rating": "10",
        "review_title": "Bad Acting, Silly Safari-Adventure, Good Time",
        "review_detailed_main": "Okay, so maybe this shouldn't have received a 10, it isn't Casablanca, or even an Indiana Jones caliber movie. But, I do like this movie quite a lot and feel more people should give it a chance.\n\nI think Congo failed because of marketing, first and foremost. This got the summer blockbuster treatment, and unfortunately, generated an audience that didn't suit the film.\n\nOn the one level this film completely works as a children's adventure movie, and on the other appeals to film-buff looking for some good fun.\n\nLet's get this out of the way. The acting is terrible. I mean really, really poor. There's a sign language-using monkey-suited midget with accompanying computerized voice synthesizer. And to top it all off there is Tim Curry.\n\nWhen I think of Congo I think of one character, Herkermer Homolka, played by Tim Curry. Even with thousands of movies under my belt, I still can't be sure if Curry turned-in one of the very worst performances of all-time, or whether he was just hamming it up. Regardless of why, Herkermer Homolka is one of the most enjoyable Hollywood characters ever created. Is it the terrible accent? Is it the ridiculously, one dimensional stereotype of the shyster? I can't say. But I can tell you that the character has left me in tears laughing on more than one occasion.\n\nI don't really remember a ton of the plot. They're trying to take the talking Gorilla back to Africa or something, and there's a diamond Volcano involved. You also have a ultra powerful mega-corporation paying for the adventure.\n\nI should also note that this movie has a very entertaining performance turned in by Ernie Hudson as the pragmatic liaison between the civilized west and savage Africans (passing bribes and such).\n\nFinally, one thing to watch out for, are the completely racist stereotypes of the Africans. They are portrayed as either corrupt, cowardly, superstitious, or all three. Watching this movie is much like watching an old Tarzan flick. If you, yourself, aren't racist I think you'll just sort of shake your head at the stupidity of it all and get a chuckle thinking about how angry the actors having to play the \"savages\" must have been.\n\nSo, this is a throw-back movie. It isn't good acting, the plot is contrived and silly, the entire narrative seems to use stereotyped caricatures, and there's a guy in a gorilla suit. You can see why some people hate this movie.\n\nOn the other hand, if you appreciate a good Hollywood safari-adventure flick, this one doesn't disappoint. In fact, it entertains."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "coreyjpier",
        "review_rating": "10",
        "review_title": "Such a classic",
        "review_detailed_main": "Not sure why the rating on this is so low. Easy to watch with likable characters that just flow."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Zoopansick",
        "review_rating": "8",
        "review_title": "C'mon people it's fun!",
        "review_detailed_main": "Ok ok, so this isn't the most plausible story every written, but there are a lot more implausible ones out there with better ratings! This movie is a lot of fun, it is a decent and fun if nothing else adaptation of the book, and as far as movies go about the search for King Solomon's mines go, it's heads and shoulders above all the others. As one of my friends pointed out to me they didn't really take full advantage of Amy the gorrilla. If they gave her some one liners it would have been much better. IE:The scene where they finally discover the lost city, and first have a shot of the city then they camera zooms on Amy's face...this would be a perfect time to have her say and sign something like \"We meet again City of Zinj!\" or how about at the end when they are running away from the lava and Peter the scientist almost falls into the lava. When Amy turns around and sees it they should have her sign \"Peeeeeetttteeeeerrrrrrr!!!!\" and have her hold the sign for a moment or two. It would have been what is known back east as \"comedic gold\", or at least \"Comedic diamonds\" (pun intended). Anyway this movie is fun, I gave it an 8 to boost it's score but in reality it's probably around a 6-7, still way better then a 4 point something.\n\n\n\nZoopansick"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "bigbadjohn-00565",
        "review_rating": "9",
        "review_title": "I love this movie",
        "review_detailed_main": "One of my top ten favorite movies. I always wanted to see a part 2 but that's never going to happen and that's a shame"
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "lk-15761",
        "review_rating": "10",
        "review_title": "DIAMONDS FOR THE CAPITALISTS. DEATH FOR THE GORILLAS!",
        "review_detailed_main": "This is the greatest film. A cinematic treasure for all ages. Sure, I have a few nagging complaints:\n\n1. The story line makes little or no sense.\n\n2. The apes' costumes look fake.\n\n3. The actors in the film are 3rd rate at best.\n\nBut don't let this small list of complaints take away from the fact that this film is truly brilliant. I was literally on my knees praying to God, for the safe return of the hero during the final act. Truly gripping!\n\nSeveral people have shared with me that they loved this film so much, they named their first child, \"cannibal\", after the evil gray gorillas who ate Charlie's face in act 1. To be honest, I'm an animal lover who does not wish to see harm come to our gorilla friends. Having said that, when the evil grey gorillas attempted to protect their blue diamonds from the evil Capitalists, I celebrated when the gorillas were caught in a hail of machine gun fire.\n\nThe Capitalists simply wanted access to the horde of blue diamonds and the evil grey gorillas did everything they could to stop them. In the end, the gorillas lost and greed won. The natural order of things was restored.\n\nHonestly, this is a wonderful movie that the whole family can learn to enjoy. In fact, I would encourage schools to show this film in Animal Studies 101. As the lessons learned in this film are timeless.\n\nThe main takeaway is..blue diamonds are a dead gorillas best friend."
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "jucsetmai",
        "review_rating": "8",
        "review_title": "Congo on 4k ultra hd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "greenace92",
        "review_rating": "8",
        "review_title": "Not a bad movie, good parts, nice romance",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "El Guapo-2",
        "review_rating": "",
        "review_title": "Very entertaining fluff",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Oosterhartbabe",
        "review_rating": "",
        "review_title": "Chees-o-licious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Kylic",
        "review_rating": "",
        "review_title": "Classical adventurous fun, set your brain to \"off\" though",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "imdb-4325",
        "review_rating": "",
        "review_title": "I'm going to add 2 hours to your life:",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "runar-4",
        "review_rating": "",
        "review_title": "Herkimer? Give me a break!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "NoArrow",
        "review_rating": "",
        "review_title": "Probably the worst Crichton adaptation ever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "stuffy-nose",
        "review_rating": "",
        "review_title": "um yeah...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "sharpobject2424",
        "review_rating": "",
        "review_title": "Just Bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "amesmonde",
        "review_rating": "",
        "review_title": "Adventure fun with a memorable ensemble cast, but uneven.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "andy-227",
        "review_rating": "",
        "review_title": "Another bad one, only made worse by the fact that it was based on a good book.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Scufovo",
        "review_rating": "",
        "review_title": "You have got to be kidding!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Special-K88",
        "review_rating": "",
        "review_title": "not a bad setup but done in by poor execution",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Eamonn_green",
        "review_rating": "",
        "review_title": "Not great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Angry_Arguer",
        "review_rating": "",
        "review_title": "Gone is Wise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "PlotLuck",
        "review_rating": "",
        "review_title": "Among the worst movies of the 90's",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "droog43",
        "review_rating": "",
        "review_title": "Are you kidding me?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Silverzero",
        "review_rating": "",
        "review_title": "Entertaining mixture of noisy action and campy horror.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "soranno",
        "review_rating": "",
        "review_title": "Horrid monkey business",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Crow1013",
        "review_rating": "",
        "review_title": "Get out Mr.Crichton! Get out while you still can!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0112715",
        "movie_name": "Congo",
        "movie_rating": "5.3",
        "review_username": "Matt-162",
        "review_rating": "",
        "review_title": "A Half Review",
        "review_detailed_main": ""
    }
]