[
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "manoj-ransing",
        "review_rating": "6",
        "review_title": "Nice surprise",
        "review_detailed_main": "The movie has really come out as a nice surprise. I watched it expecting it to be very stupid and rubbish comedy like 'Dhol' or 'Tom. Dick and Harry'. I even was not having any intention of watching this movie, as I know what to expect from such movies. My roommate bought this movie and then I watched it with him. And we both like it. In fact we were both rofling while watching and saying, \"Kya Bakwaas Chal Raha Hain\".\n\nWe were involved so much that only at the last scene we realized that the movie theme is copied from rat race. I again watched the movie after one month back at my home.\n\nYes, the movie is full of stupid unrealistic scenarios and characters. The movie is also copied from not one but multiple Hollywood films. But the touch that they have given from Indian audience and the decent acting from lead characters made this movie worth watching. Even though all the jokes are very old age, due to the way they are presented and the way they occur we want to laugh at them.\n\nWhen the movie has many characters normally we see that character building itself takes a lot of time and then each character did not get enough scope on screen. But fortunately in this movie each one gets its share time to develop and present themselves. Due to this there is restriction on scope of each character and hence the actors doing those do not have any problems performing them. That is why even without any big names behind (except Sanjay Dutt) the movie has done some good at box office.\n\nThe movie is flows with constant pace. Nowhere we find it going slow (except for the plane scene may be) or going fast. Also absence of songs I will treat as a positive point.\n\nThe other important aspect is not having any female actor. In todays Bollywood era, where an item song is a must in a movie doing such a daring is admirable.\n\nThis is the kind of you will like to watch and forget, but if you get another chance you will watch it again. At least I will."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "Faisal-Hashmi",
        "review_rating": "7",
        "review_title": "Entertaining, but not an original work.",
        "review_detailed_main": "Dhamaal is an entertaining movie. However, one can't shake off the fact that the movies LIFTS scenes and story lines from AROUND 5-6 Hollywood MOVIES, right from the first scene.\n\nFirst scene is a rip-off of Johnny English, the third scene is copied from one of Mr.Bean's episodes. The whole damn storyline is EXACTLY IDENTICAL to 'Its a Mad Mad World' and 'Rat Race'. Later one, the movie lifts the bridge scene from 'Road Trip', the tiger roar scene is from a movie called Without A Paddle, and the whole soap gun scene is from 'Small Time Crooks'. On many occasions, it is also inspired by Starsky and Hutch.\n\nUPDATE - Just watched 'Dude, Wheres my car?' and the pizza scene is copied directly from there.\n\nHowever, the second half is where we see some originality, and ironically, the most original scenes are the most entertaining. The movie goes for a clichéd ending, however, which is a downer.\n\nTHE GOOD\n\n\n\n\n\nTHE BAD\n\n\n\n\n\n\n\n\n\nOverall, Dhamaal is a decent entertainer, but stumbles badly on originality, as the copied jokes have been done much better in the original movies."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "bunnymehra1985",
        "review_rating": "8",
        "review_title": "A Real Comedy",
        "review_detailed_main": "This movie is the perfect example of what is comedy. And a movie can be a hit and does good business without women too. The story line is same and old one. 4 friends Roy, Adi, Manav and Boman, lives together share good and funny moments. Their jokes are hilarious. Though Sanjay Dutt is also there in the movie, but the young boys does a good job, and make this movie a perfect comedy, this is a type of movie which you can see again and again, A complete funny entertainer. These four friends going from Bombay to Goa for some money, but when money words comes, there is no place for any other thing. This happen with these friends too. All friendship breaks bcoz they are not be able to decide what is the share they have to distribute. Lots and lots of characters are coming at regular intervals and joins them in their journey. This movie is as comedy as I can compare this with Hera Pheri and Golmaal. There's not a single moment in the movie where you say that you are not enjoying. All characters is superb and specially our Adi(Arshad) and Manav(Javed). After Dil, Beta, Mann and Masti, Inder Kumar's this flick proves that he is a king of comedy."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "deventhakkar",
        "review_rating": "10",
        "review_title": "Very interesting and funny, one of the best comedy films in Bollywood",
        "review_detailed_main": "Dhamaal is an amazing and very funny story of four ordinary university dropouts and unemployed men formed their own group of con artists, carrying out theft and other illegal activities to get money. It's truly crazy and a laughing riot. With Director Indra Kumar weaving in new characters, unexpected plots and twists and turns, making it truly come ducal and putting a smile on the faces of the audience although some parts including the plot of the film are based on Rat Race, It's a Mad Mad Mad Mad World and Mr. Bean (the British TV Series and it's feature film in 1997). However, the ending of the film where the 6 men arrive at a Help Orphan Children Organization charity, the comedy is drained out but Director Kumar manages to refill the gaps with comedy when Kabir is interrogated by his boss again and the end song and dance as the credits roll. Watch this if you are feeling lonely, bored or down. As the name suggests, the film does do it's best to make you laugh. It did truly tickle my funny bone and drew a smile on me several times. Basically, this is what a comedy/drama film is meant to be! Arshad, Aashish, Ritesh and Javed truly shine as these four lovable and funny idiots with Sanjay Dutt and Asrani doing a spectacular performance, playing tough and strict but still funny men."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "elshikh4",
        "review_rating": "",
        "review_title": "Bollywood's Mad Mad Mad World !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "ganeshkss97",
        "review_rating": "9",
        "review_title": "One of the best comedies",
        "review_detailed_main": "Inder Kumar's Dhamaal,is on of the cleanest and funniest movies to come out in Bollywood.\n\nNowadays,we hardly get to see squeaky clean comedy movies.\n\nDhamaal is a little gem which deserves a watch.This movie was not promoted heavily but soon gain popularity among people and became a super hit at box-office.\n\nDirection by Inder Kumar is very good.\n\nDialogs are very good.\n\nPerformance wise-Javed Jaffery tops with an enthralling performance.Ritesh Deshmukh is very good.Ditto for Arshad Warsi and Ashish Chaudhary.Sanjay Dutt too is excellent.Asrani and Sanjay Mishra are hilarious.Prem Chopra is good in a brief role.\n\nOverall Dhamaal deserves more than once viewing because it is one of those comedies which we hardly get."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "rajumatix",
        "review_rating": "7",
        "review_title": "Felt cheated..a bit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "srivardhanms",
        "review_rating": "9",
        "review_title": "Laugh Heartily for 135min....",
        "review_detailed_main": "This is complete paisa vasool film.... U can heartily laugh for 2hr 15min... Don't see logic n all, just sit down n relax... It has a simple story line... 4 guys who are not at all serious in life, meets a dying gangster who tells them bout 10cr he has made in life... n tells them to use it as they like... but a inspector comes n enquires them bout it as he is investigating the root of that very money for 10 yrs ... then the conflict starts b/w them as to who as to get the money... everyone leaves to Goa where money is supposedly hidden... The climax is beautifully planned... n i'll not spoil it... Actin is wonderful... music by sandeep is good... wonderful direction by Indra kumar...."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "kooleshwar",
        "review_rating": "6",
        "review_title": "Very Entertaining BUT for 2 big BUT's......",
        "review_detailed_main": "Indra Kumar may never have made cinematic masterpieces but has always delivered good stellar, albeit very inspired entertainment.\n\nHowever something made me feel that this movie may in fact not be inspired, because buffoonery a staple of Bollywood comedies since the 90's, is in fact \"Very 90's and before that Very 60's\" in Hollywood, there there have been the odd movie of this genre in recent years but those have all been copied thanks to one great man Mr. Neeraj Vohra(in partnership with Priyadarshan off course), I cant wait to see which movies hes plundered in his latest venture.\n\nBUT the fact is I hoped and felt this movie was original, BUT for a long time since i can remember I WAS WRONG.\n\nSo wrong in fact that 15 mins into this movie i knew almost exactly the movies the major jokes in this movie, THIS MOVIE FOR ALL PRACTICAL PURPOSES IS A PERFECT MIXTURE OF 2 MOVIES ITS A MAD MAD MAD WORLD (1963) AND RAT RACE(2001), the STORY MORE FROM ITS A MAD.. WHILE SOME OF THE CHARACTERS AND SEQUENCES ARE FROM RAT RACE probably because entire sequences have been lifted from its A Mad... by Neeraj Vohra in the past (Bhagam Bhag), and they needed enough content to fill in the spaces.\n\nWhen i realised this i started the normal routine of lamenting my fate, and the quality of the Hindi movie industry,(HEHE screw driver up the bums so funny), when were we ever going to have an original movie here, is it my fault that I've seen so many good English movies,(the stereotypical Bawa who loves his old car haha) THEY EVEN IMPRESSED ME BY HAVING VERY FEW DIALOGUES IN English AND HAVING THE STARTING CREDITS IN Hindi, don't tell me they've copied the scene down to the kick the bucket joke, how many people who speak even English know that (Ritiesh Deshmukh is hilarious hehhoohoho), blah blah blah.....\n\nTHEN THE OTHER BUT HIT ME......\n\nBUT....\n\nEVEN THOUGH I KNOW ALMOST ALL THE MAJOR GAGS IM STILL LAUGHIN Aren't I.\n\nSomewhere along the line in the attempt at Indianizing the story and the script, this movie added something new to otherwise predictable blend, much like what we Indians did to Chinese food, its like to take Chinese recipes of Manchurian and noodles, cook it Indian style add masala and what not, then when you mix the two it doesn't merely taste like Manchurian plus noodles but something else.\n\nAnd so i laughed, and laughed and laughed, the JOKES ARE VERY VERYT CHILDISH mind you and if you don't have the appetite for childish humour then this movie is not for you, a bunch of us friends loved it, but when my parents went for this movie despite me warning them in advance they found the movie toooo childish.\n\nThe acting is superb, everyone has put really fine inspired performances, again with an Indian twist to everything, SANJAY DUTT WAS COMPLETELY OFF COLOUR, (maybe his impending jail stint had something to do with it, and GOD WILLING THE LAW WILL PREVAIL AND HE SHALL SOON BE BACK THERE AGAIN).Still his bad performance was very very noticeable and a slight dampener.AFTER CASH AND HEY BABY RITIESH HAS GAINED BACK SOME RESPECT.\n\nTHE SONGS WERE CRAP TO PUT IT MILDLY AND BADLY USED WITH 2 OF THEM IN QUICK SUCCESSION IN THE BEGINNING.Luckily thanks to large amount of content (the original IAMMMMW was 3 hrs and RR was 2 hours) there were no more songs in this film.\n\nTechnically this movie was OK with some special effects and sound effect used effectively, writing directing was OK given the fact that this movie was completely inspired.\n\nBy the end of it this turned out to be a very entertaining movie for me despite its huge shortcomings.\n\nONCE AGAIN I WOULD LIKE TO WARN YOU THAT THIS MOVIE Isn't FOR EVERYBODY, its very childish (not a single adult joke), everyone is a buffoon, AS PROMISED there is no romantic track etc etc. Its utter and complete stupidity and if thats not your taste then this movie is not for you.\n\nIf however you do like such movies, haven't seen the originals, or are willing to overlook its blatant plagiarism, THEN GO AHEAD AUR KAR LO DHAMAAL.\n\n-s blatant plagiarism, some jokes to stupid to be funny, pathetic songs.\n\n+/-s the interval was needed for me (its not easy seeing so much stupidity at one go), SANJAY DUTT (I KNOW HE MADE A MISTAKE BUT WHEN YOU MAKE MISTAKES Aren't YOU SUPPOSED TO PAY FOR THEM).\n\n+S great inspired acting all around, good technically (again credit to the originals), lots of hilarious jokes some with a very Indian soul.\n\ntotal 6/10 (any movie thats so blatantly copied deserves no better, i really enjoyed myself but i assure you it wont be the same for everyone, despite the fact that i enjoyed i still pray and hope for something original to come out of bollywood)."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "namashi_1",
        "review_rating": "10",
        "review_title": "Truly Hilarious!",
        "review_detailed_main": "'Dhamaal' is a mad, zany, silly but truly hilarious comedy film, that hasn't lost its touch even after nearly a decade since its release. I have seen this cult-classic many times & the film only gets funnier each time I re-watch it.\n\n'Dhamaal' Synopsis: Four good-for-nothing companions & a corrupt cop embark on a journey to find a hidden treasure in Goa.\n\nHeavily inspired by the all-time hit It's a Mad, Mad, Mad, Mad World, 'Dhamaal' offers genuine laughs & tickles your funny bone all through. The characters & their journey as one, is definitely silly, but the sequences are so hilarious, that you are on the floor laughing! The gags, one after the other, are so funnily written, that its impossible not to laugh.\n\nBunty Rathod's Screenplay borrows heavily from the above-mentioned film, but it works entirely. A special mention for the crackling dialogue. Indra Kumar's Direction is good. He deserves kudos for not letting the pace drop at any given time. Cinematography & Editing are fair. Music by Adnan Sami is excellent.\n\n'Dhamaal' works because of its terrific casting. Arshad Warsi, Riteish Deshmukh, Aashish Chaudhary & Jaaved Jaffrey are a riot! Their on-screen chemistry as well as their comic timing, is masterful. Jaffrey, especially, is top-notch. Sanjay Dutt is his usual self. Asrani brings the house down. He's another topper! Vijay Raaz, Suhasini Mulay, Sanjay Mishra, Manoj Pahwa & The Late/Great Vinay Apte are superb in bit roles.\n\nOn the whole, Wanna laugh-out-loud? Watch 'Dhamaal'. Its pure fun!"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "simplyaakarshan",
        "review_rating": "7",
        "review_title": "A good laugh-out-loud comedy after a hectic day!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "Pratik112",
        "review_rating": "10",
        "review_title": "Excellent Comedy",
        "review_detailed_main": "After months and months of flops being released, this is one movie that has lived by its title, \"Dhamaal,\" which means chaos, trouble.\n\nThree men, Aditya Shrivastav, Manav Shrivastav and Deshbandhu Roy are thrown out of their rented house after failing to pay rent for several months and find themselves homeless as they are not employed. They try to survive by stealing portraits but even this fails and they get caught and are soon joined by their friend, Boman Contractor, who like them, has no job and has left home. However, his father, is wealthy but only cares about his antique car. Boman decides to go against his father's wishes and steals the car and the four of them head towards Goa. Enroute the collide with another car, whose driver dies but not before informing them about some hidden money. Unknown to the four men, a certain Police Inspector Kabir Nayak has been chasing the dead man and Boman Contractor's father has found out that his beloved antique car has been stolen by his son.\n\nThe movie stars Sanjay Dutt, Arshad Warsi (both of them known for their roles in \"Munnabhai M.B.B.S\" and \"Laage Raho Munnabhai\"), Riteish Deshmukh, Ashish Choudhary and Asrani. A special appearance is made by the legendary villain, Prem Chopra. The movie has no female actress accept for one, who make a brief appearance at the beginning as the landlady. The director, Indra Kumar, has done an excellent job of this out and out comedy movie and is worthwhile watching it with your family.\n\nDoes anyone remember the movie, \"Its A Mad Mad World?\""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "salilgoyal",
        "review_rating": "6",
        "review_title": "It's a mad mad mad mad Rat Race...",
        "review_detailed_main": "Well, the title of the comment is good enough to suggest what i am referencing to. It's a 40% copy of \"It's a mad mad mad mad world\", 15% of \"Rat Race\", 5% of others (like Mr.bean). Rest 40% is original, i guess.\n\nEnough of Segregation.. Now, coming to movie. After see(tolerate)ing movies like Partner and Heyy Babyy, this one comes as some serious refreshment.\n\nThough copied, movie has some nice comic sequences of its own. Best part, i believe was that none of the actors overacted and performed their acts quite well. Javed Jaffrey stands out as the best of the lot. His performance, similar to the character \"Blaine Cody\" of \"Rat Race\", was brilliant. Vijay Raz's sequence as tower controller was the best moment i guess.\n\nAashish Chowdhry has improved a lot. Ritesh performs well. Sanjay Dutt is just OK and cameos by some TV artists are good as well.\n\nFor the shortcomings.. Arshad Warsi disappoints after a long time. His performance wasn't up to the mark here.\n\nAnother bad thing is that some scenes are xerox copy of the originals. Bollywood needs to trust its capability. More Indians now watch English movies than ten years back and copying scenes now could backfire. No matter how good a movie is, people are still gonna blame you for copying. Moreover, there's a danger of lawsuits being filed which can be a big shame for Indian cinema.\n\nAnyways, the movie was highly watchable. so it gets 6/10 from me."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "saurabhkas",
        "review_rating": "1",
        "review_title": "totally useless!",
        "review_detailed_main": "This movie should have had the following Tag line: \"Cash Prize if you could stand it more than 5 minutes!!!!\" And believe me director still would have made money because I bet there wont be too many winners.\n\nIf you ask me there is a complete bankruptcy of intellect in Indian cinema. I don't think anybody enters the theater expecting Originality, problem is when they start doing such horrible job at making remakes of Hollywood movies. I sure don't want to invest my three hours watching something when it hasn't taken that long for someone to write it.\n\nTo be fair, I haven't seen any good Hindi comedy in the longest time. So in case you have liked some other recent ones, like \"Bheja Fry \" you might jus like this one too.\n\nAs for me, I recommend to send this movie for Oscars so they can set up a bench mark for the most pathetic movie of all times.\n\nI am watching this movie as I write my comment and believe me with each passing second it gets worse and worse.\n\nI gave it 1 simply because there is no negative rating available."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "Queen_of_pentacles",
        "review_rating": "8",
        "review_title": "Money , money, money ,it's a poor man's world !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "shovonbhattacharjee",
        "review_rating": "8",
        "review_title": "What a comedy film",
        "review_detailed_main": "This film is full of comedy. Their acting is also superb."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "WasiReviews",
        "review_rating": "7",
        "review_title": "Classic Bollywood Comedy",
        "review_detailed_main": "It had laughs, adventure and comedy package in an adaptation of the movie \"It's a Mad, Mad, Mad, Mad World\". I wish the idea was original but it's Bollywood what did you expect? Jared Jeffery playing as a stooge was great and felt refreshing. Arshad Warsu, Rutesh Deshmukh, Ashish Chaudhary, and Sanjay Dutt showed why they are good actors. The lack of female characters didn't bother me it's a dumb movie for the boys and girls kick back relax and enjoy the show."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "sankattalukder",
        "review_rating": "10",
        "review_title": "I can't forget it (what a funny)",
        "review_detailed_main": "The movie was really awesome. I enjoyed every scene in the movie. The story dialogue screenplay of the film was captivating. And Funny Comedy Acting are Really Enjoyable. Haaaahhaaahhhaaaaaaa......"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "goti63",
        "review_rating": "6",
        "review_title": "There's a lot of dhamaal in \"dhamaal\"",
        "review_detailed_main": "To be honest,when I first saw the trailer of dhamaal,the product seemed to be quite dated but the movie took me by surprise.Although there's nothing new in the plot and even some of the scenes are blatant rip-offs,you don't mind watching them because of the way they have been directed and acted.If you've seen It's a mad mad mad mad world,you might feel that the premise of this film is more of less the same.Johny English,Mr. Bean(the series),Starsky & Hutch and Rat Race are the few films(or series,as the case may be) from which certain scenes of this movie have been lifted.The acting by all the cast members is up-to-the-mark.The fact that there are only a couple of songs in the movie helps.The runtime is just over 2 hours and thus the movie doesn't seem to be stretched too much.However,certain tracks in the second half could have been avoided.All in all,Dhamaal isn't a flawless product but it's certainly watchable which is all you expect from these kind of movies and so the one's who watched it wouldn't be left disappointed."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "Patlipvillage",
        "review_rating": "10",
        "review_title": "A cult classic comedy film of Indian Cinema",
        "review_detailed_main": "Dhamaal...it's not a movie it's an expression of surprise laughs just like Hera Pheri 1& 2. Every scene and dialogue are so learned that it makes you laugh every time you see it. The characters played so amazingly that makes this movie an epic. It will be not wrong to say that this film is too much closer to Hera Pheri in terms of laughter.\n\nNo vulgarity, no obscene language, no abusive language...a pure masterpiece for family entertainment. I wish it will have more chapters to come with original star cast. A happy life and best of luck to all the characters who perform so well that i have to write this review in honour of them."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "salianmoviereview",
        "review_rating": "6",
        "review_title": "Clean comedy Atlast",
        "review_detailed_main": "Dhamaal directed by Indra Kumar is a clean comedy.\n\nEven though the movie is copied from two Hollywood movies(Its A Mad,Mad,Mad World and Rat Race) and even loosely from the Bean Series,I liked it.\n\nThe story is copied.\n\nThe screenplay is well written.\n\nThe jokes are excellent.Especially the one involving Arshad Warsi,Javed Jaffery and a South Indian guy.So hilarious! The movie has one song which is strictly okay.\n\nPerformances-Ritesh Deshmukh,Arshad Warsi,Ashish Chaudary and Javed Jaffery are all fine comedians.Sanjay Dutt is superb.Asrani is funny.\n\nOn the whole Dhamaal is a clean comedy but with a copied plot-line."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "anikb-87099",
        "review_rating": "10",
        "review_title": "Cult Classic!",
        "review_detailed_main": "This is one Bollywood comedy film that no other \"recent\" comedy films in Bollywood can match upto.\n\nOn any day, this can easily be watched and re-watched a 100 times and still its simple yet hilarious jokes and awkward situations will make you burst out laughing ...from Adi planning the speed of the car to make it cross a broken bridge (copied from a Hollywood film but the makers have nailed it making sure you dont have to watch the original scene) to Vijay Raaz's slow advice to Baman stuck on an airplane which is probably according to me the best part of this film.\n\nThe entire film itself is a remake of a different film \"Its a mad mad world\" and Dhamaal is that one rare remake that absolutely nails it from acting to jokes so that you dont have to necessarily watch the original film.\n\nJust like a Hera Pheri, Dhamaal has its own fanbase and these are a few cult classics that no bollywood film can match up with."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "6",
        "review_title": "A thumbs up for director Indra Kumar's squeaky-clean comedy Dhamaal.",
        "review_detailed_main": "We've become so accustomed to vulgarity in the name of humour that we've forgotten to appreciate clean comedies. Which is why I want to roll out the carpet for Dhamaal, a genuinely funny, plot-driven family comedy directed by – surprise, surprise – the king of melodrama himself, Indra Kumar.The film stars Ritesh Deshmukh, Arshad Warsi, Javed Jaffrey and Ashish Chaudhary as a bunch of unemployed, down-on-their-luck no-gooders who go in search of a ten-crore rupee treasure they learn about from a dying mob-boss.As luck would have it, the secret of this hidden treasure also reaches the ears of a crooked cop, played by Sanjay Dutt. So now you've got five guys heading in the direction of this stacked-away money, each encountering oddballs along the way, each trying to reach the location before the others so he can claim the full amount himself.What's refreshing about Dhamaal is the fact that it doesn't fall into any of the traps that recent hits in the comic genre – Partner and Heyy Babyy succumbed to – it's not vulgar, it isn't full of sexist jokes, the dialogues aren't stupid, and you don't feel like the gags are being stretched out endlessly.Having said that, let's not get too carried away and put either the director or the writers on a pedestal just yet, because Dhamaal is after all a rather blatant rip-off of the evergreen Hollywood hit, It's A Mad Mad Mad Mad World.Dhamaal works primarily because it's a cleverly written film that moves briskly from one gag to another, leaving you with hardly any time in between to stop and ponder. And although you can trace back several of the jokes to popular American films like Starsky & Hutch, Road Trip and even the Mr Bean TV series, it's the manner in which these jokes come together in the screenplay that deserves credit.Take Ritesh Deshmukh's spot-on imitation of Sanjeev Kumar, or Vijay Raaz's priceless flying instructions to Ashish Chaudhary and Asrani, or even that scene in which Arshad Warsi and Javed Jaffrey hitch a ride with an over-zealous Tamilian who insists on sharing with them the full length of his name – it's moments like these, and many other, that make Dhamaal such an easy pleasure.Of the cast, it's without doubt Javed Jaffrey who towers above the others with his performance as the dim-witted child-man. His is easily the best-written role in the film, and Javed doesn't miss the opportunity to milk it for all its possible comic potential.Sanjay Dutt, meanwhile, is not so much a part of the comedy as he is the catalyst for much of it, and he's clearly the best man for that job. Take those scenes in which he's trapped with a bus full of screaming kids, and watch how he generates such poker-faced humour.A little over two hours long, barely any time wasted on unnecessary songs, and surprisingly, the complete absence of any romantic track – there's so much to like about Dhamaal.Sometimes, a good laugh is all you need to make your day. Don't miss this one, a good laugh is guaranteed"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "sweet-bunnie",
        "review_rating": "1",
        "review_title": "Horrible adaptation of a classic English movie",
        "review_detailed_main": "The acting is just not worth writing about, the \"comedy\" - slapstick, pace - really slow, seriously, nothing in this movie could make you laugh if you were a sensible, level headed person.\n\nIt is supposed to be \"inspired\" by a really old classic - It's a Mad, mad, mad, mad world and a very poor adaptation, I should say. The original movie, for those of you who have not had an opportunity to see it, is a wonderful light comedy, without any of the slapstick feel to it. The final sequence keeps you rolling on the floor for hours! This movie is NOTHING as compared to the original. Also, there is NOTHING original about this movie as well. Javed Jaffrey's character is another sloppy attempt to imitate Mr.Bean and does not induce any laughter whatsoever.\n\nPlease save yourself and your money and don't watch this movie!"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "gk303007",
        "review_rating": "8",
        "review_title": "Hilarious",
        "review_detailed_main": "Whatever it be, copied from dozen other hollywood or old bollywood movies, it is totally entertaining and hillarious. If you are bored, need a quick flick and there's nothing much handy, this could be a good time pass. I laughed out at many scenes."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "saqibsheikh-49025",
        "review_rating": "9",
        "review_title": "Outstanding",
        "review_detailed_main": "The scenes are copied but very well portrayed and it's entertaining from the start to the end....loved it. There's no point of giving low reviews just because it's not original, it's all about adaptation and delivery.. They all did a pretty good job overall..."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "markovd111",
        "review_rating": "6",
        "review_title": "Indian version of \"It's a Mad, Mad, Mad, Mad World\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "mahmudurrezarosan",
        "review_rating": "10",
        "review_title": "Most funny movie that i have seen",
        "review_detailed_main": "This movie is very funny movie. And it is also adventure movie. I have watch this movie more then 50 times. And want to watch this movie or this types movie more and more."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Its A Mad Mad Mad World",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "bihariboiimehra",
        "review_rating": "10",
        "review_title": "Has aged well",
        "review_detailed_main": "It's jokes still work and doesn't get boring upon a rewatch"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "miltontalukder-57858",
        "review_rating": "10",
        "review_title": "Funny Funny Funny 😋",
        "review_detailed_main": "This Movie is amazing to me. I enjoyed every moment of the film. You don't need a big budget to win the hearts of the audience, only if the story is good, the audience will rush to watch the film. Funny Funny Funny 😋"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "geosathyaprasad",
        "review_rating": "5",
        "review_title": "Copied from Hollywood",
        "review_detailed_main": "This movie is completely \"inspired \" from Hollywood movies like : 'It's a mad ,mad ,mad ,mad world (1963) ', 'Road trip(2000)', 'Mr. Bean(1990s)' , 'Rat race(2001)' ,'Johnny English (2003)' and many more."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "jayrathod-02151",
        "review_rating": "10",
        "review_title": "Best raw comedy movie with hera pheri!!!",
        "review_detailed_main": "Low budget, real locations, no foriegn land, highways, raw comedy, no animations and useless graphics( which they used from second part onwards which destroys the movie). Amazing squad with Sanjay as cop, chemistry of the crew was amazing with limited characters and no nonsense comedy. Loved it......"
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "Puroo",
        "review_rating": "10",
        "review_title": "Childhood Nostalgia",
        "review_detailed_main": "I remember when I was eight years old and had been hospitalised, I saw this trailer on my room's TV. We didn't have a TV at home so I had never seen a film trailer before my whole life, and that's probably why I was so much intrigued by this. When I got well and went to school I was bragging before everyone that I have watched this film, even though I didn't even know its name (I used to think its name is A Ya O because of its theme song). I was such a child back then. So finally I got to watch it a few years later when we got a TV at home. And now it's my favourite family film.\n\nFirst of all, yes, I am well aware of the fact that this is an adaptation of a Hollywood film \"It's A Mad, Mad, Mad, Mad World\" (I don't know if I wrote Mad the correct number of times and my internet is too slow to check). And because of that I will not praise this film in any manner for its storytelling, even though I haven't even watched the Hollywood film. And secondly, I have watched the next two films in the series as well and I regret having done that. This film is best enjoyed as a standalone work, without seeing what happens after the incidents of this film.\n\nI really liked the sense of humour of this film as a kid. Every other scene is funny. And because of the background score, campy acting, the expressions of the actors and the fact that I watched it as a kid make it very clear that this film is meant to be for children, even though adults can also enjoy it. Roy was my favourite character in this film because I found his magnetic belt very cool. It is also the film from which I learnt about Riteish Deshmukh, and I have always had a positive perception of him no matter what kind of films he does (I didn't even know he had done adult films, heck, I didn't even know adult films were a thing).\n\nThis film is one of those Bollywood comedies that basically shaped my childhood alongside Welcome, De Dana Dan, Munna Bhai and No Entry. It hasn't aged at all in all these years and is fun to watch for the entire family, especially if you have children. I mean of course there is an item song in the beginning, but other than that it has aged almost perfectly."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "magmedia-07621",
        "review_rating": "9",
        "review_title": "LoL.",
        "review_detailed_main": "Evergreen fun and laugh. No one can stop to laugh even you watch film 100 times. Lol."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "DrLeatherface",
        "review_rating": "2",
        "review_title": "Lazy slackers and conmen!",
        "review_detailed_main": "The plot involves four lazy slackers and a bunch of con-men which is appropriate as nearly every plot point and set piece is stolen from other movies. There is barely anything original in this whole mess. From Road trip to it's a mad mad world, nothing is off the table when it comes to plagerism and un-originality! Almost shot for shot set pieces are stolen. The actors are serviceable as they stumble through scenes lifted from better movies. It's almost shocking to see no other reviews point this out. Either they are ignorant to this or just don't care. Either way, it's a lazy slacker con from the get go, on screen and in real life."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "rajat-garg",
        "review_rating": "3",
        "review_title": "The film is good in the first half",
        "review_detailed_main": "The film is good till the first half and then the director looses control over the film. He forgets that he is making a comedy and not a run around and keep on increasing character movie. The plot is different but gets down to the same thing like lots of other movies in the past. The director has not even taken care of the characters. There are a Parsi son and father who keep on speaking Gujrati. Wasn't this very obvious or was this pun intended?. There is an inspector who has been working for the last ten years and suddenly changes into a after-money guy. There is a dacoit who appears out of no-where and becomes a contender for the money. The director could have lost him after using him for the comedy factor. On the whole a movie you can watch once but might get bored in the second half."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "pramanik_sayantan2263",
        "review_rating": "2",
        "review_title": "A ribtickling comedy thats a headache to watch!!",
        "review_detailed_main": "This is another one of those 2000 era rib tickling comedies, that is a real headache to watch, at least for me. I started the movie with lots of anticipation, but the movie turned out to be a real bore. I don't know how this movie could fathom an average score of 7+ on imdb. Perhaps only folks who are typecasted to watch rib ticklers watched this movie, and gave it such a high rating. The comedy sequences are filled with inaccuracies, screenplay and cinematography was below average at best. And the acting by some of the actors is the worst that I have seen them act.\n\nI really wouldn't dare to watch this movie a second time...."
    },
    {
        "movie_id": "tt0845448",
        "movie_name": "Dhamaal",
        "movie_rating": "7.5",
        "review_username": "simian_ninja",
        "review_rating": "1",
        "review_title": "Stay away.",
        "review_detailed_main": "Dhamaal is quite possibly one of the worst films that I have ever had the misfortune of watching. I normally say that a person should give every movie at least one chance (and watch it all the way through) in order to make a complete assessment of the film. This is the first film that I wouldn't recommend to anybody, save yourself the time and go outside and enjoy a moment with your friends or something. This film is the first film to make me ever say, don't bother. Quite an achievement.\n\nThe majority of the film is borrowed from It's a Mad Mad World, and when I say borrowed I mean copied without any distinction what so ever. Unfortunately, this film is so awful that I have no inclination to watch It's a Mad Mad World because I know the memories of this film will be conjured up. The opening scenes are copied from Johnny English and Mr. Bean. First we meet Deshbandhu Roy (Retish Deshmuk) who is working as a Government agent (this can only be presumed as it is not explained), it copies the opening scene in which Johnny English tells his superior that the area they are in is safe until a car explodes in the background. The scene itself is not even set out that well and provides no introduction to the character what so ever, that and the fact that it has nothing to do with the rest of the film. The second scene involves a character who's name I cannot remember (and an actor who should go back to waiting tables), so we'll just call him Annoying Fool from now on. His first scene is copied from the episode of Mr. Bean where Bean gets his hand stuck in the back of a stranger's pocket and ends up following them into a bathroom stall. To round up the foursome we have Aditya (Arshad Warsi) and Boman Contractor (Aashish Chowdhry).\n\nIf you're going to make a light hearted fun family entertainment film, you should have characters that are good and sympathetic that get caught up in hi-jinks and whatnot. After being kicked out of their abode for their failure to pay rent, the foursome come up with the idea of selling to paintings to relatives of the recently deceased, in short, conning people who are grieving. Not the best of ideas for both the characters or the writers. They are arrested for a crime they did not commit (in a scene so shockingly bad the writer should go back to cleaning toilets) and are promptly released in the middle of no where, where a car crashes and out rolls a dying man who informs them that a fortune of INR10 Billion waits for them because they 'are good people'. The journey begins and the copy of IMMW begins. Sanjay Dutt plays a police officer who gets caught up in the proceedings and also involved are a bandit (who does nothing for the script) and Contractor's father (who also doesn't do a damn thing for the film).\n\nThe bad: The writing is horrible even though I can safely say that the source material that provided it was fairly entertaining. I don't know much about dialog translation, but the cross between Hindi and English made me question the writer's ability of communication.\n\nThe acting is horrible. Arshad Warsi looks uninterested through out the entire movie, Aashish Chowdhry does his best as does the actor who plays the character that I hate but this does not make them entertaining. Both of them have a look of desperation throughout the entire film that says \"Please like me, please like me audience!\". Ritesh Deshmukh (who hasn't been in the best of films) looks sorely out of place and doesn't look like he's enjoying his role at all. The things some people do for money. Sanjay Dutt adds another horrible film to his resume which is already chock full of horrible films (thanks in part to his friendship with Sanjay Gupta), it's sad because I do think there is talent there that hasn't been properly used or been discovered by an appropriate director.\n\nThe direction is absolutely horrible. If you're going to copy a film, at least do it right.\n\nThe soundtrack is alright, but once again is forced. The opening credits function as a music video for the film. That's a give away about how bad the film is going to be.\n\nThe Good: I can't find anything good about this film. I really didn't enjoy it.\n\n1/10. There's only a few other films that I've given such a rating too. What a dismal film."
    }
]