[
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "cricketbat",
        "review_rating": "5",
        "review_title": "A childhood favorite that is now in an awkward phase",
        "review_detailed_main": "I remember liking Blank Check when I was younger. And I was excited to show it to my children. It hasn't aged well. This is like a knock-off Home Alone that didn't really understand how the formula works, and it stretches plausibility almost to the breaking point. Also, I get that this is a childhood fantasy story, but the relationship between 11-year-old Preston and 30-year-old Shay borders on creepy. I don't regret watching it again, but I don't think this will make it into our regular family rotation of films."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "eaglefangs",
        "review_rating": "6",
        "review_title": "90s Nostalgia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "neiljones1981",
        "review_rating": "5",
        "review_title": "Far-Fetched but worth a look",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "ckmec-1",
        "review_rating": "6",
        "review_title": "Former child star proves his worth in this light tale",
        "review_detailed_main": "Little Preston Waters (Brian Bonsall) is down on his luck. He needs money. Badly. He attends a little brat's birthday party and after seeing all his big-spending friends and the birthday boy, decides it's time for a change. Now we know his own special day is approaching. His thrifty father provides him with an $11 check, and as he goes down to his local bank to cash it, a recently-released thief named Carl Quigley(played convincingly by Miguel Ferrer) runs over his little bicycle. Eager to avoid the police, Quigley gives the kid a blank check and takes off. The check has fallen into the wrong hands, as Preston fills it in for a cool $1m and what do you know, has no trouble cashing it! Things get worse for the boy after a spending spree, as the money will eventually disappear, and a certain someone will be longing for that fortune.\n\nI enjoyed Brian Bonsall's and Karen Duffy's little friendship, along with friendly limousine driver Rick Ducommun, but the plot is way too basic, and my opinion remains the same now, as it did in 1994, when I first saw the film."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jediforce10",
        "review_rating": "1",
        "review_title": "You're better off burning a million dollars then watching this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "kevinp8192",
        "review_rating": "",
        "review_title": "Your cynical, money-grubbing children will LOVE it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Andreas_N",
        "review_rating": "7",
        "review_title": "Far-fetched but acceptable",
        "review_detailed_main": "Yeah, I remember this one! Many years since I actually watched it. The story was entirely surreal, but nonetheless great! What anyone who rates and reviews movies ought to bear in mind is what the respective movie aims at. It's the same with \"First Kid\", which follows a similar pattern. Certain movies - like this one here - just aim at plain and comical nonsense. Such movies can't be rated from the point of view of a hypercritical reviewer. Of course these movies lack quality, lack a sophisticated storyline, very often lack first-class acting, but if they do fulfil their primary premise - that's okay. I don't have this movie here on my list of all-time favorites, but I still thought it was funny, had some very enjoyable sequences and made a good story. Brian Bonsall is a smart actor anyway."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "MikeK1987",
        "review_rating": "1",
        "review_title": "Why won't anybody mention the bad parenting?????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "VanillaLimeCoke",
        "review_rating": "7",
        "review_title": "Sort of like Cop 1/2 and Home Alone theme",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "robloxhihellorobloxhi",
        "review_rating": "1",
        "review_title": "Worst movie I've ever seen (The writers should be arrested)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Lady_Targaryen",
        "review_rating": "8",
        "review_title": "Quick thinking landed him a million bucks... now everybody's after it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "blacklist-1",
        "review_rating": "6",
        "review_title": "One of my fav childhood films, that is still a guilty pleasure all these years later!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "SnoopyStyle",
        "review_rating": "4",
        "review_title": "money obsessed kids movie",
        "review_detailed_main": "Preston Waters is a young boy with no money. His older brothers are taking over his room for their business. His grandma's birthday check isn't enough to open a bank account. Escaped robber Carl Quigley (Miguel Ferrer) threatens bank president Edward Biderman (Michael Lerner) and orders him to launder his stolen money. Carl is sending Juice (Tone Loc) the next day to cash a check. Outside the bank, Carl almost runs over Preston with his car and destroys his bike. Carl gives Preston a check but fails to write down an amount as he rushes away before the cops arrive. Preston fills in $1 million. Biderman mistakes Preston for the expected Juice and hands over the money. Preston creates a fake identity Macintosh to buy a mansion, hire chauffeur Henry, woo bank teller Shay Stanley (Karen Duffy) who turns out to be an undercover cop, and throw a big birthday party.\n\nMoney obsession is not necessary a great subject for a kids movie. This could still be fun if Preston has friends. It could be loads of childhood fun. Instead, he's alone and it's terribly sad. The young actor isn't charismatic enough and it's probably expecting too much from him. His fling with Karen Duffy is borderline creepy. The villains are not bumbling enough and Miguel Ferrer is actually quite scary. There is simply a lack of fun in this kids movie."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jadansmothers",
        "review_rating": "2",
        "review_title": "A 30 year old and an 11 year old DATE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "GravityLoudHouseLover1",
        "review_rating": "7",
        "review_title": "A Fun Disney Movie that shouldn't be taken seriously",
        "review_detailed_main": "Blank Check is Children's Movie That I missed out watching during My Childhood because I was born in 1996 & this Movie Came two years Before I was born. I was First aware of this movie Because of the Nostalgia Critic review from 2009. I watched the Movie in May 2016 for the first time & I really enjoyed it. People Say it's a Ripoff Of Home Alone but it's still enjoyable. The Movie is About a Boy Named Preston Walters (Brain Bonsall) who gets a Blank Check from a Criminal Named Carl Quigley (Miguel Ferrer) who works With a Corrupt Bank Teller Edward Biderman (Michael Lerner) & A Guy Named Juice (Tone Loc) who Biderman was Supposed give the Money to Juice buts gives it instead to Preston. Preston spends all the Money & The Villains try to go after Preston. The Movie has A lot of Pratfalls & Silly Stuff but I liked it enough. Anyway Blank Check is a Fun enough Movie that shouldn't be Taken Seriously. Anyway I Give Blank Check 7 out of Ten. Anyway Bye."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jwhale9382",
        "review_rating": "1",
        "review_title": "I'd pay big bucks not to see this movie.",
        "review_detailed_main": "I saw this movie once a long time ago, and I have no desire to ever see it again.\n\nThis movie is about Preston Waters, a hard-lucked preteen, who always seems to be overlooked by his family and who always seems to be short on cash. All this changes when a bank robber runs over Preston's bike and passes him a blank check as compensation. Preston uses the check to withdraw $1 million from the bank (ironically, the money belongs to the bank robber who gave him the check). Preston then buys a mansion and says that he's working as the assistant of a mysterious and wealthy backer named Mr. Macintosh (named after his computer). After that, he just goes crazy with the money.\n\nOn paper, this sounds like a great idea. However, on screen, it is one of the emptiest movies I've ever seen. For one thing, it's too unbelievable. I know some parts of the movie were meant to be incredible, but I draw the line at a twelve-year-old boy going out with a thirty-year-old woman, and being put in charge of a imaginary person's small fortune. Also, this was a shallow movie with weak acting, a predictable plot line and characters who are less than memorable. The characters were either cheesy, over the top, annoying, or underdeveloped. But \"Juice\" was a funny character.\n\nIf you're looking for a good movie to watch with your family, skip this one."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "alphaxi",
        "review_rating": "6",
        "review_title": "Enjoyable \"just because\" movie",
        "review_detailed_main": "My definition of a \"just because\" movie is one that doesn't have any profound message about life going into it, and is meant to be thoughtless for the audience.\n\nThis movie successfully fills that niche, and while I believe a movie needs to say something for it to be considered more than mediocre, this is probably one of the better meaningless stories out there today. For some, that is saying very little, but those who are seeking something that is a child's fantasy, and not particularly taxing on the mind, will always have this movie to consider.\n\nThere are numerous details of the story that I could go into to further argue the point that it is innocent, and simple fun, but to do so would be to ruin any enjoyment that this movie has to offer, because this movie is without a doubt not something you would want to watch repeatedly. I have seen this movie exactly twice, and that was enough for me. Would I watch it if it were playing? More than likely, but this is a movie that just gets old fast due to its meaninglessness."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "iamwinnienduts",
        "review_rating": "1",
        "review_title": "Great job Disney on educating little kids that grooming is ay ok 👍🏽",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "majidy_pam",
        "review_rating": "6",
        "review_title": "Best left in the 90's",
        "review_detailed_main": "Fun when I was 7 (b.1987) but awkward after 1999. It's a kid fantasy but terribly impractical. I stumbled across this in 2021 on Amazon prime and thought it would be a fun trip in time- it partially was. Shout out to super adult Henry for his energy."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "rosinryanz",
        "review_rating": "1",
        "review_title": "Utterly Awful!",
        "review_detailed_main": "Blank Check is easily one of the worst films of the nineties. The plot is completely pointless; its overtones of lonliness are pathetic. Do you really believe a twelve year old acting as a personal assistant for a millionaire could accomplish everything in this film, like buying a mansion for a mere $300 grand. The notion, let alone the bargain-basement price, will only be believed by the most gullible viewers. Please, respect your intelligence and don't watch this awful, awful film."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jdarryls",
        "review_rating": "10",
        "review_title": "It is for Fun, not to make a statement about the meaning of life!",
        "review_detailed_main": "This is a good movie. Something fun about watching money be blown at a super rate, especially from a kid's point of view. Take it for what it is, a fun little movie about a kid's dream coming true, and what a kid might do with $1 million dollars. Don't like it, don't watch it. They make movies for the watchers, not the people that have nothing better to do then complain in their lives."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "filmbuff-05706",
        "review_rating": "6",
        "review_title": "Disney's Double Standard Movie. That Said, It Could Be A Good \"Laugh With Friends\" Movie.",
        "review_detailed_main": "I had to watch this movie in high school, and at best it's a guilty pleasure movie. You could watch this with friends and laugh at how ludicrous it is.\n\nYou could also laugh at the double standards that this Disney movie provides.\n\nThe plot centers on a young boy who is given a blank check. He decides to casually fill it in for $1 million and manages to buy a mansion and servants and stuff with it, without the notice of his parents.\n\nHe then meets an adult woman that he falls for, and he takes her out on a date. At the end, when the boy has to let go of his money and his crimes, they agree to date when he is older, and she kisses the little boy passioniately on the lips.\n\nThis movie would not exist if it was a grown man kissing a little girl the same way.\n\nAnd to think that this Disney movie was released in 1994, the same year as The Lion King, The Return of Jafar, Angels In The Outfield, and The Santa Clause.\n\nSo, if you want to see a cross between Catch Me If You Can and Lolita from the House of Mouse, or a dumb movie to laugh at (not with), then this is the movie you need to see. However, I think most people would not, and in that case, your check for paying for this movie should also be blank.\n\nReverse Recommendations: See any of the movies I named here instead."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "odiebeau",
        "review_rating": "2",
        "review_title": "Awful film, hasn't aged well",
        "review_detailed_main": "Watched this with my 9 year old on Disney+.\n\nPretty dated in terms of the cinematography and technology (as expected). The plot was flimsy and not engaging.\n\nUncomfortable romance storyline, with an 11 year old trying to get with a 30+ year old woman. My daughter asked if they were boyfriend and girlfriend! Huge and horrific double standard which doesn't stand up today."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "getmeagasmask",
        "review_rating": "",
        "review_title": "If not a guilty pleasure for you, expect a child's Disney movie (and nothing else)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "d_stack04",
        "review_rating": "2",
        "review_title": "Wow....just....wow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "sadik35",
        "review_rating": "7",
        "review_title": "GOOD enough to get you thinking millions!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "lmntathffan",
        "review_rating": "1",
        "review_title": "This is the kind of movie that makes you want to throw up",
        "review_detailed_main": "Bad Actors, bad filming, choppy dialog, shallow characters, but then again it was a bad premise in the first place. Basically, an 11 year old who is bullied because he has very little money is given a blank check by a moronic criminal. Of course, the 11 year old happens to possess enough technology and intelligence to purchase a house, cash a check for 1,000,000 dollars, and even foil three bumbling idiots, reminiscent of the three stooges.\n\nPreston Blake is an annoying, obnoxious, boy, who decides that, when written a blank check by a complete stranger, he will take advantage of the situation as best as he can. In other words, he wanders into a bank,\n\nhands a teller a check he makes in his printer, and miraculously walks out with a million bucks in cash. Preston is also apparently capable of reaching incredible speeds on his bicycle, due to the fact that a man driving a Jaguar after Preston and his 10-speed could not catch him, even when Preston jumped a row of cars.\n\nOf course, with every hokey adventure movie, there has to be hot heroine. In this case our hot heroine is a child molesting FBI agent who dates the eleven year old Preston, and promises another date when he turns 17.\n\nHowever, the absolute worst aspect of this film was not its casting, nor its sloppy dialog, such as \"The only other way I could think of skinning a cat is to stick a hose up it's butt and then pick up the fur\". It was, rather, the entire fact that nobody in the entire film seemed to realize that the FBI does not give a damn about random people . What I have failed to explain is that Preston uses the alias \"Macintosh\" to masquerade as an entrepreneur of sorts. Of course, the FBI finds this intriguing and sends our young heroine after Preston, who uses his 11-year old wit to first scream when lobsters fall on his face, then treat her to hamburgers, finishing with a ridiculous romp through a cemented area where water jettison's from the ground. Our heroine fails to realize during this whole adventure that the criminal the FBI is pursuing is slipping and sliding right behind the two, as they make their way to Preston's limousine, complete with a 1-dimensional driver who never fails to provide cheap, 3rd rate laughs that the whole family can choke on.\n\nOverall: 1/10 is incredibly gracious for this film. I don't see how it only has a 4.4/10."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "ashleyparsons115",
        "review_rating": "7",
        "review_title": "Hilarious typical movie!",
        "review_detailed_main": "If you love movies about young children this is the movie for you. It is great. It's about a young boy who soon inherits lots of money and goes crazy with it. Clearly this could never happen but it is a great movie to watch non the less. To see all the situations he gets himself into and all the crazy stuff he buys really makes the movie. You have to have an open mind when watching since it is very unlikely this would happen. I loved watching it as a young child and still do. It's a great movie for children. It will definitely make you laugh. It is a lot like the movie \"Home Alone\" in that it's also about a kid who has a house to himself and goes crazy. He also has to try and escape the bad guys who are after him.\n\nIt's a great laugh and a good movie for the whole family to watch!"
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jennypadavala",
        "review_rating": "2",
        "review_title": "rip off of home alone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jennadavies-81013",
        "review_rating": "1",
        "review_title": "Are you joking me with this movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "skatrwrest-93944",
        "review_rating": "10",
        "review_title": "It's A Classic Family Movie Fun For All Ages",
        "review_detailed_main": "When I was 10yrs old this movie came out and I loved every min of the film. Every one as kid always fantasy or wish they could be millionaires and some do become quite successful in their lives. Especial when parents teach you a life lesson that no movie that is entertaining is not meant to be taken serious doesn't teach kids the important things in life. Preston parents ignore him he bullied by his two older brothers who get rewarded with a new computer he is bullied school. The bad guy run over his bike and brings the chain events depicted in the movie. It's one thing to not like this movie but insulting and claiming that you as reviewer will know how if parents let their kids watch this classic film. Not my job and nether is it anyone else ether."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "xgray-03873",
        "review_rating": "1",
        "review_title": "Do Not Watch This Movie!",
        "review_detailed_main": "I'm sorry, but this is by far, one of the worst live-action Disney movies that I've ever seen. The jokes are not funny, the main \"protagonist\", Preston is a little brat that has no idea on how economics really work and who's idea was it to have a romantic subplot with a 12-year-old little boy and a 20-something year-old FBI agent?! That was just stupid. The only thing that's good about this movie is Tone Loc's performance, but other than that....all of the character are freaking' idiots and the father is complete douche-bag.\n\nBottom line, do not bother showing your kids this movie. It will send them the wrong message!"
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "raisleygordon",
        "review_rating": "",
        "review_title": "\"Home Alone\" meets \"Richie Rich\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Freak-10",
        "review_rating": "1",
        "review_title": "What an unbelievably lame piece of garbage.",
        "review_detailed_main": "I almost called HBO and demanded my money back for the month just because they've been airing this movie. I can just see the movie execs sitting around going, \"Okay, we need to come up with something that's just like Home Alone, only we'll add a bunch of cash for the kid, hire cut-rate actors, and oh yeah, we'll make it a lot less funny!\"\n\nOkay, maybe not the last part, but that's basically what you've got here. Not even worth seeing if someone else rents it. And as a movie for kids? Forget it. I wouldn't let my kids see this, not necessarily because of bad-taste jokes, but because I wouldn't want them to say, \"What were you thinking showing us that lame piece of garbage, Dad?!?!\""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "sammofrank",
        "review_rating": "2",
        "review_title": "A check not worth cashing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "benghill",
        "review_rating": "3",
        "review_title": "This movie is cruel to children",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "frankiacopelli",
        "review_rating": "2",
        "review_title": "Clichés everywhere I look in this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "StevePulaski",
        "review_rating": "8",
        "review_title": "A kid's fantasy brought to life to be unfairly criticized",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "arielsiere",
        "review_rating": "1",
        "review_title": "Clearly the worst movie ever in the universe",
        "review_detailed_main": "Oh my god Blank Check has got to be one of the worst Disney movies from 1994 along with The Return Of Jafar the unnecesary and first Disney direct to video sequel, the characters are unlikable in this movie, no one was likable, it even uses a cliché about the sweet kiss or whatever it is, not only that, but this movie caused Disney to go downhill since 1994- present. Even Miguel Ferrer the voice actor of Shan Yu (Mulan) and Death (Adventure Time) had to be in this abomination. Most of the characters are stereotypes and if you want to watch a better movie from 1994 go watch The Lion King because this movie is so much fun and entertaining instead of this film."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "buppy",
        "review_rating": "",
        "review_title": "\"Blank Check\" is a great movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Walter_Skinner",
        "review_rating": "3",
        "review_title": "Very typical 90s movie.",
        "review_detailed_main": "In the same vein as Disney movies such as the Parent Trap this is the embodiment of a movie that would had been shown on the Disney channel before they started making their own movies, or it would just be shown on TV. The plot of this movie is simplistic and predictable, the acting is passage, and the jokes are so lame that they make Dane Cook look good but with typical kids movies like this you don't exactly expect greatness. This movie has a fair rating on IMDb. A very bland obscure 90s movie that no one saw or even if they did, they forgot it to make room for other things. It was very clear that this movie was made for profit. No true effort was put into this movie from the characters to the humor."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Dhsmith37",
        "review_rating": "1",
        "review_title": "Quite Possibly...",
        "review_detailed_main": "The worst movie I have seen in a while. Yeah its fun to fantasize, but if that is what you are looking for, I suggest you see Brewsters Millions. This was just terrible and corny and terrible at being corny. Unless you are five or like terrible movies, don't see this one."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "noizezzormusic",
        "review_rating": "5",
        "review_title": "Great Kids Movie People Overthink",
        "review_detailed_main": "Blank Check is about a young boy who writes a check for a million dollars and gets a bunch of stuff and then learns a bunch of life lessons pretty much. The acting is better then a lot of Hollywood films I see today sadly enough. It doesn't really matter what I say though, this is meant to be a kids movie for people under the age of 12. I have to say I absolutely adore it up until around 60% when the movie takes a dive and Preston Waters begins to really annoy me with his immaturity. This teaches a lot of life lessons involving money which I feel is really important to children and I wish more parents would show this to their child.\n\nReally, this is just a really cute fun movie for the youngsters and is not meant for real film viewing, especially if you're a film connoisseur. I am still fully entertained with this movie until this day and this is still much better then 90% of the children's movies they put out today.\n\n5/10"
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "iankane-80079",
        "review_rating": "2",
        "review_title": "Nevermind a blank check, it's a blank movie",
        "review_detailed_main": "It's a Home Alone ripoff that has about as much money and materialism as it lacks in character, personality, or anything remotely entertaining. I don't really need to say anymore, do I?\n\nFinal Score: 21/100 (Cardboard Medal)"
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "UniqueParticle",
        "review_rating": "8",
        "review_title": "Love this delightful Disney movie",
        "review_detailed_main": "The first thing I watch on Disney plus and proud of it even though I've seen Blank Check at least 30 times. Great cast, feel-good, and great entertainment for a bit! A precious gem that is endlessly satisfying with important morals about money and growing up."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "TedStixonAKAMaximumMadness",
        "review_rating": "3",
        "review_title": "\"Blank Check\"- The pangs of nostalgia for a childhood favorite are overcome by a general sense of apathy and sometimes unease while revisiting this 90's family film.",
        "review_detailed_main": "Don'tcha just love nostalgia? Those warm, fuzzy and oft-forlorn feelings for days long since past. The yearning to revisit childhood favorites and return to a simpler, easier time. Everyone has those things from their past that bring back the memories and the magic. For many in my generation, it's all about the 90's- a peculiar time period indeed and a blur of experimentation and transition in the world of entertainment that supplied some classics... but also many duds.\n\nOne film in particular is most certainly a bi-product of this odd period in time- the 1994 Disney release \"Blank Check.\" It's a film that celebrates the excessive desires we all have as children, and for many of us watching it back in the day, it was the ultimate power-trip. A film that revolved around what any kid would do if they suddenly came across a million dollars. And we loved it! We loved seeing a child suddenly given near-limitless power, able to buy all the toys and video-games and play-things he wanted. It was pure magic.\n\nBut at the same time, our parents would collectively roll their eyes, shake their heads and scoff at the complete and utter lack of realism and consequence presented. But we didn't care... what did they know?! They're not kids! They're stinky old adults! They just didn't understand the movie like we did! And we knew we'd treasure this film until the end of time! ...well, until we grew up ourselves, that is. Yes, it's a bit of a sad thing to admit, but these sorts of childhood power-fantasy favorites just don't hold up when you revisit them as adults. We enjoyed \"Blank Check\" at the time because it was tailor made for the 6-12 age demographic. But that enjoyment is wholly replaced by a general sense of apathy and sometimes even startling unease when going back and revisiting it as we enter our late 20's and early 30's. We start to see why our parents scoffed and rolled their eyes... because often, these types of films aren't nearly as good as we think they are.\n\n12-year-old Preston (Brian Bonsall) just can't catch a break. His family is incredibly frugal. He can't afford to do fun things with his friends. And he is bullied by other kids. All that changes when he is given a blank check one day after a man accidentally runs over his bike. Preston tries to capitalize on the opportunity by filling the check out for a million dollars, not realizing that the man who crushed his bike (Miguel Ferrer) is actually a career criminal! A seedy bank official actually gives Preston the money, assuming he's being used as a middle-man for cover. Now, Preston has a million dollars cash to use any way he wants- toys, games, you name it! But the men he stole it from might just come looking to get it back...\n\nThe failure of \"Blank Check\" boils down to two huge fundamental issues I have with the story and execution of the film. That being the troubled and uneven storytelling on the part of director Rupert Wainwright and a frankly eerie and even disturbing tonality and focus that is impossible to ignore as an adult. The film is a complete and utter mess too often, to the point of distraction. Director Wainwright takes a simple enough premise but can't find an appropriate and consistent sense of pacing, composition or flow, leading to a frenzied and sometimes hackneyed final product that alternates between being filmed like a low-key police procedural and an Adrenalin-pumping music video. It's difficult to watch or let yourself get pulled in because it's completely scatter-brained, and the wonky storytelling also makes the many holes and gaps in logic in the script feel glaring and blatant. Wainwright also seems far too committed to making the film appealing to kids first and foremost, but it's to the detriment of the work. Too often he throws in kitschy camera angles and sped-up footage to emulate cartoons, and has the camera focus on comedic- relief characters (including a woefully unfunny Rick Ducommun who hams it up in the worst of ways) to the point it becomes transparent pandering. It's poor work, and a glaring example of how not to make a kids film. It feels like it's talking down to the viewers... not having fun with him.\n\nAnd then there's the creepy bits. Oh, boy... this film is not appropriate in the slightest. And I'm not talking about violence or profanity. I'm talking about tone and focus. This movie is a complete and utter nightmare to behold as an adult. From the presentation of our \"hero\" as a glorified thief who gets away with basically everything and faces little consequences until the final act (which I will not spoil), to making all of the adult characters the types of people kids will not respect, to a truly disgusting \"love story\"... this is not a good movie to show to young children. When I say \"creepy bits\", I'm not talking about potentially frightening scenes for children. I'm talking about incredibly uncomfortable scenes to watch for adults, including a prolonged subplot in which 12-year-old Preston goes on \"dates\" with the adult woman (the admittedly very sexy Karen Duffy) handling the finances, who openly seems to be \"flirting\" with a child. It's supposed to be played for \"Aww, adorable!\" moments... but the execution is just incredibly cringe-worthy and leaves you feeling unclean. As do the many moments where Preston openly manipulates, lies to and harasses people for his own amusement. It makes the film and the characters impossible to like.\n\n\"Blank Check\" might benefit from a fun premise and a strong central performance thanks to its talented child-star. But it's an ugly film with a mean-streak, morally questionable moments that adults will find worrying and sub-par storytelling. It's not the film you remember it being. And I give it a very sub-par 3 out of 10."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "Enjoyable kid's fantasy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "helpless_dancer",
        "review_rating": "2",
        "review_title": "This could have been called \"Home Alone Hits the Jackpot\"",
        "review_detailed_main": "A young boy comes into a lot of money and promptly begins to live it up. Unfortunately, the man whose money it really is happens to be very bad. He wants his loot back. When he discovers who has the bucks, he begins trying to get it back. He keeps getting foiled by this little kid who is just lucky enough to keep from falling into the evil man's hands. Sounds familiar, I'll bet. Very predictable, not interesting at all. Come up with something a bit different, ok guys?"
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "ggdollzfanatic",
        "review_rating": "4",
        "review_title": "Goofy Kid Movie",
        "review_detailed_main": "This movie is really goofy! I saw it as an 11 year old, and even then I thought it was pretty ridiculous! I would only recommend this film to kids under the age of 12. I really didn't care for it, but I do think that it answers some very good questions that kids need to be aware of, such as: 1)Does money buy happiness? 2)Should I lie (to my parents) about things I think they wouldn't approve of? 3)Does money buy friendships? 4)Is money everything? 5)Shouldn't I tell my parents when someone is trying to hurt me? Granted, these are very unrealistic situations, but I do think that if parents discussed these issues with their children, maybe they should watch this video as well, in order to show/scare their kids that lies have the potential to get you hurt."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "talllwoood13",
        "review_rating": "5",
        "review_title": "5 / 10 - brilliant back then maybe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "savagefrog-29306",
        "review_rating": "3",
        "review_title": "RICHIE RICH KNOCK OFF WITH PEDOPHILE????",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "chetanswamy",
        "review_rating": "10",
        "review_title": "I will remember this movie!",
        "review_detailed_main": "Its funny how I came across this movie. I was in a saloon in Orlando, USA getting a haircut and this movie was played there. I saw like first 15 minutes of the movie and loved it - the direction (the kind which used to be when I was little. I am 24 now and still loved the movie. LOL), the story, people in it etc. So, after I was done with my haircut I asked what was the name of the movie to the man who played it - \"Blanck Check\", he said."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Fair Home Alone Clone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "fantabulous-99669",
        "review_rating": "10",
        "review_title": "great and memorable movie.",
        "review_detailed_main": "Great movie. Could watch it multiple times. Enjoyable family movie with a great cast and nice story."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "VoodooKing",
        "review_rating": "",
        "review_title": "An Ok film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "UACW",
        "review_rating": "",
        "review_title": "On the Other Hand",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Hollywood_Yoda",
        "review_rating": "8",
        "review_title": "A Kids Dream",
        "review_detailed_main": "When you're an eleven year old kid, you dream of having all the money in the world. The dream comes true for Preston Waters when he's handed a blank check after a bicycle accident. A million dollars sounds like a lot of money to a kid, but it really doesn't go a long way, which Preston soon finds out. Just be forewarned that filling out a blank check is a crime itself, which isn't why the FBI is on Preston's tail.\n\nSpecial agent Shea of the FBI, working undercover at the bank starts to suspect that Preston and his \"boss,\" Mr. McIntosh (Preston's alias) are crooks who stole the money and laundered it with the bank manager. Tone Loc gives a raucous performance as Juice, the middle man in the money laundering scheme. Miguel Ferrer plays the actual crook, who ends up taking on the alias of Mr. McIntosh and Michael Lerner is the bank manager handling the scheme.\n\nIn recent years, there has been controversy surrounding this film and the kiss that Shea gives to Preston. In 1994, no one had a second thought about it being scandalous. It's a family comedy and it's not inappropriate."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "famelovingboy68",
        "review_rating": "",
        "review_title": "Ripps Off Home Alone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "byson5186",
        "review_rating": "10",
        "review_title": "Disney's Home Alone Movie",
        "review_detailed_main": "This is one of my favorite movies. I've heard this movie being compared to Home Alone. If you look at the movie cover, you'll see how it says, \"If You Loved Home Alone, You'll Love Blank Check.\" I've noticed many similar scenes to both Home Alone and Home Alone 2 as both movies were out by the time this movie was made. It is possible that the people who wrote and worked on this movie, came up with a lot of their ideas from Home Alone and tried to make a Disney Friendly slapstick humor of Home Alone with what a kid would do with $1 Million. I personally like this movie better than Home Alone. I feel like it has a lot more of a plot to it. In this movie, Preston tells his parents about wanting his own house, his own rules, his own money. While that might seem like a kid's dream he ends up being able to get $1 million. Some of the things that make this movie great. For one, watching this movie will take you back to the '90s. A lot of people from my Millennial Generation, old enough to remember the '90s miss those times considering life to have been really good back then. They try to remember life and entertainment back then. This movie shows an old computer in Preston's room. It also shows how rather than Preston buying things online like you would now, he just looks numbers up to call from a phone book. It shows some old arcade games and Preston having many TVs turned into his own virtual entertainment system. Something that still is incredible years later. It also shows '90s things like you see a lot of TVs that aren't flat screen. Also, one time I watched this with a friend my same age during the scene where we see Preston in the store riding a bike playing with the things inside the store. My friend told me he remembers when you used to be able to try things like that out at a store. I can't remember doing that as a kid. This movie entertains you showing all the things Preston bought. We see how a kid would spend all that money, he gets chased by the bad guys in this movie. We also see a lot of Preston's community in Indiana. Things like his neighborhood, a typical looking neighborhood with a castle house across the street, a really big bank in his town close enough that Preston rides his bike to, an amusement park, a water park, a public park (during the chase scene), Lots of really nice stores, businesses including Preston going to Tangerino's on a date. Also, one of the more memorable scenes from the movie where Preston and Shay dance in these fountains we all wonder where those fountains are. So, this movie is also better than Home Alone as we're more familiar with Preston's community than Kevin's in the first Home Alone. Also, a whole community of people are curious about who Mr. Macintosh is, not ever meeting him only hearing Preston saying he works for him. People gullible enough to buy things from a kid, and believe a kid who claims he works for somebody they've never met. All this action takes place in like only a week time. So this movie has great music, it's fast paced, and it's funny. This movie will end leaving us with a couple of unanswered questions we're all curious about. They haven't made a sequel for this movie, or even an explanation as to what would end up happening later. Preston's the main character so he's a character we like. But, we ask ourselves even if he mostly seems like a good kid other than a little bratty and selfish. But, seriously I'm sure people would eventually discover including Shay that Preston was behind all that spending and that fake character, Mr. Macintosh. He might even confess it to his parents as he said as the movie was ending about Mr. Macintosh how he shouldn't have fooled everybody and told his Dad that he'd tell him all about Mr. Macintosh the next day. So, did Preston confess to his parents about being behind the whole Mr. Macintosh thing, and how would his parents feel if they found out Preston got $1 Million and bought a house? So, we wonder if Preston as a kid would have been arrested or eventually arrested if the police found out? How much trouble would this get him into? We also wonder what would happen with all the stuff Preston bought? The people in the movie, especially the ones that would clear out the house should figure that a grown man would not want to buy all that kid stuff. That is stuff a kid would buy. The final question is does Preston ever get together with Shay? Disney did not consider it inappropriate to show like an 11/12 year old kid in love with a 30 year old woman, going on a date with her, and kissing her. I wonder if Disney could get away with that now? But, while they did agree to see each other when Preston was older, they said 6 years and as this movie takes place in 1993 that would mean they were supposed to see each other in 1999. How about now, over 20 years later? Did they eventually reunite and fall in love? It should not have taken long after the movie ended for Shay to have discovered that Preston was behind all that spending and Mr. Macintosh. But, she liked him enough and was a gentle person. I'm sure she'd forgive him and not take it too seriously. Overall, I'd give this movie a 10/10 as it's always an empowering movie for me to watch. I think most kids even kids of today would enjoy this movie."
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "soranno",
        "review_rating": "",
        "review_title": "Too farfetched to be worthwhile viewing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "IceCream-57",
        "review_rating": "8",
        "review_title": "Blank Check",
        "review_detailed_main": "I was pleasantly with how fun and entertaining this film was. For whatever reason, I had never heard of the film and had not seen it. What really helps this film is it has a good cast of actors. Now overall, they are B list actors, but overall good character actors nonetheless. The story is centered around the main character who is 11 years old, and it's his birthday. He is upset that his grandmother sends him a blank check. He goes to cash it and ends up with a check for a million dollars. But the money and check belongs to a local gangster- who wants his money back. After that, he goes after the kid and the adventure goes from there! This is a fun and good story!"
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "im_a_pig2003",
        "review_rating": "",
        "review_title": "the most fantastic film ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "jjamesedw3",
        "review_rating": "",
        "review_title": "Every Kids Dream",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "LKyounger05",
        "review_rating": "",
        "review_title": "Worst \"children's\" movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "Ryan-007",
        "review_rating": "",
        "review_title": "Like that could ever happen...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "LKyounger05",
        "review_rating": "",
        "review_title": "Worst \"children's\" movie ever!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0109287",
        "movie_name": "Blank Check",
        "movie_rating": "5.3",
        "review_username": "JamesValentine1979",
        "review_rating": "",
        "review_title": "oh no...",
        "review_detailed_main": ""
    }
]