[
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "pawanpunjabithewriter",
        "review_rating": "8",
        "review_title": "This will be remembered as the Bollywood Cult Zombie Movie",
        "review_detailed_main": "I wasn't in the best of the moods because when entering the theatre I planned to watch Shootout at Wadala, a movie of my second all time favorite actor. But, I had to settle for this one. This is the movie I started to Like Saif Ali Khan. I used to hate him. Coming back to movie, Bollywood hadn't witnessed zombies much. The way Koi Mil Gaya was a cult, rare SciFi Alien movie, which was very new to Bollywood and the 90s kids, similarly, this one, makes it's entry in a hilarious way not only in the horror comedy genre but a Bollywood Cult Zombie Movie which will be remembered over years. There are a few adult scenes in the movie, starts with one too, which nowadays aren't that big a deal. This is not only Horror Comedy, but mixed with lots and lots of adventure. People are always looking for adventure/jungle + comedy + good acting + good story + plot + great cinematography + something creative. This one has all. The direction, and cinematography isn't the greatest, but pretty much above average. I've watched this movie for about 3-4 times now, and can consider watching more. Not a keep watching anytime movie, but 2-4 times watchable. Also, I've heard second is going to get released too. Back to the movie, you'd love the experience of watching this movie for the first time. It's hilariously amazing. Yes, there is a margin it could have been better, but with the starcast, we don't expect more. Saif and Kunal both were exceptional. Vir Das overacted a little at times. This movie is really fun. I still remember that day watching the movie in the theatres with my friends and laughing out loud at many occasions."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "sorovpathak",
        "review_rating": "8",
        "review_title": "Might just be the Summer Movie of 2013 you're looking for!",
        "review_detailed_main": "I went in for the opening show expecting just as much as everyone else did from a film which built the hype calling itself the first ZomCom (Zombie Comedy) of Indian cinema, and I felt the movie delivered.\n\nThe storyline itself is pretty simple with two stoner guys taking a trip to Goa with their socially inept friend where the effects of a new breakout drug go horribly wrong for the partying vacationers. The rest is just classic zombie-killing fun with guns, knives, whatever-comes-handy and more guns! The fun elements come from the rough language used throughout which doesn't try too hard and admirable visual effects. The ending might be predictable for those who have watched a fair share of Apocalypse movies but the film itself was quite fresh for me since it didn't try to shove another love story down the throats of the viewers.\n\nThe acting was decent and the characters themselves were well-designed for this kind of film. Since it's a ZomCom, you might not get the gore scare you might be looking for. But if you enjoy youth-oriented comedies and are in for the Indian \"Shawn of the Dead\", this is the movie for you! Go watch it, before it's Gone."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "umer_uf",
        "review_rating": "7",
        "review_title": "Go Goa Gone is a refreshing change from your typical Bollywood mediocrity.",
        "review_detailed_main": "Go Goa Gone is a pretty good movie for the first of its kind in Bollywood. Apart from your typical Bollywood annoyances this movie was quite entertaining. Granted my opinion on this is fairly biased given my love for Zombie flicks, however I believe it stands on its own. The movie borrowed ideas from Zombieland and Shaun of the Dead that were easily recognizable and familiar; although nowhere as blatantly as many other Bollywood movie. Also, the setting of the movie felt eerily like the video game: Dead Island. Few scenes felt like they were exactly the same as some missions in the game.\n\nThe overall acting was good and the jokes were smart and stuck for most parts, some more than others. The chemistry between the three protagonists, and overall cast was spot on. Saif Ali Khan's pseudo Russian Mafioso was an entertaining gag when originally introduced but it got a little old and drabby after a while. The female lead in the movie was underused and felt like a background character, other than being your prototypical Bollywood 'Damsel in distress'.\n\nThe plot is very simple (like any other zombie movie) and can be easily figured out. The movie follows a very typical zombie flick formula: Intro to the main character, putting them in a setting of zombies, explaining the origin of zombies (little lacklustre in this move), figuring out how to fight and kill zombies, the lack of ability to shoot the zombies and mastering the headshot by the end of the movie, and so on. This movie is as original as any zombie movie can get. Every scene of the movie was fairly predictable. Not to say that this is a bad thing, all zombie movies are alike. It's the chemistry between the characters that really separate the greats from the rest. As liner as this movie was, the surprising anecdote about zombies which was cheesier than the cheesiest cheese cake, felt original. I laughed out loud several times during the movie; admittedly the humor was along the lines of 3 Idiots and Delhi Belly i.e. buddy movies with a lot of raunch.\n\nThe movie was 1 hour and 48 minutes in length, which is a little long for a movie of this sort. 1 hour and 30 to 40 minutes max would be ideal for a zombie flick. It's hard to keep the audience immersed. The jokes get lazy and pushy and the situations where protagonist has to escape the zombie hoards get nuttier and nuttier to the point of complete disbelief\n\nMy biggest complaint against this movie is its anti-smoking campaign.\n\nIt's almost ridiculous to see an anti-smoking campaign in a movie about pot-smoking booze hounds itching for parties that feature Mary Jane. There was an abundance of smoking scenes that featured small messages warning against smoking. It's almost like the NRA running ads that featured gun-related killings and having messages popping up simultaneously that say \"Don't shoot people in the face. Shooting people in the face is bad.\" I understand that the movie means well and doesn't want to glamorize smoking, but omitting smoking altogether from the movie would be more effective anti-smoking rhetoric than a miniscule, meaningless and insincere insulting sign at the bottom of the screen.\n\nOverall though, I would recommend this movie to any zombie fans out there. If you're not a fan of Bollywood but enjoy zombies it's still worth the watch. The nod to Bollywood cheesiness near the end of the movie was worth the price all on its own.There were obvious \"Are you serious? He would totally get bitten in that situation.\" type of scenes and the anti-smoking messages were very annoying. However, they are forgivable because it's Bollywood's first attempt at the genre and from the looks of it they have done a good job."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "vishalsmail33",
        "review_rating": "",
        "review_title": "Indian Cinema dares to experiment and wins!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ucmspw",
        "review_rating": "7",
        "review_title": "AWESOME introduction of a new genre in India",
        "review_detailed_main": "If Illuminati had any reservations while producing this risky film they should be laid to rest.The movie has the right pace and gels well with the youth.The movie is teeming with witty one-liners and comedy sequences.The songs are quite peppy and keep going on in your mind for a long time after watching the movie.The best role is of Kunal Khemu who just steals the show a bit from Vir Das(loved him in Delhi Belly).Pooja Gupta looks hot all the time.Saif's cameo is awesome as pseudo Russian 'BAREES'(Boris).Their antics keep the audience rolling with laughter in major part of the movie.Some of the dialogues are just awesome\"Haan Dilli Se Hun Bhainchod\",\"Jungle Ke Beech Main Dumbcharades Thode Na Khelunga\"and \"I Keeel Ded People\".A bit loose ending but isn't ending movies like this the hardest part?.Hint of a sequel? We'll have to wait and see the fate of this one."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ckaran80",
        "review_rating": "7",
        "review_title": "Decent experimentation.....but its comedy stealing the show again...",
        "review_detailed_main": "Go Goa Gone is Bollywood's first zombie movie and the experiment has turned out to be a fair one.With that said, there are many loopholes with the zombie concept but is completely overshadowed by comic performances...\n\nThis being the first zombie movie, the makers have done a decent one and they do not try to exaggerate the 'zombie' concept.As a viewer, you really enjoy this different trend in bollywood movies.The script is good and nicely executed.The characters are well managed and zombie costumes are decent.But its the comedy nature of the movie which makes an otherwise okayish movie better.\n\nAs far as the cast is concerned, Saif Ali Khan does justice to his unique character,Vir Das is awesome ,Puja Gupta and Anand Tiwary are average, on the other hand its is Kunal Khemu who steals the show with his brilliant comic performance.\n\nNegatives - Silly concept of 'drug use and turn into zombie', Building of the climax scene.\n\nWatch out for - Comedy and perfect one liners,Great music, background score.\n\nStandout performer - Kunal Khemu...his best up to date\n\nVerdict - There may be flaws related to zombie concept, but watch it as a comedy movie especially for Kunal Khemu."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "tijo-19",
        "review_rating": "10",
        "review_title": "Very entertaining!",
        "review_detailed_main": "I gave this movie 10/10 simply because I found everyone's work commendable. This is definitely one of the best comedy movies in Hindi cinema. This movie will unfortunately not appeal to an audience that enjoys the big budget movies of the Khans ( no, not in the same league). Kunal Khemu and Vir Das have excellent comic timing. The dialogs were hilarious. The songs are very catchy!! The girls in the movie are great eye-candy. Refreshing is a word that comes to mind!! The other lesser known actors outshone Saif Ali Khan. It is fair to assume that there could be a sequel based on the way the movie ended. I am going to repeat. Refreshing.Entertaining.Funny."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ketgup83",
        "review_rating": "7",
        "review_title": "Thumbs-up to the makers for trying out something new.",
        "review_detailed_main": "Go Goa Gone was a complete surprise with engaging theme , hilarious moments and nice songs.\n\nGroup of friends get stuck on an island in Goa when they discover that pills consumed by guest at a raunchy party are turning into zombies. They along with so-called Russian mafia must fight with these man- killing creatures to come out alive from the island.\n\nFrom the director of entertainments like 99 and Shor In The City , Krishna D.K., Raj Nidimoru gives you another wonderful story that is completely different from what you have witnessed on Indian screen. The theme is niche and will be acid test for them if it is accepted by Indian audience. The film starts off very will with Kunal Khemu and Vir Das tickling your funny bone. Directors do not waste much time and gets into crux of the plot and with introduction of Saif Ali Khan , the movie becomes more interesting. Till interval , you will be engaged and entertained but the second half becomes little monotonous and climax scene could have better executed. Krishna D.K. and Raj Nidimoru are getting better with each film and this one is no exception. Screenplay is completely tight. Art direction and cinematography is awesome. Dialogues are funny. Music by Sachin-Jigar is foot-tapping with slowly- slowly being pick-up from the lot. Performance Kunal Khemu , Vir Das and Saif Ali Khan is note worthy. They are amazing and will make sure to entertain you. Anand Tiwari and Pooja Gupta do justice to their part.\n\nOverall , GGG is completely different from what you have observed in Indian Cinema and thumbs-up to the makers for trying out something new. Good 3/5"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "DareDevilKid",
        "review_rating": "9",
        "review_title": "A Horror-Comedy Masterpiece - Right up there with \"Shaun of the Dead\", \"Tucker & Dale vs Evil\", \"Sundown: The Vampire In Retreat\", \"Cockneys vs Zombies\", and \u0002",
        "review_detailed_main": "Reviewed by Dare Devil Kid (DDK) Rating: 4.5/5 stars\n\nI must admit that I'm a hardcore fan of the zombie sub-genre in the pantheon horror movies. So it was exhilarating to watch \"Go Goa Gone\" in which directors Krishna DK and Raj Nidimoru have taken major strides in introducing zombies to the mainstream Indian audience. While baptizing this all important and long overdue initiation, they have also succeeded in hemming an impeccable, gut-busting horror comedy a well.\n\nThe film crackles with hilarious dialogs, nail-biting sequences, a fluid plot, a coherent yet energizing narrative arc, zany and madcap encounters ranging from the unpredictable to the completely outrageous, brilliant cinematography, and finally spot-on direction from the first frame to the last. The praiseworthy performances, especially from Saif Ali Khan (surprise, surprise) and Kunal Khemmu, only add to the overall viewing pleasure. Puja Gupta's role definition and her enactment are the perhaps the only minor letdowns in this otherwise brilliantly energizing film, but then again, she does provide great eye-candy. So, perhaps that was how her role was meant to be, so who's complaining.\n\nThank God, that the producers set out to make an adult oriented film and were contended with the 'A' certificate, cause the expletive words, gore, wicked jokes, sexual references, and mild exposure (still nothing compared to those tasteless item numbers), are vital for a film of this ilk to work.\n\n\"Go Goa Gone\" will go down in the annals of Indian Cinema as a pioneering film that shall hopefully, allow other filmmakers to explore zanier sub-genres that are already popular in other international film circuits. Not only one of the best Indian horror ever, but one of the best horror comedies ever made, even when compared to its western counterparts. Am absolute delight and complete entertainment for a cognizant adult audience. If you want real entertainment, and want a much-needed break from those myriad nonsensical masala films masquerading in the guise of entertainment, then dash to your nearest movie theater and catch the next show of this delectably wicked gore- fest."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "culturedogs",
        "review_rating": "7",
        "review_title": "Go to Go Goa Gone",
        "review_detailed_main": "Over the past ten years, the description \"Bollywood horror film\" is becoming less rare, especially as Indian film distributors make more attempts to exploit international markets.\n\nThere has been a translation barrier to cross in that regard, however, by which I do not mean just the Hindustani language, but a film language and a cinematic mode so intimately tied in to the popular music culture, that it seemed (to foreign eyes) to turn even genres like action and science fiction into sprawling musicals.\n\nThis is my second Bollywood horror watching venture, following 2003's Bhoot (which starred Ajay Devgan and Urmila Matondkar). When I first saw Bhoot, a ghost/ exorcism horror film, I supposed that director Ram Gopal Varna was inspired by American horror films like The Exorcist and Rosemary's Baby. I had not yet seen Takashi Shimizu's Ju-On: the Grudge, but once I had, I saw its influence all over the set design as well as other aspects of the film.\n\nBhoot, while not the first Bollywood horror film, marked a trend of Indian horror filmmakers joining something like a common culture of international cinematic horror creators, finding modes that would find greater international success.\n\nSo now, here comes Go Goa Gone, which has been (aptly) described as a zombie (horror) comedy, although, clearly, Raj Nidimoru and Krishna D.K. have seen Shaun of the Dead, which nearly makes this a ZomRomCom.\n\nThe movie mostly focuses on a couple of hapless stoner/ cubicle dwellers, Luv (Vir Das) and Hardik (Kunal Khemu), a pairing not unlike that of Shaun of the Dead's Simon Pegg and Nick Frost, especially since Luv is the more ambitious of the two, particularly on the romantic front, and he begins the film conflicted about the next step in his ongoing relationship with Priyanka (like Shaun and his commitment problems in SotD. When he makes the decision to \"clean up his act\" and stop smoking (one presumes tobacco AND pot) and drinking to propose to his girl, it ends badly. When Luv and Hardik's far more responsible and slightly more successful roommate Bunny (Anand Tiwari) gets the opportunity to go to a business seminar at a luxurious resort in the West India state of Goa, Hardik exploits the trip as an opportunity to help his friend Luv get over being rejected and... well, to party.\n\nOnce there, Luv encounters Luna (Pooja Gupta), and decides to crash a party (allegedly run by Russian Mafia) on an island off the coast of Goa in an effort to get together with her, dragging his buddies Hardik and Bunny along for the ride (the island party scenario also seems to be a call back to the proto-Bollywood horror, Gumnaan (1966), the movie that the West mainly knows from the song \"Jaan Pehechan Ho,\" which made its' way into 2001's Ghost World, and a beer commercial in 2012).\n\nOf course, this scenario ends up in the film's zombie outbreak, precipitated, in this case, by an experimental combo of drugs disseminated at the party. The guys wake up in different areas of island, eventually finding each other, and hordes of infected/ undead folk with a hunger for the living.\n\nEventually, they run into a couple of folks they take as Russian Mafia types, one of whom, Boris (Saif Ali Khan) has taken rather nicely to his new role as zombie killer (he first turns up, armed to the teeth, and blowing the hordes away, saying \"I kill dead people\" (which, somehow, I can only take as a zombie movie take off on M. Night Shyamalan's line from The Sixth Sense).\n\nPoola Gupta's Luna is appealing and modern enough, though more of a throwback to traditional Bollywood heroines (i.e., it's less than clear that she will end up with any of the film's heroes).\n\nIt does take a while to get to the zombie killing action (a full 40 minutes out of 111), but the movie is not without the requisite inventiveness needed in the zombie action set pieces (as zombies are dispatched by having flashlights shoved sown their throats, and by shotgun blasts to the head, followed in slow motion), and Das, Khemu and Tiwari have comedic chops that are up to the task; Saif Ali Khan's Boris is something like a Desi/ Russian take on Bruce Campbell's Ash, and fulfills that role very well.\n\nRaj and DK offer characters who, like those in SotD and Zombieland, are very aware of the zombies of (Western) pop culture (though Hardik wonders if his Christian cross would be an effective weapon against the zombs). It may be a bit derivative (i.e., the scene where Luv is convinced that they can get around a zombie horde by blending in), and there are some plot points that seem to go nowhere at all, but the film was a welcome diversion, and a reasonably original entry into the zombie horror genre (and this at a time when we seem overloaded with same on TV and in feature films).\n\nAlso welcome were the references to modern office culture (a meme about learning from experience, linked to a poster with Steve Jobs' face on it, gets twisted into a recurring line about survival) and sociopolitical ideas (as when Hardik, less than helpfully, offers that these undead were created by \"globalization\").\n\nI'm not too sure how this film is playing in the Indian movie-going culture, but horror fans of any nationality, particularly fans of horror comedy, will have plenty to enjoy here."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "MrSlickJerk",
        "review_rating": "3",
        "review_title": "First Bollywood Zombie Comedy is a Fail",
        "review_detailed_main": "Bollywood tries to go Hollywood. Fails!!!\n\nI am not a fan of Bollywood movies but This one seemed like something new and I just wanted to see how good is this experiment of Bollywood. It looked quite funny in trailers but in actual it is not that funny. The characters were terribly played by the actors. Kunal Kemu plays the role of a philanderer. I just can't believe that character played by Kunal Khemu could get laid.\n\nGood bits:\n\n1. Something new to see from Bollywood.\n\n2. Not another love story.\n\n3. Not those typical Bollywood moments.\n\nBad bits:\n\n1. Terrible acting except Saif and Das.\n\n2. Not much of Violence, Gore and Gun play that you would expect in a Zombie movie.\n\n3. Plot holes, illogical even for a ZomCom.\n\nVerdict: You can enjoy this movie if you have never seen any Zombie Comedy before."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "kunder-akshay3",
        "review_rating": "10",
        "review_title": "Raj Nidimoru and Krishna D.K Rock again",
        "review_detailed_main": "Coming from the directors of 99 and Shor in the City, both of which have a cult following in different age cinema , Go Goa Gone also does the justice to the tag of Different Cinema.\n\nZombies concept was never used in Bollywood until the forgettable Luke Kenny's \"Rise of Zombies\" which released last month and went unnoticed.\n\nWhat makes GGG work is the plot with a comic element as the center. Kunal Khemu steals the show with his comic timing.(Praying to God and ending with Jai Hind is what will stay with you even after you leave the Cinema Hall) Vir Das is natural as always. Nice to see Anand Tiwary(Remember Mr. Pappu in Udaan) after a little gap.Confident Debut by Pooja.\n\nSaif is full on in his Russian avatar as Borris(Bareessss as he likes to b called in it.)\n\nNo dull moments in the movie which makes it more of great watch. You will always be giggled by some or the actor by their comic timing.\n\nBut in the end its still the Dierctor's movie. Raj and DK have stuck to what their previous movies had best in it and thats the comic timing(I am using this word the third time in my review because i seriously feel this is what makes us Raj and Dk's all three movies a gem to watch).\n\nStill waiting for my reviews, 10/10"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "A novel subject for Indian viewers, which majorly works because of its raunchy, comic dialogues and Kunal Khemu, more than the theme itself.",
        "review_detailed_main": "A decent project talking about Zombies(for the first time ever) in an enjoyable comic manner clearly represents the appreciable welcome change sprouting in our Hindi film industry at the present. The new, fresh young minds are here to try something novel, defying all those over-used or corroded subjects and its now the turn of the viewers to express their visible consent for this change through their fair acceptance of such innovations at the box office.\n\nHaving said that its not that GO GOA GONE is a flawless movie with everything falling in the right places throughout like a perfect entertainer. The film does has its big drawbacks and is sure not a masterpiece in any cinematic terms or otherwise. But at the same time, it is a project which largely manages to entertain you despite of having \"a completely foreign plot\", with no history or mention of its premise in our country's literature or tradition. In other words, yes we have seen dead people or evil spirits killing many in our horror films, in the form of walking dead bodies in the past. Yet the word ZOMBIE (representing the similar concept) was never used here earlier till date and that's the reason the attempt falls into the category of being an inventive and courageous one, quite evidently.\n\nFurther, GO GOA GONE can also be easily placed among all those inspired films which are more or less modeled on a western source such as SHAUN OF THE DEAD (2004) or ZOMBIELAND (2009), particularly aiming at the multiplex audience. But still I am not willing to criticize the movie on the above grounds because it at least breaks the ice and is daring enough to give us something never tried before in Hindi Films, representing the much desired change and an awaited make-over.\n\nThe film begins on an entertaining note as a funny young project and then fairly manages to keep you engaged in its first half mainly through its humorous, raunchy dialogues (mostly) written around sexual references. The concept of zombies (or the comic horror element in it) enters only after a good 40 minutes (in a 110 minutes film), which clearly indicates the apprehensions in the minds of its makers too. Post interval, since the thin plot has nothing else to reveal, the grip is lost and we only have the chase sequences here shot fittingly. The easily predictable climax becomes a spoils sport once again but still the funny expressions & many well written youthful conversations don't let you write it off so easily and the film positively turns out to be an entertaining one time watch in the end.\n\nIn exact words, what actually works in GO GOA GONE is not the zombies or the ongoing chase game played with the horrifying faces. On the contrary it's the fabulous dialogues and the amusing comic timing of Kunal Khemu, which becomes the unexpected winner here right from the word 'Go'. Plus it's the intelligence with which director duo Raj & DK,amalgamate the two conflicting emotions of fear and humour together on the screen with a brilliant ease and conviction. Particularly I really loved the way they introduce or educate the Indian viewers with the concept of Zombies in just 2 minutes without any confusion.\n\nInterestingly, only a few weeks back another film on 'the zombie factor' was released titled RISE OF THE ZOMBIE touted as the first ever Indian Zombie movie. But since it was quite a weak film comparatively, so GO GOA GONE is sure going to be remembered as 'the pioneer one' forgetting the former in the coming years. Apart from its terrific dialogues, GGG also has few appealing songs (including the hugely likable 'Khoon Choos Le' & 'Babaji Ki Booty'), an exciting background score and an eye catching cinematography which together take you on to that lonely beach of Goa right away, without getting tensed or distressed.\n\nHowever since the film is only focused on this one plot only, it does become monotonous and seems to be walking on the same path (sequences) repeatedly towards the end. Also the big name of Saif Ali Khan associated with the project is not there with any worth praising performance as such and his part is more like a lengthy cameo only in his own co-production. Saif is good, but I frankly didn't find him that impressive at all as was being projected in the promos. Out of the three lead performances, Vir Das is great in his underplayed character & Anand Tiwari is a delight to watch as the innocent one. But without any second thoughts, the film entirely belongs to Kunal Khemu and the dialogue writer alone. Especially, Kunal's performance becomes the backbone of the project here and he is sure going to get many more similar offers post GO GOA GONE as it seems. Puja looks beautiful and does fine whereas the rest of the supporting cast has nothing significant to do in the film as they are all mostly playing the walking dead bodies.\n\nIn all, along with its visible drawbacks, GO GOA GONE is based on a novel theme, has got performances and many hilarious moments to enjoy in its less than 2 hours of duration. So you should indeed give it a try as such path breaking attempts need to be encouraged & praised in order to get more (& better) quality products in the future."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "lakshaydulani",
        "review_rating": "1",
        "review_title": "Most Stupid Film",
        "review_detailed_main": "This is surely one of the most stupid movie of this time.\n\nThe actors are shown so desperate for smoking and drinking like college kids.\n\nI don't think even young college kids will find them funny or cool.\n\nNo story, average music, stupid characters, boring lines\n\nKunal Khemu and Vir Das try hard to look cool but fail miserably.\n\nSaif Ali Khan always try to look cool and \"western\". You can import a western villain i.e. Zombie easily, but please learn the art of movie making and story telling.\n\nI don't have enough words to describe its miserable level of story\n\nNo twists in the story\n\nComic moments are few and when they are, they fail to tickle your funny bone as you would expect from a comedy movie\n\nWaste of time"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "The perfect torchbearer of Zom-com in Indian celluloid; Go for it..it's quirky,zany laugh riot..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "creedreaper",
        "review_rating": "7",
        "review_title": "Finally the Zombie Apocalypse hits India",
        "review_detailed_main": "For those of you who are big fans of Dawn of the Dead, Resident Evil Series, The Walking Dead will surely enjoy this. I was really skeptic to how Bollywood will transition into Zombie Apocalypse, although they approached it in Shaun of the Dead style, the transition was good and it worked.\n\nThis is not for average audiences, so those of you who like romantic crap, or cheesy sadak chap action, then this is completely not for you. Therefore, just turn it off now before going any further.\n\nThe best way to rate a zombie movie is to rate the Zombies itself. I was afraid they'll use some cheesy CGI graphics but instead they used real visual effects, the make-ups on Zombies were done perfectly to give the nice terrifying look. And the storyline was interesting on how the Virus spread on a remote Island.\n\nI say Kudos to the director, producers, and actors. I really hope to see more versions of this or even a sequel now that the virus has spread beyond the Island. Hopefully it will be more darker and gloomier this time. For a actor like Saif Ali Khan to take such a bold step for a movie like this really shows how versatile he really is and how open minded he is towards his audience.\n\nWell Done Bollywood, I am impressed, now time to take this concept further!"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "andre_rox99",
        "review_rating": "7",
        "review_title": "Violence, Drugs, Headshots, Alcohol... ZOMBIES.",
        "review_detailed_main": "Go Goa Gone is a zom/com flick directed by Raj & D.K. starring Saif Ali Khan, Kunal Khemu & Vir Das.\n\nThe film revolves around three guys; two of which need a break from their life which is anyways going nowhere. Bunny, a friend of theirs, tells them that he's going to Goa for a presentation, which they take as an excuse to go to Goa to party, meet girls and live life to the fullest. They go to a rave party organised by the Russian mafia on an island and soon things go wrong when zombies start appearing out of nowhere.\n\nOkay, so the minute I saw the trailer for this film, it looked quite mindless, but I couldn't help but laugh at some of the jokes and the fact that I've never seen an Indian zom/com flick, I had a feeling this would be good. Even Kunal Khemu and Vir Das were there so I was sure that they would put on a good show. The film, ultimately, was what somewhat of my expectations. It was good, yet I feel the second half couldn't sustain the comedy that the first half had. However, the acting is still great, and you can't help but laugh at the jokes Kunal Khemu's character makes.\n\nThe action of this film is pretty good, with quite a lot of headshots and stabs. The acting is really counted since anyone watching this film wouldn't really care about it.\n\nOverall, Go Goa Gone is a really good time. I had a great time just sitting back watching two dope heads and a Russian/Indian guy kill 1399 zombies, which is honestly all that you should expect along with a few laughs. 7/10"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ayushman-gaur",
        "review_rating": "10",
        "review_title": "2 Hour Laughter Marathon!!",
        "review_detailed_main": "The movie is about 3 friends out of those 2 are hardcore junkies, be it booze, weed or anything, they just need an excuse to get high. According to me Kunal Khemu was The Best Among the other actors of the movie, his expressions, comic timing were awesome & maintained a standard, even though the movie does contains some, I guess too many derogatory words, which will be fine with the youth. However don't watch with your parents, you'll be embarrassed.\n\nWell the movie is one of the best comedy movies I've ever seen in the past few months. I laughed like hell in the theater Jumped on my seat, threw pop-corn & I wasn't alone, the whole theater went crazy.\n\nSooo just go & enjoy this amazing movie & most of the youths of this generation can relate some of the scenes of the movie with themselves.\n\nP.S-- Don't Buy Cold drinks or eatables because the movie is a complete laughter ride & you might choke yourselves while laughing. (just kidding)"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "A Watchable Zombie Comedy!",
        "review_detailed_main": "Raj Nidimoru & Krishna D.K Directed 'Go Goa Gone' is A Watchable Zombie Comedy! It offers some good laughs, some striking visuals & a terrific performance by Kunal Khemu, working on its advantage.\n\n'Go Goa Gone' Synopsis: A rave party off the coast of Goa, goes horrifyingly and hilariously wrong when the island is overrun with zombies.\n\n'Go Goa Gone' begins well & maintains its momentum until interval. Post interval, the pace dips, the goings-on become repetitive & the culmination is ordinary. In totality, the film appeals in parts, more-so in its first-hour, which is very entertaining. The Screenplay is crisp, but could've been sharper in the latter hour. Raj Nidimoru & Krishna D.K's Direction is stylish. Cinematography captures the stunning locales of Goa strikingly. Editing is fair. Action-Sequences are extremely violent. Music by Sachin-Jigar is memorable.\n\nPerformance-Wise: Kunal Khemu is terrific. The underrated actor makes you laugh at right places, without making morbid faces. He steals the show! Vir Das is energetic, while Anand Tiwari is under-utilized. Saif Ali Khan is okay in an extended special appearance. Puja Gupta looks stunning & delivers ably.\n\nOn the whole, 'Go Goa Gone' can be viewed once."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rhitwick",
        "review_rating": "8",
        "review_title": "Hilariously scary!!!",
        "review_detailed_main": "Long back (actually 2 years back) there was a rumor that Bollywood was on its way to make movies on Zombies. Two unnamed films were heard to be in making. Two years after one movie is already released \"Rise of the Zombie\" (released and flopped) another released today \"GoGoa Gone\". The name is wacky and trailers are not that interesting but the songs...the songs were its USP. Remember \"Delhi Belly\", how its wacky songs created the curiosity around it and turned it into a smash hit?....I hope the same thing clicks for it. Now the main business, the review.\n\nTheme: Three friends goes Goa for different reason. Two guys to just chill out and one for office presentation. They join a rave party and things turn bad there. People suddenly start turning into zombies. What now? (Well Zombie movies were always about two things either its a horror or its a comedy. Its a comedy and that's the maximum you need to know about it)\n\nCharacter Development: There is hardly any chance of any character development. And this being a \"piece-of-life\" movie its unjust to ask any from it too. So, leaving this topic.\n\nDirection: Was going through the filmography of both the directors. A very impressive catalog : \"Shor in the city\", \"99\" to be mentionable. In case of \"Go Goa Gone\" I would say they have nailed it. The big hit that everyone waits for is here, they can enjoy the success. Its not easy to make offbeat movies in India specially if you want to make profits too from ticket sales. But I guess this is gonna be hit among young viewers. The direction is very much to the point, gives very less focus to individual characters so less time to commit mistakes. You would get almost 100% dialogs rather any monologue. This ensures a creative input of comic timing and surprise element to audience. Just imagine you won't be seeing Saif doing overacting! That's an achievement on its own! On second thought, actually Saif actually did over the top acting. And that blends to the tone of the movie. Crazy characters! Every single one was created with utmost care and then was given some intelligent lines. The chemistry between Vir Das and Kunal Khemu to be mentioned here for this. Then the intelligent film-making by including inspired scenes from \"Zombieland\" and \"Shaun of the dead\". Well, you know what is intelligent here? They not only copied scenes but took a dig on it! Bollywood making fun of Hollywood movies is a remarkable scene for sure. Another intelligent aspect is how they handled Clichés. They touched every Cliché that is related to such zombie flicks and made fun of those. Then they made fun of themselves too. Too many things in a movie?! Yeah and you would enjoy it for these things. Hats off to the director duo. Hope they bring a sequel too.\n\nCinematography: Though the movie takes place in Goa they have cautiously escaped showing the scenery of Goa. That was unnecessary for his movie and it was avoided. Rather collage of a rented room of bachelors, office room and a zombie infested island is well crafted. No special mention here. You get to see just what is there, no artsy-fartsy bullsh1t.\n\nSongs and background score: The songs are already popular. Specially \"Slowly slowly\" and \"Khoon choos le\". Whacky lyrics along with party themed music. Apt to the mood with movie. Two of the songs are used as title credit scene and end credit scene and others are as background score. The dedicated background score is average though.\n\nEditing: The editing is superb till intermission but the movie slows down its pace in the second half and this happens mostly due to lack of ideas in screenplay. Still a very good job.\n\nEntertainment value: After a long time laughed out loud in theatre. Full entertainment (provided profanity does not bother you!). Kunal Khemu and Vir Das runs havoc and Saif's crazy Russian accent is fun...trust me!\n\nVerdict: Since \"Delhi Belly\" this is the only movie which can shake the former's stature of intelligent. tongue-in-cheek comedy movie. Beware of profanity though. IF you have problem with profanity, this movie is not for you. Rest all assured you would enjoy for sure."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "shovonbhattacharjee",
        "review_rating": "7",
        "review_title": "Horror with Comedy",
        "review_detailed_main": "The storyline of this movie is just amazing and acting is also good. the comedy of this film is also very much interesting."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "shashankss",
        "review_rating": "1",
        "review_title": "Horribly OBNOXIOUS.",
        "review_detailed_main": "Horribly OBNOXIOUS.\n\nCan't find better or should I say WORST words to describe this film.\n\nJust coz of SAIF KHAN ( due to the RACE series ) I went to watch this film. Thank GOD didnot take my kids along.\n\nMC, BC, MF, SF, FU, Bas..rd etc. etc. I guess are the only selling points left for the director. What abusive language, MY GOD. Looks like SENSOR BOARD has not even seen this film. What is this country coming to. Can't these MC, BC, MF, SF Directors Producers make a normal film without use of such words MC, BC, MF, SF. And that too such extensive use all through the film.\n\nWanted to leave the hall within 15 min. and then almost left it during INTERVAL to see another film in same Cineplex. But somehow others who went with me asked me to hang on and so saw it till end.\n\nTerribly terribly disappointed. My decision not to watch any Hindi film in cinema halls was right after watching another obnoxious film ISHAQZADE.\n\nSurprisingly younger crowd seemed to enjoy this film GO GOA GONE and it indeed shocked me to see what values these younger generation is imbibing.\n\nMay GOD ALMIGHTY give some sensible brains to today's Bollywood directors / producers."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ladkaniaakash94",
        "review_rating": "10",
        "review_title": "Go Goa Gone-\"Bloody Hilarious\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "vikasarora333",
        "review_rating": "6",
        "review_title": "Zombie story that does not entertain",
        "review_detailed_main": "This appeared a nice movie from reviews, so went for it. But it turned out disappointing. First ever bollywood zombies movie, but instead of entertainment, appears very dull. Story is not well built. There are some comic moments, which hardly make you laugh. Pooja Gupta appears beautiful and certainly adds to the glamour quotient of the movie. She has been given screen time without much dialogues. Saif was unconvincing, just managing with the role. Go for this only if you are desperate for a movie at theatres and don't have any other choice.\n\nJust to mention, it is given 'A' certificate, as slang appear in some of the dialogues."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rappernigar",
        "review_rating": "1",
        "review_title": "Nice try but umm",
        "review_detailed_main": "Okay i will get to the point.. the movie is not scary as expected..it adapted some story and theme(Dead island,House of the dead mainly) im not complaining about their adaption or anything.the movie is very bad.wasted my time.characters in this movie are trying to be funny and they are not .\n\nThe character named Hardik was like over acting and all...because its very boring and fainting to see made up jokes like they had in this, The Russian Baaris shoots like 18 shots without reload, from a desert eagle..seriously? and the bullet case after firing shots is not shown and that's very disturbing.Baris's cloth didn't match the screenplay.\n\nand i really don't know why our 3 friends had a girl zombie with them all the time.Movie should be completely avoided.don't waste your time"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "satyadev",
        "review_rating": "",
        "review_title": "Nice Zombie movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "regforum07",
        "review_rating": "6",
        "review_title": "It's good but could have been tried on more humorous",
        "review_detailed_main": "I remember a month back I seen a trailer of this movie and which spread over you tube as viral videos but then today I watched this movie and felt like NAH>>>>. I mean this could have been more better if there was much more humor and character development.\n\nStory revolve around 3 friends, 1 Girl, 1 Russian Mafia and his side kick who fights with zombies but overall not all character have a space to work inside the story only it's Kunal Khemu's character which have big impact on story and even Saif Ali khan's character looks total made up and there are few scenes which resemblance to Shaun of the dead movie(only if you seen it which is far more better than this one) but it's not new thing in Hindi cinema that they are unofficially inspiring from Hollywood movies.\n\nThis was first ever zombie movie made in Hindi, so people who don't know anything about zombies they should also relate to this movie. which I felt is a big fail. another thing they shouldn't have added the Drugs humor which is again not all people can relate.\n\nI feel it's good to watch but Hindi Cinema just celebrated 100 years and in next few years I expect more original stories and original humor should have been come on the screen."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "achyutaghosh",
        "review_rating": "7",
        "review_title": "with great fun comes great gore",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "meghasud21",
        "review_rating": "8",
        "review_title": "Great Fun",
        "review_detailed_main": "This movie is such a lot of fun. Probably the happiest i have come out from a theater in a long long time.\n\nThe jokes are not forced at all and laugh out loud funny because of the great acting by the three friends, specially kunal khemu. The zombies manage to be scary and ridiculous at the same time inducing nervous laughter throughout their screen time. Thankfully the actress is also a good actor, which has become a little rare, since female actors are taken only based on their looks.\n\nThe music is great. Khoon choosle and babaji ki booty. What more could you want?\n\nThe characters are endearing and you really care about whether they live or die."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Decent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ahwaan_padhee",
        "review_rating": "8",
        "review_title": "Go Goa Gone - A mad ride",
        "review_detailed_main": "Go Goa Gone is Bollywood's first foray into the zombie land.Directed by the duo, Raj-DK of 'Shor in the city' fame, this chronicles the encounters of the trio, Hardik-Luv-Bunny played by Kunal Khemu, Vir Das and Anand Tiwari respectively with the zombies when they are stranded on an island in Goa.\n\nThe film introduces the three main characters with their irreverent banters which is much reminiscent of the hilarious adult comedy \"Delhi Belly\".While Bunny seems to be an innocent and workaholic chap,Hardik and Luv are good-for-nothing slackers who piggyback on Bunny in an official trip to Goa.Things take a turn at a rave party when the partygoers turn into flesh-eating zombies under the influence of an exclusive Russian drug.Enter the blondie zombie-killer, Boris(played by Saif Ali Khan)who speaks with a funny Russian accent spiced up with desi tadka !\n\nGGG is quirky and boasts of real LOL moments in the first half -Thanks to the natural and well-timed performances from Khemu and Das.Saif gets the notes right and he shines with his punchy dialogues in the extended cameo.It only loses focus in the post interval portions due to incompetent writing.Probably the writers weren't sure about a suitable culmination for this mad-cap comedy.Even though the narrative takes a hit, Saif breathes life into the proceedings.While the guys are in terrific form with their dazzling camaraderie,Luna(played by Puja Gupta) is efficient.\n\nSeemingly influenced by the western concept, Raj/DK strike an amazing balance in putting up the story in an Indian context and avoid meandering into the distasteful or abusive territory.Yes, there is plethora of cuss words but the humor smart and is tackled aesthetically..Sachin-Jigar's music is apt and energetic and syncs well with the narrative.Whats interesting to note here is, the film does send an implicit message for today's young facebook generation who are unconsciously becoming symbols of loosening morals, philandering ways and finding heaven under drugs,dopes and drinks.Sad!\n\nOn the whole, Goa Goa Gone is a bravura attempt by Raj and DK.Youngsters will definitely have a ball watching this mad,mad ,mad ride. Watch it for its sheer novelty."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "dpolwatte",
        "review_rating": "7",
        "review_title": "Go Goa Gone (2013)",
        "review_detailed_main": "With a cast of new comers and Saif Ali khan, \"Go Goa Gone\" became fourth in this list because it was extremely sarcastic and truly funny. Though it's a Hindi movie not the typical movie you will expect it to be. Don't miss it.\n\nOverall - 3.5/5"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "arnavgoswami",
        "review_rating": "3",
        "review_title": "worst way of copying a concept ...Go Goa Gone",
        "review_detailed_main": "watched GO GOA GONE ...just like its title does't make any sense...this film doesn't make any either...they say its comedy_ I say its sh!t...they boast about its Action n VFX_ I say they are bull sh!t....its makers copied a Hollywood concept started in early 70s...okay they tell by definition what is zombie? how it works? N lots of how n what stuff(like Indian audience doesn't know sh!t)...okay ...BUT what is not okay is its poop plot, amateur screenplay n annoying overacting of Kunal Khemu....& that's not all its has whole lot of stuff i can curse about...but i'll just end with _DO NOT WATCH THIS CRAP_ message"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "chetaninbox-668-54666",
        "review_rating": "10",
        "review_title": "Bollywood to next level",
        "review_detailed_main": "I was wondering can Indian cinema do justice with zombie movies. And the answer is yes they did. There are so many nail biting moments with a lot of funny dialog. the movie goes with the good pace. Seriously i was not expecting what i have seen in that in a good way. Drugs and zombie what a combination. All the character did justice with their role. The concept was totally zombie, dialog was well written. One thing i can say only a zombie fan can direct this movie. Saif Ali was superb other actors were also good. Action sequence with a little comedy every thing was in perfect combination. I don't want to spoil the movie watcher what i can say is perfect start with a perfect end. i will defiantly recommend this movie to everybody specially if you are zombie fan. Watch this and join the party."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "akshay-ak-kumar",
        "review_rating": "6",
        "review_title": "The curse of the 2nd half",
        "review_detailed_main": "Go Goa Gone starts of well....2 losers along with their sensible friend head to Goa for a break and end up in a rave party which has drugs being sold by the Russian mafia. They can't have it as they're bankrupt and those who have it turn into zombies. And when it looks like they'll become dinner for the zombies...they are saved by a Delhi boy turned Russian gangster !!\n\nBut the curse of the 2nd half appears and the writers and directors run out of ideas and the last hour is just zombie killing or escaping from them which becomes boring after one pt.\n\nThe performances are good especially Khemu and there is good chemistry between the 3 leads. Saif starts off gr8 but writing doesn't give him much scope.\n\nThere is sign for a sequel . So I hope things are better there !!"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "singh-pankajsingh",
        "review_rating": "2",
        "review_title": "Bollywood should not copy the concepts of Hollywood ....Cant do justice.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "jmoneyjohal",
        "review_rating": "",
        "review_title": "zombie attack",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ajaiswal-40907",
        "review_rating": "7",
        "review_title": "First Zombie Movie of India",
        "review_detailed_main": "Its a bit scary, hilarious & underrated at same time. This concept is new in indian cinema & this movie deserves more view & respect."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "preetsdhakappa",
        "review_rating": "6",
        "review_title": "Going Bonkers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rashul",
        "review_rating": "8",
        "review_title": "Babaji Ki Booti...Sure to take you on a high ride...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "Pranali_Patil",
        "review_rating": "7",
        "review_title": "Hilarious and Scary too",
        "review_detailed_main": "\"Go Goa Gone,\" the first Indian zombie movie, brings a refreshing concept to Bollywood. The trio of Kunal Khemu, Anand Tiwari, and Veer Das delivers hilarity, injecting humor into a genre typically known for scares. The film strikes a balance, managing to be both scary and entertaining. The catchy and unique music adds another layer to the experience. Saif Ali Khan, in a pivotal role, delivers a good performance. The movie as a whole is a breath of fresh air in Bollywood, introducing a novel genre and combining elements of horror and humor seamlessly. \"Go Goa Gone\" is a testament to Bollywood's ability to explore new territories and keep the audience entertained with innovative concepts."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "dhruvbehl24",
        "review_rating": "8",
        "review_title": "best bollywood horror-comedy movie",
        "review_detailed_main": "The make-up & graphics never looked fake which adds on to the credibility. With heads getting popped-up, bloods flowing like red wine, flesh getting ripped-off the effects are realistic enough to get audience approval.\n\nSachin-Jigar's music gels with the mood. \"Khoon Chus le\" has already become anthem for majority of us who hates to wake up on Monday morning & slog our body to the workplace.\"Babaji ki Booty\" is another gem of a song that reflects the mind of a person when one is \"high\".\n\nThe second half might give you a feeling of Dejavu but then majority of zombie survival films moves in this set pattern. Being the first zom-com in Indian cinema the director duo aptly chose the basic concept without making a convoluted plot which might have backfired. There is homage given to iconic zombie film \"Night of the Living Dead\" to \"zombieland\" in the second half. The heart of the film reminds you of Edgar Wright's masterpiece \"Shaun of the dead\".\n\nComing to the end there is also a social message against usage of drugs.On the whole Ggg is the perfect torchbearer for the zom-com genre in Hindi cinema. GGG seamlessly merged the two concepts (Zombie & Slacker comedy) & made one hell of a mad ride. Go for it – you will laugh throughout & get distresses. There is a hint of a sequel & I am looking forward to some more madness in it."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "paul_haakonsen",
        "review_rating": "6",
        "review_title": "Time to kill dead people...",
        "review_detailed_main": "I had some concern about watching \"Go Goa Gone\", with it being an Indian movie and all - dreading that it would be filled with singing, dancing and music in the best Bollywood style. But luckily my zombie aficionado instinct got the better of me and I decided to give the movie a go anyway.\n\nAnd with good cause I might add, because \"Go Goa Gone\" was really a nice surprise. And let me just say that this is not a movie full of dancing, singing and music. Quite far from it, actually. \"Go Goa Gone\" really took me by surprise, especially because it is right up there in the league with movies such as \"Shaun of the Dead\", \"Lesbian Vampire Killers\" and \"Tucker & Dale vs. Evil\". This is indeed a great zombie horror comedy movie.\n\nThe story is about three friends and roommates, Hardik (played by Kunal Khemu), Luv (played by Vir Das) and Bunny (played by Anand Tiwari) who end up going to Goa for a vacation of partying and hooking up with women - well, at least such was the plan for Hardik and Luv. They end up going to a rave on a remote island, a rave hosted by members of the Russian mafia. A new drug is introduced during this party, but this drug results in the users experiencing the ultimate high and turning into zombies.\n\nThere is a good amount of action and a suitable amount of comedy to the story here. And there is a constant pace to the movie which just keeps the movie going and going, without leaving any dull moments throughout the length of the feature.\n\nAnd on the plus side, then there is a good amount of blood and gore in the movie as well, enough to keep most gorehounds satisfied. And the zombie make-up and effects were actually surprisingly good.\n\nIf you enjoy zombie movies, then \"Go Goa Gone\" is definitely a movie to watch, and with this addition to the zombie library, India have put themselves on the radar."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "yunusitboss",
        "review_rating": "4",
        "review_title": "Go Goa Gone (A) Hindi ------------- my Rating : ★★ ONLY FOR ZOMBIE FANS",
        "review_detailed_main": "Go Goa Gone (A) Hindi Soodhu Kavvum (U/A) TAMIL Mariyaan Songs TAMIL Complete Review and more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nGo Goa Gone (A) Hindi ------------- my Rating : ★★ ONLY FOR ZOMBIE FANS\n\nSTRENGTHS :- * Concept : was good but not an entertainer ..... * Songs : were good..... * Trailer : was something new to be seen .....\n\nWEAKNESSES :- * Screenplay : drags .... * Scenes are repeating ....\n\nFINAL VERDICT :- * Overall... it is a mindless movie ... not a family entertainer ... completely avoid it ....\n\nA group of friends along with members of the Russian mafia get stuck on a remote island off the coast of Goa, when new drugs at a rave party are consumed by the guests, turning them into zombies."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "adeel_parbhulkar",
        "review_rating": "9",
        "review_title": "I Kill Dead Peoples,",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "Here and there",
        "review_detailed_main": "I watched this at a festival, which was either nice for those viewing or at least very strange. Every time a character drank or smoked, there was a warning text on the bottom of the screen, telling the viewer of the hazards of those things and a sort of \"don't try/do this at home\". Actually we did see a shorter version than the one that was released in India. They had a disclaimer at the beginning and if I'm not mistaken during the movie, where some politician was talking about how dangerous some of the things are shown in the movie.\n\nAnd all this about a movie, that is obviously a comedy! And with zombies (who are the target for a lot of jokes) and criminals amongst other things. The jokes work mostly (depending on your sense of humor obviously), but there are a few missteps here and there. There is obviously no nudity, which does not affect the movie, but the graphic violence element is also kept at a minimum."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "nairtejas",
        "review_rating": "4",
        "review_title": "There's New Lame In B-Town!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "pratima347",
        "review_rating": "7",
        "review_title": "Fun zombie ride!",
        "review_detailed_main": "I was not expecting much from this movie,but it really impressed me. It was refreshing to see Bollywood venture into a different genre and with a lot of quirk. The movie is hilarious with small scares once in a while. In short,once it starts,you wont yawn or crib until it ends,because it is precise with just the right amount of songs and background score and it is the actors especially that impress ed me a lot. All the actors were amazing in their respective roles and the characters were tailor made for them. While being a zombie flick,I really liked how it discouraged the youth from adhering to drugs,drinking,etc. All in all,it was a fun little movie I enjoyed with a lot of popcorn and a lot of laughs and I left the movie hall with a smile. Thank you Go Goa gone for the entertainment. :)"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "tarunverma911",
        "review_rating": "8",
        "review_title": "A Surprisingly Brilliant movie, may turn-on a new wave in Indian Cinema",
        "review_detailed_main": "It is extremely astonishing that Indian film-makers are now making movies with entirely different story-lines, hoping to appeal to the audiences with varying tastes in films. This film is surely gonna be loved by many indians, even those who are aversive to such themes when a Hollywood movie is played. Zombie-theme is not a very favorable one to many, believing it to be just another add-on to the sci-fi cult. There have been plenty of such movies made in west, like Zombieland, Resident Evil series, to name but few. Anyone before watching this movie would have definitely thought that such story-themes can NEVER be made in India, by any Indian film maker. Not only Zombie-film, making any sci-fi film in India comes with great risks as audience is not yet ready for such films. Only a handful of people, mainly younger generations would love to watch a sci-fi film.\n\nGo to any theater playing the latest Star Trek movie and you would find few groups of guys sitting here n there in the theater, few loners, most of them wearing specs, and rarely a couple would be seen, and a whole family is rarest to find. Such has been the taste of Indian audience even in current times when sci-fi cult has grown hugely in west. How can one imagine to have a zombie movie then in an Indian theater? But Go Goa Gone has startled everyone's assumptions and imaginations. Purely a Zombie-based theme, a sci-fi element that a drug would damage most part of the brain making the survivors Zombies, and the rest being the similar masala from any such western counterpart. The movie could be a bit predictable to those who have watched many such movies as various scenes and screenplay seemed to be copied from various sources. Originality was lacking in the movie, the characterizations and the similar scenarios are very commonly seen in any such sci-fi movie; whether a group of young adults is stuck at an island surrounded by zombies, or surviving the attack from a monstrous-mutant animal, or survival from the spread of a virus, or escaping from an alien etc etc. But as with western movies, though scenarios are common and predictable, but what attracts the audience in them is a new story-line different from the previous ones, along with new elements of technology.\n\nOut of few sci-fi's made in India, like Koi Mil Gaya.., Ra.One, (also including few non-Hindi films like Robot etc) this definitely provides a very unique story-line and theme, never seen and expected in Bollywood. Indian audience is definitely going to get a surprise in this movie and complete entertainment included. I am sure people from all classes are going to like this movie, despite its first-time presented theme which would be novel to several Indians.\n\nThis movie is definitely going to set a new trend in film-making, and may be we will get to see an Indian version of Species, Aliens, LOTR etc in the near future.\n\nThe film has very nice dialogues, with beautiful cinematography, few of them are gonna become classic scenes. Saif's make-up is very apt for a movie like this, and he has shown mature acting. Kunal's dialogues and his role would become favorite of many, there has been the use of abusive language also. There are no sensuous scenes, but in a movie like this at least 1 or 2 could be added. May be the directors were intending to make it suitable for family watching, and also slang seems more acceptable than a sex-scene. And as a result the girl, Puja, was not shown in a glamorous way, though she is hot and cute. This has made the movie content-focused, and more footage has been given to the survival from zombies. All three young male actors have acted brilliantly.\n\nI have given a rating of 8/10 because of some commonalities with Western movies.\n\nA MUST WATCH, even you would love to watch it the second time."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "smg242",
        "review_rating": "9",
        "review_title": "Hysterical, rightly gory, and an overall blast!",
        "review_detailed_main": "Go Goa Gone is truly one of the most hilarious Hindi films since Delhi Belly. It's a zombie comedy, with lots of blood and gore, so it's in no way for the squeamish, and the humor is quite mature, so it's NOT a child-friendly watch, but, hey, it's the subject matter itself which isn't really kid-suitable.\n\nNevertheless, Go Goa Gone sets out to bring a new genre into Indian cinema with great gusto, and it fails to fail. With rib-tickling lines, great comic acting by Kunal Khemu, Vir Das, Anand Tiwari, and even Saif Ali Khan as the quirky, macho Boris (soon to be one of the greatest cult characters of all of Hindi cinema), Go Goa Gone FORCES you to laugh effortlessly.\n\nYes, the plot gets a little dragging at the second half, and Puja Gupta's acting isn't very novel (although she looks great), but mostly, Go Goa Gone just always makes you laugh at one point or the other. I was chuckling at every other moment. The zombies are well-made, for a first in Bollywood, and nothing looks cheap. The action is pretty nice, and the songs are quirky and trippy.\n\nI highly recommend this to anyone who wants to have a good laugh-fest. Except the kids, of course..."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ayazsabir123",
        "review_rating": "4",
        "review_title": "A very typical cliché approach with disappointment",
        "review_detailed_main": "Another boring Hollywood wanna-be cliché Indian attempt. This movie has no plot, no twist, and no story. Very boring and predictable scenes with unnecessary vulgarity and ridiculous sexual remarks that makes you feel sick. I don't know why Indian cinema thinks that by bringing more sexuality and vulgarity they are going to be more like Hollywood.\n\nI don't know why Saif would even agree to part take in such a childish movie.\n\nMy suggestion: Don't waste your time if you wanna watch something decent. The only good parts are in the trailer, other than that its a boring silly little movie.\n\nDoesn't deserve more than 4 stars."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "tejindersingh6633",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "One of best Bollywood's comedy movies. Movie has very good direction."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rubysraj",
        "review_rating": "1",
        "review_title": "You will turn Zombie watching this",
        "review_detailed_main": "Another piece of garbage from BOLLYWOOD.........I have no idea how other people are writing that acting is good. Its just a nonsense movie with bunch of people acting stupid....... Saif is the producer of the movie...... Recently he has done few good movies but this one is totally disappointing......He is pretending to be Russian mafia boss in this movie.... Looks like a joker with red leather jacket , golden hair and nonsense kids jargon....... I couldn't even tolerate 20 minutes into this movie......... all my brain cells got fried...... and I myself felt like a zombie......There is absolutely no comedy. High school project movies are better than this movie. The background score tries to make the scenes more exciting but when there is no strength in the screen play then how can background music make it better............ The story line is absolutely without any story actually. I am just writing this review to caution you not to waste your hard earned money and precious time going to the movie theater. I did get one message from the movie thought.....Don't USE DRUGS................but you don't have to fry your neurons by watching this movie............"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "zohaibk884",
        "review_rating": "10",
        "review_title": "Humour,scary and complete entertainer...",
        "review_detailed_main": "First indian zombie movie...and they have hit all the right spots...movie is funny,scary and very engaging...great acting performances by all the cast especially saif ali khan and kunal khemu..."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "yogesh_b",
        "review_rating": "10",
        "review_title": "Laughter Dose",
        "review_detailed_main": "What a funny movie it is. 🤣🤣🤣🤣🤣🤣 I was die laughing. Never seen such kind of a movie and never even expected it from indians like Raj & DK Thanks for this."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Hawalawood and their cheap flush-outs",
        "review_detailed_main": "Wannabe Dead Island, but it's nothing but a cheap garbage production of \"Bollywood\", I want to ask Bollywood how shameless they can be, you are making garbage like this in the name of \"Movies\", what do you think of Indian audiences as some brainless robots? Whom you are just going to manipulate and feed literally anything?\n\nThis is the end of the golden era of Hawala, Mafia funding business of Bollywood, ordinary people are not going to fund this crap of an industry anymore, Actors who work in this industry are just bunch of pimps and Actresses are just manipulated, exploited, and consumed by the Bollywood Dallas."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "arpit_aggarwal1812",
        "review_rating": "10",
        "review_title": "Go gone gone- A classic!!!",
        "review_detailed_main": "Once upon a time in Bollywood there were actors running around trees singing songs (which have now become classics), then came the angry young man phase, then the Yash Chopra Karan Johar romance.And now comes Go goa gone..lol..No its not definitely that great.But this is a classic in its own way. After a long time, i laughed a lot after watching a Bollywood comedy. Last was while watching Delhi belly. Attempting to make a movie in completely new genre takes a lot of courage. It was a very risky decision which Illuminati( For all you illuminati fans, This is Saifs home production)films took. And i would not dare say that they did not succeed.Statistically speaking this movie failed to garner the kind of response a 'Saif Ali Khan' movie does. But its NOT a Saif ali khan movie. Though Saif does play an important part in the movie and i must confess that i was in love with his character 'Borris'. But in the end its a story about friends, drugs and Zombies. i don't want to reveal much about the movie but if you still have not seen the movie than grab a DVD or if its still running in nearby theaters then please go for it."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "tushargupta-27286",
        "review_rating": "4",
        "review_title": "Ok",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "Sherazade",
        "review_rating": "8",
        "review_title": "Hilarious!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "ridi-arahan",
        "review_rating": "8",
        "review_title": "Of course deserves a sequel.",
        "review_detailed_main": "The movie was pleasantly surprising and I enjoyed the movie. What works:\none of the fewest Hindi zombie movie\ngreat humor and comic appearances\nclever and fun screenplay\n\n\nWhat did not work:\nI am not against songs but it would have still worked without them\nFinal verdict: Recommended."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "fantastic",
        "review_detailed_main": "GO GOA GONE comes across more as an adventure flick than a conventional horror film. Sure, it has its share of violence and gore, besides some cuss words, rave party et al, but the fun quotient is smartly integrated in the screenplay and what comes across is crazy, madcap amusement. Raj and DK are enthused by Hollywood movies and there's no denying that GO GOA GONE is a film with Hollywood sensibilities. But the best part is that the film never gets dark or depressing. The wit and humor, generously interwoven in the narrative, keeps you smiling all through, despite the blood and gore. On the whole, GO GOA GONE is experimental since something like this has never been attempted earlier. But it's fun, witty, amusing and yes, thoroughly entertaining. The youngistaan is sure to love this mad, mad, mad ride!"
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "deepamindy",
        "review_rating": "8",
        "review_title": "Go Goa Gone is an Assured Debut of Zombies in Bollywood",
        "review_detailed_main": "Comparing Bollywood movies having previously executed foreign concepts have lately become a critical norm. As soon as the first trailer came through, critics compared Go Goa Gone with popular Hollywood zombie flicks; more resonantly, Zombieland. While watching the dual directorial effort, the movie did not resemble Zombieland at all, though some scenes seemed a tad bit familiar to Shaun of the Dead (which itself was a comedic take on Romero's Zombie titles).\n\nThe movie was a breeze to watch and some scenes actually reeked originality with context to humor and wit, along with a previously unseen Grindhouse approach (restricted to zombies) in Indian cinemas. The three leads where effective with Kunal Khemu walking away with the best lines. Vir Das was OK. Anand Tiwari as Bunny was a revelation. Tagging along with the trio, Saif Ali Khan stood on firm ground as Borris (the trailers teased resemblance to Tallahassee of Zombieland).The Zombie concept remained status-quo but some scenes spurned comical twists which seemed fresh and out of the box.\n\nOverall, my preconceptions about this movie being derivative and unoriginal were pleasantly overthrown. Good direction and plenty of laughs more than made up for the reluctance of the script to break new grounds.\n\n8/10 for me."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "sauravjoshi85",
        "review_rating": "8",
        "review_title": "A Superb attempt in the genre of Zombie comedy film, loved to see many more such films!!",
        "review_detailed_main": "Go Goa Gone is a zombie action comedy film directed by Raj and D. K. The film features Saif Ali Khan, Kunal Khemu, Vir Das, Puja Gupta and Anand Tiwari.\n\nThree friends decide to visit an isolated island for a rave party. But the next morning they find themselves not only surrounded and hunted by flesh-eating zombies.\n\nThis is the first zombie comedy film ever made in India and been a magnificently good attempt. The film is adapted very well as per the Indian set up and it's been good that the Indian cinema is trying new genres in film making and is been getting successful.\n\nThe plot of the film is unique and the execution is superb. The acting in the film is top notch with a special mention for Saif Ali Khan and Kunal Khemu.\n\nScreenplay of the film is fast paced and the funny one liners and punches will keep your funny bones tickling. The climax of the film looked little over dramatic but is superb.\n\nThis film is a decent attempt to a new genre and we would like to see many such films in the future."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "rajatmalik-35488",
        "review_rating": "10",
        "review_title": "Best movie in the genre",
        "review_detailed_main": "Best horror comedy in Bollywood right now. Just love the movie."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "sumanth-05484",
        "review_rating": "10",
        "review_title": "Underrated Bollywood Movie",
        "review_detailed_main": "This Movie is really a Great Fun Ride.\n\nComplete Enterainer.\n\nWow What A Fun Movie and As well as Thriller .\n\nAwesome work By Raj And DK .\n\nNever Expected Bollywood Zombie Movie to be this much Good .\n\nCrazy Movie 😂 .\n\nCrazy Dialogues."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "gayatriganesh-61216",
        "review_rating": "8",
        "review_title": "A perfect zom-com",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "vsmanu-47133",
        "review_rating": "10",
        "review_title": "ONE OF THE BEST MOVIE OF 2013",
        "review_detailed_main": "This movie is perfect proportion of humour and horror.the Trend of zombies was introduced by this movie. Raj nidimoru and krishna dk are out of box directors. Kunal Khemu ,Vir Das ,puja Gupta,Saif Ali Khan, Anand Tiwari . All the cast is perfect."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "alekhyatiru",
        "review_rating": "10",
        "review_title": "Hilarious!",
        "review_detailed_main": "One of the funniest Bollywood movies. Unfortunately underrated suggesting that majority of the viewers didn't get the humour."
    },
    {
        "movie_id": "tt2436516",
        "movie_name": "Go Goa Gone",
        "movie_rating": "6.7",
        "review_username": "KarmaLysing",
        "review_rating": "9",
        "review_title": "Finally, a zombie movie worth watching!",
        "review_detailed_main": "Full disclosure: I freaking hate zombie movies. And yet, I loved this one.\n\nIt didn't take itself seriously. At all. And the horror strikes a nice balance with the comedy, which is not always the case.\n\nThe characters are likeable, and though they do some stupid things, the stupid thing are believable for their characters, and they do learn from their mistakes.\n\nPlus which... COKE SKEET!!! You don't see THAT in every single other zombie movie, now, DO you?"
    }
]