[
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jessecarmichael",
        "review_rating": "2",
        "review_title": "Shockingly bad.",
        "review_detailed_main": "From the dialogue to the fight choreography, I can't believe they make movies this bad these days, especially with what should be a pretty decent cast. Watch it for comedy value if you're bored enough."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "bad writing",
        "review_detailed_main": "A comet falls from space. In Burma, Jake Barnes is running from flying weapons from an unseen enemy. He falls off a cliff into the ocean. He is rescued by fishermen and brought to the western military but there is bad translation. He's suffering from amnesia. He is a part of a group of Jiu Jitsu fighters battling an alien creature for 2000 years with the fate of the world in the balance.\n\nThis is a sci-fi B-movie. The story feels like a high school writing assignment. There are a few real actors here. They are of varying qualities. They have Nicolas Cage. It's obvious that most of the expertise lies in the fight choreography. It's Tony Jaa and Frank Grillo and all the stuntmen they can fit. Oh year, they have a Predator slash Halloween costume bad guy and it's an alien. This is bad with good fights that get repetitive. It's bad but not so bad that it's good."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "carlos37andre",
        "review_rating": "2",
        "review_title": "I have no idea what happened here",
        "review_detailed_main": "I often like to watch trash/bad movies for fun, but man... I had literally no idea what was happening during 90% of this movie.\n\nI won't take too long here, but almost everything is bad, the story doesn't make sense... the alien has a fetish on fighting humans? The acting is bad, and well, they sell you on a classic Nic Cage bad movie, but he's barely in the movie.\n\nPretty awful. I will give them some credit tho, cause they try to use some different camera styles on the fighting scenes, and well, in some of them the choreography isn't horrible, still, there are so many of them you easily get tired of watching.\n\nTo sum up, a bad bad movie, there isn't much here that's worth giving a shot."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "handsomefacedave",
        "review_rating": "5",
        "review_title": "Wow",
        "review_detailed_main": "For me this movie was like a train wreck, even though it's terrible you just can't look away! Watching this was an internal battle for me. The greatest fight sequence in this film will not be on the actual screen, but will be fought internally. Between your higher self wanting to stop wasting your own time, and your lower self wanting to laugh and see if it could possibly get any worse!\n\nNicholas Cage I love many of your films. But this, like quite a few of the unfortunate choices of movies you've been in, I have to ask, what were you thinking? I guess money is money? Lol, of course, it's easy for me to be making comments from the sidelines I suppose, so what do I know? But oof! This was so bad! But heck, it was fun to have a few drinks and make fun of this! So, I give it 5 stars for entertainment quality! Lol"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sprobley",
        "review_rating": "1",
        "review_title": "Makes battlefield earth look like a masterpiece",
        "review_detailed_main": "This movie is so bad. It's no even one of those movies that is so bad it's funny...its just rubbish. I watched it to the end to see if it would get better, but it doesn't."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "FeastMode",
        "review_rating": "1",
        "review_title": "zoolander voice: what is this?",
        "review_detailed_main": "This movie is laughably bad in every way possible... end of review?\n\nEh. I'll say some more. I could tell it was poor filmmaking almost immediately. Bad everything (acting, dialogue, music, and cartoon cgi). The movie makes zero sense. There are a thousand dumb moments or things to make fun of.\n\nBut i figured, if it has good fighting, i could enjoy it. And i saw tony jaa in the opening credits so i thought we might get that.\n\nWhat do i even say. The fight scenes were TERRIBLE. And it's very odd that it's not because of the usually suspects: quick cuts, shaky cam and close up shots. In most of the fights, none of that was present. And in many, there were extremely long takes with wide shots.\n\nSo why were they so bad? I'm not really sure. One of the best compliments i can say about fight scenes is that i could feel every hit, like with john wick and the accountant. This movie was the exact opposite, i couldn't feel the hits at all. And i don't know why.\n\nMaybe it has to do with sound mixing. There was almost no noise with the hits, and sometimes the noise seemed off by a half second. Could also be that they didn't focus on the moment of the hit. I can't figure it out.\n\nBut what i do know is, the fight scenes gave me zero pleasure. Combine that with every other movie attribute being terrible and this is just a straight-garbage movie. Damn you nick cage!\n\n... i wonder what movie of his i'll watch next (1 viewing, 5/7/2021)"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jenny-91399",
        "review_rating": "1",
        "review_title": "1 star is generous",
        "review_detailed_main": "This is the worst film I've ever seen in my life. The special affects were abysmal, the acting was awful, I don't even think they did any Jiu Jitsu either."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "brett-76260",
        "review_rating": "1",
        "review_title": "Surprisingly Bad",
        "review_detailed_main": "With all the high caliber flicks Cage has been flooding the market with lately I was chomping at the bit for this one... and boy did it not disappoint. It was so bad even Zeus's butthole was shocked into submission. You deserve to get arm barred for this turd Nicolas... wow. Matter of fact you would get more enjoyment out of watching a stray dog drop a deuce than sit through this again..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "gabberth",
        "review_rating": "1",
        "review_title": "Jiu jitsu is a movie with no jiu jitsu.",
        "review_detailed_main": "This movie is just so bad.. You'd think there would be some jiu jitsu in a movie that's called Jiu jitsu.. But no.. Nicolas Cage + the lack of jiu jitsu.. Its just horrible..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "zimdonal",
        "review_rating": "1",
        "review_title": "Don't even bother!!",
        "review_detailed_main": "I decided to give this a go , for Nick Cage's sake, but Wow, mistake of mistakes, 20 minutes in I had to give up it's Utter dreck, so a few nights later after a few beers , I tried again!!!! Just Don't, it really is Horrible, how this junk got made I'll never know, just save yourself, and stay Far Away!!!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "utpt-02576",
        "review_rating": "10",
        "review_title": "SO BAD ITS GOOD",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jaydavismcse",
        "review_rating": "7",
        "review_title": "Hilarious",
        "review_detailed_main": "The the premise was hilarious. The CGI was hilarious. Nicolas Cage's acting was hilarious. All In All you have to take this movie as completely tongue-in-cheek. I gave this movie a 7 because it was hilarious however had I taken it seriously I probably would have given it a 2."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "True_Reviews",
        "review_rating": "2",
        "review_title": "Jiu Jitsu is really Joke Jitsu",
        "review_detailed_main": "This is one of the worst movies I have yet to see. There is a lot of staged martial arts fighting and if you like that this movie may be for you. The story is really silly and the acting is really second-rate at best. Maybe its really the terrible writing or maybe its the terrible directing, I just can't make up my mind what was worse. When you start to watch this movie you're not sure if its a serious movie or a comedy. By the middle of the movie you really do not care and you can practice speed watching this movie using the fast forward key. I feel almost as bad for the actors in this movie as I do for the people that watched this movie. But at least the actors got paid."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "filipgavrilovic",
        "review_rating": "1",
        "review_title": "I don't know?!",
        "review_detailed_main": "Some people might see value in it. I really tried. All I could think was this is the unholy love child of kung fu panda and predator."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "TheOneThatYouWanted",
        "review_rating": "1",
        "review_title": "Caged money",
        "review_detailed_main": "Forgettable and not worth watching. Nicolas Cage looks bored and you can tell he is doing this as a cash grab, can't blame him. Ironically enough, I am sure people watched this just for Cage."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "hacks-56635",
        "review_rating": "1",
        "review_title": "wow just wow... and where's the jiu jitsu?...",
        "review_detailed_main": "If you dont care about quality, dialogue, plot, acting, fight scenes, CGI and life in general this may be the movie for you. If however you actually enjoy your life, save yourself the torture and self-inflicted harm and walk away...\n\nSeriously, I thought, it can't get any worst can it? But it does. Then it does it again. And again.\n\nSome people give it a high rating because it's so bad it's good? They lie. It's worst than that, which makes it bad again. And it's not funny. It's annoying. There's a very big difference. The tone, the seriousness with which the actors take themselves. The actors themselves and the energy they put off just made me cringe so often, like fingernails on a chalkboard.\n\nMr. Cage lol how did it come to this?..\n\nI dont understand how rubbish like this even gets made in 2020...\n\nOh, as a proof of the insanity of whoever put this joke out into the world, the fighting styles used are anything but jui jitsu.\n\nIronic? Or just very sad?\n\nDefinitely sad."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "genau-kuriosum",
        "review_rating": "1",
        "review_title": "Wow",
        "review_detailed_main": "Worst film ever. Only 1/10 because Nicolas Cage. I can't believe this film is real. The story is useless. The dialogues are so bad and I want my life back. Don't watch this movie. I like trash movies, but this was way to much.\n\nI don't know what else to say. I have a list with Nicolas Cage movies. And we're trying to watch all of them. So this was quiet a tough one. I hope the other ones will be more than 1/10.\n\nI have to write 170 more characters. Soooooo.... Don't watch it. It's not worth your life time. Or you are having a list like we have. So I think you'll have to watch it. Anyway... Nicolas Cage is the best."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "wicher-bos",
        "review_rating": "1",
        "review_title": "This would be good, if...",
        "review_detailed_main": "They condensed it to 20 minutes... Especially the beginnen is slow, with lots of unnecessary 'fake' action... The dance like action continues throughout the movie, which makes it boring to watch at certain times... The storyline is simply too simple or basic to carry a full length movie... Sorry..l."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "flyswm",
        "review_rating": "1",
        "review_title": "Couldn't even finish it",
        "review_detailed_main": "Was this made by YouTubers? The cinematography was God awful. Like yeah it was a bad movie, but all martial arts focused movies (made by white people) are gonna be bad. I've watched my fair share of Steven Segal movies. I know the drill. This? This was worse. The filming made me dizzy. If you can't see the cool stunts (or can't watch them because dizzy) then what's the point?"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "metahumanity_01",
        "review_rating": "",
        "review_title": "Mr Cage, you OK??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "souplahoopla",
        "review_rating": "10",
        "review_title": "A cinematic masterpiece.",
        "review_detailed_main": "My teenage son and I have developed a tradition of watching Nicholas Cage movies, preferably bad ones, when he's off sick from school.\n\nThis movie did not disappoint.\n\nI mean it is absolutely terrible. And we could not stop laughing.\n\nThe main character looks like he's recently been lobotomised and just stares moronically during everyone else's dialogue. Think Jean Claude Van-Damme if you ordered him from Wish. I thought it was a bold move to NOT cast the only recognisable name as the lead, that name being Mr Cage, but it turns out they really just are that stupid.\n\nDon't worry tho because Nicholas Cage delivers with such classic mid-fight quips as: 'That's my favourite chair, I thought you'd find it comfortable' and 'I make hats out of newspapers'...ground breaking. He does have an incredible talent of being left behind at a location by the group of warriors, only to be at the place they're arriving at later. Don't think about that too much, it will never be explained.\n\nThe rest of the cast were just a group of walking stereotypes, which was just perfect! The wise, stoic Asian man who will definitely die 'honourably' at some point. The black man who is afraid of everything and cracks jokes that never land. The female warrior who you better not underestimate, she could break you like a twig sunshine. I mean you really couldn't want more in a bad movie.\n\nI'm sure there is a plot in there somewhere. I think I asked my son about 5 times 'what on earth is happening??' to be met with a reflection of my bemused face. Still now, I cant figure it out... Maybe its because it sets up a vague pretence then doesn't move forward. The 'protagonist' (if you could bring yourself to envision that) has amnesia that for some reason just doesn't improve at any point until the end. There is zero arc...zero.\n\nThe CGI is something to behold. Imagine the quality of late 90's kids TV CGI. It was dreadful. My favourite part was when they revealed the alien's face. I was in tears by that point, a mixture of laughter and desperation.\n\nThis movie has no redeeming features. The acting, the camerawork, the costumes, the dialogue, the plot if there is one, nothing can save this absolute masterclass in how to not make a film.\n\nAnd because of all this, we loved it and have been quoting it ever since. Recommend."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "World-viewer",
        "review_rating": "7",
        "review_title": "Nicolas Cage and Tony Jaa!!",
        "review_detailed_main": "Just watched this monstrosity out of curiosity as Nic Cage was in it. Regardless of the quality of the movie, one thing is for sure - Nicolas Cage sure is a prodigious film maker. One really has to admire the fact that he just keeps pumping out these straight to video movies as if they were Knight Rider episodes from the 80s. One after that other with clockwork regularity, he puts them out. He REALLY likes making movies. AND he puts his heart into the role, no matter how silly the movie. One HAS to admire that. And despite his advancing years, he's still got the moves. He's fitter than most men his age or even many younger stars.\n\nSo, put aside your criticisms - yes this is a silly movie - it's not to be taken too seriously - A Ninja meets Predator mashup - have fun with it. Nic Cage is doing his best to entertain you and he's far better at it than Steven Segal. And as a bonus Tony Jaa is also in it! I really hope he makes a comeback into mainstream movies - I do have a soft spot for the guy. (Also Tony) Keep at it Nikky!!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "eeriechills",
        "review_rating": "3",
        "review_title": "Crap!",
        "review_detailed_main": "This could've been so much better if it wasn't for the crap over long and at points pointless fight sequences. Frank Grillo is great in this and along with Cage hold the film together. The other acting is only just passable. Choreography could've been a lot better. The actual fighting was far to slow manoeuvre wise."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "djmacdonald-96262",
        "review_rating": "1",
        "review_title": "Wow, I'm lost for words",
        "review_detailed_main": "Gave it 30 minutes, made me laugh out loud. Then I switched it off. Nicolas Cage, what happened bro?!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Coolmade2000",
        "review_rating": "5",
        "review_title": "Really needs more work to be good",
        "review_detailed_main": "I don't regret watching this film, but this is definitely not a perfect film at all.\n\nMy rating is 5 stars out of 10 because, like every film I watch, I always give them a chance to be good and see the positives.\n\nThe story overall was all right. I found it to be a simple story to follow.\n\nMany reviewers criticize the main actor's lack of acting ability, but I think he should be cut some slack as he is known for performing stunts than acting.\n\nSome transitions between scenes seem awkward as they are hard jumps to the story without much detail.\n\nThere was cinematography in one fight scene that was switching between first-person view and third-person view, which confused me a lot on which perspective I'm suppose to look at.\n\nThe comic relief, Tex, seem a little annoying too.\n\nWithout spoiling the film, there was a character whom I thought would have a larger role in the movie that just randomly died in the middle of the movie, and their character death wasn't provided with any emotional weight as if they didn't become relevant anymore & tossed out.\n\nOverall, it's best to watch the film with low expectations."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lachlanburleigh",
        "review_rating": "2",
        "review_title": "Dizzying Camera Effects",
        "review_detailed_main": "Unfortunately the filming is so bad that it makes me feel motion sick! Tried skipping the fight scenes but wasnt enough, had to turn it off."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "damianphelps",
        "review_rating": "1",
        "review_title": "Disasterpiece",
        "review_detailed_main": "Jiu Jitsu is an absolute trainwreck of a movie that will make you question your life choices.\n\nIt's a cinematic disaster that manages to combine a nonsensical plot, cringe-worthy dialogue, and laughable special effects into a perfect storm of awfulness.\n\nThe acting is so wooden that you'll wonder if the cast are the children of Pinnochio!\n\nIf you're in the mood for a so-bad-it's-funny movie night, Jiu Jitsu isn't it.\n\nIt's a film that's so misguided and poorly executed that you'll find yourself laughing/crying at it.\n\nIf you value your friends don't share this movie with them, not even Cage diehards should watch this :)"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "angelchild-82319",
        "review_rating": "5",
        "review_title": "Watched just for the cage",
        "review_detailed_main": "I did like this movie when I 1st watched it, but i think the next time I watch it again is when I have Alzheimer's and forgot that I watched it."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "aballyTKD",
        "review_rating": "1",
        "review_title": "Unspeakably poor show",
        "review_detailed_main": "Does this review contain spoilers? No - it can't really be spoiled any further.\n\nI enjoy a martial arts flick as much as the next guy - I do Brazillian JJ, and little bits of other, striking, arts to keep my eye in. Admittedly, I suck at all of them, but not as much as this film. I used to think that Nicholas Cage was actually quite a reasonable actor, but just had a propensity to choose poor action parts - this film completely changed my views of Cage, and all the other planks in the cast who were going thru the motions for a pay-cheque. Awful acting, awful plot, awful effects - some reasonably gymnastic martial arts \"tricking\" failed to raise the standard of this dross above awful. It just kind of whimpers out of existence at the end. Too poor to even be comically entertaining."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Finish it",
        "review_detailed_main": "No this is not Mortal Kombat ... although one I reckon can see some similarities - fight for earth realm. Alright they are not calling it that, but you catch my drift. Anyway, the movie is quite insane ... not sure how good or bad that is. I do know that I loved seeing a lot of the people on screen. Even if we never really get to know any of them. Ok so Nic Cage is crazy Nic Cage ... which actually is normal Nic Cage I reckon.\n\nApart from his scenes (he is on a constant red alert mode, energy wise exceptional, no matter how little sense he's making) there is not much in character building from the others. Still this can work on some basic level, if you like watching people kicking the s... out of each other. Add to that an outer space element (literally) and you get ... well you get this movie! Is it enough? Apparently not and I understand that some people are not happy with the CGI and some other things ... you have to overlook a lot of things - but if and when you do, you can have some fun."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "matthewdfrost",
        "review_rating": "8",
        "review_title": "Made for a certain audience",
        "review_detailed_main": "This movie is in fact awful, but imo intentionally so. If you like watching dubbed 70s kung-fu movies with awful acting and cheesy plot, this is for you. If you want a serious action movie with grounded mechanics don't bother. This movie is for folks that want to turn their brain off and enjoy truly awful acting that pretty much makes fun of itself."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "pdnyeatty",
        "review_rating": "6",
        "review_title": "Don't Forget Mortal Kombat (1995) is a cult classic",
        "review_detailed_main": "Christopher Lambert turned in the worst sensei performance in history. As goofy and \"edgy\" as he is, Nic Cage is a million times better.\n\nThe plot is stupid and derivative (Predator/Mortal Kombat) but let's face it - if you wanted plot you wouldn't have dialed up a martial arts movie.\n\nYou came here to see martial arts fighting and this movie delivers. The cast is more stuntman/martial artist than actors. It's decently shot (especially Tony Jaa's scenes). I could do with less Zack Snyder slo-Mo but this movie is no more guilty of it than scores of other action flicks.\n\nMartial arts movies are about action. Plot is merely a device to get you to the next fight. Jiujisu is no different. Give your brain a rest and enjoy the action."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "TyrtIe",
        "review_rating": "1",
        "review_title": "It's just.... Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mbmdqprcw",
        "review_rating": "1",
        "review_title": "One star",
        "review_detailed_main": "I gave this movie 1 star, and that was for Nick Cage. He is the only star. Would recommend watching."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "karl-74158",
        "review_rating": "1",
        "review_title": "Make room on your worst films ever made list",
        "review_detailed_main": "Shockingly bad.\n\nTerrible script, shocking acting and rubbish CGI / special effects.\n\nSeriously does Cage need the money so bad that he has outdone himself getting involved with this orgy of filmmaking mistakes.\n\nThe idea isn't a bad one, so why and where did it all go so wrong?\n\nI've seen better student movies.\n\nIf I could give a minus rating I would. DONT WASTE YOUR TIME."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "noelbrooksbank",
        "review_rating": "1",
        "review_title": "What did I just watch?",
        "review_detailed_main": "This must of been one of the best worst films I have ever seen!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "austen-lowe-389-885175",
        "review_rating": "1",
        "review_title": "This is a happy shopper Chinese predator rip off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mgwksmmn",
        "review_rating": "1",
        "review_title": "The worst movie I've ever seen!!!",
        "review_detailed_main": "Graphics awful.\n\nPlot awful.\n\nActing awful.\n\nScript awful.\n\nBullets look like blasters from Star Wars.\n\nFighting is ridiculous and pointless.\n\nBullets make waves like matrix.\n\nThey pretty much copied every successful movie and tv show out there took the best scenes and made them as bad as possible.\n\nIncluding Game of Thrones. Predator.\n\nFake explosives and smoke.\n\nWorst worst movie ever.\n\nThe blare witch project had a better plot.\n\nWhere did the 25$ mil go?\n\nI'll never have those 2 hours back in my life.\n\nCompletely lost.\n\nThey should make a new rating instead of R It should be N for (no one should ever watch this)"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dworldeater",
        "review_rating": "5",
        "review_title": "Alright I guess",
        "review_detailed_main": "Jiu Jitsu is a decent time passer. If the film was better written or structured this might have been more than that. Aliens from outer space got nothing better to do than test our martial arts skills every six years. There is almost non stop action and the fights are decent enough. This sci fi action/comic book film is watchable, but far from great. Nick Cage was good in this and it got him a nice payday at least. Jiu Jitsu is fine for a one time only watch, but really that's about it."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "ctilly69",
        "review_rating": "1",
        "review_title": "Wow! So bad!",
        "review_detailed_main": "Couldn't bring myself to finish this film, because what i saw was awful. The camera work ruined some potentially good fight scenes, some of the acting was horrendous and the plot was ridiculous."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "santos-91666",
        "review_rating": "10",
        "review_title": "So bad its good",
        "review_detailed_main": "It's based on a comic book so of course it's very over the top but for being a Predator vs Mortal Kombat rip off you will enjoy it if like me, that's your thing. Can't wait for Mystery Science Theater to do this movie."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "tahirk-74696",
        "review_rating": "7",
        "review_title": "Popcorn fun just shut up and enjoy it while you have your freedom 😉",
        "review_detailed_main": "Its corny and cheese at times but dope funny as well so just do that right enjoy a dope version of the movie and you will have a great fun filled evenings and thank you Nick Cage you absolute legend."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "darcynader",
        "review_rating": "2",
        "review_title": "Baby's first After Effects project, or, Nicolas Cage really needs money",
        "review_detailed_main": "The title of my review says it all. Effects feel like they're based on out of the box AE filters. Forget everything you know about basic film making techniques, because you won't need them here. Someone needs to tell this director that you need to slow down footage shot of miniatures, otherwise they look like tiny boats in a bathtub."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Traveller2021",
        "review_rating": "1",
        "review_title": "Just Don't",
        "review_detailed_main": "Awful movie, wooden acting, terrible script, ropey effects and quite simply one of the worst performances from Nicholas Cage, which is quite difficult since he can't act for toffee and every role he does is terrible.\n\nDon't waste any time or any money on this film. If you do, you will regret it."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kristellthetruth",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Waste of time, couldn't finish the movie! Was not interested at all!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kostas_Fourkiotis",
        "review_rating": "5",
        "review_title": "Non stop martial arts",
        "review_detailed_main": "Ok that movie is not going to win an oscar and it does not claim it either. The plot is as simple as it gets. The movie clearly focuses on the action. There are long fighting scenes, nice acrobatic moves, nice photography as the film is shot in Cyprus and a funny Nicolas Cage. Not bad if you have an hour and a half to spend without thinking."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sadak7599",
        "review_rating": "1",
        "review_title": "Utterly bad. Avoid!",
        "review_detailed_main": "I tried to watch it with the open mind, considering it merely a comedy made for fun, and expecting at least to see some ju-jutsu scenes.\n\nBut it failed in every way.\n\nAs a comedy is bad; the action scenes are, well, maybe the worst of the last decade. I've seen better CGI in 90s video games. Acting and script are beyond bad. But, to me, the worst thing in this movie is that the title is completely misleading: no ju-jutsu at all. Just sub-standard turning kicks and punch scenes. They could have titled the movie kickboxing, karate, or whatever. Don't care. It is junk. Maybe the worst work of Nic Cage (and it is not an easy ranking, the guy tried too hard, but his career is plenty of garbage). This sub-product make Dr. Uwe Boll a genius in comparison, and his movies look like cinematic masterpieces.\n\nI want Uwe Boll back! He would shine in these times of decaying quality of the platform productions."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Behnam-A",
        "review_rating": "1",
        "review_title": "Wasting resources and time",
        "review_detailed_main": "If you want to see how you can waste anemometer, resources and time, then this movie is a good choice for you. Other than that, it will be a waste of your time. Everything is terrible and above the all, the scenario and cinematography. It is better to avoid it even of you just want to kill your time there are better options for you. It is not the worst movie I have ever seen, but is among the terrible ones for sure."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jaysavage-12432",
        "review_rating": "1",
        "review_title": "WOW!!",
        "review_detailed_main": "With a cast that includes Marie Avgeropoulos, Rick Yune, Tony Jaa and Frank Grillo the only thing that could make a movie suck this bad has to be the Nicholas Cage curse!! Everything he's been in over the last decade has been absolute garbage... IMO. I couldn't even sit through 40 minutes of this crap."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "hosenoggin",
        "review_rating": "3",
        "review_title": "Frank Grillo is in good shape!",
        "review_detailed_main": "This movie is so bad it would be easier and shorter to just say what's good about it........ give me a sec......... I'm thinking......ummm..... Oh! Frank Grillo is in good shape!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lordtimon",
        "review_rating": "8",
        "review_title": "Reviews are little low, give it a watch if you like action",
        "review_detailed_main": "Ninjas versus Aliens. Nic Cage being Nic Cage. Add Frank. Grillp and Tony Jaa and you have a poor man's Expendables. Moussi is wooden, but the action is solid. Yes it's Predator and Mortal Combat, kinda. But a fun filled adventure and it gets the most important aspects of a campy movie like this right."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "staunton-gary",
        "review_rating": "6",
        "review_title": "Wasn't sure what movie I was watching",
        "review_detailed_main": "Thought this was going to be really good for 2020 movie, but it's only just above average. It was said that Nicolas Cage always wanted to make a martial arts movie, maybe if he'd put some work into learning some of the moves that he wouldn't have had the double to step in and do the moves. Granted, he did do a couple of moves himself, but a fail on effort. Alain Moussi (Jake) and his stupid looking \"blank expression\" when trying to remember stuff degrades his cred further, each time he does it. Marie Avgeropoulos (Myra) wasn't convincing as an intelligence officer and I thought that she would have been more involved. Thankfully, there were no romantic scenes involving Cage, that would have lost another 2 stars. Eddie Steeples (Tex) was obviously cast as comic relief, but wasn't given the air time to do so. Rick Yune (Captain Sand) wasn't used enough either, even Frank Grillo (Harrigan) felt underused. The cast was there, the story felt unfinished, although complete, and there's some cringe too. I would recommend with a couple of warnings."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "aarongreenfoot",
        "review_rating": "1",
        "review_title": "Why Cage!",
        "review_detailed_main": "Very bad from the start. One sec someone is yelling to his Sgt the next he's calling him a Cpt.... That's just the start of the worst movie ever!!!!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sweber3303-590-815866",
        "review_rating": "3",
        "review_title": "Bad movie. Waste of time to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "bowmanj-68191",
        "review_rating": "2",
        "review_title": "Been a while since I've seen one this bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "zardoz-13",
        "review_rating": "5",
        "review_title": "\"Jason Bourne\" Meets \"Predator\" with \"Star Wars\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "CountJonnie",
        "review_rating": "3",
        "review_title": "A poor man's Predator + Nicolas Cage",
        "review_detailed_main": "If you take away all the good parts from Predator, and replace those with mediocre fights and a.weird but slightly entertaining Nicolas Cage, you get this movie which is called Jiu Jitsu for no good reason."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "garcia-roger",
        "review_rating": "1",
        "review_title": "Opportunity missed",
        "review_detailed_main": "Predator meets ninjas, meets stupid. This is the only way I can honestly described this mess of a movie. From thin plot to unnecessary changes in camera angles, to subpar acting this felt like a high-schooler art project left to the last minute using their dad's old camera."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "easilyannoyednl",
        "review_rating": "2",
        "review_title": "Fascinating 😳",
        "review_detailed_main": "If you don't take this seriously at all, it's pretty watchable. But if you actually expect a movie with a plot, acting, etc, then don't bother. It's fascinating how terrible it is. Ridiculous dialogues, horrendous sounds and music, no logic at all, bad CGI, everything you can imagine is worse in this one."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lynnspook",
        "review_rating": "3",
        "review_title": "YOU ARE THE RABBIT",
        "review_detailed_main": "The lead actor is as wooden as they get. Nic Cage is probably laughing all the way to the bank, heard he made five mil for this! The villain was a \"guy in a rubber suit.\" If you really enjoy martial arts, however cheesy and staged, then this film is for you😄"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "ReliableReview",
        "review_rating": "8",
        "review_title": "Space ninja and martial arts! What's not to like?!",
        "review_detailed_main": "This is a mix of Predator and Mortal Kombat without the fatalities. There isn't much story but then again when you're fighting space ninjas with kung fu you don't need much story. This is a goofy chill action movie you can unwind with on a Friday night over a beer. Don't expect anything deep or meaningful and just enjoy the action for what it is. A must see for fans of Nic Cage and Tony Jaa."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "imseeg",
        "review_rating": "6",
        "review_title": "Cant understand the low ratings. It's a B-movie, but with solid figthing scenes. Lots of them. And Nicholas Cage is a great guru fighter. Nice!",
        "review_detailed_main": "All I wanted (and what I got) were great fighting scenes. Lots of them.\n\nHilarious and great role by Nicholas Cage as a GURU fighter. He looks like a hippie, he talks like one, but he fights like the wind. Great. Too bad, his role is rather small (25 minutes screentime)\n\nThe good: great action photography, for a B-movie that is to say. It has got a thumping soundtrack as well. Never a dull moment. It keeps me excited. I dont understand the very low rating.\n\nAny bad? The story about an alien fighting people on earth in Jiu Jitsu fights is ridiculous, but it is NEW and rather refreshing. And the execution of these fights are quite good.\n\nTreat it as a solid B-movie and you will have a good time IF you are into a full FIGHT movie, because that is what it is..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mitchshewett",
        "review_rating": "1",
        "review_title": "Didn't realise they still made movies this bad.",
        "review_detailed_main": "Can't believe it how bad this film was. The martial arts in the film isn't worth getting through the terrible story or the over acting."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "getowned-com",
        "review_rating": "1",
        "review_title": "If I Could Give It Negative Stars I Would",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "bugule",
        "review_rating": "2",
        "review_title": "Jiu Jitsu Slowmo",
        "review_detailed_main": "Why did i watch this? Well because i knew i was going to laugh and i did. I think the worst movie ive ever watched.\n\nThis movie is a nonsense fest, heres why.\n\nIf the movie was released in 2000 or less i would say okay its fine, but the probleme is that its a 2020 movie... So why the cgi looks like a 10$ budget fan fiction youtuber video?\n\nAlso during this movie i couldnt stop myself thinking why. Why this? Why that? I truly think the story has been writen by a 8 years old kid. Worst dialogues than madame web. You actually understand nothing on what happen, nonsense cut to the worst choices making. Also why the alien loves fighting humain from million of light years between galaxy? Theres no point to alien to come every 6 years to fight and coming back again and again, like i said earlier the story has been writen by a 8 years old kid dont forget that.\n\nI love slowmo but they should've called this movie Jiu Jitsu Slowmo, i swear theres slowmo in every fight every 5 seconds, at a point where it become laughable. The fights overall were pretty terrible, there was good idea in the choreography, but with no close plan, no rapid cut, bad music, bad acting, poor audio design, bad cgi and punch hit that doesnt even hit its terrible.\n\nI laugh hard tho, if you wanna laugh watching bad movie this one is good."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mstexn",
        "review_rating": "2",
        "review_title": "BIG disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "ebingen",
        "review_rating": "5",
        "review_title": "Extremely late night movie",
        "review_detailed_main": "You have been drinking whisky all alone during the night, it's late but don't feel like going to bed ?Then that movie is for you ! It's bad but who cares? It's just a lower version of every predator-like movie you've already seen before. You know they will win, there's no really any sense at all and the fights are horrible but Nick Cage adds the laughs and the smiles you need to finish the night pleasantly! 😂🤘"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "vanwolfster",
        "review_rating": "1",
        "review_title": "Not Enough Cage to Carry the Bad Movie",
        "review_detailed_main": "Nicolas Cage is not the main character in this movie nor does he get enough spotlight to be in the movie.\n\nWe have a lot of nobodies going about, talking, fighting, and a lot more fighting without much Cage.\n\nNicolas Cage is a great actor, but to give him a less important role in this movie is a grave sin. I don't want to see him mentor the main character for what felt like less than five minutes, if he is going to be a mentor, make him mentor the main character for the majority of the movie.\n\nAs for the rest of the movie, it is nothing special, it is about a prophecy/event that takes place every now and then where many fighters mostly the chosen one/main character needs to stop a great evil from space. That is it.\n\nIf Nicolas Cage was to be the one to stop this great evil, I would recommend watching it, but as it stands with lack of Cage, do not watch at all. It is bad. Trash. Forgotten.\n\n1:28:48 Dollar Store Medieval Shield."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Briefly on the Bottom 100...though only briefly.",
        "review_detailed_main": "Today, \"Jiu Jitsu\" appeared on IMDB's ignoble Bottom 100 List. Oddly, only a few hours later, it was gone. It did land towards the end of the list and I assume some other bad movie got a few negative votes during that time...pushing \"Jiu Jitsu\" back off the list. Still, I have been trying to see as many of the Bottom 100 as possible, so I decided to see it...especially since didn't cost anything to see it!\n\nThe story finds some martial arts expert with a loss of memory, which is bad as he's needed to lead an attack on some alien baddies. And, this ultimate battle seems to happen every six years...and I have no idea why. Wouldn't once be enough?! As you'd expect, there's a lot of kicking, punching and one-on-one combat where the adversaries somehow forgot they were armed with GUNS. When they do shoot at the guy and his associates, it is with lasers...which are about as effective as the ones used by the Imperial Forces in Star Wars! There also is some point of view fighting...which is neat at first but becomes annoying since it's overused.\n\nWhy do I think the film made (briefly) the Bottom 100? Well, despite the punching and kicking, the martial arts isn't always that good, there isn't a lot of plot, the aliens seem much like those in \"Predator\", and the acting is fair at best. Surprisingly, you see Nick Cage in the movie (eventually) and I cannot blame him for being in this low rated film despite knowing little about jiu juitsu. Why did he do it? Because they paid him $5,000,000 for three days' work!! Heck, I'd make a porno for that much money...though I might have to pay people to see it!\n\nOverall, while I don't think it's that horrible. I've seen at least a thousand really awful films, both from IMDB's Bottom 100 as well as from various other Worst of Lists, and I cannot possibly place this in the bottom 100 of widely released movies. Bottom 1000? Maybe. But it is mindless and unless you are weird like me and WANT to see dreck, I wouldn't bother with this one. But if you do, I wish you well!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dekkerted",
        "review_rating": "5",
        "review_title": "It's not that bad at all !!",
        "review_detailed_main": "It starts off a bit slow, we were almost about to give up. But don't. It all becomes clear soon, and then it's very interesting. Shades of a familiar theme (no spoilers) which if you like Sci-Fi and defending Earth type action you'll appreciate. Sadly, it's no stunner, but if you persevere through the confusing, dare I say a bit much where everybody with MMA/Jiu Jitsu seems to fight, this becomes a reasonable movie. Take it as it is for a bit of Sci-Fi entertainment :-)"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "john_kane_ie",
        "review_rating": "",
        "review_title": "So bad, it's just bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Very good...",
        "review_detailed_main": "Every six years, an ancient order of Jiu Jitsu masters join forces to face and defeat dangerous alien invaders. But when Earth's ultimate fighter is defeated by the leader of the invaders, the future of the planet and humanity hangs in the balance...\n\nA mix of things I haven't been able to decide yet to rate... Jiu-Jitsu + Aliens + Nicola Cage = bomb ingredients that I tend to love, with some good first-person fight scenes, like in a game, nice to experience, everything so simple that it seems like a B for luxury, intentional trash, I like it, I think, hehehe... The introduction was good, the film is boring and boring, a lot of action, which is not very entertaining, disperses..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "andyosbourne66",
        "review_rating": "6",
        "review_title": "If Tony Jaa wasn't in it I wouldn't have watched it.",
        "review_detailed_main": "The martial arts in the movie was decent,Tony Jaa wasn't at his best but I watched the movie because of him being in it. I've seen much better martial arts movies by far. The action in it wasn't bad. The story to the film was quite poor,I could clear.y see other parts from other movies in this film."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sarah-baldwin",
        "review_rating": "1",
        "review_title": "Should be illegal",
        "review_detailed_main": "This movie is so absolutely horrible it should be illegal because it robs you of minutes u can't get back. Horrid plot with no logic or reasoning and main character is like a robot. Could have been great w the cast they had. MAJOR DISAPPOINTMENT!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "neil_davison-354-77074",
        "review_rating": "1",
        "review_title": "Deary Me is this how Low Nick Cage has Fallen",
        "review_detailed_main": "Mr Cage here's Your pay Cheque See you around.\n\nThat's about all I can be remotely positive about!!\n\nOh and apart from the above the Screenplay at the beginning seems to take ages for the movie to start."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "tesswysko",
        "review_rating": "3",
        "review_title": "Wow... I'll Bet These Actors Are Ashamed Of This Movie!",
        "review_detailed_main": "For As much as they must have spent on salaries for so many A & B list stars, like Rick Yune, & Nick Cage, you think they could have found more than their bottle return money to put towards SFX! But then maybe that WAS the problem! The storyline was a joke, the fighting sequences even more so (I have experience, I'm a kickboxer, & my brother is a martial arts champ who holds MMA titles.) Everyone said it was bad, I was dropped as a baby, so i don't listen real well.... I will from now on!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dinogv",
        "review_rating": "2",
        "review_title": "Just don't wate your time. HORRIBLE movie",
        "review_detailed_main": "What a waste of time... One of the movie when you telling yourself what the heck was this..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "syrous-zarezadeh",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I watch a bout 20 minutes of this movie and found it out, it is really waste of time.\n\nNo content, not good camaca angel, and etc."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "joshuanknode",
        "review_rating": "2",
        "review_title": "A great attempt, and an epic failure.",
        "review_detailed_main": "This movie had all the elements to be a great martial arts film. Big names, an intriguing story, a believable villain, and some good cinematography. Nothing came together however, and the final product feels like it was two or three different movies stitched together. The story was disjointed and nonsensical, characters had little to no motivation, people just walked aimlessly with no explanation as to where they were going, and dialogue felt like it came from different pages of the script. The Director seemed to have ambitions of changing the game, as there were several bizarre choices with cameras whipping around erratically and there was an out-of-place POV sequence that felt like footage from a Sega CD game. It felt like the filmmakers knew how to do fancy gimmicky stuff, but not the fundamentals.\n\nOverall, I suspect that given some time and a good editor, this movie could be recut into a watchable one, as many individual scenes are pretty cool, but as a whole the movie is an unintelligible mess."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lunaventure",
        "review_rating": "2",
        "review_title": "Wow what a waste of money and Talent",
        "review_detailed_main": "So Sad to see Nicolas Cage make a cheezy martial arts film. The screenplay was very badly writen and the actors were second rate. Although I think they tries to do their best with a poorly written script. The visuals were okay, but thats not saying much."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "nathan-05316",
        "review_rating": "2",
        "review_title": "Directed by Michael Scott",
        "review_detailed_main": "Comparable to Threat Level Midnight, just not quite as good.\n\nIn his live action reboot of Kung-fu Panda, performances never quite land the punches. Sadly Jiu Jitsu lacks the charisma of Michael Scarn, the acting masterclass from Samuel (the robot butler) and the believable villain - Goldenface.\n\nI give this 2/10 Dundee's."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "michelleoverton",
        "review_rating": "10",
        "review_title": "Don't listen to 'em",
        "review_detailed_main": "Watch this movie and you won't regret it. Sure it's not about the acting but I enjoyed watching all of the stunts. Some of the best martial artists and stunts people around. Ok and Nicholas Cage. He added some finesse in between the fight scenes. You can always believe what people say, so check it out for yourself!!!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "tsunami40258",
        "review_rating": "7",
        "review_title": "Mortal kombat+predator= jiu jitsu",
        "review_detailed_main": "This isn't a great movie but it's at least entertaining and has some good actors."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "hariah-07433",
        "review_rating": "2",
        "review_title": "Not Jui Jitsu...",
        "review_detailed_main": "Worst fight scenes of any movie i've ever seen... thank you for 15 wasted minutes..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "fatherofchicks",
        "review_rating": "3",
        "review_title": "Unforgivable production movie",
        "review_detailed_main": "I really cannot find much good to say about this movie.\n\nFrom the start it just felt like a mediocre with poor directing and production thought.\n\nIt had a comic book chapter opening which was cool, you are not sure if this is an adaptation from a comic book or comic novel. There isn't much to the story, the main character was just running from some random alien shuriken, fell into the sea and hit his head.\n\nHe was picked up by a fisherman whose wife stitched him up and delivered him to the US military base. From there the conversation with translation was meant to tell a narrative story with added jokes. This scene was ok.\n\nAnd after the guy wakes up is when you experience bad acting, terrible dialogues and nonsense procedure. How can you ask someone their identity when they woke up, and immediately interrogate them. While interrogating, you assure them that you are running facial and finger print scan :/ later on you want to give a truth serum.\n\nNothing just doesn't make sense.\n\nThen the fighting, I love martial arts movies. And many who are or were eager to watch this movie are fans of the lead actors, or martial arts movies lovers. And the choreography was not all that good. Miss hit interaction, miss sound effects hit, and one sided camera angles.\n\nI couldn't tell what fighting style Tony Jaa was using, all I see him doing his kicking and hitting, and the annoying thing with the movie was the constant over use of slow motions! We understand that every stunt performed by Tony Jaa and Alan were real, but that doesn't mean you need to add slow motion to every hit thrown!\n\nEven though the camera angles were one sided shot, at least it is way better than majority Hollywood movies, at least with this one sided shots, you can see enemies being hit that looks real.\n\nI don't mind the poor budget, poor production or poor sfx, but some of the sfx were unneeded. Such as the dust hit marks, at the start of the infiltration rescue, Alan was fighting one of the soldiers. And each kicks to the soldier would leave a smoke like effect. At first I thought it was a video game hit effect but it was just a poor dust effect to make it look like Alan was actually hitting the guy, it was an unnecessary effect.\n\nI really cannot say much about the movie as I only watched 32mins of disappointing directing. The mysterious villain that was electrocuting the characters was dumb and over powered, it also felt too much like Predator movie.\n\nThen the doctor and translator sneaking up to Alan when he was electrocuted begs a question why the alien didn't detect them sneaking. Or why those sneakers didn't see anything odd.\n\nThe movie just felt really stupid and I did not like the way it was directed! I do like the first person switch to fighting camera angle, that was cool and was never done before.\n\nSo disappointing that this movie could have been better.\n\nJust a waste of good actors: Alan, Crump, Tony Jaa and Frank!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "catimeup",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "We all know the Nicolas Cage drill, he's in everything no matter how bad, so i figured having him be a more secondary character to some of the martial artists in this movie why not give it a try.\n\nI've seen over a thousand action movies good and bad, hundreds of martial arts movies good and bad, and seen just about everything done by Tony Jaa. As far as fight choreography and fight cinematography are concerned this movie is very low on the totem pole. Bring me an english dub of a terrible '80's or '90's martial arts movie and i would rather watch that over this movie.\n\nThe fight cinematography and choreography are terrible which could be ok if the movie was anything other than a martial arts/action movie. It makes me question whether or not the makers of the movie have even seen action movies. Combine it all with a bad script and you have arguably the worst martial arts film i've seen in the last 10 years."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sunskyuk",
        "review_rating": "1",
        "review_title": "No Review",
        "review_detailed_main": "I gave it a 1 because there was nothing below 1. In all sincerity, this movie is a -100. The story line, acting, graphics and comedy is all wacked. I could not even laugh."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kussanakorn-thailand",
        "review_rating": "1",
        "review_title": "This movies grade C",
        "review_detailed_main": "This a movie grade C. To boring and bad movie . GRADE C."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kirkkinamon",
        "review_rating": "1",
        "review_title": "I'm not sure where to start",
        "review_detailed_main": "I've seen some horrible movies in ny time, but this takes the cake. Horrible plot, confusing story line, TERRIBLE special effects, the only redeeming qualities are the overly dramatized martial arts fight scenes are pretty good and Crab Man from \"My Name is Earl\" is in there too.\n\nNicholas Cage....... well, he's his typical crazy self. Definitely not his best acting job."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "caseyburrowscb",
        "review_rating": "1",
        "review_title": "Movie was awful.",
        "review_detailed_main": "I have no idea how it even made it to netflix to be honest. One scene moves to the next and you're like how the hell did they get there. Tony jaa is one of my favourite martial artists and this didn't do him any favours from what he's done in the past. The director needs to re think his career. Acting wasn't believeable at all and everything was cliché."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "chrissiechanel",
        "review_rating": "1",
        "review_title": "Shockingly cheap & poorly edited",
        "review_detailed_main": "I have worked on student films with better acting, stunts and CGI! Honestly, this film is an embarrassment, especially the stunt men throwing themselves off roofs after a little slap which they stayed open for during this poor choreography. When we began watching it, my excuse was it was made in the 80's, but no it is 2020. How netflix let this go public without fixing the cgi, I have no idea, not to mention the 1st person \"video game\" camera angle they attempted to shoot.\n\nSorry I didn't get past 30 mins of this movie so that is all I have to say!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "karthickraj-90243",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "Nota a simp but I gave 10 for this flim just because of Marie Avgeropoulos"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "gatorgus48",
        "review_rating": "6",
        "review_title": "Not as bad as reviews indicate.",
        "review_detailed_main": "While not great by any means, it was certainly watchable. Lead isn't a particular good actor, but he certainly looked the part.\n\nPlot was nothing new, but it still was a decent take on the story. Could have used a few more tweaks to story and dialogue.\n\n5 is a fair score, I bumped it up one to counter some of the low scores."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "willieb-52785",
        "review_rating": "1",
        "review_title": "Predator meets Junk Jitsu",
        "review_detailed_main": "Another 2020 rubbish move, a concoction of Predator and other movies bungled into on long fight scene. It's PC with the right mix of sex and race but as a movie it sucks."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mariohmartins",
        "review_rating": "1",
        "review_title": "I've watch it 3 times. Now I understand.",
        "review_detailed_main": "The first time I watched it I immediatly knew it was something crafted to be remarkably bad. Every detail seems to target the lowest possível level to achieve a distinctive place in the category \"so-bad-that-is-good\". On the second time I've invited my eldest son, fan of trash movíes. I did the same yesterday with other Z-level movie lover. Now I undestand. It is a pretensious movie that failed to be laughable."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "maue-19674",
        "review_rating": "3",
        "review_title": "So Stunningly BAD - it is nothing but a kick to the face of Cinema!",
        "review_detailed_main": "To quote another famous franchise I had a 'very bad feeling' about viewing this from the start. For instance, Cage needs the right Director and material and God, this is NOT it. That he IS this best thing in this is not saying a lot. I won't even bother to explain the 'Plot' - the Film makers didn't manage it so why should I bother! I didn't realise that even now, second-rate 'B' movies were still being churned out. I'll be honest, if all you want is a load of 3rd rate actors in second rate 'Staged Martial-Art' fights, then this is for you. If you are actually looking for anything more than that, give this a WIDE berth.\n\nThe Film comes across as a thinly disguised 'Martial Arts' rip-off of the 1980's Classic Sci-Fi film 'Predator' - and the effects in this are barely better than that 35 year old Film. The Acting, Direction, Effects and Script are SO POOR, you will think this is a cheap made-for-TV movie - but no, apparently they spent $25million on this, though where it went is as big a mystery as how this was ever made.\n\nHowever, if you are a Film buff that thoroughly enjoys watching movies that are SO badly made that they make you laugh or shake your head in amazement - well, then, this may be worth 100mins of your time - in fighting parlance - KNOCK YOURSELF OUT!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "tvNfilmZombie",
        "review_rating": "1",
        "review_title": "Just bad",
        "review_detailed_main": "This movie is just plain bad. Horrible \"special effects\". Bad story line. Subpar acting. Even the fighting scenes were badly done. Waste of Frank grillo and Tony jaa."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sbweightman",
        "review_rating": "2",
        "review_title": "Like 'Predator' but with martial arts.",
        "review_detailed_main": "You have to give it credit for its inventiveness in setting, style and commitment to its comic book origins, but it's poorly acted, poorly written and it takes its outlandish premise far too seriously.\n\n- - - - - - - - -\nThe fight scenes are numerous, fast paced and entertaining, but use slow motion excessively. Cheap special effects, annoying first person camerawork and a silly plot makes this a weird production overall.\n\n- - - - - - - - -\nCage brightens things up briefly, but just adds to the oddness and doesn't make things much better.\n\nOverall, I would score Jiu Jitsu as a two out of ten."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "j-whitaker",
        "review_rating": "2",
        "review_title": "When did this film get made?",
        "review_detailed_main": "I thought they no longer made films like this. Poor, if any, dialogue. Predictable set piece fights. Stillted acting with long pauses. Macho poseing. All reminiscent of the 70s."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "pctstreamguitar",
        "review_rating": "3",
        "review_title": "Aliens + Cage = Jui Jitsu",
        "review_detailed_main": "This is basically a way worse Power Rangers for adults. The fighting is pretty poor & the gadgets aren't as fun.\n\nThe whole time I was wondering how the movie was rated R. This was way more tame than an R rating. Wtf!?!\n\nThere were a couple cool fights scenes. In one they did some point of view swaps with the camera, which I liked.\n\nIt was really hard to figure out what the plot of the movie was. Like I got what it says in the abstract of the film on the back cover. But it was really hard to figure out the motives of anyone in the movie.\n\nSomething was off with the sound too. They really needed the fun subtitles they used on EVERYONE. The low grizzled voices of everyone, except for Cage was unintelligible which made it even harder to figure out what the movie was about.\n\nThere is no jujitsu in the movie. But I doubt it would have made the film any better. Dont mean to dunk on it to much it was fun. I wouldn't watch it again though."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kwenchow",
        "review_rating": "1",
        "review_title": "Another worst action film! Full of boring conversation, and super annoying overuse scene! Avoid at all cost!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "frankpants-49515",
        "review_rating": "8",
        "review_title": "Does what it Says on the Tin",
        "review_detailed_main": "Jiu Jitsu is like if Ong Bak and Predator had a baby and that baby was severely autistic, and what all too often happens in relationships with special needs children Ong Bak and Predator grew distant and bitter towards ones another.\n\nRather than do the responsible thing and seek out professional help for both their marriage and the needs of their child, Ong Bak and Predator showed their child whatever martial arts or sci fi movie happened to be on the USA Network each evening to gain themselves a moment of respite as their lives and legacy slowly spun outside their control.\n\nThat special child of distant, embittered parents grew up to be Jiu Jitsu, with Nicolas Cage in a supporting role as the understanding father it never had."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "subxerogravity",
        "review_rating": "7",
        "review_title": "A series of awesome action sequences worth watching!",
        "review_detailed_main": "It was one thing to find out that Nicolas Cage was in a movie called Jiu Jitsu, that was enough for me to buy the movie on Amazon Prime. It sounds just bonkers enough to be up my alley. Then I discover that Tony Jaa's also in this movie. I could not wait!!\n\nUnfortunately Cage and Jaa are supporting actors in a movie designed to show what a guy named Alain Moussi can do. I don't know if he's doing Jiujitsu on camera but he does have a pretty awesome flip kick. He's no Scott Adkins but we possibly caught this guy at he beginning of his b-marshal arts action movie career, but what what a way to start.\n\nIi is kind of string (and a little racist) that Jaa is not just staring in the movie. They asked Jaa to toned down his cinematic greatest to a 10 rather than the usual 11 so that they could add a bunch of cool camera angles, special effects and slow-motion to Americanize it. Yet still watching Tony Jaa fight is amazing.\n\nNot much of a story but more like a series of really great action sequences that feel greatly influenced by video games more than marshal arts movies of the past (the filmmaker also seems to enjoy comics as I gathered from the all the comic book art being used to transition form scene to scene). The story has something to do with a group of warriors who must defend the planet from alien invaders but one of the warriors (played by Moussi) forgets who he is endangering the mission. The fact that this invasion happens every six years kind of reminds me of Mortal Kombat, but the game these filmmakers are trying to make seems to be a 1st person open world thing.\n\nThere are other cool people in the cast. Frank Grillo who played Crossbones in Captain America the winter soldier. I just binged watched his show Kingdom which is good. Rick Yune, who is yet another victim of Hollywood's tendency to favor White Boys with marshal arts skills. Check out his film the 5h Commandment for proof of that. The film also stars Marrese Crump, a more handsome version of Billy Banks (the Tae Bo guy) who has faced Tony Jaa in a film with Jaa at 11 (The Protector 2). Watch that movie and tell me Hollywood has not slept on this dude's skills.\n\nDespite its lame story the movie is perfect. it just keeps going with so much kinetic energy that it does not stop long enough for you to complain about how weak the plot is. Worth checking out."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "stevenhwood",
        "review_rating": "1",
        "review_title": "Enter the Ninja Alien",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dickje-848-830769",
        "review_rating": "2",
        "review_title": "Even worse than expected",
        "review_detailed_main": "My son wanted to watch this Nicholas Cage-movie. Seeing that it had a 2.9 on iMDB I still wanted to give it a try. A while ago we saw that slightly better rated Left behind with a 3.1, which was quite entertaining and we even made it without trouble to the end.\n\nWith Jiu Jitsu, it was different and after 30 minutes or so, we thought 'what are we watching? Do we need to continue?' I wouldn't mind quitting, something I actually never do, unless I'm starting to watch a movie, finding out I've seen it before. But he wanted to continue and so did I, but we both agreed it was bad. I can't remember having seen a movie that bad: the story, if there is one, doesn't make sense. Acting was poor. And during the fighting scenes the slomo's got nerving. This was a really wasted 1,5 hours. And even Nicholas Cage wasn't able to save this movie. :-)"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "johnross-73123",
        "review_rating": "1",
        "review_title": "Wow. You know those movie mashups you thought about before you were a teen? Better than this.",
        "review_detailed_main": "I found myself literally screaming at my TV 'Learn how to Cinema!' as had a POV shot to hide how poor the main character is at martial arts transition into a worms eye video of the fight by having the camera take a hit and then the main character Steps into frame. So he wasn't the POV? That's not how that works. Then they do it Three times in that fight scene.\n\nI got some enjoyment looking for all the camera tricks they were trying to hide how our main character isn't as fast or athletic as Tony Jaa or most of the extras. Pulling frames out of his punches to make them look faster (it's also why it's so jerky at points) framing and editing... but the plot of the movie is a mess, the acting bad in a not even Cage can save the scenes he's in way.\n\nNot so bad it's good either, as it doesn't ever seem to embrace how camp it could be."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jrtlseck",
        "review_rating": "3",
        "review_title": "Where's the jiu jitsu?",
        "review_detailed_main": "Tony Jaa (muay tai), Alain Moussi (another striker) Frank Grillo (self proclaimed fight fanatic in good shape), that Korean actor who plays the bad guy in 95% of his films (historically another striker) along with some unknowns who all kick a lot.\n\nWhere's the Jiu jitsu?\n\nIt's literally all stand up kickboxing, karate with occasional locks and occasional throws and some international blunt and bladed weaponry thrown in.\n\nNick Cage is irritating as hell.\n\nAs far as movies go, if you don't take it seriously and appreciate a roundhouse kick, you'll probably enjoy it."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "ralphtran",
        "review_rating": "1",
        "review_title": "if i could give -10 stars",
        "review_detailed_main": "It is so bad i can't find words to describe how bad it is ... The fighting is like watching a wrestling match... as fake as it can get with all the hurting and groaning... How did it get funded 25mil is amazing... I feel bad for the actors that had to see the result of what they worked on; tainted their name."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "alec_",
        "review_rating": "2",
        "review_title": "Yet to see a movie worse than this.",
        "review_detailed_main": "I envy anyone who hasn't seen this movie, not because it was good, but because you don't have to have it's God awful contents ingrained in your psyche. If you Intend to watch this movie, I suggest doing so in a chemistry lab, so that you'll have an eye wash station available after.\n\nIf you threw this movie into a dumpster fire, I'd feel bad for the dumpster. If you gave me the choice of watching paint on a wall dry, and watching this movie again, I'd get enough paint for two walls, just to ensure I'd be saved from enduring the emotional wear and tear of the second option.\n\nI honestly cannot believe this movie was able to come into existence, every idea I have as to how this was made is absolutely insane. For example, at the end of a week long bender, nicolas cage's coke plug convinced him to star in his five year old son's script, written in crayon, as a grand gesture for his 6th birthday. That is the best idea I've come up with thus far. Anyone involved with this movie should be imprisoned. It is a crime against humanity.\n\nIm assuming the routine for each scene went something like this - film fight scene... Set change....tilt camera 15 degrees....repeat same chereography from previous fight scene.... commence therapy session for all involved,... repeat\n\nOn a more serious note. This movie is worse than \"so bad it's good.\" I thought I'd be able to get a laugh out of this at least, but it was genuinely just awful. I don't think I've seen a movie this bad before, and I've watched a lotttt of movies. I will give two stars, simply because there seemed to at least be an effort in the creation of this. It was just really bad. Don't watch this movie."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dustyboyd",
        "review_rating": "1",
        "review_title": "Exceptionally bad",
        "review_detailed_main": "I tried to watch this movie on a plane, and literally couldn't stand to watch it. I can't think of another movie I've physically been unable to watch...so I guess that justifies the 1 star..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "aaronhamilton-14418",
        "review_rating": "2",
        "review_title": "I'd rather get fillings without Novocain than watch this in its entirety",
        "review_detailed_main": "I made it through about 25 minutes in and just could take it. Terrible dialogue, campy fight scenes, and soldiers who shoot as bad as storm troopers. Skip this movie."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jusmersingh",
        "review_rating": "10",
        "review_title": "A MOVIE FOR THE MARTIAL ARTS FAN",
        "review_detailed_main": "So I've read all the negative press. Can't really argue it's definitely no masterpiece.\n\nBut it does have a plot that's incredibly engaging, the performances are good (special shoutout to Nicky Cage).\n\nIts a different story to the usual and sadly production could have been better but it's also raised by the level of performances involved. It's never boring, if you TMA lore it's a treasure trove and it definitely is worth a watch."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mantasj09",
        "review_rating": "6",
        "review_title": "Amazing Fights!",
        "review_detailed_main": "The film is a weird combination between Predator and Mortal Combat with amazing fight sequences and the overall production quality way higher than your typical Martial Arts flick. However, it still feels like the crew was working on a tight schedule because most of the acting scenes could have benefitted from a few additional takes. Or maybe the actors just found it difficult to get into their characters when the film script didn't make any sense.\n\nAlain Moussi - an amazing martial arts performer, second only to Scott Adkins among current English speaking 360-jump-spinning-hook-kicks throwing action stars, looks really lost here. I mean it's not just that his character is confused as he cannot remember where he came from, Alain himself looks utterly confused about how did he end up on a film set and what should he be doing there. That's a shame, because he did quite a decent job in Kickboxer series reboot but is completely overshadowed by pretty much all the supporting staff as an actor. And it's not like other performances are Oscar worthy - I mean when current days Nicolas Cage stands out as a superior actor, you know, how terrible others should be. The fact that Alain delivers only like five full sentences throughout the whole film doesn't help to build up his character as well.\n\nTo say that the film lacks a decent plot would be an understatement. 1987 Predator feels like a Shakespearean drama compared to this one. None of the main characters' actions make any sense and the whole story is so similar to Predator and Mortal Combat that it's difficult to consider this as a separate movie and not a kind of cross-sequel-spin-off of both original franchises.\n\nBut disregarding all that, the film provides a decent entertainment due to amazing fight scenes. Quite surprisingly, the best fight scenes are crammed up in the first 30 min of the film but they're so good that they make up for the non-existing plot and pedestrian acting. In terms of fight sequences, this is probably one of the best American-made martial arts films in the last decade. But once again, unless Mr Adkins is pulling off his Boyka magic or John Wick goes on a wild killing spree, there's not much of a competition. To sum up, the film is definitely worth to check for any hard-core Martial Arts film fans but any person looking for a comprehensive story and interesting, believably acted characters might be disappointed."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "anselmdaniel",
        "review_rating": "2",
        "review_title": "Meandering story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "XpocalypseSurvival",
        "review_rating": "5",
        "review_title": "Average martial arts exhibition",
        "review_detailed_main": "If you watch this movie for a story or plot, you will be disappointed. The story is essentially Predator (an alien with weird vision comes to Earth to hunt humans), and the plot just makes no sense at all. Basically this movie is just a framework for showcasing a series of fight scenes.\n\nUnfortunately, I didn't find the fight scenes very satisfying. And that is probably a bit unfair. In most other movies I would have said they were good, but considering the talent available here (Tony Jaa alone), it just didn't seem anywhere near what it should have been.\n\nOverall the acting was okay and locations were good. They tried to do some interesting camera work, which sometimes was interesting, but often was just distracting. A long one-shot take fight scene in the beginning was cool (even if it made no sense).\n\nI'm no martial arts expert, but It seemed to me that very little of the moves were actually Jiu Jitsu, so that was a little weird as well."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "george-natis",
        "review_rating": "3",
        "review_title": "What did I just watch?",
        "review_detailed_main": "Senseless plot with some Jiu Jitsu fight moves Really Nicolas used to act in some very good movies but this B movie doesn't do justice.\n\nThis movie shall be better archived and disclosed from any further viewing. Honestly."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "snowboarding_babando",
        "review_rating": "1",
        "review_title": "Confusion",
        "review_detailed_main": "WHY are good actors in this garbage? Frank Grillo, Tony Jaa, you are both way, way above this!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "watts_hq",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "25 million dollar budget?\n\nThis was so awful series of pointless fight scenes. There was nothing good nor original."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "whatsupdike83",
        "review_rating": "5",
        "review_title": "Low budget action syfy that swings for the fences.",
        "review_detailed_main": "Don't listen to the haters. The action in this movie is pretty solid given the incredibly low budget. All that is due to all of the actors (except cage) doing their own stunts and having stunt backgrounds. Early one take scenes are ambitious and try some new things."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "aanaughty",
        "review_rating": "1",
        "review_title": "Bad is an understatement 😤",
        "review_detailed_main": "It's so bad, I cook better food than this 😋😜 No story, bad acting, sloppy camera work, in short don't waste your time."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sarejina",
        "review_rating": "3",
        "review_title": "what movies have y'all been watching?",
        "review_detailed_main": "I am trying to figure out what kind of martial arts movies people who reviewed this film have been watching. Someone dared to compare this to the Shaw Brothers films? I didn't mind the story line, I didn't really mind the acting, because let's face it we don't watch martial arts movies for the acting. I am a big Grillo and Jaa fan. I don't like Cage, but I think this role suited him. It is all about the action! The action was way too slow, let's face it I could have done some of the moves and I am a fat grandma. Why did they keep stopping in the middle of fights? Why did they waste so much talent to make a boring movie? Also olive trees and Buddhist temples...who'd a thunk? Mr Yune you are sexy af....you were worth my suffering."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Fredtimbo",
        "review_rating": "9",
        "review_title": "Yes, It's Nicolas Cage In A Martial Arts Action Film",
        "review_detailed_main": "Getting past the silly idea of an alien martial artist, Jiu Jitsu is a really good martial arts action movie I've seen in a long time, and having Nicolas Cage and Frank Grillo is icing on the cake. The film is essentially a knockoff of The Bourne Identity and Predator. The fight scenes are exceptionally well done, and even Cage gets in on some of the fight action. Jiu Jitsu is certainly worth checking out."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "tdwillis-26273",
        "review_rating": "6",
        "review_title": "From a Female Perspective",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "irusha_sunny",
        "review_rating": "1",
        "review_title": "Jiu Jitsu movie with stiff acting and very little jiu Jitsu",
        "review_detailed_main": "Terrible concoction. Poor Nicolas Cage must be desperate for money. So sad to see his talent buried deep under this pile of rubbish of a movie. Avoid."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "stopsendingmeotherpeoplesmail",
        "review_rating": "1",
        "review_title": "One question Mr Cage, Why 🤔",
        "review_detailed_main": "I could only manage 30 minutes of this poor poor attempt at a Predator rehash. Acting was more wooden than a tree, special effects neither special, nor effective and the story, well just a shoddy attempt to recycle a past Arnie classic.\n\nI allowed myself to be swayed by the name of Nick Cage among the cast and started watching with anticipation. Shocked and saddened that a true great would give this his time. I hope this is not a sign of things to come from him.\n\nOverall, believe every bad word written in the reviews, it's all true. Save yourself, don't bother and instead, find a b-movie to watch, as they are even superior to this."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "voigaswolpertinger",
        "review_rating": "",
        "review_title": "apocalypse martial arts",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "bmaasth",
        "review_rating": "1",
        "review_title": "No. Just no.",
        "review_detailed_main": "I'll preface this review with the fact that I only made it 25 or so minutes into it before stopping the playback. The overly frenetic cinematography is rampant and while some films are able to use the \"pass the action from one person to the next in a fight scene\" very well, this one fails to the point of being incomprehensible. The director of photography shouldn't be legally allowed to own an Instamatic camera. The saving grace of what was palatable is the translator's ineptitude in an early scene. Unless you're a die hard Tony Jaa fan and need to see his entire catalog for some completionist reason, skip this one."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "danc-95207",
        "review_rating": "2",
        "review_title": "A horrible movie about a filming schedule conflict between two C list actors.",
        "review_detailed_main": "Director did best they could covering this up. But at some point it becomes painfully obvious. It feels very much like a film school's final project. About 75% of the way through the rails just fall off and every dediculous twist you'd expect comes out. Crab man is easily the best part."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "phoenixnova-62065",
        "review_rating": "1",
        "review_title": "Career ending.",
        "review_detailed_main": "I believe this move writes the end of Nickolas cage and all the other actors/actresses career absolutely worst fillm ever. With a budget of 25m you think you would do some real work to earn some of that investment back. Unless you over paid to have cage in your movie. Mr. Director way to blow it."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "B_Truth",
        "review_rating": "1",
        "review_title": "Predator rip off.",
        "review_detailed_main": "All you need to know about how bad this is that Bruce Willis wanted to do it but couldn't. So Cage stepped in. Those 2 I'm positive have a bet on who makes the most trash in a 5 year period.\n\nWillis is winning."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "masonmillstx",
        "review_rating": "5",
        "review_title": "Better than the Snyder Cut.",
        "review_detailed_main": "Tells a better story in a normal amount of time all in widescreen with equally bad CGI as the snyder cut. So give it a chance if you like b movies."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "cauliflowercliffhanger",
        "review_rating": "3",
        "review_title": "Not a good movie but still enjoyable",
        "review_detailed_main": "This is not a good movie by any standard, but if you go in expecting some B-class action and nice fighting, you might still enjoy it.\n\nThis movie had some Predator and kungfu movie vibes going on, but the plot is not very complex, acting is mediocre at best, and the CGI is.. bad.\n\nBut there are some interesting elements and nice fight scenes. Fight scenes are not the typical dark mess of short cuts, rather you actually get to see the fighting here.\n\nAnd to people complaining that there is no jiu jitsu, I'd assume they were expecting the Brazilian jiu jitsu style of mat rolling, as there are many jiu jitsu moves used throughout this movie (kicking, punching, throws and locks).\n\nKeep your expectations low and enjoy the martial arts of this movie!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "anastasiamikhaylova",
        "review_rating": "10",
        "review_title": "Absolute Must See!",
        "review_detailed_main": "I loved the movie! The cast is great! Nicholas Cage brings his sardonic humor and impressive acting to the film. The stunts are massive and all the action sequences are so well choreographed. Jiu Jitsu is insanely entertaining! Absolute Must See!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dinoslavnovic",
        "review_rating": "6",
        "review_title": "You get what you expect , and for me that was a meme action",
        "review_detailed_main": "Nicholas Cage in a fighting style movie ? Why not , the movie is exactly what you came for , an action filled picture with no particular plot whatsoever I really enjoyed most of the fighting scenes in this movie except for POV and 1st person scenes which were obviously a tryout , stick with third person / bird eye view and this might would've been a 7 , but an enjoyable experience non the less. ITS ALIEN POLITICS 5 THROUGH 15... I really dont see how you went to the cinema and expected a masterpiece when in fact it is , just unpolished"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "guyzradio",
        "review_rating": "3",
        "review_title": "A true enigma on so many levels, and forgettable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Gordon-11",
        "review_rating": "",
        "review_title": "Cool fight scenes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "incertusveritas",
        "review_rating": "1",
        "review_title": "Wow, just wow...",
        "review_detailed_main": "It's been such a long long long time since I've seen such a bad movie, I mean, it's so bad it's hypnotizing.\n\nI really believe this was filmed with a cellphone using cheap camera FX filters and the acting could make Al Pacino cry for real.\n\nOne thing's not clear, why oh why did the Cage sign for this one. Vacation money?\n\nWatch it with close friends, have a laugh and good luck."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "nanaever82-222-734674",
        "review_rating": "1",
        "review_title": "A failed movie in the truest sense of the word",
        "review_detailed_main": "Boring from start to finish Failed fairy tale I expected to find something positive in this movie, but I didn't find anything All Nicolas Cage films have recently become very bad in all respects The movie is boring The ejection is bad The scenario is weak The story is trivial The editing is very bad Even video input and output on the computer is very bad For a moment, I expected that the people working on this film were students and had no experience I expect that it would be better for Nicolas Cage to retire, not act, and sit at home and on his couch Please, Nicolas Cage Sit at home and don't think about making a new movie."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "fatmanandbobbin",
        "review_rating": "2",
        "review_title": "Bad",
        "review_detailed_main": "This movie is the definition of trash. The majority of the story consists of a stream of bad fight scenes with the occasional dumb cliche. There is nothing good here. If you value good characters, plots and action, you will not like this movie. Any positive review is obviously fake."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "zyuda",
        "review_rating": "2",
        "review_title": "SHOULDN'T BE A MOVIE",
        "review_detailed_main": "While the film's concept holds promise with its blend of science fiction and heroism, the execution leaves room for improvement. One notable aspect is the writing style, which, unfortunately, comes across as somewhat juvenile, akin to middle school dialogue or soap opera clichés. To elevate the narrative, it's crucial to refine the dialogue, infusing it with a more mature and nuanced tone. Additionally, exploring the backgrounds of the characters could establish a stronger emotional connection with the audience.\n\nThe relationship between the amnesiac hero and the alien could be further developed to create a more compelling dynamic. By steering clear of predictable plot points and clichés, the script can maintain a sense of freshness and originality. Consider delving into more complex emotions and avoiding narrative shortcuts, which might give the film a more sophisticated and mature edge.\n\nUltimately, addressing these aspects can transform the film into a more refined and engaging cinematic experience, resonating with a broader audience. A balance between the intriguing premise and a polished execution is key to ensuring the film's success and leaving a lasting impact on viewers."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "stef-58486",
        "review_rating": "5",
        "review_title": "I grew up watching worse martial arts movies in the 90s",
        "review_detailed_main": "I grew up watching worse martial arts movies in the 80s & 90s... But like a lot of other reviews on here had a bit of morbid fascination watching this...\n\nPoor on so many levels, but funny enough to make me smile - so much so, I'm still watching while I type this review... Spent more time reading other people's reviews on here than paying attention to the actual film, lol...\n\nNic Cage > legend\n\nNow when I'm watching the movie, the not so special effects actually make sense! It's not that they are bad on purpose, but actually done as a comic book style, which ties in with the comic book segways.\n\nIf you grew up watching American Ninja or King of the Kickboxers etc, I think you may enjoy this... But who am I to judge. ;P."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "gfx01",
        "review_rating": "3",
        "review_title": "There was an attempt.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "no-13420",
        "review_rating": "3",
        "review_title": "It's an obvious B movie from the get go.",
        "review_detailed_main": "It is sci-fi. It is called \"Jiu-Jitsu\". It stars Nicholas Cage.\n\nIt is bad, yet entertaining because I knew what I was in for. With expectations set, this met expectations."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "juanmuscle",
        "review_rating": "10",
        "review_title": "I think the idea is fantastic! Just needs a little some some...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "PaxD75",
        "review_rating": "7",
        "review_title": "Better than John Wick in every way, worse than Predator.",
        "review_detailed_main": "That's right. I said it. It's got a better plot, much better acting and much, much better fight scenes than John Wick.\n\nJiu Jitsu is the poor man's version of Predator. It is 'Predator' without the Charisma - except for every single Nick Cage scene. Nick Cage makes this film good.\n\nI'd rate 'Jui Jitsu' a 7. The Nick Cage scenes are each a masterpiece in storytelling and in contrast to the brainless, boring, plotless contrivance that are John Wick films (except for that first one which was a passable viewing).\n\nYou make Nick Cage the new John Wick... and that will be a movie I want to see. PS: filled my minimum character quota. Also... not a fan of the John Wick films."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mike-c-b",
        "review_rating": "2",
        "review_title": "Where being 'generic' is worse than being amateurish",
        "review_detailed_main": "The other reviewers are more/less right but don't technically explain anything.\n\nThe main character is hero worshipped by force (camera angle and slow motion scenes). Fight scenes show agility but nothing special and relies too much on supporting actors waiting for their turn. You have no idea why you're invested in the main character at all. They show no heart & soul - just acting tough/pretty. All talk scenes are generic bickering.\n\nFor an example of an amateurish production done right look at Mortal Kombat Conquest (series) from the 1990's. Four-five trained main actors, with everyone else being porn-star hires (big muscles & breasts). Camera angles shot from mid-far range and stayed there during fight scenes. Story. Relationships mattered (not generic bickering to fill time).. poor interactions had consequences. No music/SFX trying to force your emotions."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "itsmayakh",
        "review_rating": "3",
        "review_title": "Its so bad!",
        "review_detailed_main": "I though this movie would be good because of it came out 2020 where the standard is high and some of the actors in this movie is A list actors so for it to be so bad its very shocking. The story was horrible. I did not give any sense. Like it was confusing and it was not well written. The story have a lot of holes. The filming was not good either. They tried too much. Not everyone can pull of a unique filming. The music was also horrible. It´s actually embarrassing for it to be so bad."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "charlesyoung-56855",
        "review_rating": "1",
        "review_title": "As bad as the pizza I ordered tonight - conspiracy?",
        "review_detailed_main": "This is the worst movie I've ever seen. Literally. Not literally in the figurative sense like people use it nowadays but literally in the dictionary sense that I have never seen a movie this bad. I only finished it because it was easier than arguing with my kid who's innocence I've irreparably done damage to with such drivel. I am having more fun reading the reviews and writing this than watching it. It was as bad the Domino's pizza I ordered which looked like it came out of the laundry machines spin cycle - and was somehow still cold... I think theres a conspiracy here to ruin my Friday movie night with daughter.\n\nLiterally, again - literally - for real, the best part of this movie for me was the ending credits because I knew the torture was finally coming to an end. I could throw out the pizza, put my kid to bed and pretend today never happened. I cheered loudly when it was over. My daughter was only sad because she wanted to stay up. She enjoyed reading my review more than this movie. We are both dumber for our efforts."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dgmsimoes",
        "review_rating": "2",
        "review_title": "Just too bad...",
        "review_detailed_main": "Bad storyline Bad choreography Bad FX Bad acting\n\nAfter reading this watch it at your own risk. You can also watch it in \"fast forward\" mode to save you some time.\n\nI was astonished when I saw it is quite a recent movie. How is it possible too so bad nowadays?!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dasa108",
        "review_rating": "2",
        "review_title": "Waste of time, fiasco.",
        "review_detailed_main": "This film is a monument to pretension on the part of a director who suspects without any basis in reality that his style and cinematography will make history. Various directors in the past have done great things with a small budget (films like Upgrade or Razorback are examples) but this film is a hopeless fiasco. With a wasted cast, with unattractive martial choreography, with a villain who is a Predator clone and with supporting actors who contribute nothing (Cage is implausible in his role) we can conclude that it is an impossible film. If it were not for the fact that there was a trial over a tax refund issue in Cyprus we could say that this box office failure could have a second part, which evidently we do not need or want. It is bad, very bad. A piece of advice for the protagonist: Dear Alan, work for a year or two in Hong Kong or Thailand. Make films with prominent action directors and you will see that your role in the field will change. Your welcome."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Floated2",
        "review_rating": "1",
        "review_title": "Failure on many levels",
        "review_detailed_main": "Having recently watched several older Nicolas Cage films of a different variety, and seeing as he was top billed and front on the poster. Expected him to be the lead but his role is very much supporting.\n\nAs a film, this feels quite amateurish from the acting to the characters to the story. It reminded of a discount Mortal Kombat in terms of fighting to the stage sets, designs, attire and locations. The lead character is entirely bland and we generally don't care about his journey.\n\nThe martial arts fight scenes simply feel very video game based where there are a lot but it loses it charm. Expected something entertaining to a degree but this was simply boring and its runtime is about 20 minutes longer than it should have been."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Christ-ian",
        "review_rating": "3",
        "review_title": "One actor movie",
        "review_detailed_main": "Watching this most of the time I had no idea what was happening. Of course the story is not something you watch this kind of movies for but the plot seemed very incoherent. Pretty much the only decent thing in this movie besides Nick was the camera work. I felt that most actors were just saying their lines and only Nicolas was actually acting, without his presence I think the movie would deserve no more than 1 out of 10 stars. If he was given more screen time the movie might have just been worth four stars.\n\nAll in all, the movie is garbage but I am a hardcore Nicolas Cage fan so I couldn't just skip watching it after noticing it on a streaming service."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "oliver-99687",
        "review_rating": "2",
        "review_title": "What A shame",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mozzamorris",
        "review_rating": "10",
        "review_title": "Haters gonna hate...",
        "review_detailed_main": "I for one enjoyed this film. I don't know why people have to moan and rant about it, if you don't like the film after the first half hour or so, watch something else you get me!? I love martial arts films!!! Cannot wait for the next Kickboxing and a possible Jiu Jitsu sequel."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "T-Schlos",
        "review_rating": "7",
        "review_title": "I liked it!",
        "review_detailed_main": "If you like fantasy movies, then this movie is for sure something for you. Of course everything is over the top, but then again it is a comic book story!!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "fbaxel",
        "review_rating": "1",
        "review_title": "DON'T SPEND TIME ,IS RLY BAD",
        "review_detailed_main": "I thought it just had some bad reviewers, but I was wrong, the movie is really bad, desearv that score For the beginning we have the dialogue that doesn't seem credible, the actors played badly between John D Hickman and Eddie Steples, along the way Eddie Steples seems to play a bit better but sometimes he still doesn't seem too credible in what he says, the same thing can be said about the actor in main role Alain Moussi who is not very credible in what he says Furthermore, we have some very weak effects at the beginning, some that meteorite, exploding bombs, some lightning that seems as if those effects are from the 80s, you can't film from the 2020s with such effects, gradually the effects improve About halfway through the movie, while one is fighting with Brax, 2 others appear to help him, I mean wtf how did those 2 know that the respective one needed help The script is bad and here I am referring especially to the writing, the actors' texts, and even the story (They don't really make sense) Even if you had good actors like Nicolas Cage, Tony Jaa, this did not save the film, it is a total disaster."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dndad-56330",
        "review_rating": "1",
        "review_title": "Cage and Jaa and STILL bad?",
        "review_detailed_main": "I tried everything I could to give this movie a chance. It's very slow and other than the two mentioned before everyone else has terrible acting. The writing is bad and the visuals are bad."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "travler17",
        "review_rating": "1",
        "review_title": "You don't say.",
        "review_detailed_main": "The costume designer needs to stay out of Hollywood. I've never seen a uniform that says Military Intelligence. So when the one girl said she was M. I. I thought to myself, yea... I can read."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "turkuaz-88197",
        "review_rating": "1",
        "review_title": "Remove from screen",
        "review_detailed_main": "Poorly made and the quality looks like they made it for the joke with a theatre lover pal remove this from the white screen Nicholas cage his keep. Ruining his career with these types of bizarre movies."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "bitnicat",
        "review_rating": "3",
        "review_title": "Lots of pointless action scenes",
        "review_detailed_main": "When you're forced to run Fast forward the action scenes just to find out what the hell you've been watching for half an hour, Be sure it's a bad script and not a good movie that you watching."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jewelch",
        "review_rating": "5",
        "review_title": "could be better",
        "review_detailed_main": "A bit more plot and a better villain would have been nice, though martial arts fans and followers of Nicholas Cage and Tony Jaa should have a pretty good time, All in all worth watching. James Welch Henderson Arkansas 3/16/2021"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "spaslebet",
        "review_rating": "1",
        "review_title": "This is the one.",
        "review_detailed_main": "Ever watched something so bad it makes you mad enough to create an account just to leave a bad review?\n\nThis is it ladies and gentlemen.\n\nThis. Is. It."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "melissaprado1",
        "review_rating": "9",
        "review_title": "I knew what I was getting myself into",
        "review_detailed_main": "This is a great entertaining movie if you enjoy martial arts, specifically South East Asian Arts films. Delivered on action and fight scenes, however, the extras could have used better training."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "nublingnoob",
        "review_rating": "6",
        "review_title": "cheesey and fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "checkshummgaming",
        "review_rating": "10",
        "review_title": "This movie is a master piece",
        "review_detailed_main": "People seem to forget the generational super star that is Nicholas Cage. If you are a fan of national treasure look no further as the ghost rider does it again. The innovative genius of first person POV fight scenes, the thrilling nature of the alien chase scenes and the suspenseful will they wont they of the asian and caucasian main characters left me on the edge of my seat. The only disappointment you will feel from this movie is the dread that you will never be able to experience for the first time again.\n\nI love you Nick keep it up."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Omikron777",
        "review_rating": "7",
        "review_title": "Jiu Jitsu...Nic Cage...Tony Jaa...? I Had Exceedingly High Expectations",
        "review_detailed_main": "Yes indeed! Jiu Jitsu, Nic Cage, Tony Jaa...this is just one film were talking about here! There are other words I could write or more actors I could name, etc., that pertain to this film, but the expectations are already through the roof! Or, at least, those three bits of information worked into one Cinematic equation, for me... I had exceedingly high expectations, as anyone who has regularly watched films over the last few decades would.\n\nFor the most part, I would say that Jiu Jitsu does deliver pretty effectively -- it is an absolute joy to watch; I don't think there are too many that are going to deny that!\n\nUnfortunately, & why I give it only a 7/10 -- Jiu Jitsu was just never going to meet my expectations; it is truly an attempt to make the impossible film, I think. At least for Human Beings anyway; I mean, who knows? With all this fantastic work that generative AI has been able to produce in just the last 6 months, maybe someday soon it will be able to merge Nic Cage & Tony Jaa into one Super-Actor & create scenes no one has ever conceived of before that somehow makes the impossible film become possible...(?)"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lokilfa",
        "review_rating": "8",
        "review_title": "YOU ARE ALL WRONG!",
        "review_detailed_main": "Bad movies are not all the same, shame on you cinephiles, voting down a near masterpiece. You do not get it? Let me badxplain it to you... easy with a comparison: take \"A wrinkle in time\", an Oprah vanity project infused with mountains of Disney cash, horrible acting paired with pretentious nonsense script and a \"woke\" director that is in way over her head. Journalists and sites artificially maintaining the vote high because of spineless conformism. THAT is a 3 or 4 out of 10, only because the technical departments did their job. The viewers pay full price and believe the hype and ultimately are the victim.\n\nNow, only now, let's have a look at JIU JITSU, the cash is bare minimum, camera is terrible, sound is barely decent, the acting is either desperate attempt to save face or straight horrible: the production is cutting so many corners that they end up with a sphere, the perfect solid. It's sooooo bad that it goes straight to the other side. This film is a monster, in the latin original sense: monstrum, itself derived from the verb moneo (\"to remind, warn, instruct, or foretell\"), and denotes anything \"strange or singular, contrary to the usual course of nature\". A marvel of nature, you cannot plan for this stuff: is the collective result of C-List actors desperate for cash and an improvised crew, improbable production standards and a weird 3rd rewrite of the script for a grand total of 7 (!) bucks ticket. That would be enough for a 6,5/7 but... it's got (Oscar winner) Nicolas Cage, the myth. It's a straight 8!!! (and if you stiff upper lips fake connoisseurs don't get it, rewatch some of your beloved pretentious crap and stick to that).\n\nPS It's not perfect because nobody died during production as far as we know."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "sinexia",
        "review_rating": "10",
        "review_title": "Some people like cheesy action!",
        "review_detailed_main": "I enjoyed it. Not the best anything, but very entertaining. Expected more Tony Jaa, but it was good. People who rated it negatively were judging off of what they thought it was gonna be. Not what it was. Will be awesome if Mystery Science Theater 3000 gets a hold of it. It's a movie for guys who like movies! 🍿"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lauratwst",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "Can't understand the rating. Marie Avgeropoulos played amazing."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Perrywinkle2324",
        "review_rating": "10",
        "review_title": "$25 Million Dollars well spent",
        "review_detailed_main": "Greatest movie ever made Nic Cage makes it 1000X better"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "elenaphysics",
        "review_rating": "8",
        "review_title": "A solid 8",
        "review_detailed_main": "The movie is about martial arts And there is an abundance of fighting scenes in it. It is not for people who do not like martial art movies. I loved watching all the fight scenes. They were intense. Now the plot is a bit absurd and not realistic BUT it compensates you with great martial art scenes and that is what I wanted to watch."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "CrazieJa",
        "review_rating": "8",
        "review_title": "Fun, silly, and full of action",
        "review_detailed_main": "As an martial art film fan, I love this movie. Jiu Jitsu definitely is a mindless, fun, silly, crazy film with great action scenes. My favorites are JuJu Chan and Tony Jaa's fights. Honestly, it's time for a female lead action film with JuJu. Only complaint, I wanted more of her and Tony in the film..."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "lambrechtsluca",
        "review_rating": "8",
        "review_title": "Realy funny and lots of jiu jitsu! CHECK IT OUT FOR YOUR SELF! Dont look at the revieuws.",
        "review_detailed_main": "It was a realy fun movie. During the fights you forget it is a b-quality movie. The budget was rather small but i absolutley love the fighting scenes. And there are lots of them.\n\nAnd for the People that say there is no jiu jitsu. In my family we have 3 jiu jitsu fighters. And there are so many parts that where real jiu jitsu moves.\n\nDo you like fighting movies? Watch this!\n\nDo you like to have a good evening? Watch this!\n\nIt is just fun! Dont expect it to be the best movie you ever seen? But it is fun. And you will laugh. Makes you watch the whole movie!\n\nOh and Cage is in the movie with some awsome call outs.\n\nGO WATCH IT! And see for your self."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "garylikos",
        "review_rating": "10",
        "review_title": "Loved it!",
        "review_detailed_main": "Get your popcorn ready, relax, and enjoy the kind of science fiction, action adventure, martial arts movie that audiences have been missing for so long. Jiu Jitsu delivers on the world class martial arts, off the wall story, special effects, and environmental design that has been missing from the genre for so long. Legendary martial artists like Tony Jaa and Alain Moussi join forces with the impossibly charismatic Nicolas Cage to bring the world of Jiu Jitsu to life, and its a world I hope we can return to in a sequel one day. The story grabs you tight from the first moments and doesn't let go until the very end, whipping you through an intricate world of action adventure excitement. Jiu Jitsu is good old fashioned moviegoing fun, and it will satisfy the wide eyed kid in all of us. Highly recommend."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "muliikapaul",
        "review_rating": "10",
        "review_title": "Fair i would say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "hello-17143",
        "review_rating": "8",
        "review_title": "Cult classic & Ambitious",
        "review_detailed_main": "Look, it's not a perfect movie exploring the depths of human emotion. What it is a good no-brainer action movie that can be enjoyed for its filmography, special effects, ambitious action scenes and small details.\n\nThe plot is an enjoyable mix of other cult classics with some added twists and turns.\n\nCage actually really suits the role, and some some of the tongue in cheek dialogue and easter eggs will sadly be lost on most viewers.\n\nI'm glad i rented this movie and appreciate it for it's details. I will be buying this movie at a later date to support the cast and crew.\n\nAppreciate it for what it is, 8/10"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "williamsmv",
        "review_rating": "10",
        "review_title": "Action SciFi gold",
        "review_detailed_main": "I almost didn't watch this due to ratings. However I love action SciFi supernatural cheesy movies i.e mortal Kombat 95. This was great! Not worth the 10 I gave but it hits a certain type of person in the right way. I love ainto the Badlands, Monster Hunter, etc for similar reasons. Don't overthink it just enjoy! I hate that so many SciFi movies also horror get such low ratings from online cry babies."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "kretzjay",
        "review_rating": "10",
        "review_title": "The Next Evolution in Film Making.",
        "review_detailed_main": "How could it be anything else? It juat had everything of the 'worst' kind in one film. That itself is a monumental feat in film making."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "blackdogtucker2011",
        "review_rating": "9",
        "review_title": "Good",
        "review_detailed_main": "This movie was good Nicolas cage and the rest of the cast did awesome, nothing but a good martial arts flick"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "tvdefrancesco",
        "review_rating": "8",
        "review_title": "I Honestly Didn't Hate It",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "ajpn-51100",
        "review_rating": "10",
        "review_title": "nice movie",
        "review_detailed_main": "Nice movie good movie please support movie maker in times of pandemic"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "Mr2Dub",
        "review_rating": "8",
        "review_title": "Pleasantly Surprised.",
        "review_detailed_main": "If you wanted Predator mixed with Ip Man, this is definitely going to be one you'll want to see. Nicolas Cage's performance itself is worth the watch considering he goes full Cage crazy in this film while still keeping you interested in the overall story. The camera work during the fight scenes are decent, no bad shaking. Acting was a very good surprise, this was a very well put together cast. All in all, I would definitely re-watch."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "nicklostov",
        "review_rating": "10",
        "review_title": "super fun",
        "review_detailed_main": "If you expect Jiu Jitsu lessons you will be very disappointed. If you want some deep lesson in life or understanding of a foreign culture, nope. If you want to see an aging Nicolas Cage and some fast paced, well choreographed fight scene, after fight scene in a mindless, disjointed story with some alien who is the bad guy, that originally brought Jiu Jitsu to the heroes, that have to get totally whooped by him, to death, every 6 years.... then you will NOT be disappointed."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "monikalukas",
        "review_rating": "10",
        "review_title": "Must see!",
        "review_detailed_main": "As a fan of both Nicolas Cage and Alain Moussi, I loved it. Original storytelling, diverse cast, beautiful scenery, and awesome fight scenes. If you want to see good kick evil's ass in a battle for our planet I recommend Jiu Jitsu."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dankraus-22453",
        "review_rating": "10",
        "review_title": "My review",
        "review_detailed_main": "I'm a huge fan of Martial Arts films. I've been doing Jiu Jitsu my entire life and I should say this movie is amazing. I enjoyed every single part of it. I am also a huge fan of Rigan Machado and I was so gladly surprised seeing him in this movie."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "jijikoley",
        "review_rating": "10",
        "review_title": "Super fun",
        "review_detailed_main": "Jiu Jitsu is a really good martial arts action movie I've seen in a long time, and having Nicolas Cage and Frank Grillo is icing on the cake. The film is essentially a knockoff of The Bourne Identity and Predator. The fight scenes are exceptionally well done, and even Cage gets in on some of the fight action. Jiu Jitsu is certainly worth checking out. Entertaining movie with great action sequences that martial arts movie fans will definitely love. Put on some popcorn and enjoy."
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "mileykraus",
        "review_rating": "10",
        "review_title": "Super fun",
        "review_detailed_main": "Fun to watch, amazing fight scenes. Nicolas Cage had some cool action scene. Alain Moussi keeps on getting better, this was truly his best all around movie up to day!"
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "dreaded209-1",
        "review_rating": "",
        "review_title": "The movie title that fails to deliver",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "karozasgiorgos",
        "review_rating": "",
        "review_title": "Wtf did I just watched",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9624766",
        "movie_name": "Jiu Jitsu",
        "movie_rating": "2.9",
        "review_username": "hwzjqgk",
        "review_rating": "",
        "review_title": "What a pile of dung!!!",
        "review_detailed_main": ""
    }
]