[
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ThironthoramDude",
        "review_rating": "7",
        "review_title": "Love and its many shades",
        "review_detailed_main": "Dhanush who had earlier wooed the South Indian audience with his acting skills, chose a script tailor made for him to launch himself into Bollywood. The movie, doesn't disappoint those who enjoyed the stories where love stands above everything else in life. To top it all, when you have ARR weaving his magic with some sublime music, the beauty of Banaras just comes alive in front of your eyes. The three main characters, all have their own shades of grey and more often than not they stem from Love. Sonam for once does justice to her role, she grew into her role as the movie progressed and gave a telling performance that she could reflect back with pride. Abhay was as flawless as ever, just easing through his role with nonchalant ease. It would only be fair if i end where I started - Dhanush simply stole the show with his intense portrayal of a person driven by love, a person who does the most stupid, brave and incomprehensible of things in the name of love. My Verdict: Expect a love story with a traditional characterization supported by some brilliant music and clean performances by the lead cast - you won't be disappointed."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "manikagarwal2",
        "review_rating": "7",
        "review_title": "movie with its heart in right place..... Outstanding effort.",
        "review_detailed_main": "simply marvelous.... especially from a movie where d hero has so very unorthodox looks for a Bollywood actor but,wait ...u will forget that as d story moves on beautifully crafted on screen by the \"tanu weds manu\"(another interesting flick)director n acted upon by same guy.. Dis movie belongs to him only( heard he was d youngest recipient of the national award for the best actor down south) ... Dhanush with his simplistic looks,so very expressive face n true act oozes life in his on screen character.. With his earthly charm,he truly has carved out a niche for himself.. The director has succeeded once again in portraying our U.P. in such beautiful colors,capturing the mood n by-lanes of the people of eastern U.P. with gr8 detail.. Complemented by the so very fresh n beautiful sonam who seems like is going to dethrone d ladies at the top!!! Look for the dhanush's friend,a kin in all weathers,his sis who truly adores the local lad and not to forget abhay... In all, the director has managed to bring out the potential in every actor and has given the viewer some meaningful work.. Worth mentioning are the dialogues too which will both make u both laugh and give something to think about,kudos man.... and the soulful tunes to laud the effort by d Mozart from chennai ... worth a 2nd watch, meaningful one sided love story.... Majestic.."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sapraakshat",
        "review_rating": "9",
        "review_title": "Romantic saga with desi flavor",
        "review_detailed_main": "Well, I will not start with telling about story as it will spoil the fun for the people who haven't seen the movie or will see in the future, but I can see it is already spoiled here.\n\n1> But I have to start with story which is extremely interwoven together. Now a days when people talk about first half and second half which doesn't matter according to me. Story has all the elements be it fun, romance, drama and it has a classic desi Indian touch with it because movie is based in varansi which gives it a flavor with its crispy language, people, ethnicity. Its pleasure to watch reality in the movie when all the movies releasing are masala shits.\n\n2> If music is given by A.R. Rahman there is no point talking about it. Mucic was flowing like butter.\n\n3> Performances are best like characters are meant for them. Dhanush is awesome in his performance. He is a delight to watch. The way he delivers his dialogues is super cool and his accent has a roughness and his south Indian accent doesn't interferes with his Hindi accent. Sonam looks sober and does her part with full conviction, Supporting cast especially Kundan's friend \"Murari\" is fun to watch.\n\n4> Dialogues has everything from catchphrases, roughness to desi gaaliyan of UP.\n\nOverall, it is a very good film after such a long time as we don't come across these days in bollywood :)"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "travelnitweet",
        "review_rating": "10",
        "review_title": "Dhanush all the way!",
        "review_detailed_main": "What can I say? I went to watch this movie after reading all the reviews online - Therefore with high expectations. Well, I was still blown over by the movie or should I say DHANUSH! Ranjhanaa is based on a topic that is so far reaching and yet is that much more realistic! Every scene is delicately handled and the emotional parts were so subtle.Everyone in the screen just melted away and got hazy when Dhanush was in it. He makes you laugh, cry, hate him, and sympathize with him at the same time. AR Rahman's music was divine and seamlessly blended with the storyline. Excellent performances by the whole cast - But Dhanush owns the movie! A definite must watch!!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ishpreetsingh-chadha",
        "review_rating": "10",
        "review_title": "Lovely movie",
        "review_detailed_main": "Lovely movie, it had a twist and a blend of action, drama, romance, a little bit fiction too. The movie is worth a watch. it displays the actuality of the people, their nature and all i loved the romantic part of the movie as well. it was fun, interesting and very very entertaining too. I seriously recommend it to be watched. it has a little bit abuses which aren't suitable for a child's attention. if you are looking for a movie to watch for fun, to cry, to feel love, experience pain,i am pretty astonished about \"Dhanush\" as this was his first movie in the Bollywood and he made his mark pretty high. People it must be watched at least once, and i am very sure about going to the cinemas to see it again Enjoy, It is not something either that will get you bored during the movie. The movie has brilliant direction, acting. For me its a 11/10"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "jhingalalahmm",
        "review_rating": "10",
        "review_title": "Well done Dhanush!",
        "review_detailed_main": "What is different about this movie? Dhanush. An ordinary looking actor from the Tamil Film Industry. And what has he done? He has very easily managed to carry the entire film on his two shoulders. Not an easy task, but he has done it. Reason? His immense talent and experience. Not once did I feel bored watching him act flawlessly. Sonam Kapoor is another surprise package of this movie. She has also acted very well. If she wants to be taken seriously as an actor, she must do roles with meat like the one in this movie. Abhay Deol has a guest appearance which he has performed well as expected. I was sceptical about this movie but was I surprised! I am glad I went and watched this movie in a theatre. Money well spent I must say. I wont give away anything about the story in my review. I'll just say, please go and watch the movie in a theatre. And last but not the least, I want to say, \"Well done Dhanush, Welcome to Hindi Film Industry!\"."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "jahanzebcity",
        "review_rating": "10",
        "review_title": "This movie belong to DHANUSH !!!",
        "review_detailed_main": "Trust me, This is the 1st time I am writing a review about any movie, I never bothered to write a review but after watching this movie I simply couldn't resist myself to appreciate the work done in this movie.\n\nI have to say, no matter how good the story is or the music is if the lead role did not perform his or her acting well then its not going to be a hit.\n\nThis movie has almost everything.. Music by Sir A.R Rehman which has got the divine power in itself. Good story and Brilliant acting, Specially by this Tamil guy \"DHANUSH\" what a great actor he is I must say.. The way he has delivered every dialogues is just mind blowing. His face expressions, his body language and his emotions at some parts of the movie is so real that it makes you feel touched.\n\nI would say, if you haven't watched this movie yet then you're missing out big time. This movie is worth a watch. specially if you like Romantic or drama movies then this is the one movie for you! I would rate this movie 10/10 and I mean it.. just cause of \"DHANUSH\""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "dbdipashri",
        "review_rating": "",
        "review_title": "A Distinctive Take On Love !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shafiullah-hameed",
        "review_rating": "7",
        "review_title": "When love makes you do things you never expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "prantickb",
        "review_rating": "9",
        "review_title": "Love -- With A Different View !!",
        "review_detailed_main": "Raanjhanaa, what can I say about the film!! As an avid film buff I have compel to write this bollywood movie review. It's an unique movie, so bollywood but so unique and refreshing! It is a definitive multi-layered story woven beautifully with a great but complex script.\n\nScript is complex, multi-layered but transparent to viewer. It starts from boy meets girl and narrates philosophy, dedication, progression of life with love. And how it turns to an unique love story that should not be missed.\n\nThe editing is very good at first half, but it should be more stringent in the second half. Cinematography is marvelous, Baranasi can be this beautiful? then you have to watch it.\n\nSongs and lyrics woven beautifully in the story. You can not side-line the songs and watch the movie; it is practically lyrical story. AR Rehman creates a blend of true Indian flavored music here.\n\nDialogues are also playing a crucial part in the film. From witty to cliché, from orthodox to unorthodox, it varies and triumphs.\n\nWhen you are seeing the acting of the film, Dhanush has really become Kundan. Dhanush never existed in this film, only Kundan has. That should sum up the acting depth infused in the film as Kundan. Welcome Dhanush to bollywood. Sonam is beautiful and well enacted the role. She is more compelling towards ending of the film.\n\nAnother advantage director uses in his film that is supporting actors. Special mention to Murari(Kundan's friend) and Bindiya. Both have the best one-liners of the film and their acting was just apt. Abhay Deol is also good.\n\nDirector Mr. Rai presents you a story with great attributes. Celebrate, cheers, empathizes and of course fall in love....with a bit of sacrifice.....Raanjhanaa !!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "dineshprakash",
        "review_rating": "7",
        "review_title": "Movie oscillates between immortal and practical love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "Shashiishere",
        "review_rating": "8",
        "review_title": "made my day",
        "review_detailed_main": "This is one of those rare breed of movies in Bollywood that dare to go beyond the commercial crowd pleasers. Fortunately we are seeing more of such kind each day. Having said that, this is a highly entertaining paisaa vasool venture with substance. Kudos to the writer and director who gave us the soulful Tanu weds Manu but this time he sets his mark higher.\n\nThe movie takes you on journey with Kundan who is brilliantly plated by Dhanush right from his school days in Banaras to his ultimate destiny. Its very hard not to feel for the guy and cheer him,laugh with him, feel with him and it definitely makes one nostalgic and teary eyed at the same time.\n\nThere are many amazing sequences in the film which are so realistic that you can really feel the main man crying,smiling,puking at various stages of the movie.His transformation from a school boy with a crush, through a youth with stubble and only one real goal in life, to an atonement seeking person is palpable.\n\nMind you though its made to be a love story it almost never gets into stereotypes or clichés and keeps us on the edge of the seat with its thrilling twists throughout the course.\n\nOf course the main character is aided by a wonderful support cast from his friend Murari who gets the best one-liners, his childhood girlfriend, Abhay deol who plays his role with ease and surprisingly Sonam Kapoor who has dared to do something different & succeeded.\n\nBut the movies greatest strength is Dhanush who can make you cheer for him even when he's slashing his wrist, or riding is love into the river when he realizes she in love with somebody else.\n\nOn the flip side his role as a political leader seems over stretched after the racy 1st half and some of the actions of the lead female towards the end are not understandable.\n\nAll in all if you want to watch desi realistic love story with raw human emotions and unpolished drama here's your chance. Don't miss it!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "postsenthil",
        "review_rating": "7",
        "review_title": "FLAWED .. YET, DEFINITELY WORTH A WATCH !",
        "review_detailed_main": "In Raanjhanaa, director Anand L Rai returns to familiar territory of unrequited love which he'd explored with some success in his previous movie Tanu weds Manu. As with that movie, this movie also set in the Hindu heartland, in this case, a vivid & colorful Benares. Here too, the hero played by Dhanush falls head over heels for the lady Sonam Kapoor.\n\nDhanush plays Kundan, a Tamil Brahmin born & brought up in Benares whose ancestors had moved to be priests in a local temple. As a boy, he comes upon Zoya, the daughter of an affluent Muslim professor and it is eternal love at first sight for him. After several years of persistent pursuit, nay stalking, umpteen slaps and a slashed wrist, Zoya finally relents and reciprocates only to find the age old cliche of differing religions being raised and her parents pack her off to study at Aligarh initially & therafter, at JNU. While at JNU, she falls in love with the idealist student leader Abhay Deol. However, Kundan remains obsessed with his love for her and awaits her return and when she returns, he is devastated to know that she has not only forgotten about him, but is also in love with someone else.\n\nThe first hour of the movie sails through smoothly with many a light moment set in the earthy & colorful milieu of Benares capturing the city in all its rustic charm. However, as soon as the movie moves out of the Benares to Delhi & beyond and tries to dabble in issues such as campus politics and hot social issues in news, the narrative feels contrived & comes unstuck.\n\nDespite its several flaws, the movie remains eminently watchable for its positives. For one, Rai has made this movie with lot of heart and national award winning actor Dhanush, making his Bollywood debut, has given a sparkling performance and has carried the movie through on his slender, yet very able shoulders. Sonam Kapoor looks good and has an elegant screen presence, but still has a some way to go in terms of performance especially in the more emotional scenes. The leads are ably supported by the stellar cameos by Mohammad Zeeshan Ayub as Kundan's best friend Murari and Swara Bhaskar as Bindiya, Kundan's childhood friend who eternally pines for him. The movie benefits to a great measure from A.R. Rahman's music which blends nicely with the proceedings and some splendid cinematography which captures the city of Benares in all its colourful glory."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shaikhirshad-41223",
        "review_rating": "5",
        "review_title": "Could've been better....",
        "review_detailed_main": "Dhanush is a brilliant actor no doubt and he has given all of it to this role but could've been more better if th casting could change. Story was average nothing new to add. Songs were amazing specially A. R. RAHMAN music was phenomenal. Supporting cast was too good to watch specially Zeeshan & Swara good to watch both of them. Sonam kapoor looks cute and she has done average acting not that bad.. All of it its one time watch with good music and a preferable story."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "iamrafee",
        "review_rating": "10",
        "review_title": "To love something or someone and destroyed by it completely (Fanaa) is the life's truer eminence, the movie pretty much ends with this concept .",
        "review_detailed_main": "At last done with Raanjhaana (2013)\u0085In the end it cannot be considered as typical bollywood cliché love story. Story writer's non-communal thought has been strongly reflected in this film. In past days race, religion was noted as major facts and were responsible for creating discrimination but as day passed thinking of human about race and religion may have changed but human race is still keeping this discrimination alive by creating some boundaries of educational qualification, status and financial stability, which is too tough to break, who knows nearly impossible even with extreme love and passion.\n\nThe interesting part of this film perhaps starts from the point where \"Shiba's\" incognito boy Kundan falls in love with zoya while she was praying. Kundan's character here noticeably resembles Ranjha's character in myth. Here Kundan is the son of Hindu scholar on the other hand zoya belongs from an educated, middle-class family. But as the movie tends towards conclusion, it is not the religion that stands as obstacle rather it is the intellectual difference between them that does. But in the end they overcome those obstacles with love. So here in the end it is love that makes a triumphant journey and smiles over the cloud of dismay. First part of this movie was shot in \"Banaras\" which tints viewer with the color of \"Holy\" and love and gives viewer a flavor of teen-age immature emotion. But the story of the first part was not only limited to masochistic love. A love that bloomed in Banaras has taken political turn into Delhi which gave this movie a new dimension. In the mean time we get acquainted with rising teen-age thought and filthy power politics. Director immaculately presented some current affairs of Delhi. Here, we must give director some credit that he has depicted so many issues but the taste of this film remained unharmed. No matter how much we try to run away from politics but we have to accept this ugly truth that this very politics somehow control our lives, this very truth is finely depicted here. Another interesting part of this movie is every character here is too much stubborn. Each and every person is crazy at their point and unwilling to compromise. They are ready to leave their race, religion, city even their standards for the sake of love. In this film character of Sonam Kapoor might seem offensive for a little while but this feeling will start to diminish as the movie proceeds. In the ending part of the movie Ananda tells Kundan \"There are two types of leader\" , one that find peace by abolishing the government and another do find peace by establishing it.\" In practical life second one is very rare. But one thing has been clarified that if we need to unify all labor class people, first we need to understand their emotion rather than Marx, Angles and so on. But becoming politically influenced suddenly which occurred to Kundan in this film was not at all realistic. Dhanush played tremendously in this film, and 100% fit for this character. A tremendous bollywood debut for Dhanush , no doubt. Avay Deol though seemed little bit aged but not bad as a political leader. He has shown greater promise within a very small margin of time. Though Sonam couldn't always keep rhythm with Dhanush and delivery of her dialogue often lackluster but comparing with her other films definitely she has made progress. Bindia and Murari both characters were splendid throughout the film. Another thing is praiseworthy about this movie that it produced some brilliant dialogues which are really heart touching. Music of A.R Rahman was brilliant as usual (one wouldn't dare to judge, neither would I). Music was very relevant to the city and characters and changes according to the scenes and character. Local music of Banaras has really touched the heart. And Irshad Kamil definitely deserves some credit for his brilliant lyrics. The song \"Tum Tak\" in the starting of the movie clearly and finely depicts the character of Dhanush. Depiction of songs and cinematography was also very distinctive and praiseworthy. To love something or someone and destroyed by it completely (Fanaa) is the life's truer eminence, the movie pretty much ends with this concept .\n\nReview By Faiad Iftikhar Rafee Dhaka,Bangladeh . fb.me/iamrafee"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "arix-143",
        "review_rating": "8",
        "review_title": "a great entertainer, with a hint of mystery",
        "review_detailed_main": "Raanjhanaa is easy viewing works thanks to Dhanush's powerful performance with Sonam kapoor & Mohammed Ayyub. A R Rahman's scores once again. The story is complicated yet transparent, one that you may be inclined to feel judgemental about but one that you'll see from different perspective.\n\nAfter the flavour blend in the Kanpur for Tanu Weds Manu, Rai extends his ambitious to introduce the majestic of Varanasi city in this movie with a great blend of love story and moreover, since the film revolves around locals, it doesn't make sense to capture the visuals like some wide-eyed tourist. But the playful hues of Holi and a generally colourful palette that defines the city of temples fills the frames for most part till the story shifts to misty winters in Delhi's Jawaharlal Nehru University campus. CLIMAXXX!!!! A must watch film this season. 4.5/5"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "AwaixJvd",
        "review_rating": "9",
        "review_title": "Tamil cinema is better than Mumbai cinema.Loved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "amar280788",
        "review_rating": "8",
        "review_title": "Love's Labour's Lost and Salvation of Kundan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rahasyaratna",
        "review_rating": "",
        "review_title": "How Politics can ruin a beautiful story\u0085.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "abhishek_chatterji",
        "review_rating": "8",
        "review_title": "A Beautifully Honest Love Story",
        "review_detailed_main": "I can't remember the last time I watched a Bollywood movie and couldn't find a loophole in the plot/storyline.\n\nPlot: A love-struck boy pursues a girl across the spectrum of time, only to find out that she loves someone else. His reactions and its repercussions follow.\n\nPros: 1. A well-written script with plenty of room for your senses to take control.\n\n2. Stellar acting by Dhanush, Abhay Deol is at his enigmatic best and even Sonam Kapoor manages to act gracefully.\n\n3. Myriad emotions and colors from the city of Banaras to add dimensions to this movie.\n\nCons: Still can't think of one.\n\nVerdict: Watch it and let your emotions flow. Recommended."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "bobbysing",
        "review_rating": "6",
        "review_title": "Perfect example of how a novel love story angle gets diluted in the overstuffed execution on screen.",
        "review_detailed_main": "After so many memorable films made in this particular genre, coming up with a new impressive angle in a love story is quite impossible as it seems in Hindi Cinema. But surprisingly RAANJHANAA makes that difficult breakthrough in its offered content and the film surely scores its main brownie points for this very reason alone, unarguably.\n\nIts basic storyline has many important twists and turns coming every half an hour which also might (partially) remind you of films such as MAGNIFICENT OBSESSION (1954), KINARA (1977) & TUM BIN (2001). The film starts impressively from the childhood and then enters the adolescence age quickly where the boy gets slapped repeatedly by the girl in a very weird manner. After a brief meeting revealing their identities, the religion factor of Hindu-Muslim comes in and then both get separated as the girl goes to another town for higher studies. Meanwhile an incident of the boy cutting his wrist is also there which the girl easily forgets as she returns back to the town after a few years. Now this whole premise of the boy's one sided love is both cute and interesting and Dhanush's innocent portrayal of his true to life character is another reason that this initial hour keeps you hooked on to the screen with all its love, drama and songs.\n\nBut actually, there are too many absurdities and unconvincing liberties in the script, which don't let you fall in love with their characters completely. To be precise, in a traditional city like Banaras, a young School Girl slapping a Romeo boy several times (right in the middle of the road), not causing any panic in the people around was quite unbelievable. Secondly as the boy and girl meet for the first time, a young girl of 9th standard (coming from a conservative Muslim family) straight away putting her hand in the boy's open shirt to find his \"Jenau\" was again highly absurd for me and strongly disgraceful too. Thirdly, it was really funny to see that the girl, returning to the town just after 3-4 years is simply not able to recognize the same boy who had slit his wrist only for her when she was in the 9th standard.\n\nThankfully, just when the boy-girl love angle starts becoming monotonous, comes Abhay Deol to save the film, but then he also falls in the same trap of absurdity in the next few scenes. Now the highly weird scenes featuring Abhay Deol includes the one wherein a sudden kiss on the cheek is given by the girl right in the middle of the campus (a girl who comes from a traditional Muslim family of Banaras). And why she kisses all of a sudden? That's because she strongly wishes to prove her point that all people are not equal on this earth and some are special. Next the girl's Muslim family members of Banaras who are very particular about the religion, make no investigation about the boy, ask nothing about his family background and have no questions to ask before announcing the marriage of their beautiful daughter to him in a hurry.\n\nHowever, this is where we have the major novel twist in the plot which also gets lost as the story moves further and the director misses to use the factor of guilt, love and emotion in it in the later part of his film. But wait the 'Memory Loss' absurdity re-surfaces once again here when Dhanush forgets to attend his own marriage after getting dressed for it in the tailor shop and so does his dear friend who was most interested in getting him married in order to get out of this silly love-mess.\n\nPost intermission, we have another shocking twist and then suddenly the love story takes a major, social political turn bringing in the 'Safdar Hashmi' element into its execution. Now we have our lead characters fighting for the common man, cleaning the roads and even contesting for the elections. In short, keeping the absurdities aside, it's the first half of the film which makes an impression but the second half pulls it down completely giving it a political angle unnecessarily. Too many unrelated subplots inserted post interval, dilute the overall impact of its fine love story and the viewer loses the interest once the film crosses its desired length.\n\nLooking from a brighter angle, cinematography plays a major role in making an impression capturing the local ambiance of the city beautifully and the dialogues make their presence felt in few enjoyable scenes. But the music (including the background score) turns out to be a quite less than expected from the maestro A. R. Rahman, except \"Aisey To Na Dekho\".\n\nPerformance wise, the film totally belongs to Dhanush, who makes a strong impact as an actor particularly in the second half. He wins over the viewer first with his innocence and later with his acting skill in the final hour of the film quite strongly. Sonam emotes well, yet I couldn't find anything new in her act honestly. Abhay Deol once again delivers what is required from him in a small special appearance. But why he accepted such kind of miniscule role remains a mystery. In reality, it's the supporting cast here which makes a more important contribution, wherein both Mohammed Zeeshan Ayyub and Swara Bhaskar are truly brilliant as Dhanush's childhood friends. Plus Kumud Mishra, Vipin Sharma and Sujata Kumar simply excel in their few but important scenes in the first half.\n\nIn all, focusing only on its core issue of a one sided love, its mistakes and the guilt factor, RAANJHANAA could have reached a different level altogether in this particular genre. But in its present avatar it just remains an above average love saga with a difference. And you can watch it once just for Dhanush's sincere act to say the actual truth."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rs-24335",
        "review_rating": "10",
        "review_title": "Just perfect!",
        "review_detailed_main": "Everything about this movie is just perfect! Music, characters, directors, set, actors everything! This is the kind of movie that comed once in a decade. Even Anand L Rai won't be able to make another movie like this. Dhanush is unbelievable."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Well-Acted & Well-Written Film!",
        "review_detailed_main": "Anand L. Rai's 'Raanjhanaa' is A Well-Acted & Well-Written Film! The biggest plus-point of the film is, that, it isn't clichéd nor predictable. Its interesting, entertaining & heart-warming. Certainly, A Winner!\n\n'Raanjhanaa' Synopsis: A boy falls in love with a girl & follows her in every step of her life.\n\n'Raanjhanaa' begins brilliantly. The protagonist, Kundan, played delightfully well by Dhanush, is a hero to root for, because his journey is full of surprises. The first-hour is humorous & has a certain tenderness to it. The second-hour, on the other-hand, is intense & a bit depressing. Himanshu Sharma's Screenplay is Well-Written & doesn't end up being clichéd, which is its biggest asset. Though, The Writing dips considerably in its intense second-hour, it never really bores. But yes, a better second-hour would've only enhanced the film's overall impact.\n\nAnand L. Rai's Direction is skilled. The filmmaker has handled the light as the as well as the intense moments, with dexterity. Cinematography captures the rustic look well. Editing is fair. Music by A.R Rahman is super, as always.\n\nPerformance-Wise: Dhanush is delightful as Kundan. He's an unlikely hero, but his performance from start to end, makes him an endearing & memorable hero. Sonam Kapoor plays her part effectively, although her dialogue delivery seems flat at times. Abhay Deol is flattering in a cameo. Mohammed Zeeshan Ayyub & Swara Bhaskar are mesmeric in strong supporting roles. They contribute enormously in the goings-on.\n\nOn the whole, 'Raanjhanaa' is a pleasant surprise, that entertains efficiently. Go For It!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "jaydeepdixit",
        "review_rating": "1",
        "review_title": "Doesn't make any sense",
        "review_detailed_main": "This movie makes no sense.... there few dialogues in this movie such as when he gives advice on how to impress girls was really bad.... it spreads negativity in today's generations.... Also the movie is overrated..."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "irfan_ahmad184",
        "review_rating": "10",
        "review_title": "A must watch",
        "review_detailed_main": "In a nut shell a fantastic display of performances needless to say from all present in the movie. Murari's character in particular is worth mentioning. Just mind blowing and above all the spontaneity and timing was magnificent. Dhanush, being south Indian, did justice to his role and Sonam, well she looked cute. During the 140 min run time, I felt at some point this connects to an extent, with the stories we heard, have seen and experienced. Especially the Banaras, Lucknow touch, it made me fell for the movie. I did remember the first of the firsts meeting during the Raanjhaana and yes music is awesome. Especially the title track and Tum tak... This was my first movie in a theater after the heartbreak (lol) but it turned out to be a memorable one."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "kamran9626",
        "review_rating": "9",
        "review_title": "One of the finest films i have ever seen",
        "review_detailed_main": "I don't really watch Indian movies because they are re-make (most of them) of Hollywood movies these days. But i would say it out loud that i watched Raanjhanaa and this movie is my most favorite movie so far from our neighbor country. I read a review about this movie on a website and it was one of its kind. The guy was blabbering about the unsound mind and immaturity of Dhanush in his whole review but we all loved Dhanush more than any other actor in this movie. I bet you can't expect a movie like this one in hundred more years from Bollywood..... My love for this movie can also be judged by the fact that i have written only one review so far. AR Rahman lovers will also enjoy the songs and music composition by this great music composer and singer."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "akshay_d_2006",
        "review_rating": "10",
        "review_title": "Loved it. Lived it. Enjoyed the end.",
        "review_detailed_main": "The movie starts in the end, and then takes you to a flashback, and comes again at the end. Since then there are about 20 minutes to the film and they are the best. Its not about the acting, the location, the climax fight. Its about the thought, and the dialog. Its about how one man's journey comes to a limbo. And when you come out of the movie, you feel sort of a limbo. I came out thrilled.\n\nDhanush has delivered an amazing performance. Though he falls out of the line in the current generation of the \"Macho\" Bollywood Hero, he depicts a very common man, his thinking, and his decisions. Sonam looks gorgeous, and gives an laudable performance. Abhay and Mohammad are spot-on too. A.R Rehman gives an outstanding feel.\n\nAlthough there are a couple of scenes, which you don't understand why are present. But - for me- that was OK.\n\nWatch it if you were in love. Watch it for the end."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "raghavendra-kr",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rakesh-719-47294",
        "review_rating": "",
        "review_title": "Good one. Great Job Sonam!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "vishal657",
        "review_rating": "7",
        "review_title": "Rare Delight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "Different shades of love... A breath taking film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "A Heartfelt Romantic Saga",
        "review_detailed_main": "Rating: 3.5/5 stars Reviewed by: Dare Devil Kid (DDK)\n\nA romantic film that's tragic yet adorable in the same vein, without trying hard to be either of the two. Now you've got to love that. The film does have its flaws and the director makes some factual and continuity errors in his narrative. But all of this can be forgiven when a story of this intense simplicity comes along, which splatters a smile across your face from the get go; tugs at your heart strings for a major part, and finally wrenches your heart out towards the end.\n\nIn actuality, the real contributors of \"Raanjhanaa\" are its beautiful script and Dhanush's effortlessly endearing portrayal. The National Award winning actor enacts his character as a quirky, innocent, dreamy, raw, and passionate simpleton all rolled into one in the most sublime manner. His effort certainly merits a nomination if not a win at most of the major award functions this year. This is one southern star to look forward to in Hindi cinema."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ba_dal9713",
        "review_rating": "9",
        "review_title": "It is a feeling. . . . . . .which came to me at the very end!",
        "review_detailed_main": "Spoilers! might be ahead\n\nI watched this film back when it was released in 2013. Well as a pro-movie buff I believe to think I am, I liked it, at the same time it became clear to me that this film is layered. So, it would be fun to watch it after a long pause.\n\nThat pause finally ended, tonight, and I am writing this review moments after I finished it.\n\nWell, I am quite exhausted. I don't want to consider the success of a passionate love story, or any story with passion at its heart, by the amount of joy or tears it brings to the spectator, rather I want to see what the story teller intended to say. And whether I, as an audience, am able to take it or appreciate it or not. Anand L Rai already proved his story telling weaving ability and made a sacred place for himself for his utterly unique style.\n\nSo yeah, I was not amazed that during this second viewing of mine, I was getting the things he wanted to tell. I got blown away with the presence of some moments, moments I believe he desperately wanted to tell. I shall give just one example of that. It is the last scene of the movie where from the background Kundan says his monologue, 'I could have got awake, but for whose sake?.....Who the hell gets awake. . . .the mood is just not right to wake up.....it's better to remain asleep'\n\nThis moment told me the drive the storyteller kept in him till the end of his movie making journey. It must have been an unimaginable bliss for a film maker to be able to express a thing to his audience who finally got it. Doesn't matter if in the second viewing, doesn't matter at all.\n\nI really don't know when's the next time a crazy guy like Anand L Rai would have an insane story like this to give Mr. A R Rahman, where he would compose things like. . .'don't give a stare like this, as if you've never seen me'....\n\nStill got it? It comes at the end!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "arnavgoswami",
        "review_rating": "6",
        "review_title": "worth a watch for Dhanush & rest of the cast",
        "review_detailed_main": "watched RAANJHANAA ...good Drama n Romance that lasts for 1st 25mins after that it turns into constant stalking n threatening (its entertaining though) ...the flick is full of stereotypes & their exaggeration(take JNU)..the story takes a bite of everything (like honour killing/religious radicals, politics n stuff) that's why its plot wobble a bit in the 2nd half...but all's well that ends well & it ends well(it has a brave ending_ n it feels)...the cast was good the lead was great(only Dhanush) n Sonam Kapoor was not annoying(in the 1st half)..u can see moments where Dhanush struggles with the language but it doesn't suck....overall its a good film n WORTH A WATCH"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sanjeevdevchowdhury-632-214414",
        "review_rating": "5",
        "review_title": "2nd Half Plot Spoiled the Platter!!!",
        "review_detailed_main": "The first half was really gripping with stupendous performance of Dhanush. Set on the backdrop of Hindu-Muslim backdrop at Varanasi, such romantic movie definitely needs good script, which was there...but to some extent. Although Varanasi was very well captured in the camera but the moment the movie moves to JNU at Delhi the entire movie changes. The storyline gets diverted from a very nice build up in the first half to stale \"bhrastachar - politics\" in the second half, which was not at all required in such kind of romantic movie with communal set-up. Director wanted to give everything on one platter i.e., Khichdi, Chicken, Sambhar, Makke di roti etc etc...and that is why the film lacks in totality. AR Rahman's music, as a whole, is just OK. But Dhanush was simply outstanding."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "somenu",
        "review_rating": "10",
        "review_title": "A good time pass movie !",
        "review_detailed_main": "The small town story put in a sensible manner... Till end you won't get bored which sums up the script / acting / direction...\n\nThe dialog & slang (used in day-to-day)life in India specially between close friends were very well used. Nothing vulgar about any scene.\n\nI loved it. Be it Kundan & Murari friendship or Kundan - Zoya one sided love affair.\n\nThe movie unfolds the different phases in a dramatized manner ! There are many laughable moments.\n\nSome scenes were very well shot. The songs also play an important part, none of the song is forced.\n\nThe different moods of the Hero (Kundan) when in love, when rejected by his lover, when he tries to sacrifice his love for the sake of his lovers happiness has been very well captured by the director !"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "Dhanush: Welcome to Bollywood!!",
        "review_detailed_main": "He banks as much on the unmistakable charm of his leading man to deliver a terrific first hour that breezes by with plenty comic moments and some genuinely heartfelt scenes.The script unfortunately goes off the rails in the film's second half, when the story shifts to the JNU campus in Delhi. If there's one reason Raanjhanaa doesn't entirely disappoint in spite of its problems, it's Dhanush, who offers an uninhibited performance that's hard to take your eyes off. For its immensely entertaining first half, a winning score by AR Rahman, but most of all for Dhanush, this is a film that's worth your time. I'm going with three out of five for Raanjhanaa. It's not perfect, but it'll do."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ahirjoy",
        "review_rating": "8",
        "review_title": "Wow!!",
        "review_detailed_main": "Just wow! It was my expression after the movie! It was a dream debut of Dhanush in Bollywood, and it was a majestic entry. Also it was a strong lesson for the people who judge people by their looks only and not by their talents. Many recent bollywood stars would would have considered them privileged if they would have been even half an actor as this young guy. The movie started with the backdrop of Benaras, a city which has its own mesmerizing charm. The simple humorous love story becomes complicated as the time progresses and you understand love and passion is not all about dancing around trees in the exotic foreign locations, it can be very very cruel, full of betrayal too. Sonam also has acted well, so are the side actors - in fact few great performances along with good storyline is the heart of the movie . A. R. Rehman's music was really good. so are few songs. This movie is an honest attempt to rediscover complicated human relationship, portrays our own Indian locations beautifully, experiments successfully with unusual casts, Go and Watch! 8/10 - VERY GOOD!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "bitukitu2000",
        "review_rating": "8",
        "review_title": "A goddamn epic love story with it's heart touching bliss of charm. :')",
        "review_detailed_main": "Even seen a movie that touches your heart, makes you cry and still tickles your funny bone hilariously? If no, then brace yourselves. This is one of the finest movies ever made in the history of Bollywood. It just moves your heart in every damn possible way. This movie defines love and it's various sides. The magnificent and brilliant role by Dhanush just can't be done any better. I was left speechless after watching movie, I just had no words to describe how excellent and great the movie is. The comedy and sense of humour in this movie has been executed in such a tickling way that it was totally flawless. The soothing and breath taking background music by AR Rahman was terrific. The goosebumps will still haunt your soul by just thinking about a particular scene. The extreme and marvelous acting will make you laugh, cry, and feel touched in every scene.The dialogues and the pace of direction was just incredibly and ultimately touching. The ending just left me speechless to my very own. It's a beautiful and refreshingly brilliant movie. It's a total must movie for everyone. Don't even think about it, just go for it. Totally worth the money.\n\nMy Rating - 9/10"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sashank_kini-1",
        "review_rating": "",
        "review_title": "Makes you want to thump your forehead with a sledgehammer. It's less painful to gouge out your eyes than to watch Dhanush and Sonam attempting to romance in Raanjhanaa.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ckaran80",
        "review_rating": "7",
        "review_title": "rarely decent love story...",
        "review_detailed_main": "Raanjhanaa is a love story set amidst holy city of benaras.To my surprise, the story was executed brilliantly...it has a new taste altogether.It has some comedy scenes, heart touching drama and an intelligent political transition in the second half.\n\nApart from only the love story, vital issues like Indian political system, typical Delhi youth and sadhu-sant based fraud have been touched lightly...\n\nWhat makes this film a decent one is Dhanush's acting. He's as good as perfect and leaves a huge impression...Can be considered as year's best so far in bollywood...Sonam Kapoor is average while Abhay Deol impresses in his cameo...The rest of the cast is good...\n\nWatch out for - Dhanush's superb performance, Exciting story and good climax."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ridi-arahan",
        "review_rating": "9",
        "review_title": "The fuel that drives love can sometime drives us far away",
        "review_detailed_main": "What worked:\nscreenplay; it's a brilliant story with phenomenal narrative. The movie is hard hitting, raw and the overall impact stays strong even on multiple viewing. The story is not far fetched, though glamorized sometimes, making it a love story and a difficult one if one has experienced an one sided deep love.\nmusic and background score; of course Rehman never fails to impress us. The music and score are both highly resonating with the mood and the narration. The music is an pivotal part of the movie and it's quiet impressive.\nWhat did not work:\nscreenplay; the run time could have been cut down by cutting down some of the scenes regarding politics. The movie somehow diverts from the main agenda of the movie for a while, then quickly gets back in track. If the movie had not diverted itself, it could have been an exceptional watch. It's a concern but not a complain. Those scenes are watchable.\nFinal verdict:highly recommended"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "vjrobs",
        "review_rating": "7",
        "review_title": "Watch it... for it's not a run of the mill love story!!",
        "review_detailed_main": "Performance wise, first half belongs to Kundan's side-kick Murari(Mohammad Zeeshan Ayyub) thanks to his cheeky bombshells while the second half is purely of our maverick, Kundan. He doesn't carry qualities of a regular Bollywood actor but shows what an actor is supposed to do. Just Act and act as your character. He emulates three different roles in the movie starting from innocence personified school kid to a matured lover and finally to an emotionally suppressed guilty friend.\n\nApart from the actors, two other important aspects which work well for the movie are its picturesque setting of Banaras and soulful rendition of Rahman in first half. They both have their own story to tell which gels well with the movie.\n\nRead full review at www.vjmoviews.com"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "raoamit03",
        "review_rating": "9",
        "review_title": "Complete package",
        "review_detailed_main": "This movie includes drama, emotions, good storyline and very well written dialogues. I am surprised to figure out that the promotional efforts of this movie were really bad. Despite of this fact, it came out to be an entertaining movie and people are now talking about this movie. Dhanush has acted really well, initially I was skeptical about him but he has done really good job playing a Banarsi guy. Sonam Kapoor also justified her role in all senses.\n\nI was pretty impressed by side actors performances as well. Both Swara Bhaskar (I am a fan of hers) and Mohammed Zeeshan Ayyub have added to the success of the movie.\n\nIn short, it was time well spent watching it and I totally recommend this movie. Happy to see that Bollywood still comes up with different movies which have good story, acting and screenplay.. and in the end they are entertaining too."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "buntyonline",
        "review_rating": "6",
        "review_title": "Dhanush stuns in his debut!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "nicedude_abad",
        "review_rating": "1",
        "review_title": "Seriously! 8.1 out of 10 for this...",
        "review_detailed_main": "It is not often I go watching Hindi movies on the recommendation of some FB users and I did it this time. My expectations were as such low but the film brought it to abyss. While the story is hailed as a love story (poor Hindu boy - rich Muslim girl), the plot and the overall story line hardly holds. There are so many cultural inconsistencies (well! what are expecting from a Bollywood movie, but come on!).\n\nFirstly, we have this boy who has this fascination with this Muslim girl and he stalks her. Well, I don't know if the directors have heard of '1000 Indian brother' issue. You follow a girl and the girl complains and suddenly you have 1000 brothers of that girl appearing from nowhere who will beat you to... Ahh well! to a Bollywood hero nothing of such things happen, do they?\n\nSecondly, the boy stops the girl wherever he wishes and does mostly unacceptable gestures throughout. You have cases wherein a foreign couple kissing in public gets USD 500 fine and face nearly six months in jail and here you have our hero going through it all without any consequences. Rather, the girl seem to enjoy them in retrospect. Pheww!\n\nThirdly, the boy actually does some minion tasks for the rich family (to stay close to the girl). In a society where hierarchies and caste systems are so prevalent (and that too cross-religious ones), the poor boy convinces the rich girl's dad to get her to be married to the other bloke. Ohh yea! Ask any Indian if they will ever listen to someone who is so low in the hierarchy for any opinion on anything at all.\n\nFourthly, the boy due to certain interesting 'Jugaad' (settings) gets to become the head of this political party. That was like not just laughable but overall crap-de-la-crap. Anyone involved even remotely would know how does it work and what kind of financial muscle is required for operating and leading a political party (even an upcoming one) and being a contender for a seat, who are kidding here?\n\nOverall, else than some lovely music which flows through and some interesting dialogues (many not watch-able with family), it is just plain rubbish!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ahwaan_padhee",
        "review_rating": "8",
        "review_title": "Raanjhanaa : Deep and Deadly Romance",
        "review_detailed_main": "Boy follows the girl relentlessly, almost stalks her, gets hysterical to the extent that he slits his wrist when his feelings are not reciprocated.Spurned and slapped for numerous times, he doesn't give up on his pursuit of love.With a lot of instilled poignancy, director Aanand L Rai brings out the complexity of love in all its colors in the vibrant town of Banaras.\n\nSouth heart-throb Dhanush plays Kundan,a Tam-Bram settled in Banaras who falls in love at first sight with Zoya(Sonam Kapoor),a Muslim girl from an orthodox family.She is his childhood fantasy, but love seems hopeless in the background of the communal divide and when her parents get to know of this Hindu obsessed lover,she is sent to another town to pursue further studies.Kundan is excited to see her return after 8 years, but his happiness is short-lived when he learns that she is deeply smitten by Akram(Abhay Deol in a pleasing special appearance), his senior with towering principles and political ideologies.How the love triangle ebbs and flows forms the crux of Raanjhana.\n\nThe initial reels arrest you with the invigorated proceedings, thanks to Himanshu Sharma's top-notch writing.With an eye for every detail, it encapsulates the Bollywood-bred youth,the stalking syndrome,the rich and playful hues of Holi and the vistas of the semi-urban Banaras.Kundan's chaddi-buddy Murari ( Mohd Zeeshad Ayub in terrific form) and foul- mouthed Bindiya(Swara Bhaskar exuding impeccable confidence), who pines for our hero unconditionally form the essential peripheral ingredients when Aanand exploits the verve of the place.\n\nThe second half is intense with the focus shifting to the vivid youth politics in the JNU milieu.Kindan and Zoya share a peculiar chemistry and thats where the realism peeps out with its ugly head.What follows is a tale of betrayal, redemption and ultimately a shocking climax.AR Rahman's background score and music form the spine of the unconventional romantic saga.Raanjhana has a smooth cinematic texture and dialogues have a raw appeal.\n\nRaanjana is embellished with gutsy performances.Dhanush is immensely talented.Despite his wobbly Hindi accent, he delivers a nuanced act.His diction reminded me of Rajanikanth during his hay days.The earnestness with which his Kundan follows Zoya, makes you believe in his sheer love for her.Sonam Kapoor sheds her fashionista image this time and gets into the skin of the character.She displays the myriad traits, from giggly to grey , with raging intensity.Much of the film's supporting cast has been taken from the Asmita Theather group and they bore an imposing look!Sujatha Kumar(last seen in English Vinglish as Sridevi's sister) makes an impact with her cameo as the Delhi CM.It was ,however,disheartening to see a talented actor like Vipin Sharma(Ishaan's Dad in Taare Zameen Par)without any dialogues.\n\nRaanjhana is arguably the best love story of this year, its not a hunky- dory piece,makes you feel squirmish as it sticks to some deep-rooted realities and regales us with its inherent Indian touches.Do make your time for this!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "kanwar700",
        "review_rating": "10",
        "review_title": "it's time for the fever of ranjhnaa",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ravisuman2008",
        "review_rating": "8",
        "review_title": "Sonam Shines!",
        "review_detailed_main": "This goes without saying as this is one of the finest movie this year. Sonam Kapoor has stepped down from being a debonair to one of the aficionado in acting.She has greatly improved in acting and her acting career seems to get a lot of hope from this. Dhanush seems to have given his best and his accent never proved a barrier for him. Dhanush's friend Murari plays the role of a typical guy from UP and never fails to amaze the audience with his humor and wit even at the serious scenes.The Writer has given sufficient time for the development of each of the characters plot and the actors have executed them well with a good performance. Music By A.R Rahman never fails to soothe your ear-Overall a great entertainer with a taste of present political masala.A must watch for those to whom abuses are not the thing that worries them."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shashankgarg245",
        "review_rating": "10",
        "review_title": "Finally a breath of fresh air!!!",
        "review_detailed_main": "Like everyone else I was apprehensive about watching this one mainly for the lack of powerful star cast but after hearing many positive reviews I went to see the movie and I'm glad I did. I gave it a 10/10 because firstly it does what hardly any other bollywood film has done lately i.e. present real,flawed characters with whom you can connect and empathize. While most of the other films have heroes who can make 20 bodies fly in the air with their slightest of touches, this film has a more genuine hero. A common man who looks like sh*t and is madly in love with a girl for 10 years. The main USP of the film is its dialogues. The dialogues of Murari (dhanush's friend) will make you jump from your seat and fill the theater with whistles and claps. The first part of the movie is a warm story of persistence and love and is full of vigor and energy. Dhanush plays the role easily with charm and flair. The second part of the movie is about a man searching for redemption and may not be as funny or vigorous but is still heart warming and intense. So watch it for the excellent performances by the actors, for the best dialogues that u'll ever hear in a Hindi movie and for the refreshing and original story that is hardly portrayed by bollywood"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "pawar-ketan05",
        "review_rating": "",
        "review_title": "Raanjhanaa: Love is Colorful !!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "preetsdhakappa",
        "review_rating": "7",
        "review_title": "Realistic Perception",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shahbaztariqkhanswati",
        "review_rating": "10",
        "review_title": "Raanjhanaa a Materpiece in its own right",
        "review_detailed_main": "we watch love stories to feel love and life. Love stories excite us some give us happiness and some make us realize the power of love which we all do not know. And then comes Raanjhanaa which comes out of the blue and touches skyline of love stories and makes us realize what is actually true love it makes us realize that true love is in fear , anger , self satisfaction . jealousy . revenge and all those things that make us humans it makes us realize that true love is human and it has human ways. I never understood love stories before but after Raanjhanaa i feel like now i am ready to watch other Indian love stories. The director Anand l rai is future of Hindi romance and if he makes one more Raanjhanaa he will be face of Romance. Raanjhanaa connects with all. Kai po che has a ultimate competition with Raanjhanaa now in award season and if Raanjanaa does not win best picture award then there will be strike in India because if it was made in English then It would have won Oscar hands down. Now in last line i am giving Raanjhanaa a huge honor by declaring it one of my favorite films after Batman Trilogy 3 idiots and Swades and if a director makes a sequel of it then it would surely number two on this list and Shahrukh Khan after ruling 2 3 decades the face of Hindi and World romance beware your competition Dhanush is here"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "akshay-ak-kumar",
        "review_rating": "7",
        "review_title": "A near Shakespeare Tragedy",
        "review_detailed_main": "It is said that there are 4 famous Shakespeare tragedies....After watching Ranjhaana....I wondered if Shakespeare was alive and watched Ranjhaana, he would have definitely written the 5th.\n\nRanjhaana is a simple love story set in the holy town of Benares and ends on a tragic note in Delhi. They says 'Love is Blind'....the movie shows that love when blind has no boundaries and cannot differentiate between good and bad.\n\nThe movie starts off well, loses steam in the 2nd half but the ending is tragic but brilliant. The writing and dialogues is poetic and spices up the film.\n\nPerformances by the leads is outstanding especially Dhanush. Dhanush proves that language is not a barrier for any actor and excels in his Hindi debut. You feel his emotions . Sonam puts a good performance especially in the last 15 mins ans proves that she can act. Special mention to Mohammed Zeeshan Ayyub & Swara Bhaskar who play Dhanush's childhood friends.\n\nExcept for the half hour in the 2nd half where the movie meanders, its a excellent movie and a must watch !!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sandeepyad1984",
        "review_rating": "10",
        "review_title": "DHANUSH, DHANUSH & DHANUSH, Take a bow man",
        "review_detailed_main": "A very very good Hindi movie in a long time based on love and sacrifice, There is beautiful story followed by some brilliant acting.\n\nFirst go with the story it looks like a simple love story at the starting but had one or two unexpected twist which make this movie completely different from other Indian Movies.\n\nNow comes to acting, it is the first Hindi movie for Dhanush and he really did a great job it never appears that it is his first Hindi movie other characters also did good job, Sonam Kapoor was a pleasant surprise Ayyub Khan as Murari did equally good work.\n\nOverall this movie has fun, Love, anger and the unspeakable sacrifice. You will love this movie if u don't see yet then don't waste time go for it. You will definitely like it."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "mitrajtrath",
        "review_rating": "6",
        "review_title": "Dhanush Wins,Raanjhanaa Doesn't...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "smoky_circles",
        "review_rating": "1",
        "review_title": "Morally reprehensible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "koushikrishnan",
        "review_rating": "10",
        "review_title": "Raanjhanaa - DHANUSH + AR.RAHMAN equals Magic!",
        "review_detailed_main": "Raanjhanaa - Saw it in Thamizh titled as Ambikapathy (though it didn't seem like a dubbed movie at all). After going through a very entertaining first half, thought that it will be just end like every typical Indian romance story. But thanks to so much drama and twists in the second half, it indeed seemed 'Unconventional' yet heart-throbbing. An intense plot supported by great acting from the cast. Dhanush, no words to praise, proves he is one for Bollywood too. No one other than Dhanush could have done the role so fittingly well. Have never seen a Sonam Kapoor movie before, but she did her role so beautifully! And Thalaivar A.R. Rahman was it his very best again with such wonderful music. Typical family audience and commercial moviegoers won't love this movie.Cheers to the director for making a neat and exceptional movie without any irrelevant masala or usual Bollywood love scenes (if you know what I mean). 10/10!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sumitbhatt225",
        "review_rating": "9",
        "review_title": "Must Watch",
        "review_detailed_main": "It is a awesome movie with so much of suspense, comedy and romance ... combo of all this ... it is a must watch movie. it shows the true Indian picture and one should watch it , but apart from this it also contains abusive words which are not appropriate for minors... This is specially good for the ones who want everything from movie i.e suspense,romance,comedy.. etc. Dhanush acting is excellent, as for him it is quite difficult to speak Hindi but he done his job well and also sonam kapoor also shows her skill.. The dialogs have been penned down logically, they all sound convincing and thereby, end up making the scenes and the characters look impressionable. Anand L. Rai's direction is an added boon for the film, paired with the flawless storyline. Rai tactfully shifts the scenes that keep the viewers' attention intact till the end.Raanjhanaa has a fantastic first half. Watch it for Dhanush and Sonam's performances and some colorful one-liners and dialogs."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "nmelessboyz",
        "review_rating": "8",
        "review_title": "Worth to watch",
        "review_detailed_main": "All I know is to hate Zoya !!! Dramatic movie !!! True love does not deserved sometimes."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "dipsitea2006",
        "review_rating": "10",
        "review_title": "Ranjhaana- -Emotions Galore!!",
        "review_detailed_main": "I have never written a review for any movie but after watching Ranjhaana, i just could not control my self and felt compelled to tell the world about how extraordinary this movie is ..Guys , if you haven't watched this movie please do. Its a not a typical run off the mill romantic movie. This movie is about passion, about being stupid in love . Its about treating your girl like a queen, no matter what you get in return. Dhanush is simply mind-blowing and might I add , he is on way to becoming one of the biggest stars in Bollywood. His has played his character with aplomb . Sonam Kapoor is in the league of her own . She has a come a long way from the days of acting in crappy movies like Players. Ditto for every star cast in the movie. Music is good, though falling short of AR RAHMAN's standard."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "gyanranjan-rath",
        "review_rating": "",
        "review_title": "A truly romantic bollywood after a long time....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "amanand838",
        "review_rating": "7",
        "review_title": "Watch it for Dhanush,A R Rahman's Music,Dialogues and lastly Banaras.",
        "review_detailed_main": "There was a time in 1959 when Satyajit Ray showed us Banaras in the second installment of The Apu Trilogy,Aparajito.That Banaras was black and white and he had only shown us the temples.Back then he won our hearts despite these limitations.But here in 2013 Anand L Rai showed Banaras which is so colorful,apparently it makes you feel that Holi isn't far away.He showed the streets of Banaras so efficiently and enthusiastically which became the first highlight of the movie.\n\nRaanjhanaa is a cracker of a movie as it moves until the curse of second half comes into being.If so many movies have been the victim of this curse,why don't the theatre owners dumps the concept of giving intervals then?.These movies names should have been XYZ-good and XYZ-bad for each half.The same concept should also go fro Director's name for the two halves respectively.\n\nRaanjhanaa works in most of the parts acting,music and dialogs.The national award winning actor yet again proves that good looks and 8 packs don't make you a good actor,your hard work and talent does.Dhanush's so-simple-yet-elegant performance is pitch perfect for the character Kundan.The simplicity in his accent and his expressions in certain scenes adds a new dimension to the movie.He keeps the movie going but the character of Zoya(Sonam Kapoor) may not get digested by many of the audiences.Sometimes Zoya shows simple,want-to-love,knows her boundaries type of characteristics and sometimes Zoya is trying to be over smart,want everyone's attention on her.As you have read you certainly get to know that these characteristics cannot belong to the same character.People will get confused about what actually Zoya wants.Nevertheless Sonam has done a good job whatever she was given to do.Abhay Deol is good in his extended cameo and Zeeshan Ayyub is wonderful in his presence and exemplary with his one-liners.The dialogs by Himanshu Sharma is another highlight of the movie.\n\nThere was a time when everyone said after A R Rahman's Jab tak Hai Jaan,which to me wasn't that bad, that the music maestro has lost his touch.Here A R Rahman adds emotions to the movies characters and creates the world of love very efficiently.If it weren't for his music Raanjhanaa wouldn't have been half of what it is.Javed Ali is so classical in Tum Tak ,Shreya Ghoshal providing soul to Banarasiya, Raanjhanaa(title track) is very lovable and Tu Mun Shudi is really appealing.Overall the music is really soothing. Kudos to the maestro for his hard work.\n\nIf some more work had been done on the second half's script or adding some element to those politics portions in the script Raanjhanaa would have been a great movie.It just makes you feel dull whereas in the first half it is so much fun.\n\nWatch it for Dhanush,A R Rahman's Music,Dialogues and lastly Banaras."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "goswami_tapan",
        "review_rating": "9",
        "review_title": "Must watch..!!",
        "review_detailed_main": "I love both Kundan, little one n most obviously the older one. this movie has got all things that you want in a movie; romance, comedy, drama and much more. story-line is pretty much different from other \"ROMANCE MOVIES\" n it gives the movie Thumbs UP..!! You wont find it boring until the end, it keeps you awake all along. I must say Dhanush is a very good actor but he has a bit problem in Hindi, but it wont irritate u though. Mohammed Zeeshan Ayyub was really good in all of his movies, and he did well in this also. He is the best supporting actor you could find at this time. Sonam and Abhay deol did well too. So, Go for it, you definitely gonna love \"RaaNjhNaa\" !! :)"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rmishra-rakesh-mishra",
        "review_rating": "7",
        "review_title": "GOOD movie..& lovely performance by Dhanush ..but the background music is not good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "somu-oasis",
        "review_rating": "9",
        "review_title": "raanjhanaa #ambikapathy : A good love story briefed in better way.",
        "review_detailed_main": "#raanjhanaa #ambikapathy: A good love story briefed in better way. Road to BollyWood from KollyWood.\n\nAs we all knew about dhanush's performance and we get used to see his's so, that wouldn't make you to feel something special about it but whereas in bollywood it is a unique experience where they are dwelling with HI-FI style kinda movies.\n\nDhanush: Not a good looking guy, not fair, not having a physic body, linguistic problem. At the beginning many would guessing how could he live through where Macho-Men and handsomely looking men been ruling the bollywood and then now he made everyone to say, \"He is in sublime form\" for his splendid performance. Well done dhanush. you made us proud. then you can't even spot his lip-movement mistakes anywhere in the movie (except in one song, that too only two to three words)\n\n(My question is: When dhanush can go to Bollywood and speak Hindi so well then why can't most heroines come down south and speak Tamil well)\n\nSonam Kapoor: Yeah! she too contributed with what best in her.\n\nAR: Just a WOw! music\n\nDir aanand lai:This man deserves a colossal applause & kudos for believing in dhanush and have given superb love movie to bollywood after a long time.\n\nVerdict: Raanjhnaa is quite different from usual Bollywood romantic movies. Worth spending every single penny! The movie which watchable"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "boHEMiAN_T",
        "review_rating": "7",
        "review_title": "Story where Love stands all above with humor comedy",
        "review_detailed_main": "Added 2 movies Raanjhanaa﻿ in my watched List... Raanjhanaa was Good enough to see in paid mood, Movie if a bit long, 1st half with humorous Comedy in the Heart of Beautiful Banaras and 2nd Half was a different story, pity but comedy is continue and ends connecting with 1st half, Movies is all about Love dedication where love stands all above things even life, where Someone Can Die just for the happiness of beloved. Situation makes Kundan(Dhanush,) a Crazy Lover of Zoya(Sonam) from his first sight when he was not more than 10 yr old. Love expression was Crazy Like 90s style. Where a lover-boy doesn't know why does he love someone. Heer Ranjha kind of story in Banarash Style and a man always dies Coz of stupidity of girl.and don't forget previous movies where actress names were Zoya. Dhanush was very good and I didn't noticed that He looks like Brother of Riksawala good thing there were stories in between songs A.R Rehman music. 7.5/10 stars."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "prianka-guru",
        "review_rating": "5",
        "review_title": "I would not watch it again",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "lovishjain-79192",
        "review_rating": "10",
        "review_title": "A masterpiece movie way ahead of its time",
        "review_detailed_main": "I was left with no words when i saw this masterpiece in Theatre.\n\nStill can't get over the last lines of Kundan."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "NishantGoswami",
        "review_rating": "8",
        "review_title": "Worth all your money!",
        "review_detailed_main": "Okay, I don't write reviews for films over here, but could not resist to write for Raanjhanaa. It's an indulging film which weaves magic as it unfolds. Not that it is perfect, but surely a mesmerizing watch. What's good? Film sparkles in acting department and cinematography (and I don't need to write about the background score or music). Dhanush is fab as an unusual lover boy. Even Sonam Kapoor went out of her wooden frame to support the entire cast, which did a good job. A little bit of political drama could have been averted, but that is director's vision. It did not do much harm to the love story anyway but cut out on time. Watch it out for Benaras, witty dialog's, Dhanush and Rahman. Recommended for each age group. Enjoy the movie. And yes, to those, who hated it, that must be because it doesn't match your taste. Maybe you are a Sallu fan. :D"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "magadalwarmayur",
        "review_rating": "10",
        "review_title": "Daring",
        "review_detailed_main": "I don't know what but this movie is daring on filmmaker's part"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ajitdubey",
        "review_rating": "9",
        "review_title": "Exxxxcellent Movie",
        "review_detailed_main": "I avoided this movie when it released because I was a writing a screenplay and backdrop of my story was Varanasi too and people told me till now no one has shown Banaras as it has been portrayed in this movie. Yesterday I watched this movie on it's TV premiere and i was spellbound, for a single second I could not find any actor Kundan (Dhanush), Zoya (Sonam, Bindiya (Swara Bhaskar) and Murari (Mohammed Zeeshan Ayyub) they looked like typical Banarasi and they took this movie to another level. Story is always a base of any film and this film delivers, except few scenes in second half you cannot pinpoint on anything, screenplay, dialogues, acting, excellent. one-liner was highlight of this film and most of them you can find in the gallis of Banaras. If Dhanush ruled the first half as innocent lover, Sonam Kapoor was awesome in second half. overall I will count this movie as one of the finest work of Hindi Cinema. Hats off to it's Director Mr. Anand Rai, I give it 9 out of 10 for a complete film."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "iolahardy-719-499524",
        "review_rating": "",
        "review_title": "I did not like the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ketgup83",
        "review_rating": "7",
        "review_title": "Raanjhana is sparkling , elegant and colorful. Watch it for Dhanush",
        "review_detailed_main": "How far would you go to prove that you can do anything in the world for the love of your life ? Raanjhana showcases how a person lives and dies each day only to make someone happy for the rest of life.\n\nRaanjhana is a journey of free-spirited Kundan who searches for love in young and vibrant Zoya from holy and religious place of Banaras to political environment of Delhi University.\n\nFrom the director of Tanu Weds Manu , Anand Rai L goes one step further in Raanjhana and gives you a sensational film. The plot is a simple love story but it is the handling of subject with aplomb and sensational performance by Dhanush which makes the film watchable. The movie begins in flashback mode narrating the story from childhood and is fun to watch. It is Dhanush who keeps you glued to the screen with comic timings. The 2nd half drags a bit when the focus shifts to Delhi but is compensated by powerful climax. Hats off to Anand R. Lai for choosing South Superstar Dhanush in a very different role. The screenplay is like roller-coaster with highs and lows . Editing could have been better. Art direction is superb. Cinematography is excellent. Dialogues are witty. Dhanush is the show stealer with splendid performance. The actor is simply mind-blowing and should walk away with lot of acclodes. Sonam Kapoor lends good support to him along with Abhay Deol. Music by A.R.Rahman gels well with the film.\n\nOverall , Raanjhana is sparkling , elegant and colorful. Watch it for Dhanush and you will understand what I am trying to say. Excellent 3.5/5"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sa_a",
        "review_rating": "9",
        "review_title": "Awesome and you can watch it more than one time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "BubbleBollywood",
        "review_rating": "6",
        "review_title": "Amazing!",
        "review_detailed_main": "The casting director has done a great job of picking the ideal performing artists for every part whether it is Swara Bhaskara or Ayyub. The cinematography is amazing as it brings alive the temples of Benaras and the dusty backstreets. A R Rahman's heartfelt music adds life to the movie,his deep tracks like Tum Tak ,Tu Mun shudi,Piya Milenge are music to the ears. The dialogues are persuading and make the characters receptive. Anand L Rai's bearing and the storyline holds the watcher to his seat. The first half is fascinating than the second half. With everything taken into account, the movie ought to be seen for Dhanush and Sonam."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "janianmol",
        "review_rating": "10",
        "review_title": "Dhanush & a strong support cast shocks the audience with Awe Inspiring Raanjhanaa",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "gorgonite",
        "review_rating": "6",
        "review_title": "A Tale Of Two Halves",
        "review_detailed_main": "Raanjhanaa starts out very promising with a cool street kid falling for a pretty yuppie girl. The Kid is blind to the beautiful world he lives in and starts to become uncool in the pursuit of his infatuation. A Muslim and Hindu dilemma is then thrown into the ring. So far it sounds mediocre on paper, but actually the film manages to keep it all together well.\n\nNow we have the kid losing grip and trading his soul for a deluded dream. Big dollops of melodrama are heaped on now with some staged set-ups to show that the kid can actually run the state. Finally the pay-off heightens the film at the end.\n\nPros - Realistic flawed characters, Acting, Cinematography\n\nCons - Story\n\nOverall - Start and End was good"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "priyankasethy189",
        "review_rating": "2",
        "review_title": "Not worth your time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "yogeshsahir",
        "review_rating": "10",
        "review_title": "UNIQUE",
        "review_detailed_main": "Well done dhanush and Sonam, Anand direction is massive, Ar rahman music is awesome all songs are good. Must watch movie"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "vriyer",
        "review_rating": "9",
        "review_title": "Different and Superb",
        "review_detailed_main": "No doubt this film was very well made and thought out. As a south indian, watching Dhanush in a bollywood film was amazing and inspiring as he played his role in a manner that was stellar. The story is quite different from the usual bollywood love story angle and the orther aspects of the film with twists and turns made it enjoyable because it was so atypical. Sonam did a very good job especially considering her character being so emotionally deep. Sometimes she was annoying but perhaps that was the nature of her character in some ways so it wasn't a turn off. The music was fantastic as A.R. Rahman delivers yet again and overall it was a very well written script and acted movie!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shivamohri2012",
        "review_rating": "10",
        "review_title": "Come fall in love ... Banarasi style",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "but-then-perhaps",
        "review_rating": "8",
        "review_title": "A film which captures the soul of small town India and the naivety of youth",
        "review_detailed_main": "This film is a slow poison. It grows on you more and more with time and with every watch, as the nuances start seeping into you. Where the film succeeds most is in bringing out that throbbing, pulsating, vibrant, poignant feel of a small town India, that naivety of youth, that hotheadedness of our college days. It brings out that belief we all had in our first youth- that we can fight corruption and make the world a better place to live in. That we can win our heart's love. As we grow older, our optimism decreases and so does our faith in humanity. But that doesn't make our youthful silliness any less true. It is a tale of those days of our life when we first get to know \"ki saala dil na left mein hota hai na right mein-centre mein hota hai\"because that is where it pains. The tale unfolds a young Kundan's infatuation with Zoya. A girl from a different station in life. She is flighty and lives in the moment. She is aware of her charms and uses them throughout to get her end. What she doesn't realize is she's playing with fire when treating emotions so irresponsibly. Dhanush, as Kundan, surpasses all expectations. He plays a 16 year old as convincingly as a 25 year old. His naivety, his growing up, his pain, his passions show so clearly on his face that you remain awestruck. He is one of the strongest actors around. Sonam does a commendable performance as the flighty Zoya, but fails miserably in the second half as a politically conscious student. Murari and Bindya are gems as supporting actors. The music by ARR is haunting and you'll find yourself humming to most of them. The editing in the second half is the only downer in the movie. The cinematography will make you long for going to Benaras. It is magic.\n\nOverall, it is a tale that will bring you closer to your youthful fantasies and pain and that India which throbs and pulsates with soul."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "kunalkhandwala",
        "review_rating": "7",
        "review_title": "A painstaking pursuit of love",
        "review_detailed_main": "In the hinterlands of the country, Love is still unabashed, heartfelt and mostly tends to begin as one-sided. As the boy devotes himself to the girl at first sight, his life centers around the charming crush that wouldn't last much longer because either the family or politics would intervene. Yet, in the colorful and vivacious town of Benaras unfolds one such childhood crush that grows into a painstaking pursuit of love. National award winner, Dhanush, plays the innocent and impulsive Kundan while Sonam Kapoor, in one of her most impressive performances is Zoya. Director Aanand Raj ('Tanu weds Manu') infuses a small town love story with several twists and a political angle to raise the stakes of lovers and haters alike.\n\nKundan's persistent, at times wacky approach to woo Zoya leads to multiple slaps but eventually, the fondness grows while they are barely in high school. But of course, this wasn't acceptable by Zoya's parents and she is thus sent out of the city to study, leaving Kundan and his promises of timeless love. Upon her return to Benaras years later, she takes a while to recognize Kundan, who is now a handyman at her family home. Kundan's love for her is still only his to keep and not to share as Zoya found her soulmate in Akram/Jasjeet (Abhay Deol). As an idealist leader in the J.N. University, Abhay Deol's convincing portrayal is briefly interrupted by Kundan's foolhardy decision. Dejected and rejected, Kundan finds no solace for himself until he indirectly gets involved in Jasjeet's political movement which is now spearheaded by Zoya. Kundan's pure intentions, upfront attitude and outspoken confidence garner faith from his comrades but not from the one he yet loves. Through a series of twists in the story, writer Himanshu Sharma challenges Kundan's dedicated love and Raanjhanaa is a tale of its triumph.\n\nWith his pure intentions, unabashed dialogues and simpleton charm, Kundan makes us take his side in the story even though the writer and director frequently challenge his impulsive and immature decisions. The credit has to go to the National award winner Dhanush, who is a departure from the heroes of Bollywood. Yet there is some innocence and sincerity in him that is undeniable. Take his dancing as an example. No Hindi film actor would dance vigorously but that is precisely Dhanush's unique charm that works in this film. Even though his dialogues might come out unabashed, he is effective in standing his ground with his delivery. Dhanush joins the ranks of Mahadevan and Siddharth among a few others who leave a great impression for their Hindi film debut. Sonam Kapoor has a stronger character compared to her previous roles. She does well in holding her own especially in the second half. While she looks beautiful as a small town girl in the song and dance of the first half, her versatility shows in the parts when she leads a group of rebellious young thinkers. Abhay Deol has a brief yet prominent role that changes the course of the one-sided love story. At times, we wish for his commanding character to have shades of his oldest brother but that might be too much to ask for. The rest of the supporting cast is fresh and their natural acting does lend to the film's realistic feeling.\n\nA.R.Rahman's music isn't the finest he has produced. Tum tak sounds like it wasn't composed for a Hindi film while tu man shudi is an excellent merging of two very talented artists, Rahman himself and Rabbi Shergill. Raanjhanaa might remain the most memorable track through with its melody and image of Dhanush's vivacious dancing. The rest of the music is almost forgettable and adds to the film's precious length.\n\nAanand Raj enriches this simple love story using plot twists as its main attraction. While exacting fine performances from the lead actors, he creates tragedy, sorrow, anger, joy and tenderness around love to revive the genre of soulful romantic movies. Raanjhanaa tends to be more real than a fairy tale, occasionally wavering to the extremes. Watch it for its twists, for Dhanush's sincere performance, laudable dialogues and for Sonam Kapoor's impressive portrayal of Zoya, for whom Kundan became a Raanjhanaa."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "maxon305",
        "review_rating": "9",
        "review_title": "The Most Incredible love story",
        "review_detailed_main": "First of all salute to Dhanush for a classic and awesome acting and performance, I always thought that a hero could be like Dhanush a simple boy of street and I am happy cause they chose him, with Sonam Kapoor a celestial bride they pair a perfect couple like a average guy of city and most angel face girl of town.\n\nLike the turn out of story, its different, I grow up watching the Bollywood movies romance and love usually it ends up with the couple union , but I felt so sad after watching this that the girl betrayed him for her dead love and he accept death for his love, my nomination for Dhanush for best actor and Raanjhanaa for best film.\n\nI didn't know the director and but I believe that he made a Masterpiece hope I could find a love like this, of course I don't wanna die.\n\nand in the end for legendary music composer Mr. A.R Rahman, the soul of the music, his made music rocks the movie and loving and heart breaking moments.\n\nIt is a must watch movie for every loving soul living on this planet. thank you"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ammar-hussain95",
        "review_rating": "6",
        "review_title": "1st half rocks you away but the second makes you hate it..",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "santanueco",
        "review_rating": "9",
        "review_title": "One of the best from Bollywood!",
        "review_detailed_main": "Story! Yep, that's the key to success of this film. Impeccable acting by lead and supporting actors. Especially Dhanush, OMG! He is a gem. Never thought that he has this kind of acting range. Highly recommended!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "a beautiful romantic cum political drama.....",
        "review_detailed_main": "'Raanjhana\" is a blend of several themes like childhood love, family drama, and politics, which churns into an entertaining watch throughout. The film is remarkable for the good performances, music, and the excitement the story perpetuates. The first half is bit slow where the film takes you to Lucknow where blossoms a childhood romance and second half enters into the political upheavals of Delhi. Both the stories succeeds to grip you with the beauty the film has with good performances from Dhanus, Sonam Kapoor, and Abhay Deol. However, Dhanus carries the most of the footage of the film and deserves the major credit despite the rough tough look he gets in the movie. However, the film is pretty slow at the beginning and goes for easy answers in the second half.\n\nRating: 2 stars out of 4"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "anand1213",
        "review_rating": "4",
        "review_title": "Mindless film about an equally mindless love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "econashirvadp-300",
        "review_rating": "8",
        "review_title": "second half is more endearing",
        "review_detailed_main": "This is one such movie which tries to cash in on your emotions without anything substantial to offer.But in every aspect it is better than mausam a story which just tried to glide through without any emotional moments.I don't think any actor could have made it believable so he deserves appreciation.Sonam was outstanding in the second half which was lot more unpredictable with lot many twists and therefore interesting to watch.But it downplays a serious issue like suicide with the hero slashing his wrists time and again n his friend joking about it.This is not a good message from the film.There was another with president of the party throwing things around while protesting in the office for sonam.This is not the right way i feel to project things even i as a former student from JNU know that we hardly resort to such things protests and reasoning your point of view are more than enough.The movie none the less was refreshing, well made and light hearted romantic to the core and deserves high ratings."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rohit-kj29",
        "review_rating": "9",
        "review_title": "The Ubiquitous and Conspicuous First Love",
        "review_detailed_main": "First things first. I never intended to watch this movie. In fact, I had convinced myself that Dhanush got this movie just because of his 'Kolaveri' fame. But the flood of good reviews compelled me to go for it. And here I am writing my first review on IMDb at 4 a.m.\n\nI'm a regular visitor of this site but never got the urge to make an account. Now I have, to pay my gratitude to this movie. I didn't even do this for Dev.D. Now you can appreciate the gravity of the situation!\n\n'Aanand Rai' has deservedly solidified his account in Bollywood with this movie. The music is awesome and 'Tum Tak' vibrates your nerve chords to the extent of making nostalgic some of you. And another mortal adds to the list of here-to-stay-newly-added fans of 'Dhanush' from North India. RESPECT for his acting skills! You can actually feel his happiness and pain and empathize with him throughout. The first love is just like that for many.\n\nThe feel of the first part of the movie is unreal and special, amplified by pure awesome cinematography. It becomes a bit convoluted in the second half, which is responsible for reducing a point out of 10/10. But it still stands highly recommended!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "nasibipebuet",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "I watched this movie on 2015 with little to no expectations, just to pass some time. To be fairly honest, I was left stunned watching the whole movie: the perfomances, the music, the screenplay, the dialogues, the plot twists, the climax. I have watched it 10 more times since then and it never ceases to mesmerize me every single time.\n\nThis is a fast paced movie that starts as an innocent love story of a hindu boy and a muslim girl and take turns to explore different genres like a drama, polytical satire and much more. Dhanush will remain my favorite Indian actor for the rest of my life, such was his performance in this movie. Jeesan Ayyub and Swara Bhaskar deserve special mention for their powerful performances too. All the little characters of this movie played their roles to almost perfection. I can't find too many plot holes anywhere in the movie. The castings were perfect. Perhaps no one would better suit the role Abhay Deol played. Sonam did her job alright. The music touches the heart and totally amalgamates with the movie. You would never really feel like avoding any of the songs unlike many bollwood movies where the songs are there just to be there. The masterful music of this movie brings it to life and the story keeps moving forward with the songs.\n\nOn top of all the good things like the acting, screenplay, the twists/turns, the climax left me speechless (beyond imagination); such was the power of Raanjhanaa. Only a 10 star can do justice to this movie.\n\nIf you are an audience who can appreciate and understand movies that are larger than life and are yet to experience this movie, just sit tight and watch a movie that you will remember for the rest of your life."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "srijitsarkar",
        "review_rating": "9",
        "review_title": "Love is Crazy",
        "review_detailed_main": "How far would you go to prove that you can do anything in the world for the love of your life ? Raanjhana showcases how a person lives and dies each day only to make someone happy for the rest of life.\n\nThe movie takes you on journey with Kundan who is brilliantly plated by Dhanush right from his school days in Banaras to his ultimate destiny. Its very hard not to feel for the guy and cheer him, laugh with him, feel with him and it definitely makes one nostalgic and teary eyed at the same time.\n\nThere are many amazing sequences in the film which are so realistic that you can really feel the main man crying, smiling ,puking at various stages of the movie. His transformation from a school boy with a crush, through a youth with stubble and only one real goal in life, to an atonement seeking person is palpable.\n\nMind you though its made to be a love story it almost never gets into stereotypes or clichés and keeps us on the edge of the seat with its thrilling twists throughout the course.\n\nOf course the main character is aided by a wonderful support cast from his friend Murrari who gets the best one-liners, his childhood girlfriend, Abhay Deol who plays his role with ease and surprisingly Sonam Kapoor who has dared to do something different & succeeded.\n\nBut the movies greatest strength is Dhanush who can make you cheer for him even when he's slashing his wrist, or riding is love into the river when he realizes she in love with somebody else. And the places were the shoot have done in city Benaras have its own charm with the taste of mythology and the some spice of love of two different religion.\n\nOn the flip side his role as a political leader seems over stretched after the racy 1st half and some of the actions of the lead female towards the end are not understandable.\n\nAll in all if you want to watch desi realistic love story with raw human emotions and unpolished drama here's your chance. Don't miss it!\n\nThank You."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "piyush-paryani",
        "review_rating": "10",
        "review_title": "Nice Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "winstongautham",
        "review_rating": "5",
        "review_title": "Great story but Overly cliché and laboured",
        "review_detailed_main": "Romantic comedies are essentially my guilty pleasure (psst... don't pass the word around), often intaking a few to lessen the intensity levels following more ambitious cinema. Despite being able to fill in the dots several scenes ahead, they do offer a certain respite and touch the less cynical side of a human being.They end up attempting to talk there way into the viewer's sympathy with mildly entertaining punchlines, forced deliveries reeking of pretentiousness or mistimed comedic flow.The best thing in the movie is Dhanush. He simply stole the show with his intense portrayal of a person driven by love, a person who does the most stupid, brave and incomprehensible of things in the name of love."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "kishor-jyoti",
        "review_rating": "9",
        "review_title": "fabulous",
        "review_detailed_main": "just one word fabulous. unique story,wonderful plot,and superb acting.After ages i saw a good love story. outstanding performance by Sonam Kapoor, Dhanush, and Zeeshan Ayub. Awesome music by A.R. Rahman and lyrics by irshad kamil. request to those who not yet watch this movie, go to your nearest theater and have a look. I am sure you will find yourself in raanjhanaa. Raanjhanaa is not only a love story. It is much more than that.he loved the girl from his childhood and he crossed his heart and hope to die.love is immortal.love is divine.love do not know cast. if you love someone then never give up.One day she/he will come to your life. Raanjhanaa is not only a love story. It is much more than that. Just have a look and i am sure you will say only one word. it is just awesome. Raanjhanaa hua me tera. kaun tere bin mera."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "Makhzumi",
        "review_rating": "8",
        "review_title": "Raanjhnaa...!!!",
        "review_detailed_main": "There are all sorts of viewer out there but what everybody likes to see and wants to see is a performance distinctive and unique. Yes this is said in praise of Dhanush as Kundan. Exceptionally something worth watching. unfortunately it didn't screen in Pakistan ( n I'll never understand why). The movie has a lot to give to you. I have been waiting to see raanjhnaa for a long time and it has proved that all that waiting was worth it. Raanjhnaa is quite different from usual Bollywood romantic movies. The character development is amazing and a special mention can be made in regard of Kundan(Dhanush). The movie carries its pace and attention very well in the first half. The music matches the situation exceptionally well hats off to A.R Rehman. Apart from that the dialogs are very witty. A piece of advice don't take this movie literally ;) It has a lot to offer, just be willing to gain something n u will empathize with characters."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "atshjn",
        "review_rating": "10",
        "review_title": "Ready for a Roller coaster Ride which bangs your heart and mind",
        "review_detailed_main": "Friends I had just went through the superb experience of pure Bollywood movie which proves that we can also create movies where Hollywood seems beggar. Our culture, cast, religion and a love story with simplicity and complexity, friendship, love triangle, You can experience all this here in RAANJHANAA. Dhanush proves that looks doesn't matter if you really do the justice with acting. Every character have done a great job.\n\nMovie starts with light moments and move towards the complications of love. Dialogues are well written which makes you laugh time to time and having a pure touch of Banaras. What can I say about the music. Afterall it is again A.R. Rehman who set the new benchmark for musicians and for himself too.\n\nOverall I liked this movie very much and recommend all the readers to watch it. Thanks"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "amandeepk-sondh",
        "review_rating": "9",
        "review_title": "Simply Awesome!! Worth watching love story",
        "review_detailed_main": "Very practical and earthy story spiced up in the context of childhood crushes and practical love. Sonam portrays the character of confused and vulnerable yet practical girl with ease. Abhay deol's cameo leaves a great impression. But the life of the movie is Dhanush. That guy takes the movie on his shoulders and carries the burden effortlessly. Muraari's timed punches keep the mood light even in sad scenes. You feel bad for Bindiya throughout the movie. The best scene in the movie is when Dhanush hugs Sonam tightly and tells her that he doesn't love her because she is beautiful, even it would have been some other girl he would have loved that girl immensely and that its nothing to do with Sonam being pretty. For rest, please go and watch the movie yourself. The climax is a big time surprise."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sunita1712",
        "review_rating": "9",
        "review_title": "A fresh new approach to love stories",
        "review_detailed_main": "It is a story about one-sided love of a small town boy Kundan. Like his ways or not, you can not help yourself but feel for him. The best part is, the characters are so real, that you can easily connect with them.\n\nActing is great whether its the lead pair of Dhanush and Sonam or the supporting actors like Mohammed Zeeshan Ayyub and Swara Bhaskar. A Hindi movie debut for south superstar Dhanush could not have been better than this. His common man look only help his character come out to be more real and likable.\n\nRehman's Music is good and goes well with the narrative, specially the title track, Tum tak, Piya.\n\nStory is fresh, not a typical bollywood love story. The regular twist and turns keep your interest in the movie intact. The dialogues are the main hero of this movie, specially the one-liners. Kudos to Himanshu for his writing and Anand L. Rai for trying to be different.The only setback is it seems to be two different movies, pre-intreval and post-interval.Not disconnected though, the pace and the environment changes drastically post interval. Which takes a while for one to fit into the mood.\n\nOverall a must watch love story."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "arpitasingh28",
        "review_rating": "10",
        "review_title": "A must watch movie for everyone",
        "review_detailed_main": "guys please do watch out this movie.don't go on the looks of Dhanush.. once the movie starts he would steal your heart ,n will make u fall in love with his character. He is just an amazing actor n to watch out for.he delivered an endearing performance. A brilliant script ,nt just another normal love story,gives u smile,pain,suspense,laughter,love everything..Regarding others performance so Sonam Kapoor did a brilliant job in her role. A very good performance given by her. She also delivered fab performance.Rest supporting cast also played well enough. Dialogues are like epic. Simply unforgettable. I would give this movie 11/10 I watched a very good movie after a long time as was tired watching crap movies from our bollywood. But this movie needs standing ovation. Everything is just too perfect. I never wrote such review for any movie . But this movie is magnificent and epic movie so cant resist myself from writing for it. It would make place in your heart for quite long time i must say. Or even lifetime u never know :) . Just go ahead and watch this ,you should not miss it. You wont regret watching it :)"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "whatsmynameix",
        "review_rating": "1",
        "review_title": "Can i have my 2.5 hours back ?",
        "review_detailed_main": "Rates 7.8 (! at the time of writing this review) You got to be sh!tting me. This is no better than the cr4p bollywood has been dishing out for the last 10 years. In fact this is one of the worst I have seen in recent times. Over the top acting by Dhanush, cheesy dialogs, over emotional characters ready to slit their wrists for just about anything and a cr4ppy story to top it all. Wondering if there is anymore you can add to this steaming pile of sh!t. Music is very disappointing too. The only song worth listening to was a stolen retro song... this is not how you want to project the Indian youth or how you want Indian youth to engage in politics. All you people rating it so high must be a hired lot 'cause no one in his/her right state of mind would give it anything over 1."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ogvictor1",
        "review_rating": "8",
        "review_title": "Ranjhanna 4.5/5",
        "review_detailed_main": "some love stories are perfect when left incomplete and of its kinds is ranjhanna... it was nothing new in the concept of the movie yet the presentation was unprecedented.\n\na young boy who fall in love with a girl whom he saw while raising fund and spend years in waiting only to realize that the girl love someone else and never thought of him any thing more than a bailout option..\n\na girl who was kept away from committing teen age mistakes by her parents only to be done later when she grows up. falling for a guy from a different religion and creating chaos , and what all over shadow in the movie in the first half is charm of banaRAS or i would say the essence is what catch your eye ,the local slang , narrow street and blend of love. the first part of movie ends in midst of broken hearts and some broken bones only to build up for intriguing second half.\n\nsecond half starts touch slow and could only be the only possible flaw in the movie still i would not consider it as a flaw. after all moon looks perfect with the dark spot on it. the chaos created before needs to be set right and our hero takes the responsibility in his own hands to do it by the way of reparation , but destiny has something else in store for him and the things fell all over the places for him. a death ,a shattered soul ,a family left behind. and than the resurgence where he tries all his might to win over again the battle of love through his born qualities of being a banarasi .\n\nsonam kapoor has finally shown some acting skills murai (Mohammed Zeeshan Ayyub) stole the show with his banarasi one liners and punches and then their is dhanush like a silver lining for many of those who thinks acting matters more than the looks would just love to ask him .. why so late is dis kolaveri DI..\n\nits a must watch. and anand rai deserves credit for this one...."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "asu-ray20",
        "review_rating": "8",
        "review_title": "a nice romantic up and down with a great ending......",
        "review_detailed_main": "Raanjhanaa a movie focused on love and it's different up and downs.It was directed by Anand L Rai,and he did work well too.The plot of the movie is about a small town boy Kundan and a small town girl Zoya .Despite of their religion differences Kundan loves Zoya from his childhood.He proposes Zoya .after lots of chasing and slaps he manages to convince Zoya.but when Zoya's dad discovers about his daughters love affairs with an Hindu boy, he sends her to Lucknow.After eight years of this Kundan dose not forgets Zoya.when Zoya returns to Banaras ,she dose not recognizes Kundan.now the actual plot starts about the past of Zoya and the miseries that Kundan suffers for her.The movie concludes at a note of ever loving spirit of Kundan.Casting of this movie was good.Dhanush has good acting skills but his trouble in speaking Hindi quite shows . Sonam Kapoor was better then her last performances,Abhay Deoyl was good too.The character of Murari was also good.The movie was good and its songs were also enjoyable."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "Punter_Hunter",
        "review_rating": "8",
        "review_title": "Ranjhnaa is a realistic love story rather than another regular Bollywood romcom",
        "review_detailed_main": "Ranjhnaa is defined by two of the dialogues – \"Girls and rocket can take man anywhere\" and \"You are not Shahrukh Khan that girl will fall in love with you because of you persistently following her , so become Vinod Mehra\". Ranjhnaa is story of Kundan(Dhanush)wooing the girl(Sonam)from start till end . He starts by following Shahrukh pattern( expressive show of emotion and following the girl )to Vinod Mehra pattern( staying near girl and helping her silently) to woo her.\n\nFirst half is fun and moves very fast. But the second half where he follows Vinod Mehra charter of romance(being with the girl, helping her silently in whatever way possible),the romance part takes back stage but still being undertone of the new situations kundan have been thrown into because of this girl. The climax is letdown as the twist and/or the shock factor they were trying to put in, hasn't come through well, as seeing the development and behavior of the characters it was evident what's going to happen.\n\nDhanush is brilliant as lover who is crazy after the girl - Sometimes getting fooled knowingly to keep his love happy like a true blue lover and sometimes resentful and hurting her.\n\nDhanush plays the role of lover with so much passion that his act is most endearing one. Sonam looked beautiful and played the role of a girl who uses her beauty to get her work done with great innocence. Mohammad Zeeshan and Swara Bhaskar are also terrific. Abhay deol was good , though there isn't much for him to do\n\nBut all these performances are enhanced by some brilliant one liners and dialogues which look convincing and are actually hilarious makes one ROFL"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "arupmandal1983",
        "review_rating": "8",
        "review_title": "Better than most cliché Bolly offerings...",
        "review_detailed_main": "Raanjhanaa is anything but cliché,unique in so different ways unlike most Bolly offerings these days.First you have an unconventional hero, who can act and look the role he is playing (He actually looks like a 9th grade student at the age of 30 as he did in \"3\"). He impressed previously in 3 or Aadakulam.He might not be as good here but his effortless act is most definitely one big reason for which the film clicks.Secondly you have a role written for a Bolly mainstream female lead which has so many shades that any actress with even decent acting skills could have made a career out of it.Sonam won't,no surprises.She looks BEAUTIFUL nevertheless.I am not sure who in India could have looked so beautiful,young and yet do justice to this fantastic role-but in case choice was necessary acting should have been preferred over looks. :( .Thirdly you have two genuine actors, playing the supporting acts and giving the best performances in the film.Not Abhay Deol (though he is good in cameo),its Md.Zeeshan Ayuub and Swara Bhaskar (she was even better in Listen Amayaa & Aurangzeb) who stays with you way more than anyone else. But the biggest positive aspect that the film delivers, are its characters.Each of them are so very real,with so many shades and flaws that you can relate.The relentless hero cursing his love being rejected,the scheming heroine spitting on the hero-Raanjhaana does have a coming of age effect working for it.It has a genuine story though the screenplay, primarily in the 2nd half fails.With a very vibrant,fast and effective 1st half ,the film suddenly looses its steam in the 2nd, trying to push itself in uncomfortable zone (read politics).With more than a few far-fetched sequences,unnecessary comic reliefs & punch lines and a stiff Sonam lingering around, Raanjhanaa loses its holds,falters.Rehman too does not help with his tunes, though the background music is pretty good.But then you often move helter skelter while trying some new road,only promising to improve in the next venture.Anand Rai does exactly so and gives a far better love-story than the cliché,bore to the core YJHD."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "tosiddhartha",
        "review_rating": "9",
        "review_title": "Simple Awesome",
        "review_detailed_main": "Awesome movie by the director. Above all, its Dhanush throughout. A brilliant actor and a brilliant performance. Not even the main stream Hindi movie actors can think of to deliver performance near to Dhanush. Performance of a truly National Award winner. Good music by Rehmaan. Songs are great and beautifully pictured. You will feel the essence of Banaras throughout the movie. It could be considered as one of the best love stories ever made in India. Sonam Kapoor have also delivered the best performance of her carrier. Dialogues well written and will give you the feel of UP language and the way how young boys interact with friends in UP.\n\nEnd is good and the last dialog by Dhanush will make you leave the cinema halls with smile. A must watch movie. 9/10"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rhitwick",
        "review_rating": "8",
        "review_title": "Raanjhanaa : up, close and personal",
        "review_detailed_main": "Initially I was sceptic about this movie. I assumed a different story from the trailer. A story full of romance and clichés. A story which was bound to have a good first half and boring second half. Well, I am right about the second half. Post interval the movie slows down very much, at times drags then after few minutes beating around the bushes it concludes with a good ending.\n\nTheme: \"The pundit's son Kundan (Dhanush) has fallen for the girl at first sight. That they're both kids makes us dismiss it as a meaningless crush. But a few years later, the boy is still in love with the girl, Zoya (Sonam Kapoor). When she's in school, he follows her around holding her hand and getting slapped in the process. Finally, she relents because of his \"consistency\". The film shifts cities when Zoya gets into JNU (Jawaharlal Nehru University), and through her, we are introduced to the idealistic and political culture of the place. She discovers a long-lost strength as she confronts and then falls for student leader Abhay Deol. The film takes a turn when Zoya returns to her hometown after eight long years only to find some things changed, and others surprisingly the same\"\n\nCharacter development: This movie is stands on the shoulder of two leads Sonam as Zoya and Dhanush as Kundan. But, mainly zoya's character goes through any development. Say it mentality, expectation from life, treating situations. Dhanush kind of stops growing emotionally. Most of the time he learns that things have changed in and around Zoya and impacts him momentarily but does not change him or his mentality towards Zoya. I would say Dhanush's character in this regards does not go through much changes in the movie.\n\nDirection: The movie has a very unconventional script and putting that to frame could not have been easy but Anand Rai did a marvelous job. If only he thought about anything about post interval scenes. Dhanush is used to the fullest and he proves he's here to stay. But more praise goes to Anand Rai for bringing out a convincing performance from Sonam Kapoor. This movie won't win her any award but might help her land some good roles. And if she stick around like Deepika, she might improve. Next praise of the direction is the scene construction. There are few gems in the movie. Specially mentioned would be the gas cylinder scene, scooter into Ganges and Dhanush vomiting scene. Anand Rai got an excellent script and did a marvelous job portraying it into movie.\n\nCinematography: Cinematography is apt to the situations.\n\nActing:Dhanush is superb. This is a tailor made role from him and him only. His looks and his physique complements the movie. Then add his brilliant acting talent, the way he speaks, his body language is brilliant. People talk about chemistry between lead pairs but here Kundan(Dhanush) and Murari's chemistry surpassed everything. Mohammed Zeeshan Ayyub as Murari did a solid job and at times shadowed Dhanush. Sonam here dared to do a very tough role. Her role was the most strong role in the movie and even tougher than the Priyanka's role in Barfi. Her character goes through various changes in the movie, jealousy, love, revenge, guilt, passion everything comes into her role. We are grateful that she pulled that off somehow, else it would have been a torture to tolerate her in a movie like that. Swara Bhaskar as Bindiya did a very good job. I really liked the scenes where Murari, Kundan Bindiya fight with each other. Rest of the characters are average does not require a special mention here.\n\nSongs and background score: Only one song i.e. 'Tum Tak' I found apt to the situation rest do not contribute to the movie. I would appreciate the background score here more than actual songs.\n\nEditing: Can't have mercy on the editor for the bad second half. Few unnecessary scenes could have been avoided.\n\nEntertainment value: Till first half this movie would entertain you later you might get bored but the ending is good."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "hellisotherpeople",
        "review_rating": "3",
        "review_title": "Stalker loves Beeatch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "pranjal-kumar835",
        "review_rating": "8",
        "review_title": "a benaras hindu boy fells in live with a rich Muslim girl. the girl loves another person .can he find his love amongst all odds.",
        "review_detailed_main": "After watching this film felt that romance has redefined in bollywood.how an uneducated falls in love with an educated girl that to Muslim has been presented beautifully.dhanush has reached a new standard if acting after his mind blowing performance.he has simply drowned in his character.swara and ayub has also been fantastic adding a touch of humor to the story.anand l rai has proved the worth of his story and characters a must watch for all the lovers.although the film slows down in the second half dhanush and sonam 's performance and chemistry binds us to the story. A good sweet rustic and lively romantic movie."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "indranil2121",
        "review_rating": "10",
        "review_title": "Excellent romantic movie with a magnificent screenplay",
        "review_detailed_main": "First I will thanks to the director. Tanu weds Manu was one of my favorite movie. Basic story or we can say moral is quite same for Raanjhaana. Story was about die-heart love. Director portrait the story with the help of great and energetic actor Dhanush. Story: Excellent in 1st half and more than excellent in the 2nd half. Actors: All the actors are done great job. Specially Dhanush(I was expected that he will give his best). I surprised to see Sonam(She did excellent job in this movie) Screenplay: I liked the screenplay most. I'm waiting to see his next movie.\n\nI recommended you all to watch it as soon as possible. It would be your one of the best romantic movie. :)"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "manavsingh655",
        "review_rating": "8",
        "review_title": "A Heart Touching Emotional Melodrama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "theepan-junk",
        "review_rating": "10",
        "review_title": "Must see movie!; Not a typical going to America bollywood movie",
        "review_detailed_main": "This is one of the best and realistic Bollywood movie.\n\nNot a typical going to America movie with fantasy scenes of India.\n\nThe movie shows the real issues faced by Indian everyday (middle class).\n\nIssues between Muslims and Hindus.\n\nPolitical corruptions at all levels.\n\nOn top of all that a young village Indian boy who didn't see any of those and falls in love with a girl.\n\nDanush's acting is amazing. The songs are great.\n\nI would say this is the movie of 2013.\n\nThe movie is well taken and the scenes reflect a normal Indians life stye."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "jb1981",
        "review_rating": "8",
        "review_title": "Good and different",
        "review_detailed_main": "I saw the movie last night. It is an intense, non-conventional, thought provoking romantic entertainer. While there are some tinges of grey shades in the characters of the protagonists, they are not fully unjustified in their actions. The movie starts as rom-com but eventually becomes quite dark towards the end.\n\nActing wise, all the casts performed their best. The male protagonist Dhanush, who is also a national award winner, did full justice to the role that was tailor made for him. His appearance, mannerism and innocence totally made me recall \"bhaiyas\" from Uttar Pradesh. He should do more of such roles although can't say for sure if he make it in bollywood because of his thick Tamil accent. This is Sonam Kapur's best performance till date, although I would've preferred Parineeti playing this role. Abhay Deol is a charmer as usual. The music is good too, especially the \"Banarasia\" song gives the feel of bhojpuri songs. Overall, I will give it 8/10."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "brijeshghelani",
        "review_rating": "10",
        "review_title": "Anand l rai 👏👏",
        "review_detailed_main": "Raanjhanaa is an amazing film, away from typical Bollywood love stories it brings raw emotions of what feels like being in love. The dialogues are great too, the climax scene takes your breath away. Dhanush is a phenomenal actor, even though he did not knew hindi he pulled the role of a banrasi so well. Anand l rai is a superb director. Hands down one of the best film of Bollywood."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "vijayshinde",
        "review_rating": "3",
        "review_title": "Better kill yourself than watching this !!!",
        "review_detailed_main": "The biggest mistake after Shahid Kapoor's Mausam !!! Had to break my 8 months hiatus from Bollywood crap but to end up with Ranjhanaa is the worst that could have happened .... :( :( :(\n\nShittiest worst performances ever... pathetic story an even more pathetic dialogues :( can't believe Dhanush had won a national award !! And abhay deol can also take such bad decisions...\n\n'Banaras' couldn't have Been shot worse than this... Kudos to every inch of the movie to b so pathetic..\n\nIn today's day an age when v r fighting the patriarchal systems,the one sided obsessive lovers !! This movie makes it's protagonist the dirtiest reality of UP culture... To shatter everything blow by blow wid some 4-5 suicides to go with.... This is the lowest,the cinema can reach....\n\nThe reviews with 10 stars are either by the production house or they were drunk ...!!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "navidiba",
        "review_rating": "9",
        "review_title": "Bollywood's one of the finest.",
        "review_detailed_main": "The entire movie was an absolute treat for the eyes. Shot on Vanarasi, it's a saga of love. Dhanush is the life of the movie. His acting skill is widely known & he proved why he is so perfect for this role. Sonam gave fresh look in the movie and looked like a girl next door. The music by AR Rahman is tremendous."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "bordensbird",
        "review_rating": "8",
        "review_title": "Would you fight for love the way Dhanush does?",
        "review_detailed_main": "A blend of malevolent passion, coupled with naive desire, Raanjhanaa tells a tale of a soul desperate for approval - seldom played or mastered by south Indian stars, specifically as a breakout role in a new language. However, Dhanush intricately weaves his craft into the role, donning a new persona as the posterized \"lover-boy\" burdened by Sonam Kapoor's lack of interest. With a powerful score orchestrated by none other than the maestro himself, A. R. Rahman picks up the films notes whenever Anand L. Rai falters. Nonetheless, Rai's directorship simply embodies his talent: boundless.\n\nA brisk start with a gripping, bubbly, and at times heart-wrenching performance from its supporting cast (you didn't seriously think Abhay Deol would disappoint?), Rai uses his talented cast to deconstruct masala-esque themes and dismantle the heavily leaned-upon pillars of Bollywood's (and at time Kollywood's) rom-com tropes. Of course, he brilliantly interlinks comedic elements, and no amount of praise can hope to accommodate Dhanush's powerhouse performance.\n\nWhile the cast, the characters, and the themes hold up a lengthy 2 and a half hour runtime, one must ask themselves: \"was it justified?\" A brilliant film that I certainly would dub a masterpiece had I only watched the first 40 and last 40 minutes; it's auteur lacks one thing: conciseness. My only negative remarks would include the unfortunate feeling of a piece of gum that'd been over-chewed - it simply lost its flavour over the course of time. As many films undergo a thorough editing process, perhaps Rai could've left a couple more scenes on the cutting room floor, but luckily for the director, Rahman tugs at our heartstrings, and pulls us through these drab 20 minutes in the middle with herculean strength.\n\nOverall, Raanjhanaa is a film that I consider to be fantastic, and a definite watch for anyone."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "osmkiran",
        "review_rating": "9",
        "review_title": "One of the best movie i have seen",
        "review_detailed_main": "Raanjhanaa - 2013 (jio movie's) 1-02-2023\n\nRaanjhanaa means Beloved One . What should I tell about movie i can't even thing this kind of person will really excited in this world who love a person more then anything in this world and do anything for her to end of his life. What a story writen by Himanshu Sharma how he think of this story every character has it important and feelings shown very clearly which we can feel their feelings i can't control my fellings by end of this movie.\n\nMy heart didn't accepted the ending. And A. R Rahman shown the feelings by his music.i want to say so many things about this movie by words are not coming out only tears are coming out. By the end i can say that you want to know what is true love just watch this movie."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "anisrajaptc",
        "review_rating": "9",
        "review_title": "Pleasant motion picture.",
        "review_detailed_main": "It is a pleasant motion picture. performing artist Dhanush is quite recently brilliant in it. it is an unquestionable requirement watch motion picture. Starcast were great any individual who watches this motion picture will be fulfilled exchanges were great supporting performer's discourse were additionally composed well it will gather great measure of cash most likely a superhit in bollywood on-screen character dhanush can get more parts in bollywood starting now and into the foreseeable future i enjoyed this motion picture since it was esteem for cash film and an alternate romantic tale and i trust this motion picture does great on abroad market as well.after viewing the motion picture individuals applauded that indicated how much good motion picture this is...this was inside and out a romantic tale with great exchanges and impeccable discourse conveyance. chief made a decent motion picture showing affection for a man towards a lady who is not of his station"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sandeeprajput",
        "review_rating": "8",
        "review_title": "Very nice movie",
        "review_detailed_main": "Very nice movie. Story of the movie is very impressive. Sonam's acting is not so good. Nice direction. A clichéd love story backed by superior performances. Raanjhanaa impresses despite its few flaws because Rai portrays a simple and honest love story without making any changes. Dhanush even with wobbly Hindi is splendid in his debut performance. He makes the pursuit of a lover to be loved funnier, pure and honest than anyone else ever. Sonam is charming and even with few flaws, she and Dhanush make up for a wonderful pair. Raanjhanaa is not one of the best love stories captured through celluloid, but it certainly is one of the finest performances by a lead pair in a love story. Even better than SRK and Kajol in the over hyped \"Dilwale Dulhania Le Jayenge\". Yeah, I said it but that's the truth. I don't say this because I'm a south India nor I personally like Dhanush. I mean I do like him in some films but I'm not his fan boy."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "vsramalwan",
        "review_rating": "8",
        "review_title": "One of the best romantic movie of decade",
        "review_detailed_main": "Ranjhanaa:A s the name says, Dhanush had done exact acting. Terrific performance. His acting skills is way above good. After all he is Rajnikant's son-in-law. Sonam is average! Swara Bhaskar is another main ingredient in this recipe. Fab script and screenplay is main punch of the movie. Director Aanand Rai has handled this tough-bit complex-fusion script so easily that you won't find any fault and the movie is easy going. The team of Tanu Weds Manu brings this drama of Love, Politics, Jealousy, Power, Friendship etc. all in a single movie. I completely agree with the second half and the beautiful climax of this movie. JUST WATCH IT!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "nazim_mahmood",
        "review_rating": "5",
        "review_title": "Sorry, Disappointed..!",
        "review_detailed_main": "I was really impressed by the music as well as lustrous & vibrant movie posters. So my expectation from Raanjhanaa (2013) was quite high.\n\nThe first half hour was really nice, but after that the tempo began to fall; sometimes high, sometimes low. Although they tried to put several twists in the story, but none of them clicked well. The script (by Himanshu Sharma) was not well composed; seemed like \"links missing\". It was tough to find or relate what the writer wants to tell and where he wants to go, may be it was because of immature editing (by Hemal Kothari)!\n\nThis movie reminded me of Saawariya (2007)! That was one man show by Ranbir Kapoor; here's the same, one man show by Dhanush. The similarity and reminding point is Sonam Kapoor; in both, she was really very flat. This is the point where she needs to improve a lot. She looked uncomfortable in the role. She looks young and beautiful, but all she needs is to act.\n\nDhanush was flawless throughout the film. He was perfect for the character than Shaheed Kapoor. May be more Bollywood is coming for the boy. Mohammed Zeeshan Ayyub (as Murari) and Swara Bhaskar (as Bindiya) did splendid job with their roles.\n\nIf there was no A R Rahman involvement with this cinema, this might be a disaster! What to say, all the tracks were unique in their genres. The vocal Percussion & vocal Shehnai by Chinmayee and Aanchal Sethi for the song \"Ay Sakhi\" was remarkable. Melodic \"Tum Tak\" & crispy \"Raanjhanaa\" will provide piece in soul for a long period of time.\n\nMy actual rating is 3, but bonus 1.50 for A R Rahman & 0.50 for Dhanush making a total of 5. In a nutshell, not recommended; but can be seen at your own risk!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rathirishabh125",
        "review_rating": "9",
        "review_title": "A boy who hails from a Hindu family falls in love with a Muslim girl. It is a love story of a kind.!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "msrk-44000",
        "review_rating": "8",
        "review_title": "Awesome and Emotional",
        "review_detailed_main": "You'll cry after watching this movie.. Dhanush has done fabulous work.. Anand L rai and Himanshu sharma you both will rule this industry! Awesome storytelling and directing..."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "anupbit",
        "review_rating": "8",
        "review_title": "Movie is not just a love story but its awesome !!!",
        "review_detailed_main": "Whosoever going to watch just a love story, they gonna find it better than just a love story, all kinda emotions are involved and more importantly all the emotions are not shown up until the climax. The revenge of Sonam at the end made the move better than just a traditional story. All together movie is gonna entertain you like anything. First half is pretty sweet with child love and then grown up love and lot of fun moments also included. Dhanush friend did a real good job being a typical UP folk. Dhanush may not look like a typical Bolly wood hero but his acting is damn good, it never looks like that this is his first movie, he is perfect for this movie. The kind of script movie has demand is the lead actor like Dhanush. Sonam also done a good job after long while, she improved a lot from this movie. This movie deserves a standing ovation with claps from the audience."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sachitalfie-27814",
        "review_rating": "10",
        "review_title": "Raanjhanaa hua mai tera",
        "review_detailed_main": "Raanjhanaa back in 2013 what a beautiful love story portrayed by the director anand rai the way Dhanush took the acting to another level and perfect chemistry between Dhanush and Sonam the album in the movie just goes amazing a beautiful love story kundan just killed it."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "akashpj-49118",
        "review_rating": "9",
        "review_title": "Underated",
        "review_detailed_main": "I was in 10th when movie came out loved and lived the songs of movie, it was simpler times school and 9xm on tv. The songs were quite filmy that time cause of school time childish love but didn't watch the movie (which happens to lot of underated Bollywood movies) till today but wow such a great and beautiful movie was worth to watch after a nearly a decade. Dhanush is fabulous and Sonam is also good she does not disappoints like her other average movies. Dhanush deserves more quality Bollywood movies but it's Bollywoods loss. Anyway he getting his recognition on international level working with big Hollywood stars."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shrirangkulkarni-34241",
        "review_rating": "9",
        "review_title": "Classic definition of love",
        "review_detailed_main": "A wholehearted love story seen that will continue for decades to remembered by each and everyone watching it. Actors did a blissful job to indulge themselves almost into the character, making it a near perfect combination. Seen this movie quite late (2022) and I can say the movie justifies with the time it was released. Music is also very pleasing, ofcourse the legends in the industry have taken up this department.\n\nWatch it once and I bet you won't regret for this !!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "hv_iitd",
        "review_rating": "1",
        "review_title": "seriously....what director/writer want to show ?...(spoiler alert)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "nairtejas",
        "review_rating": "8",
        "review_title": "Very Strong Romantic Drama In The Backdrop Of Politics. ♦ 83%",
        "review_detailed_main": "Dhanush's character, his portrayal & performance is one of the strong- points of Raanjhanaa. Other points are its throbbing music, supporting cast, colorful setup & fresh writing.\n\nThe first half, talking about the initial romance between two lead characters, is very powerful. It emotes total romance, humor & drama. Thirteen minutes into screenplay, the story is half-told, wonderfully. The next part shows aftermath. Abhay Deol enters and politics follows. Sentimental sequences make up almost three quarters of the second half and it actually paces the story. The climax is pure Bollywood ishtyle where the lead people react and evince the meaning of film as a whole. Wonderful!\n\nSupporting cast is extremely potent, especially Dhanush's on-screen friend & that friend's sister. Their performances are terrific. A R Rahman's songs are truly extravagant, yet I felt repetitive use of lilts could've been done without. And I really doubt if Rahman has sampled Hans Zimmer towards the end. But, it doesn't matter because the hot theme actually mesmerizes you. There are many elements to consider and that itself is enough for considering this drama.\n\nThe experience as a whole was good enough for a Bollywood movie releasing among other clichéd films, because the makers know their audience and only reveal plot points when they think the story needs it.\n\nBOTTOM LINE: A very strong cinema. Highly recommended! 8.3/10.\n\nCan be watched with a typical Indian family? YES\n\nProfanity: Strong | Sex/Nudity/Vulgarity: No | Violence/Gore: Very Strong | Smoking: No | Alcohol: Very Mild | Porn: No"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sreekarnumars",
        "review_rating": "9",
        "review_title": "A Story Of TRUE LOVER.",
        "review_detailed_main": "Heartbreaking Lovestory. Anand LRai direction and Dhanush acting made the movie a MASTERPEICE. A story of a true lover and a heartbreaking ending. Dhanush put his soul into his character and bring him alive as Kundan. What a beautiful love story watched it almost a decade later but still worth the time spent."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "vishal-42209",
        "review_rating": "10",
        "review_title": "Greatest of all time for me love for Dhanush",
        "review_detailed_main": "Nobody is greater actor than dhanush the movie is so beautiful and dhanush getting into the character and overall the way he lead the whole movie is unmatched for any body i really love the way dhanush has speak throughout the movie 🍿🍿🎥🍿🎥 i really love 💕😘 the movie Nobody is greater actor than dhanush the movie is so beautiful and dhanush getting into the character and overall the way he lead the whole movie is unmatched for any body i really love the way dhanush has speak throughout the movie 🍿🍿🎥🍿🎥 i really love 💕😘 the movie Nobody is greater actor than dhanush the movie is so beautiful and dhanush getting into the character and overall the way he lead the whole movie is unmatched for any body i really love the way dhanush has speak throughout the movie 🍿🍿🎥🍿🎥 i really love 💕😘 the movie."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "mraj-73329",
        "review_rating": "10",
        "review_title": "Nice Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "rockingmymail",
        "review_rating": "8",
        "review_title": "Movie will win your heart",
        "review_detailed_main": "I want to watch this movie because of dhanush He will surely win your heart I didnt like the actress or else the movie is awesome wish there was some other actress to act in this movie"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "arunsingh48",
        "review_rating": "8",
        "review_title": "Love story close to reality.......loved it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "yunusitboss",
        "review_rating": "5",
        "review_title": "Raanjhanaa (U/A) Hindi ----------- my Rating : ★★½ AR RAHMAN SAVES THE MOVIE",
        "review_detailed_main": "Ghanchakkar(Atmos) (U/A) Hindi and New movie Reviews and lots more Hot news .... LIKE THIS PAGE : English Hindi TAMIL TELUGU Facebook : Movie Review by Yunus Irshad https://www.facebook.com/YunusIrshadsMovieReview\n\nRaanjhanaa (U/A) Hindi ----------- my Rating : ★★½ AR RAHMAN SAVES THE MOVIE\n\nSTRENGTHS :- * Songs and BGM : was rocking by AR Rahman.... * Casting and Performances : were good by dhanush as a debutant in Hindi.... * First half : was completely superb ....\n\nWEAKNESSES :- * Second half : collapsed.... * Screenplay : was very slow leads the audience to sleep away... * Few scenes were repeating : was slight boring ... * Climax : was not acceptable ....\n\nFINAL VERDICT :- * Overall... a boring flick with good music .... u can avoid this.. AR rehman saves the movie by his music for a one time watch ....\n\nDanush, Sonam Kapoor Raanjhanaa is a love story directed by Anand L. Rai and written by Himanshu Sharma. The music of the film is composed by double Academy Award Winner, A. R. Rahman. The film stars Tamil film actor Dhanush in his Bollywood debut and Sonam Kapoor in the lead roles"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: Fall In Dangerous Love!!",
        "review_detailed_main": "Raanjhanaa. Love has the power to enlighten you so it has the power to destroy you and kill you. Raanjhanaa is a pure Indian love story of a small-town boy played by terrific Dhanush who needs to break through the class divide to gain acceptance from his childhood sweetheart played by Sonam Kapoor who is in love with big city ideal played by Abhay Deol. Abhay Deol in his cameo is lovable as always. Sonam Kapoor does better than her previous attempts in acting. But movie belongs to trio of Dhanush the actor, Anand Rai the director and A.R.Rahman the music director. Dhanush in his first Bollywood outing makes you smile, laugh, dance, cry and even puke. At the most surprising and devastating twist in the story, movie turns into one of the most poignant love story told in recent times. His performance is so full of impact because it is supported by deep thoughtful direction of Anand Rai and mesmerizing music of the great A.R.Rahman. Most of the songs play in background and make you feel the warmth and pain of being in love and irony of life for the people in love. But it is not fairy tale from start to finish, movie derails in his last half an hour by drifting from its main plot and turning into a political drama. But this can be easily forgiven as you would have given two thumbs up to this movie long before its climax. Watch it for love, watch it for Rahman, watch it for break out debut of Dhanush in Bollywood."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "navkanthr",
        "review_rating": "8",
        "review_title": "The story belongs to a banarasi town young bramhin who finds his love at a very small age and she is a Muslim guy. Finally how he goes after his love is the story.",
        "review_detailed_main": "It's a well planned casting session or else well planned story to start up with. Because casting Dhanush or else changed the character in the story as south Indian guy. It worked great. The moment we see Dhanush start his act on the screen, it works like a charm. He made it look so joyful and lively, I started enjoying his presence. Sonam kapoor and Abhay Deol carries their characters very well which makes movie a complete entertainer. Re-recording and music of the film are good. A. R. Rahman has pretty good idea how it works for south Indian star and how it works for Bollywood. He made his presence all over the movie. Climax is well planned and my eyes were filled with tears and it touched my soul. This kind of performance is not new to Dhanush but Sonam and Abhay had different roles which they worked for first time. I loved the movie and screenplay and story are awesome."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "mannajyotidas",
        "review_rating": "9",
        "review_title": "must watch",
        "review_detailed_main": "\"Ranjhana is a captivating movie that leaves a lasting impression. The film tells the story of Kundan, a young man deeply in love with Zoya, a strong-willed girl. Set in the vibrant city of Varanasi, the movie beautifully captures the essence of the place and its culture. The performances by the lead actors, Dhanush and Sonam Kapoor, are commendable, bringing their characters to life with conviction. The music by A. R. Rahman adds an extra layer of emotion to the narrative, enhancing the overall experience. The screenplay is well-crafted, keeping the audience engaged throughout. Ranjhana is a must-watch for those who appreciate compelling storytelling and exceptional performances."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "jewelpsunil",
        "review_rating": "10",
        "review_title": "Heart touching movie",
        "review_detailed_main": "I am seeing this movie on 2022 almost 7 seven years after its release. The is one of the best movies I've ever watched in my life. Great acting by the whole crew. Excellent and heart touching acting by my favourite actor Dhanush. He's really a gem I'm proud to see an actor like him on this century. I'm with an average expectation before watching this but now oh my God! This is amazing, Very very heart touching and a must watch movie and I specially thank the director of raanjhaana for making such a gem. Lots of love for this movie may God bless the whole crew."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "asanchay",
        "review_rating": "8",
        "review_title": "Breathe taking movie",
        "review_detailed_main": "Movie which shake our prospective of seeing love . A must watch movie , i had watched movie many times but never get bored . There was great deal of commitment by Dhanush and a great story line . Shows the reality of India that still people are very uncomfortable for intercaste marriage but as we know love can happen with anyone."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "prabal1711",
        "review_rating": "9",
        "review_title": "Ranjhana-Love that everyone will relate to",
        "review_detailed_main": "The story starts with the dialogue \"yaar ye pyaar bhi naa shanichar hota hain\" and it somewhat carries the essence of this dialogue all till the end. What a brilliant piece of work by Anand L Rai sahab.\n\nFelt that I have watched something which has not just entertained me but has left that Impact because Its not like any other bollywood movie which shows fairytale love,This is pure practical love and that's why the title reads so. I don't know why haven't i watched this masterpiece till now.\n\nDhanush has performed really well and Sonam Kapoor OMG she is looking so pretty in this film. Dude not only Kundan, Any guy this world will love Zoya.\n\nGo guys watch this straight away."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "santhosh-10290",
        "review_rating": "1",
        "review_title": "Ambikapathy",
        "review_detailed_main": "The movie was worst. Nothing was good in the movie. Nobody acted good in the movie. Worst story. Songs and BGM were also not much good. One of the Worst Movie of Dhanush."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "saurbhsnha",
        "review_rating": "10",
        "review_title": "A Complete Movie",
        "review_detailed_main": "This movie is a gem. Romantic movies have become cliched with boy meets girl story. But rarely do we come across a love story that is different and rooted in realism.\n\nRanjhana has everything to offer. Well defined characters, memorable dialogues, great acting and a really intriguing and meaningful plot."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "siddharthmarndi",
        "review_rating": "10",
        "review_title": "Good acting",
        "review_detailed_main": "The story is good, direction is good and most importantly acting is excellent"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "Sevenx7",
        "review_rating": "8",
        "review_title": "A delightful intriguing love-story with fantastic twists --- 8/10---",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "dxsaroha",
        "review_rating": "8",
        "review_title": "A pluralistic view.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "disharma-24131",
        "review_rating": "10",
        "review_title": "Intense romantic dramas with strong performances and soulful music",
        "review_detailed_main": "\"Raanjhanaa\" is a Hindi romantic drama film directed by Anand L. Rai, released in 2013. The movie stars Dhanush, Sonam Kapoor, and Abhay Deol in lead roles, with Swara Bhaskar and Mohammed Zeeshan Ayyub in supporting roles.\n\nSet in the city of Varanasi, \"Raanjhanaa\" tells the story of Kundan Shankar (Dhanush), a lower-middle-class Hindu boy who falls in love with Zoya Haider (Sonam Kapoor), a Muslim girl. The film explores their intense and passionate relationship, as well as the complexities of love, religion, and societal expectations.\n\nOne of the standout aspects of \"Raanjhanaa\" is the outstanding performances by the lead actors. Dhanush, a prominent Tamil actor making his Bollywood debut, delivers a remarkable performance as Kundan. He effectively portrays the innocence, vulnerability, and ardor of his character. Sonam Kapoor also shines in her role as Zoya, displaying a range of emotions and capturing the complexities of her character.\n\nThe film's music, composed by A. R. Rahman, is another highlight. The soundtrack features soulful melodies that beautifully complement the story and enhance the emotional impact of the scenes. Songs like \"Tum Tak,\" \"Raanjhanaa,\" and \"Piya Milenge\" have become popular and are still cherished by audiences.\n\nThe cinematography by Natarajan Subramaniam captures the essence of Varanasi, showcasing the vibrant colors, narrow lanes, and the city's spiritual atmosphere. The director, Anand L. Rai, does an excellent job of incorporating the city's cultural and religious elements into the narrative, creating a visually rich experience.\n\nWhile \"Raanjhanaa\" received critical acclaim for its performances and music, it did receive some criticism for its handling of the portrayal of stalking and obsession in the name of love. Some viewers felt that the film romanticized such behaviors, which can be problematic and perpetuate harmful narratives.\n\nOverall, \"Raanjhanaa\" is a visually appealing film with powerful performances and an engaging storyline. It explores the complexities of love and the clash of religious identities in a society deeply rooted in traditions. If you enjoy intense romantic dramas with strong performances and soulful music, \"Raanjhanaa\" is worth watching."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "mishaone-964-75139",
        "review_rating": "8",
        "review_title": "An important movie (spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "wchristina-78051",
        "review_rating": "1",
        "review_title": "Dhanush- Rajnikant's Phone Calls",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "atul-singhal1280",
        "review_rating": "10",
        "review_title": "Excellent script with fantastic acting and direction. Must watch to feel Banaras and feel India",
        "review_detailed_main": "Excellent script with fantastic acting and direction. Must watch to feel Banaras and feel India Through the movie through the music . Raanjhanaa is a movie that can we watched again and again. Great efforts by Anand L Ray, Himanshu Sharma, Dbanush, Sonam, Abhay Deol, Swara Bhaskar and Moh. Ayub. Jio Murari... :)"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "manmemandir",
        "review_rating": "10",
        "review_title": "Hands up(cheers) for Dhanush(class) .This one is best example of how you could win Masses/business/& most important ART,EVEN if you're skinny without any high class Make up.",
        "review_detailed_main": "All time Best,, closer to reality of Indian Vegan Hindu Romeo,, caste religion differences. DHANUSH/CLASSIC which won't be forgotten."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "raviso",
        "review_rating": "10",
        "review_title": "One of my favourite 😍😍😍😍😍😍",
        "review_detailed_main": "Such an lovely film And ar rahman is the soul of film Every songs are my personal favourite And dialogue are top notch , Every time i saw the last scene of climax its an bliss What an movie,kudos to director anand l rai."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "apurva_thatsit",
        "review_rating": "8",
        "review_title": "Femme Fatale",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "dochardikvyas",
        "review_rating": "10",
        "review_title": "Love story which many may connect with",
        "review_detailed_main": "Superb music, masterclass direction, super connective writing and dialogues, deadly combo dhanush and abhay deol, and sonam looked stunning yet simple,classic in this throughout her career, If you are young at heart, felt love for someone with high intensity ,it's must watch ,even after 7 years it's close and relatable."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "harsh-kabeer1",
        "review_rating": "9",
        "review_title": "As raw as love can be!",
        "review_detailed_main": "Never had a Bollywood movie enthralled and entertained me as Raanjhanaa did since Gangs of Wasseypur. It is the most heart felt mind blowing experience you will ever have! Raanjhanaa is a love story, a story the like of which you have never seen before. It is an intense, raw steaming cauldron of love brimming with unprecedented passion where love consumes all. (It is just so so difficult to put down my thoughts on this one. But damn man, I am going to give it a try.) It is not your typical warm mushy love story, the kind that are you are so used to watching. It explores love in its truest, its purest form. There are moments where the scenes are so stupid, so clichéd that it seems to be taken from a very typical Bollywood movie, that you might have just laughed at its silliness. But wait for a few moments and those scenes will grow on you. And moreover how would one expect the translation of one's passion by a generation who has fed from Bollywood movies. The difference is startling when you see Sonam Kapoor's restrained, subtle love, not because it does not carry the intensity and passion of Dhanush's, but because it is the upbringing she gets. Sonam's love for Abhay is as raw as Dhanush's for Sonam. And here where the movie shines in the exploration of love. It studies two protagonists, both of whom shimmering with love and their affection directed at different persons, but at a metaphysical level united as one in their unbridled passion. It may seem to many that there is a lot of negativity with Sonam's character, be it the way she seeks Dhanush's help or later her actions result into his miserable condition. But if one looks closely at Dhanush's character you will see how closely Dhanush at the core is the same being. Apparently, people will naturally sympathize with Kundan and not with Zoya and thereby lies a major flaw in the treatment of the story. Since the two love stories reach the same dead end and the two characters are indistinguishable in their actions and deeds, it is inappropriate for one character to be portrayed in a more positive light than the other. Dialogues are very well written, many of which are witty and funny without taking away the intensity of the moments. They seem to blend with the characters, the landscape and the story seamlessly without ever feeling like just an addition to the ongoing surroundings to add to the entertainment. Dialogues never make any moment melodramatic or too fantastical to believe, they give an earthiness, a realism to the story that plays a pivotal role in making the movie so good. Dhanush has acted brilliantly and is really a talent house to look forward to. Sonam Kapoor has also given a good performance. Abhay Deol is wasted. The supporting cast is brilliant with Murari and BIndiya. The cinematography is also up to mark capturing the aesthetic of Varanasi on the celluloid. A. R. Rahman excels with this pitch perfect music direction. Raanjhanaa is a must watch for the love story that it is, a love story of fall and redemption that is not a fairy tale that culminates in the union, but a portrayal, a canvas where different true colours of love are splashed to make something so beautiful that it will remain forever etched out in my heart for eternity. In spite of all the tragedy and heart breaks, Raanjhanaa is not a sad movie. It is a celebration of love. Maybe sometimes it is just enough to love."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "shvmbanerjee",
        "review_rating": "3",
        "review_title": "Awful",
        "review_detailed_main": "The movie \" Raanjhaana \" tries to portray love but ends up depicting another substance."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "lordjesuspabitra",
        "review_rating": "10",
        "review_title": "Rare to see such masterpiece in 2021.",
        "review_detailed_main": "It's all about true love, it's all about sacrifice, it's all about dedication, it's all about great story of younghood, it's about great writings, it's all about stong screen play."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "khatri_karthik",
        "review_rating": "9",
        "review_title": "A must watch movie.",
        "review_detailed_main": "Raanjhana is really a brilliant movie. Story was good and direction was good too. Acting was brilliant. Every actor acted really well. Dhanush, Sonam, Zeeshan Ayub and Swara Bhaskar played their roles beautifully. Dhanush made entry in Hindi Movieswith a masterpiece movie. You won't get bored of any scene in this movie. Dialogues were excellent and the dialogs made this film even more awesome. Abhay Deol played a small role in this film and as always he played his role well. The film was flawless. Many people could relate many scenes with their own life or story. This was the best bay Dhanush could have made his debut in the Bollywood. The climax of the film was the best part of the film or me.The film had 1 or 2 flaws like the overdose of slaps by Zoya in the didn't make much sense but the content of the story was brilliant. Overall this is a must watch movie for everyone out there."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sdreelin",
        "review_rating": "9",
        "review_title": "A movie with a great story to tell",
        "review_detailed_main": "This turned out out to be a surprise hit for me. This is a love story throughout, but nothing terribly mushy or boring and certainly nothing typical of a Hindi romance. There is substance and a great story line here that keeps you engaged with the characters (even the side characters are hugely entertaining). There are some really funny moments and a few sad ones all combined to make a great story with no one over all mood. Dhanush plays his role very well and is destined for great things down the road. He sets a great example of putting your mind to something and tolerance towards being wronged. This is one of Sonam Kapoor's better movies and her role is excellent. The sets are real looking and it's refreshing to see no CGI, fake sets or green screened scenes. There is lots of color here and very real looking extras. The struggles between caste, religious differences and class divide are presented well with nothing glossed over. There are no super hero antics and no weird breakout dance scenes out of whack with the story. The music is excellent and goes well with each scene. An excellent movie that stands above the typical Bollywood stuff that is cranked out year after year."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "ronakpatel1685",
        "review_rating": "8",
        "review_title": "Love Story with Soul",
        "review_detailed_main": "Treat to watch, excellent story told keeping the soul and portraying all colors of real life be it love,trust,madness,friendship,betrayal,repent. AR Rehman is another man who with his amazing musical beats doesn't want The crux of the story is nothing but the unconditional love be it for the Murari or Kundan's child hood crush and one-sided love till the end to Kundan(Dhanush) and for Kundan's love for Zoya's.\n\nThe climax is unpredictable and take you all way though your heart when it comes, the last 10 minutes dialogue is not to be missed for anything."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "toakhatun",
        "review_rating": "10",
        "review_title": "CRIMINALLY UNDERRATED",
        "review_detailed_main": "I watched it when I was a kid so rewatched it again now & I can't stress enough on how mind blowing it is. I honestly can't remember when was the last time I was this moved by a romantic story. It has so much to offer the making, cast, dialogues (best part), screenplay, music BUT the bestest of bests is the splendid acting by Dhanush. No one could do justice to the lead role as he did. I became a fan truly. & It was Sonam's best career performance. I don't know why people don't talk about it as much as Kabir Singh, Rx 100 etc cz in terms it's WAYYY better."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sandeep-17593",
        "review_rating": "9",
        "review_title": "Hindi film industry sure has came of an age",
        "review_detailed_main": "This flick is just so good with the riveting plot which keeps you bounded to the screen, what next, now what, it is the magic of cinema which once again has worked through the mesmerizing act of Dhanush, just super and the beauty of Sonam with brilliant inputs by swara and Murari. In one word the whole movie is just incredible....5 star ⭐ performance by the whole team. Accolades....."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "indicontent",
        "review_rating": "5",
        "review_title": "Watch the Raanjhanaa for Sub-Stories",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "sachishmaharjan",
        "review_rating": "1",
        "review_title": "Not recommend",
        "review_detailed_main": "Movie is all over the place. There is no flow in the movie. Not recommend only music is good."
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "minifs",
        "review_rating": "1",
        "review_title": "Toxic as hell",
        "review_detailed_main": "Worst movie i have ever seen!! Why the hell is it rated 7.6 ..i mean like wth very toxic.if u wanna waste your time and destroy your mood then u can surely watch but i would not recommend it to anyone!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "chahmedshadab",
        "review_rating": "1",
        "review_title": "Poor Direction with a good Soundtrack!",
        "review_detailed_main": "Very poorly written story; even more poorly executed in direction. Acting fair. Nothing makes sense in this movie. Extra-glorified everything. Definitely not worth your 2h26m!!!"
    },
    {
        "movie_id": "tt2359810",
        "movie_name": "Raanjhanaa",
        "movie_rating": "7.6",
        "review_username": "silvan-desouza",
        "review_rating": "",
        "review_title": "Superb",
        "review_detailed_main": ""
    }
]