[
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "inasinsikter",
        "review_rating": "4",
        "review_title": "I really wish I could love this movie\u0085 but I don't",
        "review_detailed_main": "I have read all the books. Entertaining young adult novels, easy to read and difficult to put down. Loved them even though I don't really fit the age category being over 30 and a mother of teenagers. However, I was looking forward to seeing the books come to life. I kept my expectations down, but still, I'm sad to say I was so disappointed. I really, really wanted to like the movie but it fell flat.\n\nI think it would have worked so much better as a TV-show, since the books are really about characters, and in the limited time that a movie has, there is simply no time to develop characters in the way the books do. A whole lot of time goes in to explaining who is who and what and why, and the story's twists and turns come too fast and doesn't have any time to build up any suspension at all. I found myself getting bored and wishing for the movie to end sooner than it did. It is such a pity that it was not developed for TV instead."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "5",
        "review_title": "another bad YA series",
        "review_detailed_main": "Rose Hathaway (Zoey Deutch) is a Dhampir. Dhampirs protect the Moroi who are kinda vampires. Rose had run away from St Vladimir's Academy with her Moroi friend Lissa Dragomir (Lucy Fry). They have a rare psychic connection. Lissa is the last of the Dragomirs and in line for the crown. They are brought back to the Academy where they face mean girls, convoluted politics, and the ever threatening Strigoi who are turned-evil violent powerful vampire creatures. The Moroi learn to control the basic elements while the Dhampir learn to fight.\n\nIt's yet another one of these YA series and more expositions of new terminology to get through. It's enough to turn off anybody. The story throws everything at the viewers. It's a jumble mess. The Academy is reminiscent of Hogwarts except less magical and less interesting. It's also got the modernity setup in a mishmash of styles. The mean girls aspect is simplistic. The writing is not really up to standard. Zoey Deutch tries to bring some interest with a jokey fast-talking sarcastic girl but it's been done better. That's probably the only part that holds any promise and differentiate itself from all the other YA series. It's as if Ellen Page's Juno got dropped into one those franchises. Even though she doesn't succeed, she's still somewhat interesting and the only reason why I would rate this marginally better than the other sludge. Very marginally..."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "shawneofthedead",
        "review_rating": "6",
        "review_title": "This won't go to the top of the class, but it's not a complete failure either.",
        "review_detailed_main": "In a world sparkled into submission by the Twilight phenomenon, it's hard to take yet another vampire high-school fantasy seriously. That could be one reason why the movie version of Vampire Academy - based on a best-selling series of novels by Richelle Mead - has been met with such overwhelming critical derision. Critics have blasted the film for being lazy, riddled with clichés, and overstuffed - only the last of which is strictly true. Actually, Mark Waters' film is a fun watch, featuring offbeat characters and relationships so interesting that you might find yourself wanting them to have more screen-time, not less.\n\nRose Hathaway (Zoey Deutch) is a Dhampir: a half-human/half-vampire girl born to be a Guardian to the Moroi - a race of peaceful, magical and mortal vampires. Rose shares a psychic bond with her best friend Lissa (Lucy Fry), a Moroi princess who's the last of her particular bloodline. Rose's task is to protect Lissa from the Strigoi: immortal, blood-hungry vampires with neither soul nor depth of feeling. But the Strigoi have nothing on the vagaries of high school: Rose and Lissa must deal with nasty pranks and clique politics, even as the conspiracy against Lissa gains a strength that suggests it might go deeper than anyone suspects.\n\nAmidst the rush and rage of high school, we'll meet Dimitri (Danila Kozlovsky), Dhampir extraordinaire; Natalie (Sarah Hyland), the geeky daughter of Victor (Gabriel Byrne), a friend of Lissa's family; and Christian (Dominic Sherwood), a brooding young man whose Moroi parents chose to turn themselves into Strigoi by taking innocent lives. Not to mention Mia (Sami Gayle), the catty girl who has it out for Lisa and the film's biggest 'stars': Olga Kurylenko as batty headmistress Kirova and Joely Richardson as Moroi queen Tatiana.\n\nIf that sounds like a surfeit of story, you haven't even heard the half of it. Vampire Academy is jam-packed with details, exposition and characters, all of them jostling for attention. There are complex rules and taboos surrounding the entire society, most of which are either shoe-horned awkwardly into dialogue or tossed quickly into the story as it tumbles by at a breathless pace. The characters' quips and depth get a little lost in the tumult. It's really what keeps the film from finding its feet: the ideas crammed into Mead's universe simply aren't given much room to breathe.\n\nStick with the film, however, and it evens out into a fun - if rather frustrating - viewing experience. There's a welcome cheeky bite (pun very much intended) to the script, which somewhat makes up for the unsettling choppiness of the story. Rose, too, makes for a spunky protagonist who's several worlds away from Twilight's tragically unprogressive heroine, Bella. She kicks butt, loses her temper, and reels off sarcastic zingers - all while demonstrating that she's every bit as capable as Dimitri and the guys around her. The element of romance that's an inevitable part of every high-school film doesn't grate as much as it might: the final moment between Rose and Dimitri is a heartfelt, surprising delight, and one of the most refreshing scenes you're ever likely to see in a teen movie.\n\nThe cast is mostly competent, with Deutch the clear stand-out. Carrying the entire, occasionally unwieldy film on her shoulders, she's hugely likable and natural on screen. Her compatriots fare less well, with Fry in particular feeling rather awkward and hamstrung in her part. Hyland, meanwhile, has quite a bit of fun subverting any expectations audiences might have of her based on her sassy airhead role in Modern Family. Byrne plays it straight, if a little tortured, while Kurylenko and Richardson seem to have wandered in from a high-camp pantomime.\n\nVampire Academy is very far from high art: it's too messily stitched together for that, bursting at the seams from a slightly nonsensical plot that often threatens to overwhelm the characters and their relationships. But it's also quite far from the travesty that most critics have suggested it is. There's something smarter and more enjoyable at work here, even if it sometimes gets buried beneath the machinations of its own script."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "raechel-carlsen",
        "review_rating": "1",
        "review_title": "Loved the books - Hated the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "A_Different_Drummer",
        "review_rating": "7",
        "review_title": "One of the most serious pacing problems ever...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Pinhead88",
        "review_rating": "",
        "review_title": "A Simply Fun Film!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "dolf_wega",
        "review_rating": "1",
        "review_title": "No, just no.",
        "review_detailed_main": "This is one of the worst based on a book movies ever made. If you read the books, you will be disappointed to the point of crying. The script is very poor. Of course you can't put everything from the books in a movie, but this was just bad. The cast also was a big disappointment, the actresses didn't match the characters at all, it's a big question to me why they were chosen to play them. Rose, my favorite character in the books, is completely ruined by this girl (Zoë Deutch or something I thought) that doesn't have any of Rose's style and sass. Her acting was also very poor. No, I cannot recommend this movie to anyone. Just read the books instead."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "the-awesome-von-grimm",
        "review_rating": "7",
        "review_title": "Good enough.",
        "review_detailed_main": "I can easily understand why people are hating on this movie so much. I have to admit that when I saw the pink high school cover of the movie, I didn't think I would ever watch it. But when I was bored out of my brains and I was looking for an airy, girlie movie, I found the trailer and it satisfied me enough to watch it. I must say that the story is quite cool, I haven't read the books and after watching this I actually want to read them. But I can understand that vampire or horror lovers find this a tacky 'another vampire movie' thing. It is predictable, girlie, the plot is bumpy and weird. Everything doesn't come together, the storyline only develops itself with more shocking revealings and predictable plot twists. But to be fair, if you are a teenage girl (or like me 21, and still in for teen movies some times) it can be amusing enough to watch. The actors look great, the plot isn't hard to follow and you can just watch it and be happy. :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "willwri14",
        "review_rating": "3",
        "review_title": "What film did everyone watch?",
        "review_detailed_main": "I'm sitting here writing this a mere four hours after seeing the film, and I don't really know what I expected - if I expected nearly two hours of tired tropes and poor writing, coupled with all around poor performances, I would be happy. If the film was well written, well acted, and a slight bit campy, it would be fine, but it just wasn't. The concept isn't original, the cast was all around shocking, excluding Victor, although there seemed to be a complete lack of evil-ferret-stroking; his character arc was rather predictable. Every single line was just exposition after exposition, with the occasional burst of teenage sass from Rose, which was extremely frustrating after a while. Quipping one liners is not necessary, especially after an hour and a half.\n\nEvery relationship felt forced, I didn't feel any connection to the characters, and I honestly couldn't care less what happened to them; they were not believable in the slightest. A good script would have helped, but the performances also assisted in bogging it down I actually enjoyed the concept, as someone who hasn't read the books. I liked the vibe I got from the film to begin with, but it felt extremely tacky. Everything felt like plastic, everyone's face was constantly caked with makeup, felt extremely superficial and tacky, and every backdrop was injected with a tonne of poor CGI. All of the special effects through the film were just poor, and were not nice to look at. The fire effects looked like the fire effects from Adobe After Effects.\n\nI liked what they were trying, but they honestly needed to up their game all across the board; budget-wise, script-wise, casting-wise, and the dozens of other issues with this picture. I almost got a 'it's so bad it's good' feeling, but it's heavy handed and poorly made throughout.\n\nI do not recommend."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "claudio_carvalho",
        "review_rating": "6",
        "review_title": "Hogwarts School of Witchcraft and Wizardry for Vampires",
        "review_detailed_main": "The teenagers Rose Hathaway (Zoey Deutch) and Vasilisa \"Lissa\" Dragomir (Lucy Fry) are best friend and escapee from the St. Vladimir's Academy for more than one year. When the guardian Dimitri Belikov (Danila Kozlovsky) from the St Vladimir's Academy and his team find the girls, they bring them back to the academy. Rose is a Dhampir, a good half human-half vampire breed that can eat regular food and are trained to protect the Moroi from the evil immortal vampires Strigoi. Lissa is a Princess of the Moroi, a good mortal breed of vampires that feed of blood from donors and is capable to control one of the four elements.\n\nWhen they return, the Headmistress Kirova (Olga Kurylenko) intends to punish Rose, but the old Moroi Victor Dashkov (Gabriel Byrne), who was a friend of Lissa's family, dissuades Kirova from her intent. Lissa dates her outcast schoolmate Christian Ozera (Dominic Sherwood) but unexpectedly she is threatened by someone that wishes to harm her. Victor's daughter Natalie (Sarah Hyland) joins Rose and Lissa to help them to seek out who might be the enemy.\n\n\"Vampire Academy\" is an entertaining fantasy with a story that is a sort of combination of \"Harry Potter\" with \"Twilight\". Zoey Deutch is gorgeous and charming and if the viewer sees this feature with low expectation, he or she might have a pleasant surprise. My vote is six.\n\nTitle (Brazil): \"Academia de Vampiros: O Beijo das Sombras\" (\"Vampire Academy: The Shadow Kiss\")"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "gregsrants",
        "review_rating": "1",
        "review_title": "Easily the worst film of 2014 so far",
        "review_detailed_main": "I had a glimmer of hope for Vampire Academy. The faintest bit of optimism that the film might actually be something that Ender's Game and Beautiful Creatures was not. I knew nothing of the books. Seven in total I am told from my vampire novel-loving partner. But surely it a major studio release couldn't be as bad as the Twilight films. Surely just out of blind luck, a vampire film targeting the tweens might actually be watchable.\n\nNope.\n\nVampire Academy not only fails to exploit my flicker of faith but it pulverizes any rational reason as to why the screenplay was greenlit in the first place. A monstrosity of a mess, Vampire Academy is a clear front runner for worst film of 2014.\n\nI could attempt to educate you on the script, but I am not quite sure I understood it all myself. In the first five minutes alone we see a car crash, get introduced to a vampire and her half-vampire/half-human guardian, force fed the supernatural bond between the two, learn that vampires can control the four elements and are given a description as to dhampirs, Morois and Strigoi's. Whew.\n\nZoey Deutch (looking very much like a young Rose Byrne) plays Rose Hathaway. She is a dhampir who is protecting Princess Vasilisa Dragomir (Lucy Fry) from Stigoi – an evil vampire breed created when a vampire takes a human life. Maybe more evil still are Vasilisa's classmates at the Vampire Academy who resent her return after being in the real world for the past year. It's like Mean Girls with fangs.\n\nThere is some sort of plot. Vasilisa is tormented by someone or someones in her school who sacrifice wolves and cats in an attempt to gather her attention. Vasilisa seems less concerned about those trying to kill her than she is about the boys in her school and her desire for acceptance. That brings a few Robert Pattinson look-a-likes into play that add nothing much else to the story than doing just enough to get us to the next DVD chapter without displaying any real character. There is also a love interest for Rose, large wolf dogs, more vampire mythology and Gabriel Byrne trying his best to ensure that he is not overlooked by next year's Razzie nominations.\n\nThe screenplay by Daniel Waters is the film's largest obstacle. The dialogue is Aaron Sorkin fast but written with a Uwe Boll sense of direction. Characters talk quickly to each other and then the scene will just cut as if we came to the end of a chapter and the director didn't know how to transition to the next scene with any sense of flow.\n\nThose holding out for strong action scenes to be the glue that holds you between naps can forget about it. Poorly choreographed and uninspiring hijinks are the norm as the film stumbles towards a final shot that suggests a sequel (it will not happen).\n\nVampire Academy might have worked as a television series. Why not. Dirty Little Liars Meets True Blood on CW. But this mess is easily the worst film of the year. At least until the next Adam Sandler film is released."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lori-918-6014",
        "review_rating": "9",
        "review_title": "Exposition from a VA Series Reader whose not a YA",
        "review_detailed_main": "I have read all of the VA series and enjoyed them immensely, mainly because of Rose. Rose Hathaway is feisty, determined, funny, and flawed, and it was always fun to see what she would do next and how that would land her in trouble. This story is not your \"typical vampire\" story. Everyone in the story already knows about vampires and the makeup of the society they live in. Nor is it a damsel in distress story. Rose already possesses strength and determination, although she does have impulse control issues. She is best friends with the vampire princess, Lissa Dragomir who is the last of her line, and extremely loyal and protective of her.\n\nThe movie and books have been compared to many other YA/vampire genre, but the story does not follow Joseph Campbell's Hero's Journey outline. Both Star Wars and Harry Potter did excellent jobs capturing the hero's journey, and the Twilight series followed Carl Jung's development of the soul and the anima/animus well. Mead does not use either of these outlines/archetypes in her books, and her storytelling provides a freshness, as well as giving a portrayal of strong women who look out for each other.\n\nPerhaps, the story could be compared to \"Thelma and Louise\" navigate a dysfunctional high school that just happens to have vampires and magic.\n\nNow for the movie itself: the tone and pacing of the movie are very much Rose and are true to the tone and pacing of the books. I actually liked the new scenes that were added to the movie – they did not distract in ways that other book-to-movies have done, but actually enhanced the story. I think the movie represented all the dynamics of the various relationships well, although I do wish the Rose/Dimitri relationship had been better developed. There wasn't the tension between them that there was in the books. And although I wish I could have forgotten the story (and the previews) during the movie so that I could have enjoyed the movie without all that knowledge, I did find myself getting lost in the movie.\n\nOf all the first time movies of various popular YA book-to-movie adaptations that I have read and seen, I think this movie was one of the better ones that has been done."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "louisapedersen",
        "review_rating": "6",
        "review_title": "Movie was okay",
        "review_detailed_main": "I have read the books, and read all the bad reviews about this movie before I watched it. Therefore I had NO expectations when I watched it, therefore I wasn't disappointed. Yes it wasn't close to as good as the amazing books, and the acting wasn't good. Although I know that some of these actors are brilliant in other things, which makes me think it's not really the actors fault for their poor acting, but rather the rushed scenes and writing of the scripts. Yes it was very rushed. In the book, each scene is so detailed and long, but here, each scene is very rushed. That's what happens when you make such a great book into a movie. If they made it into a tv series instead, I am sure they would have had more time to show everything, which means it would have been much better! In my opinion, that's what makes the movie seem cheap."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "gillianpeters14",
        "review_rating": "1",
        "review_title": "Don't watch, just read the books",
        "review_detailed_main": "I loved the Vampire Books so I was really looking forward to this movie but it was one big disappointment.\n\nThe script was pretty chaotic, if you haven't read the books yet you won't understand a thing. I know the books pretty well and even I was confused about which direction the movie was supposed to be heading.\n\nThe worst part for me was the acting. When you make a movie based on a book, the least you expect is the actors match the book characters by a bit. And Zoey Deutch is not a good Rose to me. Worst of all, her acting was really poor, she completely fell flat and it was almost painful to watch. The rest of the cast wasn't much better I'm afraid.\n\nI can only say in conclusion, I recommend you not to watch this but to go read a book instead."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "StevePulaski",
        "review_rating": "3",
        "review_title": "A witless slog of events and emotionless dialog",
        "review_detailed_main": "I'm a firm believer in an entering every film I watch with an open mind, regardless of whether or not it's regarded as one of the greatest films of all time or is one of the worst reviewed films ever made. Contrary to the idea that people think I enter some films more contentiously than others, what purpose is their for me to walk into a film with the mentality to dislike it? That's a waste of my precious time and money. I'll voice my expectations based on the trailer and promotional details that I see, but when it comes time to walk down the lengthy theater aisles to find a seat, press play on the DVD, or hit \"confirm purchase\" on Pay-Per-View, you can bet I'm ready to be entertained and spend my next hour and a half or two hours enjoying what I'm viewing.\n\nWith that being said, upon sitting through the first ten minutes of Vampire Academy, the latest teen movie that clearly had hopes of becoming the next big young adult franchise but fell well short of expectations, it was hard to maintain optimism much longer, but I tried. By thirty minutes, I was lost in the film's wooden dialog and variety of underdeveloped subplots, and by the hour mark, it was a struggle to stay awake. This is not only one of the worst films of 2014 just because of the fact that it takes a potentially interesting subject that could've been made to house some hilarious satire on teenagers and makes the material about as bland as a day-old bowl of oatmeal.\n\nThe film concerns a seventeen-year-old human/vampire hybrid (also known as a \"Dhampir\") Rose Hathaway (Zoey Deutch) and her friend Lissa Dragomir (Lucy Fry), who is a peaceful, mortal vampire (also known as a \"Moroi\"). The two escaped from their boarding school two years prior to where we see them now and are trying to live in our world as peacefully and as nonchalantly as they can. By a twisted turn of events, they are brought back to the Academy and realize that the vampire academy they left doesn't seem so different from the regular high school experience, with rumors, backstabbing, lies, cheating, and so on all taking place as prevalently as ever. While trying to combat these malevolent forces, Rose also finds herself attracted to her Dhampir mentor by the name of Dimitri Belikov (Danila Kozlovsky).\n\nSuch a premise - on paper - sounds as if it is establishing the building blocks for a wickedly funny and relevant satire on teenage convention; almost like a Mean Girls for a more artistic or mainstream crowd. However, it's a true shame that writer Daniel Waters sells the material short (or, given that it's based off a book, maybe it's not entirely his fault and he's staying true to source material) and concocts a dreary and overlong soap-opera that feels like Dark Shadows without half the wit or character-interest. In addition, Daniel Waters juggles so many different subplots here and characters, that all maintain the depth of the shallow end of the swimming pool, that it's easy to get lost in the shuffle of \"Dhampirs\" and \"Morois\" and other such trivial nonsense.\n\nThen there's the fact that the film is just not funny to boot. There's nothing worse than a bad movie than a bad movie that is boring and not funny. Vampire Academy runs for only one-hundred and four minutes which, when watching a fantastic film like Inside Llewyn Davis races past, feels like twice that length in this case. Dialog just exists, not really to spark a laugh or make the audience think, but similar to the dialog on loathsome daytime soap operas where it simply exists to exist.\n\nOne trend I'm tiring of with Hollywood and it's manufactured teen films, giving us what they assume we like rather than what we want is that for every great film we get that deals with teens (The First Time, Mean Girls, or Pitch Perfect to name a few) and growing up and fitting in, we must endure several lackluster ones, many of which trying to assemble new franchises with the worst possible products bearing the worst marketing campaigns (The Host and The Mortal Instruments: City of Bones) come to mind.\n\nVampire Academy was directed by writer Daniel Waters' brother Mark, who's career has been an up-and-down affair with directorial projects like Freaky Friday and Mr. Popper's Penguins popping up in there alongside the ingenuous and honest film Mean Girls, that every teenage girl in suburbia seems to treasure. Even those can quote Mean Girls like a Christian can quote Bible verses wouldn't bat their eyelashes at Vampire Academy, and for once, I don't plan on calling out their opposition or their ignorance.\n\nStarring: Zoey Deutch, Lucy Fry, and Dimitri Kozlovsky. Directed by: Mark Waters."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "stevendbeard",
        "review_rating": "",
        "review_title": "New Franchise in the Making",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "khanbaliq2",
        "review_rating": "6",
        "review_title": "A fast-paced and humorous supernatural romance that works.",
        "review_detailed_main": "After more than a month of movies that aren't worth seeing I finally had a good time at my local movie theater. Vampire Academy is the first good film of 2014. I, Frankenstein is entertaining fantasy action, but in terms of some quality it's Vampire Academy that's really worth seeing. There's a good cast, there's humor, there's a story that keeps one interested, and there's some action. At first there's some confusion about what's going on. It's because there are different vampires in addition to a setting that needs some description. After that, however, the film keeps entertaining until the end. There are several interesting characters. Zoey Deutch, playing Rosemarie Hathaway, is in the center of things. She's a feisty guardian but a loyal friend. Lucy Fry, playing Vasilisa Dragomir, is perfect as the girl with the royal blood. There's a growing love affair between her and Christian Ozera (Dominic Sherwood), but the more intriguing romance is the one between Rosemarie and Dimitri Belikov (Danila Kozlovsky). Friendship and romance aren't the central themes here though. The dangerous hierarchy of St. Vladimir's Academy is what Rosemarie and Vasilisa have to deal with. It's a good look at the struggles to gain social status in high school. The girls are tough but they still have to survive. This film adaptation of Richelle Mead's best-selling novel is definitely more interesting than Twilight (2008). Deutch had a part in Beautiful Creatures (2013), a film that I also liked. If you haven't seen Beautiful Creatures then see it. I recommend Vampire Academy too."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "golfgirl15",
        "review_rating": "1",
        "review_title": "Simply Awful!! One of the worst movies I have seen in a while.",
        "review_detailed_main": "When I saw the trailer for this movie I was less than impressed to say the least. I thought it looked cheesy and ridiculous and it turns out the movie was even worse than the preview. I have read every book in this series at least twice. I love them, they are probably some of my favorite books I've ever read. And that makes this review so hard for me to write, but honestly this movie is one of the worst I have ever seen to the point that I created this account to write about how horrible it was. Everything in this movie was cheesy. The writing was cheesy, the acting was cheesy, the special effects were cheesy, and the directing was awful. And on top of all that the movie as a whole made almost no sense. I went to see this with my best friend, she hasn't read the books, and she walked out having no idea what was going on and what the actual plot line was. Even with me reading the books I had an extremely hard time following everything that was going on because they jumped around from different things, they should have just followed the book. Which brings me to another point... they did NOT follow the book like other people have been saying. They brought things in that happened in the third book that had no place being in the first movie. You're not supposed to know what kind of magic Lissa has nor is anyone supposed to know about roses feelings for her instructor. I am so mad that Richelle Mead sold the rights for this movie. I think that if she would've held out for a better director and screenwriter this movie could have been almost as amazing as the books. It was so bad that it almost comes across as a spoof on the whole vampire genre. Overall don't waste your money this movie is far from worth it."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "crabtee",
        "review_rating": "7",
        "review_title": "Haven't read the book, but might.",
        "review_detailed_main": "I haven't read the book because after Twilight, I was so over the vampire trend. But I went to watch it anyway because the final trailer looked good and I always try and watch book based movies. I was surprised because it was actually good. To me it was. I'm not a critic. But for someone who isn't a fan of the books and haven't read them, I actually liked it. There was the usual cheesy lines and the love story, though there wasn't much of it. The romance, honestly, was downplayed. It wasn't the center of the story. And I am so okay with it. Plus points for the vampire puns. Plus Rose was actually a likable heroine. She's weak at some parts, but strong enough to kick ass. She's also sarcastic that it gets annoying at times, especially the voice overs, but the snark is funny enough that it's easy to ignore it."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "didnt_doit4u",
        "review_rating": "3",
        "review_title": "Read the Book the movie blows!",
        "review_detailed_main": "Really the book is much much 100% better. The movie was awful, choppy crap casting. I realize you can't put everything from a book in a movie but seriously this movie was choppy at best no smooth flow. Why did you have to muck the movie up this badly? Rose was supposed to be beautiful, curvy, Turkish decent, sassy. This movie made here seem weak and in the books she was not weak. Lissa was supposed to be charismatic and lovable/likable. The actress didn't pull that off. Dimitri was supposed to be a Godlike guardian that liked to read western novels. Missed the mark there. Bad movie makers bad naughty shame on you They suck at school and you suck at movies. ---Le sigh"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nrdpura",
        "review_rating": "6",
        "review_title": "Movie Review from Must Read Before You Die",
        "review_detailed_main": "Saw VAMPIRE ACADEMY last night!! So awesome that Richelle Mead's work is on the big screen! By the end of it though, I had slim hopes that this is going to make it into all 6 movies if they do one book per movie. Yeah, I guess vampires are in right now and while Vampire Academy was such a great read, I don't see how people who haven't read the books are going to see if for the awesomeness that it is.\n\nEverything was jammed pack. My bf who hadn't read the books said it felt like things were going way too fast. There were a lot of things they were trying to fit in there and he could tell many things were probably lost in the movie that happened in the book. It's been a couple of years since I read the first book and there were things happening in the movie where I just wondered, How did they come up with that? I was disappointed that Rose wasn't as bad ass in the fighting department but I'm probably remembering the Rose she turns out to be :) Overall, I do like the actresses who played Rose and Lisa. Rose is hot and she does look like she can kick some ass... eventually. Lisa is cute and sweet.\n\nWhat I didn't like is Danila Kozlovsky who played Dimitri. I wish he didn't look so old and wanted him to have a muscular slim frame. But the worst is his face - just not attractive to me at all.. whhhyyyyyy did this happen?!?! So I looked up Danila online for more pics of him and he's got some good looking pics out there! Why didn't he look like THAT in the movie?! I hope if there's a second movie, they do something with his hair to bring out his hotness.\n\nNow Dominic Sherwood as Christian - hubba hubba! That's what I'm talking about people!! :) :) :) I really enjoyed this movie a lot. It made me laugh and I loved seeing this set of literary characters on the big screen. I hope there is enough interest in it from the public to make it into 5 more movies. Very cool that lots of my favorite books are coming out soon. I saw a preview for The Fault in Our Stars and will definitely be watching that one. Also looking forward to Divergent!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "paul_haakonsen",
        "review_rating": "3",
        "review_title": "It sucked alright...",
        "review_detailed_main": "Clearly I wasn't in the target audience for \"Vampire Academy\". This movie is clearly aimed at a young audience who is still starstruck because of \"Twilight\" and seeing vampires as something of a pop culture phenomena.\n\nThe story is about vampires - well, sort of in the sense that they need blood to stay alive. There are two species of these blood-drinkers, one good, one bad (duh!). Having run away from the vampire academy, the princess of vampires is living in the mortal world with her dhampir protector. But the people from the academy soon catch up with them, and they have to go back to the academy. But a war is brewing and a conflict is lurking on the sunless horizon.\n\nStorywise, then I guess \"Vampire Academy\" was adequate if you are in the particular target audience. I, however, found it to be laughable and stupid.\n\nThe effects in the movie were good, I will say that much. But it just didn't cut it enough to lift up the movie for me.\n\nAs for the people on the cast list, well, people were doing good jobs with their given roles.\n\n\"Vampire Academy\" is another addition to the teenage vampire fanatic wave that was sparked with \"Twilight\", despite the movie even throwing a punch at the sparkly vampires in \"Twilight\".\n\nIf you are a teenage girl, then by all means go for this movie. Otherwise, it is not really worth the time and effort."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "dogtag0611",
        "review_rating": "8",
        "review_title": "Well Done",
        "review_detailed_main": "I first want to say that I love the books and I have been a fan for about 7 years now. I was apprehensive when I saw the trailer. I was not very impressed and I was disappointed but I saw the movie anyway.\n\nWhen I fist saw who the cast was I was very unsure. I did like Zoey for Rose from the start, but I did not quite like the others. After watching interviews and stills of the cast I warmed up to Danila (Dimitri). I did not think Lucy fit the part for Lissa but after watching the movie I believe she did a good job. I was pleasantly surprised. I tried not to compare the cast to what I had imagined because they could never live up to the characters we, the fans, create and picture in our heads. After I got over this I really enjoyed how they portrayed the characters.\n\nI had heard that the movie was really close to the book before I saw it. The movie is close to the book, but the scenes are shifted. The sequence is out of order slightly compared to the book. Such as a scene that happened in the end of the book is in the beginning of the movie. There are also quite a few scenes added, mostly action. Some of the scenes where very nice and others were kind of confusing and could have been left out. I absolutely loved one of the ending scenes between Rose and Dimitri that was added. I would have loved to have read that in the book.\n\nCons: The movie was very fast paced and it really did not work too well. A lot of the scenes where rushed and transitions were fast. I feel as though it should have been slowed down a bit and the characters more developed. The book had a lot of information and almost every detail was important so I can understand why it is fast paced.\n\nPros: I loved how well Zoey did Rose's sarcasm and hot temper. I think she did well and got her spot on most of the time. Danila and Zoey had pretty good chemistry and worked well together, which is pretty important. I don't believe his character was spot on but it worked for the movie. Plus his rather shy smiles were adorable. The action scenes were cool and entertaining. I also enjoyed the way the school was designed, it was Gothic and still had a modern high-tech touch to it.\n\nOne of the main reasons that I love these books (and the movie) is Rose's strong character, her loyalty and passion. She is not a damsel in distress, she is constantly growing but she also knows when to ask for help. We don't see strong women in books much, and when they are they depend so much on the male romantic figure. Rose has a perfect balance of all these. She loves Lissa so much and would do anything to help and protect her, which is what the books are mainly about. It really bugs me when others compare this story to Twilight and other vampire movies. They are not the same and the only thing they have in common is that there are vampires (which they don't even call them that).\n\nI think the movie was great and there is room for improvement but I enjoyed it all the same. I really hope others can see past the flaws, because everything and everyone has flaws. I would watch the movie again and again.\n\nI would give the movie a 7.5 rating."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "beatroute-star",
        "review_rating": "7",
        "review_title": "Now, you probably don't get this, because you're probably not trying...",
        "review_detailed_main": "I watched this movie genuinely thinking it was going to be rubbish. I didn't know who the creators were or that it was linked to Mean Girls or Heathers at all. The film was put on, I was sure I was going to mock it the whole time - if for no other reason than the fact that there is a vampire named Dimitri. I was a little humbled because I liked it.\n\nLots of people have little reasons why they psychologically can't handle it. The fact that vampires have been shoved into little clichéd boxes - vampires must be soppy, sexy or scary - and if it doesn't hit the mark, it's bad. If it does hit the mark, it's often bad anyway. The comparisons to Twilight too could colour the lens of perception, as with prior expectations of the book.\n\nI had very few of these. Again, all I had to go on was that there was a vampire named Dimitri - for real - and that was going to keep me in stitches for the night.\n\nNot the case.\n\nI've read some negative reviews that pan the movie, but the reasoning seems to be very sparse. 'Boring' I hear. 'Waste of time'. 'Twilight money-grabbing knockoff'.\n\nRubbish.\n\nI'm gonna woman feelings you here. We were given a story about a badass chick who... becomes even more badass. A girl who doesn't care too much what people think and who isn't bad to her friends. A girl who does what she wants and whose integral role is to protect her best female friend. That's right; no best mates, comrades, football buddies here. A posh princess alongside her bodyguard are our focal point.\n\nBoom. I hear testicles exploding.\n\nAlright, that was a bit mean, but let's be honest; this isn't something either or any gender is used to seeing on film. If we see women in film they are either a) on a journey controlled by a male/desire for a male (Frozen and Tangled, both with strong heroines who are effectively led around like donkeys by their spirit guides/future husbands) b) women who struggle against oppression (let's take Hitchcock's Rear Window and Vertigo. Both have women whose suffrage is represented) c) girls without gender (heroines who could be heroes. Not a bad thing, but I am not Katniss Everdeen. I love dresses. I like makeup. Girls do not have to be men to be fierce).\n\nI found the film funny because it didn't hide its ultimate representation of females. Teenage girls are just about the most mocked people around. Alright, they're not avidly discriminated against, but everyone loves to tease them because the things they love 'don't matter'. Popularity? Doesn't matter. Prom dresses? You're SUCH a teenage girl. Rumours around your school? God, why did I have to give birth to a beautiful baby who would grow into a TEENAGE GIRL. Heaps of the most female centric movies work only because they work with convention and ultimately mock the insignificant world of the teenage girl. The 'Vampire Academy' works with this world, works with its characters and doesn't apologise for who they are, their age or their genders.\n\nNot only did the role of the male work only as a mirror to the all important aspect of the female journey, but the girls held the power. Rose booty called Jesse, Rose blew off the nice guy, Rose confronted Dimitri. This is a rare film where what the female character says IS the plot. Decisions are made by these women considering their own and each other's feelings first and foremost, and I think that either goes right through some people, or outright niggles at them.\n\n'I'm not sexist. I love Mean Girls, and that was about girls.' When boys play girls or pretend to be them, they jut out their hips, put on a lisp and immediately think of something critical to say about an outfit, a 'slut' or a 'hottie'. Girls do this about OTHER GIRLS. The image people have of girls is very much what was poured into Mean Girls and what lent it it's success, as is the case with Bride Wars and other such films. We are not used to seeing women get along, kick butt and drive storyline all by themselves. We are not used to seeing boys float in and out and not know if the girl has already internally attached his last name to hers. We are taught to take glee in the conflict of women: women make men fight, women make women fight.\n\nThe movie was a heap of fun and never heavy. It was honest and Rose had the sentiments of a real girl.\n\nIf you've seen this film and thought it was boring, I urge you to reconsider why you thought this was so.\n\nIf you haven't seen it, go in and enjoy it. It's fun. It certainly breaks away from some of the fundamental sexist approaches to film."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "biyanbayyinah",
        "review_rating": "1",
        "review_title": "It went too fast, way fast. Probably wont be a sequel",
        "review_detailed_main": "I'm a hardcore fan of this book, and when I watch the movie I was like seriously?, all those scenes were too fast. and honestly, Mark Waters is my favorite director, I love Mean Girls, and freaky Friday, and stuff. But this isn't even in the same level with mean girls. And the jokes were awful, this isn't even a comedy, this isn't even an action, and this isn't even a romance. they just failed it. If they keep making VA like this, the sequel will be just as plain as this one. I'm sorry saying this, I know our perspectives are different, but this is definitely one of the bad movies of the year, if you don't see that, then you don't watch enough movies in your whole life. I'm 110% a fan of the book, but the movie... is just disappointing. But like the ending cause it's the only thing that they made it right."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Back to school",
        "review_detailed_main": "If you think the tag line (suck at school) is funny, this may appeal more to you than to others. But while this isn't the worst movie of 2014 (I think someone should either watch more movies or at least be a bit more fair), it is filled with clichés from beginning to end. Plus it has a target group and it does fill the needs of that special group more than anything else.\n\nI don't think I have to spell out to whom that is aimed at (the movie itself quoting directly or indirectly Twilight many times). But if you look past that (or maybe just because of that), you can see an effort to make this light and fun at the same time. Actors can not really be judged by this alone, but they don't really put the breaks to the movie, so that's a positive. You know what you're getting, don't complain about it later ..."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ozera-dhampir97",
        "review_rating": "",
        "review_title": "Vampire Academy: My (no spoilery) review!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ldickinson-1",
        "review_rating": "7",
        "review_title": "Great new twist in the vampire genera",
        "review_detailed_main": "Loved this movie. It is a kind of 'Who's going to do it' written in the style of a 'Who dun it'. Lots of plot twists and turns and fun trying to figure out who's who. Complete with red herrings. Don't blink or you'll miss clues. Honestly, most of the writers who gave it bad reviews admitted that they didn't understand the plot. You don't need to read the books to follow because I've never read the books and I had a ball. Be warned you can't sit back in this movie; you have to stay alert if you want to get the full entertainment value. A great thrill ride getting to the end and 'oh my gosh'does this movie ever need a sequel.\n\nI like the casting. Zoey Deutch and Lucy Fry had good chemistry. For a movie made to be a little over the top all the acting stuck pretty much to the parameters of the film so no complaints in that department.\n\nThis movie was made to be fun and it delivered."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "sashoh",
        "review_rating": "1",
        "review_title": "Don't just don't watch this",
        "review_detailed_main": "I rarely write reviews, but when I do, they are either for a very good movie or for a horrific one. This is for the later. Oh my god, this movie is so awful that Twilight might be considered a better movie and this is still generous. But if for some very strange reason you like Twilight (REAAAAALLY strange reason, for such a bad movie) then lower you bar even more. The plot is ridiculous and simple. The acting...looks more like a high school tryhards. All in all, consider yourself lucky if you haven't seen it yet, if you do - I pity you. And for the love of god, why is the IMDb rating so high !!! It totally screwed with me to watch it"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "losti_nosti",
        "review_rating": "6",
        "review_title": "Disappointing but enjoyable",
        "review_detailed_main": "I had high hopes as it's one of my favourite book series but unfortunately it fell short. It had so much potential to be a great 'Hunger Games' like production but instead had a low budget feel. Even though the B grade feel was disappointing it was still enjoyable and closely aligned with the book.\n\nThe casting was all on point except for Dimitri. The movie Dimitri looked too old and was slightly creepy, he didn't have the book versions looks or personality and I didn't feel the chemistry between him and Rose which was probably the most disappointing part. Rose, Lissa and Christian's relationships were spot on and Mason couldn't have been casted better.\n\nAll in all I enjoyed it I just wish it had a higher budget feel."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "2",
        "review_title": "A trash fest populated by excruciating actors",
        "review_detailed_main": "I suppose the premise for VAMPIRE ACADEMY, the latest vampire-themed young adult film adapted from a book, is TWILIGHT meets HARRY POTTER. That's certainly the theme here as the plot involves age-old aristocratic vampires, both good and bad, and the students of a vampire academy who swot up on vampire lore.\n\nWhat it amasses to isn't very much at all. This is a weak emulation of a typical American high school movie complete with grating British accents and some truly horrid performances from the young cast members. Indeed, some of the actors in this I found completely excruciating, particularly the leads. Their dialogue sounds hollow and feels false, which is little surprise considering how it aches to be oh-so-hip and down with the kids.\n\nAs is usual for this genre, a couple of old-timers are wheeled out like forgotten waxworks; Joely Richardson and Gabriel Byrne are the ones foolish enough to sign up in this case. Olga Kurylenko is here too, although she has so little screen time that I wonder why she bothered showing up on the day. The whole film is a joke from start to finish, with rubbish direction and some of the fakest fight scenes I can remember watching. The only wonder comes from wondering why they bothered shooting it in the first place."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Alyy33",
        "review_rating": "7",
        "review_title": "A fun, raw portrayal of a wonderful book",
        "review_detailed_main": "As a huge fun of the book series, I've gone in to see the movie with high expectations. I love the story and the characters so I was beyond excited to finally see this adaptation. Is it a perfect movie? No. But it's raw and stays very true to the books. It's obvious that the movie didn't have a high budget like some of the other YA adaptations out there, so if you're looking for amazing visual effects, this isn't a movie for you. I actually think they did well considering. What truly spoke to me the most about it is that they kept so many scenes from the book untouched. As a fan I really appreciated that. I liked the dialogue, the humor wasn't too much. It was rushed at parts, but it didn't bother me. The cast was amazing. I loved Zoey as Rose, she was so much like Rose in the books. Danila was also perfect as Dimitri and their chemistry is very believable. Dominic as Christian also pleasantly surprised me. Overall it was a great adaptation and is a must see for every Vampire Academy fan out there."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "reggi3000-921-569207",
        "review_rating": "1",
        "review_title": "Very Disappointing!!!",
        "review_detailed_main": "I know movies are rarely as good as the book due in part to time issues, therefore lack of details. This movie really tested my ability to not walk out. The two largest issues for me were the casting and the poor acting but the special effects, like the dogs, were just poorly done. Ahh...Demetri\u0085what a let down! The worst casting of all!!! Some of the characters didn't even match their descriptions in the book! I was quite disappointed that the movie did not start at the beginning of the story and was narrated quite a bit in the beginning. It seemed to me to be a low budget film. That's really too bad because the book series is quite an awesome page turner! I will not see the sequel(s) and would not recommend seeing this rendition of the VA series even when it's released on DVD."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hjbrat16-918-691134",
        "review_rating": "10",
        "review_title": "Everyone's a Critic",
        "review_detailed_main": "I have read the books. I love Richelle Mead's books-and when I say this, I mean it. I have read every one of her books (I STILL can't believe Georgina Kincaid doesn't have her own show yet!). However, placing my love for her as an author aside, I went to see the movie with the notion that it would be terrible and cheesy (you saw the main trailer right?!). It was nothing like what was in the trailer. It was snarky, spunky and over all a good film.\n\nHOWEVER- I'm sure you've read otherwise. I've seen the critic's reviews. I've read about how terrible (very few) people thought it was. Let me explain it a little. They have NO idea what they're talking about! (okay, that's my opinion and I don't mean to invalidate any one else's but c'mon, it's awesome!) As far as visual affects go, it's about as bad as any lower budget film. Seriously does anyone REMEMBER the first Harry Potter? Look at the last one-total difference. Budgeting can change a film completely. Which is Exactly what we will see happen when this series really takes off. If you haven't read the books, I strongly recommend talking to someone who has, they can explain things you may have missed or don't quite understand. I don't think that is a flaw in the movie either. We see films that aren't adaptations from novels and miss things, or don't have any clue what really happened until we watch it again (maybe twice?). Who hasn't watch a film again and said 'OH! I get it now'. To wrap this up I'd like to say that this movie is done really well.NO it does not EXACTLY follow every sentence in the book, but they've summarized and portrayed elements that were probably really difficult to write/act/direct. I also take comfort in the fact that the next books just get better! And I imagine that over time, the movies will get larger and larger budgets, and will get new writers and more production staff (in addition to the current ones, not replacing) in order to create the world in it's entirety for the movie audiences. It was a great film- don't knock it till you try it, at least that's what momma says ;)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "face-819-933726",
        "review_rating": "6",
        "review_title": "When the name of the movie is a derogatory term what is the message?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jacksakes",
        "review_rating": "5",
        "review_title": "Confessions of an over-the-YA-aged, non-VA-book reader",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "kimberleymorgan03",
        "review_rating": "1",
        "review_title": "Honestly, the WORST film I have ever seen !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hernandez-yare",
        "review_rating": "",
        "review_title": "So sad... This movie was too rushed!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "angel_saciel",
        "review_rating": "7",
        "review_title": "Well done popcorn flick",
        "review_detailed_main": "Yes, the movie is cheesy. But I have the advantage on not having read the books and enjoying it unbiased. The movie screams \"Young Adult novel adaption\" in all directions, but it is absolutely refreshing in a world full of YA dystopias. The movie is fun and light-hearted. The actors are great (especially Rose is reminding me of a younger Detective Rizzoli and Lissa is full of grace) and very likable. The movie feels a bit rushed, it tries to put a lot of plot points into a movie that would have felt better in a series' season. It is clear this is a book adaption and as such you have to fill in some blanks by yourself, like the road-trippy shopping mall event that distracts from the main plot and feels out of place. It's not the most genius movie and some things are quite obvious, but it is a _well done_ movie with good characters, entertaining interactions, and a nice narrative. I was afraid some of the characters would fall flat (especially Dimitri) but it turned out they were well characterized. The two main actors are especially good as presenting two girls who share a deep and joyful I thoroughly enjoyed it for what it was - a leisure time flick, not Shakespeare. As such I can recommend it without a doubt. It was a lot of fun and bettered my mood."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hannahlesueur",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "Honestly, I wasn't too sure what to expect from this film. The vampire academy series is my favourite book series and I was apprehensive as to see if the film would ruin it. I gave it a go however, and within the first 7 minutes I had to switch it off. The characters were nothing like I expected and the chemistry between Dimitri and Rose didn't feel real. The special effects were not that great and I feel like if I had continued on with the film I would've been even more disappointed. I hope that a sequel is not made in all honesty, because I cannot stand the cast as they do not appropriately fit the books portrayal. Sorry to everyone that enjoyed the film, but if you are like me and have read the books before watching the film, i'm sure you would agree that the movie is awful and poorly written."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hannahmiley11",
        "review_rating": "6",
        "review_title": "I don't really know how I feel about it.",
        "review_detailed_main": "As the title says I'm torn. As a major fan of the books I was disappointed with the changes. I know that it can't be exactly like the book but there were weird changes that really didn't do the movie any good. And it's all the little things that add up in the end that threw me off. I really enjoyed most of the acting. There were pretty spot on except for the actress playing Lissa. Lissa's personality got changed in the script and the movie made it seem like it was all about high school gossip and stuff like that. They didn't really concentrate on Rose and Lissa's deep relationship. And they skipped all the parts were we get to see the vulnerable side of Lissa and Rose. And I felt the movie was way to rushed. Like they just breezed through everything. The connection with Rose and Dimitri was pretty cute. , I felt giddy when they were together. But all in all i liked it. I didn't get the chance to love it like I did the movie. Hopefully the next movie will stick to the books more closely."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "elmerflp",
        "review_rating": "1",
        "review_title": "This movie sucks! No, really, it sucks! This film would need a stake through its heart, if it had one.",
        "review_detailed_main": "No spoiler alert is necessary here because you can see what's coming about 14 miles off; it's a tiresome 100-minute mash-up of Underworld (which was pretty good), Harry Potter (which was somewhat better), Twilight (which was marginally better), and Mean Girls (which was awful, but not as awful as this movie). You know it's going to be bad when the opening credits list Harvey Weinstein, that Hollywood, ruling-class, plutocratic, anti-gun zealot, who's very comfortable with his own armed guards, but thinks us commoners should not be allowed to own firearms for self-defense. Oh the humanity! Pouting actresses with bee-stung lips and hunky actors with sinewy pecs spout quirky lines and moon after each other. This film was so bad I couldn't tell if it was satirizing the movies it's derived from, or if it was meant to be original. Avoid this turkey like a vampire shuns daylight! Zero stars!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "sdaniels-rosie",
        "review_rating": "7",
        "review_title": "My Motto: If the movie is half as good as the books, it's worth seeing",
        "review_detailed_main": "My Motto: If the movie is half as good as the books, it's worth seeing.\n\nFirst off: THE BOOKS ARE INCREDIBLE, so, off to the movies I went.\n\nSecond: I walked into the movie knowing full and well that there was no way possible that they could meet the standard the books made.\n\nThird: This movie was made by the creators of Mean Girls so you can expect a little of that flair.\n\nFourth: In my opinion, the trailer actually makes the movie look bad. The movie was WAY better than the trailer was.\n\nFifth: Even if you read the books, just go see the movie. Go to a matinée if you are opposed to paying a lot to see this.\n\nOh, and the movie made me want to go re-read the books. Go Vampire Academy!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ihq-30-307897",
        "review_rating": "4",
        "review_title": "They suck - not only at school",
        "review_detailed_main": "genre: Vampire teenies\n\nthe plot: interesting setting. There's also a lot going on in the background (there has to be a huge plot!). However, some details are not explained, some are rather stupid. Still not bad.\n\nscreenplay: Uh... some strange dialogues, wrong cuts... not professional enough for a theater screening. Mediocre.\n\naction scenes: Just poor.\n\nacting: Really poor. Maybe some international versions are better... (dubbed voices). However, if you liked Captain Janeway in Star Trek, you might have a different opinion here.\n\nanimations: Not always convincing, but OK.\n\nsummary: TV show quality. If you love Vampires, you should give it a try. However, there's really no need for a sequel."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "re-munoz94",
        "review_rating": "8",
        "review_title": "A Entertaining Movie with Spunk and Blood",
        "review_detailed_main": "I too walked into the movie thinking it was some sort of twilight based movie. However, I enjoyed the overall film for its outlandish humor and lead actress. Some parts where a bit shocking but nothing too far from crossing over a certain line.\n\nI have never read a single book of this series; although the movie does a wonderful job explain exactly what is going on and who everyone is. Vampire academy from times gave us teen angst and did over sexual most of its cast in some scenes. So if they are planning a sequel please don't shove sex right in our faces. It thought it was a movie that had potential to be a bit darker than just being only surrounded by high school problems. But the whimsically teen side didn't keep this movie from the mild gore. I would rate this movie an 7/10. Would I watch if there was a sequel? The answer is yes because this first movie attempt wasn't as big of a letdown as I had anticipated. The next movies if any have the possibility to break away from the usual \"Teen Drama\" and not hold back on the blood and guts.\n\nIf this franchise doesn't want to be compared to twilight I suggest you not make it the usual storyline. Girl and two guys, the two guys want her, she is mortal and they are supernatural, not blood all glitter. So overall this movie had wit, spunky humor, mild gore, provocative scenes, high school drama, and fangs. An overall good recipe so far for the freshman vampire movie, word to the wise for the sequels if any, just step it up and leave us wanting more."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "PotatoChips9",
        "review_rating": "6",
        "review_title": "Try it, you just might love it",
        "review_detailed_main": "There have been a lot of negative comments about this movie but really, it was not that bad. It was actually great! It even reminded me of Harry Potter(except for the whole vampire thing). I think people got the wrong impression on the film because of its not so good trailer but it was far better when you watch the actual film. I cant wait for the sequel. Hopefully there'll be one.\n\nI am telling you, try it, you just might love it. Watch it and judge it yourself. Believe me, because i am one of those who didn't really wanna watch it but ends up loving it. Thanks to my friend who literally forced me to watch it or else i would have missed it awesomeness.\n\nAnd by the way, Rose Hathaway(the lead) is probably one of the coolest characters ever. I love her!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "gracehoggard",
        "review_rating": "1",
        "review_title": "Wow ever heard of subtly guys",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lynndlt",
        "review_rating": "5",
        "review_title": "Vampire Academy sucks!",
        "review_detailed_main": "I was very excited waiting to see the movie, but It was a big disappointment when I started to watch it, The movie really sucks, in each and every way, the script, the direction and the acting is so lame, they look overreacted. I read the books and nothing to do, I know, already, some liberties are taken when making movies but this really exceeded that, considering that in the first book that is based assumes many of the facts happened that way and they knew not many details from the first book like in which element Lissa's specialize or how Lissa finds out about the relationship of Rose and Dimitri, a lot of that happened later in the other books. They are very explicit on some things and others are really absurdities that have no coherence. It's a shame they have destroyed a book that liked a lot of people and was looking forward to see it in the big Screen, to turn out in this crappy movie."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "california_sunshin",
        "review_rating": "",
        "review_title": "Love At First Watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "collagebrat",
        "review_rating": "7",
        "review_title": "Wanting more",
        "review_detailed_main": "I agree i have seen the move 6 times now and read the books 3 times each. Great sory line and every one knows that the mostion picture is never as good as the books. Yes it wasnt as good as i thought it might be and yes it could of been better but i still love it and want more. Give us a sequel or a tv show. PLEASE PLEASE PLEASE."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "WackyHoney",
        "review_rating": "1",
        "review_title": "Sweet sassy molasses, this was terrible!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Gimmickthegnome",
        "review_rating": "6",
        "review_title": "Let's look at the positives...",
        "review_detailed_main": "This is not a great movie, but it's certainly not bad. Here's some of the good that may have been overlooked...\n\nYou immediately get the notion that there is a lot of information to relay to an audience that may not be familiar with the books (myself included), and the movie does a fine job of presenting said information in easily-digested pieces that even a guy like me can accept.\n\nThe 2 teenage girl protagonist characters are refreshing examples of teenage girls with enough depth that you actually care about them. (I can thankfully report that they are far more role model worthy than \"Twilight's\" Bella character.) Rose, the rebellious fighter-type, kicks ass, has a quick wit, and bends the rules without being too unrealistic. By contrast, Lissa is the (literal) princess-type who is a reluctant heir, well-mannered, and amazingly vulnerable despite being powerful in her own way. These two characters create a fine base to build the movie around.\n\nThe story itself unexpectedly turns into a mystery that, ultimately, is satisfying when all is said and done.\n\nThe cast, on the whole, does an 'okay' job, but it's lack of strong, well-known, well-established actors may have hurt this movie's quality overall. The shining star in this movie is clearly Zoey Deutch who does a amazing job at believably and perfectly portraying a girl who can kick butt, crack wise, be an honorable protector, and still be a fallible teenage girl at the end of the day. I look forward to seeing more of her.\n\nThis movie is far from perfect, but by the end of it, I didn't feel like punching someone in the face for it. (Which, I must be honest, is typical for this movie genre) I have seen thousands of movies and I know BAD movies. This is not one of them.\n\nIn the end, \"Vampire Academy\", while only being above average, at least presents a unique vision into an over-saturated, over-visited intersection of teen fiction and fantasy. 6 out of 10."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "antonija_94",
        "review_rating": "1",
        "review_title": "I love Vampire Academy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hjboon",
        "review_rating": "6",
        "review_title": "I like YA movies and it has a nice flow",
        "review_detailed_main": "This is a good YA movie. It is nothing (nothing!) special, but it has a nice flow. It made me wonder for part 2... The storie is as empty as the books, but that doesn't mind. It is made good!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jaunmack",
        "review_rating": "1",
        "review_title": "Great comedy!",
        "review_detailed_main": "Best comedy I've seen in a while! As a real fan of the books, and who has actually read the books, I can say that this is the worst adaptation of a book e.v.e.r. if you ignore every detail of the books and go in not expecting a story line or good acting then you may just find that this is the best comedy ever. Incredibly funny film, but do need to make it clear that we were laughing at the film not with it. If i was the author I would be ashamed of this film, more so if I was an actor in it. Just to make this really clear, I wouldn't expect a sequel.\n\nWORST MOVIE EVER.\n\nPS I want my money back.\n\nPPS book is still good."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "AnzRoxx",
        "review_rating": "10",
        "review_title": "Vampire Academy is too good to not get a sequel.",
        "review_detailed_main": "Vampire Academy is finally the YA adaptation we've all been waiting for. After disappointment after disappointment in the category, Vampire Academy finally did it all right. Not only is Vampire Academy a faithful adaptation to the book and should have all fans captivated, it is also a great flick for non book fans of all ages. Action, humor, and an incredibly portrayed friendship. Everyone in the theater laughed. The ladies behind me swooned for a certain Russian lead. People were on the verge of tears, I'm sure someone let a few slip. It was enjoyable for all people in the room. What I always praised about Richelle Mead's series was the focus on friendship as opposed to romance and the comedy. This movie does all that perfectly (director of Mean Girls, hello.) while still portraying the dark content from the books (writer of Heathers, hello.) I will say there were some pacing issues and sometimes the transitioning to a new scene was off, but that is the ONLY thing and quite honestly it didn't bother me too much or take away from me enjoying the film, so it was not that big of an issue. Was this a perfect adaptation of a great book? No, but does a thing exist? This was a very faithful adaptation, however, and as a book fan I can honestly say I couldn't imagine the movie going any other way. So, I'm here to tell you this adaptation is TOO GOOD to not get a sequel."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "TdSmth5",
        "review_rating": "7",
        "review_title": "Good movie for teens",
        "review_detailed_main": "A family is on a trip, there's a car accident and all but the teen girl and her friend die. Next, we are quickly introduced to the entire mythology. There are good vampires to which the family belonged and some of them are royalty. There are bad vampires out to kill them. Then there are half vampires/humans called guardians whose mission in life is to protect the good vampires and kill the bad ones. Lissa, the survivor of the crash is a good and royal princess vampire. Rose, her friend, is her guardian. They are living out there in the real world for reasons explained later, and are in constant danger of being attacked by the bad ones. One night they are attacked, but it's more guardians who take them back to where they belong- Vlad's Vampire Academy. They are attacked on the way there by bad vampires.\n\nTurns out the VA is no different than a human high school with cliques/classes, and all sorts of drama. Lissa is immediately bullied by others and Rose ridiculed. Rose also has occasionally the ability to see/live what Lissa is going through. They think that some girl named Mia and her clique are behind the bullying. We also meet the schools administration and the vampire queen, as well as the top guardian. Lissa and Rose will have to discover who's after them and why and eventually confront them.\n\nVampire Academy is a good teen movie. It has a lot of story and Zoey Deutch's Rose who is the narrator reads her lines awfully fast. But she also completely steals the show and she's gorgeous on top of that (that hair!). Gabriel Byrne, Sarah Hyland, Claire Foy give very strong performances. Danila Kozlovsky is a revelation here. Olga Kurylenko and Joely Richardson are a bit over the top/play it for laughs. And that's one weakness of the movie, its mixture of comedy, drama, action, horror is a bit awkward and it doesn't succeed entirely at any of those. The males in this movie don't serve a whole lot of purpose as is standard for Hollywood these days, and I assume teen books as well. As is also standard for vampire movies, they all have to have dysmorphic bony chiseled faces. Stunts and effects aren't very good but considering that this movie has a budget 1/100th the size of a moronic Michael Bay movie, no one should expect state of the art stuff. For the budget, they sure were able to make a lot of movie. And this movie has more story than most movies including their sequels. One interesting idea this movie features is that fans of the vampire genre offer their blood for food to the vampires- in small survivable doses. Overall, the second half of the movie works much better than the first."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lexig07",
        "review_rating": "1",
        "review_title": "Why ruin a fantastic book?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "rosemariesgroi",
        "review_rating": "3",
        "review_title": "If you've read the book you will hate the movie!",
        "review_detailed_main": "This is the first time i have written a review, I usually just read them but i was so shocked by all these good reviews i had to. I read the whole series and LOVED the books.With that being said, the movie sucked, it was just such bad acting. I was most disappointed in Rose Hathaway. I loved her in the book, and the movie just did not do her justice. In the book she was a bad ass and serious about being a protector to Lisa, while also having that smart ass personality, this is not how they portray her in the movie. All these good reviews must be from people who did not read the book. I don't think we will be seeing the rest of the vampire academy books on film."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Kayla-zinsser-259-429859",
        "review_rating": "",
        "review_title": "go watch this movie!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "brianthornhill",
        "review_rating": "7",
        "review_title": "Bloody good",
        "review_detailed_main": "I can't believe the reviews am reading about this film i haven't read the books that this film was based on. But what i can tell you is that this film is definitely worth a watch with a nice twist at the end"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "meowmeower1037",
        "review_rating": "1",
        "review_title": "A True Disappointment",
        "review_detailed_main": "Initially when hearing that the book \"Vampire Academy\" by Richelle Mead was going to be put into a motion picture I was ecstatic! Mead's books create such an interesting world with captivating characters and adventures that have you picking up the next edition the second you finished the preceding one.\n\nThe movie did not capture the books' unique world or characters.\n\nWhat replaced my initial excitement for the movie was disappointment almost immediately after the movie started. The casting/acting, script, and quality were all unbearably embarrassing because they failed to reach past a superficial level. The creators of this film overdid the lame cheesy jokes (executed by less-than-satisfactory acting), and didn't illustrate any seriousness within vital characters like Rose and Lissa as in the book. Luckily, the movie did follow the plot well, but this single positive is overshadowed by the fact that the events felt strung together to reach a \"climax\" which was not supported from rising events within the movie.\n\nOverall, the production did not live up to the high expectations I had held and was a sad disappointment for a VA fan like myself."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Navin_Ad",
        "review_rating": "7",
        "review_title": "Not Too Bad of a Movie",
        "review_detailed_main": "I would give this movie a 7 although the fact that I have never read the books before, I still think it was a good movie. Good storyline, good action, good special effects, I mean if you are looking for a vampire movie that contains a bit of a lap dance (no, really) with no clothes off, around 80% hot vampire chicks and 10-15 vampire bites. Then this may be the movie for you, I dunno. If you really wanna know what the movie is like but don't want to waste money, just torrent it... but that is illegal so, don't. But if you are use the YIFY torrent, they have the best torrents. I dunno what to write now, IMDb is making me write 10 lines of text so if you are reading up to here, there's pretty much nothing left now."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Humdinger69",
        "review_rating": "3",
        "review_title": "Fittingly Enough, This Movie Sucks",
        "review_detailed_main": "If your not a girl between the ages of 8 to 16 then this movie has nothing for you. This movie was not funny, it was obnoxious, REALLY obnoxius. The harder it tried to be funny, and the more irritatingly stupid dialog spewed out of these generic teenage character's mouths, the more obnoxious it got.\n\nWhile the gore is rather heavy by PG-13 standards, most the action scenes were still nothing to write home about.\n\nI found the movie to be a bit hard to follow. Not because the plot itself is confusing, but because the movie barely kept my attention. I didn't care about any of the characters, what was happening to them, or what was going to happen to them. I didn't care about Generic Hot Teenager #1's secret crush on her teacher, I didn't care about Token Annoying Side Girl, I didn't care about Generic Bad Boy Chick Magnet, and I definitely didn't care about Stereotypical B**** Character and Stereotypical B**** Head Mistress.\n\nWell, now that I've bashed the movie into the ground, I would like to say that I actually think that the VA series could have some potential to be good if, no, when they make it into a franchise. If they would lose the clique teen melodrama, and not skimp out on the gore. We'll see what happens.\n\nI think I'm being a little hard on this movie, I was actually going to give it a 4, but then I decided to lower my rating, hoping in vain that I would even out the scale a little bit. This does not deserve the 7 that it currently has.\n\nGeneric, clique, annoying, stupid and boring. But it could have been worse.\n\nEDIT: It's late 2018 and as I come back to improve some of the grammar in this awful review, I notice the overall rating has dropped considerably, down to a 5.5! Warms my black heart. Keep it going, folks!\n\n3.5 out of 10"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "mjohnston-08590",
        "review_rating": "6",
        "review_title": "Tries to be too much.",
        "review_detailed_main": "The movie was entertaining as a time killer but it could have been far better. The major issue was it trying to be too much with various genres and pulls from other vampire lore films. Is it a best friend flick? Is it a teenage angst film? A mystery movie? A love story? Maybe an orphan trying to find their way alone? How about an abandoned teen trying to establish connections? The problem is that it was all of those things, and a bit more, making it too busy.\n\nThrow in other aspects from vampire lore and mystical films. There is a pseudo Hogwarts looking school...with magic going on, folks running around acting like they are Blade, day time walking vampires from Twilight, and vampire royals and feeders from Underworld. Again, too much with trying appeal to everyone that liked vampire flicks from the last 20 years. The movie could not get out of its own way to have its own identity."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "imwalt",
        "review_rating": "4",
        "review_title": "Love Vampires, Not This",
        "review_detailed_main": "I went into this movie not knowing anything about it or that it was first a book. I'm guessing it would be more enjoyable if you read the book first. It wasn't terrible, but it was confusing at times trying to keep track of the different species (or whatever they were) and the movie was mostly unclear as to why they were trying to kill or protect each other. Some of the scenes were very unbelievable, although a few were funny. The martial arts choreographing was horrific. The movie overall was basically a combination of Twilight, X-Men, Harry Potter, and Underworld... without the solid story lines or script.\n\nI'll give it a four rating because it didn't completely suck and I liked the girls, but it could have definitely been much better. The ending left an opening for a sequel that looks like it could be better than this one."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "scsforeva",
        "review_rating": "9",
        "review_title": "A Fans Review!",
        "review_detailed_main": "Vampire Academy. It's not the best adoption but its mostly true to the book. (A few of my favorite scenes were not in it but it's an adaption so I understand the changes.) The beginning felt a little rush compared to reading the book but it stuck true to the book! But the middle and end did it sweet justice. The fighting scenes were bad ass and the elemental magic...sweet. There was a lot of humor and changes to the time line but I liked it. I yelled at the screen a lot though, as an avid book fanatic and a college student for film directing and screen writing. All over though, I love the movie as much as the book!! And it is my favorite book series of all time ;). It is NOT like Twilight--we do not have teams and our vampires do not sparkle. The Strigoi are the most typical vampire stereotypes, the Moroi feed off of blood but are mortal, and the Dhampir is a half Moroi, half human. The Dhampir's do not feed off blood. The characters in the movie were so much like the character in the book and the fans will be happy with the cast and the movie! :)\n\nEven if you are not a fan of vampires, give it a shot! It might surprise you. I highly recommend seeing the movie. It has something for everyone and if you don't like it well that's on you. You never know until you give something a shot so why not give this movie a chance?"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "addaalex",
        "review_rating": "7",
        "review_title": "Much better than I expected.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Thanos_Alfie",
        "review_rating": "3",
        "review_title": "Not good...",
        "review_detailed_main": "\"Vampire Academy\" is an Action - Comedy movie in which we watch a girl who is Dhampir (half human-half vampire) trying to protect the Moroi (mortal vampires) from the Strigoi (immortal Vampires). The Moroi are living within our world in a peaceful way and they don't make their presence notable.\n\nSince I didn't have high hopes or expectations from this movie I wasn't disappointed by it. I didn't like this movie because it has a very boring plot with many filler scenes that make it even more boring. The direction which was made by Mark Waters lacks action. About the interpretations of the cast I don't have to mention any since everyone made poor interpretations. I have to mention here that I haven't read the book but I am definitely sure that the book would be far better than this movie so, if you have already read the book I advise you not to watch this movie. As it can be easily understood I don't recommend anyone watching this movie because you will lose your time and there are far better movies with vampires to watch."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Luvztrent",
        "review_rating": "",
        "review_title": "Really liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "larissajohnson",
        "review_rating": "1",
        "review_title": "This movie fits the marketing theme of 'they suck' because it did.",
        "review_detailed_main": "I didn't have high hopes walking into this film. I've been pretty adamant about not seeing it due to the blatant whitewashing of the lead character, but my little sister begged me to take her today, so I did.\n\nBiggest mistake of my life.\n\nIt was horrible. There were 7 of us in the theater, and no one laughed, not one time. A girl who was about eighteen made a gagging noise before she got up and walked out muttering about it being complete crap, but that hardly counts as a laugh.\n\nI have to wonder if the other reviewers who praise Deutch's performance saw the same movie I did. She was wooden,her pacing and delivery were dismal and half the time her expression was one that made me think she needed to find a restroom. I predict she is about to be labeled box office poison and it is a title she deserves.\n\nMy little sister was actually in tears halfway through the movie and asked me if we could leave. This was her favorite series, and mine too, and it was absolutely butchered beyond belief."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "pokegirl-90196",
        "review_rating": "7",
        "review_title": "Definitely gonna watch it again",
        "review_detailed_main": "This movie sucks you in completely. Yeah it goes a bit fast, but it was fun to watch. Hope there will be a sequel :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jamellb009",
        "review_rating": "1",
        "review_title": "Age limit?",
        "review_detailed_main": "I went into this movie knowing it was to be a comedy/ action movie but boy, the one-liners were so cheesy. You have movies like a haunted house 2 out and you know they are just stupid goofy movies. The comedy in this movie was even worse than the parody movies.Maybe if I was a teen, maybe it would have been funny; but unfortunately I am a 32 year old male with a pretty good sense of humor in which i did not find not one thing funny in this movie. Sorry but it sucked..... literally. With that also been said I see why it was such a dud once it hit theaters; must have been word of mouth. Unfortunately it was this or That Awkward Moment for today's matinée but I turned that off 15 mins. I should have did the same to this."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "katjasoana",
        "review_rating": "6",
        "review_title": "Mark Waters was this movies biggest mistake",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "arpitadash2011",
        "review_rating": "3",
        "review_title": "This movie would have been good if it has the proper casting and magnificent dialog.",
        "review_detailed_main": "I have waited so long for this movie as I am a vampire academy (novel) series fan but this was much more bellowing my expectation label. Richelle Mead's sharp series of young-adult novels might have been better off being adapted for long form TV, rather than the big-screen.I think this movie will be quickly forgotten, which is probably best\n\nTo start with I have problem with everything regarding this movie, starting from movie poster to cast and acting. The movie poster is not quite attractive i mean pink and green. Richelle did a great job by adding horror, comedy and action to the young adult romantic genre but the movie was really a shame as Daniel Waters wrote the screenplay for HEATHERS, which is one of the really nice films about school, though I still have not seen it.\n\nThe foremost disappointment was Dimitri Belikov, from the expression of books i had mighty expression on him but the cast director clearly tried because the actor Danila Kozlovsky is actually Russian , although, I don't think they ever gave Danila a chance to actually speak in Russian? So, what was the point? I'm just saying, He seemed a little too old (seems like in his thirties) for Zoey Deutch's Rose, and he did look the worst in male-ponytail. The main issue though is that Danila Kozlovsky and Zoey Deutch had none of the chemistry that Rose and Dimitri have in the books – which was the sorrowful thing for me as vampire academy series is one of my favorite novels. I also did not like when Dimitri called Rossa out of affection.\n\nWhile i am talking about casting then Lucy Fry as Lissa Dragomir was another upsetting thing. I think Lissa is very dull and boring in this movie. Sometimes it's hard to read her expression and while hypnotizing people she was just expressionless. But what i hate the most is her mouth; she even can't talk properly with her fangs. Another fact is that Lissa and Rose's being shadow-kissed shown horribly in the movie. The one or may be only good thing about this movie was Zoey Deutch as Rose; she really tried very hard to hold on to her character in this movie. I am serious she is just fabulous in her comic tone and serious lines.\n\nHere the director tries to cover whole book in 104 minutes but fails to do so. The plot was awful as it was difficult to understand what's happening so was the dialog. I really hope for remake of the movie in a better way or the adaptation for long term TV show."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "b-duchaine",
        "review_rating": "7",
        "review_title": "Excellent Story / Missed Chance at being a fantastic movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "airishome",
        "review_rating": "1",
        "review_title": "The worst film I have ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "juliet-swan",
        "review_rating": "10",
        "review_title": "My friend said: ''I WANT MORE.''",
        "review_detailed_main": "I'm going to share a story, especially after I had the joy and honor of reading some critics made by ignorant and extremely rude people. I'm Italian, the movie will be out next week here, but one of my friends that lives in the USA saw it because I told her that I was sure she was going to enjoy it. She has never read the books, so she had NO IDEA about what she was going to watch. \"I'm happy to have met Rose and I'm happy to have discovered this new world. But I want more now'', that's one of the many positive words she said about Vampire Academy. SHE DID NOT READ THE BOOKS BUT NOW SHE'S A FAN BECAUSE OF THE MOVIE. Now I don't care if the critics weren't invited to the 1st screening and that's for sure the reason why they are spending so many rude and inappropriate comments, but PEOPLE ARE LOVING IT. It deserves a sequel and especially it deserves to be judged without any prejudices. WE ALL WANT MORE. Respect is the key, no matter what your job is, if you cant show it you don't matter."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "kissmyasthma66",
        "review_rating": "6",
        "review_title": "A Treat for those who read the book, but to everyone else...",
        "review_detailed_main": "I can already admit that if I hadn't the book, there is no chance I would have seen this movie unless forced upon me by a bunch of my friends who like cheesy romances. BUT, I will say, I thought it wasn't going to be worse than it turned out. Everything felt rushed, the characterization sucked, and some of the dialogue was just straight boring, cliché, and unnecessary. The book wasn't one of those cute high school gossip crap where everyone becomes friends at the end. But the director and writer for the movie made the story into that. I bet everyone who hated the movie would like the book way better (at least the book made more sense and made one able to sympathize with the characters). I will say there were quite a few funny parts in this movie and the actors seemed like they had a good time filming it. But it's like when people bake without putting the love into it-- the baked goods are good, but not great. Everything seems right, but something is just wrong. I think if you were watching this without really thinking, or watching as a date movie, it's a pretty good option (at least it's not a tear- jerker). I gave this a 6 because the story, originally, was good. The actors seemed to try. The cinematography was interesting (not the slo-mo stuff though). The dialogue had some cute jokes. But this was kind of a parody of the book. I personally got some enjoyment out of this movie, and it was interesting to see a book series I've read for 5 years put to the screen."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "flitz35",
        "review_rating": "3",
        "review_title": "Had potential but failed..",
        "review_detailed_main": "When producers and directors work with a big budget they have the opportunity to make a great movie with a great story. Vampire Acedmy was not great or even good. During the entire movie I had to ask \"what the heck is going on?\" The story was slapped together and what was even worse was the annoying English accented vampire you couldn't even understand.\n\nThe one thing that should come out of this movie is a learning experience for other movie makers not to make the same mistake of a sloppy story and sloppy directing. Now directing is co existent with direction. One sentence with sum of what I feel about this movie the best. This movie had no direction."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "elenasabrine",
        "review_rating": "1",
        "review_title": "So bad that Twilight looks Oscar-worthy in comparison",
        "review_detailed_main": "Yes, I really did say that. The VA books are AMAZING. Hands down, one of the best book series I have ever read and I've read a lot. Every detail in the books, even the obvious plot holes, are amazing and you will be drawn in from the first chapter. But this movie? Having spikes hammered under your nails for 2 hours is less painful than watching the VA movie. Casting is sooooo wrong. Rose seems like a snotty brat and Lissa like a stuck up ... Dimitri has somewhat of what he has in the books, but not even close to it anyway. Christian is probably the best casting choice, but I suspect that its Dominic's superior acting abilities in play more than the actual casting choice. Dont even get me started on Mason, Jesse, Victor, Mia or Natalie. No. Just no. Kirova I can live with. Even Tatiana I can live with. But the rest? No. I'm so glad they didn't get to cast Adrian because that would have ruined the books for me. The script.. oh god, how many horrible words can I find to describe the problem with the script? Not enough. Sorry fans. It's just that bad. Save yourself the horror: don't watch the movie. Read the books. Thank me later."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "j-madej",
        "review_rating": "",
        "review_title": ". The straight of this unassuming to some extent and unoriginal story lays in the performance and magnetically charming persona of the lead female actor Zoey Deutch.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "DareDevilKid",
        "review_rating": "7",
        "review_title": "Though Not Scary, Still A Refreshing Vampire Yarn After Ages",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "a-johnson1-889-722682",
        "review_rating": "2",
        "review_title": "Probably one of the worst films I've ever seen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "bluemoonskye2002",
        "review_rating": "6",
        "review_title": "Great book",
        "review_detailed_main": "Sad about the movie, it just didn't live up to the book. This could have been a really special piece, unfortunately it didn't do it for me sadly"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nannymawmaw",
        "review_rating": "5",
        "review_title": "Doesn't Do Book Justice",
        "review_detailed_main": "Disappointed. The actors were okay and could have done a better job, but considering how the writers butchered the story and made it so cheesy, I am inclined to forgive them.\n\nYes, this is geared toward teens, but please.....As the grandmother of teens and young adults, I can attest to the fact that.....Contrary to popular belief.....most teens are highly intelligent, and this movie could have been done on a much higher level."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "davispittman",
        "review_rating": "6",
        "review_title": "Better than I expected",
        "review_detailed_main": "Yes it is true that vampire Academy was better than I expected, but that doesn't mean that it didn't have it's flaws. The characters in this movie in my opinion were very well portrayed by the actors and well written. I especially loved Sarah Hyland's performance in this film, strong and well done on her part. The special effects were pretty cool to see. The script and the dialogue wasn't exactly great, but it was alright. The problem I had with this movie was the pace, the pace in the beginning was very slow and it felt like it was dragging, but it eventually quickens up. The action sequences are pretty fun to watch and aren't too gory. The costume design is well done and sharp. The sex scenes, which there is only about two aren't too graphic and are very sensual and will shot. I did enjoy the budding romances is between certain characters, that was refreshing. I really loved the lead actress and her character, I thought that character was very well done for the film. This movie also has kind of a twist ending which I really loved, I always love a good twist ending! There is also a good bit of eye candy to enjoy, the main male actors aren't too bad to look at haha. Overall, it's pretty enjoyable, but flawed as well. Vampire Academy receives a 6/10 from me."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "claudettehasse",
        "review_rating": "1",
        "review_title": "Not good enough",
        "review_detailed_main": "Horrible adaptation from the Vampire Academy book series. There was no chemistry between the main characters, Rose and Dimitri. It felt like the film was rushing through the 1st book's storyline.\n\nIt would have been better if they didn't bother making this adaption. Now the chances of getting sequels or even a new adaptation are 0%"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "reynapryde",
        "review_rating": "10",
        "review_title": "It was what I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "abigailntaco",
        "review_rating": "6",
        "review_title": "I see why people hate it, but I really liked it",
        "review_detailed_main": "This movie isn't by any means an award wining film, but I really enjoyed it. I remember reading the books years ago and it brought back the same feeling.\n\nWhile the comedy in it was cheesy and bad and not good I found myself laughing, and I really liked the people casted in the movie.\n\nI can definitely see why people hate this film, but I enjoyed it even though it's not exactly similar to the books."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "joro_le",
        "review_rating": "4",
        "review_title": "Could have been a fun move",
        "review_detailed_main": "It's not a bad plot, the story is entertaining enough, but the acting and the dialogs are awful, Head master is the worst of all, it feels so forced, worst acting i have seen in years, really. The characters are not developed enough, there's so much story behind them, but they don't exploit it as much as they should. The pace is to fast for some plot points and the relationship between the characters is forced, they left to much for the viewer to fill, and that makes it hard to understand some times. The action sequences are not as bad, but some of the actor lac the ability to even pretend they can fight. I still believe it has potential if done right If there's a sequel, i hope they do it right this time.maybe i'll read the books..."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ma-cortes",
        "review_rating": "4",
        "review_title": "An inferior and uneven American fantasy comedy horror film directed by Mark Waters.",
        "review_detailed_main": "Based on the first book of the novel series of the same name by Richelle Mead, it is the first in the six-book \"Vampire Academy\" series, which includes \"Frostbite\" (2008), \"Shadow Kiss\" (2008), \"Blood Promise\" (2009), \"Spirit Bound\" (2010) and \"Last Sacrifice\" (2010). It deals with Rose (Zoey Deutch) and Lissa (Lucy Fry), they are like most teenage girls: they like boys, shopping at the mall and feel misunderstood. But there is a big difference between them and the rest: Lissa is a vampire princess belonging to the bloodline Moroi, Mientars Rose is the guardian in charge of protecting her. After escaping from St Vladimir's Academy, the friends are captured and forced to return to the school, where Rose is under the strict supervision of her stoic mentor, Dimitri (Danila Kozlovskiy). Teenage Moroi Lissa battles with the death of her parents, coming back to a school where she doesn't feel safe and the dark side effects of spirit. She has her best friend Rose who is shadow kissed and is bonded with Lissa meaning she can see inside her mind and feel all her thoughts and feelings. The two of them battle high school bullies, magic caused mental illness and forbidden romance. They also have someone out to get them, a Royal moroi who was close with Lissa's family, he wants to use Lissa to heal his sickness that is killing him rapidly. Rose is in love with her older instructor Dimitri who is also supposed to be protecting Lissa. Rose and Dimitri fall in love but can't be together, their age his teacher status and them both having to protect Lissa all being reasons they try and fail at not loving each other. Meanwhile, Lissa struggles to balance her role as princess with who she truly is inside of her, all while facing terrible enemies determined to destroy her royal bloodline. Blood is family, blood is pain and blood is death !. They Suck at School !Friendship is Forever !.\n\nThe film stars an ensemble cast led by Zoey Deutch as Rose Hathaway, a Dhampir, and Lucy Fry as Lissa Dragomir, her Moroi best friend, and follows their return to the St Vladimir's Academy boarding school, after being on the run for one year. Based on the first installment of the popular saga of novels written by Richelle Mead from a screenplay by Daniel Waters, concerning a world of privilege and glamour, two young women's friendship transcends their strikingly different classes as they prepare to complete their education and enter royal vampire society. The film turns out to be completely unsuccessful, showing capricious teenagers, with the typical peculiarities such as romances, flirtations with boys, tastes for clothes, containing a quantity of sappy dialogues and painful interpretations. This movie is played by a cast of young actresses Zoey Deutch (Set It Up ,Ringer), Lucy Fry (Mermaids of Mako, Lightning Point), Danila Kozlovsky (Legend number 17, Rasputin); for the fights these actors underwent rigorous training sessions and workouts. Being film debut for both Lucy Fry and Anya Taylor-Joy, though her scene was deleted. And adding the most veterans: Olga Kurylenko (Oblivion, Quantum af Solace). Joely Richardson (Milennium, Nip/Tuck) and Gabriel Byrne (End of the days, Usual suspects), all of them interpret more for the worse in this new twist to the well-worn vampire stories, but this time focusing more on the world of teenage girls.\n\nThe motion picture was lousily directed by Mark Waters. The movie did not perform very well at the worldwide box office. He's a good artisan, a director and producer, who works both , cinema and television. Being known for ¨Freaky Friday, Head Over Heels, The house of yes, Bad santa II, Magic Camp, Mr. Popper's Penguins, Ghosts of Girlfriends Past, The Spiderwick Chronicles¨, being his biggest hit:¨Bad Girls¨ and making a large number of TV episodes from notorious series, as well as telefilms, such as: ¨Eva Adams, Made in Jersey, Witches of East End , Salem Rogers¨, among others . Rating Vampire academy (2014) 3.5/10. Despite being a total failure, a few years later it was remade into a TV series in 10 episodesVampire Academy (2022), showrunners: J. J. Braider, Jason Coffey with Sisi Stringer, Daniela Nieves, Kieron Moore, Jonetta Kaiser, André Dae Kim, among others."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "thesunwillrise1901",
        "review_rating": "",
        "review_title": "A Must See For Fans!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "dalesutho",
        "review_rating": "7",
        "review_title": "More entertaining then expected",
        "review_detailed_main": "I found this to be harmless fun. The 2 main girls did well with their roles. Was great action and funny dialogue. It did go too long though and i got bored towards end. I'd really love to see a sequel."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "natswim",
        "review_rating": "1",
        "review_title": "Mess of a movie",
        "review_detailed_main": "I enjoyed the book series when I read it, but the movie was just awful. The characters that you care for in the novels are completely unlikeable in the film. The entire time I spent watching this movie, I couldn't care less about the characters. Super slow-paced, confusing (plot is different from that of the novels and many things are left out) and just terrible overall. Read the books instead."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ThrivingChaos",
        "review_rating": "3",
        "review_title": "Awful awful and it brings shame to the books",
        "review_detailed_main": "The books are probably one of my favourite series out there. I was really excited for the screen adaptation only to be met with one of the worst movies ever made. Everything is cheesy and they skip so many important parts. Shame. They should redo it with the right actors who had 0 chemistry and a whole better director."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lavi-19452",
        "review_rating": "5",
        "review_title": "\"There's a compliment in there somewhere\"",
        "review_detailed_main": "I loved the books as a teenager, I don't know why it took me six years to get around to watching the movie but I didn't miss out on much, I'll tell ya that! It's a high school movie disguised as a fantasy/thriller, plain and simple, but that's fine It's not terrible... until it is. I would've even said I liked it until the cringe speech at the end by Lissa, cutting off the queen during the assembly and preaching about how teenagers shouldn't be catty. God, that's an oxymoron if I've heard any. 5 stars are for Zoey Dutch and her charisma. She did what she could with what she was given and I'm only sorry that we won't see more of her as Rose (and Dimitri calling her Roza *swoons in Russian*) eventhough I'm glad there isn't a sequel. So yeah, it's nothing on the books but we already knew that didn't we."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "astarrymist",
        "review_rating": "10",
        "review_title": "It's Not Actually Cool to Hate Vampires",
        "review_detailed_main": "So, we all know that the new cool is to be a Twilight basher and to adamantly declare how sick of vampires we all are. Even the critics forgot that vampires are immortal. They will always be a part of our entertainment culture. We love the dark mystery of the vampire, the blood, the gore, the enticing allure. We love the power, the horror, the intrigue of the being whose problems result from having lived too long. We want vampire stories whether we forgot about that or not. Oh, look, here's one! But people simultaneously want it to be exactly like the old vampire horror movies and think it's exactly like Twilight. Guess what? It's neither.\n\nThis is Vampire Academy, based on the book series of the same name, a name so horrid that even the movie itself makes fun of it. Get over the name. It is what it is. Don't let it skew your perception of its quality. It's not horror, no, though the main characters either live in fear of another race of vampires or they live to kill that other vampire race. Lots of great action, blood, and killing going on in this series. It's not a fluffy, dull, sparkling romance either. There are real vampires in Vampire Academy. The kind nightmares are made of. The first book doesn't feature them as much as the movie does, which makes the movie all the better. Fans of the books know how intense things get with this evil race of vampires, and happily, the Vampire Academy movie added more into the first story.\n\nI truly expected critics to be open minded and clear-headed enough not to be swayed by current trends, namely the one that thinks its cool to hate vampires. I thought they would see how much better this story is than the other YA movies of last year that flopped. Unlike those, this movie has some light-hearted humor interspersed throughout so as not to come off as some dreadfully serious and dramatic tale. It wasn't too comedic and the comedy didn't take away from the story. It was a perfect blending of tones, exceptionally well done like it is in the book. Furthermore, the mythology was not too complicated to understand. Even though I know the story, plenty of non-book readers understood it just fine. Objectively, it was explained simply enough. Three races. Evil, immortal strigoi who can be killed by a silver stake and who cannot go into the sun. They are after the Moroi, a more peaceful (yet not without corruption and evil of their own) race of vampires who feed on blood from willing human (whose memories are erased when they stop being feeders) and who each control the magic of one of the elements. They are an ancient race and are ruled by a monarchy, which includes 12 lines of royal families. Then there are dhampirs, half-Moroi and half-human who depend on the Moroi's existence in order for there own race to survive. Thus, they live to serve and protect the Moroi. Is this exactly fair to the dhampirs like one critic couldn't believe? No, it's not. It's a deeply culturally embedded idea, though, and dhampirs feel it their sacred duty and life's mission. Protect Moroi from Strigoi. Shouldn't Moroi maybe help protect themselves? Glad you asked! These cultural issues are all brought up in the series. The Moroi society will see change. That is to come. For now, just understand that the Dhampirs want to protect the Moroi. The differences between the races were not hard to understand at all. I think the critics were just shocked that this universe has some depth and substance to it. Instead of praising the story's intelligence and all the possibilities this initial foundation allows for, they bashed the movie for having intricacy in mythology. We've got real vampires here, people. It's not as simple as vegetarian, sparkling vampires versus blood-sucking, sparkling vampires, but it's not hard to understand.\n\nFurthermore, I loved the way the movie introduced the universe. It allowed us to grasp some of the basics from Lissa and Rose's first conversation, and then it took just a couple of minutes of our time to tell us about the different vampires. Then we get to see Strigoi for ourselves. Awesome scene!\n\nThe high school drama aspect of the story is why the first Vampire Academy book is my least favorite of the series. I'm too old for that stuff. A lot of people worried that they overdid the drama, but it turns out that there was relatively little. The movie wasn't even close to being all about mean girl Mia. Rose helping Lissa with her Spirit problems and figuring all that out plus the mystery of who is really after Lissa is the primary focus. The ending sequences were phenomenal! I loved every second.\n\nBy the way, I may be just a couple of years older than Danila Kozlovsky, who plays the instructor guardian Dimitri Belikov. I tell myself I'm too old to crush on him even though I love his long hair. But, my goodness, I felt like a teenybopper fan girl when it showed him strength training doing those arm pull-ups. I leaned forward in my seat, almost off the edge of it, and gaped. Wow! He played his part incredibly well. I was impressed with the entire cast, as well.\n\nI will go see it again, and I hope the curious yet skeptical will give it a chance. I hope our current culture will get over itself and stop acting like it's cool to hate on vampire stories. The vampires are back. They don't like how you think you are too cool for them, so much better than them. Watch out. Better let Vampire Academy take a bite out of your arrogance and save yourself."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "mrsmng",
        "review_rating": "1",
        "review_title": "The promise to be amazing but they failed it",
        "review_detailed_main": "I really wanted to like this. I am an avid fan of the books but unlike a lot of avid fans, I am realistic. I don't diss movies because they don't follow the books. I am realistic enough to know that an imagination is going to trump budget, location and time constraints every single time. And as much as I really wanted to have the entire series made into movies, if they think about follow on's they need to have a good hard think. The movie itself had two trailers. One was a mean girls, laugh a minute, spoof which looked dreadful and the second was darker. So it was my hope that OK, directors of the mean girls wasn't going to be a good advertisement but maybe the found a way to combine all the elements. It didn't. The book series is excellent. Its not sparkly vampires, think more The originals than Twilight. Its dark, its serious, but there are some excellently written light hearted Rose Hathaway moments. The dhampir who conforms to nobody and isn't afraid to rebel. What did we get? Canned laughter type moments, moments that should have been funny but weren't. More a Disney type channel comedy aimed at children. I get it should appeal to non book readers, to people who have never ever heard of Richelle Mead, but that went so far the other way there is no surprise it bombed. Such a shame, such a let down for something that could have been better than all the movies that came before."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "trinamang",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "I never initially wanted to watch this movie but my friend won free movie tickets to this film so I decided to watch it. I came into the theatre not knowing the title and not seeing the trailer. It started off with cheesy lines and continued immensely using 90s catch phrases. The script was terrible and nothing felt realistic. One of the main characters who played the princess was such a terrible actress. I couldn't even count how many time I rolled my eyes because this movie did not appeal to me at all. There were some comedic parts but other than that it was bad. I had to tell myself over and over again not to leave because it would have been rude since it was a screening."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Blu_Flash98",
        "review_rating": "4",
        "review_title": "So much wasted potential",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "TyRawrrnosaurus",
        "review_rating": "3",
        "review_title": "'Vampire Academy' is Try Hard, Scooby-Doo Twilight Fan Fiction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ekenaudra",
        "review_rating": "5",
        "review_title": "Meh... I wouldn't recommend it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "rodrilover17",
        "review_rating": "10",
        "review_title": "you will not be disappointed",
        "review_detailed_main": "there have been many tries in trying to find the next huge hit ya adaptation and while i think this film wont make 100s of millions of dollars it will and should be a hit. whatever you think you may know about this film throw it out the window and go see this movie you will be pleasantly surprised.fans of the books will be in so much awe the things that they might have cut from the film you wont even notice unless you really analyze it awhile after you see it. you get to see how the characters changed over time in a way sort of like mean girls where Cady goes on this journey to discover herself only that now the stakes are higher (no pun intended). i hope they make a sequel because i'm tired of Hollywood letting me get into a movie and then not continue it. fans of the books go see it if you want to see Adrian. non fans of the books go see it to have a good time"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Bello-4",
        "review_rating": "",
        "review_title": "With Potential, But Feels Like You're Just Dropped Into Things...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Buddy-51",
        "review_rating": "3",
        "review_title": "Pathetic mishmash of much better sources",
        "review_detailed_main": "Nestled in the wilderness of rural Montana, St. Vladimir's is like a Hogwarts Academy for fledgling bloodsuckers. The main vampire-in- training is Lissa (Lucy Fry), who, after a number of years living on the \"outside,\" is back at school to finish up her education. She's accompanied by Rose (Zoey Deutch), a sassy, feisty human who serves as Lissa's 24/7 \"guardian\" and with whom she shares a psychic connection.\n\nWhile St. Vladimir's curriculum may run to such unconventional subjects as magic, compulsion, martial arts and Romanian history, the school itself plays host to all the cliques, backbiting and teenage hanky panky that exist in even the least supernatural of high schools.\n\nThere are \"good\" vampires and \"bad\" vampires and all sorts of in-between vampires, but \"The Vampire Academy,\" which is based on a 2007 novel by Richelle Mead, is just a pale imitation of \"Twilight\" and \"The Vampire Diaries.\" What's different is the flippant, sarcastic tone that's supposed to make it hipper and more self-aware than those straighter takes on the subject. But the effort falls flat simply because kitsch that doesn't take itself seriously is always far worse than kitsch that does, mainly because it demonstrates a lack of respect for its fan base. All this is true of \"Vampire Academy,\" despite the best efforts of Deutch and \"Modern Family\"'s Sarah Hyland, who plays the nerdy chatterbox of the undead set. Somehow, top-tier actor Gabriel Byrne has also wandered - inadvertently, one presumes - onto the set, but even a performer of his caliber can't manage to breathe life into this toothless take on the already over-saturated teen-vampire genre.\n\nThough the movie wraps things up with a tidy moral message at the end, there's the ominous suggestion that there may indeed be a sequel in the offing (there are many more books in the series from which to cull further material, which already doesn't look promising). Let's hope someone drives a stake through this particular movie's heart before it rises from its coffin to do any further damage."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "CoRE-eu",
        "review_rating": "1",
        "review_title": "Talking, talking and more talking.",
        "review_detailed_main": "This is my first review on this site, I've watched plenty of movies, good and bad.\n\nThis is not in either of those category's. It's simply, awful.\n\nPeople who give this a 10 (or above 5) don't have a single idea what a movie is supposed to be like.\n\nAnd for those people I advice watching a single movie out of the top 250 rated movies on this website (some of them might be bad as well, but not on this level of bad). I was gonna say watch a decent movie, but those people wont have a single clue what a decent movie should be like.\n\nThis movie is bashing Twilight, but they're actually worse than Twilight, how ironic.\n\nI couldn't finish watching this movie, it was just too painful to watch ."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "eeysh112131",
        "review_rating": "",
        "review_title": "Trailers Don't Give It Enough Credit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hi_im_manic",
        "review_rating": "4",
        "review_title": "Not my cup of tea",
        "review_detailed_main": "Let me begin by saying that I'm not a member of the 12-18 age demographic that this film targets, nor do I consume young adult fiction like the book upon which this film is based. So, I can't say whether this was a good screen adaption or not. I do like good movies worth re-watching though, and this film does not leave me wanting more. There is a good amount of action, and a semblance of a plot, though it has a weak storyline and some sub-par acting moments. In true 'tween form, the movie wants to explain away any mystique straightaway. Thinking's hard, huh? Let's also strip it of any creativity or ingenuity by merging it with today's pop culture fads...that way it will seem fresh without requiring any measurable intelligence. It's NOT a total stinker, I imagine it will be enjoyable for its' intended audience. My \"inner film snob\" wants to hunt down the original copy just so I can dump it in a port-o-potty."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "madamemoviemonsterheart",
        "review_rating": "1",
        "review_title": "Teenage Cousin And I Didn't Like It",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "maximovlE",
        "review_rating": "1",
        "review_title": "Pure disappointment.",
        "review_detailed_main": "I like Zoey Deutch, I think she has the potential to do far greater films than she has, but this one certainly clearly didn't help her career.\n\nMovies with voice overs are rarely any good, it's a cheap way to tell a story, when you have a director who has no idea how to tell a story.\n\nThe movie tries too hard to create a lore filled world, throwing stuff at you before you have chance to understand what's going on.\n\nAnd then there's the academy. Hogwarts for vampires. Or was it acting school? Because every last one of them needed acting lessons.\n\nI couldn't finish the movie. I hate when I don't watch a movie all the way through, but I also hate having my senses destroyed by drivel..."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "mishu_babydoll",
        "review_rating": "10",
        "review_title": "don't listen to the critics",
        "review_detailed_main": "I think many people won't go watch this movie because of the reviews from the critics. Which is really sad because the critics are mostly adults in their 40-50 (obviously this is not the audience for this movie) who are being unprofessional just because the movie wasn't screened for critics. I never expected critics to love this movie of course, but they are being very rude and they really make no sense. It's like they didn't watch the movie because they still compare it to Twilight which is fine if you haven't watched VA yet but after you watch it, how can you still compare it to that movie which doesn't even have a storyline.\n\nI promise you, if you go watch this movie, you won't regret it. Maybe you're not gonna love it but you will enjoy it.\n\nAnd I also promise that if the movie gets a sequel (which can only happen with your help), you will love where the story goes and you will end up falling in love with this beautiful characters.\n\nSo that's what I had to say. Please go watch it and see for yourself. :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "abisio",
        "review_rating": "3",
        "review_title": "Harry Potter for girls ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nina_151",
        "review_rating": "",
        "review_title": "Really?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "kmt03010",
        "review_rating": "2",
        "review_title": "If you loved the books, don't watch the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "wisemantonofski",
        "review_rating": "3",
        "review_title": "\"Bad\" Doesn't Begin To Cover It",
        "review_detailed_main": "There are a couple of good ideas battling for focus here, but all of them ultimately fall short in a swamp of suffocatingly contrived exposition, poor editing and incredibly choppy pacing. Though the fight sequences are entertaining enough, while unconvincingly choreographed, they are too few and far between to prevent this feeling like an appallingly sub-par highschool drama with none of the charm of Mean Girls before it; and as a fan of the mythology, I'm left to wonder if it's really Twilight that's done the most damage to vampires since the turn of the millennium after all."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "sarah-5-713210",
        "review_rating": "1",
        "review_title": "Loved the Book, Hated the Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "adizzy",
        "review_rating": "1",
        "review_title": "Read the book, stay away from the movie.",
        "review_detailed_main": "Maybe, just maybe, I I would have not read the book I would consider this movie at least funny, but God, was this a awful experience. I am so sorry, but really I want my time back. The acting was so bad, they made the characters to be so shallow, they already are a bit in the book , but the movie brings it to a whole new level of superficial. The story was almost like in the book, and that almost mattered for me. Those changes annoyed me and I still don't understand the point of them. Why did she had to sedate the Headmistress? Why did Rose tell them all about Lissa's powers? That was a \"dangerous\" secret. Yes, in the book, everything comes together and the danger was not that bad as they thought in the beginning, but sill, why change the chronological order of things?"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "sangoporter",
        "review_rating": "10",
        "review_title": "True and New!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "cricketbat",
        "review_rating": "2",
        "review_title": "Tries to be cool, but falls flat on its face",
        "review_detailed_main": "Vampire Academy is impressive the way it over-explains everything, yet says nothing of substance. This movie tries so hard to prove that it's cooler than the movies it's ripping off, but it's constantly tripping over its own feet and falling flat on its fangs. From the melodramatic acting to the paper-thin plot to the cheesy special effects, this movie is one big misfire."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "doofuspoofus",
        "review_rating": "",
        "review_title": "Not good enough for the screen",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "janiklitalien",
        "review_rating": "1",
        "review_title": "I'm so happy we had coupons to see this...",
        "review_detailed_main": "Seriously...\n\nIf it wasn't for the predictable side of the movie, the bad acting bad acting would've done me in, this doesn't even rank as a decent date movie.\n\nI didn't see the twilight crap nor mean girls and this was life's way of concentrating both and shoving them down my throat.\n\nI haven't been a teenager in a while but I am sure they have better taste than to waste money on this.\n\nI miss Coppola's Dracula and Blade should definitely come put them all out of their misery.\n\nThe only good side I see to this (Beside's the 30 seconds of Zoey Deutch underwear and cleavage shots) is that I didn't need to pay to see this."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "chiguy17",
        "review_rating": "1",
        "review_title": "UNBELIEVABLY bad!",
        "review_detailed_main": "Honestly, I don't see how anyone over the age of 10 can think this tripe is anything near entertaining or even watchable. It's honestly probably the worst film I've ever seen. The script, the acting, the production value is all just awful. Just plain cringe worthy."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "mihali_mara",
        "review_rating": "1",
        "review_title": "A great book destroyed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "KoriAnders",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": "The premise is interesting enough and the main characters have the \"quirky\" personality going for them. It should've been a decent film but the writing and pacing made it a horrible mess. Everything was moving too fast and left me wondering if some of the scenes were even necessary. Another thing I dislike about this movie is how they portray teenagers and sl*t-shame everybody. I never read the book but after looking at an interview of the author saying how the movie does it justice, I'm glad I didn't waste my time."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hugorocksmy",
        "review_rating": "8",
        "review_title": "Very Fun Movie!",
        "review_detailed_main": "I had a lot of fun watching this movie, and even though it wasn't as much as I hoped, it was good enough. This movie is one that you're not supposed to take seriously, just the way the movie doesn't take itself. I was very surprised and amazed by Zoe Deutch, she was great and added an extra excitement to the movie. And even though the story was sometimes hard to understand because I haven't read the books and everything was half explained very quickly, it also it had a lot of clichés. It still was entertaining with its tongue- n-cheek dialogue, its characters and the pop culture references. And although it wasn't in the level of Mean Girls- because they share the same director- it still managed to look good but it had some issues with the editing and quality of some scenes. This movie wasn't near perfection, but it wasn't about that. Hopefully they'll make a sequel, because even though the endings wasn't as exciting to set the excitement or expectations. I still want to know more about the characters and just be around them, because they have that touch of fresh air and charisma that many other characters in other teenage movies lack. Just remember that you don't have to take it seriously and just go with it, because in the end it's all about having fun and enjoying."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "da_crazy_mahn",
        "review_rating": "4",
        "review_title": "How to not start a franchise",
        "review_detailed_main": "Let me start by saying that I have read the books and I really liked them. I have no negative preconceptions about young adult vampire books.\n\nHowever, everything about this film was done in a spectacularly mishit fashion:\n\nLet's start with the casting. Rose Hathaway is supposed to be a badass future Guardian of a more or less clear middle eastern descent and while other filmmakers have used purebred white girls for such roles before they at least used some tan to bring them closer to the character's description in the book (yes, I am talking about Jennifer Lawrence and The Hunger Games). Zoey Deutch is s very beautiful young girl with a nice cleavage (as clearly accentuated in this movie) but she is neither badass nor mixed. (It is a very old argument about having white people playing mixed characters on film, or even being used on the book covers.) Danila Kozlovsky is young and popular in Russia and a decent actor, what he is not, however, is imposing. And Dmitry Belikov is supposed to be this warrior god. And the most important thing is that (in my eyes) Zoey and Danila have zero chemistry together.\n\nThe worst part though is the script. I read Vampire Academy and I loved the fully realised characters, each with their own backstory as well as agenda. In the film, however, we are left with two vapid girls being high school bitches (there is no really any other way to put this). I do not know if it was the relative failure of Beautiful Creatures and The Mortal Instruments: City of Bones but whoever in the promotional department thought that playing up the high school aspects of VA was the way to go should be fired.\n\nThis production did not have the money for the action and the special effects, the leads were miscast, the book butchered to fit some promotional idea and Richelle Mead (the author) ever sells the rights to any of her other books to the same studio she deserves what she gets."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "firestar_p",
        "review_rating": "",
        "review_title": "An amazing film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "brooke-98054",
        "review_rating": "4",
        "review_title": "At least it's entertaining",
        "review_detailed_main": "Vampire Academy is far from great. It suffers with its fast pace, confusing topics, bad characters, and a terrible script. The story itself isn't so awful but the characters just don't make it fun. The main love interest, Dimitri, was so bad. His acting was flat. I could clearly see the other actors/actresses trying their hardest, though. The music selection for this movie was terrible and did not fit the movie at all. However, I will say that the directing and fight scenes were great. At least it's entertaining."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "anaconda-40658",
        "review_rating": "1",
        "review_title": "It Fails on All Levels!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "rybug-17965",
        "review_rating": "1",
        "review_title": "I've waited 5 years to write this review!",
        "review_detailed_main": "Picture this: It's 2014 and you're 15 years old and your dad wants to get a movie in your demographic. He also is aware that this movie is an adaptation of a book and thinks \"maybe if she likes this movie she will want to read the book.\" Unfortunately he was wrong. I remember hating every minute of this movie. Every character was conceded and had no real motivation. The acting was mediocre and sloppy. When I first looked at the IMDB rating, it was at 4.8, which to me, was livable. However, it has gone up over the years and it has fueled a 5-year-long fire that raged within my soul. If anyone were to ask me what my least favorite movie of all time was, this is it and I'm gonna put a stop to this rating rise."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "zivkovic-zorana",
        "review_rating": "1",
        "review_title": "Really not worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "SeeJay23",
        "review_rating": "8",
        "review_title": "Honestly I liked it",
        "review_detailed_main": "As someone who's never read the books and was forcefully dragged along by my sister, I was quite pleasantly surprised by this movie :) the beginning of the movie started off a bit strange so I had already written it off as a big flaming bag of poop but as it went on the story started to pick up and I started to enjoy the plot and the personalities of the characters a bit more, and I found rose to a pretty badass main character! So overall this movie was actually pretty good and I'm honestly glad my sister forced me to watch it, and also for fans of the book, don't be afraid of going to see this movie as my sister is a big fan of the books too and she found this film to be fairly true to it minus a few differences and she also enjoyed it a lot :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "billygoat1071",
        "review_rating": "4",
        "review_title": "Vampiric World",
        "review_detailed_main": "Vampire Academy defines anything that a YA movie needs to please its target viewers. By concept, it's basically Harry Potter (a supernatural school) and Twilight (teenage vampires) merged together into one new mythology. Hormonally, it would have been annoying since the fascination of this genre keeps getting hindered by its terribly generic romantic subplots. But when you have Mark Waters, the director who usually shows the truths and satires in female high school life, you get an at least appealing environment. Unfortunately it has a hard time juggling with its subplots and developing its world. And that is where the film falls short like the others.\n\nThe film deserves a credit for being a less unbearable disposable YA. It's a better movie when you let Rose jump into people, narrating her school life like a teen movie that has something to say with the modern social conduct. But the plot aims to the epic series elements more than the coming-of-age tale roots. The real problem is how unfocused the storyline is. The characters doesn't have much to do other than explaining stuff and waiting what happens next. It's momentum free and the threat is rarely existent until it finally snaps appear out of nowhere at the second half.\n\nThe script seems to be more interested in the memes, and it's a missed opportunity because a little teen movie mockery would have been a perfect fit for a fantasy world that the genre provides, but the mythology building is underwhelming thus it feels like it's just another vapid teen comedy but with supernatural themes all over it. The pizazz is relied at the stars. Zoey Deutch is quite natural. She gives real energy that makes Rose a competent lead hero. Lucy Fry also gives some personality to her role, even if the character is not fleshed out enough. The rest seems to be having fun and that's a good thing to see.\n\nVampire Academy might have worked better as a TV series (label it as part comedy so no confusion with the \"Diaries\" show.) I mean there's a lot of things to develop. All we apparently get is attitude scattered into a random world of educational vampires. If I can be honest, the material has potential, the characters and the setting can be worth rooting for, but really, the storytelling lack consistency and intrigue. Maybe next time they would get it right (or not)."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "mjcandylove",
        "review_rating": "",
        "review_title": "Please make the second one.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "siderite",
        "review_rating": "4",
        "review_title": "I couldn't watch more than 10 minutes of it!",
        "review_detailed_main": "I watch a lot of crap, from series to films, but this film is disgustingly bad. At first I thought it was a spoof film, something a film student created in their spare time and capitalized on the name of a real film, but no: that's the actual movie. The acting was so abysmally bad, the dialogue so ridiculous and the special effect so \"special\" that after 10 minutes I stopped watching it. Maybe it was more like 5 minutes.\n\nWhatever you do, don't watch this. And if you think the girls are young and cute and you might enjoy it for this reason alone, they are not that hot, really. A lose lose situation, so to speak."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "vinzarka",
        "review_rating": "2",
        "review_title": "This movie doesn't bite",
        "review_detailed_main": "It looks at least a normal entertained movie but everything looks strained. bad scenario, low interesting level and everything it looks not connected to each other subject. It was a mix of blood and love stories, a mix of fights and some trick lessons and at the end it was a big misunderstanding of who is who and which is which. There is no need to put unnecessary elements to tell a whatever story. A story can be told by simple things, by simple bloody sucks and by well complicated love stories etc etc.I can see that there were enough possibilities to add enough good subjects and elements and not losing money for shooting bullshits with nonsense."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "gianmarcoronconi",
        "review_rating": "3",
        "review_title": "Banal",
        "review_detailed_main": "Very simple and banal film for girls with a very banal plot and a banal development, the vampires in the end are almost only the background because if they were all normal people the plot would not change much and this is a big problem for a film that makes vampires his focal point of attraction."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "PennyReviews",
        "review_rating": "3",
        "review_title": "not good enough",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Live_027",
        "review_rating": "10",
        "review_title": "Vampire Academy",
        "review_detailed_main": "Like every other fan, sometimes you get afraid that they may mess up the movie, or to get to the point where you say 'The Book was better'. Vampire Academy like any other book, made into a movie will have some changes, everything can't be exactly like the books but thrust me If you read the books and you love the series you will love the movie!!\n\nIn my personal opinion it was Amazing!!Yeah like I said they made some little changes but they wont affect you at all, it actually make the movie more interesting and seriously I came out of the movie theater with my mind blowing. It was a MILLION times better of what I expected. I love the characters all of them were fantastic, the cast is amazing, so if you still a little scared or insecure about the cast, forget about it. I love the chemistry between Lisa and Christian, as well as Rose and Dimitri. YOU WON'T BE DISAPPOINTED AT ALL.\n\nIf you are not a fan at all, I would say....give the movie a chance I promised you won't regret it. And instead you will find a movie, full of humor, action and a totally new concept of Vampires."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "krjk07",
        "review_rating": "4",
        "review_title": "just an OK film but not for the movie house",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "where-gitt",
        "review_rating": "",
        "review_title": "Hot but too fast",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "adamhill0",
        "review_rating": "2",
        "review_title": "First I was like maybe, then it crashed and burned.",
        "review_detailed_main": "Right. So after seeing this movie around I though I may as well see what it's on about. The start was good, it seemed kind of an interesting and seemingly dark concept. But it was anything but. Yet another girly vampire movie with terrible acting, poor cinematography and a script that made me pause the movie to do something else every 10 minutes. No attachments to characters, no true sense of anything in this movie. It just rolled by. I don't usually watch vampire movies with the exception of stuff like blade or darker style stuff. But I just couldn't get into this, it was going to an obvious end point, but through childish twists and acting that went hand in hand with the poor writing. I loved the main character, and to some extent dimitri, but there was no chemistry between any of the characters. Sure a few one liners that you kind of had a faint smile at, but even the worst movies have a little glimmer of hope. All in all, this was a very poorly made film, no real hard hitting actors and a script that didn't help there efforts."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "laura-18712",
        "review_rating": "2",
        "review_title": "A bad adaptation",
        "review_detailed_main": "The two stars I gave this movie were for the costume design for the school uniforms and the filmography. I've never read the books, but the pieces I missed from the movie were the details that i'm sure the books included. The exposition is confusing and weak and it's confusing how some characters have powers and others don't. Why? Where did their powers come from? Why are the two characters connected? There's no explanations of why anything happens. It's painfully obvious the info in the books were chopped up and thrown into this movie, because the plot is so disconnected and yet seems so fast. I don't know what the main character's motives or past are besides their shared trauma and I agree with the reviewers that say there's no chemistry between the cast at all. None of the movie makes me want to figure it out, either; I don't care what happens to our main characters because they never established why we should. I'm sure the books were okay - I'm past YA fiction now but I can see how the plot could be convincing and compelling in a novel setting, but this adaptation is bad."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "dmaire1221-222-44515",
        "review_rating": "3",
        "review_title": "Ouch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Jerghal",
        "review_rating": "4",
        "review_title": "Vote with your wallet",
        "review_detailed_main": "They suck at school? They just suck. Period! One of the latest attempts of robbing the 'Young Adults' of their allowance and getting them to return for endless (two part) sequels is Vampire Academy. Let me first say I'm so glad it failed horribly at the box-office so we never have to see another of these films again. It's based on books but it still doesn't have an interesting story worth repeating here, it's all plain nonsense. The 'Academy' here is just Hogwarts. I'm sure they just brought the Harry Potter sets back out of storage without even a repaint job. And the vampire part - well, that's where they try to rip off Twilight and fail (and Twilight wasn't even good). I mean c'mon, everybody must be so sick of vampires by now. Unless you have some incredibly cool angle (cfr True Blood) then don't even bother. And apparently the kids aren't as dumb as the Hollywood suits think coz they sent a clear message by not turning up to see this crap (VA only made 15m$ worldwide). There is a scene at the end which serves as the setup for the next film in the franchise but we're all happy to know it won't happen. Don't watch it so they'll have to stop making them!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "harrypottertwilightf-919-229070",
        "review_rating": "10",
        "review_title": "Vampire academy a must see film",
        "review_detailed_main": "Wow! This movie is great! its fun and true to the book! I LOVE this movie as much as I love the books!! It is a very good adaption. It's a funny and amusing and has interactions that everyone can relate to. It on the stresses importance of friendship and has a strong and funny female character that is very lovable because she is strong and independent and very different form most main female characters in movies.It is better then Twilight and its is a fresh fun take on vampires. The story is a good one and it only gets better. It over all is a GREAT movie and a MUST see. Take a group of close friends and enjoy this EPIC movie. Its very much worth it! The love for this movie can not be expressed enough!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "LighterShade93",
        "review_rating": "4",
        "review_title": "The cringe was amazing",
        "review_detailed_main": "The movie was super cringey and laughable that i decided on 4 instead of 2 stars... loved every bit of the cringey parts of the movie which is to say everything single part of it"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "rizkyrarung",
        "review_rating": "5",
        "review_title": "nice movie to spend your time with",
        "review_detailed_main": "this is possible that we could be tired of all these vampire movies we have seen in big screen or small screen lately. where there are some of them that is actually good, we have seen a lot fail ones. but rest assured folks, this one is quite entertaining. i won't say it good or bad, but i found this an entertaining one.\n\nthis is a movie that you can only enjoy without you giving much a though about it. it might be lacking in story and script department, silly and cheesy at times but the silliness is what makes it funny and exciting. thanks to Zoey Deutch too. she is lovely as Rose. it's hard not to fall for her. Rose liven up the mood the entire movie.\n\nseeing how it ends, i hope we could have a sequel."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "tiffaney-83033",
        "review_rating": "1",
        "review_title": "The movie was absolutely terrible. i suggest you don't waste your time!",
        "review_detailed_main": "Absolutely loved this book series. The movie was terrible. If you are contemplating watch this movie, don't. Its a waste of time. I highly recommend the books. The movie seemed like more of a parody than a book adaptation. When the movie rights were first discussed, I was very excited to see one of my favorite series played out. Disappointed doesn't even begin to describe what I felt when I watched this movie. It was even worth the five dollars I paid to go see it in theaters. The story line was completely butchered and the acting fell flat. The actors were not similar to the book descriptions, and their acting was terrible. The movie appeared to be more of a comedy than an actual developed plot. I would NOT recommend this movie!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "beeeeeewitched",
        "review_rating": "3",
        "review_title": "this movie sucked",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "laura-vincent94",
        "review_rating": "3",
        "review_title": "Readers beware",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "inkblots212",
        "review_rating": "9",
        "review_title": "Not Another Twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "masandaglinus123",
        "review_rating": "1",
        "review_title": "One of the worst YA book-to-film adaptation ever",
        "review_detailed_main": "Vampire Academy is one of the worst film released in 2014 and it's also one of the worst YA adaptation ever. Trying to mix the concept of Harry Potter, Twilight and Mean Girls, this YA film is a less satisfying to watch. Mark Waters, the director of Mean Girls, did a terrible job to direct this film. Daniel Waters, the screenwriter of Heathers, also did a terrible job writing the script. The script was awful and poorly written. It suffers from a horrible pacing, unfunny jokes, uninteresting fights, crappy romance and more and more cheesy dialogues. The casts were totally pathetic on their performances and I can't stand them on screen. For those people who have read the book will surely be disappointed and even those people who hadn't read the book will be disappointed too. I think it's time to destroy these YA book-to-film wannabees who try to make the success of other YA book-to-film adaptations like The Hunger Games. So, grow up Hollywood! I will give this film a score of 1 because I don't really see interesting in here except for the fact that the main lead looks like a young Rose Byrne."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lcameron23",
        "review_rating": "5",
        "review_title": "Read the books/miss the movie",
        "review_detailed_main": "The movie had the potential to be amazing, maybe even better if it was a tv series but the acting in this was not so good and the script was awful, Lissa is a completely different character in the books, not so moany and that accent omg and the actor playing dimitri doesn't really pull it off either, shame as the books are awesome"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nerdingsince1996",
        "review_rating": "5",
        "review_title": "it's 2.5/5 kind of bad for me",
        "review_detailed_main": "I watched it a few months/weeks ago. but, I just had to say it. this movie is not as bad as it seems, not so good either though. I never read the books, so i can't tell about comparisons. there are some parts that excite you, especially of you're a young adult, but the rest is boring dramas and stupid fighting scene with bad choreography. of course this movie is not the kind that I expect to be well acted, well directed with good pacing and storyline. so I have a very low expectation. and in more ways than not it is. it was bad acted, has bad cinematography, slow story pacing, and definitely not good directed. but, like i said, there some exciting part. the part that you just want to know a little bit more at the beginning, definitely disappointed in the middle, but then surprised that the ending isn't as bad as you think it would be.\n\nthe best part is the black haired girl and the character played by the girl from modern family. they're probably the best assets in this movie. two characters who at least decently acted. i got it. they're funny and bad ass, and one girl could actually made me pity her. the romance is a big no, it disgust me and one big negative aspect of this movie. it's just to much, overly done. i would love the black haired girl, but she just became annoying and ooc half of the movie because of the romance. i know it's in the book, it's the main plot, it's a ya adult thing, so love story is an obligation but i just wish there's no romance at all. between them there's just no physical chemistry, no emotional chemistry, no good story background, nothing. the black haired girl at least has more physical chemistry with her blonde friend's boyfriend and not her Russian lover, who looked like he could be thirty. the blonde girl just is so annoying with that stupid accent,honey you could act a lot better than that, so are the two boys (even hot bodies can't save them).\n\nbottom line, it's bad, but it's 2,5/5 kind of bad for me."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "angel_baby_1447",
        "review_rating": "1",
        "review_title": "What in the actual F is this?!?!?!?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "andreeaflondor",
        "review_rating": "1",
        "review_title": "Borring",
        "review_detailed_main": "Omg, was soooo borring...i don.t recomand this film. I don.t like it."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "basts",
        "review_rating": "8",
        "review_title": "Read and Watch :)",
        "review_detailed_main": "VAMPIRE ACADEMY the movie - Pro movie reviewers bash what they have no clue about. Clearly professional movie reviewers were all expecting Twilight/Heathers/Mean Girls and are panning the movie because this movie is nothing like those stories.\n\nFirst, as readers of the books know, Vampire Academy is nothing like Twilight, and unfortunately, many so called pro reviewers obviously know nothing about the books this story is based on. While it is not a hugely budgeted eye candy like Twilight Movies, it had a much better plot that is overlooked by clearly blinkered reviewers hoping for mean girls or heathers instead of checking into the movie's actual origins which is a very good book series that the movie is staying pretty faithful too despite the mean girls/heathers dark comedy glossing the production end is trying to overlay the series with.\n\nWhat pro reviewers are completely missing is that this story is about friendship and loyalty between two girls of different origins and expected life paths, and what they are willing to do to help and protect each other while trying to become strong, good people.\n\nIt wasn't the best rendition of the first book, but it wasn't the total drag reviewers portrays it. I took a male friend to Friday night's showing and while he'd never read the books, he agreed it was much better than we'd been expecting from the commercial trailers and I got him interested in the book series. yay! The movie had the feel of a television pilot more than that of a theatrical release. And while visuals were decent by television level standards I was disappointed that it wasn't a bit more sophisticated. It seemed it was shot on a very low budget, however it stayed pretty faithful to the story line. The pacing seemed pretty rushed, I think this would have worked better with a slower pace, a better music score, and more focus on the mystery/intrigue aspects, as well as the shared fear Lissa and Rose have about Lissa's mental health because in the books they are very concerned that Lissa may be falling to madness the way previous Spirit oriented vampires have.\n\nThe Vampire Academy story line from the books are about strong characters, who happen to be teenage girls, trying to deal with futures and responsibilities not just imposed on them by their culture and circumstances, but those they choose for themselves as well. I think the books are pretty awesome, and hope there are more movies so more of the books story line will be brought to cinematic life.\n\nI recommend reading the books (or the first one at least) and then watching the movie"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "chachiirose",
        "review_rating": "5",
        "review_title": "Lackluster",
        "review_detailed_main": "I loved the books but this movie just didn't do it for me.\n\nZoey is an amazing actress but I don't like her Dimitri counterpart.\n\nThe movie was ehhh. It was enjoyable but I don't think enough for a sequel.\n\nIt followed the books to a t but sometimes that's just not what's needed.\n\nI felt like it needed something. What I don't know but something good.\n\nI didn't enjoy the actress who played Mia because later on we all come to love her in the books and I just felt as though that wouldn't happen her.\n\nDimitris actor wasn't bad but for this role I felt as though he was.\n\nDimitri is her teacher but not older by much and I just felt as he looked to much older than her than he should.\n\nZoey is amazing at what she does. There's never been a movie of hers that I haven't loved. She's phenomenal but this movie just fell short.\n\nKinda like the Mortal Instruments did. The TV adaptation was sooooooo much better.\n\nThey completely jacked the ending of that movie and it ruined it for all the rest."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "angelreborndark",
        "review_rating": "5",
        "review_title": "Worst sound ever for a movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ellajxu",
        "review_rating": "4",
        "review_title": "Overall, an OK movie",
        "review_detailed_main": "I feel like they had many really attractive people in this movie to make up for the bad acting skills. But some scenes were not too bad. I think the actors were not good at expressing sadness, shock, or anger. There were also quite a lot of actors that I have seen before in this movie. It is not terrible, but not the best movie I have ever seen (actually not even close). It is funny, because the first time I saw this movie, I thought it was such a good movie, but the second time I watched it, i really had a lot of criticize about it."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "tballspinner",
        "review_rating": "1",
        "review_title": "Made me want to QUIT LIVING",
        "review_detailed_main": "ARE YOU KIDDING ME. What is this piece of trash movie, who funded paying for it, and how did they get such a god actor like Zoey Deutch to BE IN THIS MOVIE. WOW, let me preface by saying I really do enjoy movies and try to give them the benefit of the doubt. But watching this movie took every ounce of my will to live. The actors are horrible, the plot is as stupid as it can get, and you literally HOPE more of the main characters die because god knows it would make this movie a little more interesting. ANYTHING, if ANYTHING could redeem this movie, it would be Zoey Deutch's character because at least she has some inkling of a personality, her quips are sharp, and she's got moves. But literally that ray of sunshine is drown in this pile of horse poop. PLEASE DO NOT WATCH FOR YOUR OWN SANITY. Consider this a warning."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "xuehuabingyu",
        "review_rating": "4",
        "review_title": "A bit different from any other Vampire stories.",
        "review_detailed_main": "Most of the reviews are saying how much this film is bad. And also they are complaining that this film is terrible. As for me, I don't think this film is either good or bad. It makes me difficult to write review on this one because I also don't know how to judge.\n\nBasically, this film is about vampires. But it's more than Vampire. It indeed has extra things. So, sometimes, it makes me really confused. I must admit that this film really bad in some conditions. And sometimes, it's totally nonsense. But it's not that terrible. At least, I still can watch it.\n\nThere's only one thing I don't like. They shouldn't write anything that ridicule the other Vampire stories such as Twilight. I think this film will be better if there is no such part in it.\n\nBecause of the rating on this film, they don't even do a sequel. And this film doesn't have an end. So, it seems like it's stranded. I kind of don't like it. I really don't care about ratings, I really want to see the ending. No matter how much it is bad, if only there's an end, it's better.\n\nAll in all, compared to other Vampire films, this film is nothing. That being said, it doesn't mean this film is unwatchable. At least it doesn't make me boring, well, I think it's at the normal."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "icecreamcone2317",
        "review_rating": "10",
        "review_title": "vampire academy is amazing!",
        "review_detailed_main": "I loved this movie. This is not a movie for everyone. Everyone likes different things. I'm not going to try and make everyone love this movie as much as me. But, you should give it a try. Try to not watch it with low expectations because then that's what you will get. Just like in life. Trashing movies is just pathetic. Comparing movies as a \" professional \" critic negatively is just disappointing. Vampire Academy is nothing like twilight. While both are great films and essentially have \"vampires\". They are nothing alike. Twilight is a wonderful love story and about a women finding herself. Vampire Academy is about friendship and an independent women who knows who she is and what she wants to be, a protector and fighter. The vampires in twilight are immortal, can just drink animal blood, and sparkles in the sun. Vampire Academy has three different unique types of vampires. Moroi who dislike the sun and are bothered from it. They have specific magic, are not immortal, drink blood from willing humans. Dhampirs who are half vampire and half human. They do not drink blood, are not immortal, don't drink blood and eat whatever they want. They are born with the natural instincts to fight. They protect the moroi from the third vampires the strogoi who are the stereotypical vampires. They are soulless, immortal beasts who kill for blood, and cannot go in the sunlight and are killed my a stake in the heart. If you are moroi and kill a human while feeding you become a strogoi. Otherwise you are turned by force. I could go on and on. Although Harry Potter is wonderful, this movie is even less then anything like Harry Potter. Yes, there is magic, but nothing at all like Harry Potter. Only moroi have magic. And there magic is only one of the 4 elements. Earth, fire, water, air. They each only specialize in one. Spirit is a special exception. That takes more time to explain. This movie is not based mainly on the magic. It's just something they get like anything (like puberty). I'm fine if you don't love the movie like I do. But, it is exhausting hearing some people say it's a twilight meets harry potter in a very negative way. It's like saying sideman and batman are the exact same just because they both have superheroes. This in my opinion is an amazing film. I have watched it 7 times already. The author of the book, Richelle Mead, put a lot of effort in this story. She actually researched the ideas of stories about theses specific vampires. She is amazing and very talented. Mark Waters and the rest of team did a wonderful job bringing the book to life and making an amazing movie. They added and changed minor details, but kept the story true. The amazing actors/actresses who were in this movie brought the characters and the chemistry to life. This is about two best friends who just happen to be vampires. They go through many relatable things in life, just like us. There is humor, romance, action, and much more. This isn't intended to be the next Oscar movie, it's for fun! :) Be open-minded and give it a try! :D"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "sketchatron",
        "review_rating": "5",
        "review_title": "A 2 1/2 hour movie crammed into 2 hours",
        "review_detailed_main": "Movie would have been better if it wasn't so chaotic from scene to scene. They did the scene jumping and dialogue so fast it's like they were purposely trying to get through it as fast as possible. I don't know how they could go through final editing without somebody saying \"whoa this is a mess\". What could have been a pretty good movie turned out to be mediocre."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "matrobe",
        "review_rating": "4",
        "review_title": "Cringy",
        "review_detailed_main": "This was a truly terrible movie, I didn't have high expectations since it was based off of a teen fantasy but it was hard to get through the whole thing it was so cringy. Even though there are numerous talented actors in the cast nothing could save this movie; I honestly feel bad that they had to \"act\" in a flop like this. If you are looking for a movie that takes all the worst characteristics of a teen fantasy and shoves them down your throat for an hour and a half then this is the movie for you. The plot is predictable, the acting is cringy, the dialog is terrible, and the cinematography is jumpy and impossible to follow/sit through."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "evanescentotaku",
        "review_rating": "4",
        "review_title": "Seems like crap out of 70s",
        "review_detailed_main": "What was this movie all about not a single thing was interesting(except for the girls wearing high school uniforms damn they looked sexy).\n\nThe story had potential but budgeting the movie with the plot so vast made it looked like some awful movie from 90s man. Who would believe if i say twilight and harry potter would only cost 30 million. And that's what it tries to be .\n\nEverything could have worked out great if the plot wasn't so confusing. They made the small things looked like some bigger issues was ongoing while it was just some high school girl making boys do all the dirty work for some private time with her.\n\nI highly recommend you to watch it if you have got nothing else or if you can't sleep. It will make you sleep after knowing that the first half is all about girls tricking the protagonist to believe some random life threatening things was going on while it was just bullying for some random revenge issues.\n\nFour out of Ten just for the chick with high school dress."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "abbyrose-99366",
        "review_rating": "1",
        "review_title": "If Mean Girls was about vampires",
        "review_detailed_main": "Since the time I watched this movie when it first came out, I have described this movie as 'Mean Girls with vampires'. Turns out it's the same director, so doesn't that explain absolutely everything??\n\nAs someone who read these books when they were a teenager back when they were first published, I can honestly say this movie adaption was the worst to come from any of the 2010s YA fictions. There were scenes where I quite literally sat there with my mouth gaping because I couldn't believe what I was watching. There was not a single element of this movie that was a saving grace.\n\nThe plot wasn't alike the book. The character choices were all wrong. It was satirical and tried too hard to be funny when it was just embarrassing. And to add even more insult? Dimitri and Christian were done SO dirty."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "caitlinpercy",
        "review_rating": "2",
        "review_title": "Low budget and weird acting",
        "review_detailed_main": "They immediately lost me with the princess and her balloon lips, but I tried to press on and ignore it. However, when it came to the second fight scene as they were entering the school and the dhampir gal's lip was was quivering that's when I tapped out. It's one thing to have a low budget movie, it's another to have actors that can't even pretend real emotions.\n\nI think the plot was ok for a vampire movie and the other actors were ok but the fakeness cropped back up again in another scene and I just can't bring myself to watch cringe acting like that. If you're gonna make a movie with a strong female lead then actually make her strong, instead she's a weirdly quivering mess."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jessica-richard94-920-442048",
        "review_rating": "10",
        "review_title": "Fun Movie, Strong Friendship, Relatable",
        "review_detailed_main": "Please, before you decide whether or not you should go see this movie based on the negative comments from critics, ask yourself are they the audience this movie was made for? Why not listen to people that have gone to see the movie and have loved it, and can give you real reviews of the movie. Here's why you should go see this movie: IT'S FUN. This movie, yes it's a movie about two best friends from high school and yes they deal with regular high school drama and bullying. But's its also has that strong friendship between the two best friends, Rose and Lissa, that everyone will admire. For those who love a supernatural twist, that's there. Rose is Lissa's half vampire, half human guardian who will protect her at all cost. Lissa is from a race of peaceful mortal vampires, that need protection from the undead, unmoral vampires that will kill anything to survive. There's lots of action fight scenes that many will love, and there's some romance, but it doesn't overshadow the main friendship between Rose and Lissa. If you want a review by someone who you feel will not be bias, then check out this awesome movie review from a man who wasn't afraid to admit he was wrong:\n\n***I have watched this review myself,there are no spoilers :)****\n\nhttp://www.youtube.com/watch?v=RlW8KBJinCU"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Chanandler-Bong",
        "review_rating": "2",
        "review_title": "WHY ARE THEY ALL British",
        "review_detailed_main": "Im British to clarify. Why are half of the class British, bar Rose, Dimitri, Mason and Mia? I thought this was American? Anyway this film sucked. No pun intended. I've read and loved the series and oh my this pretty much murdered it. It was terrible. The acting was horrid, the only slightly credible performance was Dimitri's. The most annoying award goes to Lissa, good GOD I wanted to poke her eyes out 5 minutes into the film. This film, to someone who has not read the books, is confusing and unclear. There were so many things unlike the book I wondered if I was watching the same story line, e.g. they messed up the shopping scene so bad. Everything in this film made me want to hit something. It was terrible and I can't believe they murdered a great series. Do yourself a favour and not watch it if you've read the books. Adios!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "tushargupta-27286",
        "review_rating": "2",
        "review_title": "One time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "avidmoviewatcher1221",
        "review_rating": "3",
        "review_title": "Vampire Academy",
        "review_detailed_main": "The Vampire Academy series written by Richelle Mead is one of my all-time favourite series ever. I will continue to re-read the books because they are that awesome.\n\nHowever, I can't say that I would re-watch the movie inspired by the books, mainly because . . . well, it sucked.\n\nI feel like there were so many things wrong with this adaptation. Like, the majority - if not all - of the characters were miscast; the actresses who played Rose and Lissa were far from how I imagined them in the books, and they could've cast people who could actually embody these characters I love. The same goes for Christian - I like the actor as Jace in the Shadowhunters, but I don't think he was right person to play Christian.\n\nThere were so many unintentionally funny parts, and they are, like, the only goods things about this movie. For me, they basically made it Mean Girls with vampires. And to be honest, I don't think it can be compared to Twilight; they have both have vampires, yes, but they are still completely different from each other.\n\nIt really devastates me that I didn't like this movie. I really, really wanted to, but I really, really couldn't.\n\nA while ago, I remember seeing Julie Plec, who developed The Vampire Diaries into a TV show, and who created its spin-off, The Originals, tweet about making Vampire Academy, along with others, as a TV show. And to be honest, I would love that; not only do I feel like I can trust her, but I believe making Vampire Academy is a better idea; they did that with City of Bones, which was rebooted as a TV show called Shadowhunters - which I love - and Tomorrow, When the War Began, which was rebooted into a TV show, as well - though I loved the movie for that. So why not Vampire Academy?\n\nAnyway, this adaptation didn't work for me, and I hold out for Vampire Academy to get its second chance on-screen - with a completely different cast (I will come up with my own dream cast), script (and if there are any changes, they have to make sense), and, of course, developers (like Julie Plec)."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nokkenbuer",
        "review_rating": "4",
        "review_title": "The Potential to Be Great, But An Execution That Wasn't",
        "review_detailed_main": "Although I never read the original series, the \"Vampire Academy\" movie was well below my expectations. The movie was too quickly-paced and ill-conceived for me to enjoy it. This film reminds me of a pseudo-vampire, fantasy-themed \"Mean Girls\" made by eager fans of the romance series. It was entertaining, but if the book is anything like this movie, then it is no wonder that I've never heard of it until just when the movie was released.\n\nWhat else can I say? The fight scenes were obviously scripted, the combat was unbelievable (and not in a good way), and the acting was just good enough to be considered mediocre. If you are a die-hard fan of the novel series, or you really like fantasy and vampires, then perhaps you will enjoy this movie despite its numerous flaws. For me, however, \"Vampire Academy\" is just below \"OK.\""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "cethi-One",
        "review_rating": "2",
        "review_title": "A real waste of time",
        "review_detailed_main": "Frankly, it's saddening. First, we don't touch the cat!! Two, it's that this intrigue burnt, 55 min of film for a still shaky set-up, tools put in place and so badly used, really mediocre acting and pity she has to stop the brunette with her conspiracy! From the beginning she takes herself too seriously to always want to be the one who settles everything while her role is wobbly and undefined. This movie is a real waste of time!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "pangle_m",
        "review_rating": "10",
        "review_title": "Better than I was expecting!!",
        "review_detailed_main": "I'm fangirling so hard right now!! I've got a happy high from watching it. lol of coarse it's going to be a little different from the book, but it still stayed pretty close. There were a few cheesy scenes but I loved it! Plus hearing Dimitri say \"Rosa\" ahhh it was amazing. I think that Zoey does and awesome job at playing Rose and Danila makes a awesome dimitri! I also loved Christian! I'm going to have to go see it again next week! I was so scared to go watch it because I liked the twilight books and after those movies.. i'm embarrassed to say that i've even read it! lol But GO!! Support this movie, we need a 2nd to come out!!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "janusswti",
        "review_rating": "3",
        "review_title": "This movie is not an adaptation of the novel",
        "review_detailed_main": "First things first i would like to point that i haven't read the books. I watched the movie and i liked the use of koldunism magic. Also there is this new vampirism fiction.\n\nI was a little bit afraid because of the protagonists being teenage girls. And i was right. Instead of an action/horror film i saw a highschool drama with lots of bullying and at last pushing the idea that bullying is bad.\n\nThere was nothing else. No actions scenes, no horror, no vampires as we know them...\n\nI finally got my hands on the first novel. I read it within two days. It kept me. I enjoyed it. And i came here to review this movie. Main protagonists are not even looking alike how the book describes them. The action in the book is far better described than what i saw. I can understand that when you adapting books you need to cut some things but seriously?\n\nI give it only 3 stars because Gabriel is delivering the role. It is not worth seeing this movie even if you hadn't read the book. No wonder why it botched on the big screen..."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Taxiridefan",
        "review_rating": "3",
        "review_title": "Not what I hoped for!",
        "review_detailed_main": "I was looking forward to the release of Vampire Academy. I had read each of the books thoroughly and was anticipating seeing each character and plot come to life on the big screen. What we got instead was Mean Girls with fangs.\n\nWhile most people seemed to blame the bad movie on the cast of (at the time) lesser known actors, I blame it entirely on the writers. Instead of actually delving into the books and writing a script that paid credence to Richelle Mead's writing, they gave us the same \"Plastic\" drivel that comes from any Waters Brothers movie.\n\nIf this movie had been written and directed as it should have been, this would have been the beginning of a long lasting movie franchise. Instead we get this one movie flop and may never get the chance to see a \"proper\" adaptation on the big screen within our lifetime."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lilyplusplus",
        "review_rating": "5",
        "review_title": "It was alright, I guess.",
        "review_detailed_main": "I didn't go in with that many expectations, to be honest. Vampire stuff - it has been overdone and murdered but I heard the novels were good, so might as well, right? Well, guess what, I just finished a YA novel today and was reminded how much I don't enjoy the genre because of the cheesiness. And this had plenty of it. I did like the actresses (old H2O fan here), they weren't amazing in acting itself (not like the script was that good) but bonus points for having Olga and Danila. The movie setting was very obviously cheap, but I understand that they don't have that much budgeting. Anyway, I thought this movie was alright - it wasn't super awful, but it was mostly boring and overused. Definitely not what it was being hyped as earlier on. No Mean Girls in Vampire-Land."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "dragonroars-57812",
        "review_rating": "2",
        "review_title": "Finally a Movie that Sucks!",
        "review_detailed_main": "This movie is the Hogwarts of vampire movies but the author just steals from everyone in the process. During the narrative exposition at the beginning we get reminded how Twilight vampires sparkle in the sunlight. The only reason we need a narrative is the lack of a discovery character as in Harry Potter. In other movies we start with a normal human or someone who believes themselves to be ordinary and discover a hidden yet mystical world. No discovery, we are thrust into the vampire world and given a lengthy primer by the dhampire. A dhampire is a cross between vampire and human, like Blade, but in this movie even the vampires seem very ordinary.\n\nThey spend a lot of the beginning of the film explaining how it all works. At some point you are asking, Are we there yet? The meat and potatoes of this movie is about teenagers, social issues at school, and popularity. Sounds very normal, too normal for a vampire picture. I am not expecting overt blood and gore in a PG-13 film, but there isn't much vampire action.\n\nJokes are just pathetic and I really can't understand them poking fun at Anne Rice writing fan fiction for \"Twilight\"? Anne Rice is one of the most notable authors of vampires, it doesn't make much sense to insult your target audience with lame jokes about her.\n\nIf someone is reading this thinking they enjoyed watching this, watch it again and tell me what was so \"enjoyable\"? The dialog may have been stolen from old episodes of \"90210\", the humor isn't funny, the love interest and drama is for after school specials, and they claim to be a school of vampires yet we see and hear no real instruction.\n\nThe author is just tossing out another vampire wizard school for teens that sucks!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "cea1996",
        "review_rating": "3",
        "review_title": "Why did I watch this?",
        "review_detailed_main": "I absolutely LOVED these books when I was in high school and Netflix just added this to their lineup but good lord this movie was awful. The books are in an entirely different league of their own. If the books were Harvard the movie was a trash local community college in a poor neighborhood."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "vanessa71793",
        "review_rating": "8",
        "review_title": "Good stand alone movie, But for those who read the book I'm not a huge fan...yet?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "FilmMan47",
        "review_rating": "3",
        "review_title": "Where Is Kate Bekinsale When You Need Her",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "tomgillespie2002",
        "review_rating": "2",
        "review_title": "Like bad fan-fiction written by a teenager",
        "review_detailed_main": "Mark Waters' Vampire Academy, based on the hugely successful series of young-adult novels by author Richelle Mead, spends so much of its 100-plus minute running time trying to explain itself and attempting to conjure the same level of mass hysteria that surrounded the likes of the Twilight and Harry Potter books, that it isolates nigh-on everybody apart from those already completely in love with the source material. It's an uncomfortable hybrid of the aforementioned Twilight (sexy vampires!) and Harry Potter (a secret school for magical types!), yet makes Stephanie Meyer and J.K. Rowling's work seem like Dostoyevsky in comparison.\n\nRose Hathaway (Zoey Deutch) and Lissa Dragomir (Lucy Fry) have run away from St. Vladimir's Academy, trying desperately to live like real humans do. Rose is a Dhampir, a half-vampire, half-human hybrid who has dedicated her life to protecting Lissa, a royal Moroi (peace-loving vampire), and the two share a psychic connection which allows Rose to occasional eavesdrop on Lissa. A year after fleeing the school, they are re-captured by 'dreamy' Russian Dhampir Dimitri (Danila Kozlovsky), who whisks them both back into the care of headmistress Kirova (Olga Kurylenko), but not before battling off some red-eyed Strigoi (evil vampire). Once back, Lissa is the victim of a series of attacks, including dead animals being left for her to find, and threats scrawled on her wall written in blood.\n\nIt's the slightest of plots, yet Vampire Academy still somehow manages to feel over-stuffed. While Rose struggles to explain the entire universe as well as several characters' back-stories via her own brand of sarcastic narration ripped shamelessly from Juno (2007), there's little time to catch up with what is actually going on and no time at all to care. Even for a film that feels like it was based on a teenagers' work of clumsily sculpted fan-fiction (although I haven't read the book), the complete absence of wit and social observation comes as a shock given the film boasts the talents of Daniel Waters, who wrote the wonderfully dark Heathers (1988), and his brother Mark, director of the surprisingly hilarious Mean Girls (2004). Any plans for a franchise were quickly and thankfully scrapped when the film bombed upon release, and it's not difficult to see why. The whole experience is stilted and awkward, and Deutch is unbearably annoying throughout."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Monkeybar-2-323170",
        "review_rating": "4",
        "review_title": "Rose Hathaway, Dhampir protects her best friend Vasilissa Dragomir from Strigoi",
        "review_detailed_main": "From reading of the series, I considered the downfall of the film. Most of what I seen has been not met by certain standards although some elements apply to screen writing as pure dumbstruck. For the least of the doubt, there hasn't been a film in which was ranked the lowest of votes. Some would argue otherwise. Since Vampire Academy's release in February 2014, one out of three people have viewed this and questioned the value of the making of Vampire Academy. The judge persists on audience on how it was reach to target young adults to like liking of vampires such as Twilight. With the world watching the romance of a human and a vampire suggests that it sold out many tickets than what was made from the film I saw February 14. In conclusion, the film ranked to be the top 100 worst film ever made\n\nAfter reading and watching the first book leading to the next six there were some insights recognized that didn't make it in the first review. First of which the humor spread to a sensual outlook followed by an emotional debut between Rose Hathaway (Deutch) and Dimtri Belikov (Koslovsky). In many cases the idea of friendship striked up the audience well to see the difference between two people who care for each other--acting and the other to be yourself--reality."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "therealrumena",
        "review_rating": "3",
        "review_title": "A cringe worthy attempt to reboot Mean Girls with vampires",
        "review_detailed_main": "It's safe to say that many of those who have read the Vampire Academy series were looking forward to this movie. To be clear, I had low expectations when I walked into the theatre - the first book of the series was by far the worst, so the movie didn't really have much to go on in terms of success.\n\nThe beginning of the movie is very fast paced. It's harsh to say that even the first two minutes (a flashback for Rose and Lissa's backstory) was very bland and downright painful to watch, but it's true. Once you get past that, you're suddenly caught in a present day situation where the dialog is very choppy and sets a quick pace. Before you know it, you end up meeting Kozlovsky's Dimitri, and get dragged back to the name sake of both the book and the movie (before it was called \"Blood Sisters\"), the Vampire Academy.\n\nFrom this point onwards, you're forced from one situation to another, again giving a choppy feel. As someone of whom has read the book, when the producers, directors and even the author to the book said that the movie was true to said book, it's the truth, though it's a cut-and-paste situation. Situations that are taken from the book are placed into the movie, but are not done at all well and are often left unresolved.\n\nIt was a great concept for a movie, but it was honestly not done at all well. A combination of better direction, casting choices (performances by Rory Fleck-Byrne, Claire Foy, Sami Gayle and Olga Kurylenko were all forced, bland and occasionally cringe-worthy) and a better use of the plots from the book could have saved this movie from the disaster that it was - also, had the directors not treated it as a Mean Girls reboot with vampires, it may have turned out much better.\n\nHonestly, they could have done with skipping the first book and gone straight with adapting the second - Frostbite would have made a much better movie."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lillian_mcleod",
        "review_rating": "1",
        "review_title": "Awful, Don't waste your time watching it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jpmmw1998",
        "review_rating": "10",
        "review_title": "Gem of a Movie, I hope they continue to make more.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "MB-reviewer185",
        "review_rating": "5",
        "review_title": "Vampire school",
        "review_detailed_main": "I did not expect much going into Vampire Academy (2014), mostly because I like vampires and they have not made many good movies with them.\n\nVampire Academy (2014) was just the movie Mean Girls (2004) but with vampires and magic. It turns out the director is the same director as Mean Girls (2004), which makes sense.\n\nThe main characters were standard and can be annoying to watch, but one of them does have a backstory and the movie could have spent more time on it. The other vampire characters are just bullies or love interests that are there to mess with the main characters.\n\nThey setup the world the movie takes place in which was interesting, the villain was stupid, and it was hard for me to follow what was going on. The fight scenes are to watch because of the shaky cam and multiple cuts.\n\nThe magic effects are not that bad but there is a scene with wolves that bad CG. There are references to the movie and/or book Twilight, and the way they setup the rules and the things you can do at the Vampire Academy was a promising idea just not used right.\n\nI have not read the book series by Richelle Mead but after watching this I would think the books are better than the movie. The movie was standard, and the screenplay was not put together right, but the movie had some promising ideas they needed to play out more.\n\nI cannot recommend watching this, but if you have read the books, you might like it."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "capone666",
        "review_rating": "4",
        "review_title": "The Vidiot Reviews...",
        "review_detailed_main": "Vampire Academy\n\nThe weirdest thing about an academy for vampires is that the school's team mascot is a hemophiliac.\n\nUnfortunately, this romantic-fantasy doesn't feature any sports.\n\nFollowing her parents' tragic death, the vampire princess Lissa (Lucy Fry) and her smart- alecky protector Rose (Zoey Deutch) runaway from the academy and live among humans for two years.\n\nSuddenly hunted by a legendary race of vampires, the girls are forced to return to St. Vladimir's Academy, where Lissa's latent powers begin to flourish.\n\nBut those powers prove desirable to a secret cabal intent on harnessing them.\n\nElsewhere, an instructor (Danila Kozlovsky) teaches the impetuous Rose the fighting skills she will need to fend off an imminent onslaught of vicious vamps.\n\nWith vapid romances, infantile dialogue, and grating performances, this adaptation of the Teen Lit book series is a bubble-gum depiction of a once formidable species.\n\nBesides, how can teenage vampires suck blood with braces on?\n\nRed Light\n\nvidiotreviews.blogspot.ca"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "leonblackwood",
        "review_rating": "4",
        "review_title": "CSI for Vampires! 4/10",
        "review_detailed_main": "Review: Personally, I wasn't that impressed with this movie. It reminded me of a CSI for Vampires because there is a lot of investigating and not that much action until the end, when the plot unfolds. The main character reminded me of Juno, who just doesn't stop talking and makes a joke out of everything, but she did add some humour to the movie. I wasn't that impressed with the CGI and the storyline does get confusing in some parts, but it's a watchable film, even if your not into vampire movies. The concept was quite good, which does make me think about reading the book, but I personally think that the Twilight franchise has taken over this genre. Watchable!\n\nRound-Up: I haven't really seen any of the actors in this movie, before except for Gabriel Byrne who is famously known for The Usual Suspects. Zoey Deutch, who plays the main character, also starred in Beautiful Creatures, which was another mystical type of role and judging by the ending of this film, I'm sure that were going to see her in the sequel. All of the other characters wasn't that outstanding but I blame that on the material. At the end of the day, it's what it says on the tin, which is why it didn't blow up at the box office.\n\nBudget: N/A Worldwide Gross: $15million\n\nI recommend this movie to people who are into there vampire movies about a girl whose about to take over the vampire academy if she can surpass the evil doers. 4/10"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "j0hn22",
        "review_rating": "4",
        "review_title": "One of the worst vampire movies I have ever seen",
        "review_detailed_main": "First of all, when I first watched the trailer of the movie I kinda liked it, but I didn't had high expectations about it. Eventually, it was as bad as I had imagined and I didn't enjoyed it. The plot of the movie was kinda interesting, but not mysterious, nor innovative. Sadly, the storyline wasn't well-written, nor well-explained and it was very boring. The characters weren't interesting and they weren't well-developed. The filming location of the movie was mainly inside the university. The casting of the movie was fine and their performances were descent. In my opinion, it wasn't an intense movie and there weren't many action-filled scenes. Also, it wasn't bloody, at all and there weren't any scary scenes. I have to admit, the first part of the movie was kinda interesting and promising. However, the 2nd and 3rd act were both terrible. Overall, \"Vampire Academy\" wasn't a nice film, it was slow paced, uninteresting and I wouldn't recommend it to my friends. Last but not least, that movie doesn't deserve a sequel..."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "katrinesseverinsen-42395",
        "review_rating": "1",
        "review_title": "probably the worst movie, right after Sharknado..",
        "review_detailed_main": "Sharknado was so bad, and i might think this is a runner up.\n\nFirst of all, this is like the vampire diaries f****d Twilight, and this is the result.. like what? After all the vampire s*** that has come out, this is just a big no no. - And not even the dudes where hot.. like thats just not fair.\n\n5 reasons why it is bad:\n\n1.bad acting\n\n2.cliché script\n\n3. the blood looked really fake\n\n4. Too much teenage-love drama.\n\n5. like, just why?\n\nBut yeah, if you are into that s***, then you'll have a blast.'"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "theundomesticfangirl",
        "review_rating": "10",
        "review_title": "Vampire Academy is sexy and comic!",
        "review_detailed_main": "This is the best possible movie adaptation for Vampire Academy book. Mark Waters and Daniel Waters did a great job in turning the pages onto the screen. Not only will it satisfy the fans of the series but also the movie goers.\n\nIt has drama, comedy and romance. But unlike so many other teen movies, this focuses on friendship. The bond between two girls that leans on each other when no one else does.\n\nFor fans: Remember when most of the fans are so worried that it will be like Mean Girls or that it has too much comedy in it? The movie has flaws but I can vouch that the movie is as much as possible very true to the book.\n\nMost of the cast was perfection. I'll admit I had doubts with Danila Kozlovsky playing Dimitri, our Russian God that we so badly wanted to be portrayed perfectly. And he did. He did it wonderfully.Danila Kozlovsky IS our Russian God.\n\nZoey's take on Rose was spot on. She delivered all her comic lines smoothly.\n\nLucy's acting was pretty cool too.\n\nDom... He is perf.\n\nAnd Sarah, we all knew she will be an awesome Natalie and he delivered.\n\nDirecting of Mark Waters is flawless. Who would even doubt his talent?\n\nScript of Daniel Waters was spot on. There were some changes made but it was important for the film to be more composed."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "sandyphy17",
        "review_rating": "1",
        "review_title": "I do not recommend",
        "review_detailed_main": "I really don't like this movie its like nearly two hours of tired tropes and poor writing, coupled with all around poor performances specially Zoey Deutch(Dhampir) & Lucy Fry (Moroi). They both even not looks hot & not acted well.\n\nI didn't feel any connection to the characters. Everything felt like plastic (specially Zoey Deutch; don't have ability to carry responsibility of such role. oh girl either change your profession or audience will kick you out), everyone's face was constantly caked with make-up.\n\njust like waste of money & time. The concept isn't good. its so bad as it can.\n\nAll of the special effects through the film were just poor, and were not nice to look at.\n\nI do not recommend.\n\nits boring and hopeless movie.\n\noh my god why their is minimum 1 if any chance then i can marked this as in minus vote."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "misskrissy85",
        "review_rating": "1",
        "review_title": "Where do I even start...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "alainabergstrom",
        "review_rating": "3",
        "review_title": "If someone made a film from the sparknotes writeup",
        "review_detailed_main": "This film has the feel of bad fan fiction. Honestly the only decent portrayal is that of Rose, but even then the writing is so choppy that it's hard to watch. The headline says it all. It feels like they made this movie using only a summary of the source material as a guide, rather than the source itself."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ada-767-840531",
        "review_rating": "1",
        "review_title": "I don't like it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hrkoon98",
        "review_rating": "9",
        "review_title": "As a Fan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Sammy-gg",
        "review_rating": "10",
        "review_title": "I loved this movie",
        "review_detailed_main": "I went to see this movie with my friend who had read the first book, i however had not. I was not really excited because i remember seeing commercials on television and i thought it looked terrible. I was actually very pleasantly surprised. I loved the movie and it was very easy to understand. You do not need any prior knowledge about the film and i can honestly tell you that you will become hooked. I went out the next day and bought the first book in the series and i have already started reading it. It was so good that my friend and i are going to see it again this weekend and we are bringing a bunch of friends to do our part in helping to raise money for the movie because we want a sequel. My friend is very happy now because she got me to join the vampire academy fandom. Over-all i would say this was a great movie, well worth the time and the little amount of money. It is good for anyone that is a teen or older. You will not be disappointed if you go and see this movie, I can promise you that."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "kkelsoe",
        "review_rating": "10",
        "review_title": "I loved this movie!",
        "review_detailed_main": "Go see this movie!! If you are on the fence about it or if you have read bad critic reviews, listen to me! Give this movie a chance. It is a wonderful series that deserves to be given a chance in Hollywood. This movie had flaws, of course, but it's a low budget YA book to film. Of course there were flaws. But the acting and casting was phenomenal. They could not have picked a better Rose, Lissa, Dimitri, or Christian. The bad critic reviews are so disheartening because they honestly don't know what they're talking about. I guarantee you the majority of them have not read the books. They don't know the characters or care. I am a fan of the book and now I am a fan of this movie. It deserves a sequel. Give it a chance!!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "trims_gimti",
        "review_rating": "10",
        "review_title": "Movie worth watching!",
        "review_detailed_main": "If you haven't read the books, I strongly recommend talking to someone who has, they can explain things you may have missed or don't quite understand. It's not the best adaptation but its mostly true to the book and that is very important. I think that VA is amazing, funny and movie for all ages. It cannot be compared to Twilight and HP because red line of the story is completely different! I just don't understand why people are bringing them up all the time. Is it because they cannot think of anything else to compare it to? Or they probably don't even take time to actually consider everything. So why write a review if you don't understand VA? VA has it all; action, humor, romance, sarcasm and an incredibly portrayed friendship. Only flaw that movie has is that it's too short, low budget is to blame i guess. All in all, VA is definitely worth watching!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jess2354",
        "review_rating": "10",
        "review_title": "So great!",
        "review_detailed_main": "I'm a huge fan of this series by Richelle Mead so I have been waiting to watch this movie for years! And I was not disappointed! Funny, witty, dramatic, everything is there! The main plots from the book, even lines, are kept! Of course, some things have been added but they spice up the scenes and make them more visual. I really enjoyed it! Sometimes, there were some pacing problems but it was okay, as we were seeing Dimitri, Rose and the others on the big screen. The actors managed their roles perfectly, they were all so good, especially, Sarah Hyland, who is amazing! Really, fans, non-fans, go see it, you won't be disappointed!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nmmenchio",
        "review_rating": "10",
        "review_title": "Better Than Expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "chardonaytje",
        "review_rating": "10",
        "review_title": "awesome!",
        "review_detailed_main": "Just saw the movie in The Netherlands, and loved it! They really stayed true to the book.( I was afraid they wouldn't after i saw a couple trailers and stills. ) But they were a few moments when i thought, its a bit to girlie compared to the books, but that didn't changed my view of the movie at all, cause it was fun to watch! I even had my doubts about the actors, i was afraid they choose the wrong persons for this movie, but they really did a great job! And i thought the fight scenes were done amazing, and the other special effects were done good! I loved it and cant wait for Frostbite!\n\nP.S. This movie doesn't look like Twillight at all! Its not creepy, its not boring, it is an original story and really fun. to see! I would advice people to just see it!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "shadowfate-924-98003",
        "review_rating": "10",
        "review_title": "Excellent Adaptation of an Excellent Book",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ihatespike",
        "review_rating": "10",
        "review_title": "An absolute pleasure!",
        "review_detailed_main": "I went to see this film unsure of what to expect, and I came out very happily surprised.\n\nThis movie was a blast from start to finish, and a faithful adaptation of its source material. The actors were fresh and lively, the dialogue was witty and the plot moved along fluidly. Never once did I have to cringe at corny one- liners, awkward choreography, maudlin leading ladies or wooden love interests. The CGI wasn't overused, the kissing scenes didn't drag on, the fighting was thoroughly enjoyable and I easily grew to love the protagonist and supporting cast.\n\nIf you have some trendy hatred towards vampire movies then you may not like this, if you don't like the books you won't, if you don't like teen movies you may not, but I myself loved it. It's the clean sensation of a whole other world opening up to me that draws me in to stories like this-often Young Adult fiction is reduced to the lowest common denominator and marketed that way, but when the formula is done right it's worth weeding through the ones that suck to find it. 10 stars!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "MSanders1040",
        "review_rating": "9",
        "review_title": "A refreshing, new and modern spin on an overwrought genre",
        "review_detailed_main": "Vampire Academy is based on a popular series of books written by Richelle Mead. The movie is a great watch just for the dialog and humor.\n\nSure, at first trailer glance it can be pitched into the pile of already has been YA fantasy movies and overdone vampire series of late on T.V. and films. But this movie( and series) is in a league of its own, smart,complex, funny, easily approachable by non-fans. Vampire Academy is a separate entity from it's predecessors and not very comparable to that which we have already seen( especially in the YA fantasy genre). This is because the stroy line focuses less on the fact that the characters are vampires and more on the relationships and struggles the characters have with each other.\n\nMark Waters and Daniel Waters are the ideal choice as director and writers to helm the initial on screen adaptation of the first book. They bring the experience necessary to translate the particular situations we find the two main female leads in. The actors and actresses have done a good job in their respective roles, better than would be expected. Zoey does a great job with the timing of the one-liners.\n\nVampire Academy has( and I stress this) potential in a future series and just needs to be given a chance by screen goers, who will not be disappointed, but hopefully surprised.\n\nIn conclusion my two cents of the film is that it delivers on what it was marketed for, it's entertaining, action packed, and quick witted."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "angelfajkus",
        "review_rating": "10",
        "review_title": "is it a good movie and is it worth it",
        "review_detailed_main": "This was a really good movie that people should give a chance. Just because it has vampires doesn't mean it sucks just read the books. Anyways yes there's 3 types of vampires and yes they go to school and some can do magic but the main story is about two best friends who are bonded together and what they go though as they try and survive high school (bullies, depression, cutting, not fitting in) while also learning how to survive themselves for when they leave the academy and are faced with protecting each other from the evil Strigoi! It's a funny,dark,serious,happy,sexy movie. So please like they say 'don't judge a book by it's cover' or in this instance a movie by it's title. Also lots of other authors have tweeted in congratulations to Richelle Mead about her movie coming out and how they are excited to watch it! So if other authors are exited about it and want it to be a success when they also have movies coming out this year that should tell you something. Another thing there are lots of bad reviews out there written by critics who didn't get a advanced free screening of the movie and had to watch it with the rest of society and are taking their anger out by writing bad reviews so the movie will fail! So since this is being written by a fan do u wonder is the movie perfect? No, there are some little things i didn't like but that's how it is with every book to movie adaptation there are going to be things you don't like. But mostly i really liked it and want to see it again and again!:D So if you want an honest review find one of the few good one's by the critics or find a VA fan review or even an non VA fan review because they will be better reviews. I just really ask is if you have read this entire post than it means you are interested in if the movie is actually good or not. :)SO PLEASE GIVE IT A CHANCE BEFORE YOU JUDGE IT JUST LIKE YOU WOULD A BOOK OR A PERSON.:)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "cari_carter",
        "review_rating": "10",
        "review_title": "Awesome Movie...Better than Expected",
        "review_detailed_main": "After seeing the first few trailers, I honestly expected the movie to be cheesy and not stay true to the books. After seeing the movie twice now (in two days), I have to say I am pleasantly surprised with how well the adaption stayed true to the books. Parts of it were funny, other parts were a bit odd, but overall, it felt like the novel. If you liked the books, you should enjoy the movie. There were a few things added to the movie, which added surprise and intrigue for those who have read the books, as well as a few things they left out that I really WISH had been in there (like more Rometri). Again, I was pleasantly surprised by the movie! I want to see it again! I really hope they continue on with the series and make Frostbite. Looking forward to owning it so I can watch it many more times! :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "BWeva",
        "review_rating": "10",
        "review_title": "Omg, That's all I have to say!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Kareneo",
        "review_rating": "10",
        "review_title": "I'm giving this a 10 because it is the cure for Twilight movies!",
        "review_detailed_main": "Yes, this movie takes a while to hit it's stride - and to be honest the first 10 minutes had me wondering whether I could go the distance, but the actors and the script had a degree of charm that kept me watching, and lo and behold, it improves greatly as the story unfolds. Heaps of fantastic, witty quips (particularly well delivered by the lead actress) and quite literally this movie is everything the incredibly boring Twilight movies should have been! So to summarize, I give this movie 10 stars as it is the cure to sh*thouse films like Twilight that make you want to die in a hole because they are so tedious. Great fun! So to summarize, I give this movie 10 stars as it is the cure to sh*thouse films like Twilight that make you want to die in a hole because they are so tedious. Great fun!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "dngn_rdr",
        "review_rating": "9",
        "review_title": "Far Better Than I Expected And Deserving A Sequel",
        "review_detailed_main": "I had started to read the books though didn't get far (not the fault of the books) and decided to see the movie anyhow despite reading mixed reviews. I wasn't expecting a bad movie (or I wouldn't have gone) but I wasn't expecting it to be as good as it was - I thought it was a great movie and far superior to the other vampire movie which got so much publicity and attention (which will remain nameless).\n\nI think Zoey Deutch really made this movie, though several other actors were good in their roles she was almost flawless in my opinion - though I can't speak for how many takes that took. I really hope this movie turns into a series and gets a lot more support and the audience it deserves."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "waynerad",
        "review_rating": "9",
        "review_title": "Amazing if you can get past the issues understanding the story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nikola17",
        "review_rating": "8",
        "review_title": "i thought i was going to hate movie but i didn't",
        "review_detailed_main": "The movie was actually really amazing It stayed true to the book, only changing a few minor things or adding a few things. The actress who plays as Rose was 18 while filming, only a year older than Rose. Yeah, Dimitri was a little too old, but the actor playing him was 27 at the time, only 3 years older. The girl playing Lissa is little too old, but it didn't really bother me all that much. And Rose does have a silver stake, but the writer said he wanted to make things a little more interesting and decided to give her a stake in the first movie. It actually made it a little better to see that the guardians are training their novices with stakes earlier. Overall, I found everything to just be so awesome and amazing. The trailers did NOT do justice.﻿ i was thinking this is girl version of Blade but it wasn't it, it was different movie not like Twilight crap expected the actors can act better (Zoey Deutch)she was pretty, likable character, funny,better then Kristen Stewart part i really like with Rose and Dimitri having romantic time gets close with Dimitri i like her fighting moves when she kills the vampires that was awesome kinda like blade she was Half Human Half Vampire kinda like Blade but in my opinion Blade was better. i never knew this movie was based on book ? sometimes when i look at new movies out in cinemas, later on you find out it's based on Book or Original Film this film got Hated got %10 At Rotten Tomatoes but i don't listen to the haters this movie come out in Australia March 6 i watched this movie when it almost ended because new movies comes out it push's all the way the last in list i don't like harry potter but this more violet action movie then Harry Potter but only thing is i know someone told me The movie bombed pretty bad at the box office (which sucks) and no one is sure what's gonna happen :/ The people who started the movie have hinted around at a Kickstarter, but nothing else has really been said. the advertising was just wrong, so I think if the posters would have been better and the trailers too, the movie could have done so much better. When fans saw the poster with the tagline \"they suck at school\" slapped on the front, they hated it and some refused to see the movie, especially after the first couple trailers. Lots of fans and non fans didn't want to see the movie, thinking it was going to be some huge disappointment. In reality, it was REALLY close to the book and nothing like what the posters and trailers said it would be. So, yeah, if the posters/trailers would have been different, it would have made a HUGE difference, in my opinion.﻿ i liked this movie good action scenes with Rose Hathaway fighting with Natalie good Showdown but i wish it could done it better because when they kill the vampires they don't really burn into flames i don't get that that what i wanted to be fixed. the werewolf's needs to be with not CGI but the wolfs don't do much in movie i like the sliver stake what rose use's witch is good i liked Dimitri the character witch was but it's true he was a bit old but didn't bother me as much i thought he wasn't bad ass as much as rose for me Dimitri didn't do much for me i thought he was good not great mostly this movie was good i didn't care for haters i never listen to the haters this is noting like twilight or everything like that but it is not real real vampire it is real but not really that much the vampires are more of guardians of the Moroi, peaceful, mortal vampires immortal vampires what ever they are but this movie was Amazing 10.10 not really for me i give it 8.10 believe me this not romantic twilight movie it is more of Action Comedy Fantasy movie but i like new actor Zoey Deutch She was amazing one of my favorite girl actress"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Reviews_of_Canned_Ice",
        "review_rating": "9",
        "review_title": "Good old vampy entertainment",
        "review_detailed_main": "Zoey Deutch IS Rose Hathaway. Perfect casting there. She delivers the kick-arse role with firey sarcasm and the sweet sassy molassey manner you'd expect if you'rea fan of the books.\n\nI personally didn't mind the approach of \"mean girls, but with vampires\", it worked! Sure there was some serious cheese at times that probably could've been avoided if a little more thought was put into it. Obviously being a first person novel that follows one main character can be difficult to flesh out but they did a pretty good job of staying true to the books. It would have been fantastic to see the storyline and character relationships build and progress and the dhampir/moroi world grow in sequels. I think it was a real missed opportunity not pursuing follow on movies.\n\nThoroughly entertaining and well cast. Will watch many times more than I already have."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "s-pattz",
        "review_rating": "10",
        "review_title": "Vampire Academy is Awesomepossum!!!",
        "review_detailed_main": "I've been a fan of these books 7 years now I've been also supporting the movie since 2010 when they decided to make it a movie! I can guarantee you Vampire Academy is a very Beautiful movie! It is Very Beautiful people! I can even categorize it in one suspect! It has LMFAO humor, tons of action, romance and BRILLIANT/clever/sassy dialogue!!! The casting was wonderful! Zoey Deutch, Sarah Hyland and Danila Kozlovsky were definitely the stand out performances of the movie! I LOVED IT. Totally LOVED IT! If you are asking me how close it is to the book I would say probably 80% !!! The 90% of the movie is from the book and the 10% is some background info etc for the non readers! Go see it everyone! Is a MUST SEE! Is so different from any other YA adaptions! Vampire Academy DEFINITELY DOESN'T SUCK! :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "halfie1221",
        "review_rating": "9",
        "review_title": "Loved the books, liked the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "MissEmilyReagan",
        "review_rating": "10",
        "review_title": "Vampire Academy",
        "review_detailed_main": "I became a huge fan of the books about 4 years ago and have been waiting for this movie ever since! It lived up to all my expectations! 5 out of 5/ 10 out of 10 for me! As for it being accurate to the books I'd give it a 8 out of 10. This is a situation where it's a good movie/story with a really bad name! Don't let it fool you. If you're a fan of smart-ass humor this is right up your alley! It's got brilliant lead females who can hold their own, which is what sets it apart from say, I don't know, TWILIGHT! There is definitely more to this movie than the awful trailers and somewhat cheesy poster. As a fan who would like a sequel I say, please go see the movie. If anything it'll make you laugh!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lillyvasile",
        "review_rating": "8",
        "review_title": "Enjoyable and fun",
        "review_detailed_main": "I just saw it last night, and I did read the first 2 books in the series before this. I have to say that aside for special effects not being too big, this is a very enjoyable and fun movie. It left me with a pleasurable feeling of wanting more of it, which is always a good sign. So I went home and started the third book right away because i just wanted to stay with the characters a little longer. I am not sure why American critics are not happy with it, but then I do not trust their opinion. There are so many great movies and TV shows which do not get recognition because sometimes Americans have a warped sense of what is good or not. This is not a big drama, not intended to get an Oscar,no big names who are gaining/losing weight for a coveted award meant to raise their paychecks. It is just a funny, smart conversational, pretty angst-y teenagers story. Kind like Buffy in their first season :). Zoey Deutch should get credit for being very good in it, great facial expressions and good timing on jokes and drama. I would definitely go to see any sequel from now on."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nicole-yordan",
        "review_rating": "10",
        "review_title": "Great Adaptation",
        "review_detailed_main": "The movie itself isn't the best movie I've seen by a long shot. However that being said, this is a great adaptation of a YA book. I have read all the Vampire Academy books and while I probably had higher expectations for the movie the truth is that this is pretty much how the book goes. The actors did a great job portraying the characters personalities and bringing them to life. Movies tend to condense books and leave what they consider non-essentials out. Nevertheless, this movie did a great job of condensing the series of events occurring in the book in a short period of time. I myself enjoyed the movie because I enjoyed the storyline and have some insight to what is to come.\n\nMy boyfriend, whom accompanied me to see this film, did not enjoy the movie nearly as much as I did (he did not read the books). Like Twilight this film is geared more toward women and those who are hopeless romantics. If this is not you then you probably wont enjoy it as much. It has a few funny lines here and there but it's not a comedy at all, so don't expect it to be.\n\nIf you're not a fan of YA books and newer vampire movies, you probably wont like this movie. Neither this or Twilight will satisfy your craving for something similar to Interview With a Vampire... sorry to say."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "raya-de",
        "review_rating": "10",
        "review_title": "The review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "kimberlycuadrado",
        "review_rating": "10",
        "review_title": "haters back of the movie is great",
        "review_detailed_main": "i loved the movie and haters first see the movie if your going to judge it the way because it has nothing to do with twilight or with harry potter so stop being rude and disrespectful.just because of you many people who loved this movie and want to see more wont get that chance because your screwing it up for them. and maybe the people who wanted to see it don't want to because of all the bad reviews that you haters are putting out their.their are many fans of the book out their but because of you haters out their this movie isn't going to be seen. I don't understand why you are doing this for what even if you don't like vampire movies at the end of the day you don't need to watch it OK so back of ."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "guardianlove23",
        "review_rating": "8",
        "review_title": "Vampire Academy Surprised Me.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "keh793",
        "review_rating": "10",
        "review_title": "A cinematic adventure that was worth the seven year wait",
        "review_detailed_main": "Vampire Academy: Blood Sisters was in a word, hilarious. Mead's original dialog was amazing, Waters took her guidelines and wrote a superb script that left my friends, and I doubled over in laughter. Zoey Deutch's delivery and timing were hysterical. Moreover, her on-screen chemistry with co-star Danila Kozlovsky's was every bit as thrilling and romantic as I had hoped it would be from the books. The romance was a nice reprieve from all of the high school angst (which frankly bored me but a bit but I believe the angst to be an essential piece to the beginning of Rose and Lissa's \"coming of age\") but it didn't take away from other elements of the plot. The casting was splendid across the board. I've read several criticisms on the \"white washed\" lead actress and I firmly believe that if you have any respect for the art of acting, then you won't give a damn that Zoey Deutch doesn't look exactly like the Turkish desert princess (despite actually having a heritage closely resembling that of the character she portrays). Zoey Deutch took the role of Rose and played her with all the attitude and bravado that I connect so deeply to from the books. Let me bring your attention to Danila Kozlovsky. I was thrilled to find out that the studio had gotten an actual Russian actor to play such a key role! Russian is one of my favorite accents and is one of the hardest to fake believably and listening to the actor play with his natural accent made all the difference in the world. I commend Lucy Fry and Dominic Sherwood for their valiant efforts, but when Danila walked on screen and delivered his opening line, oi, my heart fluttered. I have been waiting for this movie adaptation for seven long years and the wait was worth every second!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "evelynaguayo01",
        "review_rating": "9",
        "review_title": "vampire Academy rocks",
        "review_detailed_main": "What can I say about this awesome film. Absoulutly loved it. Vampire Academy had a little bit of everything. Zoey, Danila, Lucy, and the rest of the actors did a fantastic job at playing the characters. I have been a long time fan of the book series.I agree with the author Richelle Mead, the movie did stay true to the books. I hope, pray, and wish their will be a part two. Vampire Academy fandom don't we all want to know who is going to play Adrian, Eddie, and hopefully much later Sydney? I highly suggest you watch it. And in all honesty I'm going to go watch it again. The more people that watch it, the higher possibility there will be a part two."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "bennie538-725-685483",
        "review_rating": "10",
        "review_title": "Amazing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ashleywallace77",
        "review_rating": "8",
        "review_title": "Review",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "eeyore1139",
        "review_rating": "10",
        "review_title": "VA was an all around great movie!",
        "review_detailed_main": "First of all, know that this movie is for a certain demographic. Will a 32 year old guy get a kick out of it? Probably not. But for those who are needing a YA series to follow, get on the frickin' bandwagon because this movie is FANTASTIC! As a reader and devout fan of the books, I was terrified that the movie would ruin the books for me. Though still excited, Hollywood hasn't exactly produced a lot of books-to-movie that stayed true to the novels themselves and all in all failed to pull in new fans. The Marks brothers, however, did AMAZING! To begin with, I loved ALL the character choices. Lissa, Mason and Mia were spot on, Rose and Dimitri were FLAWLESS together (chemistry is off the charts) but the person I was the most surprised by was Christian. I'm not saying I loved him more then Rose and Dimitri, but everyone's going on and on about them and I feel like Christian was just as important of a character and was portrayed extremely well.\n\nThe story was great and was very entertaining. The witty quips combined with a nice amount of drama kept me hungry for more during the entire film and I left with a desire to see it again immediately! Yes, there is a cheesiness factor and yes, there is some acting that makes you raise your eyebrows but really... come on. It's a teen movie. Get over it. It was a really great movie that was worth the wait that the VA fam-bam has been salivating over for years! Go watch it! You won't regret it!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "meliko94",
        "review_rating": "10",
        "review_title": "I really loved it!!!",
        "review_detailed_main": "Actually when I went for see this movie I had mixed feelings. I was wondering \"C'mon how will it be?\" and after I saw the movie I got angry to me because I really loved movie. Like when I first saw her I thought Zoey was to skinny but after I saw her acting I realized I was wrong. And there is nothing to say about Danila Kozlovsky. Just like Dimitri he is a God. I enjoyed every minute of this movie and I want it to continue. Okay may be box office isn't much but I think it's because they could not make the advertisement very well. And okay it could've much more tech in special effects but it's not that bad. I hope they will consider the things that I say for second movie(If it'll happen and I very hope it'll happen)They were very loyal to the book and I loved that too. If someone is reading this please make other books too."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "safura11",
        "review_rating": "10",
        "review_title": "Vampire Academy is not another cheesy vampire movie",
        "review_detailed_main": "Despite what some people have been saying about vampire academy being a cheesy twisted version of \"Mean girls & Twilight\",I watched it and to my utter astonishment I loved the movie. I did enjoy every little turn out of the events even though I've read the books first. Normally I would always prefer the books to the movies but this one is exceptional I guess. I don't think it's just another cheesy vampire movie neither it is a mean girl twisted version. It's something else. Yeah maybe the trailer represented a twisted version of the movie but if you take a leap of faith and watch it, I'm pretty sure you'll like it. The characters were just perfect. I don't know why some people are complaining about Zoey playing Rose and Danila playing Dimitri cause they were just incredible. You can see how hard they'd worked for their roles cause every little detail of the book matches. Sure it's not going to be everything like the books you have imagined to be but if you already know everything then what's the fun in that? And trust me when I say you will not regret watching this movie even if you haven't read the books first cause it's just that incredible. And to some \"any kind of vampire movie haters\" Please don't compare it to Twilight cause it's nothing like that. Like a famous person once said, \"Don't judge the book by its cover\" I'm telling you not to judge the movie by its trailers. Watch it and then regret watching if you have to but don't do the other way around. The plots were perfect, there was humor, romance, action - All in one movie. I'm looking forward to watch the other sequels of this series so please stop complaining and let them make other movie versions of the books. Don't spoil this for the people who actually enjoyed the movie and are eager to watch the next part. Well some of you have sat through the whole twilight series, so why can't you show a little bit support on \"Vampire academy\" which by the way is so much better than regular vampire movies (no offense). And some of you people are complaining about the age thing, well you have the read the books right? So yeah, the age gap is supposed to be noticeable. I don't think anyone could've done a better role than the actors and actresses of this movie themselves. So in total, go watch the movie, you'll enjoy it. Even if you don't, don't spoil the chances of creating another sequel movie for those people who have loved it. Once again don't judge the movie by its trailers!! Enjoy!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "tadpole-596-918256",
        "review_rating": "8",
        "review_title": "This movie fails to lower itself to its target audience . . .",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "brooke6790",
        "review_rating": "10",
        "review_title": "People don't know what's good!",
        "review_detailed_main": "I honestly love this movie, maybe it didn't hit all the points but what book turned movie ever does. I'm tired of broody vampires, ones questioning their humanity and such. There was no brooding, no hopeless romantics really going on. I May be a little bias since I've read the books, but I think all that does is give me a better understanding of the back story. I love the sarcasm that may be laid a little thick, but in all honestly it rings true to how I act around my friends and such. There is a level of realism in the fiction. Suck that only half of the budget was made back, but I hope it does not Keep it from some day having it's sequel. And if I'm being honest to refer to my title, people don't know what's good. I mean there dozens on installments of Jason, Freddy, saw. South Park an the Simpsons have gone on way too long. Twilight was able to finish is series as as moves and there was no real depth to the story. Laden with so much unhappiness that the happy parts don't feel so happy, more of a we have to have a happy ending so let's make sure it happens. I know my review seems to not be solely about Vampire Academy, but it baffles me what people consider so good to keep making more when they should have stopped before the first was released. So I think that Vampire Academy is a little in your face and maybe a bit confusing if you can't keep up. But as a whole the story is of course good seeing that there are 8 books. The execution of the movie may be a little More specific to whom their audience is but in no way would I call this a flop movie."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "auburngrl21",
        "review_rating": "10",
        "review_title": "sequel",
        "review_detailed_main": "good enough for the sequel please make the sequel not all of us are haters of vampire movies I loved the books just because some people doesn't like it then they don't have to get it or go see it I know I watched the movie 100xs and read the books 100xs so please make the sequels vampire academy is the best movie there is besides twilight series even they are making another one!! vampire academy needs to have sequels too like: fast 7 , ride along 2, the expendables 3, red 2, percy jacksons series, divergent series, despicable me 2, the incredibles 2 , insidious chapter 3! so come on and make the sequels I can bet you I will buy them all :)"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "addyscollege",
        "review_rating": "10",
        "review_title": "I loved it",
        "review_detailed_main": "I have read all six books twice. I must say that the movie doesn't exactly portray the ambient, the suspense, the passion the books do BUT the movie was fun to watch. To get the real deal I would recommend reading the books, they are amazing. Anyhow the movie was fun, was funny, was very entertaining. I would definitely recommend this to a friend and I certainly would watch it a couple of more times. You must be open to what the movie brings, if you are constantly comparing it to the books well, you won't like it. I really hope they film a second movie.But will all those bad comments people are writing I really don't know if another movie will be filmed."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jtchill-68-659289",
        "review_rating": "10",
        "review_title": "bad marketing",
        "review_detailed_main": "Because I have read all the VA series and currently on the Bloodline series. I knew what to expect as this is NOT \"Twilight\" this series is tons better. I was really hoping to get the whole series in film as it is well written and enjoyable. I felt the marketing and the line \"they suck at school\" made this sound like another Twilight goof. I really do hope that take a chance and finish the series. Even though this is a YA series, as someone who is a bit \"older\" I really loved the way the story is built, you really feel like you know these characters. In Twilight, I found Bella annoyingly needy. Rose and Demitri characters were great. I really want to see who will play Adrian and Abe, if they get that far in the theater. Hopefully, they will market it better than this one. Please don't use that stupid tagline anymore."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jeanacosta18",
        "review_rating": "10",
        "review_title": "best ya adaptation ever!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "lozzabr",
        "review_rating": "10",
        "review_title": "It converted my mother. O;",
        "review_detailed_main": "I took my mother to see VA, after I had seen it myself to enjoy the full impact of Dimitri offcourse(AND OMG!), afterwords I did what all die hard fans do; I asked if she liked it, a lot. My mother, who is to my shock horror not a reader or a fan of \"the supernatural\", said it was good (Obviously sending me into a blind rage). However once I'd made my dramatic entrance into my room, flouncing onto my bed in a fit of rage, my mother opens the recently slammed door, I know the audacity of her, and ask what the sequel to VA is. After telling her, so as to remain a loyal member to my fandom, she asks for the book. SHE ASKS FOR THE BOOK. THE BOOK. 5 days later Richelle Mead has done what I thought none could, but then again it is Richelle Mead people, and my mother is currently on the 4 book of the series and going strong. Now Richelle Meads brilliance is undoubtedly a main factor, after all she started it all, however to relate this review I would like to congratulate The Vampire Academy cast and crew for making such a good movie, because not only have I found it enjoyable but you have made someone want to actually continue the story, a great fete for any book to movie translation. However now I have a mother obsessed with Frostbite the movie release date, so please do me a favor and make sure you have one!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "blue-brightsmith",
        "review_rating": "10",
        "review_title": "Vampire Academy worth watching now, Divergent still a month away, and Zoey Deutch is very attractive.",
        "review_detailed_main": "Before watching Vampire Academy, I doubt that this film will be good, because a lot of negative reviews about it. Because not many good films were released in February, so I have to watch the movie not only Robocop. I know Divergent still a month away, so it would have felt bored waiting for a month without a movie worth watching.\n\nAfter Watching Vampire Academy, I am satisfied that this movie is worth watching. I do not care even if the film is not as big as Twilight, I still love the Vampire Academy because of the film itself, not its popularity. I believe that Vampire Academy have great potential to have sequel.\n\nSince watching Vampire Academy, I became really like Zoey Deutch. She is beautiful, sexy, and unique. I hope to see Zoey Deutch in the next sequel. So, I recommend to watch.\n\nConclusion: I really like Vampire Academy, especially Zoey Deutch."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "escott816",
        "review_rating": "8",
        "review_title": "Really liked it but why, oh why couldn't Dimitri be hotter!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "GoFrogUrself",
        "review_rating": "10",
        "review_title": "Finally a book adaptation that follows the path set by the book!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ajmccolley2",
        "review_rating": "8",
        "review_title": "Was OK!",
        "review_detailed_main": "Had high hopes for this movie but knew it was going to be less serious when I saw it was done by the same people who did Mean Girls. I liked the character choices for Rose, Lissa & Christian. Wasn't a fan of the way they portrayed Dmitri though, the actor who plays him is crazy handsome but I didn't find him desirable in the movie at all. Also wanted Rose to be a little more rugged and tough, she was way too pretty and preppy for what I expected. The ending has me hopeful for the second film but I hope they make it more \"adult\"-like instead of how teeny-bopper it felt. Another film that doesn't meet book expectations but willing to give them another chance for the second one! Please make it more serious!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "FamousGirlfriend",
        "review_rating": "8",
        "review_title": "Only decent thing I've seen in it's genre since Buffy, give it a sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "tarankaurk",
        "review_rating": "9",
        "review_title": "Book vs Movie",
        "review_detailed_main": "Having read the book, I am supposed to hate the movie and criticize it for everything. However, I actually liked it. The movie was very cheesy and it actually kept some components from the book. I absolutely loved it and am all for the sequel."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "grass_knoll_13",
        "review_rating": "10",
        "review_title": "Vampire Academy was 100% better than Twilight!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "aimee-m-s",
        "review_rating": "10",
        "review_title": "Trailer doesn't do it justice",
        "review_detailed_main": "I finally watched vampire academy on cable and all I can say is that it's completely not what I expected. If you are a fan of the books you will absolutely love this film. The main characters are well played. You will love the fun script and face pace. All I can say is sequel please\n\nThe scenes give you a good flow from how the books set up the scenes. I am very excited to this band of actors p,ah the roles through the series of books and Give us a view into this world.\n\nThe film drives us into the world of these young royal group of vampires coming of age and facing what we all know too well."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "BuzzHanks",
        "review_rating": "10",
        "review_title": "A Fun, Very Cinematic take on what a book adaptation should be",
        "review_detailed_main": "This is what the Twilight films should have been: A rousing, energetic, very enjoyable take on the vampire genre. It is well paced, full of charm, personality, and just feels very cinematic-ally presented.\n\nThe film tells its story through very clever uses of flashbacks that correspond with the dialogue and information presented (which quite frankly is recently lacking in not only book to film adaptations, but movies in general for that matter). It even showcases the film's 3 vampire types featured through use of words on screen. Including narration by the film's protagonist Rose (Zoey Deutch), making a star making turn reminiscent of Robert Downey Jr. in the first Iron Man, turning an often bland role into a charismatic, quippy, sarcastic, wise-ass deadpan, that along with an amazing supporting cast full of personality and wit (particularly Sarah Hyland's Natalie, bringing in an equally as amusing performance that stands out being very genuine), alongside the astonishing visuals and crafted storytelling, makes one feel as if they are experiencing a world, not just a work of fiction. The work is fairly easy to follow, and even if you miss some information, you get it back in later scenes that explain it when needed. It makes the movie re watchable many times over in a fun way to get even more pieces of the world presented that you missed the first time around.\n\nLike the final Twilight film, this movie showcases the different talents that vampires could have, from controlling fire, to having power over it and all other common elements such as water and air. The special effects to showcase those elements look surprisingly realistic for such a low budget film; you can feel like fire is realistically sparked, or that water is flowed from one source to the next. Some particular creatures featured later in the film are obviously CGI, but are nonetheless very well designed (directly from the author herself) and very kool to look at.\n\nTo speak of the action, it is well choreographed and exciting, plus even comedic at times. The way it is portrayed in the story is well done as a character arc. You feel the fight training that Rose goes through, and sense her determination to get better. This is another thing presented that is commonly lacking in most movies these days: actually showing how a character can not only do such extreme things, but how they FEEL doing such extreme things, which equals how they can do these things and not just all-of-a-suddenly have this ability to do these unique things and feel confident and genuine in doing them.\n\nHumor is a key element in this film, as it showcases Rose's true characteristic of sass and impulsive natures. Its not overly silly, yet adds onto the naturalism of a teenager's life, and the types of situations that they go through.\n\nThis film does suffer through some clichéd and somewhat stupid moments towards the 2nd half of it (though in hindsight, those moments were portrayed pretty well to lead up into what happens and to keep it simple and easy to follow). Yet, you find yourself more endorsed in the episodic structure that brings the feeling of high school life, while also portraying the feeling one has when reading the book and going through these episodic moments that lead up to the bigger story experience. It makes the film feel organic and natural, and not just a flat, simple structure to get from point A to B.\n\nI would recommended this movie for anyone who loves \"real life\" combined with fantasy, particularly high school drama that is not too fluffy, and relatable. A solid adaption that captures the mood, tone and energy of the books, and is viewable for those that have not even read the series.\n\nThe Author of the books even said that she LOVED this film too"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ox-tomova",
        "review_rating": "10",
        "review_title": "Not that bad, had weak points however",
        "review_detailed_main": "I've watched the movie 3 or 4 times now at least. And I can say that the movie might not be the best one out there but the script really tried to stick to the book and where it couldn't it didn't harm the storyline greatly (well, except one particular scene in the end).\n\nThe cast was done nicely. I wasn't from the people that said \"we should have him and him and her\" because the book for me really created the people with both their personalities and appearances in my head. Yet the cast didn't really disappoint me, as some claim it sucked. Most actors look similarly to their characters and managed to express the personalities they had to.\n\nAnd, well, to all the girls that complained about how Danilla (Dimitri) didn't talk with the \"unholy-sexy British accent\", he's a Russian (both character and actor). And Russians talk like Russians... Duh.\n\nThe script... Ah, in really tried to keep up to the book and failed at some points but in the same time it managed to tell the whole story in hour and a half. They added some more action, as the first book is more of a introduction than action-filled storyline. In the end we got a script a bit above the average and it was pretty enjoyable.\n\nNow, what really saddened me here - advertising. The trailers weren't around for too long and were almost non-existent in many countries the movie was supposed to appear in. And then it didn't even come out in many countries, even UK. And that really did bad to the box-office and made the down-fall of the production."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Ladyciara6",
        "review_rating": "10",
        "review_title": "Perfect",
        "review_detailed_main": "Vampire movies are hard to understand when done correctly. This one was most definitely done correctly. It is hard to keep track of the names but if you are a true vampire fan (twilight doesn't count), then you will love this movie. It also has a great deal of romance and a lot of twists and turns. I think that it's the best movie I have seen in a LONG time. Even my 50+ year old mother liked it. I recommend this book for people of all ages who love vampires and vampire movies. I think that this is boarder line girlie so the boys might not like it but my dad did so I guess it's OK for some. It does have a little bit of blood in it so if you are not OK with that then you might want to look away,"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jessica-harrison",
        "review_rating": "9",
        "review_title": "A great new take on the genre",
        "review_detailed_main": "VA may not have the most realistic fight scenes, but it more than makes up for this with its unique take on the vampire genre, coupled with characters you can't help but love. You just get engrossed in the world of VA and can't help wanting more."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "jacintaanderson1",
        "review_rating": "10",
        "review_title": "amazing",
        "review_detailed_main": "I put this on thinking it would make a good background movie while i did something else. Wow, it was so much better than the trailer. Who ever did the promotion for it seriously failed. The actors are amazing and talented and its fast paced and funny in the right ways. The script is flawless and i never once got bored or felt the need to skip ahead. I thought it might be all teenager pettyness and drama but not at all. The characters don't do dumb things and the plot is clever and exactly what a good movie/book should be. I have watched it again and again and its been a really long time since i liked a movie that much."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "ispeakenglish109",
        "review_rating": "10",
        "review_title": "Hey, I'm just here to be entertained. . .",
        "review_detailed_main": "It's obvious that books making the jump to movies is becoming the trend (not that it hasn't always been), and books about vampires are taking movie theaters by storm. I unfortunately can not stand to read books, so I end up watching these movies with no background (which is probably for the best).\n\nThe main reason I wanted to watch this movie was because I saw it listed in Olga Kurylenko's IMDb profile. After I saw the previews on youtube, though, I was interested in the movie for everything else it had(vampires. . .duh!, action, hot guys, hot girls, cool fashion, did I mention action?). I think if you had expectations for anything more than a teen girl action, romance, fantasy vampire flick, you were probably setting yourself up for disappointed. I went in wanting to be entertained, and that's what I got. I actually really enjoyed it. I'd say it was like a cross between Underworld and Harry Potter mixed with Pretty Little Liars.\n\nI'm looking forward to the next movies."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hahami-56244",
        "review_rating": "8",
        "review_title": "great romantic movie",
        "review_detailed_main": "Based on the bestselling young adult book series, Vampire Academy is a confusing and monotonous story. A half-vampire, half-human named Rose must protect a vampire princess from a mysterious assailant who is stalking her. The script is incredibly weak, full of explosive throw-ins that try to explain the vampire social order and provide a few ambiguous backstories for several key characters. Oh, and the acting isn't too good, although Zoe Dutch does have some charisma. Nevertheless, the vampire mythology is quite intriguing, and there is a fair amount of mystery in the plot. Vampire Academy is clearly trying to cash in on the popularity of young adult fantasy, but doesn't make much of an effort to create a quality product."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Trust-fate",
        "review_rating": "9",
        "review_title": "A surprise!",
        "review_detailed_main": "I was deterred from seeing this in the movies, the trailers and posters made me think they had taken the books and turned it into a joke film. I was imagining something similar to St Trinians. However after watching the DVD I am enjoyably surprised!!! I have not read the books for quite a few years, however it is quite well done! They mastered quite a few characters and kept the storyline quite close enough to enjoy both book and movie! I hope the poor critique ratings don't deter these guys from producing the sequels!! The viewers who have not read the books have not experienced the excitement of what is to come!!! This first movie has only given you a glimpse. The subjects they didn't leave answered are on their way in the sequels!!!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "cutiegurl8",
        "review_rating": "10",
        "review_title": "I love this movie",
        "review_detailed_main": "I really wish they would make the rest of the books into movies. I absolutely love this movie. Rose is amazing and Zoey Deutch is perfect for her! PLEASE MAKE THE REST OF THE MOVIES!!!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nogodnomasters",
        "review_rating": "10",
        "review_title": "THINKING IS FOR LOSERS",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "levato55",
        "review_rating": "10",
        "review_title": "Its sad to see these actors/actresses bashed",
        "review_detailed_main": "First off Ill start by saying I had no intentions of watching this movie being a 21 year old college student in a fraternity and by no means a usual audience for movies like this. With that said I love watching movies. I stumbled upon this movie and read the reviews bashing the movie and was pretty shocked too see such negative reviews. After watching this movie I thoroughly enjoyed the time spent. I had fun watching this movie and granted I did not read the book I found myself loving the characters and the cast that played them. People have said the movie is bad because the girls are too pretty and the guy are too macho? Really? ..... Really? who wants to watch a movie with ugly actresses. Not me. I have seen a lot, A lot, of movies and this one was a really fun and awesome movie to watch. Its a shame that they arn't coming out with a sequel. But I will say the movie made me want to go read the first and second book and not very many movies have ever made me want to read. College doesn't even make me read. This movie was good and the performances from lucy fry and her fellow cast mates were not sub par. It was a great experience of a movie, not a film. Its sad the cast got blamed for ruining the movie because thats simply not true. Might I add. This is only the second review I've written out of 100+ ratings. Enjoy this movie for what it is. A fun movie with high school undertones and a pretty cast. Its worth a watch."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "timasstuff",
        "review_rating": "10",
        "review_title": "Don't listen to the haters, great vampire movie the entire family can enjoy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "liam-rearden762",
        "review_rating": "10",
        "review_title": "two better love stories then twilight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "katrinasimpson",
        "review_rating": "10",
        "review_title": "Excellent! *SPOILERS ALERT*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "darlenedlim",
        "review_rating": "10",
        "review_title": "Not a typical Vampire Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "granthamd5",
        "review_rating": "10",
        "review_title": "I loved it and want a sequel!!!",
        "review_detailed_main": "I honestly think they did great job, i went and read all the books after watching the movies and like to keep an open mind, i honestly don't think that this movie is on the same bar as Twilight or any of the other movies people keep comparing it to, it is on a level on its own, i look forward to seeing a squeal (hoping that they will continue the saga). i think it was just didn't get enough market due to the lack of everyday know actors, however i think the actors used did an amazing job! no one would have been better for Dmitri or Lissa if you ask me. i think just add one or two big names to it and everyone would know about it and come to love it. Oh and Please, stop comparing it to Twilight... THEY ARE NOT THE SAME! This i feel is better, but everyone has their own taste, and for those complaining the book is better.... a book will always be better, but that is why movies are only BASED on the books."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "selenabelikov",
        "review_rating": "10",
        "review_title": "Adore it",
        "review_detailed_main": "Well, everyone who say that this film is just another peace of sh*t, it makes me to turn Strigoi and kill them. I've read all Vampire Academy books, twice. The plot is amazing and always better than at a previous book. Whoever loves adventure, sarcasm, vampires, twisting plot,love stories REALLY should read this books. OK, I have to admit. The first book is not my favorite, although it's good. The best comes later. Anyone who decide to read books, surely won't regret. Mason dies,Dmitrij and Rose fall in love, Dmitrij becomes Strigoi, Rose have to kill him but in the way to do that she becomes his blood-whore,she and Lissa meet another spirit users,Rose is accused for killing queen Tatiana and her punishment is death penalty and so on.. READ IT AND YOU WON'T REGRET!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "popadani",
        "review_rating": "10",
        "review_title": "444",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "vidyalakshmiac",
        "review_rating": "10",
        "review_title": "Had a good time watching ...cud have been better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "psugirle",
        "review_rating": "9",
        "review_title": "Fun movie - true to the book!",
        "review_detailed_main": "I don't know why everyone seems to have a huge problem with this movie! Actually thought the movie was fun and stayed very true to the original book.\n\nI saw a lot of disappointment on the casting of Rose/ Dimitri. I actually thought they did a FANTASTIC job casting. I know in our own minds we all have our own thoughts on what each character will look like, but even the author Richelle said she thought they got the casting right, and it was fantastic. I thought Danila Kozlovsky did a great job as Dimitri. I think he captured the tough, brooding, powerful, and sweet side of Dimitri. When I watched the movie and read the book, I definitely saw Dimitri. I also liked Zoey as Rose. She had a great amount of Sass and brought her character to life, and I did feel the romance blossoming between the two as the movie went on.\n\nNow, that being said...there was a few moments where the writing was just awful or way to corny - maybe that being why some people felt the movie wasn't that great or had a hard time with the actors being pegged for the characters in the book. For example, in the lust charm seen with Rose and Dimitri - even I had a hard time seeing Rose say, \" sweet sassy molassey\". That was just terrible.\n\nAll in all though, I did think the movie did a great job in capturing all the important essences of the book, and I did think they did a great job with the casting. I'm a little disappointed there won't be more movies since the books were so fantastic and we would have more opportunity to see these characters progress on screen....but - For anyone who love the book/series, I do recommend watching this movie it was cute and fun!!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "mtfbwy1992",
        "review_rating": "10",
        "review_title": "My only regret",
        "review_detailed_main": "Is that they didn't make more of the movies I'm staying hopeful"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "robertmassari",
        "review_rating": "10",
        "review_title": "And that's why I think there should be on the movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "nemamka",
        "review_rating": "8",
        "review_title": "It was better than I expected.",
        "review_detailed_main": "Holy moly you guys I am the most baffled person ever?! I can't get over the fact how much fun I had watching this movie. I watched it because I wanted something to really switch my mind off, long day, stress and all, and I wanted something that is so bad that it's already good but - it was REALLY good! :D Yeah of course it was cheesy where it could be cheesy, the fight scenes were sometimes awkward, the editing could have been better, so that non-book-readers understand more of the movie, BUT ALL IN ALL, there were scenes and dialogues where it was just so much more mature than any other vampire/dystopian/young adult movie?! I'm still like, wow. I really liked it, I laughed so much, and not because it was awful. Which I hadn't anticipated would be the case!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "freijavanlent",
        "review_rating": "9",
        "review_title": "Better than I expected",
        "review_detailed_main": "First of all, the movie was better than I expected. Reviews on the Internet weren't always convincing: the actors would be bad, the editing was horrible and the movie wouldn't be as good as the book (but when exactly is the movie better?). One way or another, I walked into the cinema and decided to watch it, even with low expectations.\n\nThe movie started pretty good. I was immediately caught up and couldn't look away anymore. As for my friend I had brought with me: she hadn't read the book and yet, she enjoyed the beginning. For the rest of the movie: it wasn't always good or perfect but it was fine, so good enough.\n\nI also think the casting was pretty good. Zoey Deutch did an amazing job and I now can't picture anyone else for the role. The only thing that bothered me in the beginning was Lucy Fry's accent but after several minutes, that was completely gone.\n\nConsidering all things, I believe this was a good adaption of Richelle Mead's book and I even recommend it to people who haven't read the book."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "Kristin-huneau",
        "review_rating": "8",
        "review_title": "Continue the movie sequel\"Better than Twilight\"",
        "review_detailed_main": "This was a pretty good movie but I think the way they made the trailer made the movie seem like a little kids movie. I think if they continued it, it would be a really great Sequel series better than twilight. I reed the books and I have to say the story line is original and I would watch the movie series if it came out. I give it an 8 out of 10 just because it could have been better but it seems like they were holding back. Thats another time that networks do not continue what they started at least to the 2nd sequel. I am starting to think these networks can no longer recognize talent or quality any more. It gets frustrating to get involved with a show,movie, or book(that gets made into a movie) and it leaves you hanging not knowing what happens next and have to fight 10 years to get a sequel like Ellen Degeneres."
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hey_d_e_hege",
        "review_rating": "8",
        "review_title": "The books are awesome, but this movie missed the seriousness of the book",
        "review_detailed_main": "I give a high score, because if you haven't read the book first it is a good comedy. Even when I watched it 5 years after reading the series I found it good. BUT if you first read the book and then watch the film, it is so dissapointing. It seems like they tried to twist a very serious situation in the book into a funny comedy, it really gives off the wrong feelings.\n\nHopefully some people enjoy the movie and then buys the book. The book series is one of the best I know!"
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "hbradshaw6360",
        "review_rating": "",
        "review_title": "I Loveeeeeeeeeeed it........................",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "harithaprabha",
        "review_rating": "",
        "review_title": "Vampire Academy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "merlibat6",
        "review_rating": "",
        "review_title": "vampire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "I don't care for vampires or the supernatural, but Rose and Natalie were appealing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1686821",
        "movie_name": "Vampire Academy",
        "movie_rating": "5.4",
        "review_username": "yoshbuck",
        "review_rating": "",
        "review_title": "0/10",
        "review_detailed_main": ""
    }
]