[
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rushda",
        "review_rating": "7",
        "review_title": "So what if she didn't recognise him?",
        "review_detailed_main": "I didn't love this movie, but I'm frustrated at how most of the negative reviews are focused on the wife not recognising her husband. Have none of you seen Superman? In that, Lois Lane doesn't recognise that Clark Kent is Superman, and yet I doubt any of you would complain there. It is a trivial plot element that can be overlooked - and in the film's defence, they did try and justify it by making romance a bit magical (though probably didn't need to go that far).\n\nThe film was sweet, colourful, and fun to watch. The music was great and the acting was decent. Having said that, I think there were some fundamental flaws in the films and tricks they missed:\n\n1. Why should the girl love Suri when he offers her none of the love and fun that Raj does? I don't understand why she is supposed to settle for the 'real' Suri when he is so boring. If Taani is supposed to compromise for her husband, should he not also become a bit more like Raj and meet her half way? It would have been great if he had started dressing a bit more fashionably for her even in his 'Suri' self.\n\n2. We are told that Taani is a loyal and decent wife. Yet it is completely out of character for her to think about running away with another man. I was a bit disappointed that she didn't even tell Raj she was married and spent so much time with him outside home.\n\n3. A perfect twist to the film would be for Taani to have known all along - it would have been a nice way of showing that Taani did recognise his heart from the start but she also wanted to see how far Suri could go. But without this twist, the story was very predictable.\n\nThese things make the film very frustrating for me. But at the same time, I don't want to fault it too much as I think it is still on the right path - I'm fed up of the show-offy 'Don's of Bollywood today. Romance is still where it's at."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "musicmansurana",
        "review_rating": "8",
        "review_title": "Tujh Mein Rab Dikhta Hai- Yaara main Kya Karu!!!!!",
        "review_detailed_main": "With Aditya Chopra Directing this Sharukh Khan starrer I obviously had huge expectations from this movie the first time its promo was aired...\n\nThe Music was marvelous. Great work by Salim-Sulaiman that made me more eager to watch the film. I remember that while I was lining up for the tickets, a friend of mine who was coming out after watching the movie said that it was absolutely pathetic. According to him, the entire movie was stupid because it was about a wife not recognizing his husband without a mustache & having a flick with him thinking it was some one else.....\n\nhis review did make sense & i was a bit demoralized coz I had just purchased the tickets. But when I did watch the movie, I realized ho beautiful it actually was...\n\nThe movie was not about a stupid wife not recognizing his husband without a mustache. In fact, though they were husband & wife the reason she could never figure out the difference between Raj & Suri was that she was never that close to Suri in the first place.\n\nThe message that the movie tries to convey that \"If one has to love me then it's got to be the real me & not the person that I can pretend to be\"\n\nSharukh's best work after Chak De India!!!!\n\nGod Bless the Makers of this Film!!!!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shariq_forever",
        "review_rating": "8",
        "review_title": "Very entertaining and interesting throughout",
        "review_detailed_main": "This is very different from DDLJ 1995 and Mohabbtaein. RNBDJ 2008 is very entertaining and different film. We have not seen such a good movie for a long time. This film is not about a dance competition but it is about a human being who can be so natural that do not need any artificial pomp and show to be an honest lover. Shah Rukh Khan has done his job brilliantly. He is such a solid actor and no one in Indian cinema can match his character playing and emotions portraying. He can even make a dumb movie like Om Shanti Om look good and be hit. Must watch this movie in theater, and you will definitely want to see it again."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "tahmidrahman1995",
        "review_rating": "9",
        "review_title": "Very good movie indeed,worthy of watching",
        "review_detailed_main": "I know its gonna sound bloody insane,but for me(no critics,as an average human being like you) it was the best Hindi romantic movie i've ever seen.\n\nNice chemistry between Shahrukh & Anushka(I'm their fan :P ),plaudits for Aditya chopra for this masterpiece,amazing music & Cinematography.Some questions will rise,how someone can't recognize her own husband without mustache,and some silly others.But the fact is i don't know how,but somehow this movie just touch your heart deeply,i mean u have to..u have to smile and cry in the meantime while watching this movie....for not only me,my friends and companions,almost 90% were having same feeling.credit goes to the whole team for this kind of creation.\n\nThank you for your time and reading this review.hope,u would be kind enough to forget if i made any mistake.Stay blessed :)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "d1uw",
        "review_rating": "7",
        "review_title": "A delicious over-cooked Indian dinner.",
        "review_detailed_main": "A poorly tailored trailer does not begin to describe what is one couple's journey from the ordinary Jodi to extraordinary Jodi.\n\nIt's a Simple life story of a ordinary couple which goes from many ups and downs and finally typical Indian ending. What else one can need ?? My first impressions were, 'WOW, this Shahrukh guy has a tremendous screen presence (but, yikes, what a profile!)' and 'I love the old guy with the black hair' but still the potential of the character is very real with a touch of grass root and it's totally judged by king Khan. This is ShahRukh's best performance after \"SWADES\". \"Rab Ne Bana Di Jodi\" is a common man real life drama made into a modish glamorous movie. The film has a knowable love story made to look like an extraordinary film by Aditya Chopra as it comes with intense emotions, songs, dances, drama and succeeds in touching hearts of audiences. You enjoy, cry and have fun watching the film. Performance of Shahrukh is at its best and Anushka is made to match him.\n\nAditya Chopra writes and directs ably proving that his first movie \"DDLJ\" was no fluke . In fact \"MOHABBATEIN\" carries the same theme of love way ahead of \"DDLJ\" but in case of \"RNBDJ\" it's really disappointing. The dialogues are average but yes Shahrukh is surely over the top... but isn't that the reason why he is where he is today. no character has to justify their actions but for the fact that they are driven by their emotions... which is pretty common among common human beings..\n\nThe problem I have is with what exactly message the movie wants to spread? I feel that the movie is trying to say, love first other things later. Other things including personal relationships, office work and careers.\n\nBut to be honest, I didn't like this movie much, and after seeing about 100 Hindi films since then, I still don't like it much. It has some great songs that are almost completely destroyed by the ancient and I still can't sit through the endless love stories of the couple.\n\nYou don't have action thrills suspense but those going for Shahrukh Khan's film, can watch the movie. Since the film is coming with high expectations many won't find it up to their thoughts.\n\nOverall, the story and the execution is a let down. The performances are decent and the movie sure has some light moments that would make you smile and laugh. The film fits all generations, families and ages and it can be expected to be a hit film. At the all important box-office, the opening has been surprisingly not upto expectations for such a huge film. It should pick up over the weekend. Going past the Week 1 figures of either Singh Is King or Om Shanti Om seems highly unlikely."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "BiswajitSince2005",
        "review_rating": "10",
        "review_title": "Made in heaven",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Ibuk",
        "review_rating": "7",
        "review_title": "Shah Rukh comes to the Chopra's rescue again",
        "review_detailed_main": "After the financial disaster of Lamhe and Parampara, Yash Chopra casted a then relatively unknown actor called Shah Rukh Khan for his next venture Darr. Not only was the movie hugely successful but it made Shah Rukh an overnight sensation. Since then he has been the Chopra's lucky mascot,Dil to pagal hai,Veer Zaara(for Yash Chopra), DDLJ,Mohhabatein and Rab ne bana di jodi(for son Aditya Chopra) and Chak De India for Yash Raj films. Whilst it is not as good as DDLJ(then again what movie is?)it is a vast improvement on Mohabbatein. Yash Raj films produced 4 films last year, Jhoom Barabar Jhoom,Tara rum pum pum,Aaja Nachle and Chak De India, Chak De was their only hit and it was a massive one at that. So with Aditya Chopra going behind the camera lens Shah Rukh was the safest best.\n\nShah Rukh is given a very different look, he has a moustache and wears glasses. It tells a story of a very ordinary man who enters into a marriage with a lively girl after her father passes away. She despises him whilst he does everything to please her. She enters into a dancing contest but is embarrassed at the thought of having to dance with her ordinary husband. Then Shah Rukh has an idea, he takes on a completely new avtar and aims to make her fall in love with him. He cuts of his moustache and changes his look but doesn't have the courage to tell her. So he assumes two identities, one as her dancing partner and one as her husband. Things get complicated when she starts to fall in love with her dancing partner not realising that it's actually her husband. Shah Rukh realises that the dancing partner has to break her heart and she will have to go back to her husband. In the finale the ordinary husband shows off his moves he learnt from attending the dance classes and his wife falls in love with him. My enjoyment was marred by the improbable plot. I am not bearded and nor do I wear glasses, according to the logic of this movie if tomorrow I don a beard and wear glasses my own family will not be able to recognise me, that doesn't sound right to me. Now onto the music, as per usual in a Chopra production the songs are absolutely top notch. Haule Haule is very very good and Tuj me rab dikta hai is one of the best love songs I have heard in a long long time. RNBDJ is pretty entertaining leave your brains at the door fare from the Chopra's and much much better than I expected. Recommended by me,7/10"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "hassanalizaidi",
        "review_rating": "10",
        "review_title": "Not Typical, but treat to watch",
        "review_detailed_main": "First of all i would like to comment on the dare step taken by the A. Chopra to make a movie on such a middle class topic.It's an excellent movie with very different approach. I am amazed after reading different reviews. Come on folks, don't expect King khan all the time doing the Millionaire roles.\n\nExcellent direction, outstanding performances with average music. Script of the movie might be a much tighter. I am not a SRK fan by any mean, but after this movie, i started thinking by doing this.\n\nIn the end, very good family drama movie and treat to watch. Come on folks stop dreaming Glamour all the time. These low budgets and middle class story movies are the real time facts of our lives."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shaff-k",
        "review_rating": "7",
        "review_title": "Inspite of all the negative points, Rab ne is a sweet romantic movie",
        "review_detailed_main": "I was having a bad day when I was watching this movie, and I am glad that I saw this movie.\n\nOK, the story is outdated.I mean at this era of live-in relationships and people hating the idea of marriage, this movie is about a married middle class couple. And many people do criticize the part where Shahrukh acts like two different personalities and his own wife doesn't recognize him while only his spectacles and mustache are missing and anyone can easily figure out that both are one and the same. ( When I first read the plot overview of the movie, I seriously laughed)\n\nWell the most obvious explanation would be that Indian audience ( not all,but most of them) would not like idea of an Indian wife having an extra-marital affair especially when the movie is set in a place which is trademark of Indian culture. I do accept that Yash Raj have produced many movies like Salaam Namaste ( portraying live-in relationship) but that story wasn't set in India. It is OK to not respect your culture if you are not in India. :p\n\nSo Adi made his wife love the same person with a different personality which people will easily accept (though now we people are having difficulty in accepting it) Next negative of the movie would be its length and slow pace of the movie. But i really was glad that the movie lasted for long. :)\n\nThe movie is too predictable but actually that adds as the positive point for the movie, as somewhere in your mind you want that to happen and when it happens, you are glad that it happened. The movie has many outdated and clichéd dialogues which remind you of the Bollywood movies of the 80s, but Shahrukh's dialogue delivery just makes it seem alright ! :)\n\nWell now the acting department. Shahrukh Khan did it again. well, I personally had this feeling that SRK normally overacts in movies directed by the chopras and johars. But this is an exception. He really did it well especially in the role of Surinder Sahni. He made everyone smile, laugh and cry. He really makes you feel for his character.\n\nAnushka Sharma did an appreciable job doing all the justice to her role. And do watch out for Vinay Pathak!! His presence does really rock the screen.\n\nThe dialogues are smart and funny though it gets every clichéd at many parts. The music is average but the background score does deserve an appreciation.\n\nI really guarantee you that it is a kind of movie where you will be smiling while tears roll down your cheeks!\n\nI was really happy to see all the people in the cinema sit though the end-credits ( which is really a special part of the movie)\n\nIts outdated typical bollywood movie, and I really hated the plot of the movie initially but now that i have watched it, I cant help but say, that is one of the sweet romantic movies Bollywood has ever delivered to us.\n\nIts of course not an extraordinary movie, but the director has really turned a very ordinary story into a very sweet romantic movie full of heart, which is definitely worth a second watch ! :)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "v-3-gupta",
        "review_rating": "1",
        "review_title": "Awful Movie",
        "review_detailed_main": "RNBDJ...\n\nWell generally I don't go to cinema to watch Hindi movie but I don't know why I really wanted to watch this one... may be because of SRK's new look..\n\nI would say first half an hour of the movie is good... few sweet moments... few jokes here and there... plot building... all nice...\n\nbut then SRk becomes Raj... and from this point onward the movie becomes pathetic...\n\nI don't know if they were trying to show a love story or something about split personality...\n\nSomething to be interesting have to be convincing... SRk takes his glasses and mustache off and he is Raj and with it he is Surinder...\n\nHow stupid they think viewers are?...\n\nVery week storyline and too much emotional gibberish...\n\nIn my opinion... don't spend your time on it.."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kc-amith",
        "review_rating": "10",
        "review_title": "just go watch it!!!",
        "review_detailed_main": "The first thing that come to my mind after watching the movie is.........!NO WORDS!, simply mind blowing. A Fantastic movie which worth every pi of my money and every second of my time.\n\nSRK's performance and the odd look as Surinder Sahni is simply superb!. Surinder Sahni is a non active normal Indian guy who was forced to marry the beautiful Desi Taani(Anushka Sharma). The story is full of expressing Surinder's pure love towards Taani.\n\nSurinder changes himself completely to get the attention of his love Taani. The story runs with twist and turns, dance and music, comedy and drama and with a little action! by Taani.\n\nFinally an expected-unexpected climax steals the heart of every audience and make them to forget themselves in the emotion of love.\n\nThats all about the movie. My suggestion is to simply just go and watch it. You will really appreciate the performance of King Khan and Anusuka."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Peter_Young",
        "review_rating": "6",
        "review_title": "Entertaining but...",
        "review_detailed_main": "Rab Ne Bana Di Jodi is great as a leave-your-brains-at-home entertainer, but as a film it is not that great, although it does try to convey a message. I had a certain feeling at some points that it was just made for the sake of making. First, it is terribly unrealistic in whatever it deals with. The entire idea of Surinder, an ordinary square trying to go through a dramatic physical change to make his wife fall in love with him, is ancient. The transformation itself suffers from a ridiculously poor execution - it is completely unbelievable. A man who's been someone for his entire life cannot become another person within two hours and behave in the way Suri starts behaving. The fact that he leads a double life throughout the film with his own wife through both Suri and Raj and that she herself does not even suspect it is the same person is laughable. Although I don't say a thing like this is totally impossible, the story was at times slow paced and at times was filled with the usual Hindi film clichés.\n\nHaving said that, we don't watch films to see reality, but rather to escape it. The main element reminds me of Raj Kapoor's classic 'Satyam Shivam Sundaram', in which the only difference in the woman's appearance was the presence or the absence of the disfigured side of her face. So if Raj Kapoor could make that, I believe we cannot blame Aditya Chopra. Rab Ne is technically well made, and it has a fantastic soundtrack, all the songs being extremely enjoyable. The film's comedy is wonderful and there are many great moments and hilarious scenes. The cast is very good. Shahrukh Khan is brilliant in the refreshing role of Suri, and he is his funny and witty self as Raj, a side of his we are very familiar with. Anushka Sharma gives a surprisingly fantastic debut performance, and she is credible throughout the film. Vinay Pathak is amazing as Bobby and provides great support. Anyway, RNBDJ is not a great film and has its share of flaws but it is a good entertainer. I generally enjoyed the film and I do recommend it to those who are yet to watch it, though frankly I'm not planning to watch it again any time soon."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "pahki-puuta",
        "review_rating": "2",
        "review_title": "Watching this is a waste of time",
        "review_detailed_main": "I thought that this movie was nothing special but tolerable until the stupid ending just ruined it completely. I was waiting for the movie makers to merge the Suri/Raj characters into a more normal man but no! It would have made perfect sense because the geek and the weird fashion stud were both the same person and Taani loved them both!!!! But that wasn't meant to be; I watched with growing disgust as the honeymoon photos flipped by because an ugly, very middle-aged looking geezer and a young, beautiful woman didn't look like a convincing couple at all, more like a father and daughter!! I really hated SRK's mustache when he was Suri and the Raj character was way over the top and irritating."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "nitap",
        "review_rating": "10",
        "review_title": "A movie made from Rab!",
        "review_detailed_main": "I went to see RNBDJ because of Shah Rukh Khan first of all, but did not know what to expect since I made a point not to read any reviews or synopsis of the film. I only knew that the audience seemed to give good review but critics were not friendly with their reviews. I must say they have become to jaded upon watching numerous films that they missed the beauty of this film. I love Aditya Chopra for directing such a brave and bold film that comes straight from his heart! SRK portrayed Surih and Raj with sheer perfection. I loved him as both characters; they both made me smile and also drove me to tears! Anuksha did a brilliant job as her debut character and I couldn't believe this was only her first film. She was marvelous and fresh as Taani. The songs are just beautiful and they will either make you get up and dance or lay down and just cry tears of happiness. The climax was mesmerizing and surprising, the comedy was wonderful and the message was very important that we need to love our \"jodi\" for who they are and not who we wish they are. We are all made from God so we have to remember to see God in everybody! What a brilliant and different film Yash Raj Films made; I love you guys for this gift!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "raghavramaiah-1",
        "review_rating": "6",
        "review_title": "Rab Ne Bana de Jodi - Scripted to perfection",
        "review_detailed_main": "Rab ne Bana De Jodi is a movie which definitely brings back the old touch of YRF movies. And who else could it be apart from the king himself,who would bring the magical touch with such a impeccable performance. A performance that will be definitely remembered for years to come. Shahrukh Khan plays Surinder Sahwni a pale-typical-middle-class-man working with Punjab Power marries Tanni a-beautiful-bold-fun-loving girl played by the débutant Anushka Sharma because of some uncalled circumstances and how life takes them from then on is something to watch out for. How well Surinder Sahwni transforms to Raj just to impress his own wife Tanni becomes her partner in a Dance Show in which she wishes to participate changing his looks completely into a Fun-loving-jovial- cheerful guy. The character of Raj adds the right humor in the right ratio with emotions and romance. The icing on the cake is Vinay Pathak who plays Bobby-a close friend of Surinder adding on that extra flavor making the movie look even better. Anushka Sharma steals the show with a performance that every other actress should watch out for. Very Impressive in her very first movie. Overall a great package that us as an audience would love to watch.\n\nAditya Chopra has directed another gem of a movie after his previous wonders DDLJ and Mohabbatein. Though still thought the Music could've been a lot better. \"Haule Haule\" being the most catchy of the lot makes you humm the tune till you reach your house from the theater's.\n\nThe movie is all about 1. Shahrukh's amazing act as always. 2. Anushka Sharma's refreshing performance. & 3. Aditya Chopra's directorial brilliance.\n\nI would really suggest you to just pull any of your loved one and go watch this movie and you will be more than pleased after watching it. Entertainment Guaranteed.\n\nAnd do stay till the credits roll. You've something more to enjoy."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "springsunnywinter",
        "review_rating": "10",
        "review_title": "Aditya Ne Banadi Wonderful film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ijzeren_jan",
        "review_rating": "6",
        "review_title": "Rab Ne Bana Di Jodi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "arkasamanta",
        "review_rating": "10",
        "review_title": "Rab Ne Bana Di Jodi is Extraordinary!!",
        "review_detailed_main": "Superb!! Is the first thing that comes into your mind when you are going to see this film!!! Perfect is the second exclamation that will follow! Everything about this film is perfect (Even Anushka Sharma, on whom I didn't have much expectation!).\n\nThe story is about a regular guy Surinder Sahani who works for Punjab Power and leads a regular, monotonous life. But Rab (God) had different plans for him. His life undergoes a complete change when Tani (Anushka) comes into his life.\n\nThis film is about Love in its purest form, and everything that expresses love, Dance, Music...\n\nComing to the technical staff! Everything here were perfect too! Lyrics, Music, Direction, Camera, Cinematography!\n\nActing of everyone was natural and proportionate.\n\nLastly, A film For Everyone, Go and Watch this movie and then You'll see that I am not Overreacting here!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rahul_vermakumar",
        "review_rating": "",
        "review_title": "The best Indian movie of 2008",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "TuFNuT",
        "review_rating": "7",
        "review_title": "An Overcooked Cuisine",
        "review_detailed_main": "What happens when you over cook the best recipe? Result is a cuisine that you eat when you are hungry without relishing it. The most awaited, Aditya Chopra's Rab Ne Bana Di Jodi is just like that overcooked cuisine which the audience is expected to digest just because it has the magic ingredient, the Badshah of Hindi cinema Shahrukh Khan starring in it.\n\nThe plot is about the unrequited love of a geek, meek and a shy small town man married to a pretty girl in unexpected circumstances. How will he win his love and make the only woman he has ever loved, love him in return? This interesting plot premise, despite taking off well in the first 20 odd minutes is battered thanks to shoddy writing which lacks both conviction and logic.\n\nThe only well written and endearing character is of this geeky guy \u0096 Surinder played by SRK. The new actress Anushka Sharma comes across as beautiful, confident, and charming. She fits perfectly in the role of a Punjabi girl, giving a good performance for a newcomer. Raj, the cool, clean shaved and hip Jatt guy again played by SRK is a bad caricature of the romantic image of 'Rahul' and 'Raj' created by SRK and Yash Raj over the years. After the initial interest, this character too fails to make the storyline any interesting. So there you have it when in the script two out of the three central characters are ineffective, you know it's time to fasten the seat belt as this flight is in some trouble.\n\nBut this flight somehow doesn't crash. What saves it is SRK who gives it his all to make Surinder and Raj as endearing as possible. He is the sole reason keeping you on board. SRK tries hard and succeeds to engage you emotionally in some sporadic scenes, like the small and few chocolate pieces hidden on a big plain biscuit. Also, the success of a romantic comedy is determined by the number of magical moments the lead pair have on screen. In RNBDJ, unfortunately these moments are almost nonexistent. But right from the last few minutes to the end of the credits the film ends on a creative, humorous and feel good note which again spares it from the wrath of the audiences.\n\nThe film has only four main songs, Haule Haule and Phir Milenge Chalte Chalte being the highlights. Phir Milenge Chalte Chalte is a tribute to the great romantic heroes of the yester years and has five leading ladies of Bollywood dancing in five different segments. In segment one the duo of SRK and Kajol dancing together one again show us why they were and are still the best looking pair in Hindi Cinema. And In the same song in segment five, Rani Mukherjee looks totally out of place. Nevertheless this track is an extremely entertaining affair. The movie is shot well and has good production value which you expect from Yash Raj. The Amritsar setting looks very authentic.\n\nSo all in all 'Rab Ne\u0085' is a watchable but underwhelming affair. Aditya Chopra is below average in his duties as script writer, dialog writer and director. In fact, after Mohabbatein, he has plummeted to a new low. There is a lesson to be learnt for directors who lack a great script and expect SRK to deliver the goods for them each time no matter how puerile the plot. And SRK needs to watch DVDs of Swades and Chak De and remind himself of what he is capable of doing and in future choose roles of substance. Sadly, RNBDJ is not going to be a highlight or landmark in his golden career."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "jerrythres05",
        "review_rating": "1",
        "review_title": "A SHAME FOR BOLLYWOOD or is it a coincidental hit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ahamedmn",
        "review_rating": "10",
        "review_title": "SUPERB MOVIE",
        "review_detailed_main": "One hell of a love story. Mind free and light good movie. Srk and Anushka Sharma's acting was sooo lovely. Please watch it. Its an amazing movie. Some logical errors are there but that is turned into magic."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kysersozeus",
        "review_rating": "6",
        "review_title": "A decent movie with wholesome entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "fabiha_rahman",
        "review_rating": "1",
        "review_title": "It is a typical story. Boy marries girl,girl does not like boy, so boy impresses girl.",
        "review_detailed_main": "This movie was a totally predictable Bollywood disaster. Why is the talent in India? Shahrukh Khan does not challenge himself enough. Everyone knew what would happen in the end, no surprise there. I want to see something new, not the boring old things. I was really disappointed.\n\nIt's a waste of time, and money; there's nothing to gain and everything to lose to this movie.\n\nHated it!\n\nI need something new and fresh, not the boring dancing. Don't watch this movie. I can't believe it received a 6.9, it should receive a 1, a waste of life.\n\nI don't like it at all."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "maheshkoneru",
        "review_rating": "8",
        "review_title": "Rab ne is a lot of fun...don't miss this one",
        "review_detailed_main": "Rab ne is an absolutely entertaining film. Have no doubts about that...\n\nBut before I go on to review the film, I would like to say a thing or two about the so called professional reviewers of our online media. Each genre and each storyline will have a different yardstick depending on what the film is setting out to achieve. Don't go looking for logic and 'intelligence' in a film when its primary motive is to make people laugh and have a good time.\n\nAnd I will host a grand party the day rediff ditches Mr.raja sen.\n\nThat aside, Rab ne is a film which will make you feel good and happy and Shahrukh absolutely deserves credit for this. His performance as Mr.Surinder is an absolute delight to watch and the mannerisms will leave you in splits of laughter. And then, the performance as Raj is the icing on the cake.I wont say anything more about this as it will spoil the experience for you.\n\nShahrukh Khan, take a bow.This is amongst your best performances to date.\n\nThe new face of the film, Anushka deserves special mention for the way she acted and carried off the role of Taani. There is innocence,charm,a certain vulnerability and tenderness in the character but at the same time she can be quite a force to reckon with if provoked. And Anushka lived in the role. For a debutant, its amazing.\n\nVinay pathak as usual was his excellent self as the best friend of Shahrukh and their moments on screen are truly rib tickling.\n\n'Haule Haule' song is very good and so is the background score. It adds weight to the film and to the comedy. All the other songs are pretty decent.\n\nThe way the city of Amritsar was shown is also very nice and the rich production values of yashraj films is clearly visible in each and every frame.\n\nAnd finally, for the director. Welcome back Mr. Aditya. We missed you and we hope that you make movies a little more often than you do.\n\nMaybe, the ending could have been handled slightly better but then its not a major gripe. Some parts of the story may defy conventional logic like the way Shahrukh manages to juggle his different 'careers'. But as I said earlier,these kinds of films are not about logic or intelligence.They are about making you laugh and have a good time and in that Rab ne is eminently successful.\n\nAll in all, Rab ne is a very feel good film that you can go out and watch with your whole family. 100% Paisa Vasool film"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "JoBloTheMovieCritic",
        "review_rating": "6",
        "review_title": "Rab Ne Bana Di Jodi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rocky_2009",
        "review_rating": "10",
        "review_title": "Brilliant!!!",
        "review_detailed_main": "after seeing shah rukh khan in om shanti om i completely lost faith in him...the second half in which he tried to act cool was painful to watch...but his performance is this movie is simply mind blowing.\n\nAditya chopra has done it again.its a very simple film with a simple plot but u leave the hall with a smile on your face. anoushka sharma gives an excellent performance way better than deepika.this movie reminds me of the old greats which yash raj studios used to make. please go watch this movie.simply fantastic.\n\nalso watch out for vinay pathak who gives a funny performance as shahrukhs best friend bobby."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "prats6",
        "review_rating": "7",
        "review_title": "Beautiful Movie ..",
        "review_detailed_main": "Yes this is Beautiful movie. Shah Rukh Khan is simply superb, I found the movie very entertaining. The direction lacks punch but SRK delivers big time. This is a must for people who like love stories, because this is what it is.. A Love Story, and a very beautifully told one at that. The actress Anushka, carries herself very well. Very aesthetically shot, nice dialogs .. A film which will leave you satisfied. Very few films manage to do that, satisfied ! I just found myself smiling throughout the movie, not laughing out loud, but smiling, it meant that the jokes were witty, the dialogs were prompt, the acting was fabulous, SRK, for me does his best after Swades, (better than Chak De). The songs were very soothing, specially \"Tujh mein Rab dikhta hai\" which was so sweetly shot.\n\nThe screen obviously belonged to the one and only SRK, he just dazzles beyond compare, I cant figure out any other actor doing the same role with such ease and style. I loved the movie and I hope people will love the character of SRK in this flick.\n\nA movie which cannot be missed no matter what, and once again Hats Off to SRK !"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "arunkesi",
        "review_rating": "8",
        "review_title": "Who says Rab Ne is Boring!!!!Go Watch It!!!!!",
        "review_detailed_main": "Well...Inspite of all the reviews going around of Rab Ne being clichéd,sluggish and what not,the movie according to me is top notch.I would give it a 8 on 10 \"jeee\".Admitted I adore SRK, but even if you are not a fan you would invariably become one by the time the end titles start rolling.And if u still believe even after watching Chak de and Rab Ne that SRK is good only playing Raj and he is no good actor,then forget it!!!U must be having serious,serious reservations against the actor. Swades,Chak De and now Rab Ne.His performance in Rab Ne is right up there and no other actor could portray the character of Surinder with such élan as SRK did. Well I've heard SRK say in some interview prior to Rab ne release of how his previous 6 Yashraj Films had contributed in making him 90% superstar. Well,now you could make it 7 in a row and YRF has made him 100% superstar. The Yahraj,SRK saga continues and it is now in the form of its life. Aditya Chopra after a historic DDLJ,a mediocre Mohabbatein is back with Rab Ne.It doesn't get bigger and better than Rab Ne.Well after watching this film you would curse yourself on how Adi betrayed all the Indiam movie lovers by directing just 3 films in the last 14 years.How rich could Indian cinema have been had he directed a few more gems ala Rab Ne.\n\nC'mon Adi..We would want to see you in the director's chair rather than producing those horrific movies Roadside Romeo.\n\nDarr,DDLJ,DTPH,Mohabbatein,Veer Zaara,Chak De and now Rab Ne.SRK is back with YRF.\n\nWhat is it that makes this combo churn out the most memorable movies we would ever watch on the silver screen year after year.\n\nRab Ne inspite of being a good 2 1/2 hour long movie rivets you in every single frame.It is a movie which would take you into a different world,a world of Surinder Sahni.As promised by the makers one would identify themselves with the protagonist,feel for him,live with him and when u start living with the character and forget everything around u know pretty well that the film is working big time.\n\nA simple love story where every scene is so convincingly shot that one wonders on how the shooting was completed in just 47 days and the script written in 12 days. It would be immature of me to even comment about SRK's performance.Anushka Sharma, Well she couldn't have asked for more.And she performed with such confidence that would have made even the likes of the Kajols and Madhuris proud Vinay Pathak enters the big league as well and we will now start seeing him taking center stage in the more prominent movies.\n\nLittle moments from this film leave such a lasting impression.Be it the scene on the dining table with the rose,The back ground tune and the score of \"Haule Haule\" being played intermittently at regular intervals for little triumphs of Suri, Taania greeting Suri's friends on the Reception night,the Holi scene,the \"Yellow Tiffin Box\",the Biryani thing,The sorry episode to name a few.You would yearn for Taania to unite with Suri and not elope with Raj.\n\n\"Inspite of loving the character \"Raj\" all these days in DDLJ,KKHH and so many other movies we start disliking him and rather feel for the Surinder and would want him to succeed in his love.That is where the movie succeeds big time.\" Admitted it gets a bit dull in the middle with the dance episodes and all but u would when the entire 2 1/2 hours revolves around just 2 characters.But still the movie remains afloat thanks to all those wonderful little moments that are spread throughout.\n\nAgreed it is no DDLJ,no KKHH but still you would not want to miss it.\n\nGo watch it!!!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "vinay1493",
        "review_rating": "6",
        "review_title": "Its Worth a watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ani625",
        "review_rating": "1",
        "review_title": "Unwatchable, is what it is.",
        "review_detailed_main": "The movie hangs on the story line which is beyond absurd. The premise that the wife cannot identify her very own husband, without his mustache (and his formal attire probably) is not only ridiculous, but also sets new levels of stupidity. The wife not only flirts along with the new guy with ease, but also conveniently forgets to mention that she is actually married, only one the many flaws here. As far as the flow is concerned, its clearly a mess, and entirely mediocre. Putting God into all this mess makes only matters worse, and the clichés are just too over-used. Songs are average to say the least, which is itself an upside. Movie definitely worth a miss."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "prianka-guru",
        "review_rating": "8",
        "review_title": "Its a good movie",
        "review_detailed_main": "This storyline is nice, so is the idea. But there are some ignorable flaws in the direction like when Shahrukh brings his bride home and lifts the suitcase, one can easily tell that it is an empty one. But then again they have paid so much attention to details, like the usage of 'yellow' color in every possible way. The chemistry between the lead pair is good nothing over the top. Shahrukh's character is extremely sweet and lovable.\n\nMy suggestions: 1. Watch this movie when you are feeling hopelessly romantic. 2. Don't watch it keeping DDLJ in mind, DDLJ is beyond comparison."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "m_shankar20",
        "review_rating": "6",
        "review_title": "'Raj' yet again from YRF",
        "review_detailed_main": "Rab Ne opens with a bespectacled SRK with mustaches, wearing trousers and sneakers, alighting a train with his bride. That shot, at once, shatters the image that SRK has had over the years in Yashraj films. I could sense excitement running through my veins. But alas, it was short lived. Very soon, they return to 'Raj' business that we have been made to endure over the years.\n\nSRK impresses as the docile Sukhi but as Raj he varies from flamboyant to a buffoon. The newcomer Anushka Sharma is very impressive. This is easily the best debut performance of the year so far. She is convincing throughout the film and is not intimidated by the towering presence of SRK.\n\nSukhwinder Singh ('Hole Hole') and Sunidhi Chouhan ('Dance pe Chance') lend their voices to probably the two best sung songs of the year. Both are choreographed equally well.\n\nRab Ne does have a story but it lacks any subtlety. For some reasons, SRK speaks out all emotions leaving nothing for the viewers to extrapolate. No time is spent on telling us how Taani falls in love with Sukhi. The only apparent explanation is that she sees Sukhi walking towards her in the background of the Golden Temple. It seemed that SRK's character, while playing the Sukhi vs. Raj game, got confused in what he really wanted to achieve after all.\n\nAditya Chopra is a talented director and I don't doubt that. But Rab Ne is just a box-office pleaser attempt and not anything to test himself."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ankitnarayanmathur",
        "review_rating": "1",
        "review_title": "Pathetic attempt!!!!",
        "review_detailed_main": "How does Aditya Chopra have the ability to produce, direct, execute such a rubbish & mindless story line? And even worse, the IMDb user rating is over 6.......\n\nThis is one of the worst movies I saw this year......\n\nDidn't expect Vinay Pathak to fall to this level.....\n\nIf we can make movies like \"Laqshya\", \"Taare Zameen par\", \"Black Friday\", \"Khosla Ka Ghosla\" etc., why bother with these non sense \"motion pictures\".\n\nDon't waste 167 min of your time on this movie!! Hope my comment help you stay away from this!!! Just trying to help out"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "durga_1878",
        "review_rating": "10",
        "review_title": "Beautiful Film.Excellent Work.",
        "review_detailed_main": "A true masterpiece.\n\nA truly different love story from the Aditya after a long time.\n\nSRK is truly the KING of Bollywood.\n\nNo actor could have carried the role with such elegance as he did.\n\nI just loved every bit of it.\n\nAnuska as a new comer has done really very very well.\n\nVinay Pathak is as usual very good.\n\n3 characters Srk, Anushka, Vinay carried the whole film so well.\n\nMarvelous! Performance are at par excellence.\n\nRefreshing film with refreshing sets,direction,music,choreography.\n\nEverything is so brilliantly done , no words for praising.\n\nWatch it ! Or you will repent. Haule Haule Very very well executed for the global audience.\n\nSo bye.Opps....! Hum Hain Rahi Pyar Ke Phir Milenge Chalte Chalte."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "tariqq8",
        "review_rating": "7",
        "review_title": "Not better than DDLJ and Mohabbatein",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "yourz_sanju",
        "review_rating": "9",
        "review_title": "How Extra-ordinary an ordinary story could be !",
        "review_detailed_main": "Before going to theaters, there has been rumour that I heard about this movie that it seems long ans stretched. Critics has given one of the worse review to this movie. But I still took a chance to watch this movie. This movie isn't telling a story about a rich, poor, or some type of thug falling into love. This movie is about an unattractive sophisticated guy falling in love with beautiful modern girl. This is not it. There are more secrets to this movie once you start watching it. Even though I am not SRK's fan, I personally found this one better. There has been comparison with this movie to Ghajini or recalling of Chopra films such as Mohabbatein and Dilwalein Dulhaniya Le Jayenge. The story on which this movie is based on has no kind of similarity with above movie stated. This movie deserved to be watched and then commented. The first hour is about how Suri Sahni(SRK) and Taani(Anushka Sharma) got married though it's just a compromise. But slowly slowly the are working out on their relation although she has made herself clear about can't fall in love with him. Till the song \" Haule Haule\" finishes story seems bit slow, but then Taani request him of being part for dance competition. Suri agrees to her since he wants to see her smile. He changes his get up and goes to see her dancing. But due to a mis-understanding, he somehow gets involved in dance competition and co-incidentally also becomes her dance partner. He named himself as Raj. She couldn't recognize him so he keep acting like Raj. He also acts so flirty with her. Although She hates him, he still doesn't really change that much. But slowly she starts to get along with him now on. The second hour starts up with dance practice and Suri giving her excuse for not being home on time by saying her that he will be doing over time. Through all these Suri is being supported by his friend Bobby(Vinay Pathak) who contributes for the proceedings. He is worth watching and shares good part with Suri. He also creates few comical moments in the film. Since Taani is spending enough time with Raj and they do starts closer day by day. She starts to feel for him. Thats where the entire story takes different turn. Suri was set out to write his own love story, but it's going in different way. He decides not to tell her anything and leave everything on her to choose where Raj or Suri. Although Bobby tries to convince him to confess in front of her, he denies .\n\nIt was hard since Suri is less talking, always into work, and not much in contact with her. On the other side Raj is close to her in the third hour. Without spoiling your fun for watching this movie , in last I would like to conclude that even climax is amazing. Watching this movie was not only different experience, but also this movie is an example of fine class cinema. As far as music is concerned, it's not like previous movies of YRF movies. It's simply good. There is a song where Kajol, Preeti Zinta, Raani, Bipasha, and Lara Dutta is performing with SRK. SRK is soul of the movie and plays his characters well. Anushka never makes you feel like its her first time on screen. She is confident enough and likable. Vinay Pathak will be praised for his work on this movie. I don't think Aditya Chopra has made mistake making this movie."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Miss_Weasley_Potter",
        "review_rating": "6",
        "review_title": "A one-watch SRK flick.",
        "review_detailed_main": "This 2008 flick stars Shah Rukh Khan, Vinay Pathak and introduces Anushka Sharma.\n\nIt has a very typical beginning, boy sees girl, and of course it is love at first site. Girl, however, is already somebody else's. In fact, she is about to get MARRIED to that person. But that person dies, father gets a heart attack from the trauma and, because he knows he is going to die, he marries off his daughter to his favorite student, a simple, sweet, shy geek, Surinder Sahini. The girl, let us please make it clear, is not forced to marry him, she chooses to, although when one thinks about it...would any sensitive person be able to refuse their dying father's last wish? Taani (Anushka) is heartbroken, though she tries to hide it. Suri seems to understand, and knows that this will not be an ordinary marriage. The possibility of the two having a normal marriage, at this point of time, was something that he could only hope for. So, he picks up a pillow, a blanket and makes a bed for himself up in the attic.\n\nHe loves her. He had already made that clear to the audience from the very beginning when he had shyly announced that he had fallen in love with Taani) Though Taani tells him that she can never love him like that, he continues to hope that 'Haule Haule' (Slowly, eventually) she too might fall in love. In the meantime, Taani continues to play the dutiful housewife.\n\nHe becomes Raj \u0096 a wannabe cool dude- in hope to be what she wants in a guy. And ends up as her dance partner.\n\nHow she fails to notice the similarity between her husband and her dance partner is something that will remain a mystery to us and thus, should be left in-argued and tagged as one of the loopholes of the plot.\n\nThe other loophole, and a major one at that, is: how could a thin, in-athletic man like Suri possibly survive a Sumo's attack? However, not only does Suri-Man survive, whole and healthy, he only BEATS the 300 pound something Sumo! The movie is a one-watch movie. Shah Rukh has showed that he can pull off any role and can even make us love him as the irritating Raj. The movie is, completely and absolutely, Shah Rukh Khan's.\n\nVinay Pathak is his usual golden. A very sweet and good performance as the best friend, indeed.\n\nAnushka Sharma is a decent actress. She was, at times, a bit stiff and expressionless, but yet, only she could have pulled off the role as Taani. She is very good find and perhaps, hopefully, will succeed in the Indian Cinema as well as improve as an actress.\n\nOverall: Not a bad watch, despite its loopholes. It will definitely ensure that you keep laughing through out, or else singing along the catchy songs. Purely a SRK candy and can be enjoyed much better on the DVD.\n\n6/10"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "nithish_george99",
        "review_rating": "10",
        "review_title": "Sharukh Khan's Makeover is Just Fine",
        "review_detailed_main": "To people who say, this movie is bad, just because of the reason that Sharukh Khan's make over is not perfect , I can just that, they are very childish and are not qualified to rate a movie. After all it is just a story that have hardly any probability of happening in real life. GROW UP PEOPLE!!!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "planktonrules",
        "review_rating": "7",
        "review_title": "The film is very good BUT the writing was not especially inspired.",
        "review_detailed_main": "\"Rab Ne Bana Di Jodi\" is an enjoyable film, though I have to admit that the story is awfully silly and make this a rather silly Shah Rukh Khan outing.\n\nWhen the story begins, Surinder (Khan) has just gotten married through a traditional arranged marriage. The problem is that his wife, Taani (Anushka Sharma) is much, much younger and Surinder is a bit of a dork. So, instead of celebrating their marriage and both being happy, the marriage is in trouble. Surinder sees his wife as perfect and unapproachable and Taani seems to give very little emotionally to the marriage. In fact, I wanted to slap Taani repeatedly and yell at her \"He's your husband...love him with all you have!\".\n\nLater in the film, Taani decides to take a dance class. While there may be dance classes like this in India, it took me by surprise, as they seemed to be dancing much like you'd expect in a Bollywood film. However, her new partner is an odd guy...brash, full of life and conceited. Well, this Raj is actually Surinder in disguise...and Taani believes these are two different guys. When this happened, the film lost me and I almost turned it off. After all, aside from shaving off the mustache and blow drying the hair and changing clothes, they BOTH looked exactly like Shah Rukh Khan!! I assume the Indian audiences just suspended disbelief...but I kept thinking Taani was really stupid for not seeing that they were the same guy!!! And later, when Surinder works hard (finally) to win her over, she is pretty awful about this.\n\nDespite my MANY reservations, the film does work overall for three reasons. First, the acting is quite nice...and you cannot blame the actors for the dopey story elements. Second, the music is great. Third, the ending is so sweet that I ALMOST forgot how dopey the story had been! Worth seeing but inconsequential as well."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "lediscipledessocrates",
        "review_rating": "1",
        "review_title": "Seriously.....Is this movie for REAL?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "asawarsajid",
        "review_rating": "10",
        "review_title": "It's a pretty good movie",
        "review_detailed_main": "Watched the show--- but a bit late in reviewing\n\nFirst of all where do I start grinning smileygrinning smiley\n\nStory: Film starts off with preparation of anushka's wedding. Kismat plays a role and barathi die in a car accident. Anuska father dies with this sadma & anuska too gets into a great depression. Anuska life worsen more when her dieing father pleads to SRK to wed his daughter as he is the only one he can trust!\n\nMovie from there picks up tremendously... Scene involving SRK-Anuska after marriage ( especially when the guest come over to SRK house for celebration!) Anushka, unable to recover from the double she got earlier, pretends to be a good life...\n\nMovie takes a turn when Anuska joins a dance show! SRK's transformation to woo Anuska and win her is also worth applauding.. Move takes a down turn when Anushka is unable to recognize SRK! I mean how can she not recognize her own husband even when he has just changed his hairstyle and dressing.... VERY DUMB and immaturish direction\n\nFew scenes in the film are worth a mention\n\n1) Guest coming to SRK house. Anushka's refusal to come at first, but then eventually coming 2) End scene! - Excellent 3) SRK's scenes while playing the old man! Very well portrayed by SRK! Hats Off! 4) SRK's continuous effort to woo Anuska- even when he knows he can lose her as Raj is not the real SRK!\n\nDownside-\n\nAnushka not able to recognize her own husband ( hairstyle and dress change only!) Anuska falling for Raj and crossing the husband-wife line Length\n\nMusic is a mix bag: Dance Pe Chance and Title track do the trick\n\nPerformance: SRK is tremoundous in scenes where he is showed as an old man! the expression and timing has to be applauded! He became a little inconsistent when played Raj's role. He was OK in few scenes- but when over the top in other\n\nAnuska- Watch out for this actress!!! She is a talent to look forward to. Not does she only look bholi and beautiful. She knows how to act!\n\nRating - 3.25/5 ( for pure entertainment and romance) Watch it... you will probably come out of the cinema smiling"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "Rab Ne Banayi Boring Jodi!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "tareque-laskar",
        "review_rating": "4",
        "review_title": "A cheap trick bereft of the Adi Chopra magic",
        "review_detailed_main": "There are numerous times in 'Rab Ne Bana Di Jodi' when Surinder Sahni (Shah Rukh Khan) keeps saying that it's God who is scripting this love story. Well, if that's the case then the almighty happens to be a rather lousy scriptwriter. Aditya Chopra's anticipated directorial return is lukewarm; there may be an extraordinary love story behind every ordinary jodi according to the tag-line but the film is firmly ordinary. Chopra, unlike his other films doesn't cast the canvas wide this time, delving only into a marriage arranged by fate between Surinder and Taani (debutante Anushka Sharma somehow never rises above your average soap performance). But he keeps the length of the film the same, which stretches the story far too thin for it to be even remotely plausible.\n\nSRK fits decently well into 'ordinary-man-trying-to-be-awkwardly romantic' garb as Surinder hitting the ji-spot with his humble Punjabi demeanor but his alter ego, Raj (the guise he assumes to attend dance classes with his wife!) is old SRK in a new bottle and not one bit refreshing. As if to emphasize the lunacy going on in the name of a story, Taani falls for Raj never realizing for one instant that it has been her husband all the time! Raj's over the top performance looks so cooked up that sometimes even you, let alone Taani, will wonder if it's two different people.\n\nThe film takes too long to build up, and about as pacy as a turtle on a morning walk. The repetitive moments (the whole dance gig outlasts its welcome), self referential gags (once again YRF's Dhoom gets a mention) and ungainly plot twists pretty much kill off any salvage value left in the film. This one won't warm the cockles of your heart, unless you are an SRK worshiper or Anuskha's college mate, a bunch of whom were right behind me screaming up a racket right all through."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "vikrantjindal21",
        "review_rating": "9",
        "review_title": "Love rulez !!!",
        "review_detailed_main": "I know many people hated the movie. And their stand is correct. A SRK-Adi combo ought to provide a blockbuster. Instead the result is a gentle, sweet story... Its not about Raj/Rahul sweeping the maiden off her feet. But its the story of a common man \"Surinder Sahni\" who loves his wife a lot. And would go at great lengths just see a smile on her face. He does not fight 20 goons or jump into fire to save her love. He just makes her \"Taaniji\" happy. You would love the movie if you like mushy love stories. But beware, there is no over-the-top sparkle as is generally in YRF or Karan Johar movies. It does not show the couple dancing in Switzerland, but in SDIPA's dance classes. It does not have unbelievable dance moves like Hrithik's but a wonderful couple dance. The music will not make you wild, but would touch your heart. Especially the last sequence (instrumental) creates the required emotion and restlessness of the Taani.\n\nThe movie has some beautiful sequences. Suriji falling in love with the yellow tiffin, Raj's entry, the PROPOSAL (you certainly should not miss this one), and finally the climax. The starting and ending 30 minutes are awesome. But the intermediate portion is not up to the mark. It could have been improved or trimmed, but its kept to keep the film lighter.\n\nThe acting is superb. SRK has once again proved his mettle and is par excellence. Anushka does a great job. She has done a great work in-spite of being pitted against a top notch artist. Vinay Pathak is good. The songs are a big let down. Most of them seem to be stuffed forcefully. And in Choreography, Shiamak has done a wonderful job with the climax sequence. Also the picturization of \"Tujhme Rab Dikhta Hai\" is mind-blowing...\n\nWatch it if you believe in Love..."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ilpintl",
        "review_rating": "7",
        "review_title": "Utterly charming fare!",
        "review_detailed_main": "Okay, so I saw the new Shah Rukh Khan film directed by Aditya Chopra and--no points for guessing right--I LOVED it. \"Rab Ne Bana Di Jodi\" has the sketchiest plot, but thoroughly endearing performances by Shah Rukh and confident new find Anoushka Sharma. Vinay Pathak was very good, too, playing the usually thankless hero's best friend role. This is probably the first Yashraj film to be shot in India in a long time. We are shown Amritsar, its Golden Temple, but mostly the bustling lane where Shah Rukh lives in a gorgeous rambling old-world house with courtyard and barsaati that I immediately wanted to own.\n\nShah Rukh gets better and better, once again playing two characters in the same film. There would have been no film without his performance. I loved the decency and diffidence of his Surinder Sahni character, who mans a help-line for the State utility company: Punjab Power here; lighting up your life, ji. To reveal any more would rob whatever tiny element of surprise the film has. I reiterate: Shah Rukh's phenomenal success allows him to inhabit characters that are compellingly real. During his struggling days, he was so full of himself, so desperate to prove himself and to succeed, there was no room for a character. Audiences saw the same abrasive smart Aleck in film after film, until he hit the big time. Once stardom came, the actor in Shah Rukh was able to emerge. For the past few years, every character (with the possible exception of \"Don\") he played has been immensely watchable: the dignified Kabir Khan in \"Chak De India\", \"Om Shanti Om\"'s hapless Om Prakash Makhija and oversexed bratty Om Kapoor, and \"Paheli\"'s lovelorn shape-shifting ghost, to name a few.\n\nI am blown away by the poise and professionalism of recent first-time leading ladies. One would never guess they are débutantes: Deepika Padukone was almost scarily self-assured in \"Om Shanti Om\", and Anoushka doesn't lag far behind. She doesn't appear to possess Deepika's megawatt glamor, but fills the girl-next-door requirements of this film admirably, while singing, dancing (full marks here), and emoting like a filmi veteran. Anoushka wears understated salwar-kameez for most of the film with a spectacular collection of \"aari\" and \"phulkaari\"work dupattas...now there will be a huge spike in their popularity. Very sad that the one-of-a-kind \"phulkaari\" ooparnas that I was thrilled to find this past March at a Taj Blue Diamond artisanal exhibition/sale (and for which I plonked down a bundle) will soon be seen on every Harinder, Gurinder, and Jatinder Singh and Kaur. Amend that: the Harinders and Gurinders have always been wearing them, but now the rest of India will catch up.\n\nThe BIG item number of the movie: Anoushka imagines a filmi song sequence where Shah Rukh's \"Raj\" character sings and dances with five heroines in a colorful homage to the various eras of Hindi films: Kajol as Nargis (Kajol, in a simple white saree and black blouse, has never looked more beautiful.), while SRK plays a Chaplinesque Raj Kapoor; Bipasha Basu as Vyjayantimala (makes an interesting pair with Shah Rukh, wonder if they'll be cast together in a film soon...) with SRK as a noddy and natty Dev Anand; Lara Dutta as a Helen-type (there will only be ONE Helen, Lara's valiant efforts don't even come close to the real thing) while SRK channels a suave Shammi Kapoor; Preity Zinta as a Technicolor Mumtaz paired with SRK's Rajesh Khanna, and, finally, Rani Mukherjee looking amazingly like the \"Khel Khel Mein\" Neetu Singh with SRK Rishi Kapoor. Must say, however, that the song itself isn't memorable despite the gimmicky mix 'n' match lyrics taken from old movie songs, but the visuals make up for it. Surprisingly for a Yashraj film, the music is not brilliant, but merely serviceable.\n\nAlso saw trailers for \"Billo Barber\", the next Shah Rukh film costarring Irfan Khan and Lara Dutta (they play husband and wife) with SRK as a very famous movie star (hmmm...hasn't he done this before?), and the next Yashraj offering--located comfily once more in NRI land--called \"New York\", starring John Abraham, Katrina Kaif, and Neil Nitin Mukesh with some sort of a tense 9/11 plot line.\n\nGlossary: \"aari\" and \"phulkaari\" - types of embroidery that originated in Punjab...I learned this on my last trip to India."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shahabkalim-1",
        "review_rating": "10",
        "review_title": "goo.....light up your lives....",
        "review_detailed_main": "One thing is for sure..If you don't enter into a theater showing Rab Ne Banadi Jodi expecting another Raj Malhotra or Raj Aryan, then trust me ,you will surely take home with you, Mr.Surinder Suri of Punjab Power. Suri is someone whom we come across everyday in our lives.He is there in every bus, he is there in every office building and he is there in every by lane of India and he is the most boring person in the world. Surely,its the realness of Suri's character that brings a smile on one's face.Trousers with tucked in shirts and sneakers\u0085My God, I meet such people twice everyday.\n\nThere is no point giving any synopsis of RNBDJ so I will jump directly to the views\u0085 Rab Ne Banadi Jodi , honestly is damn good illogical cinema at its best with a touch of magnificent subtlety.Its a laughathon but behind this super funny film,there is a masterly screenplay ,where the movie reels fly off with one comic situation after the other, but then in the end when we are at the closing stages, we end up realizing that this film is not about Mr.Suri's unintentional buffoonery instead its about the God that resides in him..And trust me, that God is one funny bloke..\n\nNewbie Anushka is a stunner and she plays the role of a one helluva confused girl, extremely well. You can hate her for the decisions she takes in one scene and you certainly want to give her a hug ,for the next step which she takes, and this is what her role demands.. For a newbie, she has done a fabulous job.\n\nVinay Pathak as the ever helpful barber friend is funny and I hope to see him more with Shah Rukh in future films. The two share great comic chemistry.\n\nThe songs are all very good .Haule Haule is a cool crowd pleasure whereas Tujhmein rab dikhta has been shot really well..Dance pe chance flaunts Anushka's dancing capabilities but one big disappointment was the Phir milenge song.I loved this song the most on audio but the picturization was a bit too bland. None of the girls looked good except Lara. I was really expecting another Deewange.I remember this kind of song way back in the early 90's in Salman Khan's Patthar ke Phool..Wish Shah Rukh gave us something like that but then it ain't too bad either\u0085 The story is actually a one page story and it is indeed commendable that they have stretched it past 2.5 hrs without boring us even once. RNBDJ is a compilation of many old Hindi films like Golmal, Hum dilde chuke sanam and Aaja Nachle but what makes this movie spectacular is Shah Rukh Khan.He is good as Raj but it is his rocking ,shocking ,fantabulous Suri ,who will be remembered for a long time.. Shah Rukh is ageing and it is visible and thank god, he is choosing the perfect roles.Its impossible to think of anybody else as Suri. Shah Rukh is there in almost every scene of the film and I can surely say that he has made this wonderful movie rock big time.\n\nSuri might be lighting up Punjab but SRK had indeed lit up Rabne Bandi Jodi with his magical performance..\n\n8.5 out of 10\u0085.."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sidin",
        "review_rating": "7",
        "review_title": "Magnanimousness but lacks Diplomacy....!!!!!!!!",
        "review_detailed_main": "Well, to start off with, Aditya Chopra spells yet another poignant dimension of pure love as in his previous ventures with SRK; DDLJ and Mohabattein. Yeah! These tales were retentive impressing everyone from 8-80yrs old men and women. Of course, we fell in love getting imbibed with those spellbinding personations in these flicks. So, guess what about Rab Ne Bana Di Jodi \u0096 a film that brings back sensational pair SRK-Aditya together after 8yrs? Does the film exceed everyone's expectations on 'Love' n 'Entertainment' factors? Or merely conks out dashing down our hopes? Hats off to Aditya Chopra! An awesome motif of delineating a touching story of romance...\n\nHave you ever stopped to think if the most ordinary, uninteresting, unobtrusive man you might see on the road or around you might have a love story to tell? Maybe not! How can an ordinary man have a breathtaking, goose flesh igniting, awe inspiring love story of all things to tell? But guess what - love does not differentiate between the ordinary and exceptional, the uninteresting and interesting, the unattractive and attractive. Because love knows no distinction. It can happen to anyone and once it does it engulfs us into it completely and gives us those heaven-sent experiences that only love can yield.\n\nPerhaps, everything in fine and good with the one-liner\u0085. But Aditya Chopra fails in crafting a gripping narration all throughout the show. A flimsy screenplay lacking finesse with bits and pieces of discontinuities and these attributes easily scatters audiences' attention. The best illustration goes with SRK's ducky actresses shaking legs with him for 'Phir Milenge Chalte Chalte' on theater screen. It's completely odd for that situation and possibly, the sequences could've been switched over to latter half as a 'special round in Dance show'. Was it an attempt to deliver a replica of 'Om Shanthi Om' song of film stars dancing together? The film is about Surinder Sahni (Shahrukh Khan) - a simple, clean hearted, honest man working for Punjab Power, leading a humdrum life, when he meets his total opposite and finds love in the flamboyant, fun-loving, vivacious -Taani (Anushka Sharma) for whom the whole world is her canvas and she paints her own life with the colors of rainbow all until unforeseen circumstances changes it all and brings them together. Sooner, its biggest dance show in Amritsar and Surinder coiffures himself as Raj what he calls 'Macho Chap'\u0085 He does it all to impress his girl Taani and what's next? It's a journey filled with laughter, tears, joy, pain, music, dance and a lot of love. A journey that makes us believe that there is an extraordinary love story in every ordinary jodi.\n\nThe first half dawdles with sluggish narration until earlier minutes to pre-interval where SRK's soliloquy with statue takes on emotional quotients. Well, the latter half comprises of few enjoyable moments like Anushka racing on her bike with 'Dhoom Machale' on BCM and next ultimate shot of Vinay Pathak-SRK at garage.\n\nIt's a creme De la creme performance by Shah Rukh Khan as he emotes resplendently on all situations. Be it his make-over sequences adjusting his tight jeans in dance class or the performance in penultimate minutes, King Khan is awe-inspiring. A flawless performance by débutant Anushka Sharma and of course she eclipses Shah Rukh on many parts. What to say about Vinay Pathak? He's over-the-top and more emblazons to the screen. He strides sparkling smiles on our lips with his waggeries and soaks our eyes as he gets emotional. Don't miss the great dance of SRK-Vinay for the original tune of 'Rab Ne Bana Di Jodi'. Its emotional outbursts from every characterization that turns entire spotlights on RNBDJ\u0085 Aditya's innovative thought is laudable on certain parts like Shah Rukh laying rose next to food and again placing it vase, pictorial of Anushka's face for the song 'Tuj Mei Rab Diktha Hai' and entire Amritsar being lit up, 'I Love You' deserves grand round of applause. Fine! Young lads and Misses would hail with praise worthy comments for Adhi's ideation. Both SRK and Anushka swallowing Pani Purees followed by abrupt sequence where he has to finish of delicious Biriyani are evokes laughter.\n\nNevertheless, the biggest flaw is that how come a woman fails to recognize her husband with a slight-make over\u0085. The characters of Surindar and Raj differ merely with thin mustache, hair style and costumes. Both the characters have same voice sans any modulations\u0085.\n\nWhat barricaded Aditya's cognizance while dropping these lines on his paper? Indeed, it's a billion dollar question.\n\nRavi K Chandran's cinematography enhances visual quality and his placement of creative angles deserves special attention. The duo Salim-Sulaiman seems to have not percolated a lot for background scoring. It's again the pieces of existing numbers in album tuned and they sway on all songs.\n\nPossibly, 'Haule Haule' and 'Dance Pe' peaked with high-promos prior to release. For sure, both the versions of 'Tuj Mei Rab Dikta Hai' capture your senses with beauteous visualizing. 'Phir Milenge Chalte Chalte' fails to make it big despite grand set decorations, costumes and top-charting actresses with SRK. Ritesh Soni's editing especially on 'Dancing Jodi' at the climax is mind blowing... Choreography by Vaibhavi and Shiamak are sumptuously ne plus ultra\u0085 On the whole, Rab Ne Bana Di Jodi is enjoyable on many parts with fun, frolic, lots of music and dance, pains and emotions. Well, Aditya Chopra gets stuck failing to pen an engrossing screenplay. It's too long, irksome and more predictability when it comes to narration and the auteur could've better avoided these vistas."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "mujtabashareef",
        "review_rating": "9",
        "review_title": "A Masterpiece",
        "review_detailed_main": "SRK has done it again.....He showed why he is the King Khan.... The movie was really very good, saw it the second day...was waiting to watch this since last 10 months...Finally saw it...\n\nThe story is very well executed and well directed....People will be looking for a DDLJ kind of touch in this but there is nothing like DDLJ in this because this is a completely different story compared to DDLJ...Instead this movie shows the direction skills of Aditya Chopra..the wonderful story writer who wrote movies like \"Veer Zaara\"(A Love Story), \"Dhoom 2\" (A Action Flick)....\n\nThe Music is very good..Salim Sulaiman are here to stay especially the composition of \"Tujh Mein Rub\" is the best of all...The lyrics, the singer Roop Kumar Rathod excelled brilliantly... and the Background score is to very well executed....\n\nNow lets look at the Performances.... SRK...Excellent...Best role after Chak De...He was the only actor in this industry who could have portrayed the role of \"Surinder Sodhi\" excellently...nobody else could have excelled so well in this role except him....\n\nAnushka....Good start...the girl looked cute and beautiful and she acts good..She is here to stay...\n\nVinay Pathak...always the best...\n\nChroegraphy and execution of the songs is too good, especially the \"Tuj Mein Rub\" and \"Phir Milenge Chalte Chalte\" as well with the beauties of Indian cinema and SRK portraying the Best Romantic Heros of all time was a treat for the eyes......\n\nOverall Rating : Music : 8/10 Story :7/10 Direction: 10/10 Performances: 10/10\n\nGo for it.........."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "megha6582",
        "review_rating": "7",
        "review_title": "A simple love story!",
        "review_detailed_main": "Rab ne.... is the story of a simpleton Surinder (SRK) who ends up with the girl of his dreams Taani (Anushka) but is unable to evoke feelings of love in her since their marriage was brought about by certain unfortunate circumstances. The story goes on to show how Suri tries desperately to woo his wife by undergoing a makeover to become a smooth talking-savvy Raj. Fortunately for him.....in his new avatar, his wife does not recognize him to be her plain, boring, middle class husband (Ummm....that part by the way, a little hard to digest!). His attempts to win her over succeed and now the damsel in distress cannot decide what to do. Should she continue to be a 'good' wife and live in a loveless marriage with the person who has done so much for her or should she follow her heart and go back to being the old Taani who loves to laugh, have fun and live life to the fullest with Raj? Throw in a dance show premise and u have the story of Rab ne bana di jodi.\n\nThe entire movie is shot in Amritsar and every scene has a realistic look. There are no perfect 'dream-like' houses, streets or even songs in the movie. The movie is fun in places (catch Taani riding a bike aka Dhoom 3), slow paced in certain others (most of the emotional scenes)and downright boring in a couple of scenes (one notable being the scene where SRK talks to the mannequin dressed like him). The songs are alright.....I expected more from the score of a Adi Chopra movie. SRK is good but his age has really started to get the better of him. The 'cool' look (meaning: tight clothes, tattered jeans, colored hair, metal chains) don't really suit him anymore! Maybe another actor in the same role would have done a better job. The newbie Anushka is quite good in her debut movie although she has a long way to go in the emoting department. Her wardrobe and make up have been dealt with well. Vinay Pathak as Suri's friend Bobby is OK.\n\nIf you are an SRK fan, you will like or may even love this movie. If you are not, you will probably end up finding it boring and uninteresting. For those in-between, go watch it to find out!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "unbornpaniwala",
        "review_rating": "1",
        "review_title": "I want my money and precious time back...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "mdada",
        "review_rating": "10",
        "review_title": "Excellent Movie which kept my tears rolling all the way.",
        "review_detailed_main": "I am great fan of Sharukhan. He is actor who stands taller than the crowd. For me this movie was way beyond I had imagined. I usually don't want Hindi movies or like usually Sanjay Khan vs other new generation actors.\n\nDepiction of Amritsar is very realistic and even Ms. Chadda will agree (Bride and Prejudice) that she could have added some more here and there.\n\nI was watching this with my wife and all along tears kept rolling. The pain is portrayed so well, I never thought the actress was acting the first time. She was as seasoned in acting or say natural that I kept on thinking about Rani Mukharjee (Not comparing to Ash because it needs 2nd or 3rd to prove).\n\nMoreoever the pain was with both sides and they both were oblivious of actually each others pain (it is not easy to understand what the other party is thinking when you are busy in your own thoughts.) Sharukh represents a true simple middle class Punjabi (Rather West Punjabi) who spends life in very simple way all through. As Raj, it proves how Indians could be deceptive as Surinder's and transform in Raj's (West) of America (Pretty simple evolutionary jump which for some is unfathomable generation gap).\n\nAnkusha has shown all the roles of serious as well as a modern actress, like, keeping it up with Sharukh's talent. On top of it she is extremely beautiful and you will be forced to devour the beauty.\n\nEnding and other parts of the plot are as usual we have in Hindi movies and cannot be translated. For me Sharukh is like an alien who entertains us and is giving message of brotherhood while holding back his identity."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "the_birs",
        "review_rating": "6",
        "review_title": "Not That Bad..",
        "review_detailed_main": "I saw this movie two times (one alone and one with my little sister) and now I'm here to write my thoughts and give a vote to it.\n\nI'll give 6/10. The music is nice, the story line isn't that bad yet it could be better (i'm talking about the scenario). I didn't find it that convincing. The principal actors are playing nice yet for me it's hard to believe that the girl Taani didn't recognize that the 2 characters are the same (talking about Shahrukh Khan' roles).\n\nI advice you to watch it at least one time (for Shahrukh Khan and for the pretty songs). The new actress is playing well for her 1st movie with Shahrukh Khan she was acting not that bad."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shahnawaz-kherani-191-737063",
        "review_rating": "1",
        "review_title": "Uff",
        "review_detailed_main": "Simply awful What a punishment if watch this movie in theater... I wish IMDb have given option of 0 star than this movie truly deserve 0. horrible music awful acting nonsense songs' lyrics Still won awards cant believe..The worst part was the pacing, and the dialog's - which were forgettable. Watching the movie in a theater, I found myself waiting for the intermission, and then for the ending. Some viewers were wise not to wait, and were seen leaving throughout the duration of the film I wouldn't watch the movie even if someone paid me the cost of the tickets or even gave me a free burger with it. \"FINALLY THIS MOVIE SUCKS\""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ThironthoramDude",
        "review_rating": "9",
        "review_title": "Everything above the ordinary about this movie",
        "review_detailed_main": "Now I know what took Aditya 8 years to bring out his next movie, after Mohabatein. Nobody would have churned out such a heart-touching simple sa story and said it with equal simplicity and yet achieve the max possible mileage out of it. And even more amazing was the fact that there were just 3 characters( well that is if you count the two characters played by Sharukh as one ), with significant roles , in the whole movie. The screenplay was so tightly woven and every emotion was there to be seen and felt.\n\nShahrukh delivers yet again and his performance as Surinder from Punjab Power is going to remain etched to my memory for a long time. Raj was typical to an extent but there again there was a visible amount of peculiarity about the character that separated it from the usual \"Raj\" characters that we see so often in Bollywood movies. This man does know the point from which the 'dil se' (directly from heart) connection can be made.\n\nNew-comer Anushka as Taani literally swept me off my feet. To be honest, I never liked her in the promos that were shown on TV, but when I saw her on screen I was totally mesmerized by her charm, simply beauty and excellent dancing skills. She is here to stay. And of course Vinay Pathak's role as Suri's friend revelled with atmost conviction.\n\nOkie , so here is how I would sum up : If did not see the movie till now then better go and watch it soon coz there is heart and soul in the movie n along with that a Rab Ki Bana hua Jodi. Cheers :)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kunalkhandwala",
        "review_rating": "6",
        "review_title": "Mediocre film yet again from the Yash Raj banner",
        "review_detailed_main": "The Aditya Chopra-SRK combo has given the world DDLJ and Mohabbatein which are cherished in every romantic's memory with the sheer cinematic beauty, story telling, characterization, music and love story. The trademark 'Yash Chopra romance' was apparent in almost every scene. With a title that says 'Rab Ne Bana Di Jodi', one would expect the epic of all epics of love but what one gets is a mediocre film shot almost on stringent budgets due to the global recession with a story that wouldn't be a challenge even for a débutant director. The music would seemingly fade away from memory like the leaves in Mohabbatein's scenes and the characters which are as mortal as the simplicity of the film's premise would contribute to its undertone of unfailing love. In the end, 'Rab Ne Bana Di Jodi' is not your Chopra-SRK love saga at all. In fact, it is the most mediocre of King Khan's romantic ventures with just as many good moments as an unshaken bag of warm salted -butter popcorn.\n\nSurinder Sahni (ShahRukh Khan) works for Punjab Power (the 'Lighting of your life') in Amritsar. This Suri fellow is your average enterprise worker \u0096 humble, simple, distasteful and boring. In an unexpected move by fate, he is married to Taani (Anushka Sharma) who has lost everything she had in a tragic turn of events. As Suri tries to maintain his distance from his wife who is yet to come to terms with the situation, his polite and humble approach has a charm of its own which is very unlike the flirtatious Khan we have been used to. Taani consciously tries to make things work, being aware that falling in love will be impossible but being a good wife should not be. Thus, as she prepares his tiffin for lunch at work to his utmost joy and as they watch movies together, Suri falls deeper in his blissful state but to gain her acceptance, he plans on something radical with his buddy Balwinder 'Bobby' Khosla (Vinay Pathak) who does a complete makeover, Golmaal style from Suri to Raj. Thus begins the transition that is now fairly common in most SRK films with Raj charming his way to Taani's heart only to realize that she is falling in love with the wrong person. Raj is not Suri and since she is married to Suri, he should be the one she must come to accept for what he is and remain faithful to him. Suri's conviction in this premise is true Yash Chopra fare and is among the more sensible areas that the film touches upon. The rest is just ho- hummm\u0085\u0085\n\nDebutant Anushka Sharma impresses a bit more than she did in the promos but is definitely on the bottom of the list of Chopra's leading ladies. Vinay Pathak is brilliant in every scene and cracks you up with his typical comic act. The rest of the cast does not even deserve a mention and thus the film is virtually on SRK's shoulders which he ably carries. But then again, the character was so simple, the story was so banal, the look and feel of the film was just so mediocre that it did not really need King Khan. In fact, Ranvir Shorey would have done a brilliant job in the lead especially being paired with Vinay Pathak, the duo would have taken the film to another level. But alas, Adi Chopra's earnest wish to depict a common man in Amritsar in an extraordinary circumstance in his married life just resulted in a mediocre film. Perhaps a finer treatment, more visually appealing with more impactful dialog and never seen before type scenes would've hailed the return of Aditya Chopra as the director. Veer Zaara is a perfect example of the return from a sabbatical wherein Yash Chopra gathered the best of what he had compiled over the years and poured everything into a rich basket that flourished in the fragrance of romance. Nothing of that sort can be found in 'RNBDJ' and Yash Raj films disappoints yet again on that note. Salim-Suleiman give us a total of 4 tracks, 'Haule Haule' being the most resonant and hummable. 'Tujhme Rab dikhta hai' is melodious with Roop Kumar Rathod's rendition while 'Dance pe chance' is catchy but may only dubiously last as a hit track. 'Phir Milenge chalte Chalte' tries to be another 'Om Shanti Om' version of mixing old songs and celebrities but fails on all grounds.\n\nYes, the film has its moments of charm, innocence, sincere effort in making a relationship work and tender romance with a dash of comedy but everything is just in little doses that fail to leave the bigger impact. Perhaps the Chopras should do what they do best and leave the experiments and simplicity for the new directors that they have been encouraging. Rab Ne Bana Di Jodi is a light entertainer nevertheless and while we hope for more spectacles from King Khan, the expectations from the Yash Raj banner go one notch lower yet again."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "gangster_18",
        "review_rating": "8",
        "review_title": "SRK has done it again!!!!!!!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "nitinagarwal43",
        "review_rating": "6",
        "review_title": "An age old formulae",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: Rab Ne Bana Di Jodi",
        "review_detailed_main": "Surinder Sahni is your typical routine joe who works for Punjab Power, meek and gentle, and a nerd to most. His love life is practically zilch, but on a visit to his old school teacher's home, he gets captivated by the beauty and vivaciousness of his teacher's daughter Taani (Anushka Sharma), who has heard about him because of the frequent comparisons her father makes. But that day turns out to be a tragedy instead, with her fiancé and in-laws meeting with a fatal accident, and her father coincidentally suffering a stroke. A decision was made then, for her to be betrothed and married to Surinder, someone whom her father trusts, but this shotgun, arranged marriage turns out to be a loveless one for Surinder.\n\nThere's this albatross hung around his neck, because his arrival heralded the darkest period in Taani's life, and thus was told upfront that while she can be a good wife to him, but she will never love him. Naturally this breaks Surinder's heart because there's nothing in this world he wouldn't do in order to bring her happiness that was originally hers, if he had in the first place not been associated with pain when he entered her life. While he has some little itsy-bitsy happiness stemmed from Taani's taking care of him, he still feels shattered knowing that whatever sincerity, care and concern he'll be showering on her, will have zero effect in trying to win her over.\n\nOpportunity presents itself of course, when Taani, bored with being a housewife, signs up for a dance class with Surinder's sponsorship. With the help of his good friend Bobby (Vinay Pathak), he transforms himself to the suave romantic hero with an alter ego Raj, crafted according to the male leading men in films that his wife appreciates, and decides to take ownership on his love life by wooing Taani from scratch with this new, outgoing persona. But alas as we all know, such a plan becomes a recipe for disaster, because while Taani would not change her heart for Surinder, he has now taken the extreme into becoming someone totally different, and thus struggles with the pain of living a lie, especially when his plan becomes successful and leaves him pondering over whether to live a lie forever, just to be with her.\n\nRab Ne Bana Di Jodi thus becomes embroiled with plenty of situational comedy involving different identities, but at its core is still a very strong romance story dealing with the notion of unconditional love without expecting anything in return, which Taani fails to fathom why anyone would go to such lengths in order to bring happiness to her life. Written and directed by Aditya Chopra, this story is strictly for the romantics at heart, otherwise you'll naturally balk at the thought that nobody could recognize Shah Rukh Khan whether or not he's the ordinary man Surinder, or the styled up Raj, especially when his wife Taani is the one who is blind-sided. But of course you can live with it if you buy into the whole Clark Kent- Superman secret identity where a pair of spectacles does wonders.\n\nThe literal translation of the title means \"a couple made by god\" and as you know the man up there has a sense of humour sometimes, preferring to allow the couple to go through a number of painful periods in order to strengthen their resolve for each other. However, the story still steered very clear from the darker themes such as adultery, although Surinder and Raj are essentially the same person, Taani's falling for the latter does come after a long period of courtship, and curiously, she doesn't reveal her marital status till late. So while that theme might rear its ugly head once in a while when you pause from the incessant bonding between Raj and Taani, it doesn't get broached beyond that.\n\nBeing a Bollywood movie would also mean plenty of song and dance, and being set against the backdrop of a dance competition, it brings about opportunities for the characters to hit the dance floor their moves. Shah Rukh Khan gets to showcase both extremes in character, one being the nerd with two left foot, while the other being at the opposite with plenty of smooth moves to show off. If anyone's in doubt of his acting ability, I guess this one movie will show what he's capable of. In fact, between his portrayal of Raj and Surinder, I prefer the latter more, because he had fused some wonderful nuances into his Surinder, that makes him an instantly likable character, while at appropriate moments, his portrayal shows you that tender side of him as well as the internal emotional struggles he has to go through as he woos his wife. Newcomer Anushka Sharma holds her own against the veteran as the young wife Taani, who's at constant odds with her marital obligations, and on the other knowingly falling in love with someone whom she becomes dangerously attracted to. Of course what she fails to realize is that they're the same person after all, and her best performance comes from the finale where you can see how she reacts to her make believe world come crashing down under the weight of realization.\n\nI guess loving someone unconditionally is that constant challenge, if it's at all possible extending otherwise from that of a mother toward her child. This film is an ode to that kind of loving emotion, and to a certain extent it puts the other person on a higher pedestal than oneself. I would prefer to overlook the flaws in the movie if any, and highly recommend his one to all the die-hard romantics out there, given the excellent performances, story as well as the beautiful songs that puts romance back into the air. An average joe can have an extraordinary romance, and Rab Ne Bana Di Jodi captures that wonderfully."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Very mixed feelings on this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "movie_freak_dubai",
        "review_rating": "6",
        "review_title": "A nice movie with a wonderful acting debut!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "gauri-w",
        "review_rating": "2",
        "review_title": "waste of money!!!",
        "review_detailed_main": "One of the worst Shahrukh Khan movies.There was a little humor at the beginning and then it was like a chewing gum being chewed for a long time.The director tried to add all possible scenes to make it a masala movie.but that made it even worst.\n\nThere was no logic in the story.\n\nTo add to the pain....at the end shahrukh khan was narrating his honeymoon trip in his irritating voice that he thought, would be very comic.\n\nscenes were so slow..i wished i cud have a remote control to fast forward it.the movie is a complete waste of money.actress is also dumb."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "cn313",
        "review_rating": "9",
        "review_title": "It was about time...",
        "review_detailed_main": "for Indian cinema to bring out a memorable film like that..It exceeded by expectations..i was a bit disappointed b the last few srk movies..but this one is different...I just came from the cinema where they showed it and i must admit that its awesome... everything fits so good: the traditional Indian scenes, the \"modern scenes, the music (which is gorgeous), running time (not too long, not too short), plot, acting... there is a perfect mixture of comedy and drama , makes you laugh and in the next scene you're about to cry. You sympathize with \"the different kind of shahrukhs\" ( i don't wanna spoil the movie so im not gonna tell you details)and its hard to tell what will happen in the end because to the audience there is no right/wrong so you have everything a good movie should have: good actors, good plot, nice soundtrack and a satisfying end... don't miss this masterpiece because movies like this are rare in bollywood.. in my opinion its the best srk film since veer zaara.."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ripplesofserenity",
        "review_rating": "6",
        "review_title": "Not bad at all!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "raviu_kanth",
        "review_rating": "1",
        "review_title": "Nothing interesting same old story",
        "review_detailed_main": "Their is nothing new in the story,you always know what is happening and what is going to happen next.ordinary performance by new actress but this time sharukh tries to save but it doesn't help. even though the music is awesome but the story completely disappoints. nothing more to say about this movie so my verdict is don't watch it,it is not worth watching\n\n1/10 for this movie for sharukhs performance\n\nalways there is much hype about sharukh movie so this time also there was much hype but the movie doesn't redeem the audience it completely falls.\n\ndirector completely failed to catch the innocence of the nerd character instead much importance was given to other macho character which fails to impress the audience."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "pranav-13",
        "review_rating": "8",
        "review_title": "Rab-ji Ne Jama Di Jodi!",
        "review_detailed_main": "I was a bit anxious when I went to watch RNBDJ, One because the film hadn't received great reviews, Two because Yash Raj Films of late have been competing with each other for \"The MOST Pathetic Film of the Millennium\" award and last (but not at all the least) because I hadn't liked Aditya Chopra's last directorial venture, Mohabbatein.\n\nSo I went inside the theater fearing the worst..... and came out with a smile on my face. I won't say this film is anywhere near DDLJ, but its much better than Mohabbatein, Veer-Zaara and the other Yash Raj Love stories of the past few years put together.\n\nThe film is all about Surinder Sahney alias Suri and his attempts to make his wife fall in love with him. How he does it, well, I won't reveal it! But suffice to say that the journey is pretty wonderful, making you laugh and cry at times, with a Happy Ending, of course! The music is not extraordinary, but quite hummable. The dancing background is kept to the minimum (which is a relief). There are no big dances as in Jhoom Barabar Jhoom! Of the cast, Vinay Pathak as the best friend and ally is superbly funny. Anushka Sharma looks pretty and does a decent job as the cute Taani-ji. But of course, the film is about THE KING and he does not disappoint at all! His Suri and Raj are equally brilliant! Especially the scene where he bares his soul to a mannequin...... Shah Rukh is just Awesome (as usual!) All in all, its a good entertainer. Not an out and out comedy, not really a Mills n Boon Romance and definitely not like the boring, sobbing movies shown in the film itself! Don't expect a DDLJ, and you will definitely enjoy this one, I can vouch for it!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "An Below Average Flick With A Terrible Title",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "manoj-ransing",
        "review_rating": "6",
        "review_title": "When base is hollow, the building cant stand much",
        "review_detailed_main": "RNBDJ is a decent entertainer. Fortunately I got free tickets of this movie and it was not so bad experience. Some of my friends who have already seen this movie warned me that its a boring movie. Inspite of that due to free tickets I went and watched it.\n\nFortunately the experience is not much regrettable for me, but not very pleasant also. The good thing about the movie is the music, songs and the actors. I am no fan of SRK. But I agree that he has the power to make people stick to their chair. In this movie, he performed Surinder beautifully. Raj is his normal overacted character, which we are used to. And here it is much overacted because the script demands it. The new actress and Vinay have done to their best, and performed well. The movie (when watched in theater) will make you sit to your chair till it ends. Some scenes are unnecessary and makes you snore. But still the movie is presented in a very pleasant and cool way, without any of the hyper drama and overdoses of love, friendship etc. These facts makes some positive impression.\n\nBut the basic problem of the movie is the base storyline of the movie. And this storyline is very thin and barely believable, and a lot childish. Just because someone trim mustache, remove specs and wear tight clothes doesn't make all together different personality. At least not for his wife. Also the wife saying to her boyfriend that she wants to leave, and on next day saying that she doesn't want to leave, is something that did not digest. Other than this due to very inherently corrupt baseline, the script itself has many loop holes, which doesn't make anything believable (e.g. the sumo fighting scene). The characters are also prescribed same. They are some times mild, sometimes over and hence do not make much impact. The director should know when to end the movie. After Raj says I LOVE YOU the movie should have ended within 15 minutes. But its still goes on, and then the dance at the end was utterly unnecessary. These facts also makes the impression bad about the movie. Faster the climax better the movie. Normally I hate watching songs in the movie. But in this if the songs were not there, I would have got out within minutes. Songs have definitely played a very good role in the movie. But in that too, hearing same music and line 'Rab ne bana di jodi' in high pitch more than often irritates brain. Again I am no great fan of Yashraj and SRK movies. But normally this combination means a funny, romantic three hours which could be spent with family. This movie too comes in same category, but if possible go with the pillow, so that you can take rest in between. And no need to say that you wont be remembering anything after you came out of theater. (Off course unless you want to write a review.)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "jaydip11",
        "review_rating": "10",
        "review_title": "The Great Awesome Movie Of Bollywood",
        "review_detailed_main": "Rab Ne Bana Di Jodi is a wonderful movie that has come after Veer-Zaara.\n\nWe have seen it perfectly, but there is no complaint about the movie RNBDJ.\n\nBoth Shahrukh and Anushka act like their best, also Vinay Pathak(as Bobby) acts best.\n\nI don't know why there rating is under 9, it should be greater than 9.\n\nAnd this Indian movie should come at TOP OF IMDb RATINGS (because it deserves that).\n\nSo keep voting as 10 so this deserving movie can get place in top of IMDb, otherwise vote as you like.\n\nThanks"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "leenabr",
        "review_rating": "7",
        "review_title": "Blah, too Long, too long and too long.",
        "review_detailed_main": "Im beginning to see a trend in shahrukh khan movies where he tries to crack jokes like \"mind it\" from Om Shanti Om, and his silly shivering and trying to maintain a conversation with a girl. Don't get me wrong I've practically worshipped this guy since DDLJ and KKHH, no one can be a bigger fan. But now its getting to me. Rab ne has a fantastic beginning with him playing a different character who is shy, loving caring and devoted. Anushkha sharma does a great job but she is far tooo tall for him, and looks far too young. the girl is probably in her teens and he's in his 40's even when he tries to look younger in the second half he still doesn't pull it off. On every scene srk has tears in his eyes for \"sacrificial love\" and that gets monotonous. I don't think Aditiya Chopra directed this movie. Even in the making videos he is no where to be seen. I missed Karan Johar. Even if the story wasn't strong, his dialogues, costumes, songs, direction would take the movie places. In conclusion this movie is far fetched (watch out for the \"i love you\" scene where supposedly srk lights up the city for anushka). I would call this movie a pass, and Im disappointed in srk. Watch Swades or Chakde India, don't waste time on this."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rjnishant-1",
        "review_rating": "10",
        "review_title": "A breathtaking Indian movie",
        "review_detailed_main": "I saw Dark Knight recently, and as much as I loved it, I was saddened that it could be light years before an Indian movie could reach that standard, story telling wise. Then comes along 'Rab ne bana di jodi'. As much as I like properly made, not trying-hard-to-be-cool Hollywood movies, it rarely ever fills the part of my heart which is purely Indian. Even for perhaps my favorite movie of all time (Batman Begins+Dark Knight), I kill myself a little to truly enjoy it.\n\nRab ne bana di jodi follows slightly in the vein of Swades, a movie I loved but a dud at the box office, perhaps for its slow pace.\n\nI will try to go about the review without giving away anything that might spoil this wonderful movie for you. The first half of the movie has a fair dosage of comedy, while the second has practically no entertainment(comedic or any kind of a breather) whatsoever and I'm incredibly grateful for it. The only way you can enjoy this movie is by completely immersing yourselves into the characters of Shahrukh(Suri) and Anushka(Tana). I was among the 2 of our group of 10 who liked the movie. Having discussed the movie with those who didn't like the movie, with the benefit of hindsight, I would like to give you a couple of pointers to enjoy the movie. First off, Suri is in NO WAY JUDGING Taani's character by doing what he does to make her happy, but doing it for her sake alone. Secondly, the reasons for him continuing to do what he does are exemplarily well put and explained, if you can bear with the nuances of the characters. Thirdly be patient and try not to be critical, at least in the first viewing. Finally, don't be bogged down by the moustache/hair thingy, as Suri plays it really well, with the true personality shining through, throughout. So it is not unrealistic or impractical at all. I tried to leave it as vague as possible, and if it sounds like gibberish, plz be PATIENT and give the movie the benefit of the doubt, at least while seeing it.\n\nEvery character and every relationship arc is flourishingly ended leaving you extremely satisfied.\n\nTODAY, I wish I could type this review, and everything else in Hindi."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "vivekdlko",
        "review_rating": "7",
        "review_title": "Once again SRK proves Its all about HIM!!!!!!",
        "review_detailed_main": "Another Yash Raj outing with our Very Own King Khan , so My expectations were generally high for this one and I wasn't disappointed after watching it on big screen. This ain't our typical Love story Its starts after Marriage of the lead pair , so its different stuff this time from YRF camp which makes it a pleasant watch.I wont Go very detailed into the story though it had its share of flaws , but then again we are not here to look for logic . SRK was as his usual , though i found him more convincing in his Mr.Surinder Suri avatar. New find Anushka Sharma looks adorable and stands tall against an artist like SRK. Vinay Pathak As the side Fiddle to SRK also plays his part well. Music was not at par with other YR films , But U can easily Pick out \"Haule Haule\" as the best of the lot. Also The picturization of the song \"Phir Milenge Chalte Chalte\" which is actually an intended spoof is superb , watching it on big screen will do full justice to the hard work being put in that song. All n all a Decent Time Pass Movie Consisting Of Comdey , romance and drama (Typical Bollywood stuff)Though Presented with a new style."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "saxena_ashes",
        "review_rating": "5",
        "review_title": "Boring movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "prashant203",
        "review_rating": "10",
        "review_title": "This film is a beautiful romantic movie with Shahrukh Khan in the lead. This film is all set to mesmerize the audiences.",
        "review_detailed_main": "i like the movie..not because the king khan is ma best .but good concept...yeah it was dragged a little bit in the end..but nice work by the director.the king was extremely good..the new comer did a gr8 job..Hey Guys dis really is a masterpiece one should not be missing in his lifetime.Now dis movie has seen the best acting skills of the king.He steals the show as he excels in every frame either it be comedy or the emotional scenes.His makeup itself makes u freak out and at the same time it makes u sentimental at times where he gets emotional.Movie is kinda underdog winning in the end and its the good subject for many.Overall a full entertainer,full money worthy ,expect to break some BO reports pretty soon"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shyaammenon",
        "review_rating": "7",
        "review_title": "A Very Good One-Time watch",
        "review_detailed_main": "If you are looking for a crisp answer then: Go for It.\n\nThe romance arc was pretty well done and the chemistry between a timid Suri(SRK) and lively Taani (Anushka Sharma) was properly exhibited. It did a good job pulling few of my heart strings. (I kinda get swayed easily by romance)\n\nThe main flaw in the entire movie is that an introverted Suri turns into a completely outgoing fellow Raj just by changing his looks and without much difficulty. They could have displayed the transition more satisfactorily.\n\nExcept a few scenes where Anushka goes completely expressionless, she has proved herself in debut.\n\nIf i did say something wrong feel free to correct as this is my first review and it may have flaws. Thanks ;)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "An OK feel good movie but entertaining only in parts.",
        "review_detailed_main": "A Shahrukh movie along with Aditya Chopra having a unique look had great expectations. And fans all over were just ready to fall in love with the movie in any case. But the final outcome may not be upto the standards expected. In a short review RNBDJ is an OK sweet movie having good performances by the lead pair, has all predictable content, a bit lengthy and entertains only in few parts. No doubt Shahrukh's fan following is capable of making it a Hit, but the movie leaves the viewer somehow less satisfied.\n\nThe best part of the movie is the starting 20 minutes where all the characters are being introduced impressively and you easily start liking the narration. Using the Punjabi feel, the current favorite of Bollywood, Aditya captures The Golden Temple beautifully and sets the mood showing the streets of Punjab. Everything is fine till the main plot of a dance competition is disclosed. From there onwards the movie starts entertaining in gaps. The plot moves around how a Husband (Shahrukh) tries to win his wife's (Anushka) love by playing a double role of a shy husband at home and of a happening and chill out dance partner in a dance competition.\n\nAfter the transformation of Shahrukh as a fun loving dance partner, the movie is completely open to the viewers as if they have already read the script. Every sequence from then onwards is all predictable and you also know how the movie is going to end too. Still as a loyal fan you keep waiting for more entertaining sequences but they are not too many to come. The movie never surpasses the mood set in first 20 minutes, so you start feeling lazy at times too. Whole movie relies on the two main lead characters and they both carry their part with perfection. But as the storyline has no exciting twists and turns to offer so it remains a sweet movie, nothing extraordinary, far below the expectations.\n\nAmong the merits of the movie are the top rate performances of Shahrukh and Anushka. Shahrukh plays the role realistically without falling in the trap of over-reacting. He surely deserves appreciation for the simplicity he adds to the role of a common man and his visible support to the newcomer. Anushka surprises with such a professional debut very close to just perfect. Her dialogue delivery and confidence doesn't reveal that it is her first movie. She may not have the looks to kill but has got the talent to sustain. Vinay Pathak is purely lovable in his act and provides a good support to Shahrukh. These are the only three characters around which the movie revolves and that works as a drawback to the movie because you miss some more catchy characters in the plot. Apart from good performances there is nothing extra special about the movie to write on. It really does not look like a Aditya Chopra and Yash Chopra movie.\n\nAmong the weak points, first comes the thin and all predictable storyline. The moment viewer comes to know the plot he starts losing interest in it. Secondly the comic sequences in the movie, like the motorcycle run by Anushka, Gol-Gappa eating scene, both watching films in the theater and Shahrukh's fight with Sumo wrestler are not convincing or entertaining at all. There are not many great moments to share in the direction. Thirdly the whole dance completion thing is played too simply and in minute details. There are no major judges to the completion and there are no major competitors to watch too. There are no lavish dance performances in the competition and Shahukh-Anushka pair simply wins the contest as they were the only couple competing there. Their final performance at the stage is completely uninteresting and unimpressive. The whole dancing couple contest and Stage sets were not as expected from an Aditya \u0096 Yash Chopra movie. The glossy and stylish look of a Yash Chopra movie is totally missing. In fact it seems to be a film from a not so established production house. Fourthly, the length of the movie pinches you at times and you feel some scenes to get over fast giving way to more good ones. And lastly there is a major flaw in the direction. If a garage owner (Manmeet Singh - from whom Shahrukh buys his new car), can recognize Shahrukh in his new avatar, then how his own wife is not able to recognize him.\n\nMusically, the movie is weak too with only one song to remember that is \"Haule Haule\". Interestingly this only good song is also an inspired version of a Adnan Sami number. The other added attraction is a song featuring Kajol, Lara Dutta, Rani Mukherjee, Priety Zinta and more. But this song is not able to impress too as it was not even one tenth entertaining as the song in \"Om Shanti Om\". Songs have been a merit of all Shahrukh-Yash Raj movies, but this one stands far out of that impressive list.\n\nIn few words, Rab Ne Ban Di Jodi, fulfills the expectations only to some extent. Everyone was expecting an entertaining movie with sequences of laughter, fun, youthfulness and excitement. But there are very few such moments in the movie. Aditya is not able to create the same magic as he did in DDLJ. It's not a bad movie, but it is not a highly entertaining movie too. You will surely feel restless at few places and also bound to hear some noises in the cinema hall.\n\nIn the end, I would like to mention that after the first 20-25 minutes of the movie, the most entertaining part of RNBDJ is the Voice Over of Shahrukh along with the end credit rolls sharing the experiences of their successful Honeymoon in Japan. A Well executed ending makes you feel good while you leave the theater."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kyakoolhaihum3",
        "review_rating": "10",
        "review_title": "A very, very good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Aditya Chopra's tribute to \"Satyam Shivam Sundaram\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "zabalmsm",
        "review_rating": "6",
        "review_title": "A Decent Blend of Romance and Identity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "WayneRooney10",
        "review_rating": "10",
        "review_title": "Rab Ne Bana Di Jodi = Aditya & SRK !",
        "review_detailed_main": "Story, Screenplay, Dialogues & Direction by Aditya Chopra! Phew.. and together with Shahrukh Khan you expect nothing less than EXTRAordinary! So, without further delay, simply put Aditya Chopra and Shahrukh Khan spell the magic again! Wonderfully done! And special credit should be reserved for Anushka Sharma! What a fantastic debut! She holds her own and without her the movie would not have been the same! Kudos! Vinay Pathak was good as well! Awesome picturizations for the wonderful songs.. Good job Shiamak Davar and Salim-Suleiman respectively! So, overall loved the movie! Go watch it with your whole family! Everyone will enjoy it! Ps. Watch the credits after The End.. :)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "belleaudrey",
        "review_rating": "7",
        "review_title": "Fun",
        "review_detailed_main": "This is a fun way to spend your time especially in the summer with friends, having a few drinks, watching a fun comedy with some romance you don't have to think about too much, just sit back and enjoy the singing and dancing.\n\nSurinder Sahni is fun to watch, he is a regular Indian guy who ends up getting forced to marry the beautiful Desi Taani(Anushka Sharma). The story is full of expressing Surinder's pure love towards Taani complete with all the required songs and dances of a Bollywood style film, wish I didn't need the subtitles but still enjoyable.\n\nIt's pretty predictable but like I said an enjoyable sweet way to spend an afternoon."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rahuldatta",
        "review_rating": "10",
        "review_title": "Brings a smile to your faces , go watch it with your family!",
        "review_detailed_main": "I have just watched this movie at a local multiplex which was packed to its capacity! It certainly has Shah Rukh Khan in one of his career best performances! Aditya Chopra returns after 8 years and hasn't lost his magical touch of a talented storyteller. As a director , he has a strong grip on the proceedings and tells a story very effectively .\n\nExcellent performances from the entire cast . Anushka makes a convincing debut , and exudes confidence. She has given a sparkling performances.\n\nWatch this with your family & friends and enjoy this clean and enjoyable entertainer . Certainly one of the better movies of 2008"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "virindra",
        "review_rating": "7",
        "review_title": "Sharukh acts terrific.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rahim-q",
        "review_rating": "1",
        "review_title": "The worst film of SRK ever......pathetic",
        "review_detailed_main": "I went into the theater expecting a lot..........aditiya chopra...SRK etc etc.....but the film was not only boring but 100% predictable , stupid ,avg music(6/10),unnecessary songs ( Hem hein rahi pya ke ), and in nut shell complete waste of time and money....totally disappointed....i would give it -ve if it was allowed.........................bollywood is becoming too commercial.......\n\nThe worst ever film of Shahrukh khan for sure.......and mind you only a single person acting cannot make a good film....there shud be some substance as well !!!!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Pratik112",
        "review_rating": "10",
        "review_title": "Couple Made In Heaven - Excellent! Worth Watching.",
        "review_detailed_main": "I had no idea what this was all about as I hadn't watched many of the promos of this movie. But what I did know was who it starred and that it had a new actress and that it was filmed in Amritsar.\n\nA young woman who is fun loving, flamboyant, basically an extrovert, is about to marry a man she loves. However fate takes a turn and she marries a man who is sincere, realistic, government employee, hard working \u0096 basically an introvert. The problems are that he is much older than her and there's no love on behalf of the woman and he is unable to express his love for her.\n\nThe movie stars Shahrukh Khan, Vinay Pathak, Anupam Kher, Kajol, Priyanka Chopra, Preity Zinta, Rani Mukherjee, and Farida Jalal. But it does go on to introduce newcomer Anushka Sharma. This is directed by Aditya Chopra and co \u0096 produced by himself along with his father, Yash Chopra and Shahrukh Khan. The music is superbly given by Salim Suleman.\n\nWhat a way for the newcomer, Anushka Sharma to make an entry into the movies \u0096 introduced by Yashraj and acting in her first film as King Khan's heroine! Indeed she has made an impact with this movie and has gone on to prove that she is a good actress. She is able to use her facial expression brilliantly and her eyes are expressive as well. She has done a good job of her role in this, her, first movie. In time to come, this actress can give some of the other actresses of today a good challenge. One is able to see that she is determined and is capable of giving a good performance.\n\nWith Shahrukh? Well what can one say except that it is unusual to see him the way he does in this film! His performance, as usual is beyond doubt, good and he manages it extremely well. He has also made Yashraj laugh after all the disastrous movies that have been released from them earlier. Not only that it has probably made the cinema owners smile as well due to the opening weekend being able to rake in the money that it has. He has once again proved why he is where he is and why he is called \"King Khan.\" Its been a year since \"Om Shanti Om\" was released and so it may be a good few months before we see another film with him. Let's mot forget \"My Name Is Khan,\" with Karan Johar.\n\nVinay Pathak is just excellent in the supporting role as the friend who supports all the way through and one who does not hesitate for one moment to tell his friend whether he is right or wrong.\n\nThe settings is beyond any doubt well done and being set in the Punjab city of Amritsar, the Golden Temple being shown every now and then gives on the real atmosphere of the area and the music by Salim Suleman does suit this very well and not to mention the songs and the dances that come along in this semi musical genre movie. The songs are also worth listening to and especially \"Tuj Mein Rab Dikhta Hai,\" by Roop Kumar Rathod and Shreya Ghoshal and \"Phir Milenge Chalte Chalte\" by Sonu Nigam.\n\nConclusion: Whoever thinks that this is a boring film, it isn't. This movie also shows what each partner has to do in order to try and make their marriage work and more so when one of them is much older. This is a movie that can be watched with your family and enjoy it."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "chandrabhanusolanki",
        "review_rating": "6",
        "review_title": "Another love story",
        "review_detailed_main": "This movie is another love story of Bollywood diaries with nothing new to offer. Also the movie is like if you're portraying another person and someone is liking that person, than this is bad. We are talking about same person who can act like a romeo but he is not that in real life, so be that person. Also this type of things can happen only in bollywood movies. You can enjoy the songs though and also if you love every bollywood movie."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "cowboythakur",
        "review_rating": "3",
        "review_title": "Total Rip-off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "darshana-gallage",
        "review_rating": "10",
        "review_title": "Touching one which delivers a story to be remembered forever",
        "review_detailed_main": "I am a shahruk's Fan & I always love watching a movie where I can have a glimpse of him...This movie is one of his best & I would recommend it to any one who loves bollywood..The story is very touching & we get a chance to see how Shahruk delivers two different characters in such a way that you will dare to accept the fact that in reality it's one man.\n\nThe main actress is also doing a great job in giving the life to the role as Surender's wife & the way she performs in dancing scenes also need to be well noted by those who are in the film industry....She well deserves a place in Hindi Cinema for what she has shown in RNBDJ..\n\nThe direction has been great & dying to see his next move in near future So give this movie a chance at a convenient weekend & you will not be regretted!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "7",
        "review_title": "Also the songs were beautiful...",
        "review_detailed_main": "The movie is not surprising, the ending is not surprising, of course, but it goes on with a sweet atmosphere. Falling in love with Shahrukh like this suits him well, and everything is even more pleasant when Anushka comes across him. Even though we knew the ending, I couldn't stop watching the movie. Shahruk Khan and Anushka were amazing.....Also the songs were beautiful..."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "arsh7777777",
        "review_rating": "8",
        "review_title": "An Extraordinary Love Story",
        "review_detailed_main": "This movie is, for me, the best movie of the year. I LOVED IT! It makes you laugh, cry and makes almost all of your other emotions come out within the movie. Here are my ratings.\n\nPerformance/Acting: Shahrukh Khan : 10/10; Anushka Sharma : 10/10; Vinay Pathak : 10/10; Direction : 9.5/10; Production : 10/10; Everything else : 9.5/10 (The script took the marks down a little) OVERALL : 9.8/10\n\nSynoposis: This movie is about a simple man named Surinder Sahni or Suri, who is played by Shahrukh Khan. At the start, him and his \"LOVE\" Taani (Anushka Sharma) get married. Actually, Taani, at first, is scheduled to marry someone else, who is not shown at all in the movie. Taani's \"future\" husband dies in an accident on the way and Taani's father gets a heart attack after that. He asks Taani to marry Suri. They both agree. Taani says to Suri that she'll be his wife, but will never \"love\" him. :( She then finds a poster about a dance competition and she wants to participate. Although Suri is a simple guy, he agrees.\n\nSuri goes to Bobby Khosla (Vinay Pathak) and Bobby does a complete makeover of Suri and turns him into a cool, bad boy Raj. Raj and Taani first meet at the Dacing Jodi Competition (Raj is Taani's partner). At first Taani thinks that Raj is an awful guy, but she later changes her mind. Suri now wants to know if she loves Suri or Raj. He keeps on disguising as Raj.\n\nJust about at the end, Taani asks Raj to run away with her. At her last day (competition day), Suri and Taani go to the Golden Temple. She asks god for one thing. That is to see god in a person and turns out that it's Suri. She decides not to run away with Raj. Raj doesn't show up at the competition, but Suri does. Suri and Taani get 2 free tickets to Japan and spend their honey-moon there. HAPPY HAPPY HAPPY! :) Bye"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "amitptilekar",
        "review_rating": "9",
        "review_title": "Feel it...You will Love it.",
        "review_detailed_main": "When I got out of the movie hall I noticed one thing which is in my view is not regular sight. What I saw was many middle aged couples were smiling and holding hands tightly. One could sense the positive vibes they are carrying out of the movie hall.\n\nThe movie is not DDLJ but is very simple very logical and very heartening. The story is of these two completely different personalities. One who just understood what love is and another is trying to run away from it. There is every possibility that this has happened in many Indian homes if not this much dramatic but somewhat on similar lines.\n\nThe Characters are so believable and uncomplicated that you within seconds start relate to them. There is one Suri in each Indian middle aged male who wants to be Raj for his wife, Raj who is dashing, funny, and stylish. And which is not wrong. Suri tries to be filmi hero for Taani but eventually realizes that its not ones looks or talks but its the purity of ones heart which matters. Suri is simple may be you can call him little boring but by no means a pathetic a**, with whom you should show some sympathy. When the movie starts you will laugh at his acts or looks but eventually you will be clapping for him. Taani is any Indian girl you will find in every other house in India. She is daring and wants to move ahead in life but she still believes in constitution of marriage and Indian culture. SRK is at very best as Surinder Sahani. He has again showed how brilliantly he understands the script and overall plot of the film. Behind those spectacles the eyes speaks a lot in this movie which also add to this charm. He portrays Suri which such a conviction and ease that after few scenes you stop referring him as ShahRukh. As Raj he don't have much to do \u0096 he has done this in the past. Anushka is fresh and faces camera with confidence. In many scenes she has given very strong support to SRK.\n\nI will say go and watch this movie which somewhere is reflection of our life. And don't get up from chairs until the credits are over, I bet you wont stop blushing."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "anan53",
        "review_rating": "2",
        "review_title": "Jodi no 1",
        "review_detailed_main": "I happened to see this movie after 2years of release.The Story is well known to Indian audience and next scene is easily predictable as we are used to it.The Hero and Heroine are really talented but due to week story their efforts are in vain.We have seen in TV comedy serials that the Hero(comedian) used to play duel role just by replacing a sticker as mole in his cheek,for laughter. But i am surprised that how the director was bold enough to venture in to such idea of creating 2 characters using mustache as a tool just like Golmaal. kind of Movie should have been released in 80's.Hero and Heroine are dominating through out the movie.Other characters are not given any chance to play."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sinncross",
        "review_rating": "8",
        "review_title": "Delightful tale on love...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "3",
        "review_title": "Bad movie from SRK -YASH CHOPRA combination again.",
        "review_detailed_main": "To be honest, even if you are willing to buy into that bizarre premise - that Taani fails to recognize her own husband because he's shaved his moustache, lost the spectacles and picked a funky hairstyle - Rab Ne Bana Di Jodi is still an exhausting watch because it's such a predictable story, because it recycles the same old clichés, and because the characters are so poorly developed. Going back to the oldest trick in the book to solve all his screenplay problems, director Aditya Chopra drags in Rab, or God to solve the film's decidedly uncomfortable conflict of whether Taani should run away with her lover, who's actually her husband-in-disguise; or whether she should stay with her husband? You see, the message this film delivers repeatedly is that you know it's real love when you see Rab or God in another human being. When it's not peddling God and its theories on love, Rab Ne Bana Di Jodi is really an antiquated love story that is regressive, chauvinistic and plain stupid in parts. Which is sad if you think about it, because stripped down to its basics there is clearly a sensitive idea there - about facing one's insecurities, and about coming to terms with the fact that it's okay to be yourself. Aditya Chopra's return to direction after eight years is marked by a flawed script, which in turn spawns a disappointing film. Where's the smart dialogue and the spirited characters that defined his debut film, Dilwale Dulhania Le Jayenge? There's no trace of either in this film. The problem then, at the root of Rab Ne Bana Di Jodi, is that much like those artificial sets in the film, the emotions too are contrived.If you must, watch it for Suri(SRK); he's the only honest thing about this film."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "syedsafwaan",
        "review_rating": "10",
        "review_title": "My All Time Fav Movie... Dani Partnerrrrrr",
        "review_detailed_main": "Very good emotional movie. i remember i was at 10th standard studying in boarding school but yet always managed to come out and watch this movie in theater almost 9 times and in television and in laptop many more times... i just love this move to the core...very emotional music attachment and debut actress i loved her acting and became fan of her and lastly i want to watch again and again"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sksalmanism",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "samantha904",
        "review_rating": "9",
        "review_title": "A new Bride, her shy Husband, and his outrageous alter-ego.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "abhishek-banginwar",
        "review_rating": "4",
        "review_title": "My verdict, 3.5-4 / 10",
        "review_detailed_main": "I was very much looking forward for this movie. The only reason was this type of love story was not covered before. The movie starts off with some good scenes, but as and when movie proceeds, it fails to grip. The role of Raj was a very lengthy and sometimes it got very bored towards the ending. Also I was a bit irritated that everyone was 'ji' to everyone. It was fun for a while but then it was a bit too much. Though the ending was expected, it was kind of boring.\n\nAll in all one time watch for SRK fans and for other, its OK if you miss it. No big deal.\n\nOh ya, two songs are good to hear.\n\nMy verdict, 3.5-4 / 10"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "devs_17",
        "review_rating": "8",
        "review_title": "Realistic, Charming, Entertaining, and Honest",
        "review_detailed_main": "Let me first say that it is not in the league of DDLJ. Having said that, there are hardly any such films.\n\nAs for the movie itself, it is a very real film. And like CDI, the trump card here is the victory of the underdog. The difference though is that the underdog as well as the front runner is played by SRK. The movie is predictable at times, but hats off to Adi for the presentation and treatment. I would spoil it by saying anything else. To sum up, you are surely gonna enjoy and appreciate the movie (if you don't go there with the purpose of nitpicking) The best part about the movie is Casting, it is spot on, and SRK's act as Surinder has to be seen to be believed. One of the most amazing performances, and right up there with his best. His other persona is the RAJ one, but this one's an ace too, as he spoofs every romantic notion, romantic movies, including his own spoof. I enjoyed it very well. the transformation of Surinder into Raj is funny and believable. It is as believable as one of us trying to imitate a star after seeing his movie. Anoushka is awesome, in fact, she really steals many scenes, and holds her own, and sometimes even betters SRK.\n\nSongs and background music is authentic and blend seamlessly with the movie. All the songs are well shot and placed in the film. Phir Milenge Chalte Chalte song is awesome, while Rab dikhta hai is truly heartwarming! Negatives: Few Scenes are cheesy, and few Over The Top.\n\nOverall, 8/10.\n\nPS: Don't miss the END CREDITS!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "manoj-aryan",
        "review_rating": "4",
        "review_title": "We want more Suri!",
        "review_detailed_main": "When credit rolls in Rab Ne Bana Di Jodi a voice-over of Surindar Singh Sahani played by Shahrukh Khan in trimmed mustache and without furrowed brows shows us his honeymoon album with disarming charm are some of the embracing moments you will witness in a movie. It captures the spirit of Surinder Sahani whom we now call Suri. He is a simple man. Bathing under tap water, having bread-butter from his toaster every day, attire entirely formal with the exception of doohickey sports shoes. He carries a laptop shoulder bag and rides iconic Bajaj scooter, works in some firm called Pujab Power (may be a government job). This man can easily go unnoticed or disappear altogether in crowd. At first he can be mistaken as a parody of common man as measures to establish him are such extremes and efforts can be damned as effusive or maudlin but there is indelible sincerity in all this manifestation.\n\nWhile promoting the film SRK told media his director described Rab Ne Bana Di Jodi as a love story of ordinary man. His director is not ordinary let me unnecessarily remind you. Aditya Chopra is in our top filmmakers gave two timeless classics DDLJ and Mohobbattein. Indeed I will take his word and expect something magical again. My expectations were not unreasonable.\n\nSuri's eyes catches Taani (debutante enchanting Anushka Sharma, boy! she can dance) while sipping some Mazza or Slice with straw. He tells us shyly it was love-at-first-sight. In hurriedly quick cutting scenes they get married as a result of a mishap. Girl has just lost her father. On the night of wedding he collects all his belongings in a box and moves out to store-room on terrace. Camera swiftly moves up from terrace room to down on both. There is a beautifully poignant scene where she confesses that she will surely be a devoted wife but can't love him ever. He tells her he didn't know what love really is and didn't know any \"ladies\" until her. Now our hero wants to win her heart. This is so far and, start of a beautiful love story, right? But no, spell is broken by entry of Suri's alter ego -Raj.\n\nSuri gets into new avatar of Raj with the help of his buddy Bobby (Vinay Pathak) who runs a saloon (they share some cracking moments). Raj is clean shaved, no mustache, spiked-hair and goggles. Why do this? He wants to be hero to the girl of his dreams. She doesn't recognize him at all. Ironically he is parody of Bollywood pop culture buffs. He bluffs \"style\", \"attitude\", paints himself in all possible colors, try to appear flamboyant, quote endlessly sometimes famous often corny songs-dialogues from n number of movies and act funny (not in a charming way). He annoys her (and audience) with his ceaseless flirting and clowning. She doesn't recognize him and they end up as dance partners in a competition.\n\nFilm crumbles from entry of the second character and grows in absurdity to sheer disappoint until it bounces back in its near damn good climax in flash-dance-glory. It does intermittently come to life, throws some dilemmas and asks difficult questions. What if girl falls for the second guy? She is a chaste girl, a loyal wife. Yes, writer-director's exalted faith in pure love that runs through his previous works is still here but his protagonist is lost amid filmy treatment and director's ambiguous approach. I wish this would have been the ultimate love story our bespectacled Clark Kent but no. Damn it Suri, we wanted you more!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "hmobeen2000",
        "review_rating": "10",
        "review_title": "Simply fabulous.....",
        "review_detailed_main": "The Movie \"Rab ne Bana di Jodi\" is a treat to watch... Sharukh Khan has done his magic and has proved once again that he is the only king in bollywood who can do extraordinary magic with dull and ordinary characters...\n\nThe movie revolves around Surinder Sahni (Sharukh Khan), a government servant who is having a 9-5 life alone in Amritsar and has got only one friend Bobby (Vinay Pathak)... Surindar marries a beautiful younger girl Taani(Anushka Sharma) by chance... and then their odd love story starts... He wants to impress her, tries to show his love to her but Taani who still has not recovered from the deaths of her father and fiancé.. keeps herself to her room only and doesn't talk much to her husband.. the ordinary man Surinder...\n\nThen the story takes a turn when Taani joins a dancing class and in search of a dancing partner.. Here idea comes to Surinder mind to impress her... He disguises himself into a young clean shaved handsome dude Raj.. but his wife doesn't recognize him so he now befriends with his wife through his new identity and flirts with her...\n\nThe love triangle between Surinder, Taani and Raj is the rest of story.. and who does Taani choose in the end as her true lover...\n\nSharukh has produced a magical performance in this role..... Sharukh looked like a common man when he played Surinder and looked younger and smart when he played Raj.. The contrast in the personality was clearly visible... and looked so good on screen.. Anushka Sharma is hot and a welcome entry into Bollywood.. She never looked like a newcomer in whole movie.. She has been auditioned for this role with other girls so that proves her ability as a brilliant and beautiful addition in Indian cinema..\n\nVinay Pathak who plays role of Sharukh's modern and fashionable friend (compared to Sharukh's character) did very well in this role.. This is his first big budget movie I guess and was so fun watching his scenes with Sharukh Khan especially the \"Macho\" scene where he lectures Sharukh about manhood...\n\nSo overall, This film was really wonderful and good entertaining material overall... 10/10.."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "davez_86",
        "review_rating": "10",
        "review_title": "Super good and super fantastic",
        "review_detailed_main": "This movie rocks. SRK and Anushka did really good in their acting. Bobby rocks. This movie is one of SRKs best movie ever. Nice nice nice nice nice nice nice nice nice nice nice superb superb superb superb superb superb superb. Every 1 go watch this show u all wont regret it one bit. Anushka is so pretty i think every 1 will fall in love with her huhuh. SRK is as charming as ever and he never failed to make the audience laugh and smile. Quite emotional also but really super good. Go watch it go watch it go watch it. Don't listen to people who critsize this move. Go watch it for yourselves and be your own judges. 10 out of 10. This movie made my day."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "uddalak-banerjee",
        "review_rating": "10",
        "review_title": "Rab Ne Bana Di Jodi (2008)i is far better than Om Shanti Om",
        "review_detailed_main": "Rab Ne Bana Di Jodi (2008) is way better than Om Shanti Om and again proves that Bollywood king Srk can even at his age produce blockbuster romantic hits which can sweep people from all ages ...\n\nthe movie speaks of a sincere attempt of a middle aged man to win over his younger bride through a complete make over of personality .. not only is this plot brilliant and engrossing as usual Shahrukh khan rocks with his deft handling of the character of middle aged man. The film also stands out in the fact that subtle romance is brought out brilliantly without having to use any erotic scenes which most other contemporary films use in abundance..\n\nLastly, I think Anushka Sharma too has played a brilliant stellar role in the film creating a lasting impression in the hearts and minds of the people who I suppose will enjoy it to the fullest and welcome into their hearts the image of this upcoming heroine.\n\nThe scene in which Shahrukh khan uses his Punjab power connections to light up \"I love you\" is really charming and leaves a new mark on the hearts and minds of the audience which will certainly stay on for ever.."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "timesquare66",
        "review_rating": "4",
        "review_title": "srk overacting !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sant2050",
        "review_rating": "8",
        "review_title": "Rab Ne Bana Di Jodi - An intense emotional drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "santo_banerjee",
        "review_rating": "4",
        "review_title": "disappointing! waste of time.",
        "review_detailed_main": "I have watched the movie on first day not just for SRK,also for the director Aditya Chopra. The other two films directed by him was excellent and made a mile stone in Indian film industry. After watching the movie 'Rab Ne Bana Di Jodi' it seems to me that it was made by some other person,not him. The film is based on a absurd story line. SRK has nothing to do with the same poor script. The song with so many popular Bollywood faces is now becoming common and boring. Its difficult to believe that people can make this kind of film in 2008. The movie in all aspect is a eye torture. Only Anushka Sharma is a little bit of breeze in this (bad)film."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "puneet-bhatia-in",
        "review_rating": "8",
        "review_title": "Adi Ne Bana Di Jodi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "justbetweenus16",
        "review_rating": "8",
        "review_title": "Movie Leaves Impression like DDLJ and Veer- Zaara",
        "review_detailed_main": "Its a Different Movie...cause all believers think yashraj makes same movies.. but thats wrong.. Its a beautiful movie.. Must watch film... :) All shahrukh khan Lovers go and see this film...Must watch..\n\nIts a Movie for all different kinds of generations.. and everyone will enjoy this movie..\n\nIts funny,romantic and emotional.what else does a director need to make a film successful..\n\nYou can relate to every character in the film.. Trust me...\n\nDefinitely go and watch this film..........Three Thumbs up !!!\n\nYashraj Rocks Again.. !!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Lobo2009",
        "review_rating": "8",
        "review_title": "Highly entertaining - Good performance from SRK.",
        "review_detailed_main": "The romantic comedy is a genre that Bollywood do very well. And this is another good example.\n\nThe film has a good, heart felt story. You really feel and can connect with SRK's character. The comedy is equally great. Laugh out loud funny at times. Anushka does a good job. But the plaudits need to go to SRK who puts in an excellent, if sometimes slightly over the top performance. Although his Raj character may be a bit typical, he plays Sri very well and his comic timing is spot on. The only slight negatives I have are, for me personally, disappointing songs. I also\n\nVery entertaining and highly recommended. Go see it."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sunny-jain",
        "review_rating": "5",
        "review_title": "RNBDJ : Awful movie",
        "review_detailed_main": "i found this movie just an average movie, actually i went to see the movie so that i can see the SRK acting, as he is a great actor..! but i did not find any romantic dialog's, any emotion in it. just a plain movie and a little over hyped...! SRK clothes were so cheap..that can make u laugh obliviously...u will laugh during the movie but it will be the situation which makes u not the dialog's( all are 1980's joke).. SRK was good in Surinder Shani role but was worst at Raj. The gal did pretty well...Very good performance. Bobby was excellent..! i was really disappointed by SRK in this movie..! but one time anyone can see this movie..!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "divyamaansrivastava",
        "review_rating": "8",
        "review_title": "Good show",
        "review_detailed_main": "This is a story of a middle class couple who had an arranged match.The storyline tried to experiment with the fact that, love is above looks and style. The girl falls in love with the same person twice in the movie. It was a very difficult storyline to carry off, but a perfect novel stuff. A new concept like DDLJ. Such movies/stories are generally understood only after a period of time. The only spoiler which I could find was the 'masala' component added. Like the actress shows here MI2 stunts on the middle of the street. All n all the movie had a tight storyline and keeps one guessing as what would be the climax, but in the end it was the Aditya Chopra genius. Good show !!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "srkmish",
        "review_rating": "5",
        "review_title": "A bastion of perplexity and boredom",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Dhoni7575",
        "review_rating": "10",
        "review_title": "\"Rab Ne Bana Di \" is a message for all the Aamir khan fans from SRK",
        "review_detailed_main": "A very great movie which is compared to DDLJ but why i don't know every movie cannot be that great but that does not mean that this movie is bad. It's a heart touching,comedy. Go and watch it if u haven't because if u don't then u will be missing a great movie. That aside, Rab Ne is a film which will make you feel good and happy and Shahrukh absolutely deserves credit for this. His performance as Mr.Surinder is an absolute delight to watch and the mannerisms will leave you in splits of laughter. And then, the performance as Raj is the icing on the cake.I wont say anything more about this as it will spoil the experience for you.\n\nShahrukh Khan, take a bow.This is amongst your best performances to date.\n\nThe new face of the film, Anushka deserves special mention for the way she acted and carried off the role of Taani. There is innocence,charm,a certain vulnerability and tenderness in the character but at the same time she can be quite a force to reckon with if provoked. And Anushka lived in the role. For a debutant, its amazing.\n\nVinay Pathak as usual was his excellent self as the best friend of Shahrukh and their moments on screen are truly rib tickling.\n\n'Haule Haule' song is very good and so is the background score. It adds weight to the film and to the comedy. All the other songs are pretty decent.\n\nThe way the city of Amritsar was shown is also very nice and the rich production values of Yashraj films is clearly visible in each and every frame.\n\nAnd finally, for the director. Welcome back Mr. Aditya. We missed you and we hope that you make movies a little more often than you do."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rahel-kidane",
        "review_rating": "9",
        "review_title": "Commentary",
        "review_detailed_main": "Rab Ne Bana Di Jodi (Match Made By God), 167 min 2008, Yash Raj Films\n\nIf you enjoyed Sharon Maguire's, \"Bridget Jones Diary\", you will love this Hindi movie. With less melodrama and fantasy that Bollywood is known to offer, this film gives the allegiance to blind faith in the true self. The story is so charming with its mixture of insouciance, wit and candor that it's enough to restore a belief in fairy tale endings to the most embittered casualty of modern life–urban marriage. This film is full of wisdom and hope especially for at Generation X buckled up to ride on the fast lane of urban dating.\n\nDon't expect Suri to be Casanova, however. Rather, his seduction process is pure, unblemished and almost spiritual. I have to admit, to bring this rather interesting, meek character to life must have been a challenge for director Aditya Chopra. Who could have imagined that Shahrukh Khan would be so perfect? Adopting an impeccable look of a geek who can't seem to \"lit up his own life\" let alone his energetic wife's, he plays the role of Suri with so much sensitivity and dignity, and you fall in love with Suri. Shahrukh brings integrity with childlike stubbornness, innocence, and tenderness melting your heart like ice cream in a New York Summer. Shahrukh's double role of Raj is impeccable making Suri enter into Taani's life in the guise of Raj—the skintight shirt, ripped jeans, spiked hair with ample of tackiness and brassiness — to win Taani's affection. Aditya accomplishes a miracle of making Suri entirely endearing, utterly real and acceptable while the aloof, slick and hypnotizing Raj becomes attractive even alluring to a woman with broken dreams. Sharukh's performance of Suri is deeply sentimental and natural one barely senses the work that must have gone into it. Throughout the film you ardently root for Suri to succeed and pray that the two will end together. This film is a delight to watch giving a whole new meaning to Billy Joel's song, \"I love you just the way you are\", although I would have suggested a film title to be \"Against All Odds\". If you want a more spiritual title, Match Made in Heaven definitely works.\n\nWhat makes this film more relevant to Generation X is that we can all relate to Taani. How many dates have we been without seeing an end in sight? How many of us have lost the faith in loving, completely disenchanted with this entire concept of love? Taani summarized well, \"I can't see love in anyone\", she says. It is not that love does not exist, but we are so caught up at the moment, we no longer recognize it. Read more on Isisbollywood at wordpress.com\n\nRHK, Isisbollywood.wordpress.com"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "threenorns-1",
        "review_rating": "8",
        "review_title": "only one serious hole in the logic kinda spoiled it a bit",
        "review_detailed_main": "cause it's a HUGE hole: amritsar is the heart of punjab. NO - repeat NO - married woman is going to be cruising about town on the back of a bike and spending the day and going out to dinner with a single man who is not related to her! they would have done better to locate the movie in mumbai - slightly more cosmopolitan - or even out of India altogether. New York, perhaps, or even London, England. heck, London, Ontario would've been a better choice.\n\naside from the plot hole big enough to drive an Ice Road truck through, the movie is wonderful - tender and sweet.\n\nSRK does a lovely job of portraying a quiet, mild man driven to extremes by panic when his lovely wife tells him she must \"kill the old taani\" and become a new one in order to be his dutiful wife. he's a nerd - he knows he's a nerd - but he wants her to remain the carefree, vivacious, outspoken girl she was the day he fell in love with her, hence the creation of his alter-ego, \"raj\", a \"cool\", \"macho\" \"dude\" (who really isn't - *wince*).\n\nanushka sharma does a great job (esp for a debut!) but she's a bit \"jennifer aniston\" to me - there were times when i'm guessing she was supposed to look thoughtful or pensive but came across as calculating. but hey - who am i to judge?"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Queen_of_pentacles",
        "review_rating": "5",
        "review_title": "Absurd Ban Gayi Jodi !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "aameen_manunited",
        "review_rating": "10",
        "review_title": "Srk the best!!!!!!!!!!!!!!!!!!!!!!!!",
        "review_detailed_main": "A GREAT MOVIE WHICH ALL SRK FANS SHOULD WATCH.TThe story is about an 'odd' couple played by Shahrukh Khan and Anushka Sharma who find true love in the backdrop of a dance competition called \"Dancing Jodi\". Surinder Sahni (Shahrukh Khan), a man working for Punjab Power, who falls in love with Taani (Anushka Sharma) the flamboyant, fun-loving, vivacious girl for whom the whole world is her canvas and she paints her own life with the colours of rainbow all until unforeseen circumstances changes it all and brings them together. They get married and lead a not-so happy life due to huge age difference between Surinder and Taani. Taani, meanwhile, wants to participate in a reality dance show called \"Dancing Jodi,\" which is the main backdrop of the movie. The dance contest showcases couples of all races, colours, backgrounds and sexual preferences. Taani wants to take part for the show, but she is not able to due to her husband's lack of fashion statement. Later on when Surinder finds out about his wife's wish to participate in the reality dance show, he undergoes a major change.All i want to say is go watch this movie\n\nTaani keeps falling in love with her changed husband"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "ssvikas",
        "review_rating": "5",
        "review_title": "A potential blockbuster concept spoilt by a half-baked screenplay!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "polisovil",
        "review_rating": "8",
        "review_title": "Coming back to direction, Aditya Chopra has done a fair job",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "class_mass",
        "review_rating": "9",
        "review_title": "inner goodness is more important than outer look of a person.",
        "review_detailed_main": "There are many films those have been made using love triangle in a different way and this formula is considered as a hit Bollywood formula. This film also falls in the same category but here it seems that it is very different and very special film as it touches your heart. It is based on very different love triangle where the same person plays two characters. It is thought provoking and very appropriate in today's times. It is successful in conveying its messages to the target audience with good entertainment by a typical Bollywood hit formula. It creates much interest in viewer's mind from the very first scene and continuous until it ends.\n\nIt is happen to be marrying a simple common man by a young beautiful girl because of situation but girl vows not to love this common man even after marriage but in contrast common man loves her very much from the day when he first seen her. Here common man goes for makeover with the help of a friend and tries to make his wife to love him by becoming and playing character of changed modern man and by meeting her regularly in different scenario. Simultaneously he also lives his life of common man with his wife. So here the story revolves around these three characters as simple common man, his wife and changed modern man. Initially he feels good but later on he found it to be wrong. Here this common man many times feels to be quit from this game of look change and think to tell true to his wife but somehow he thought to continue with it as he wanted to see whether with whom finally his wife prefer to live with. This thing creates very much interest in viewer's mind and whole episode is very good to see here. It is very interesting to see how this changed modern man lose this game to simple common man and how the later is simply winning his wife's heart away with his simplicity and inner goodness.\n\nI feel it is better film than other films of the director Aditya Chopra and believe that it will be considered among the good works of Shahrukh Khan though I personally feel that it is second heart warming film of Shahrukh Khan after Swades."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "satishd",
        "review_rating": "8",
        "review_title": "Nothing Special.. Yet Extraordinary !",
        "review_detailed_main": "You might read the Story somewhere elsewhere..\n\nHere i'd say about the Movie. It is simple story of everything.\n\nWhatever people say about it .. I'd suggest you watch the Movie once for yourself and then Decide. Many people are reviewing this Movie due to sole reason of them doing the biased reviews coz they are fans of some other actor.\n\nHere's some notes: Really a very good movie. Friends used to comment on SRK as a crybaby in movie or not a good actor or even an over-actor..but here.. he has shutted their mouths.. SRK really spun the character of Suri on fingertips.. Really Must watch Movie. I'd say 5/5 for movie. But not to sound too much good in craze i'd say 4.2 / 5\n\nLiked the scenes 1) That Rose seen where he puts the rose on note and then removes it again. 2) That Gol Gappe scene.. and the Biryani. 3) That Macho Thing of Raj 4) That scene where he takes the \"Dabba\" ie tiffin box and dances and background music plays \"Haule Haule\"..really enjoyed that seen\n\n*Simple Movie of a Simple Man* *People Do not keep your expectations high would love this Movie and it will really overwhelm their Expectations*\n\nPS: +point.. Not a single Adult joke. No Fighting . No Full Romance . No Full Comedy. No Full Drama . Yet it make you feel really elevated :)"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "Reality works fantasy sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "vaibhav_bhandeo",
        "review_rating": "8",
        "review_title": "Rab Ne Bana Di Jodi --Review",
        "review_detailed_main": "Identity crisis, this is what happened throughout the movie where the most unconventional aspect was how a wife can't identify her husband being in his vicinity all the time?\n\nApart from this flaw the movie seems to create some magic though is far away from the era created by DDLJ. The story traverse around a mid-aged gentleman Surinder Sahni and his subtle lifestyle which portrays any common man in the country. The movie is themed to show his quest to conquer his spouse's heart with his simple yet sober living style which he finally achieves with keeping his values and dignity intact, the end of movie definitely going to remind the melodramatic end of Dil To Pagal Hai's. What movie lacks is the strong projection and theme based character, apart from Surinder Sahni none will remain on top of your mind once you leave the theater.\n\nShahrukh undoubtedly works the way to top by his portrayal of character Surinder Sahni. He looks so genuine and real as the character that one wouldn't give a second thought but by putting himself in his shoes, very realistic. What kills the movie's class is his second role as Raj, he must understand now that such flamboyant roles are not characteristic to his age and image now and he should avoid clinching such roles. Apart from this he steals the screen anytime as soft spoken Surinder. New girl in the block Anushka Sharma plays a good part. She looks good, matured and shares the screen with Shahrukh with ease. She never looked as a new bee in the movie and played her role convincingly. She is definitely going to get some big projects after this one. She has elan, grace and perfect weapons in her arsenal to cruise the way into audience heart, way to go girl.\n\nEntire movie is shot in Amritsar, a contrast from any Yash Raj camp movie which are mandate to shoot in Switzerland, if not all then at least a song. Surely now they are realizing that it's not the location but the theme and performance that matter more to make a movie success. Music of the movie definitely is melodious, all the songs are well timed and helps to move the movie ahead, not just simple fillers. The track \"Dance pe chance mar le\" would definitely let you make some moves when you listen and see it on screen. The important point where movie lacks is the element of surprise within it,the storyline also is not new. Viewers are always aware of what would be next which drops the level of excitement a viewer should have while watching the movie. The role of Raj is not at all convincing and it's more an irritating one than anything else, a role which should have been thought in better way. It's only the individual performance that lifts the movie from falling in the category of an average movie.\n\nIn a nutshell if you are an SRK fan then it's a must watch for his role of Surinder Sahni, if you like good family oriented musical then this can be a good watch for a family. All in all I recommend this movie, at least you won't be disappointed after leaving the theater."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "qahtanaj_85",
        "review_rating": "4",
        "review_title": "come on !...... 7.0 ! seriously?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sid_yadav_1",
        "review_rating": "10",
        "review_title": "A Extraordinary Movie Disguised as Something Ordinary",
        "review_detailed_main": "Let me just qualify my review by saying the following: I am a Shahrukh Khan Fan. I did not like KANK and Om Shanti Om. I loved Swades, Don, and Chak De! India.\n\nNow, for the review. I know most reviews have talked about the story, the cast, the director, etc., and you've probably gotten tired of reading and hearing about it, so I'm going to cut directly to the chase.\n\nThe movie is simple, sweet, and safe. It has a charm. It's the same charm which was last seen in Kal Ho Naa Ho, and before that K3G, Mohabattein, KKHH, Dil To Pagal Hai, and DDLJ (the Chopra/Johar/SRK classics). You feel the same emotions you did while watching those: you laugh, you cry, and most of all, you enjoy. You hear the same kind of emotional background music, the same kind of dialogs, and you see the same kind of picturized scenes. And that's what makes it so good -- that feeling you experienced 15 years earlier is back. So if you didn't like any of those I mention above, forget liking RNBDJ. If you loved them, you'll like RNBDJ if you ignore and close your mind to the biased reviews.\n\nShahrukh Khan is as good as he can get, and I don't know what to say apart from that. His performance is on par with that of all his other classics, and far far better than his non-classics such as Om Shanti Om and KANK. Surindhar Sani is just plain believable -- he is me, or the guy next door. Anoushka Sharma is brilliantly cast. Apart from being a great debut for her, she really fits the role of Taani. If Taani was played by an established actress such as Kajol or Rani or Preity, I don't think it would've worked as well. She's the simple Delhi/Punjabi girl, and complements Shahrukh's performance as the simple Delhi/Punjabi guy. Their pair just works. The other great (and only other?) performance is Vinay Pathak, who really shines just like the two main leads.\n\nThe story is fulfilling to say the least. Sure, it has its gaps and some might argue how believable it really is, to which I can't help by responding: IT'S A MOVIE. Have you seen DDLJ lately? Or KKHH? Or any movie which is considered a classic? They all have ridiculously unrealistic plot lines! If you don't believe me, get out that old VCD and give it a watch. No, I don't think the Rahul from KKHH would have had an affair with his college girlfriend after his wife's death, or the Raj Aryan of Mohabattein after-death sightings of Aishwarya Rai. If the \"unrealistic plot\" is the only reason you're not going to like this movie, I think it's fair to conclude that you don't like Bollywood movies, or even movies as whole. (I have to wonder about these people, how do they manage watching any sci-fi movie in the world?)\n\nNow for the music, I'll willingly admit: I wasn't a fan the first time I heard it. In fact, I was sorely disappointed. Apart from Haule Haule, none of the tracks appealed to me, and 'Dance Pe Chance' just seemed old and lame. But over the last couple of weeks, they've really grown on me, and after watching the movie, I'll go as far as saying that I've become a fan. 'Tujh Me Rab Dikhta Hai' is a masterpiece. 'Phir Milenge Chalte Chalte' is well-pictured (except for Preity Zinta's appearance. What went wrong there?!). 'Haule Haule' is excellent. 'Dance Pe Chance' fits well with the plot and Raj's character. Sure, it's no DDLJ or KKHH in this matter, but it's damn good and fitting.\n\nIn all, if you've watched it and liked the movie, I think you'll agree with me, and if you haven't watched it yet, I hope you'll agree once you see it: RNBDJ is an otherwise-classic overshadowed by the recent events in Mumbai and (rumors say) Yash Raj's unwillingness to pay \"top critics\" for a 5-star review, which is why people like Taran Adarsh and Rajeev Masand, who have been known to 5-star 'classics' such as Karzzz and Om Shanti Om, and 1-star (real) classics such as Swades, Don, and Chak De!, have given an otherwise-extraordinary movie an ordinary rating. If there is one thing you can take away from this review, it's this: DON'T BELIEVE THEM. Watch it with your family or loved one. Once again be overwhelmed the nostalgia of the other Chopra/SRK flicks. Laugh. Cry. Have fun. AND MOST IMPORTANTLY, DON'T MISS THE END CREDITS!!!!!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "tambe",
        "review_rating": "9",
        "review_title": "Indeed a wonderful jodi",
        "review_detailed_main": "This movie is the best movie I have seen. Suri and Taaniji acted wonderfully. But I guess that a few parts could be cut out which would\n\nmake the movie fast going. Example, when Suri talks to the mannequin-it was for too long a time. And the song 'Hum hai rahi pyar ke...'seemed as a filler and could have been left out.\n\nInspite of Anushka being a new actress, she acted very well. Shah Rukh Khan's acting as Raj Kapoor and Suri was convincing, they really appeared as two different people.\n\nI like the concept/story of the movie. But the Director made Taani kind of foolish because when Raj wrote 'I love you', she should have guessed that this could have been a handi-work of Suri as he works in Punjab Power. The best part which I liked was the 'Honeymoon' pictures at the end, they were really cute. The movie gave a taste of comedy, romance and drama. Its a beautiful movie don't miss it!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "komalarmaan",
        "review_rating": "10",
        "review_title": "SRK-Adi-YRF Magic Worked Again Biggg Time !!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kavi8265",
        "review_rating": "1",
        "review_title": "Worst Movie Of Indian cinema",
        "review_detailed_main": "I thought that this is the Worst Movie Of Indian cinema. this movie was nothing special but tolerable until the stupid ending just ruined it completely. how it is possible that a person cannot identify his/her life partner in some different look. in India life partner is soul for other one and in this movie actress didn't identify her husband !!!!! how is it possible ?? before this movie i was big fan of lead actor but after watching this movie i have not seen any movie of khan.\n\nby the way in this movie director/writer rape the human philosophy. Last thing \"the real king never say himself as KING!! it is a universal truth..not my words"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Dark_Lord_Mark",
        "review_rating": "10",
        "review_title": "80's Fun From America, in Modern Indian Movies",
        "review_detailed_main": "In America I am suffering. A lot of movies have lost that fun movie feeling. Rab Ne Bana Di Jodi is what movies used to be like in America. Fun, wonderful music, slightly absurd plot....and I loved it all.\n\nRNBDJ is full of wonderful characters, wonderful music, wonderful dance scenes...and the acting is very nice.\n\nThe dual characters by SRK shows why he is one of the best actors in the world. If you are an American, this is a must watch as it has a nice 80's feel with a slight Indian twist.\n\nGive it a shot, do NOT be a snob.\n\nTen out of Ten."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "Rehan7",
        "review_rating": "1",
        "review_title": "I'd rather watch myself in the mirror for 2 and a half hours",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shadow_dmx",
        "review_rating": "10",
        "review_title": "99% of the World Can Relate to This Movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rushiraj009",
        "review_rating": "10",
        "review_title": "My Life's Best movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "beautiful_like_roses1",
        "review_rating": "10",
        "review_title": "Best Shah Rukh Khan film since Veer-Zaara",
        "review_detailed_main": "Shah Rukh Khan's films in the past 4 years were below average compared to the films that made him a superstar. Rab Ne Bana Di Jodi brings back the SRK we all love and adore. He captures you with his sweet natured character, Suri. He makes you laugh as the \"cool\" Raj. Aditya Chopra and Shah Rukh Khan return to sweep the audience up in a beautiful, romantic film that truly tells the story of how there's a incredible love story in every jodi! Shah Rukh Khan plays a simple man named Suri. He lives a very boring life and works at a Punjab power company. One day he meets the beautiful Tanni and they get married under unusual circumstances. One day, when Tanni decides to enter a dance competition, Suri decides to join in the competition so that Tanni will realize that he loves and sees God in her. The story was beautiful and the newcomer girl has a great screen presence. very good acting and catchy songs! must watch film!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kathuria_nidhi",
        "review_rating": "8",
        "review_title": "Hadippa...Three Cheers!!!",
        "review_detailed_main": "Rab Ne Bana Di Jodi is a sweet love story that sweeps you away with its earnest emotions and imperfect characters that vouch of their virtues and vices just like you and me. The plot may be something you would be if not hugely, yet slightly skeptical about, but it works because of these very characters who breathe the same air, eat the same food, and dream a little dream just like you and me. The hero is an 'aam aadmi' who could be your neighbor, someone you see everyday on train or bus on your way to work. He wears sports shoes with dull color shirts and timeworn pleated pants; he is a man with ordinary looks almost like sarkari babus, shopkeepers or sales men from old Delhi or here more specifically, Amritsar. He is a man of mediocre stature and boasts of only unambitious common-man material needs. He is no 'Rahul' that thanks to recent breed of cinema is symbolic of rich chocolate boy image. But Surinder Sahni a.k.a. Shahrukh Khan can't resist the temptation to be 'Raj' 'naam toh suna hoga', again, the name and portrait he has immortalized since DDLJ. He is not Jim Carrey in The Mask who aspires to be a superhero to his alter ego. Garish in his makeover, with unsteady and unsure steps, Raj dances with his dream girl to make her laugh and fall in love. You don't see a black and white distinction between Suri and Raj and that's what transpires into a masterly screenplay and brilliant direction. There is a little Raj in Suri and vice-versa. Without fearing to give away much in this review, even though the story is largely predictable, the film exhibits an array of heartfelt scenes. There is a scene where Suri contemplates leaving a red rose with the breakfast he prepared for his wife. It's a beautiful scene that is suggestive of the protagonist's love that is throbbing to express itself. But Suri being what he is must contain his love where Raj is able to take it a leap above its counter self and voice his love from ridiculous to sublime. Another scene where a victorious Raj surprises you by crying for Suri who is slacking behind him in winning the same lady-love, gives you a tug in your heart. Music-wise 'Haule Haule' is one of the best songs to come out of Bollywood in a long time. It's earthy, colorful, with lyrics that describe the whole mood of the film. The pace of the film is tolerable, if not fast. Dialogs are not as good as Aditya Chopra's other films like DDLJ or Mohabbatein, but still they work because they are mouthed with sincerity and passion. But yes, the number of times the word 'Pyar' is used in the movie, pushes it over the borderline for high or too much sugar. May be as a promotion, the producers could have quizzed the audience on how many times the characters mouth that word! Vinay Pathak as Bobby; Suri's childhood friend is very effective. The newcomer Anushka Sharma was a brilliant choice. She is a complete natural but kudos to Aditya Chopra for sketching her character with subtlety and not making the audience suffer any melodrama by making her erratically jump into her sad past at every given opportunity. Finally, why Rab Ne\u0085will really work? One word, which is also the final word-SRK."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "krishnadaspnr",
        "review_rating": "2",
        "review_title": "RIP logic",
        "review_detailed_main": "Senseless movie. Cant digest if logic is absent. 2/10 for Anushka's beauty."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "dreaming_girl",
        "review_rating": "10",
        "review_title": "One of the best Bollywood films of all times!",
        "review_detailed_main": "This is seriously one of the best Bollywood films I have seen so far.\n\nIt's a light-hearted love story of a man who'll do anything to make his wife happy.\n\nI thought it was going to be something like superman, make a guy wear some glasses and suddenly nobody recognizes him anymore, which I think is a bit ridiculous, but I didn't get that feeling whatsoever when watching this film. Shahrukh makes the characters so vivid and believable.\n\nWhen it comes to acting, I think this is one of the best performances that I've seen from Shahrukh so far.\n\nGreat acting performances, also from the newcomer 'Anushka Sharma', wonderful songs, enjoyable dialogues, interesting and funny scenes.\n\nA must see film!"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sansalamalshani",
        "review_rating": "10",
        "review_title": "Omg wow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "mitulgajera",
        "review_rating": "10",
        "review_title": "best romantic movie ever....finest movie of yash raj films....love u srk-anushka",
        "review_detailed_main": "Rab ne bana di jodi is a wonderfull romantic family entertainer that creates magic with it's sweet romantic story , soulfull songs , sparkling chemistry between srk-anushka with funny and romantic dialouges. it has romance , comedy , dance , drama , fight scenes = full too entertainment 10 on 10 what public wants on silver screen. i love this movie and u can see it with your whole family. a neat and clean romantic saga of the year. don't miss it...a sure shot winner and blockbuster all the way...hats off to aditya chopra and whole yrf team for making such a beautifull movie. 10 / 10 stars from me"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "hamidrasul",
        "review_rating": "2",
        "review_title": "Unrealistic",
        "review_detailed_main": "This movie makes no sense. The plot is highly unrealistic and nothing seems correct. I don't know how these stupid movies get success in India.\n\nTydetijjhgfd jioknfd guij."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "mannuskyhigh",
        "review_rating": "1",
        "review_title": "Unconvincing, cliched and badly acted!",
        "review_detailed_main": "Surprised to see this one attaining 7+ ratings on IMDB which frankly it does not deserve. There are much better films than this one which needs higher ratings. Had it not been for Shahrukh Khan, the ratings must not have been that high. First things first, the film's story is not even original. It's lifted straight from a track in the YRF produced film Aaja Nachle released a year ago starring Madhuri Dixit that failed.\n\nAditya Chopra himself had written the story of Aaja Nachle and when that didn't work, he went onto make another film borrowing a similar track from the film that featured a simpleton Vinay Pathak trying to woo his ambitious wife played by Sushmita Mukherjee. The wife finds her husband boring and in order to impress her he takes part in a dance competition and surprises her and win her love. The same story has been borrowed in RNBDJ but exaggerated and stretched to date.\n\nThe film doesn't have anything new to offer because it's so darn predictable you know how it shall end from the first frame. Secondly, its unconvincing. How does Anushka falls for her husband in a blink of an eye at the gurudwara and searches for god in him. If it wasn't enough, it was hilarious to find out that the entire city knows about the dual personality of SRK but not Anushka, even though she's shown to be a smart young woman.\n\nTalking about the only few good things. SRK is superb in the nerdy role and gives his 100 percent but acts hideously as the alter ego Raj. He goes overboard in every scene, his costumes are also weird, doesn't make him look sexy or anything for a woman to fall for him. SRK is a legendary actor, he needs a great story. Anushka on the other hand, stereotyped herself in her debut film itself. And that explains why she had been doing those spunky, no-nonsense type of roles. Although she acted fine in this film and looked far more prettier than what she looks now.\n\nMusic is just about okay. The cinematography is also good. The film has been shot beautifully but the direction of Aditya Chopra disappoints. Still this one is far better than his last release 'Befikre'. All in all watch this film only if you are a die-hard SRK fan. Otherwise I don't see any reason to cheer for this film"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "GypsiB",
        "review_rating": "8",
        "review_title": "Celebrates Unselfish Love",
        "review_detailed_main": "Vivacious, beautiful Taani (Anushka Sharma) suffers a catastrophe on the eve of her wedding, and at her father's request, she marries his trusted student Suri (Shah Rukh Khan). Serious, nerdy Suri fell in love with her at first sight, but Taani tells him she'll never be able to love him, nor be happy and light-hearted again. Suri takes on the role of a fun-loving Raj in her dancing class, hoping to make her laugh again, and hoping to use Raj to help Taani fall in love with Suri. Things don't work as Suri had hoped, and he sees his chance of happiness with Taani become slim.\n\nIn this romantic drama, Khan plays an average man as Suri, and brash and loud as Raj, neither the handsome or charming character that is his usual role. This he does surprisingly well. Sharma, in her first role, was excellent, and fully believable in her emotions. While the songs and choreography were average, the cinematography, locations, and sets were lovely.\n\nI was conflicted as to the credibility of Taani's reaction to the truth, but otherwise found this to be a sweet and enjoyable film with a beautiful message, celebrating unselfish love."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "pasada-1",
        "review_rating": "8",
        "review_title": "Wes Anderson probably gets his colorful inspiration from Hindi movies like these",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "shaikhirshad-41223",
        "review_rating": "8",
        "review_title": "SRK X ADITYA CHOPRA = BLOCKBUSTER...",
        "review_detailed_main": "The amount of acting done by SRK in this film is just remarkable. Performance dual roles in one film is not an easy job but to do it with ease that's what called SHAHRUKH KHAN.\n\nAnushka Sharma's debut film but the way she also acted never feels like it's her debut film whereas regular films of hers. Simply brilliant acting by both the cast.\n\nThe next big thing about this film apart from acting is it's music. Every song hits you differently and specially the background score is very emotional and kinda connected to the story brilliantly.\n\nOne of the best direction of Aditya Chopra all I can say. A simple love story with no unique or different plot in the storyline was there but Presentation & screenplay is outstanding.\n\nYes the film dips at some moments but definitely not get distracted by it's character buildup and emotional scenes.\n\nCinematography, Dialogues and music are on point and definitely the highlight of this film.\n\nLast 15-20 mins is the best part of the film and it takes you to an emotional journey of characters at the last moment.\n\nOverall a must for watch for it's songs, storyline & best character performances..."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "haidarkanaan",
        "review_rating": "3",
        "review_title": "RIP Logic",
        "review_detailed_main": "This movie is a good reminder why I don't watch Indian movies, the logic is beyond expectation, remove your moustache, and you are a brand-new man, extrovert, outgoing, dancer, brave, sweet talker, and you can easily take a woman from her husband's hands.\n\nAdd the moustache again and you return to that shy man who can not even talk with his wife! Brilliant Idea.. The writer, director and the whole staff apparently never talked with a woman before, the reaction is faaar far away from normal reaction of a woman, the normal reaction would've been something like: Oh! So you were experimenting me? You were trying to test me to see if I will cheat, then burst in anger and leave him (out of embarrassment), and will avoid talking to the man who cheated on him ever again, but noo, she saw \"GOD\" in him .. this is beyond ignorance, and I can't understand how they think or operate... there was a scene where the couple were at cinema and they were watching an Indian action movie about something unrealistic , and they were laughing hard, apparently this is the moral of this movie, to laugh out loud on this comedy."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "oyontahmid",
        "review_rating": "9",
        "review_title": "You won't regret",
        "review_detailed_main": "This is the movie I saw in childhood. Still when I watch that, it doesn't disappoint me."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "wildlife-ptech",
        "review_rating": "5",
        "review_title": "Lengthy film with sweet first half but weak writing spoils the show",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "anishkumarjnv",
        "review_rating": "10",
        "review_title": "I JUST LOVED THIS MOVIES",
        "review_detailed_main": "I JUST LOVED THIS MOVIES.IT IS ANUSHKA SHARMA, FIRST MOVIE NO ONE SAY...JUST WATCH IT...."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rr-34611",
        "review_rating": "10",
        "review_title": "Must must must... Watch",
        "review_detailed_main": "For the simplicity of the movie .... I already 10-20times .... And I definitely cry 😭 every time 💗💗💗"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "mmhasanmunna",
        "review_rating": "10",
        "review_title": "Best romantic Bollywood movie. It's a must watch.",
        "review_detailed_main": "Best romantic Bollywood movie. It's a must watch movie. How the 2 simultaneous character rolled by Mr. Khan was amazing. While watching this movie, I thought Anuska and Shahrukh were made for each other. Off the 2 roll of Shahrukh khan, the both rolls of shahrukh as Surinder Sany and Raz surpasses one another. Anuska Swarma, a tremendous performer did her natural acting as she does in most of her movies. Starting from a slow start the story moved faster with the time. The story was a unique one. The finishing of the movie with the song Dance Jodi was also the best choice I think. I watched the 'Dilwaliya Dulhania Le Jainge' movie several times, but Rab ne Banadi Jodi catched up my mind."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "mattujagjot",
        "review_rating": "9",
        "review_title": "One of the best and last in SRK romance genre",
        "review_detailed_main": "Love this film. Best example of One Sided Undying Unconditional Love. SRK doing everything and anything to win the love of his wife, to keep her happy, fulfill her wishes.\n\nSRK's performance and Songs like Haule Haule and Tujh Mein RABB Dikhta Hai can melt anyone's heart.\n\nVery simple and sweet story. The moments when SRK shares with his friend the feelings he has for his wife, all things he wants to say to her but is unable to, I could relate to this part. When you love someone but for some reason you cannot express it to that person is probably the most painful thing.\n\nThis film is a must must watch.\n\nOne of the best and last in SRK romance genre. After this, SRK did very few romantic films like Jab Tak Hai Jaan."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "alainisturning",
        "review_rating": "8",
        "review_title": "The Carlie Brown of Bollywood",
        "review_detailed_main": "Say what you want about the story of the film. And yes, I know a missing moustache doesn't suddenly make a man unrecognisable. But fact is that Shah Rukh Khan so lovingly portrays Suri that you immediately become fond of this endearing, shy, compassionate, insecure, reserved, and helplessly romantic man. The way he looks at his wife when she laughes about a stupid movie or the way he carries the bright yellow thermos to work is unbeatable.\n\nYes, Shah Rukh Khan's acting can be over the top, especially for us Europeans. But in recent years he has over and over again managed to shine playing a diverse array of characters. The way he made me fall in love with Suri has made this film absolutely worth watching."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "gmkemon",
        "review_rating": "10",
        "review_title": "You're gonna love this movie",
        "review_detailed_main": "Illiterate great story and SRK killing it with his creative and acting."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sarthak889",
        "review_rating": "8",
        "review_title": "Average movie carried to heights by SRK",
        "review_detailed_main": "Shahrukh rules the screen both as the quiet and kind Suri and the boisterous Raj. His impeccable charm brings countless smiles to my face. Anushka is okay in acting but amazing in all the dance sequences.\n\nThe music sequences are top-notch: 1. That delicate beginning rush when you see big meaning in small acts of the person you love in the song 'Haule haule'.\n\n2. Shahrukh dancing like an amateur and Anushka dancing like a pro in 'Dance pe chance'\n\n3. The representation of the three major religions of India in 'Tujh me rab dikhta hai'. Possibly, symbolising how love transcends the boundary of religion.\n\nA delight to watch for anyone who loves musical sequences and charming love stories."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "rehanbond",
        "review_rating": "10",
        "review_title": "I like this movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "khatkarsidhant",
        "review_rating": "10",
        "review_title": "Fantasy Marriage Life of any Middle class",
        "review_detailed_main": "This film is a masterpiece , srk Anushka nailed it with acting , Everything is so so good that it take you directly to movie world where you want to have same marriage like these two , a marvelous & different type of love story"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "arpitmonga-14229",
        "review_rating": "9",
        "review_title": "A SIMPLE BUT THOUGHT PROVOKING LOVE STORY.",
        "review_detailed_main": "Its one of the feel good movies .with no big budget with a simple and funny plot with ends up in making you cry makes this movie close to your heart.no doubt it boosted Anushka's career after it.the love of Suri for Tani ji felt so pure.definately recommend it to everyone..."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "sammen-84304",
        "review_rating": "9",
        "review_title": "I am in love with this movie.",
        "review_detailed_main": "SRK and Anushka Sharma are both doing it very well in this movie. As the total nOOb I am , this was my very first Bollywoodmovie. I was stunned. Fantastic songs and dances. Now I am a BIG fan, and I luv Taani."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "paulabibire",
        "review_rating": "10",
        "review_title": "A Masterpiece!",
        "review_detailed_main": "I watched many movies in my life. This movie remains in my memory forever. It has a very deep message that really touched my soul.\n\nThe script, the acting, the music, everything is perfect. It is like poetry.\n\nBut I belive that not everyone can understand the real message the movie brings, especially the americans. Because they are so superficial, and they see things differently. I am mad at them because a perfect movie, a true masterpiece has bad reviews from people who can't understand this.\n\nSo please, just ignore the bad reviews and watch this beautiful movie with your soul. We all deserve to see this in a lifetime."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "TharsheyN",
        "review_rating": "9",
        "review_title": "See god in the one you love!",
        "review_detailed_main": "Rab Ne Bana Di Jodi is a beautiful film that will have you hooked from the first minute till the last minute of it's 2h 52m runtime.\n\nThe story is lovely, if a little bit ridiculous. It has it all though, and will keep you invested in the movie. Especially if you're a hopeless romantic like me. At some parts your heart will drop but in the end we get the ending that we all want. When it does all come together in the end, you may feel a tear or two escaping your eye and running down your cheek.\n\nThe movie will have your rooting for Surinder the whole time. He is no classic hero or bad boy. All he is, is a simple, middle income man who has fallen deeply in love with a girl. At first she doesn't see it and is attracted to Raj for the excitement and adventure that he introduces to her life. In the end however she realizes just how much her husband Surinder really loves her, how he was there for her when she was left all alone, how he loved her unconditionally, even after she had told him she could never love him and she had no love to give. It's all the little things, the things that people assume will never be noticed that all added up in the end; that made Taani realize just how much her husband was willing to do to ensure her happiness, even if it meant removing himself from the picture.\n\nIt's a beautiful story and the cast is absolutely brilliant as well. Shah Rukh Khan delivers another award worthy performance as both Surinder and Raj while his beautiful, yet conflicted wife is played by the stunning Anushka Sharma. Both the leads bring a sense of life to their roles which the audience will love. The supporting cast also do great jobs whether it's bringing comic relief or advancing the storyline along. Vinay Pathak really stood out as Surinder's best friend and delivers a really funny and enjoyable performance.\n\nThe music is great, though none of the songs really stood out to me, though I loved the little bits of Dhoom Machale that were used in certain parts of the movie. Guest appearances from Preity Zinta, Kajol, Bipasha Basu and more were also included in the songs, which was a nice added touch.\n\nAll in all Rab Ne Bana Di Jodi is a must watch for any romantics in the audience. The songs, casting, acting performances and storyline all complement one another in a way that makes this movie tug at your heart strings. It gets a well deserved 9/10 from me. I do wish we got a Rab Ne Bana Di Jodi 2 though, one that continued the story of Surinder and Taani."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "chaitanya4193",
        "review_rating": "9",
        "review_title": "Beautiful movie..",
        "review_detailed_main": "My all time favorite movie.. I watch this all the time, Its simply beautiful.."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "arunrvgp",
        "review_rating": "10",
        "review_title": "Excellent film",
        "review_detailed_main": "Excellent film,gives such a feel as to watch again and again.Excellent work by all actors and excellent direction"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "paragm",
        "review_rating": "8",
        "review_title": "Awesome!",
        "review_detailed_main": "Beautiful love story with natural acting. My one of the most favorite movies ever."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "kaukabkhan",
        "review_rating": "10",
        "review_title": "One of the legendary movie",
        "review_detailed_main": "Not sure why the rating is around 7/10. It should get at least 9.5/10. One of the masterpiece and legendary movie ever made, and it's not even possible for Hollywood to make this kind of unique movie. However, it's not an action or thrilling movie. This movie is a legend based on dialogues. In order to enjoy the movie, you need to know how Indian flirting, culture, and love works. It is 2020. I still enjoy the movie and recommend my friends and family to watch to learn. It's realistic and educational for both men and women. Thank you, Sharuk Khan and Anushka Sharma, for flawless and excellent acting."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "jaideepchowdary",
        "review_rating": "10",
        "review_title": "\"Ever Watchable Film\"",
        "review_detailed_main": "I am watching this film since releasing and Everytime I watch it I get a memorable experience....."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "tarun-28718",
        "review_rating": "10",
        "review_title": "Good Movie and u can watch every time",
        "review_detailed_main": "I love this movie and superbly directed. This is the movie which you an watch many times with family and you will not get bored.\n\nMaccho banne ka scene was awsome.\n\nSong of the movie is also evergreen.\n\nGood movie by YRF Production as expected."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "umarulmukthafkp",
        "review_rating": "10",
        "review_title": "What a magical movie!",
        "review_detailed_main": "My favourite srk movie, make me both fun and emotions along the film.suri and raj differ taste character ,shah rukh khan done both are very well.\n\nAnd anushka what a pretty look in this movie, i wish to have a GF like her.no words to say the movie just amazing, totally worth 2.5 hr ."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "jowinjoe",
        "review_rating": "10",
        "review_title": "Rab ne bana di jodi💖",
        "review_detailed_main": "I watched the movie in 2024 actually. And Still the love essence the movie holds mesmerized me. I watched it with subtitles. It conveys the love of an ordinary person. You can learn a lot from this movie. How a person should be supportive to his wife. And what an one side lover can do for his love. Definitely a romantic roller coaster. I feel broken because it's not dubbed to tamil. Must watch in your lifetime but many tamil people might miss this gem by not watching. And also like some movies it doesn't end in a bad way. It has a good ending and also for viewers who think it should still go they also provided credits,It felt so full."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "maheshraveendran-36369",
        "review_rating": "9",
        "review_title": "Excellent film",
        "review_detailed_main": "Nice film. Recommending for everyone who loves romantic stories"
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "chickenjackson",
        "review_rating": "8",
        "review_title": "Still my favorite Bollywood film so far...",
        "review_detailed_main": "My favorite Bollywood film thus far, with the ever charismatic and charming Shahrukh Khan playing two roles (including a beta-male)!\n\nThe respective two kinds of love are heartwarming and unabashed. Yet, in a way that is uniquely Asian in its selflessness.\n\nIn the end, what makes this film so meaningful to me though is its take on what true love is (God style)."
    },
    {
        "movie_id": "tt1182937",
        "movie_name": "Rab Ne Bana Di Jodi",
        "movie_rating": "7.2",
        "review_username": "nimitarora-14452",
        "review_rating": "10",
        "review_title": "Delightful",
        "review_detailed_main": "A very underrated movie. Shah Rukh Khan is at his best. Anushka Sharma makes a brilliant debut. Great scenes, great moments, great humor."
    }
]