[
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "Its an after-effect of 'The Dirty Picture' with a better first half and a horrible second.",
        "review_detailed_main": "To get over with the basic plot of the film first, it is a simple revenge drama where an ambitious girl after being used by a rich entrepreneur strikes back to set the score equal. Now since the plot had nothing new to offer to either the distributors or the viewers so the makers think of the same tried and tested sex formula which recently was accepted well in the huge hit THE DIRTY PICTURE. In fact, it seems that the present HATE STORY is a kind of after-effect of TDP in which the makers solely use the sex angle and few erotic scenes to bring in a particular section of audience, mainly in the single screen theaters and the smaller centers.\n\nLuckily the film makes a good impression in its first half and the story progression keeps the viewer hooked as he keeps on expecting something shocking to come any moment (as shown in its promos). But all the expectations raised by its initial hour get shattered by a very vaguely directed second half which has everything over the top accompanied by some bad acting and illogical plots. Actually post intermission the director seems to have kept the craft apart and becomes only interested in adding all the steamy scenes and fiery dialogues for the viewers who have especially visited the theater for the very purpose. And that's where the film gets ruined completely. With a weird kind of writing wherein a famous prostitute gets easily appointed as the board of director of a reputed bank with the interference of an influential Minister, HATE STORY wastes the entire fine build-up made by its first half.\n\nLeading the vengeance saga, Paoli coming from Bengali films, makes the most controversial and unconventional debut ever in Hindi films. She is confident to take off every bit of cloth from her body to catch the attention of both the viewers as well as the industry. But other than the skin show she doesn't expose any exceptional talent of hers on the screen. So the present debut can only get her some similar roles and she will have to show the other part of her art in the next film. However she reasonably does well in the first half as the other actors in the cast. But post intermission mediocre acting takes over the film completely and no one is able to make any kind of impact till its strange climax. Interestingly the culmination also reminded me of a similar one, earlier seen in JOHNY GADDAR.\n\nGulshan as the main villain, does well in the first hour but again gives away to a loud act later on. Nikhil the only hopeful and honest character in the film is decent but gets very less mileage in comparison to the rest. Mohan Kapoor is perfect, Bhairavi is hardly there and Iravati is a talent wasted badly. So, Suresh Dubey as the strict industrialist cum father is the one actor who makes his presence felt with his acting.\n\nMusically, it has a below average soundtrack with one good (sad) song, which sounds fine while watching the film. Background score keeps moving between decent and loud, whereas its Cinematographer cans all the erotic scenes brightly in an attempt to show it all. In addition the dialogue writer tries everything to make it look (or sound) like a soft-porn with lines such as \"Take It, Shake It & Fake It\".\n\nBut here I would like to share, what in my opinion must have been the 'Base Thought' behind making HATE STORY.\n\nAfter knowing about the title, subject & favourable reports of THE DIRTY PICTURE in production in the late 2011, the producer or director must have imagined the great potential it had as a project. So taking a clue from it he must have thought of just one line to visualise this film.\n\nAnd that one line has to be, \"Get me a good looking sexy girl who is ready to take off all her clothes on the screen and can sign that clear clause written in the contract about nudity or skin-show\".\n\n\"But what about the story or screenplay?\", someone must have questioned. To this the reply must have been \"That we can easily write later on as the film will solely run on its seducing erotic scenes and revealing promos.\"\n\nThat is how the idea of HATE STORY must have born in the minds of its producer/director as it hugely relies just on the hype created by all its objectionable promos which even have more sexual content than the movie itself. Obviously the censor used their scissors on certain scenes (like the one with the minister). But even before the promos were banned for the TV, they had already gone viral on the net and had given enough publicity to the film reaching its target audience.\n\nAnother point which proves this fact lies in its questionable script in which a girl who is a trained investigative journalist gets trapped and then sexually traumatised by a rich industrialist. Now this talented educated girl with a good family background, strikes back to take her revenge. But in a hugely absurd manner instead of ruining the guy by working against his whole empire as a hungry detective cum journalist (the job she could have easily gone back to), the silly girl decides to become the most sought after prostitute of the city selling her body to every big shot of the town.\n\nHence is not exactly Cinema but 'A Perfect Product Marketing Plan' executed well in the business of selling movies. And since films are more or less made for earning money, so we have to accept it as a part and parcel of the trade. A part, which sadly remains the most talked about and the shady one."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "sidharth-banerjee25",
        "review_rating": "6",
        "review_title": "A Brave Attempt :)",
        "review_detailed_main": "An \"erotic thriller\" in India, man that's something you do not come across every day. So, Vivek Agnihotri did manage to gather a respectable amount of audience for his latest movie.\n\nFor me, Hate Story is just about an average movie.\n\nThe story is all about a cat and mouse chase between the protagonist Kavya Krishna played by Paoli Dam and Siddharth Dhanrajgir played by Gulshan Devaiya. There isn't much other than that.\n\nNow, when a director is confident about the script and the overall movie itself it often goes in favour of the film itself. But this same confidence hits it hard when the director becomes so sure about the movie's success that he doesn't put in the desired effort. Unfortunately, Hate Story is about just that.\n\nEven in Paoli Dam's case as the vibrant journalist(considering she is one the leading actress in the Bengali film industry) it seems that just because she's showing off her skin and doing bold scenes, she feels that the audience won't care if she hams through most of the scenes and talks in a weird trying to be sensuous kind of voice. I mean I felt so.\n\nHonestly, I didn't pay much attention to the music and let me tell you one more thing the PROMO of Hate Story was much more BOLD(if you know what I mean.. hehe) than the whole movie itself.\n\nA MAJOR REASON that left me disappointed :P considering that I had to tell my parents I was going for the movie. Plus the word 'Fuck' was used wherever possible which was annoying.\n\nYet,(there's always a 'yet') I can cannot ignore the brave attempt, the good pace and the not so bad concept of the movie. Plus Gulshan Devaiya does a decent job as well. Nikhil Dwivedi is just okay. And Paoli Dam respect\n\n2/5 My advice wait for the director's cut version ;)"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "kevinspells1990",
        "review_rating": "5",
        "review_title": "U will hate it from the start",
        "review_detailed_main": "Unlike the usual Bollywood flicks this is more gruesome.Most of Bhatt's movies are based on greed and revenge Hate story is one of them. The casting of the movie is not good. Paoli Dam was not at her best, i mean the movie has many sex scenes but she doesn't fit it. Bhatt should have cast Esha Gupta(Jannat2) for this role because she's HOT. The movie has some eye openers like corruption, scams. I reckon you don't watch this movie with your family because it's \"A\" rated film. I had more expectations from this film when i seen the banners(Paoli's naked back) but when the seen her face if was like(who made her a heroine). The script is not that bad but not worth a watch.\n\nMy rating 5/10 1 star for story\n\n2 star for actor(Gulshan Devaiah)\n\n2 star for the eye openers"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "eh5963-297-967354",
        "review_rating": "3",
        "review_title": "A done to death, flawed Hate Story",
        "review_detailed_main": "When we see the first trailer of Hate Story, we think of an exciting, bold, electrifying story. Of Course, the erotica depicted in the trailer is anything but subtle. So when I saw this movie, I actually expected a decent movie. (I really did not have a reason to because Vivek Agnihotri isn't even a decent story-teller) Still, the trailer made me have slight hope. However, that hope was gone within the first 20 minutes. More on that in a bit, first the synopsis.\n\nKaavya is a young, modern journalist out to find the truth and the truth only. She pulls a sting operation on a corrupt businessman Sidhart Dhanrajgir. \"Impressed\" with her work, Dhanrajgir offers her a job. Kaavya instantly falls for Sidhart and sleeps with him. A delighted Kaavya is shattered when Sidhart fires her and kicks her out. Kaavya, pregnant with Sidhart's child has a forced abortion done by Sidhart's goons and is left ruined. Kaavya's only objective now is to get revenge and destroy Sidhart.\n\nThe story seems done to death but even an old story told in a new way can do wonders. (Agneepath being a recent example of such brilliance) Where Hate Story lost me was in the first few reels. Why does Kaavya work for Siddhart if the post has nothing to do with her last job? Money? If so, then why is she shown as this moral and ethical journalist passionate about her job? Why is she throwing all that away for extra cash? Second, how does she fall for Siddhart so fast? I mean, come on! She goes on a holiday with him and ends up sleeping with him right then? Isn't this the same moral journalist? Plus, why is she even interacting with Siddarth after proving that he's a corrupt money-hungry man? All those questions were thrown at me just in the initial reels. Not a good sign. The writing is poor, and takes the audience for granted. We're not idiots.\n\nMore flaws? Of Course. Why is there so much forced sex? Also, I don't know why Kaavya went to learn \"Prostitution\" of she really wasn't going to be one. Plus, she slept with the corrupt businessman a week into getting the job - She's got the traits of prostitute in her.\n\nThe climax is surprising but seems like something we've seen numerous times.\n\nThe film really doesn't score much on anything besides two things. The slick style of filmmaking and the decent performances.\n\nVikram Bhatt's story is old fashioned and completely flawed. Too many loopholes. Some dialogue is decent, however.\n\nThe music doesn't offer much.\n\nVivek Agnihotri's direction is okay. Actually one of the better things in this flick. It's stylish.\n\nPaoli Dam makes a confident debut. She's actually really good here. She looks good, of course, but there's also a dominant actress in her. Only if her character and script was better. Despite that, she carries this bad film on her shoulders. Gulshan Deviaha is also impressive. He looks awkward in the starting but pulls on his own.\n\nResst of the cast is good too.\n\nOverall - A flawed film not worth watching even once."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "Uriah43",
        "review_rating": "7",
        "review_title": "Hell Hath No Fury Like a Woman Scorned",
        "review_detailed_main": "This film begins with an investigative journalist by the name of \"Kaavya Krishna\" (Paoli Dam) and her good friend \"Vicky\" (Nikhil Dwivedi) capturing incrimating evidence on camera of a high-ranking executive who works for a major corporation there in India. The next morning her article makes the headlines of the news cycle and the person responsible for the running of that company \"Siddharth Dhanrajgir\" (Gulshan Devaiah) is told by his domineering father, \"Kumar Dhanrajgir\" (Saurabh Dubey), who owns the business, to clean up the public relations disaster immediately. The problem is, Siddharth is totally incapable of simply correcting the issue at hand and as a result becomes determined to get even with Kaavya at all costs. So, not long afterward, he sets up an appointment with her and offers her a staggering amount of money to entice her to work for him. Thinking that he is on the level she accepts. Eventually, one thing leads to another and she falls in love with him. However, the day after she sleeps with him he abruptly fires her and revels in her humiliation as she is forced out of his office. Unfortunately, it doesn't stop there because a couple of weeks later she discovers that she is pregnant. But when she informs Siddharth of this he not only has her kidnapped and the baby aborted but also has her sterilized as well. And from that point on Kaavya vows to get her revenge upon him. Now rather than reveal any more I will just say that I thought that this was a pretty good film for the most part as it had an interesting plot and some good acting from all concerned. Admittedly, there were certain scenes which were completely unrealistic, but even so I enjoyed this movie overall and have rated it accordingly. Above average."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "morrison-dylan-fan",
        "review_rating": "1",
        "review_title": "Sliver Story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "ketgup83",
        "review_rating": "7",
        "review_title": "Hate Story is a good watch with nice story , good performances and decent direction",
        "review_detailed_main": "Hate Story was a complete surprise considering the trailer showed exotic and bold scenes by Paoli Dam, but more than that, it had fine performances by the star cast.\n\nKaavya (Paoli Dam) is a fearless journalist who along with Nikhil (Nikhil Dwedi) performs sting operations. One such operation leads to of exposing of a money deal in India Cementac company which outrages the CEO , Siddhart Dhanrajgir. To avenge his company's bad name , he plans to destroy Kavya by hiring her in his company and pretend to fall in love with her. Kavya falls into his charm and her life soon turns topsy turvy. She becomes pregnant and soon is almost killed by Siddhart's goon. She is cast away from her family and friend except Nikhil who helps her at every step. However , she starts planning to bring down Siddhart and his company and becomes a prostitute.\n\nVivek Agnihotri ( Chocolate) has directed an exotic thriller which raise few bars in terms of erotic scenes and abusive languages used in the film . However , the good part of the film is the storyline and decent direction with fine performances. It keeps you entertained till the end and that is where the film delivers. Coming to the performances, Paoli Dam is the captain of the ship. She has displayed her skin immensely in the flick but more than that it is her performances which should be considered. She is excellent in her debut film and will definitely go long way. Another noted performance comes from Gulshan Devaiah. He was effective in the villainous role.\n\nOverall , Hate Story is a good watch with nice story , good performances and decent direction . Good 3.5/5"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "pcsarkar",
        "review_rating": "3",
        "review_title": "All Hate, No Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "TheNonSmoker",
        "review_rating": "7",
        "review_title": "Recommended 👍",
        "review_detailed_main": "Good movie, worth my time and I hope it will worth yours too :)"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "rish2006",
        "review_rating": "2",
        "review_title": "Lame Revenge story",
        "review_detailed_main": "The title says it all, what more can I explain. Not worth your time."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "gaurav-solanki-16",
        "review_rating": "8",
        "review_title": "Wonderful and exciting movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "michael-kewl",
        "review_rating": "6",
        "review_title": "Hate story",
        "review_detailed_main": "A generous six out of ten.\n\nThe movie is well constructed and directed stylishly by Vivek Agnihotri. For the acting part, Paoli Dam & Gulshan Devaiah were terrific. Nikhil Dwivedi was just going through without any expressions on his face. The erotic scenes were not so explicitly required for the plot except during the seduction of minister. Its seems some critics are not reviewing the movie following the erotic scenes, but come on guys, I don't think we should hesitate to be straight forward. Films are what the society is. There's nothing which people doesn't do, doesn't wish to happen. Or else its bombed. I think this movie is one up to the mark to the Hollywood standards. Truly the industry has evolved a lot. Overall, its a good attempt at perfection for a not so sound story, but good work should be appreciated. Thumbs up. Go for it!"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "jhabrijeshbk",
        "review_rating": "4",
        "review_title": "A revenge story almost Watchable when shown on T.V without too many breaks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "johnsont307",
        "review_rating": "4",
        "review_title": "old fashioned titillation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "Biswas_",
        "review_rating": "7",
        "review_title": "Cult status!",
        "review_detailed_main": "Agree or not, because of this film's success, Hate Story went on to have 4 sequels in just 6 years. This was a more of revenge inside a blue film. Female revenge stories are always amazing to witness and Hate Story 1 was one of them.\n\nHence, in bollywood, Hate Story holds a cult status amongst female revenge stories.\n\nPS - imo till date the best and gruesome female revenge Story I have seen is \"I spit on your grave \" (1970)"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "Somak21",
        "review_rating": "3",
        "review_title": "I Hate Old Storys!!!!",
        "review_detailed_main": "The first promo of this movie stole tranquility of many erotic movie lovers. Paoli Dam, the bad girl in Bengali movies makes her debut in Bollywood and here also she isn't such a good girl. There's nothing such new in vendetta theme. A Girl tries to take revenge on someone who has ruined her life - many told and untold stories have been narrated in the same way. But still, depending on the hotness and sex-quotient of the movie, HATE STORY relied on a very risky position of expectations as the story and narrating of the movie didn't seem much impressing.\n\nThere was time when vendetta was served like hot cake in movies. 1970's to 1980's were the most important times. Even movies like AGNEEPATH (Old & New), SHOLAY, V FOR VENDETTA, 1920, KAHAANI and many more are based on the same genre - REVENGE. Vikram Bhatt pens down an erotic tale of vengeance in such a modern time. But we know that his writing has its own individuality and so movies like RAAZ, 1920, KASOOR, RED are a must watch. But in writing HATE STORY, sensitivities, amount of suspense, thrills lacked attendance from him and that can be clearly seen in the movie.\n\nThe story revolves around Kaavya (Paoli Dam) and her transformation from a simple middle class journalist to a sex worker to seek revenge. Kaavya, who doesn't have anything to lose anymore, uses her sexuality as a lethal weapon to rip Siddharth (Gulshan Devaiah) apart by using everyone connected to him one way or another. Thus begins the journey of hatred and brutal vengeance.\n\nThis affects everyone around Kaavya, including her family and her best friend Vicky (Nikhil Dwivedi), who secretly loves her.\n\nSuch a simple in the shape of brutal story doesn't affect the story but misses chance to glorify the story or be an advantageous element fir a movie. Some things like how Kaavya first sexually makes her movie for the CEO (Joy Sengupta) & the politician (Mohan Kapoor) and then uses them to light the fire for Siddharth. Bhairavi Goswami helped Kaavya to become a sex-worker. Such characters do give the story some meaning but in the end, nothing does matter.\n\nVikram Bhatt wrote with some sincerity but as I said before, he mainly concentrated on the sensuality part rather than the grip of the story. The script is also by him which is not bad but lacks interest in many places. Dialogues by Rohit Malhotra lack freshness. Cinematography by Attar Singh Saini is strictly OK. Satyajeet Gazmer's editing is average. Abbas Ali Moghul's action direction works in certain parts. Amar Mohile's background music fits the situations perfectly. The soundtrack of the movie is strictly alright and shows no hope but songs like RAAT and DIL KAANCH SA show hope for situations. Giving such good songs in MURDER 2, it was a total disappointment from Harshit Saxena.\n\nPaoli Dam, after working in various Bengali films, works like very subordinate in HATE STORY. As the leading lady and the most important character of the movie, it was a great responsibility to carry out the role perfectly. But she impresses by keeping the anxiety escalating with her tough and titular act. Gulshan Devaiya was impressing in his strong and effective negative role. As the films is featured on the conflict between Paoli & Gulshan, they made wonderful efforts to make this vengeance story pass with great enthusiasm. As seen on, Dumb MAARO Dumb, THE GIRL WITH THE YELLOW BOOTS and SHAITAN, Gulshan Devaiah always works in the negative and dark roles. Nikhil Dwivedi, the only character who is filled with positive potential in the movie does a very good job. His immense support and friendship helped Kaavya very much till the end of the movie. Mohan Kapoor was good. Joy Sengupta was fine. Iravati, Saurabh Dubey, Gopal and Bhairavi Goswami were very small and negligible.\n\nOn the whole, HATE STORY relies on a paper thin plot & survives only for impressing performances by the two leading actors Paoli Dam & Gulshan Devaiah. There's simply no hope for this movie to make a good move but there's something that can save this movie is its bold, inflammatory & provocative scenes that can be liked by some people (No Offence). Can be easily avoided."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "suite92",
        "review_rating": "6",
        "review_title": "Revenge, prostitution, government corruption, and industrial spying in modern India.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "yunusitboss",
        "review_rating": "2",
        "review_title": "Hate Story (A)-----------Rating: 1/5",
        "review_detailed_main": "Hate Story (A)-----------Rating: 1/5\n\nIt is a Bollywood Erotic film....a very draggy feels sleepy..... But the end was great...it is a revenge story.....\n\nIt is about a reporter who becomes a victim of forced abortion and later turns into a whore to plot a vengeance scheme against the man who ruined her life.The Story of the film revolves around Kaavya and her transformation from a simple middle class journalist to a sex worker and her revenge where she is exploited both professionally and sexually. Thus begins the journey of Hatred and brutal vengeance.This affects everyone around Kaavya, including her family and her best friend who secretly loves her, and different people coming in the path of her quest."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "sarandivyam",
        "review_rating": "6",
        "review_title": "Honest Review",
        "review_detailed_main": "Let us discuss the first part which released on 20th April 2012. It casts Nikhil Dwivedi, Gulshan Devaiah & Paoli Dam. This film as the name suggests has to hate at the center and in this part, one can explore the intensity of hate between Paoli Dam and Gulshan Devaiah. What I like about this film is the reality because if you see today's films most of them seem to be fictional but this film could be drawn into reality also. The story was simple but the presentation was very good. The music was average while the direction, screenplay, cinematography are good. I give this film an average rating."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "shivam-ga",
        "review_rating": "3",
        "review_title": "Bhatt Camp again sucked",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "wasaparasite",
        "review_rating": "10",
        "review_title": "Insanely Brilliant !!!!",
        "review_detailed_main": "There is only one word to describe the cinematography, the set designs and the dialogues, and that is Exceptional! You don't just watch the scenes happening, you feel them. The movie is a real thrill ride. The action scenes are well pictured and the music is electronically haunting. Never, in the run time of the movie, you will get a chance to move your eyes from the screen to any other object.\n\nI hope audiences are ready for a film like this, a pure auteur driven film which does not sacrifice a single frame for the studio. I would hope this film will change Bollywood, as it is 100 percent the director's vision.\n\nSaying that, i must say, that in a world full of remakes, reboots, sequels, prequels and God knows what, this is a unique chance to see something different and unmatched !"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "newphoneacc",
        "review_rating": "1",
        "review_title": "What a waste of time!",
        "review_detailed_main": "I had always watched bits and pieces of this movie & some songs on music channels. One fine day while taking I started watching this movie. Within 5mins of the movie, it felt like the latter was a better option than watching this horrendous excuse for a movie. The acting felt so fake I couldn't even watch a minute longer of it. I felt the urge to actually warn people of this movie and created an account to review this."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "freespiritlocked",
        "review_rating": "5",
        "review_title": "..hmmm....so-so.",
        "review_detailed_main": "well by \"so-so\" i mean the film is only half good. You may watch it, but don't go in with a high expectation. The first half of the movie is disastrous. If you can somehow survive the first half you may enjoy the rest. The acting has been poor throughout the film. The love making scene of the first half was nothing less than comedy although there were some good intimate love making scene in the second half. overall a very strong subject, somewhat out of the box, but rather poorly executed.This is the very first time boolywood managed to present something different bold yet very realistic topic. I felt with a better star cast the film could have been much better. Paouli Dam did a descent job although she still needs some acting lessons. To sum it up, i would say, its watchable but definitely not a must watch."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "silvan-desouza",
        "review_rating": "2",
        "review_title": "Nothing great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "wuzumu",
        "review_rating": "10",
        "review_title": "Glad and Surprised to see such a movie from Bollywood",
        "review_detailed_main": "Must watch for those who like to watch something different and unique every time they step into a theater. To be honest i didn't expect a lot from this one, but after coming out of theater i was laughing and was amazed with the performances of each and every character.\n\nThis movie provides an entirely different aspect of human nature which is not very often depicted in Bollywood.Basically it shows us there is a dark side of every individual; its just one needs that moment to let this cat out of bag.\n\nGo and watch Hate Story because it's dark and bitter but yet gripping and you will like it if you are not only an emotional drama lover and like watching different genre."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "ahmed_yasir1996",
        "review_rating": "10",
        "review_title": "This Movie Has Haunted My Life !!",
        "review_detailed_main": "Engrossing motion picture that features some of the finest editing, cinematography and performances ever. This is by far the best movie ever to give a portrait of organized crime, this movie goes deep inside and shows it all inside out..\n\nThe writing was phenomenal and breathtaking. As mentioned before there has been no movie quoted more than this. It is not even the quotes though that makes the writing in here so perfect. It is the symbolism and meaning that went into every scene. There are countless symbols, messages and lines in here that are so memorable yet it is as realistic as a movie could get.\n\nThe directing by Vivek Agnihotri was perfect as well.Vivek deserves credit for this. The symbolism and messages that went into every scene also has to do with the directing not just the writing. The movie is so well edited and strung together that the only word that could come to my mind is perfection.\n\nMy rating : 9.5/10, MUST WATCH !!!!"
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "gift_yasir_ahmed1996",
        "review_rating": "10",
        "review_title": "Grandiose, bloody-minded and implacable,",
        "review_detailed_main": "This movie is strong, good script, great casting, excellent acting, and over the top directing. Even if the viewer does not like revenge type of movies, he or she will watch the entire film, the audiences is glued to what will happen next as the film progresses. Its about, loyalty, greed, relationships, and real life. This is a great mix, and the artistic style make the film memorable. The film-making is excellent and very suspenseful at times.Its great if you actually listen and pay attention because the whole time they are building up to the end.It is the most fantastic ending I've seen but watch the movie.\n\nHate Story,for me is more than a movie! Any film that can be watched 250 odd times and still enthrall has to go down as one of the best. Intense, operatic, melodramatic, overblown and frankly insane! More than any other film, it builds momentum from scene to scene, chugging forward from a slow start to climax with perhaps the most memorable ending in Indian cinema history."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "shahhirenmr",
        "review_rating": "8",
        "review_title": "Subject of Revenge depicted freshly",
        "review_detailed_main": "Saw an excellent movie after a long time. Great performances by all the actors, however Gulshan is the best and 2nd is Paoli Dam.\n\nThe film holds you from beginning to end and twists and turns make it worth watching.\n\nGood work from the crew. Fine tuned screenplay. The dialogues are well written and timing is good.\n\nAlthough not meant for young children, this is a great revenge story, wherein you hate all the characters by the end and that is the success of the movie.\n\nThis is my shortest review on IMDb as this movie doesn't need words, see it to experience it. I'm sure you won't regret."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "ravinderk1222",
        "review_rating": "10",
        "review_title": "Pure thriller",
        "review_detailed_main": "Movie was in the direction of love and then corporate or greed. The male character realistically displayed double roles inside and outside home. Sexuality aside, movie showed the pattern of continuity very well. This movie led a trailer of hate story films for a reason, have to give different actors credit."
    },
    {
        "movie_id": "tt2309987",
        "movie_name": "Hate Story",
        "movie_rating": "5.3",
        "review_username": "muhammedraeess",
        "review_rating": "10",
        "review_title": "THE BEST MOVIE EVER SEEN IN EROTIC GENRE AT BOLLYWOOD",
        "review_detailed_main": "The thing impressed me the most is the mind games and strategy played in this movie. you'll never feel anywhere that how can this happen or how is this possible\n\nwhen revenge becomes more important than your own life then anything becomes possible for a person\n\nand having such bold scenes and language at the year 2012 in a bollywood movie is an exception"
    }
]