[
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "KFL",
        "review_rating": "9",
        "review_title": "The excuses we make to justify our neglect of others",
        "review_detailed_main": "An appreciation of this movie may demand some understanding of Japanese culture. The Japanese are rather reserved, and were even more reserved back in the early 1950's, when this film is set. No embracing, even of parents, children, siblings; no dramatic histrionics; even a death scene in this movie is much quieter than a Westerner might expect.\n\nConsequently I can't really blame several reviewers here for calling this movie boring and slow-paced. But it is not at all slow-paced from a different cultural perspective. It just depends on what you're used to.\n\nIf you do take the time to watch and try to understand it, you'll find an engrossing analysis of the dynamic of a middle-class family, the rift that grows up between generations, and of the many excuses we find ourselves making to justify our neglect for others, even those dearest to us. These themes are universal, but are couched in a postwar Japanese idiom, and so probably less accessible to the average Western viewer.\n\nI have wondered awhile about a speech at the end by Noriko, the widowed daughter-in-law, in which she denies that she's such a good person (though her actions in the movie indicate otherwise). I'm still not sure I understand her motives in saying this. For the most part, however, this movie will not leave you puzzled, but it may leave you a bit wiser, and a bit more reluctant to make those excuses."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Galina_movie_fan",
        "review_rating": "9",
        "review_title": "Universal appeal of Tokyo Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Farzad-Doosti",
        "review_rating": "9",
        "review_title": "Now that I am alone, I feel that the days are too long.",
        "review_detailed_main": "Japanese cinema is full of great and creative directors. From Kurosawa and Mizugochi to more modern filmmakers like Kobayashi and Nagisa Oshima and Shishihara. Yet Ozu, like a detached taffeta of them all, deserves the title of the most Japanese filmmaker in the history of cinema. A filmmaker who, if they show you a shot of a film you have not seen before, you will immediately know that it was made by artist Yasujiro Ozu.\n\nThe Tokyo Story is one of the best films ever made and one of the most important works of art of the twentieth century. As an artist and, of course, a great teacher, Ozu slowly creates the structure of his masterpiece with his inherent camera and inherent calmness, so that the viewer suddenly finds himself in the middle of it without realizing it.\n\n\"The passage of irreversible moments\" Life is the field of our right and wrong choices, and the Tokyo Story is a small corner of this life and choices, and with all its beauties and ugliness, it is full of flips and lessons. Look at the Tokyo Story movie not as a fun movie but as a lasting impact on your life forever, so that we may pay a little more attention to what we have today that may not be tomorrow."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "EUyeshima",
        "review_rating": "10",
        "review_title": "Ozu's Quietly Brilliant Masterpiece Deserves Your Attention",
        "review_detailed_main": "I think this movie is amazing for reasons I was not expecting. I had heard of Yasujiro Ozu's \"Tokyo Story\" for several years but never had an opportunity to see it until Criterion resuscitated it as part of their DVD collection. Over fifty years old, this wondrous 1953 film resonates just as deeply today. Those outside Japan rarely get to see a Japanese film classic that doesn't involve samurai warriors in medieval battles. This one, however, is a subtly observed family drama set in post-WWII Japan, and it is the quietude and lack of pretense of Ozu's film-making style that makes this among the most moving of films.\n\nThe plot centers on Shukishi and Tomi, an elderly couple, who traverse the country from their southern fishing village of Onomichi to visit their adult children, daughter Shige and son Koichi, in Tokyo. Leading their own busy lives, the children realize their obligation to entertain them and pack them off to Atami, a nearby resort targeted to weekend revelers. Returning to Tokyo unexpectedly, Tomi visits their kindly daughter-in-law, Noriko, the widow of second son Shoji, while Shukishi gets drunk with some old companions. The old couple realizes they have become a burden to their children and decide to return to Onomichi. They also have a younger daughter Kyoko, a schoolteacher who lives with them, and younger son Keizo works for the train company in Osaka. By now the children, except for Kyoko and the dutiful Noriko, have given up on their parents, even when Tomi takes ill in Osaka on the way back home. From this seemingly convoluted, trivial-sounding storyline, fraught with soap opera possibilities, Ozu has fashioned a heartfelt and ultimately ironic film that focuses on the details in people's lives rather than a single dramatic situation.\n\nWhat fascinates me about Ozu's idiosyncratic style is how he relies on insinuation to carry his story forward. In fact, some of the more critical events happen off-camera because Ozu's simple, penetrating observations of these characters' lives remain powerfully insightful without being contrived. Ozu scholar David Desser, who provides insightful commentary on the alternate audio track, explains this concept as \"narrative ellipses\", Ozu's singularly effective means of providing emotional continuity to a story without providing all the predictable detail in between. Ozu also positions his camera low throughout his film to replicate the perspective of someone sitting on a tatami mat. It adds significantly to the humanity he evokes. There are no melodramatic confrontations among the characters, no masochistic showboating, and the dialogue is deceptively casual, as even the most off-hand remark bears weight into the story. The film condemns no one and its sense of inevitability carries with it only certain resigned sadness. What amazes me most is how the ending is so cathartic because the characters feel so real to me, not because there are manipulative plot developments, even death, which force me to feel for them.\n\nI just love the performances, as they have a neo-realism that makes them all the more affecting. Chishu Ryu and Chieko Higashiyama are wonderfully authentic as Shukishi and Tomi, perfectly conveying the resignation they feel about their lives and their children without slipping into cheap sentimentality. Higashiyama effortlessly displays the sunny demeanor of a grandmother, so when sadness does take over in her life, it becomes all the more haunting. In particular, she has a beautiful scene where Tomi looks forlornly at her grandchild wondering what he will be when he grows up and whether she will live to see what happens. Even more heartbreaking is the scene where Shukishi and Tomi sit in Ueno Park realizing their children have no time for them and are resigned to the fact that they need to find a place to sleep for the night. The closest the film has to a villain is Shige, portrayed fearlessly by Haruko Sugimura, who is able to show respect, pettiness and conniving in a realistically mercurial fashion. Watch her as she complains about the expensive cakes her husband bought for her parents (as she selfishly eats them herself) or how she finagles Koichi to co-finance the trip to Atami or how she shows her frustration when her parents come home early from the spa. So Yamamura (familiar to later Western audiences as Admiral Yamamoto in \"Tora! Tora! Tora!\") displays the right amount of indifference as Koichi, and Kyoko Kagawa has a few sharp lines toward the end of the film as the disappointed Kyoko.\n\nBut the best performance comes from the legendary Setsuko Hara, a luminous actress whose beauty and sensitivity remind me of Olivia de Havilland during the same era. As Noriko, she is breathtaking in showing her character's modesty, her unforced generosity in spite of her downscale status and her constant smile as a mask for her pain. She has a number of deeply affecting moments, for instance, when Noriko explains to Shukishi and Tomi how she misses her husband, even though it is implied he was a brutalizing alcoholic; or the touching goodbye to Kyoko; or her pained embarrassment over the high esteem that Shukishi holds for her kindness. Don't expect fireworks or any shocking moments, just a powerfully emotional film in spite of its seemingly modest approach. The two-disc DVD set has the commentary from Desser on the first disc, as well as the trailer. On the second disc, there are two excellent documentaries. One is a comprehensive 1983, two-hour feature focused on Ozu's life and career, and the second is a 40-minute tribute from several international movie directors."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "GyatsoLa",
        "review_rating": "10",
        "review_title": "A cinema of tears",
        "review_detailed_main": "I can vividly remember the first time i saw this movie - it was during a festival of Japanese movies in an art house cinema here in Dublin. I must admit to never having heard of Ozu before, i went out of boredom and casual curiosity. I was embarrassed at the end to find myself in tears. I quickly wiped them away in that subtle way guys do when they don't want anyone to know, and got out to leave. What struck me was that even as the credits were finishing, I was one of the first to go. As i walked up the aisle I realized that most of the nearly full cinema was still sitting quietly, without the usual post movie chatter - and more than half of the audience had tears pouring down their faces. I have never, ever witnessed that in a cinema.\n\nSince then, i've watched it on DVD, and had to think a lot about why such a simple movie is so powerful, and so many people rate it as one of the greatest ever. And why i find myself agreeing with that rating, i truly think it is in the top 10 ever made - certainly the top 5 of any I've seen. But its hard at first to know why. It doesn't have the greatest script of any movie, there are few things in it that are truly original. The acting is great, but not the greatest ever seen, and the technical qualities are just average. I've come to the conclusion that the reason for its greatness is that it comes closest to pure art in cinema. By pure art, i mean art that in its simplicity but technical genius still reveals deep truths about our lives. When i think about Tokyo Story I don't find myself comparing it to other movies, instead I think of a Rembrandt self portrait, a Vermeer painting, or my favourite short story, 'The Dead' by James Joyce. It is simple, unadorned, and deeply wise. I realise in writing this I'm rapidly approaching pseuds corner, but this is my genuine conclusion (writing as someone who is shamefully uneducated in most of the arts).\n\nOf course there have been many great movies about families, about growing old, about the nature of life.... but I think somehow Ozu achieved a sort of perfection with Tokyo Story. Thats why its the only movie I would give a '10' to."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ghmcal",
        "review_rating": "",
        "review_title": "Too subtle and yet too obvious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "spqrclaudius",
        "review_rating": "10",
        "review_title": "Extraordinary Portrayal of Real Life",
        "review_detailed_main": "A fantastic film that belies the simplicity of its plot, Tokyo Story is the tale of a vacation gone sadly awry, with an elderly man and woman visiting from the countryside pushed to the sidelines by their busy children in the city. The younger generation (and by extension the \"new\" Japan) turns its back on the family from which it arose- because of selfishness, because of necessity, or because it's simply the way of the world. The movie provides no easy answers- its melancholy ambiguity is part of its charm. Whatever the case, Ozu delights in portraying the details of everyday life. The emotional resonances of this movie are extraordinary, and some shots (a child picking flowers, an old couple framed by the sea, a woman sitting forlornly at her work desk) are enough to give a sensitive film-goer the shivers. Despite the testimony of some critics, the film is not totally devoid of melodramatic elements (some stock characters and cloying musical motifs spring readily to mind), but the film is founded upon such an obvious love and respect for the importance of real-world interactions that it's hard not to be anything other than enthralled by it."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Cheesedemon28",
        "review_rating": "10",
        "review_title": "\"Isn't Life Depressing?\"",
        "review_detailed_main": "Two women are sitting on tatami mats. They are smiling and talking. One of\n\nthem says, \"Isn't life depressing?\" Wow... that pretty much says it.\n\nTokyo Story is defenitely one of the finest movies ever made. Easy. I don't care what anyone says: slow or not, this is one of Ozu's finest films. Very few movies have made my cry, but I did indeed weep at this movie. All of the acting\n\nperformances are very believeable, especially Hara's. The interesting knee- level tatami cinematography suits the film perfectly. Even the music is\n\nimpeccable.\n\nWhat really gets me with Tokyo Story is how stunningly realistic it is. From the dialogue to the story, everything feels like real life. No matter what language you speak, what culture or country you hail from, this element is universal.\n\nIt's pretty much perfect... every character is fleshed out, there are no plot holes left open... I can't find anything to complain about it! 50 years after its release and it's still very contemporary... damn.\n\nI give it **** out of ****."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "851222",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Greetings from Lithuania.\n\n\"Tokyo Story\" (1953) is an ageless story about family, love and realizing of true values in life. This is a sad but at the same time inspiring story - but enough about stories - this movie shows life as it is - still.\n\nI loved the performances in this movie by simply everyone involved, as well as great directing and amazing writing. Although the movie is 2 h 15 min long and its a black and white \"old\" movie don't be fooled - this is a great movie that makes you think about your life and especially the people you love and that you have to love them while their are still here with you, because life is very short and better make most of it with the people you love. Great movie."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Stroheim-3",
        "review_rating": "10",
        "review_title": "FANTASTIC",
        "review_detailed_main": "I need to say this: THIS MOVIE IS ABSOLUTELY FANTASTIC!!! Sure it starts off slowly, but the fact of the matter is the film is a great story of a family and the alienation associated with aging. This is the kind of movie that will make you reflect upon your own family and how you treat them.\n\nI had never seen an Ozu film before, but now I feel as if I must see them all. His use of cinematic space is incredible. He breaks all sorts of conventions with his cinematography such as violating the axis of action. This gives the viewer the sense of a large, open, unrestricted world.\n\nGoing with this realism, the characters seem real; not for a moment did I see the people on the screen as actors. They were the family, and you as the viewer feels what they feel. Part of this comes from the use of head-on-shots such that the characters are speaking TO you.\n\nIt is a fantastic, moving piece of work and arguably one of the best films ever made."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "SoulBrotherNo1",
        "review_rating": "7",
        "review_title": "Touching story, but something is missing for me...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "bobbie-16",
        "review_rating": "10",
        "review_title": "beautiful meditation on old age and family; simple and moving",
        "review_detailed_main": "I can't take my mind off this movie. The story is both universally human (old age, the end of life, parents and children) and specifically Japanese. The movie tells the viewer so much about Japanese middle class life in the 1950s: eating and sleeping; mourning the war dead; clothes and home furnishings; spoiled kids; a doctor's office; a schoolroom; life in Tokyo and small towns; how family members talk to each other; old men's drinking habits; a resort hotel. But while we see all these details of a real time and place, we are constantly drawn into reflection on the meaning of human life and relationships. The reflection emerges effortlessly from the simple narrative and the specifics. The director never annoyingly tells us how to feel, he is not preaching and not drawing attention to himself. (There is none of that \"hey, I'm making a moving movie\" crud that you get in Hollywood treatment of these topics). He just lets the story unfold in a quiet, natural way. It's not for folks who only like \"action\" movies. I put \"action\" in quotes because this movie is about the real action in life--enjoying life, sharing it with others, facing the end of it."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "madbeast",
        "review_rating": "6",
        "review_title": "Stunningly over-rated",
        "review_detailed_main": "I finally saw this film after Site & Sound Magazine rated it as the third greatest film ever made in their once-a-decade list. Far from being in the pantheon of greatest films, I found it to be a ploddingly dull movie that made some fairly obvious points about the weakening of the parent/child relationship as the parents settle into old age.\n\nThe movie is definitely not without its fine points. The acting is generally excellent and the last half hour becomes increasingly interesting after the first brutally slow-paced opening hour and forty-five minutes. It's entirely possible that if Site & Sound hadn't placed this film on such a high pedestal, I might have enjoyed it more than I did. But then again, if they hadn't have rated it so highly, I might have never seen it at all.\n\nIn the final analysis, \"Tokyo Story\" is worth a look but if you're expecting to see one of the greatest films ever made, be ready to be disappointed."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Slime-3",
        "review_rating": "5",
        "review_title": "Somehow Not The Best Film Of All-Time One Is Often Led To Believe",
        "review_detailed_main": "Labelling something 'the best ever' or even a more moderated 'one of the best...' is surely asking for trouble? But in the case of TOKYO STORY it would be difficult to imagine the film causing any kind of trouble at all as this very measured, courteous movie is such an inoffensive and charming offering. However it's not, in my view, anything remotely like 'the best ever'. It's a nice little film, in it's way, but I do wonder why on earth it has developed such a huge reputation? It's sad, it's endearing, it's sometimes rather beautiful and it's melancholic almost throughout, but it's also very predictable;nothing remotely unexpected happens, one can see things being flagged up well in advance. It's very slow and made in a very tightly confined way which hasn't really influenced subsequent movies half as much as some people would like to think.So what makes it considered \"one of the best\"?\n\nIt's not the story which is spare and not very entertaining in itself,although the character development is good. We do get to know the people involved even if many a motive seems to remain mysterious at the end. It's not the camera work which is rigidly static, creating the impression of interlinked paintings through which the protagonists wander, rather carefully. The familiar Ozu stylisations; the low set camera, the unfamiliar looks almost straight-to-camera when speaking, make it a slightly unsettling film to watch initially, although one soon becomes used to them. Perhaps it's the location work, which is appealing,in a reserved and understated way? Japan in the mid 50s seems far more exotic and unfamiliar than it would today , but that's true of almost any developed country. Twenty first century England no longer resembles the country depicted in Ealing Comedies of the same era. And the acting is a conundrum. Cultural differences in speech patterns and body language make it hard to compare what we see here with what we are familiar with in the western world. Certainly the father-figure seems to move and speak in such a painfully slow and deliberate way (except when drunk!) that one really begins to wonder how naturalistic his acting is. Are we seeing something comparable to Brando's 'method' or to Olivier's Shakespearian style? I think one needs to be very familiar with Japanese language and culture to fully understand and appreciate that aspect. He's a nice old boy but he might well be a terrible actor.\n\nIt's certainly not the music that makes this film special as it's neither evocative nor memorable, so I'm at a loss. CITIZEN KANE, which often shares this most elevated of critical pedestals with TOKYO STORY, clearly has cast a much\n\nlonger shadow over the development of cinema and while it's chock-full of innovative moments and methods TOKYO STORY seems rather a stylistic cul- de-sac from which one can find very little in subsequent movies. It's not a bad movie, but it is one which I'd fine it hard to sit through a second time."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "howard.schumann",
        "review_rating": "",
        "review_title": "Things are the way that they are and it is perfect",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "aakostar",
        "review_rating": "8",
        "review_title": "Very interesting movie however it needs some patience from the moviegoer",
        "review_detailed_main": "Tokyo monogatari (or Tokyo Story) is a very human story. It contains a lot of everyday life which at times can make it difficult to follow since it may feel a little bit slow.\n\nHowever who is patient gets rewarded. And Ozus way of telling this story is very quiet but effective. The images he produces and the very minimalist camera work creates a rhythm that sucks the viewer in and slowly opens him/her up for the sad but essential ending of this movie.\n\nOzu never tries to impose his story to the viewer. It looks like he follows his actors very disciplined and calm. This very structured and clear camera-work will alienate many modern moviegoers who are used to much more dynamic images. However lovers of purist cinema and fans of Aki Kaurismaki will probably love it.\n\nImpressing also to see how close the everyday life of Japan in the mid 50s is to the western way of life."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "TheLittleSongbird",
        "review_rating": "10",
        "review_title": "Beautiful and deeply moving",
        "review_detailed_main": "Why did it take so long for me to see this film? I don't know why that is, other than being behind with my movie watching due to studying, and I am still kicking myself because Tokyo Story was one of the best films I've seen in quite some time. I haven't seen enough of Yasujiro Ozu's work to judge him as an overall director, but seeing Tokyo Story it is very easy to see why anybody would consider it one of his finest achievements or him as a master film-maker. Tokyo Story is beautifully shot, everything looks homely and evocative and the shots, frame and cinematography are done to perfection. And Ozu directs very sensitively and assuredly, it is said that he specialised in middle-class family melodramas and I have no trouble believing that. The story is quiet and meditatively paced but never bored me, because every bit of writing, family scene and character was dealt with in such a poignant and intelligent manner. Tokyo Story is also helped by some truly wonderful acting. Setsuko Hara just epitomises gentle kindness, making us warm to Noriko easily, while Chishu Ryu and Chieko Higashiyama play their roles with nuanced and affecting dignity. In conclusion, a beautiful and deeply moving film in all respects. 10/10 Bethany Cox"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Koyama22",
        "review_rating": "10",
        "review_title": "A meditative masterpiece",
        "review_detailed_main": "I first watched Tokyo Story in a classroom some time ago and witnessed something curious. I have never seen a group of people so choked up over a film, ever. The most curious thing about it though is that most could not place what exactly made them so emotional. There are moments in Tokyo Story in which you are hit with a wall of emotions, surprised and overwhelmed that this simple little film could evoke such feelings. It's something about the characters, the honesty, the way everything hits home despite the cultural and time-period barriers.\n\nTokyo Story takes a deep look at familial relations in postwar Japan. Simply, it boils down to this: two aging parents (played by Ryu Chishu and Higashiyama Chieko) live far away from their children, who are in a quickly modernizing Tokyo. The children in Tokyo are quite selfish and focused on their own busy lives in the hustle-and-bustle of the city. The key character in this film, though, is Noriko (Hara Setsuko), the widow of one of the parents' sons who died in the war. Noriko turns out to be more active with her husband's parents than their own children are.\n\nThe parents decide to make their first, and possibly final, trip to Tokyo in order to see their children and view the spectacle of the city. The only person that can make significant time for them, however, is Noriko; the children are busy with work and even send their parents away to a spa! In one heartfelt scene, the mother, Tomi, spends the night at Noriko's in which she begs her to re-marry and apologizes for the burden that her son has caused. During this time, the father, Shukichi, is out drinking with old friends and admits to them that he is disappointed with his children, agreeing with his friends who feel the same way.\n\nOzu Yasujiro is considered to be one of the world's greatest filmmakers and Tokyo Story is considered his masterpiece. There is no reason to deny this. Ozu's camera is often a topic of discussion–it usually sets itself at the level of people sitting on the floor (tatami), which allows the viewer to feel like they are sitting right with the characters. It is usually always a calm camera, and very rarely pans. His films are also often slowly paced and meditative, choosing to avoid showing important events which later are revealed through dialogue. Ozu's direction of children has always been brilliant, they are never a weak point in his films and he often bases his stories on child characters (though not here).\n\nTokyo Story contains all of the elements that make Ozu's films popular with film students and cinephiles today. His calm, observant camera; his real-life, non-embellished characters; his attention to detail and the emotional emphasis on certain objects; his perfectly timed music; among other things, contribute ultimately to the warmth and effectiveness of the film. Ozu's passion for filmmaking knew no bounds.\n\nTokyo Story will not appeal to everybody, especially today. The typical moviegoer will either dismiss the film because it is \"old\" or \"black and white,\" or find it boring. To the cautious and attentive viewers who allow themselves to connect with the characters and feel the story, Tokyo Story is a rewarding experience. Tokyo Story, along with Ozu's other films, is a good example of film as an art. Aimed at telling a story and depicting true life on camera, it is much less of the \"entertainment\" experience that people have come to expect from the movies today. There are no explosions, violence, chase scenes, or over- the-top characters here. This is Ozu. This is one of the greatest films ever made."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Hitchcoc",
        "review_rating": "10",
        "review_title": "Just Too Real",
        "review_detailed_main": "An elderly Japanese couple come to Tokyo to visit children and grandchildren. From the beginning, we get a sense that they are looked at as a nuisance, even though they have not seen their family for years. While they visit, the children are hard pressed to take a little time for them. We see that they have settled into their lives (rather depressing lives) and into themselves. The kindest person is a young woman who the widow of one of the sons. She is kind an compassionate. True, not a lot happens, but as we go through the two hours, it is painful how tense things are and what an edge there is. I've seen these kinds of relationships in my extended family and in the families of others. This is a very well constructed film."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "elvircorhodzic",
        "review_rating": "9",
        "review_title": "Life is simple and unique. That's very true.",
        "review_detailed_main": "TOKYO STORY is a film that has a moderate tone, unobtrusive style and quiet family story. An elderly couple from the provinces coming to Tokyo to visit their grown children. The story shows how the children, preoccupied with their daily lives, do not show enough care for their parents, as opposed to the former daughter-whose husband died in the war. At first glance, everything in this film seems simple and clear, but on the other hand is a sensitive topic and family discord, somewhat generational conflict with fairly deep emotions without excessive melodrama.\n\nStaff are interesting, a little strange, however, show sincere emotion without many words. Of course, you need to understand Japanese culture, which I somehow fascinated. The story can be identified three generations of which is the oldest in a harmonious relationship. Although it can be concluded that it is not always the case. The younger do not have time for yourself and not for others.\n\nMost people do not live. Survive. Understanding and tranquility in fact represent the fund in relation to the sentiment and satire. People consciously or unconsciously influence the lives of others. People woven in one's life are there, even when they are not physically present.\n\nSetsuko Hara as Noriko Hirayama really is a beauty. She plays a woman who has all the prerequisites that clearly says \"Life is disappointing\", but again full of mercy, kept calm and beautiful smile that does not come off from the face. Well, sometimes that smile accompanies large tear."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "eganp-1",
        "review_rating": "10",
        "review_title": "why this film is one of the top 100 ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "neonadventure",
        "review_rating": "9",
        "review_title": "Tokyo Story: Realism made through Subtlety",
        "review_detailed_main": "1954 was one hell of a year for the Japanese film industry. Other than the fact that they're poor after WW2 ended, 1954 was probably the best Japanese film year to date. The 3 greatest directors of Japan, Kenji Mizoguchi, Akira Kurosawa, and Yasujiro Ozu, release by far their greatest creations. (Although Ugetsu was 1953, Sansho the Baliff was also great) Oh and I forgot that GODZILLA was also 1954 too. There's no denying Japanese Cinema was at their peak in 1954. There was Seven Samurai, Sansho the Baliff, Godzilla, and then there's Tokyo Story which is the film we're going to focus on today.\n\nTokyo Story tells the most simple and boring tale of family about grandparents visiting their son's place for a while and see how everyone is doing. It is hard to describe the power of this film without spoiling the ending. The ending makes up the emotions. The power of boredom is that it is normal, silent, and yet when something happens, we would end up reacting to it for no reason. Boredom is the weapon that Ozu always chose to tell his story.\n\nEach one of his stories have special messages on life that are worth learning about. His stories might be the same, but they each hold power that many people don't see. The camera never moves a single inch. It is one foot above the ground. Moving the camera would mean you would break the power of boredom and you would expect action out of a character. That's why Kurosawa is so moving with his action. Tokyo Story is the perfect and most Japanese film that you'll ever get. Japanese drinking sake, having nice dinners, and overall living their lives to the best. Keep in mind that this film was after WW2 so the film is like an escapist film. The film is like the only source back then that can get Japanese people happy with their lives and help them forget about the war."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "claudio_carvalho",
        "review_rating": "7",
        "review_title": "A Movie to Make You Think about Parents' Seniority and Children Indifference and Selfishness",
        "review_detailed_main": "In Onomichi, Hiroshima, the retired Shukishi Hirayama (Chishû Ryû) and his wife Tomi Hirayama (Chieko Higashiyama) live with their single daughter, the teacher Kyôko (Kyôko Kagawa). They decide to travel in a long voyage by train to Tokyo to visit their children, the doctor Koichi Hirayama (Sô Yamamura) and the hairdresser Shige Kaneko (Haruko Sugimura). However, Koichi and Shige can not afford time to spend with their parents but the widow sister-in-law Noriko Hirayama (Setsuko Hara) gives attention to them and go on sightseeing through Tokyo with the old couple. Shukishi and Tomi note that their children do not have time for them and they decide to return to Onomichi. Along their trip, Tomi does not feel well and they stop in Osaka to visit their son Keizo Hirayama (Shirô Osaka). Soon each son and daughter receives a telegram from Onomichi with sad news.\n\n\"Tôkyô monogatari\" is a sad story of family indifference, selfishness and farewell directed by Yasujirô Ozu using his traditional style with a steady camera and centralized filming. This movie makes the viewer thinks about parents' seniority and children indifference and selfishness that cannot spend time with them. Makes also think how short life is and how soon the son or daughter will become the old parent that he or she neglected. My vote is seven.\n\nTitle (Brazil): \"Era Uma Vez em Tóquio\" (\"Once Upon a Time in Tokyo\")"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mel_protoss",
        "review_rating": "5",
        "review_title": "Slowww",
        "review_detailed_main": "Disclaimer: my ratings are purely personal and is only indicative on my subjective enjoyment of the film. (Even then, or perhaps even more so, I know I'm gonna be bashed for this.)\n\nEven if this 1953 greatly-hailed-classic was not black & white, I would have found it too slow to be enjoyable.\n\nThe story is simple. An aged couple visits their children in Tokyo, and then heads home. Through the narrative, the film contrasts the filial impiety of the couple's biological children with the compassion of the couple's non-blood-related, widowed daughter-in-law.\n\nCritics rave about the cinematography. I know nuts about these things so I shall reveal my ignorance no more.\n\nWhat was perhaps a bit more accessible was the layered richness of the film's portrayal of Japanese culture, which is often non-verbal, indirect and subtle. (The emphasis here is a bit; I would have been lost without the readings to analyze the film's non-explicit elements because of the high-context nature of the Japanese society.) Suffice to say that the film was only bearable because of the readings, which I did concurrently while watching the film; they explained the film's richness that gave it its 99/100 IMDb critic review."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "lqualls-dchin",
        "review_rating": "10",
        "review_title": "Considered Ozu's masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "chrischeng1",
        "review_rating": "10",
        "review_title": "Underrated as a result of being apparently overrated",
        "review_detailed_main": "I only got to watch this film for the first time ever about a month ago, as it is being rescreened at the OTHER CINEMA in London. I was told by my ex-Japanese teacher about 5 years ago back in secondary school that it was one of the most beautiful films ever made. I was only just getting into foreign cinema (i.e. anything not from Hollywood really) and wasn't sure what to expect and I wasn't willing to take the risk of being possibly bored to death with \"old classics\". I read many reviews written by the random public from websites such as IMDB, and I found too many unfavourable comments about it, so I thought I'd give it a miss... how wrong was I to conform to other peoples' opinions!\n\nI'm going to contradict myself now immediately after implying that one shouldn't conform to other people, because I am now going to say that it is a wonderful film and you should take my recommendation and watch it whenever you have a chance. Because of people like me, there will always be people that harshly criticise this masterpiece of a film, but because of these harsh words there will always be people like me who will praise it just a bit too much.\n\nAlthough in those last two paragraphs there was virtually nothing with regards to the theme and plot and acting of Tokyo Monogatari, there isn't really a need to express the overall beauty of the film, since it is a near perfect work of art from Yasujiro Ozu. His camera technique is so unique that one can immediately spot an Ozu film from a mile away. Tokyo Monogatari is that deals with family issues (Ozu's theme in all of his films), and how society messes things up so much that there is nothing that can be done to solve the problems. It leaves the viewer with a strange feeling of desperation to do something good for your parents. It may not be the most emotional and dramatic of films, but it certainly provokes a flood of emotions for the viewer to dream about in his/her sleep.\n\nI would give this a definite 10/10, and I would rate Ozu as one of the greatest directors of all time. Another two films I recommend by Ozu are FLOATING WEEDS and OHAYO."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "knowles9165",
        "review_rating": "10",
        "review_title": "Perfection",
        "review_detailed_main": "In this film Ozu explores and shows great respect for the small, private suffering in each of our lives. He does this in the most UNsentimental way, but rather, is relentlessly mindful of the details and subtlety in the process of accepting facts beyond our control. Ozu has no resistance to the truth of regret and loss. There is no manic or depressive struggle, but a slow gaze over a beautiful horizon. He takes us to an emotional sanctuary where we can observe without averting our eyes. Ozu does not try to jerk our feelings around or deliberately set out to make us cry. He does not try to dazzle us intellectually or do anything creative or new. Rather he simply shows us an idealized transformation through stages of life where we can arrive at a state of peace through acceptance of \"normal\" events. There are no bad guys or good guys here, but simple declarations about life in the most monumentally unadorned style possible. A great, great work of art. My all-time favorite."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "dromasca",
        "review_rating": "10",
        "review_title": "parents and children",
        "review_detailed_main": "Yasujirô Ozu's 'Tokyo Story' was made in 1953, the year of my birth. 67 years have passed since then, the film is the same age as me. It addresses a recurring theme of Ozu's creation - the disintegration of the family structure under the pressure of the evolution of modern society (some call it progress). It is a film about the relationships between parents and children, about caring for the elderly and caring for those who come after us, about the time we dedicate to the family, about love and loneliness. Today, when I also have in care my 90-year-old mother, when I am a father and a grandfather, this film is perfectly actual for me and talks about situations that I experienced and feelings and emotions I went through in my life, which started in the year the movie was made. At the same time, it is a film that describes more eloquently than a library of historical books the situation of Japan eight years after the end of the war that changed the course of history and reshaped the character of the nation. The characterization of \"Tokyo Story' as one of the best films ever made is not exaggerated.\n\nThe story. Shukici and Tomi Hirayama live in a remotevillage located a day train ride away from Tokyo. They are old, they have raised five children, three boys (one of whom died in the war) and two girls. Only the youngest girl remained with them, life and careers took the other away to Tokyo and Osaka. We are in 1953, people were still writing letters and sending them by mail, long distance telephone calls or telegrams were the means of rapid communication used only in emergencies. The elderly couple go on a trip to the great metropolis to visit their children and meet their grandchildren. They are received with apparent respect and Japanese ceremonial, but in reality the children (the physician son, the beautician daughter) don't have much time for them and they don't even know how and what to communicate. The differences of generations, of lifestyles and environments have their say. Shared traditions and memories are not enough to create true cohesion. Feelings exist, but the priorities of the active and busy life of the townspeople take precedence, at least until the mother's health proves to be fragile and the children will be the ones to make their way back to the village where they started their lives.\n\nOzu's style is perfectly polished in this film. The frames are fixed most of the time (only once I think, the camera moves) and the world is seen from the height of the eyes, like in paintings representing mostly indoors. Each scene becomes a refined visual composition, a setting with geometric frames in which each object adds functionality, balance, beauty. Within these frames the characters move and live, communicating with each other but also with the spectators represented by the camera. The acting interpretations are magnificent, I think I could write a whole story about each character, that much I got to know them at the end of the two hours of watching. I will mention two actors who I think are making top creations here: Chishû Ryû, the actor who accompanied Ozu throughout his career and who featured in 52 of his 54 films in the role of the father, and Setsuko Hara, the muse and Ozu's favorite actress in the final part of his career, who plays the luminous role of Noriko, the elders' daughter-in-law, and the widow of their fallen son, who turns out to be closer and more devoted to them than their true children. When the camera is taken outside (maybe about 10% of the film's duration) we get a glimpse of a Japan in transformation, a Japan after the storm, with obvious social and landscape changes, a world where family, tradition, and human feelings struggle to survive. 'Tokyo Story' is a film that is very Japanese and very universal at the same time, one of those cinematographic works that is destined for eternity both as a document and as a perennial human message."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Quinoa1984",
        "review_rating": "10",
        "review_title": "I need to see it again even after two times; a beautiful mix of simplicity, nuance, style and humility",
        "review_detailed_main": "I was shown Yasujiro Ozu's Tokyo Story- my first Ozu film- in an Art-film class some years ago, and I watched it again a couple of months ago. This has to be a truly indelible Japanese film, even to those who might dismiss it dimly as 'slow' or one where nothing happens. Actually, if you're going by traditional plot, not a lot does happen. But then again, not a lot happens on Seinfeld, either. In fact, maybe on repeat viewings, this could become the serene, Japanese tragic-comic equivalent of Seinfeld. After two viewings I get the 'jist' of the characters, their simple objectives and how they live their lives, but there's still much that can be taken in, it's hard to describe. While I'm not sure I've seen one of the ten best films ever made, as it has been for some critics and audiences, I do think it's a very unique film, one that moves in a way akin to an Italian neo-realist film, but filmed with a very particular eye that sets it apart from them.\n\nIn terms of how its characters go about in the story, it is really closer to a work of De Sica or other, as it is centrally about the importance of family, and how a family and its members through the petty parts and especially through the tragic times has to stick together. The family unit here involves a couple of grandparents (Chishu Ryu and Chieko Higashiyama, who have those funny, dependent, though truthful ways about them as elders of the common ilk) who come to visit the rest of their family, and aside from (more than any other) daughter-in-law Noriko (played in such a wonderfully every-day, compassionate way by the great Setsuko Hara), they're dealt with the 'it's the old folks again'. This is particular by their own real daughter, who seems most ungrateful for their arrival. They send them to a resort, but then something un-expected happens, which turns the situation around and ground the henpecking to an immediate halt.\n\nSome scenes still stick in my head even when I least expect them going about my days, much as the aforementioned Seinfeld episodes seem to do. I loved the gentleness in one scene where Noriko is offered a gift by the grandmother, it rings perfectly true to the everyday, but it's handled in such a way that could not have been done as well in another film. There's also a great deal of humility, with moments of amusement, when two male characters (one of them the grandfather I believe) get drunk. And throughout the film, Ozu creates impressionable compositions, setting him apart with just this film alone for me as a remarkable artist; I still remember certain shots of the houses and scapes (his specific way of shooting characters in the interiors is really neat too). In the class our teacher told us this was part of what were called 'handkerchief films' or something close to that in Japan, where audiences would bring hander-chiefs with them from crying so much during the film. I can see why; probably the best that can be said of Tokyo Story is how he pulls so much out of so little, and the interest that is always constant, even through little domestic squabble scenes, quiet moments with the elders (the old man has a look that's perfect throughout), and the more intense ones later on.\n\nIn short, it's definitely at least one of the very best Japanese films of the 1950s, in the same rank as Kurosawa's best films."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "imdbfriend",
        "review_rating": "10",
        "review_title": "Life is disappointing, but not this movie!",
        "review_detailed_main": "The film tells the story of aged parents visiting their children in Tokyo and depicts the treatment they receive from them on the visit. The beauty of the movie lies in its simplicity, be it the story itself or the storytelling style of the legendary Ozu, or the acting by the cast members who all draws a very thin line between acting/ reality and most of the time their performance are on the side of reality. It is very easy here to see the treatment of the children as they grow old towards their aging parents, yet barring few scenes we don't see children as villains but rather persons with their own family, work, and life in big city and very less time to take care of their parents. Few scenes towards the end actually clears all the air of confusion in our mind in taking children as villain and we all get to know their traits and there's nothing but hate left in us for them. Throughout the movie we also see the fine daughter-in law of these old couple and what a Good Samaritan she is treating her in laws as her own parents even after the death of her husband. Direction by Ozu is brilliant and I instantly became fan and just waiting for the opportunity to explore some other movies of this master of cinema. Overall, I would say this is one of the simplest yet powerful and best pictures of all time. The movie though more than half century old still owns significance in present time. A must see."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "zetes",
        "review_rating": "7",
        "review_title": "From the If-It's-Boring-It-Must-Be-A-Masterpiece school of filmmaking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "evanston_dad",
        "review_rating": "9",
        "review_title": "Almost Unbearably Sad",
        "review_detailed_main": "This was my introduction to Ozu, and I have to say that I thought it was at times unbearably sad, and all the more so because of its misleading simplicity.\n\nIn \"Tokyo Story,\" a mother and father make a trip to Tokyo to visit their three children and their children's families. Time, distance, and the children's busy lives have caused them to drift away from their parents; the mother and father learn that their children have become different people from those they used to know, and must face the uneasy conclusion that they may not like the people they have become.\n\nOzu has created a prototype for cinematic minimalism. The camera hardly ever moves; static shots are edited together to give the movie whatever momentum it has. This style can become admittedly frustrating; I found myself fidgeting more than once. However, it also helps give images a more profound impact than they might otherwise have, because there are few distractions. As a result, a simple shot from behind of two old people sitting on the edge of a wall watching the sea in silence becomes achingly beautiful. Ozu is able to communicate their feelings of loneliness, regret and obsoleteness without a word or strain of music. He takes the exact opposite approach from that of a filmmaker like Steven Spielberg, and it works beautifully.\n\nAnd the movie is not as simple as it appears. For underneath the story about this one family and its dynamics, there is a larger story about the changes taking place in a post-war Tokyo, and the increasing divide between generations. Shot after shot of factory chimneys, power lines, and construction sites serve to both highlight the progress of a city about to take off and the inevitability of certain traditions being left behind.\n\nYou will have to have patience with this movie, I won't lie to you about that. But I found that its subtle and haunting effects stayed with me for days after I had seen it.\n\nGrade: A"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "harry_tk_yung",
        "review_rating": "",
        "review_title": "A few observations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "henry8-3",
        "review_rating": "6",
        "review_title": "Tokyo Story",
        "review_detailed_main": "Domestic drama centred on 2 elderly parents visiting their grown up children in Tokyo where, whilst their presence is welcome, everyone is too busy to devote time with them, leaving their daughter in law (their son died years before) to be with them.\n\nIt is always difficult to watch what cineastes call one of the greatest films ever made as you're forever trying to fathom out what makes the film so amazing rather than just let it wash over you. Yes, everything is minimalist, with the shots straight on into the rooms the scenes are set in, everything is filmed without any camera movement and at knee height and between scenes director Ozu films scenery and inanimate objects to reveal heaven knows what.\n\nPutting all this genius to one side and despite the difficulty in squaring up to the very Japanese notions of behaviour and culture that seem perhaps slightly alien - everyone talks like robots, I found all this getting very much under my skin. The script seems to hit the difficulties of parents and children growing sadly but inevitably apart very accurately and the last 30 minutes or so are really quite touching particularly when the father thanks his daughter in law for her help. I'm sure this is a genuine masterpiece for many, but for me it was just a sweet, well told tale of parents and children. Forget it's greatness and just enjoy."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "basilisksamuk",
        "review_rating": "1",
        "review_title": "Stunningly Dull",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "quinimdb",
        "review_rating": "10",
        "review_title": "Tokyo Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "joshuafagan-64214",
        "review_rating": "10",
        "review_title": "Gloriously Flawless",
        "review_detailed_main": "This may not be my favorite movie of all time. This may not be the best movie of all time. But this is the most perfect movie of all time.\n\nIt's complex yet simple. It's easily understandable, yet every viewing yields something new. It stands in the past and looks at the future. Or maybe, it stands in the future and looks towards the past. It is the most Japanese of all the great Japanese films. It is a film that is still remembered after sixty-three years. It is a film that will still be remembered after sixty-three more.\n\nIt is, in my opinion, the greatest non-English language live action film of all time.\n\nThis is Tokyo Story.\n\nI recommend that everyone watch this movie. But there are some things you should do first. Watch some Kurosawa films. Watch some Ghibli films. Read up on the culture of Japan. Learn what a pillow shot is. Then come back and pop in this flick.\n\nThere are stories that translate across cultures and generations. This is where the Hero's Journey and the Monomyth come from. But there are also stories that are specifically tied to one culture or another, that are engrained in that culture for all they are worth. One can watch them without knowing anything about their culture of origin, but the experience is... lessened.\n\nThis is one of those stories.\n\nThe plot is basic. An elderly couple comes to visit their kids in Tokyo, but their kids are too busy, and send their parents to a bathhouse. At its basis, this could be construed as your basic 'take care of your elders' story. But that is not doing the story justice. That is like calling LotR a basic 'kill the evil guys trying to take over the world' story.\n\nThese characters are so complex, but their complexities do not get in the way of emotional power. At the end of the movie, after a potent climax, the characters gather together, and you feel for every single one of them. That is impressive.\n\nAnd that is just the tip of the iceberg. There are so many little intricacies to be loved about this movie. This is cinematic poetry in every meaning of that term. There are movies- movies I like and respect- where I say to myself, \"I could do better than that.\" I never once thought that when watching this movie. The dichotomy between simplicity and complexity is shown even in the title of the movie. Tokyo Story is about the simplest possible title anyone could think of for this movie. It is like naming a song ___ Song. But it is also deep. Tokyo is one of the most storied cities of all time, and at the time of this movie's release, it was just starting to recover from the massive firebombing campaign the United States waged on it in the closing days of World War II.\n\nI think of this title like a fancy door. On the surface, it is simple and functional. And if that is all someone wants to take out of it, so be it. But if one looks deeper, they can see a whole new level of symbolism and detail.\n\nRemember when I said to look up what a 'pillow shot' is. There's a reason for that. Ozu uses these to great effect, giving the audience a chance to breath and compose themselves. It is a very Japanese way of doing things. I'd love to see what would happen if pillow shots were included in their next mainstream blockbuster. But I doubt that anyone who is interested in this movie in the first place would be put off by its Japan-ness.\n\nTypically, I don't talk about the use of restraint in film- it is important, integral even but no one comes to see a film because of its effective use of restraint- but I must make an exception for this film. This is a film requiring perfect balance in every respect. If one side or viewpoint became too overpowering, the movie would no longer be one of the greatest movies of all time. It would be simply great. Vast oceans of restraint are needed at every turn. Good thing the director is Ozu.\n\nBut even with all its perfections, I would not love this film nearly as much as I do if not for how much I love who the characters become and what they have to say. They do not just feel alive. They feel importantly alive. The best example of this comes when three aging businessmen sit at a bar and talk about their children. In some movies, this would be a cheap throwaway joke. In others, it would a cheap attempt at melodrama. But in this movie, it results in one of the most profound discussions I've ever heard in a movie. I was awestruck.\n\nThat is the second-best scene in the movie, at least in my opinion. The best comes at the very end of the movie. I won't spoil it, but no one who watches this movie closely is unaffected by it. It captures the tone of this movie as perfectly as any scene can capture the tone of any movie.\n\nMelancholy without being depressing, insightful without being preachy, fascinating without needing to be flashy, this is one of the greatest pieces of mature, adult, thoughtful art that has ever been produced."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "spoilsbury_toast_girl",
        "review_rating": "",
        "review_title": "On the Way",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "planktonrules",
        "review_rating": "8",
        "review_title": "exceptionally crafted but depressing",
        "review_detailed_main": "This is a marvelous movie with exceptional acting throughout. However, it is also INCREDIBLY bleak and sad, so be forewarned!!! The story begins with an older Japanese couple (grandma and grandpa) packing to go to Tokyo to see their grown son, daughter and daughter-in-law (whose husband, their 2nd son, was killed in the war). However, despite their letting everyone know they were coming, they are treated as inconveniences. The only one who showed them any consideration was the daughter-in-law. Particularly disgusting was their daughter, who ALWAYS told her husband to spend LESS on her parents, as they wouldn't know any better. Lovely kids, huh?! Anyways, after spending their time in Tokyo, they return to their hometown and grandma becomes deathly ill. You can probably guess where this is going. Despite all this, the grandparents continually say they've got good kids, even though they seem like selfish jerks."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "lasttimeisaw",
        "review_rating": "9",
        "review_title": "My first Ozu's masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Movie-ManDan",
        "review_rating": "10",
        "review_title": "Prepare to Get Misty-Eyed.",
        "review_detailed_main": "In terms of a technological standpoint, \"Tokyo Story\" was both innovative and simplistic. The director broke the 180 degree rule, the camera just about never moves, and it is always either at eye level or on the ground. I personally don't care about the technology that went into this creation. Not because it was an easy task, but because the story and actors are the prime focus which leaves the camera work a secondary thought.\n\nYasujiro Ozu is known for creating simple tales with huge results. His 1953 loose remake of Leo McCarey's \"Make Way For Tomorrow\" is his hottest film as well as the one with the biggest emotional impact. Fun fact about the original: Orson Welles once told Peter Bogdanovich that \"Make Way For Tomorrow\" could make a rock cry. Believe it or not, the Japanese remake is way more emotional.\n\nThe basic premise of \"Tokyo Story\" is pretty simple: an elderly couple travel to suburban Tokyo to spend time with their successful kids and grandchildren, but their kids had very little time for them. Now this is the story in a nutshell. Things do happen, but people like to say the story in its simplest form to reflect the simplicity of its creation. I mentioned how easy the camera work was, but the development of the characters are anything but.\n\nThe couple have been married for years and they have five children, four of who are still living. Their youngest is a teacher who still lives with them and the rest are in Tokyo. Their oldest son is a doctor who gets called a lot. There's a scene where they plan on going site-seeing but they must be scrapped when he is called for a patient. This is the first indicator of the little time to be spent and it already is heartbreaking. They don't want to be an inconvenience and they are proud that their kids are so successful. But we can tell they are disappointed in being second fiddle.\n\nA little while later, his wife falls ill. The kids need to know how selfish they were being, even if they couldn't help it. The movie is often divided into two parts with the visit and the illness. Both are sad and both build so perfectly.\n\nThe main reason I don't want to dive deep into the story and really dissect it all is not because of the difficulties of the names, I just think the best thing to do is to watch the movie for yourself and experience an all time great.\n\nUnlike \"Hereditary,\" \"Roma,\" or \"Portrait of a Lady on Fire,\" this is a slow-burner that is actually good and isn't slow just because. The story keeps moving and we keep getting to know the characters better. The movie is 136 minutes, but I was loving this so much I wanted it to go even longer. The gradual builds really immerse the viewer. And it is next to impossible to not feel throughout the film. Only the strongest of emotions are elicited.\n\n4/4"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "SnoopyStyle",
        "review_rating": "7",
        "review_title": "slow but mesmerizing",
        "review_detailed_main": "Elderly couple Shūkichi and Tomi Hirayama go to Tokyo to visit their children and their families. Their oldest son Kōichi has a family of four. Shige is married and runs a hair salon. Both of them are extremely busy and pay for expensive trips for their parents. Their daughter-in-law Noriko is widowed after the war. She is the most caring but mother Tomi notes a loneliness in Noriko's life. However Noriko is not feeling well.\n\nThere is a quietness and stillness about the camera style. The characters sometimes talk directly into the camera which can be distracting. It's a naturalistic feel. These people feel real and their emotions have depth. It's a slow movie but it doesn't feel boring. It's kind of mesmerizing like watching a real family."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "lyrxsf",
        "review_rating": "9",
        "review_title": "Genius in its simplicity",
        "review_detailed_main": "Tokyo Story is not Tokyo's story. It is the story of ageing, old age and letting go. The director's genius is in how he uses the media of film to narrate life, without diluting or manipulating it. Life is depicted as is. The movie has a slow start and the first half an hour goes by without really making much of an impression. It shows daily life – chop wood, fetch water – an old couple visiting their children in big city. Everyone has busy lives, though of course, busy is how one chooses to be. Time goes where one wants it go. At the surface, the grown-up children are concerned, but it remains at the surface. There's contrasting dialog where one person says \"you can serve your parents only till the grave\" and another says \"children have their own needs\". There's really no wrong or right. Its what is. For the mother, getting the chance to sleep in the bed of her long assumed-dead son was bigger than being shown around Tokyo city. Priorities are different and keep changing. Life has a unique way of tying different threads together. Sometime, they are left untied. There's comment on how clothes take centerstage instead of the lived/shared experience. Sense of consumption and objectifying life takes away from the deeper connection and being with the experience of living life. The daughter-in-law inherits the goodwill, while the daughter takes the goods. The movie reflects on the isolation and increasing loneliness of ageing. It ends with a sense of loss, stillness and depth – all signifying old age."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "cherold",
        "review_rating": "6",
        "review_title": "Slice of life, for those who like that sort of thing",
        "review_detailed_main": "When I was young, my reaction to film \"classics\" that I didn't like was that other people were simply wrong, but since that time I have come to understand that movies speak to people in very different ways.\n\nThis movie is one I cannot connect with.\n\nIn Tokyo Story, an elderly couple come to Tokyo to visit their children, who are too busy to spend much time with them. This dynamic plays out at a glacial pace. About a third of the way through the movie I came to believe it would be entirely plot less, and while it's not quite that, it is definitely got a lot more \"Tokyo\" in it than \"Story.\"\n\nWhile the old people are very genial and pleasant, I didn't find their \"story\" that interesting. The movie did become more engrossing and affecting in its final third, but not enough to make up for the tedium of the first two thirds.\n\nThe main reason I watched this movie was to see the brilliant Setsuko Hara, whose mesmerizing performance in Late Spring (also directed by Ozu) was most of the reason to watch it. She's very good here, but she's also got a pretty small part, which was very disappointing to me.\n\nHaving seen two Ozu \"classics\" I'm thinking he's one of these highly admired film directors, like Godard or Jarmusch, whose appeal I find puzzling.\n\nTokyo Story has been ranked by some as the greatest film ever made, but in a world of films like Rashomon, The Third Man, Citizen Kane, and Spirited Away, it's a label I cannot understand being placed on this particular movie."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ajoyce1va",
        "review_rating": "3",
        "review_title": "With one exception, much like an episode of Seinfeld",
        "review_detailed_main": "The difference, of course, is that while both are about nothing, Seinfeld episodes are funny. Somebody did find the scene of the three old men getting drunk to be humorous, but I'm confounded if I see it that part as anything but maudlin and pathetic.\n\nMy family and I lived for four years in Japan, and learned to speak some and read enough to follow street signs, at least. Some of the most striking things about this movie for me were the views of Tokyo and the infrastructure. How did they manage to rebuild their factories to rebuild their train system, only eight years after the end of the war?\n\nI gather that the Japanese of the 1950's were not a great deal like the Japanese I knew in the 80's, although the connections across three decades were visible. The Japanese women of my neighborhood were a lot more like Noriko than Shige. The older men I knew reminded me of the father -- self absorbed and uninterested in the women around them. Did you notice the way the father behaves at Atami? When he and the mother sit on the causeway and decide to go back home to Onomichi, she stands up but feels dizzy. He basically tells her to shake it off and walks on, not even looking back to see how she is. Again, after the funeral, a neighbor asks how he's doing and he talks a bit about his days will seem long without the mother's company. It's all about him, right?\n\nReviewers notice how Noriko, the widow of a son killed in the war, is the only one who shows any compassion and interest in the parents, her in-laws. This is matched by the fact that none of the rest of the family, all of whom seem relatively successful, have any real interest in her. They have reasonably decent houses while she lives in a crappy apartment building with shared kitchen and bath facilities.\n\nOverall, I found the Japanese I knew in the 1980's to be easy to like, hard to love. With that I experience, I watched Tokyo Story and found it hard to like, hard to maintain any interest, and hard to care about. All the commentaries above that go on about how universal this film is are deluding themselves. Likewise, all the commentary about how this is one of the greatest films of all time are not comparing it to Kurosawa's best work, which totally blow this boring soap opera away.\n\nAnyway, I rate it a three -- not totally awful -- but would never spend another 2 hours and 15 minutes of my life watching it again."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "clockworkorange1984",
        "review_rating": "9",
        "review_title": "The Compelling Nature of Capturing Life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "nickenchuggets",
        "review_rating": "9",
        "review_title": "Family is all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jordondave-28085",
        "review_rating": "10",
        "review_title": "Untimely",
        "review_detailed_main": "(1953) Tokyo Story/Tôkyô monogatari (In Japanese with English subtitles) DRAMA/ SOCIAL COMMENTARY\n\nCo-written and directed by Yasujirô Ozu focusing on a particular situation anyone can relate depicting a time if parents ever felt unwanted by their already grown up children and their families. Two elders, Shukishi Hirayama (film veteran Chishû Ryû) and his wife Tomi Hirayama (Chieko Higashiyama) visiting Tokyo to see their already married son and daughter and their grandchildren. But upon their visit saw them as a burden to their busy lives even after not seeing each other for a very long time. It's realistically poignantly portrayed despite the time and setting."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "BottleGourdPlant",
        "review_rating": "",
        "review_title": "Style in TOKYO STORY",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "fa-oy",
        "review_rating": "10",
        "review_title": "Ozu's best film",
        "review_detailed_main": "One of my favorite films from Ozu, and it probably deserves to be on the top of my favorite Japanese film list. This is, in my opinion, one of his most accessible efforts, although you have to be at least used to Japanese or classic cinema in order to fully appreciate it, otherwise it is more likely that you'll find yourself not caring much about what's happening, on account of Ozu's pacing style.\n\nWithout any doubt, this film has to be one of Ozu's most complete works, it contains every single technique and theme he's widely recognized for. I also find the music sounding throughout some parts of the film really beautiful and catchy, which doesn't mean I'm giving less praise to other tunes in many of his other films (they are individually amazing), but this has just been the one I find more fitting concerning the story, and definitely the one I've most liked as well.\n\nThe acting is at its finest, everyone fits their roll perfectly (it was hilarious watching Chishu Ryu impersonating a drunk and somewhat disappointed father).\n\nTo conclude this review, I know I might probably not be adding anything relevant or new to this film (I'm aware there are more extensive and better explained reviews here), but I just wanted to make one for such a riveting and fascinating movie that's deserving of all the praise it gets.\n\nMy score: 10/10"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "khanbaliq2",
        "review_rating": "10",
        "review_title": "Tokyo Story is widely considered both the best film of Yasujiro Ozu's long career and among the finest films ever made.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Cosmoeticadotcom",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "thevisitor967-526-781026",
        "review_rating": "6",
        "review_title": "Not that great.",
        "review_detailed_main": "I thought TOKYO STORY was OK but nothing to write home about. It was not that great. Besides lacking character development, I just felt this film needed a plot! It just didn't seem to go anywhere until the parents left Tokyo. And even then it didn't seem like much of a climax.\n\nI really don't understand what is so great about TOKYO STORY. IMO Ozu made much better films. My personal favorite is THE ONLY SON with THERE WAS A FATHER a close second. Those films had two-dimensional characters. Those films had a plot. Those films had a theme. I mean, that scene in THE ONLY SON where the mother told her son that she had to sell her house to pay for his education was incredible. That whole scene was incredible with the son explaining to his mother how hard it was to find a decent job in Tokyo.\n\nSo, yes, Ozu made some great films but IMO TOKYO STORY is not one of them. IMO the greatest Japanese films are THE ONLY SON, IKIRU, RAN, TAMPOPO, THE EEL, THE TWILIGHT SAMURAI, STILL WALKING, NOBODY KNOWS."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "bandw",
        "review_rating": "8",
        "review_title": "Prototypical Ozu",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "bfinn",
        "review_rating": "7",
        "review_title": "Good, but no masterpiece",
        "review_detailed_main": "This likable film has a simple story of a nice elderly couple who go to visit their daughter and son-in-law in Tokyo, but are made to feel somewhat unwelcome.\n\nThis cold-shouldering is somewhat laid on with a trowel throughout, as for example when the daughter tells an enquirer that her parents are just some visiting 'friends from the country'. It was also left strangely unclear (to me at least) just why the daughter was so unwelcoming to her parents - strange since this appeared to be the central theme of the film.\n\nNonetheless this was generally a pretty good film, and well-acted, particularly by the charming grandparents.\n\nI am however baffled as to why this has gained the reputation of being one of the greatest films ever made, frequently appearing in critics' top 10 favourite movies. After much thought, though, I have a tentative explanation:\n\nFirstly, it's a foreign language film, hence clearly an example of High Art.\n\nSecondly, it's black-and-white and somewhat flickery - this means it must be vintage, a veritable Classic in fact.\n\nAnd lastly, unlike most flickery black-and-white films, it's reasonably watchable. Hence this must be something quite out of the ordinary - not merely a High Art Classic, but surely a genuine Masterpiece. One of the Greatest Films Ever Made, no less. Yup, that sounds about right."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mutilator-88156",
        "review_rating": "4",
        "review_title": "Godzilla was created in response to this movie",
        "review_detailed_main": "Okay, maybe not. But surely the accusations of an being uneventful, plodding movie are right, and that's a bit unfair. Japan at the time had a weird genre of realistic slow moving dramas so by design the movie is paced like this. To give the benefit of doubt to Ozu, he mastered this type movie, but in other hand, it seems that he was stuck in his old ways of filmmaking. It's hard to judge this movie out of its historical context, it's a successful movie on its own time and place. But having watched Late Spring (1949) an equally placid but more rewarding movie, Tokyo Story fails in comparison by trying to juggle too many characters for even less storytelling. Even Setsuko Hara is barely on screen despite being Ozu's muse and main draw for audiences. Not recommended."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "lobiani",
        "review_rating": "",
        "review_title": "Masterpiece of Japanese Film Culture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Andy-296",
        "review_rating": "10",
        "review_title": "One of the best movies ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Polaris_DiB",
        "review_rating": "10",
        "review_title": "Very peaceful and alluring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Koundinya",
        "review_rating": "10",
        "review_title": "A ubiquitous story!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "FilmSnobby",
        "review_rating": "9",
        "review_title": "Ozu's greatest soap opera.",
        "review_detailed_main": "Yasujiro Ozu has been called \"the most Japanese of Japanese directors\". That's doubtless correct, insofar as the director is insistent upon an adherence to a rigid form in his directing style. One doesn't have to be a cultural anthropologist to glean the Japanese concern with traditional motifs and the patient perfecting of a given aesthetic.\n\nBut I'm guessing that this is not so true of today's Japan, and I'm also guessing that, deep-down, many critics and audiences over there right now probably find Ozu insufferably old-fashioned. One wonders if the exulting of Ozu is a dig from cultural snobs toward Akira Kurosawa, who dared to base his movies on pulpy American detective novels and John Ford Westerns. In any case, it's important to point out that Ozu's directing style is rather his own style, not some sort of \"traditional\" Japanese style. This is what should be celebrated about Ozu. He's an original artist, over and above being a \"Japanese artist\". And his greatest film, *Tokyo Story*, is only \"Japanese\" in its particulars. After all, elderly parents being ignored by their busy grown-up children are not exclusive to Japan.\n\nThat famous style consists of no panning with the camera, and keeping the camera at just above floor level. The static mise-en-scene is broken up with cuts of close-ups in which the actors speak directly to the camera, as if the camera has taken the POV of the listener. Occasionally, in the case of *Tokyo Story*, there are exterior shots of Tokyo itself, jackhammering busily away under the Marshall Plan. (The movie is set several years after World War II.) Ozu's martinet control of both composition and the actors -- all of whom are tightly reined in by stylized performances -- is actually a benefit to the story, which is really nothing more than a weepy soap opera, let's face it. The manner in which the carefully written dialogue and the overall formal restraint of the piece overcomes the melodramatic tendencies of the script is really quite astonishing -- it's art of the most difficult kind. Put it this way: imagining this movie redone in America will give one a sense of deep appreciation for both Ozu's microscopic control and for the foreign setting itself.\n\nThe movie is generous to its characters, despite all the outward restraints. We're not meant to hate the adult children, who are only too willing to shuttle off their aging parents to a \"spa\" that turns out to be little better than a bordello for decadent young hipsters. Ozu ruefully shows us how the War had turned a whole generation of young Japanese into calloused survivors so consumed with rebuilding and then maintaining a semblance of normal life that there's no time or room for traditional family values anymore -- indeed, no time or room for extended family, period. We're meant to sympathize with these characters, as they struggle under the new realities of post-War Japan. And even deeper than this, Ozu has something to say about the heartlessness of Time: Life Goes On, and whole generations come and go and are promptly forgotten. \"Life is disappointing,\" one character exclaims.\n\nIt can be argued that if you've seen one Ozu film, then you've seen them all. (Well, I can argue that, at least. Sorry, but I prefer the variety of Kurosawa.) In that case, *Tokyo Story* is the Ozu film you must see. I grant that the director's platitudinizing may make you feel that you should give your mother a call . . . but is that such a bad thing?"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "kurosawakira",
        "review_rating": "10",
        "review_title": "The Tatami",
        "review_detailed_main": "This is so perfect it makes the hair on the back of my neck bristle thinking the film was nearly lost right after its completion in a fire at the Yokohama lab! (What we have nowadays doesn't come from a master negative but from dupes)\n\nIf you've seen your share of Ozu, you know the modus operandi: the stories recur from one movie to the other, similar shots, same actors, even the same names for characters. And predominantly, the same radical way of seeing the world: the multi-layered, meditative, agile (despite being stationary!) and deeply dimensional eye that pierces simultaneously through multiple rooms; characters are positioned to the frame just like any other object, conversing with each other and also with the surrounding space. Much of this sense of space comes from Ozu shooting low, close to the tatami, meaning that the ceilings are often visible.\n\nThe story is never extraneous, nor is it melodramatic. The undertow of loss is ever as poignant here, a complete antipode to the light family banter in its two predecessors in the \"Noriko\" trilogy. We've waded warm and pleasant waters so far, even when considering there's been departure. The word \"you'll get better\" will break your heart, as will \"I'd have been kinder to her\" delivered with apparent fake cheer by the surviving widow. This will make one think of one's own parents, and if you're married, your own wife and children. What a gift we've been given in them!\n\nIt will always remain a mystery why Hara's character in all the three films is named Noriko — not the same Noriko, but still obviously a central element and a link between the three. There are other curiosities: the young children in \"Bakushû\" (1951) are named Minoru and Isamu, just as they are in this film. Minoru is actually played by the same boy, Murase Zen.\n\nThe music is brilliant, and the main theme is one of the greatest in film history."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "gavin6942",
        "review_rating": "8",
        "review_title": "One of the Best Japanese Films Ever",
        "review_detailed_main": "An old couple visit their children and grandchildren in the city; but the children have little time for them.\n\nLike all of Ozu's sound films, \"Tokyo Story\" has a pacing that is slow, yet has a rhythm which made Ozu's film a popular entertainment in Japan. Important events are often not shown on screen, only being revealed later through dialogue. For example, the train journeys to and from Tokyo are not depicted. A distinctive camera style is used, in which the camera height is low and almost never moves; film critic Roger Ebert notes that the camera moves once in the film, which is \"more than usual\" for an Ozu film.\n\nThis is a very beautiful film, and the title is perfect, as it captures the city of Tokyo in all its 1950s beauty. From the point of view of Americans, this is especially fascinating, as it is less than a decade after Japan was our primary target. Look at all the beauty we could have destroyed."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "shanayneigh",
        "review_rating": "6",
        "review_title": "Life sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "idrake-drone",
        "review_rating": "9",
        "review_title": "Brilliant (with a footnote for modern audiences)",
        "review_detailed_main": "A beautifully crafted film atop a subtle but engaging family drama. The cinematography is compositionally dense, owing much to the aspect ratio, the shapes and forms of traditional Japanese interiors and the lower camera position which emphasizes the vertical and horizontal lines. The story itself is traditional, simple, linear, slowly developing and without pronounced acts/climaxes. This has the effect of keeping you engaged evenly throughout. The performances are, however, worth mentioning to modern viewers. I personally enjoyed it, but there is a \"stagey-ness\" to some of the acting. It can't be ignored. I couldn't quite decipher if that was an accurate rendering of traditional Japanese social formalities, a directorial stylistic choice, or just a feature of films of that time period. If you can overlook or even appreciate that, it's really a brilliant film."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "hendricksonjp1",
        "review_rating": "6",
        "review_title": "Interesting, but lacked depth",
        "review_detailed_main": "The Tokyo Story was certainly an interesting movie about the invasion of Western culture into Japan's most solemnly kept family traditions. However, there were many problems. The characters were essentially one dimensional and were obviously employed by the director as a means to establish his political and social views, rather than for the purpose of development. The movie was essentially anti-American propaganda depicting the woes of Western civilization. Furthermore, this movie was about an hour too long. It had an overwhelming number of screen-shots of either smokestacks or nature scenes (west vs. east), and the smokestacks seemed inherently evil and very ominousing. The screenwriter director this movie which means that he probably just didn't want to cut anything. I saw a distinct and very characteristic arrogance in the director which was very distasteful. I enjoyed this movie somewhat, but by the end I just couldn't wait for it to be over. Interesting, but time-consuming."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "International_Bright_Old_Thing",
        "review_rating": "4",
        "review_title": "State the obvious, film it badly, await praise",
        "review_detailed_main": "The '1001 Movies To See Before You Die' book says the inattentive might think Tokyo Story is banal - that is EXACTLY the Emperor's New Clothes argument - if you can't see how great it is, you must be an idiot. Do not be fooled.\n\nWhen I was younger I had an old-style camera in which the viewfinder was not connected to the lens, so you had to make your own adjustment to get the framing right. At a party, where alcohol may have been involved, I got it wrong and got a set of stills of heads and shoulders but mostly ceilings... Ozu's early films had some variety and movement but by the time he got to this, his films looked like my bad set of photos - still, with too much ceiling. Basically he'd given up trying and just parked the camera at a height he could sit down and pointed it up at his actors.\n\nAs for the plot, it takes over two hours to say that middle-aged people are busy and old people are lonely. If that's such a revelation that you really need it explained to you at length, go ahead and watch it. Otherwise, you could make better use of your time, like stare at a painting for two hours - it'll be more colourful, lively and better-framed."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "tieman64",
        "review_rating": "",
        "review_title": "Honor thy father and thy mother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "FedRev",
        "review_rating": "10",
        "review_title": "An examination of family in a rapidly changing world",
        "review_detailed_main": "Tokyo Story is a film that is at once simple and complex. It's an intimate family drama, but it also has an epic quality. It appears larger than it is, and its story takes on a wider scope than is literally presented on screen. It's a film about family in the context of a rapidly changing society, the relationship between generations, and the bonds forged over lifetimes that hold people together. The story takes place in post-war Japan as an aging married couple decide to leave their small town to visit their adult children in Tokyo. Once they get there, their kids barely have time for them and struggle to keep them occupied as they juggle their professional lives, daily routines, and their own children. It's a film about the cycle of life and changing perspectives. It's about the future and the past, hope and regret. And it's ultimately a film about our mortality as human beings and the importance of the time we have. Tokyo Story is a beautiful film, shot using Ozu's signature low, motionless camera angles that lull the audience into the slow rhythm of the film. This is the definition of a timeless classic, as the themes presented in this masterpiece will remain relevant generation after generation."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Artimidor",
        "review_rating": "10",
        "review_title": "About things said and unsaid and everything in between - a story about life itself",
        "review_detailed_main": "Yasujiro Ozu's Tokyo Story is a very simple narration where nothing really spectacular happens that couldn't happen in anyone else's life. What takes place in the film is just life itself. It's about the not uncommon difficulties of generations that have to deal with each other, where natural gaps arise after the children have moved away from their parents and each family member is living a different life now - all things we might have experienced ourselves in a similar fashion from the one or the other side, or even from both. Everybody tries his/her best in their own kind of way when it comes to a visit. One means well, stays polite, but the lives the family members lead are their own now. While the parents don't want to impose on their children, the children are fine when their parents are on their way again so that things take their regular course to which they are used to. But in between many things are left unsaid. \"Tokyo Story\" shows us in its realistic depiction of a Japanese family that only when something major happens which stirs the daily routines and challenges our outlook we become aware of what's important and where our allegiances really lie.\n\nOzu's unobtrusive direction is what makes this film so touching and powerful. He stays true to life and just shows us what's happening, doesn't judge, and typical of Ozu decides to refrain from camera movements altogether throughout the film which strengthens the impression that this is just how things happen out there. \"Tokyo Story\" is a quiet and contemplative work and the actors seem to be taken right from reality. That's why this simple story has such an impact and ranks as one of the greatest - it hits close to home, where it resonates deeply."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "thesouthfamily2-552-707097",
        "review_rating": "9",
        "review_title": "Isn't life disappointing?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ath_steph_3000",
        "review_rating": "9",
        "review_title": "Ozu's poetic masterpiece",
        "review_detailed_main": "\"Tokyo Story\" is one of Ozu's poetic masterpieces. It is the story of a journey - of an older couple visiting their relatives in the bustling metropolis of Tokyo in the 1950s, the journey of the coming of age, and finally, the journey of life itself. With his touching images, Ozu manages to capture the spirit of a simple Japanese family's household but also the unsaid conflict and tension that can never really evacuate because of a cultural taboo. \"Tokyo Story\" is a wonderful narrative which contrasts tradition and modernity and the abrupt changes life brings. The perspective of the film shots is remarkable, as we can see the actors sitting or lying on the floor most of the time - this approach allows the viewer greater access to the more intimate spheres of a Japanese house while the dialogs reveal strong emotions. The film, despite its very modest storyline, will not leave anybody untouched because the impressions in it are very intense and unique."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "pere-25366",
        "review_rating": "10",
        "review_title": "Ozu has created a quietly brilliant and timeless masterpiece with this minimalist piece of filmmaking",
        "review_detailed_main": "It's films like Yasujirō Ozu's 'Tokyo Story' that transcend the idea of a movie and enter the realm of art in its most pure and provoking form. Often considered the greatest achievement by a directed who constantly challenged his audience with pensive and realistic material, 'Tokyo Story' is a heartbreaking look at the passage of time and the gradual estrangement that unfolds between two parents and their absentee children.\n\nThe realism of the film is undeniable, much of which stems from Ozu's long series of pillow shots seen throughout the film. These shots are cutaways, for no obvious narrative reason, that serve to add that extra depth and sentiment by letting the natural landscape and surrounding themes sink in that much more. Many of Ozu's pillow shots convey darkness or the transience of family memories and, by letting these shots linger on for several seconds, his narrative is quietly telling us that the flow of the world around them continues to truck along.\n\nThese shots are as enigmatic as the feelings of the characters we come to know in the film, saying one thing but doing so with faces that would suggest a hidden subtext. At the film's most heartbreaking moments, we struggle to understand exactly HOW they feel though it's clear to us that their suffering exists - but to what end? Truly one of the most beautifully crafted creations to come out of Japanese cinema and even cinema in general. This film is a masterpiece in every sense of the word."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Dan_Quixote",
        "review_rating": "10",
        "review_title": "Just brilliant, brilliant stuff.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "JoeytheBrit",
        "review_rating": "7",
        "review_title": "Tokyo Story review",
        "review_detailed_main": "Another clinical dissection of familial relationships performed with a deceptive tranquility by Japanese giant Yasujirô Ozu. It starts slowly but grows increasingly absorbing as you get to know the characters. The breaking of hearts is concealed behind endless gracious smiles. One of those films that is relevant to everyone, regardless of the era and location in which it is set."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "coop-16",
        "review_rating": "10",
        "review_title": "Heart rending masterpiece.",
        "review_detailed_main": "Tokyo Story has long been one of the films I wanted to see, but never had a chance to see.Having finally seen it(on a slightly flawed videotape,instead of the Laserdisc it deserves )I will unequivocally state that it is one of the masterpieces of the cinema. Iam a Catholic, not a Buddhist, so I disagree with the films implied metaphysic. Having said that, I will go on and say that this is still one of the most moving films ever made. I once wrote, in a review of another film about the aged, Make Way For Tomorrow, that it could make a stone cry..the same is true of this movie. Chiso Ryu delivers one of the greatest screen performances.In fact, everyone in this film is pitch perfect...According to Scorsese, John Ford once said that the most remarkable thing you can photograph is a human face..this film is rich in human faces . As Ive said of a very few films, this is an \"eleven\""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mollytinkers",
        "review_rating": "7",
        "review_title": "Spiritually deflating",
        "review_detailed_main": "Not a masterpiece. Overlong. Brilliantly acted, directed, photographed, and scored.\n\nSurprisingly topical. How many decades now have sons and daughters relocated miles and miles and miles away from their family? When was the last time you had a family reunion?\n\nThere are unnecessary, boring segments; but that's the director's fault. Stellar filmmaking, however self-indulgent it may be."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "milanis",
        "review_rating": "2",
        "review_title": "Unbelievably slow and boring",
        "review_detailed_main": "Even though I accept the differences in movie eras and/or directing ways, this movie is far overrated. Namely because not all dull things can be described as artistic. The movie reflects on a rather universal topic - kids drifting apart from their parents, which become quite a nuisance to them. It's a story told many times, due to its universality, since everybody can find themselves in any side of the story - whether as kids or the parents. It's also nice to reflect upon yourself, comparing to the characters and the story line, drawing comparisons to your respective everyday lives and people. However, this movie gives opportunity for neither of those. The thing that struck me the most is lack of emotion throughout the movie, and even where reflected, it is so indescribably fake and hard-to-believe. Of course, I don't mean to be disrespectful, especially acknowledging the difference in emotion expression in western and eastern Asian culture. However, this is not the case, especially comparing to other Japanese movies from this era. To sum up, a complete waste of time, you can invest in some other movie, which would not make you think that you should not even watch black-and-white movies any more."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "bob-790-196018",
        "review_rating": "10",
        "review_title": "A Masterpiece, Ultimately Deeply Moving",
        "review_detailed_main": "Only a handful of other movies over a century of movie-making have achieved anything like the perfection of Ozu's \"Tokyo Story.\" The parents are products of a time and place and culture so different from mine, yet I instantly felt a kinship, instantly saw myself and my wife after our many years of marriage, the children grown, not everything in life turning out the way we had hoped, yet the persistence of bonds that are more than just the habits of years.\n\nLife is ultimately disappointing, as the two women agree toward the close of the film. People grow old, people get sick, children drift away, times change and eventually we no longer keep up, war and other calamities upend our lives and bring heartbreak and loss. Disappointing? Of course.\n\nBut then there is Noriko, the daughter in law--sweet and lovely and kind. There is the great heart and gentle nature of the mother. There is the ultimately strong feeling of the father for his wife (conveyed in a beautifully restrained performance). There are children--some of them downright unlikeable--who populate the background of this film and serve as a reminder of life continuing. They too will have their disappointment, but still.... Hope simply won't go away.\n\nOzu shows it all without moralizing, without flourishes or crescendos, without attempting to make some \"point\" that helps us to make sense of it all. He presents his characters non-judgmentally, with real characteristics that make them understandable.\n\nIt is Ozu's rich humanism that makes the film so sad. It is a story that for all of its quietness, has the power of great tragedy."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jdoan-4",
        "review_rating": "10",
        "review_title": "What can film do for you?",
        "review_detailed_main": "Some people say some films change the way they think about life. That has never happened to me. This film, however, did incite me to think about my life. It made me think about the relationship I have with my parents. It made me think about the relationship I have with my kids. It made me think about where those relationships will be in 20 years. One of the reasons this film is so great is that, like all great films, it touches on aspects of humanity we encounter everyday. And this film does it as well as any other. Ozu's direction is nearly perfect. Every aspect of the film is profoundly effective. I thought the cinematography was simple, yet intricate. The acting was superb. Every actor hit every note dead on. I especially found the parent's to be very compelling. The dialog was direct and very honest. So many times, we say one thing in order to not say the main thing. This film affected me more than most others I have seen."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "El_",
        "review_rating": "10",
        "review_title": "A literally must see!",
        "review_detailed_main": "A simple movie without any emotion's forcing, any struggling to be dramatic or too much sentimentalism, notwithstanding all these lacks, its hint is so strong. It does this so well that I was near tears in the last 30 minutes. There is two journey on \"Tokyo\"; one which parents come to their children and another where their children come to them. The similarity between these two journey is hopefulness, which by doing so, turns into chilling. The old couple hope to being greeted, but except by Noriko they get evaded. in second journey the children -although superficially- hope that their mother being OK, however all of them -again except Noriko- think about and get ready for her death. I vividly feel the loneliness of Shukichi and Noriko on that great scene where Noriko insists on her selfishness; an innocent confession mixing up with a painful grief. Yes,\"Tokyo Story\" is a great movie without any pretense."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "hubertguillaud",
        "review_rating": "10",
        "review_title": "Sublime",
        "review_detailed_main": "Voyage à Tokyo succeeds in bringing together both modernity and Japaneseness in a family portrait of universal simplicity. A reflection on time, on family love and its pitfalls in a staging of such delicacy that it touches the sublime."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Mashu-3",
        "review_rating": "10",
        "review_title": "Ozu's greatest work",
        "review_detailed_main": "An elderly rural couple make a once in a lifetime trip to Tokyo to visit their 2 children trying to make a new life for themselves in post-war Tokyo. The old couple encounter only coldness and inhospitality from their own 2 children, whereas the widow of their son, who was killed in the war, is the only one who shows them any kindness. After the visit, they return to the countryside whereupon the ageing mother dies, basically from a broken heart. Ozu's well-publicised feelings regarding the responsibilities and duties of the family unit are never more elegantly or graphically portrayed than in this, one of the true masterpieces of post-war cinema. In parts, the poignancy is simply overwhelming. It would take a heart of stone not to be moved by this picture. If ever there was a \"must see\", then this is it."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mscheinin",
        "review_rating": "",
        "review_title": "The Most Humane of All Films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Thundercats85",
        "review_rating": "7",
        "review_title": "Tokyo Boring",
        "review_detailed_main": "I'll give credit to the cinematography, filming style, and quality of actors portraying the family. But let's also just acknowledge that this film is a bit of a slog, and should have been shorter by at least a 30-minutes.\n\nThe plot is simple enough. Visiting parents become an instant burden to their adult children and grandchildren. But what is not explored, is that maybe the children have a reason to not want their parents around? The father apparently used to have quite the drinking problem, which one of the daughters had pointed out. It's not easy growing up with an alcoholic parent, and maybe there is past trauma? But because they're old(er), the parents are supposed to be saintly and revered? For all the time this movie had to explore family dynamics and dysfunction, it sure did meander where I felt burdened by the time commitment.\n\nWhy do movies like this end up on \"the greatest of all time\" lists? Do most film critics just prefer slice of life films that are a slow burn, where the technical merits and visuals outweigh the story?"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Nat64",
        "review_rating": "10",
        "review_title": "An overview of Japanese culture - and one of the best to this date",
        "review_detailed_main": "An old couple goes to Tokyo to visit their children. The best thing they will face then would be indifference, as their children show them few respect and love.\n\nThe theme is very interesting, very different from what we've seen in western theaters : in the US and Europe, the movie shows a personal and individualist point of view(that's my opinion) whereas here, even though you empathize with the old couple, you never feel that \"Tokyo Story\" tells their story, but actually one facing every human being(and this would be about loneliness).\n\nThe actors are great, every word coming out of their mouth is like a treasure(as it is showing a lot of an era, of a country, of a language, of cultural codes - count of many times Miss Hirayima says to her husband : So desu ka and So desu ne), and the range of emotions they make you feel is quite wide.\n\nI am grateful that I saw this movie, and I hope you reader can do as well, as I can assure you that it will, for sure, broaden your mind."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "VikingBurialService",
        "review_rating": "6",
        "review_title": "Not as Emotionally Evocative as I expected",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "DanielFeatherstone",
        "review_rating": "3",
        "review_title": "wot a load of crap!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "RSudiono",
        "review_rating": "9",
        "review_title": "Universal (old) human values",
        "review_detailed_main": "Many have been said by other writers here, so I just want to add some personal thought and experience. I think that there are always some aspects of recognition within our own personal circumstances \"in\" TM. Mine is the fact that my parental family lives separated life's in different countries. When I come \"home\" with my own family to visit my parents (it happens every 3 years or so) I recognize the situations in TM. \u0085We are just as close as family, but in some cases as far as acquaintances, too\u0085 Other universal things like egocentricity, discussions about money, how to organize things without hurting someone's feeling, match our own needs with customs, etc.. are the tools Ozu used to reach us, so simple but so effective.\n\nI don't agree with the notion that Ozu had not made a moralized, stereotypical message with TM: it is obvious that Ozu let us seen what he considered the greatest value in human quality, namely the will and the skill to take care of others, much more than ourself. Watch Kyoko and Noriko, the 2 Cinderella's, do their little \"things\" almost invisible in order to keep the family happening going smoothly. Although Ozu didn't \"speak\" directly for himself, I can feel his strong hidden message through the words of Tomi and Shukishi Hirayama. This is what I call the art of passing a value through a story.\n\nThe most melodramatic and meditative moment come in at the end of the film when Noriko and Kyoko communicated the characteristics of life at such deep, simple and short manner (typical Japanese way). There is a kind of psychological climax despite of the most hearing comment about Ozu's \"monochrome\" way of telling stories by avoiding dramatic high and low ends, that is: trying to leave the audience creates their own drama's by providing the chances to do so.\n\nThe film ended with a hopeful open end: Noriko and Kyoko will meet again in Tokyo (soon). Life goes on \u0085 like the train which brings Noriko back to her own life in Tokyo, leaving Noriko spotting the train from her classroom window. The beautiful smile in Noriko's face is overwhelming and paradoxical at the same time, especially when she profoundly mentioned that life is full of disappointments.\n\nThe only thing I still want to ask Ozu: why using a Western-looked actress to portray Noriko, which I consider to be the leading role ? Having said so, I realize that TM has no one leading role."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "solstice5555",
        "review_rating": "10",
        "review_title": "On soul bonds",
        "review_detailed_main": "This sublime beautiful movie is about feelings and emotions, not about story or action. Its emotional palette is sad and tender. Old parents from a distant province go for the first time to visit their grown-up children in Tokyo and Osaka, hoping to see them in \"full glory\" of adulthood achievements. They get disappointed by the \"modest\", busy lives of their off springs with little time and patience for old folks. Children are already fully separated from their parents emotionally and handle the visit like inescapable and rather annoying obligation to do something \"nice\". The only person who is really glad to see them is their daughter-in-law, caught in her own internal torturing fantasy of \"staying faithful\" to the long-dead husband. No bond is forever, neither parents/children nor husband/wife\u0085 Any bond eventually gets torn down, it should be torn — this is the wisdom of life\u0085 But who of us never kept holding to the relation, existing only in our heart? The karmic attachment to the past makes the parents and the young widow extremely vulnerable and causes them lots of emotional pain, which they endure quietly with great dignity, supporting each other with soul-felt love, care and understanding. This movie is made of the very fabric of human life. Absence of any judgment and genuine kindness give it an uplifting rather than depressing mood. We watch, resonate, accept and thank Ozu and his wonderful cast for the truly compassionate and delicate insight into the sorrows of a human soul."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "frankwiener",
        "review_rating": "9",
        "review_title": "A Beauty Much Deeper and Complex Than It Seems",
        "review_detailed_main": "This is a beautiful film, meticulously and lovingly directed by Yasujiro Ozu, with a very basic story that conveys very profound messages about our relatively brief time on this earth. On a different but related level, this is one of the most fascinating depictions of life in post-World War II Japan that I have ever seen. The war, with enormously traumatic and devastating consequences to the people of Japan, had ended only eight years earlier.\n\nAlthough I am not an expert at the \"tatami-mat\" camera shot, which is taken from the floor to the ceiling of the several interior rooms, almost every scene seems like a framed painting to me with the central characters deliberately placed in specific positions that convey a statement about their cultural, social or emotional status. To the director, Ozu, the placement of objects or people in a frame is of great importance.\n\nBy focusing on relatively insignificant cultural differences, such as mannerisms and intonation of speech, many reviewers regrettably miss the most important messages of the film which include, among other themes, the precious value of life itself, which can be taken from us on very short notice, and how challenging the quest for happiness may be while we live, regardless of our physical age.\n\nOther reviews have sufficiently described the simple story, so I won't repeat what has already been written. The segment of the elderly couple being shipped to the inappropriately \"lively\" Atami spa/resort demonstrates how disconnected the couple's children are from their own parents during the closing stage of their lives to the point that their selfish neglect actually causes the mother serious, physical harm.\n\nBeyond the film's very important theme concerning the universal, human condition of being insensitively discarded by society and family as we advance in age, another significant aspect of the film is the very subtle but compelling message of the human cost of war to Japan. We witness this in the pathetic reunion of the elderly drinking buddies as they discuss the loss of their sons to the war, and, even more dramatically, we feel it from the sad loss experienced by Noriko, the kind, devoted daughter-in-law, as if we are living her deep sorrow firsthand. Accolades to the beautiful Setsuko Hara, who portrays a profoundly conflicted woman so impeccably. While Noriko feels obligated to present a smiling face to the world, Hara's wonderful acting ability allows us to realize the deep sadness that exists beneath her happy, outward appearance. Behind the beautiful exterior smile lies immense suffering. I can't help from thinking that Noriko symbolizes Japan, itself, as the nation struggles through a very difficult and complicated period in its history."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mjnugent",
        "review_rating": "9",
        "review_title": "Universal Story",
        "review_detailed_main": "After seeing Tokyo Story several times over a period of years I've come to the view that movies don't get much better than this quiet, unhurried look at the human predicament.\n\nThose who have never seen an Ozu film may find the first hour or so a challenge; the characters could easily seem unappealing and the pace alarmingly slow. Ozu's camera is set at the level of someone sitting on a tatami and remains stationary within each scene. But the patient viewer is rewarded as the film builds inexorably as it tells this simplest of stories.\n\nOne of the four or five greatest films I've seen."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "princebansal1982",
        "review_rating": "10",
        "review_title": "Simplest Story Ever Told",
        "review_detailed_main": "I have only seen 3 movies by Yasujirô Ozu yet, but he is already one of my favorite directors. His films are as anti-Hollywood as you can go.\n\nInstead of telling \"Greatest Story Ever Told\", Ozu tells the \"Simplest Story Ever Told\". Background score is scarcely used and the camera is barely moved but the resultant product is still beyond comparison.\n\nOzu's movies revolve around families, their interactions, their habits, their manners and their quirks. This movie centers around an old couple who in their twilight decide to visit their brood. Though their grown up children who are themselves very busy are not able to give them much attention, the parent don't make any dramatic statements. They just praise the daughter-in-law who did spend some time with them and is most affectionate. Part of the reason is that they are too polite ,another part it that they are subconsciously convincing themselves that things are not that bad and also they understand that the children have their own busy lives to lead.\n\nI know it sounds like more of a soap opera than a movie, but this is more touching and realistic than the best of Hollywood movies and without employing any sappy music or sappy dialog.\n\nI really loved all the performances, but Setsuko Hara has done an amazing job. I look forward to watching all her movies with Ozu."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jon-larsen",
        "review_rating": "9",
        "review_title": "Simple, but beautiful.",
        "review_detailed_main": "Just watched Tokyo Story.\n\nThis was my first film by Yazujiro Ozu. I got captured like after the first 20 minutes. I've been putting it off because of the length and the plot, but I really loved it. It's not visually beautiful, because there are almost no camera moves, but it did fit in the simpleness of the film, but damn, story-wise, it was incredible! It looks like some people were bothered by the acting, but I thought it was fantastic and also natural IMO. The characters were amazing, and I just wanted to knock some sense into the adult children (whose names I've forgotten), because here we have a couple who're going to visit their children who they haven't seen for a long time, but the children don't have much time for them, so their daughter in-law has to be the kind one.\n\nOne of the themes in the film, that I really loved were selfishness and also ingratitude. There was one scene that made me realize how very thankful I am to have fantastic parents and made me love them even more, and I hope I won't make the same mistake as the children, because we don't have our parents forever.\n\nThere are many forms for art. What I love about art is that it's subjective and can touch people in many different ways. Tokyo Story, is what I call simple but beautiful art."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "treeline1",
        "review_rating": "",
        "review_title": "A gentle story about family",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "poe426",
        "review_rating": "7",
        "review_title": "Death humbles us all...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "socialmedia-437-956449",
        "review_rating": "9",
        "review_title": "Truly Timeless",
        "review_detailed_main": "Considered a cinematic masterpiece, late director Yasujiro Ozu's \"Tokyo Story\" is a deeply affecting tale of an aging couple's visit to see their four children.\n\nIn black and white and with a usually motionless camera, Ozu followed an unforgettable holiday of father and mother Shukishi and (Chishu Ryu) and Tomi Hirayama (Chieko Higashiyama) from the seaside to the city.\n\n\"It's like a dream being in Tokyo,\" says Tomi, having arrived by train; one which quickly becomes a nightmare.\n\nThe partners' children become frustrated with having to entertain. Their eldest daughter Shige is particularly disdainful (Haruko Sugimura) – a testament to the actress' portrayal of the character – and tries shipping them off to a resort, encourages her brother to buy them cheaper food and uses her widowed sister-in-law Noriko (Setsuko Hara) as a local tour guide.\n\nThe dignified, timid and unassuming Hirayama seniors never vocalize their pain, but events often result in their heads simultaneously pointing south as they realize their children have become utterly egocentric. It takes 122 minutes until a family member uses the word 'selfish'.\n\nNoriko, however, is a doting daughter-in-law; they share a gentle bond over their lost husband and son. Contrast, instead of overpowering dialogue and drama, is the main storytelling tool.\n\nThemes of regret, bereavement, friendship and family are explored slowly, but never painfully so, in this gripping journey. Sixty years have passed since this film was made. Its meaning is timeless.\n\nFind all of our film and festival coverage, as well as our events and education at www.DohaFilmInstitute.com. Follow us on Twitter @DohaFilm."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ajoyce-222-935612",
        "review_rating": "7",
        "review_title": "An elderly couple visit their children and grandchildren in Tokyo and find that they are not as welcome as they hoped.",
        "review_detailed_main": "There are different reasons films become classics. Some because their imagery is burned into the memory's eye indelibly, others because the characters are unforgettable, still others because they blazed a new trail in the art form. Tokyo Story claims its distinction among lovers of world cinema largely due to its quietly revolutionary social material, as well as some indelible images: the view of the hill with the little figures of the grandmother and her grandson playing for example, like an animated version of one of those classic tiny bamboo sculptures encased in glass. To name only one beautifully framed shot.\n\nAt the time it was made, 1953, to depict wilful and disrespectful behaviour by the grandchildren as shown here would have been shocking to traditional viewers. Likewise, the indifference bordering on disrespect shown by the old couple's children. Ever so gradually the carefully cultivated mask of social ritual is stripped away to reveal that even the dutiful daughter-in-law admits to being more selfish than she appears. The intense difficulty of family members having any real connection at all with each other is deeply driven home. And the irony that a non-blood relative is actually the one who cares most for the old folks. This, combined with the choice of a storyline that deliberately avoided heroic or mythic overtones as might have been expected in Japanese cinema at the time, accounts for the social impact this film would have made in 1953. (Keep in mind that Kirosawa's early masterpiece The Seven Samurai was released just the next year, sustaining the mythic-heroic tradition of Japanese literature on film.)\n\nThe breakneck speed at which films are now made provides a glaring contrast to this nearly 60-year-old film, whose rhythm is placidly riverine. Yet even to someone like myself with an appreciation for foreign films, the pace occasionally drags. If anything, Tokyo Story is an anti- heroic film. Still, it's a reminder that current film entertainment—with the exception of films like Terence Malick's Tree of Life—allows the viewer no time whatsoever to meditate on deeper themes. Tokyo Story reminds us that films can be long prayers rather than a constant concussion of thunderclaps. It confronts the most basic issues that confront us all: family and mortality."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Monkey-D-Luffy",
        "review_rating": "4",
        "review_title": "My first Ozu film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "calspers",
        "review_rating": "8",
        "review_title": "A Tokyo Masterpiece",
        "review_detailed_main": "\"Tôkyô monogatari\" (1953) directed by Yasujorô Ozu is visually stunning and emotionally charged, and a masterpiece about family and relational loss.\n\nThe first thing to mention about my feelings for this film is the remarkably simple premise, and how very slow it is in its pacing; it demands patience from its viewer. But examining the character developments of the film and subtle and brilliant acting by the entire cast makes it very worthwhile. The cinematography is striking, with immersive shots of characters marked by confrontation and symmetry.\n\nWhat I found to be perhaps the most fascinating aspect of the film was the sophisticated directional style by Ozu, who relies on indirect storytelling and insinuation rather than obvious behavioral messages exemplified throughout the film. This is truly impressive, as the attentive viewer may notice.\n\nHighly recommended!"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Aaron_West",
        "review_rating": "10",
        "review_title": "The silent genius of Tokyo Story",
        "review_detailed_main": "An expertly crafted, passionate and melancholic meditation on the culture and life, in and around the great city of Tokyo.\n\nSome may call Tokyo Story mundane and tedious in its reality, but the truth is that Yasujirô Ozu's direction and screenplay are works of silent genius - evoking a strong sense of reality, and a strange reminiscence for a life other than your own.\n\nThe cinematography is bound deeply by its immersion, and ability to create an environment and atmosphere.\n\nThe score is correctly sparse, when used adding a powerful emotional urgency to the film, when not used, the sound design is penetrates the mind, and makes the film feel alive and beating.\n\nOverall, you should see this film because it transcends the subtitles and speaks to us directly, the subjects of life, about life itself."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "letuannghia",
        "review_rating": "10",
        "review_title": "Zen",
        "review_detailed_main": "Ozu's masterpiece, regarded as one of the best films ever made, has been talked about and dissected a lot. Here I just want to relay my experience of this movie. The first 20-30 minutes for me is boring, my focus go in and out as I try to grapple with what's going on screen, who's whose child. But when things start clicking, when I finally start to understand what's being conveyed and contrast here, I'm just hooked in on the modernized and Westernized city, the kind and forgiving, as well as the selfish, and the distances between characters, between family generations. I start to see my family in it, and like Kyoko, vow to never be like that. The use of non-Hollywood style and techniques is worth highlighting too, representing what's called the transcendental style. The non-melodramatic - characters always smiling, major plot points happening behind the camera - truly makes the style unique, not forcing but sharing emotions with the audience. The slow pacing and gives time for me to contemplate, and ultimately brings a sense of zen to the film. All in all, a masterpiece."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ags123",
        "review_rating": "8",
        "review_title": "Universal Truths",
        "review_detailed_main": "A special film with an important message, \"Tokyo Story\" should be seen by today's younger generation as a lesson in family dynamics and respect for elders. Unfortunately, it won't appeal to those who would benefit the most from it. However, thoughtful humans who take the time to seek out this film will be rewarded with fine performances, intelligent script, beautiful photography, and a reminder that movies can do more than just entertain."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "sadieoutlaw",
        "review_rating": "9",
        "review_title": "What life is about",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "frankjgibb",
        "review_rating": "10",
        "review_title": "An Unqualified Masterpiece",
        "review_detailed_main": "Tokyo Story is a heartrending tale that chronicles the indifference shown to an aging couple by their self-centered adult children. The story is timeless and is unfortunately witnessed in our own time and culture. In 2012, Tokyo Story was voted the greatest film ever made by 146 directors in a poll conducted by Sight & Sound magazine in conjunction with the British Film Institute. I personally include it the the top three films I have ever seen. The direction by Ozu is delicate and subtle and he frames his shots brilliantly. It is accompanied by a beautiful music score. Tokyo Story features Setsuko Hara as the compassionate daughter-in-law, Noriko."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "futures-1",
        "review_rating": "",
        "review_title": "Like stones in a small stream...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "napo0523",
        "review_rating": "6",
        "review_title": "Amazing!",
        "review_detailed_main": "A Japanese couple visit Tokyo, where their children and grandchildren live. While they are in Tokyo, their children treat them and they enjoy a lot. However, the day after they leave Tokyo, something sad suddenly happen to them. I think the most precious thing in the world is family. This couple look so happy when they meet their children and grandchildren. By watching this movie, we can feel how wonderful family is! And also, we can learn that the time with our family is limited. Human life dose not last forever so we should cherish our time and our family. Furthermore, this movie is very old, so we can study old days in Japan. I am very interested in it! If you have interest in old days in Japan, you should try!"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "gbill-74877",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "\"Isn't life disappointing?\" \"Yes, it is.\"\n\nWell, this is one that will gently but most assuredly wrench your heart. Ozu holds a mirror up to one of the great sadnesses of aging, that of children getting on with their busy lives and not having time for their parents. In a beautifully restrained way, we see how an elderly couple (Chishu Ryu and Chieko Higashiyama) are something of a burden to their adult children and their spouses when they visit them in Tokyo. They accept this with understanding and grace, while the viewer perhaps squirms in their seat over their own situations with their parents. It's a simple story, simply told, but the film is a powerful elegy for our fleeting lives and mortality, the bittersweet dynamic between generations, and our ultimate loneliness in the modern world.\n\nOzu doesn't seem to be out to demonize anyone and the film is more observational than anything else, in universal ways that cut across time and cultures. With that said, perhaps none of the children comes across worse than Shige, the hairdresser (Haruko Sugimura). She's constantly sloughing her parents off on others, wants to give them crackers instead of more expensive cakes, and ships them off to the hot springs of Atami to get them out of her hair. The look of disappointment on her face when they come back early says it all. After a heartstopping sequence of events, it seems that what she cares about most is getting her hands on a few of her mother's clothes, and to get the first train back to her busy life. \"You'll be lonely,\" she says to her father, before leaving him. The grandchildren were eye-opening too, with an older boy openly impudent and rebellious, and the younger one flippantly disrespectful.\n\nMaybe we're most selfish as kids or even young adults, and it's only with the perspective that comes with time that we understand the different ages of life, as Ozu sure seems to, with the tragedy being that by then our elders may be gone. There is a kind of a sad acceptance about these phases of life, and Ozu's mastery lies in how subtly he goes about displaying them, letting us identify with each. Meanwhile, there is a stark contrast in the daughter-in-law of a son who was killed during WWII (Setsuko Hara), who is almost too much of a saint in how she acts towards her in-laws, as well as her understanding of the adult children, whom she defends late in the film.\n\nThe film is filled with beautifully composed shots, such as the elderly parents sitting out on that sea wall. The tatami shots three feet off the floor worked for me here, as opposed to some of Ozu's other efforts, probably because there was greater emotional range on display, as well as the constant ache of the parents knowing from their own childrens' actions that they were in the way of things.\n\nIf you like this film, check out Make Way for Tomorrow (1937), which was also a masterpiece, and served as its inspiration. Even better, call your parents if they're still around. Immediately."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "classicsoncall",
        "review_rating": "7",
        "review_title": "\"...we can't expect too much of our children.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "alirezazamani-73059",
        "review_rating": "4",
        "review_title": "A very simple story...",
        "review_detailed_main": "I think this movie is just a repetitive story about obligation of respecting our parents before they die! And the storyline is very very simpler tyan you think and I was very surprised that such these movies are still in the list of top 250 of IMDb!!!\n\nHowever I think this is a good movie to familiar with culture of Japan and Japanese people!"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "TheNabOwnzz",
        "review_rating": "8",
        "review_title": "Simple, but utterly moving",
        "review_detailed_main": "Yasujiro Ozu's Tokyo Story is one of the all time favorites chosen by fellow directors, and it is easy to see why. It does not have a spectacular story, and instead it focuses on being relatable in a way that can literally be compared to average people from everywhere.\n\nThe most important aspect i think that Ozu has done to create this emotional piece of art that lives and breathes is the fact that he creates such an immersion to the story that you feel like you are an actual part of it. He seemingly creates this immersion by using a lot of extremely low camera angles which are apparantly called 'tatami-shots', in which it seems as though the viewer is sitting on a mat right next to our characters ( Or, shall we say, in the next room as Ozu also has a habit of having these kind of shots positioned in another room so that we can still have a clear overview of our characters. ). Furthermore, we notice a lot of shot reverse-shot techniques in which it looks as though the characters are speaking to the camera, which also increases immersion as this is a beautiful way by Ozu of making clear they are speaking to the audience too. These pure filmmaking techniques by Ozu is a perfect way to increase the immersion in his world, and it works perfectly.\n\nThe acting performances are all very good, but especially Noriko ( Setsuko Hara ) gives off an exceptional performance as the outwardly cheerful yet innerly quite troubled widow of the elderly couple's son. All of the other characters are quite selfish and after a certain tragic event later in the film their indifference is such a powerful statement from Ozu to the audience to subtly point out the flaws in the average human being. It is, in a way, also a story about old people in a young city that seemingly does not have a place for them ( Similar to the way released long time convicts are portrayed in The Shawshank Redemption, who feel as though they have no place in this world ) which brings up the inability of modern society to care about our elders.\n\nIt is also further enhanced by fantastic cinematography and great shots of the scenery of Tokyo, Osaka & Onomichi which shows us that we are but little people in such a big place, and that life has to go on. The before stated low camera angles and beautiful japanese cultural indoor scenery also take part in creating a visually beautiful experience. The music by Takanobu Saito also uses fantastic violins to enhance the emotional attachment to the film.\n\nIn the end this is a simple story that could happen to every average person, which is also primarily what makes it so relatable. Yet also visually impressive with great acting, a great soundtrack and all the while observing an ages long moral human dilemma about connecting with our elders, it is a film that transcends its 'simple' story bounds by a long shot."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "yahataj-914-299403",
        "review_rating": "10",
        "review_title": "understood why Kaurismaki follows Ozu's style",
        "review_detailed_main": "It seemed strange to me that this film was rated 8.2 at IMDb when the scenes began so slowly and tediously. However, eventually, I agree with such a high rate. Even though there are not so many actors in the film, I felt as if each of them showed a certain aspect of myself. I gave 10. And, now I understood why Aki Kaurismaki follows Yasujiro Ozu's style."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "edgeofreality",
        "review_rating": "",
        "review_title": "Bitter tea",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "kosmasp",
        "review_rating": "9",
        "review_title": "Still (moving)",
        "review_detailed_main": "An excellent movie about Generations (Old vs Young). Of course it's not simple as that, that is just the main theme of the movie. And you have a great movie about this generation gap and the conflicts lying within. And it all moves on quietly - even the camera is still most of the time, not moving but capturing everything that is happening from one angle, often even without cut-aways to close-ups or anything else.\n\nThe acting is phenomenal, sublime and subtle as the overall tone of the movie. Of course if you're more into Bruckheimer movies and/or anything fast paced, then you'll probably be whining about the seemingly slow pace of this movie. But if you let yourself into the movie and it's pacing and the characters, you will love it. Or maybe even hate some of the characters for being who they are. But it's in the looks and between the lines, where most of this movie is happening. A true masterpiece!"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "RossLikesMovies",
        "review_rating": "8",
        "review_title": "More of a film to analyse than enjoy",
        "review_detailed_main": "Of course that is just my opinion. Tokyo Monogatari is a marvel of the dailiness of life and the disappointment parents face. It raises relevant issues on children growing apart from their parents and a departure of values to modern times. The film is featured in many a top 10 list, its the number one film on the latest Halliwells top 1000 list. Its hard to fault.\n\nThe story is about two parents who go to visit their children in Tokyo. Though things aren't as sweet as they had imagined and the trip basically ends up being a big disappointment. The story is told in an interesting manner, often eclipsing certain events and moving on. To keep the story moving I suppose. An example of this being that the old couple are meeting their son, Keizo, before they go to see their daughter. The film goes straight to arriving at the daughters house. We do not see their visiting of their son Keizo, only hear the characters talking about it and know that it has happened.\n\nOne of the daughters, Shige is quite cold towards her parents. She doesn't pay much attention to them and is frequently cruel. Small things like her not giving them nice cake and saying the crackers are good enough for them. The parents slowly realise that their children aren't as successful as they had thought. Just another subtle way of indicating that they have not seen their children for some time. Also their daughters children not being familiar with their grandparents, another indicator.\n\nEventually the old folks are shipped out to a health spa. At first they feel guilty that they are inconveniencing their children further, they don't realise that they aren't very wanted. The person most kind to the couple is Noriko, the wife of one of their sons who died in the war. It is ironic how she is the kindest, yet is no blood relation.\n\nThe characters in Tokyo story are very well developed. Different assumptions can be made towards the children's indifference. Maybe times have simply changed. This is displayed well in the film through shots of modernity, trains and boats. Mod cons if you will. The camera movement in this film is also intriguing. Ozu often explores the space within a room. Maybe by following somebody around. The compositions are interesting. A lot of the camera decisions have meaning. Such as a couple sitting side by side so as not to appear confrontational. Pattern is also kept up well, people are fanning themselves in linked shots, constantly reminding the viewer that it is a hot day (common for an Ozu film) Another interesting point about the camera movement is that Ozu breaks the continuity by changing the side from which scenes are shot. A unique thing.\n\nOverall I definitely recommend you see Tokyo story, it is a very impressive, at times heartrending piece of cinema. It shows the coldness that comes with modern times and how life may not have place for elderly people. Technically, it is at a high level. The story is told in a neat way and the whole experience is generally engaging. My only complaint is that the film at time becomes a little slow and may not always be enjoyable. But overall, its an important one. Do see it if you have a big interest in film."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "crossbow0106",
        "review_rating": "10",
        "review_title": "A Subtle Masterpiece",
        "review_detailed_main": "At first, the premise and the beginning of this film seem to prepare you for a sad melodrama. This movie, in superbly subtle ways, takes you far from that. The story of the parents coming to visit their children in Tokyo and finding their children too busy and too put out to want to entertain them must have been a revelation for Japan moviegoers at the time. Nowadays, this movie cannot even be made, it would just garner shrugs. So, you have to watch this film knowing it takes place in the early 1950's, not yesterday. Although it has probably been commented on already, Setsuko Hara's portrayal of Noriko is amazing. She plays the daughter in law role perfectly. She has the perfect mixture of sweetness and awkwardness. You want to see her be happy, as she seems to be the only person who has time for the parents. You should buy the Criterion Collection version of this DVD, as it includes a documentary of the director. It is a purposely slow moving film. It is rightly considered a masterpiece, especially by film critics at the time. They should have the same opinion now."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "shakercoola",
        "review_rating": "9",
        "review_title": "A tragedy about the cost of human distraction",
        "review_detailed_main": "A Japanese drama; A story about an elderly couple who take a long journey from their small seaside village to the big city to visit their adult children who don't make much time for them. The film's theme is about cross-generational family relationships, with its central question that is universal: How do we look after our parents as they confront all manner of emotions about their own deaths? It is handled sensitively, a humbling drama about parenthood, and it has lost none of its power over the years. Ozu doesn't pass comment or sentimentalize the story; he paints in delicate watercolour emotions in which the viewer glimpses pain and joy and tenderness and mystery from simplicity and reticence."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jboothmillard",
        "review_rating": "7",
        "review_title": "Tokyo Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Gunnar_Ingibjargarson",
        "review_rating": "10",
        "review_title": "An Ozu masterpiece",
        "review_detailed_main": "When an old couple go to visit their children in the big city, they get little attention of their busy children.\n\nOf all the family-related movies that Ozu did, this is the that stood out of them all, without a doubt (even though most of them are great and tough to pick one out). Ozu great grip on the drama in his film is remarkably great here in Tokyo Story. Few directors have had the genius of do it as Ozu. The family drama form of Tokyo Story is great, but not only because of great direction, but also because of great acting and a great script. Tokyo Story deals with something that was not familiyar with the 1950's cinema, and certainly not Hollywood at that time. But Japanese cinema was very different. The dealing with family and family problems like Ozu does in Tokyo Twilight and here in Tokyo Story are very like, dealing with disappointment of children and family is very strong. But also dealing with getting old and have to accept our fate. A true masterpiece."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "kurup_manoj",
        "review_rating": "7",
        "review_title": "A masterpiece",
        "review_detailed_main": "I give this film a 9 rating only due to its vintage and somewhat imperfect fit with todays fast paced life and diluted family values.\n\nThis film is a really good example of how one can take a simple concept from our day to day lives and turn it into such a thought provoking film.\n\nTo really appreciate this movie one must put into perspective the value of family, especially one's elders, in eastern cultures. Even today it is so different from our Western views and approaches in dealing with our elders.\n\nThe basic principle there is respect for elders, or even reverence for one's parents as they get on with age. Many families continue to live with their parents and care for them through their old age. These are the choices they make in their life and value. And, not to forget, many of these people are professionals and skilled laborers who continue to work full-time and still care for their extended families. Rarely will you find a retirement village ;) there.\n\nRemember these simple concepts next time you watch this movie and you might get a poignant view of the pain that is conveyed in this fantastic film.\n\nEnjoy....."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "briancham1994",
        "review_rating": "4",
        "review_title": "Plodding",
        "review_detailed_main": "This film was recommended to me alongside Yi Yi (2000) but the latter was much better. This one had a similar premise - following the lives of everyday people - but it felt really plodding and didn't have much of an impact on me. Perhaps the style was too subtle. It was just really straightforward and while it invites you to read your own meaning into the imagery, I lost interest after finding no direction in the overall flow of events."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "chaos-rampant",
        "review_rating": "",
        "review_title": "How do you find each other after the night?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Crabnebula1914",
        "review_rating": "9",
        "review_title": "Ozu is Great!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "emverano",
        "review_rating": "9",
        "review_title": "A Sine Qua Non from a Japanese Master",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "gregghelvey",
        "review_rating": "10",
        "review_title": "Masterpiece",
        "review_detailed_main": "What more is to say than masterpiece, masterpiece, masterpiece because saying it once is not enough to summarise the power of this film and it's great master director."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "lotus07",
        "review_rating": "8",
        "review_title": "Alienation and the Family",
        "review_detailed_main": "SYNOPSIS: An aging husband and wife visit their children in 1950s Tokyo. While all are well meaning and polite, the years and the miles between them have taken them all on different paths and they struggle to come to terms with their memories and their expectations.\n\nCONCEPT IN RELATION TO THE VIEWER: Intimacy and how things change. A character study of the the differences between generations, their expectations (both young and old) and how the modern world has fractured the extended family.\n\nPROS AND CONS: This is a slice of life / contemplation film as opposed to the fantasy / escapism film genre that is marketed to the youth of today. While many newer films have choreographed violence and action as the mainstay of their cinema experience, this film is the opposite. While film is a 'visual' medium, it can be a subtle medium as well, without all the 'eye-candy' and special effects that are so prominent today.\n\nThis film is long, over 2 hours, and it took me a while to get all the way through it. By the end of the film, I felt as though I was a part of this family and could sense their pain and grief . This film may not appeal to younger generations, but as we age, this type of cinema becomes more and more endearing to those of us that have experienced more than we allow ourselves to remember.\n\nThere are some interesting oddities in the film that stem from the culture in which it was made. All the camera angles are very low, usually less than 3 feet from the floor. Since there were few chairs in 1950s Japan, most of the characters sit on the floor. This is their living space, hence the lower camera angle. Almost everyone in the film has a hand fan, which they are constantly fanning themselves with. In a time before air-conditioning, this was the only way to keep cool in the summer. There is almost no panning on scanning with the camera. Most of the scenes are done with a static camera location with minimal scene editing. Finally, there are a lot of 'lingering' scenes, in which actors leave the frame or exit a room, but the camera keeps rolling for up to 10 seconds before fading to the next scene or editing to a different location. This appears intentional, as though the director wants to let us linger on what has just transpired.\n\nIn the end this is a film that makes you think. I love films that do that."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "doomedmac",
        "review_rating": "8",
        "review_title": "Hard-hitting drama",
        "review_detailed_main": "This right here is a movie made to make you feel something by the end. It took a while for me to get invested but once I did it was well worth the wait."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "alansabljakovic-39044",
        "review_rating": "9",
        "review_title": "Wonderful movie",
        "review_detailed_main": "After watching this movie I realized how I don't respect my parents enough and this ending could happen to all of us. We are all busy in this modern world and most of the time we don't have time for our parents. We should help our parents as they helped us when they raised us. This movie has a soul and wonderful story. Highly recommend."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "hhg2",
        "review_rating": "6",
        "review_title": "Best for hard core cinephile",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "frankde-jong",
        "review_rating": "8",
        "review_title": "The last part of the Noriko trilogy",
        "review_detailed_main": "There are films about children who are not really interested in their (aging) parents. Exemples are \"Make way for tomorrow\" (1937, Leo McCarey) and (as a subplot) \"All that heaven allows\" (1955, Douglas Sirk).\n\nThere are films in which the parents are disappointed by their children. An example is \"Everybody is fine\" (1990, Giuseppe Tornatore).\n\n\"Tokyo story\" has both these themes, and combines them in a marvelous fashion. The story is told by little gestures. How estranged the eldest son has become from his parents turns out when he has to introduce his son (which is not a baby anymore) to his grandparents. In another scene the disappointment of the father with his children becomes explicit after some sake during a night out with old friends. When he comes home drunk, the reaction of his wife gives the impression that drinking is a bad habit of him she knows from the past.\n\nSo \"Tokyo story\" is therefore not a film about \"good guys\" (the parents) and \"bad guys\" (the children. It is much more nuanced. The scene described above hints at the fact that the parents may not always have been cute oldies, and not all children are selfish. The daughter in law (the wife of their son who has fallen in the Second World War) is more than willing to spend time with her parents in law and show them Tokyo.\n\nThis daughter in law is called Noriko and is played by Setsuko Hara. Setsuko Hara had played the character of Noriko before in \"Banshun\" (1949) and \"Early summer\" (1951). Togehther these three films are called the \"Noriko trilogy\" of Ozu and are considered by many as the zenith of his oeuvre."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "theognis-80821",
        "review_rating": "6",
        "review_title": "Sadness",
        "review_detailed_main": "As usual, Ozu is obsessed with the petty particulars of family life: an elderly couple journey to Tokyo to visit some adult children. Understandably, the grandchildren are bored and irritated. Life doesn't end well."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "net_orders",
        "review_rating": "5",
        "review_title": "Be Prepared To Be Seriously Underwhelmed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "A Heartfelt Meditation of Old Age & Parents-Children Relationship",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "abelina",
        "review_rating": "10",
        "review_title": "Best movie for a classical movie beginner",
        "review_detailed_main": "Through a typical Japanese family, it reminds us the priceless value of the traditional family. The love of old couple showed on their slow conversation, I am deeply moved. When one is sad, males in the traditional eastern society don't allow themselves to cry out, the only thing he can do is to drink a lot with old friends. How sad it is! Parents and grandparents are always treat the grandson very well, and most of the time they become spoiled children. After children grown up, it seems that only the death can definitely bring everyone home. This movie gives us a chance to review the value of our own. Wonderful!"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "JuguAbraham",
        "review_rating": "8",
        "review_title": "Evergreen lovely tale that enjoyable decades after it was made",
        "review_detailed_main": "Lovely tale that is evergreen. Endearing performances by Chishu Ryu (an Ozu regular, playing the old father) and Setsuko Hara (playing the ever-smiling,widowed daughter-in law). Much has been made out of low placement of the camera--but it is only obvious when the most of the characters are often squatting on the floor on the knees (the proper Japanese sitting posture). An odd detail that caught my eye were the steam locomotives pulling the trains when the tracks had electric wires for electric locomotives. Trains chugging away and horns of boats/ships are regular visual punctuations used in the film."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "truemythmedia",
        "review_rating": "8",
        "review_title": "Sublime and Transcendant",
        "review_detailed_main": "I love movies about the elderly. I believe that we, the American Culture, do not think about old age and death nearly enough. My wife always says that I can't wait to be an old man and maybe that is true. Often in films, i find that I identify more with the old mentor character than the young hero. I never wanted to be Luke Skywalker or Han Solo. I wanted to be Obiwan or Yoda.\n\nKnowing that, realize that this movie is in many ways, made to my own tastes almost to perfection. Its arthouse directing style, foreign language, slow pacing, and focus on generational conflict focusing on an elderly couple are all huge draws to me. If none of that interests you, you can stop reading here. This movie just isn't for you.\n\nNo stones being thrown here. It just won't be your cup of tea. Or jam. Or toast."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Goloh",
        "review_rating": "9",
        "review_title": "Simple, clear, moving",
        "review_detailed_main": "A straightforward story of generational conflict, within the strict cultural norms of Japan, this film has additional advantages of being atmospheric and having generally clear subtitles faithful to the original Japanese audio. Following the parents through their visit to Tokyo, and back home again, was an experience oddly like what we might see in the west 50 years later. No shocks, no surprises, much gentility and thought. I loved it."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "kenjha",
        "review_rating": "9",
        "review_title": "Touching Story",
        "review_detailed_main": "An elderly couple from a small town visits its children in Tokyo but the children are too busy with their own lives to attend to their parents. A simple but moving drama about generation gaps and the rat race we are all caught in as we try to get ahead in the world. Although made more than 50 year ago in Japan, the themes explored are universal and timeless. There are fine performances from Riyu and Higashiyama as the elderly couple and Hara as their widowed daughter-in-law. Ozu's visual style is simple but elegant. His camera is usually static but he masterfully uses framing and editing for dramatic impact. The score is lovely."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "shart-15",
        "review_rating": "10",
        "review_title": "How good can a film get?",
        "review_detailed_main": "Perhaps the finest film ever made. Technically it is a breathtaking piece, showing Ozu's static, tatami-hight camera work and exploiting his unique 360º space. By this I mean that instead of the usual Hollywood/Western 180º Ozu utilizes a spherical space. When the old mother tells her widowed daughter-in-law how much she enjoys her visit the daughter-in-law is initially screen right. Noriko massages Tomi's shoulders and then she stands to cross the room. In a typical Western film this would be a cut on action, the action 'disguising' the cut. Ozu cuts on her motion too but at the same time shifts the camera across the 180º line. Thus, when the cut on Noriko's motion is completed she is now screen left.\n\nPenelope Gilliatt has written that Ozu is obsessed with film's possibility of \"reporting the poetic truth of the actual\" and I cannot think of a better way to express his desire and success to extract beauty from the mundane, the very day, the quotidian, with love and humanity.."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "zeekwunlau",
        "review_rating": "7",
        "review_title": "From life, above life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "THE-BEACON-OF-MOVIES-RAFA",
        "review_rating": "10",
        "review_title": "Life really is disappointing ? A moving and heartwarming story.( A+ Movie) My Ratings 10/10",
        "review_detailed_main": "Tokyo Story is a respectful work - to its characters and to its audience. Ozu reminds us to slow down and appreciate our lives and those we share it with. If you are willing to accept it's gentle rhythm then you will find a film truly human and timeless in quality."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "DLochner",
        "review_rating": "7",
        "review_title": "A quiet observation",
        "review_detailed_main": "One needs peace, time, and patience to watch this film. What is offered is primarily a well-thought-out masterpiece based on subtle observations and dialogues. Less visually spectacular or particularly fast-paced, as one might expect from contemporary films, the director portrays a family where tradition meets modernity.\n\nThe film not only explores the relationship between generations but also raises questions about identity, responsibility, and the conflict between traditional values and modern lifestyles. Ozu succeeds in addressing universal themes that are still of great relevance today.\n\nThose who are not in the right frame of mind or expect the film to be classic entertainment are not in the right place here. It's a quiet observation by director Ozu."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "lesallen-68268",
        "review_rating": "3",
        "review_title": "Marmite",
        "review_detailed_main": "Sadly this one passed me by.... One for the true movie buffs..."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Chazza",
        "review_rating": "",
        "review_title": "You're joking!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "PCC0921",
        "review_rating": "8",
        "review_title": "Japan was founded on February 11th, 660 BC",
        "review_detailed_main": "This film is a simple basic story, but what the film delivers to us is so much more than that. Director, Yasujirô Ozu, uses many interesting shooting techniques for this film and this film is notable for its use of the \"tatami-mat\" shot, in which the camera height is low at floor height or eye level and remains largely static throughout. Ozu also breaks the fourth wall a lot by having the actors look straight at the camera during conversations, making this much more personal for the audience than really what the characters are feeling.\n\nAlmost every shot is framed by lines, squares and angles and in almost every scene, there are fans being waived by the characters to help explain the temperature and mood of the characters. It is a basic story about an elderly couple that comes to Tokyo to catch up with their children and grandchildren, but unfortunately the family has no time to deal with the aging parents. It is a conundrum that ends up being a bad decision by the film's end.\n\nWhat this film delivers is a whole lot more. It reminds us about how precious our family is and how important it is to spend time with them before time runs out. It also is an amazing commentary on how important understanding history is. One of the main plot lines throughout the film, is the ever missing void that is eminent throughout, due to a son who was lost during World War II. This film was released only eight years after the war ended and that impression is felt all through the film. It is fresh on the characters minds, the filmmakers minds and eventually grips you too..\n\nIf you try to put your mind into 1953 Japan you can feel the pain of the characters even though they express the pain with honor. From the looks on their faces, it feels like it is almost a second thought. It is an interesting perspective trying to put yourself in 1953, instead of looking at it from a 21st century perspective. This film is hailed as a classic. It appears on numerous top 100 lists. It is a movie that gives a great lesson on filmmaking, as well as, a history lesson and a reminder of how important family is.\n\n8.8 (B+ MyGrade) = 8 IMDB."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jacknchicken",
        "review_rating": "9",
        "review_title": "Peaceful",
        "review_detailed_main": "I started watching the movie, and it moved so slowly. By the end of the movie, i was emotionally connected with the characters and i almost cried. I have never cried at a movie before (almost at Life is Beautiful, but thats another story). You just have to get out of the MTV-rapid-cutting mindset, and live with a story told from a camera located on the ground."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Re1nard",
        "review_rating": "9",
        "review_title": "A Beautiful Movie in Its Simplicity",
        "review_detailed_main": "I know this movie has quite high rating on IMDb and that is why I want to give it a chance. I am usually reluctant to watch B&W Japanese movies but \"Twenty Four Eyes\" and \"Sansho The Bailiff\" have impressed me a lot.\n\nYes, this movie impresses me a lot. The story is simple but there are accuracies in its simplicity. What happens in this movie may happen to everyone. This movie is beautiful yet powerful in delivering its message. The pace is rather slow but it is understandable because the director wants to grow each important character in this movie. If you are looking for a well-developed drama, this is it.\n\nIn a nutshell, time may change everything. Love from our beloved ones may change. Over time, parents-children relationship may change and it becomes routine activities with less passion. Surprisingly the one, who we think may care less about us, gives the most attention we need during the hard times. Life is ironic. Life is funny yet beautiful. Watch this movie and interpret the meaning of \"parents-children relationship\" by yourself."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "aakash-karkare",
        "review_rating": "9",
        "review_title": "Tokyo Monogatari",
        "review_detailed_main": "Tokyo Story is one of the most emotionally draining movies I have ever see. It is right up there with Berman's Cries and Whispers as a movie that literally wrenches your heart out.\n\nThe movie is about an aging couple who visit their children and realise how everyone has drifted apart. Ozu's ability to capture the mundane as well as the profound aspects of daily life is uncanny. Especially the scene where the boy moans about not being able to study and his mother points out he never studies anyway.\n\nThe imagery and cinematography are beautiful One of my favourite scenes is the boy and the grandmother at the start of the movie. That scene is cinema at it's most beautiful at its most poignant moment.\n\nThe movie is filled with moments of such beauty. And there is also an underlying warmth and humanity to it that it endears itself to every viewer. You could fault the movie on being a bit slow but if you stay you are rewarded. Japanese movies tend to take the more contemplative approach which i love although one must be in the mood for it."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "marie_D",
        "review_rating": "10",
        "review_title": "Slow, but ultimately moving",
        "review_detailed_main": "This movie dragged for me. Nevertheless, it was well worth seeing. I especially liked the acting, in particular by the old couple. The cinematography was interesting, although several shots were used repeatedly for some purpose I could not identify. In the end though, it brought a tear to my eye and I am not generally a crier at movies. For a grander, even more moving, Japanese classic about life in post-war Japan, I would highly recommend Kirosawa's Ikiru. 7.5/10"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "willycp-31022",
        "review_rating": "10",
        "review_title": "I Cried While Watching This Movie",
        "review_detailed_main": "The Story is simple and flows naturally. Started warm and builds to its heartbreaking climax."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Vartiainen",
        "review_rating": "7",
        "review_title": "About banal indifference and cruelty, but also family bonds and kindness",
        "review_detailed_main": "Tokyo Story is about an elderly couple living in a small village in Japan who one day decide to visit their children living in Tokyo. There stay in the houses of their children and widowed daughter-in-law, getting treated with veiled courtesy and arrogant exasperation for the burden of their presence. But also with kindness and respect.\n\nDirector Yasujiro Ozu has a great eye for everyday human interactions. The dialogues and events in the film are almost banal in their everyday normality. And yet it feels so real. We all have those relatives that we're not so close to who nevertheless visit sometimes and the rules of society demand a certain amount of politeness. The great tragedy in this film is simply the fact that in this case these unwanted relatives are the parents of these grownup children. Which should never be the case.\n\nOzu's way of telling the story is also interesting. It's a slow film, certainly, but it always nevertheless feels like it's moving somewhere, and then it suddenly lurches forward when something unexpected happens between scenes. The camerawork is also very stilted, but in this particular film that works wonders, detaching you from the experience of watching a movie and allowing you to focus your entire attention on the scene itself playing out.\n\nIf I had to name a flaw in the film, I'd say the character of Kyoko (Kyoko Kagawa) is almost completely sidelined in favour of Noriko (Setsuko Hara), the aforementioned daughter-in-law. Kyoko is the couple's youngest daughter, who still lives in the village with them and takes care of them. Yet her kindness is barely mentioned whereas Noriko is given almost a saint-like treatment.\n\nStill, it's a good film. It requires patience from its viewers but sometimes the most captivating stories do just that."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Jithindurden",
        "review_rating": "10",
        "review_title": "The Greatest family drama",
        "review_detailed_main": "The first half of the film reminded me of a lot of Malayalam family dramas but without too much melodrama. But then the characters and situations started to remind me of a lot of real-life people and situations. Tokyo Story was considered too Japanese by the distributors at the time but later it was rightfully proved it is a universally receivable film. Keeping the camera static and often not following the rules Ozu focuses on the emotions and wisdom without any gimmicks. Even when the characters do selfish things Ozu never judges them, they got enough reasons to behave as they do. Each character is brimming with life that it is impossible to come out of the film without being moved and even changed. There have been many attempts in creating a family drama more affecting, many which have a lot of themes in common but I believe none have reached this level."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "iquine",
        "review_rating": "7",
        "review_title": "Slow Build of Family Relationships",
        "review_detailed_main": "A doctor and family living in Tokyo have a visit from their parents, who live out of town, which feels a bit unplanned. The family seem to be tight with their money which is slowly noticed by their parents as they try to find inexpensive ways to entertain them. Plus they are too busy to spend time with them as they work during the day. The story slowly shifts to the parents reflecting upon their children and while being overly polite to the point of being evasive, they keep mentioning how they live much too far apart. Eventually, the parents decide to no longer burden their child and daughter in-law and travel home. Then children receive a somber telegram. Was there a reason the parents came to visit now? Aside from the honest drama, the camera perspective was noticeable as most of the film was shot from waist level which gives the characters a prominence and focus within the frame; as family is the focus of the film. I'd say the message this film is communicating is not to be so distant, emotionally, from your family. What should the relationship between parent and child be as they become adults?"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "etstiffler",
        "review_rating": "3",
        "review_title": "The repeating story of humans",
        "review_detailed_main": "Old people will always be neglected. This story saddens me a lot because I will be old and may have the same outcome. Sure, kids love their parents. But, life happens. The movie is not bad, but boring."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "grantss",
        "review_rating": "8",
        "review_title": "Engaging and emotional drama from Yasujiro Ozu",
        "review_detailed_main": "An elderly couple head to Tokyo to spend a few days with their children and grandchildren. While their children are initially glad to see them, and the parents are models of patience and pleasantness, the novelty wears off pretty quickly for the children and they soon view the parents as a hindrance more than anything else. Then an event highlights the divide between the two generations...\n\nEngaging and emotional drama from famed Japanese director Yasujiro Ozu. It wasn't always looking like it was going to be that great though. While always engaging, the pace is very slow at the beginning. The first 60% or so is all scene-setting - Act 1 essentially. Things ramp up once the aforementioned event occurs, and this makes the wait worth while.\n\nQuite emotional, ultimately, and quite balanced in its views. It looked like it was going to be fairly judgmental in its observations, but the final few scenes add a different perspective. Having a character that was able to see both sides of the issue helped a lot.\n\nNot quite the masterpiece it is made out to be, but very good nevertheless."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "SomeHeartPlease",
        "review_rating": "9",
        "review_title": "A true masterpiece",
        "review_detailed_main": "This is all about psychology, and the subtle layers that make up family dynamics in early contemporary Japanese society. It is very touching if you're someone who is into empathy. It's about acting. Nothing moves, yet there is some surprising insight and candor and great quality with the dialogue. You're expecting to simply be a foreign witness to something exotic from a time past you cannot really understand (unless I guess you're a Japanese national from that era) but the parents provide surprising feedback and emotion, and this is beautiful nuanced top notch acting. Going into this a long time ago I though this was a feudal era piece so I was expecting the traditional clothing etc loll. It's all old but modern and those people got style. Sometimes you have to go very very far away (in my case) in order to find something very close. A movie which discusses age and family and makes you think about the quality of our interactions with people from different generations. It is a universal masterpiece because I'm not Japanese and none of the setting applies to what I am or what I live, but I can connect with the humanity that drives this amazing production. A really satisfying and elevating cinema experience that you keep for repeat watching and insight.\n\nNot spoiling by saying that if you require an action movie or swords, look elsewhere."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "fatcat-73450",
        "review_rating": "8",
        "review_title": "True to Life",
        "review_detailed_main": "This is a slow-paced slice of realism detailing the journey of an elderly coupel taking a cross-country trip through Japan to visit their five children.\n\nActually, more precisely three children, as one is a widow of one of their sons and they have a daughter still living at home with them.\n\nAlthough I don't want to read too much symbolically into this work because it's clearly meant to be a reflection of real life, it's almost as if the different children represent different stages of life. The oldest living son has a full family with a wife and two sons of his own and a demanding career, so he's very busy. He seems to be in his early 40s. The second daughter seems to be in her 30s and working feverishly to develop her career. The middle son is in his 20s, brimming with life and professional devotion, and the youngest daughter is still very much attached to her parents .\n\nThe older children are busy and heavily involved in their professional lives. They're not exactly evil, but they do neglect their parents a bit when they come to visit them in Tokyo and try to shuffle them around with different people.\n\nThe widow is the only one who treats them decently, taking time off of work to be with them and patiently letting them stay in her home despite not being a blood relation to them. It would appear that she, having come to an early understanding of life because of her husband's premature death, is outside of the rat race and cherishes the fleeting nature of life and social connections more than the others.\n\nOne interesting aspect is the limited range of emotions shown by most of the characters, which is probably a Japanese thing. Most of the women are always smiling even when faced with annoyances, disappointments, and unfairness. The daughter in law, especially, never stops smiling except in those moments when the emotional burden of memories or worries momentarily becomes too much to bear. Perhaps the most powerful moment in the film is when she, with a full broad smile, unceremoniously admits to the youngest daughter that life is, indeed, just one big disappointment.\n\nWhat is to be done, eh?\n\nIt's a slow-paced movie and most of the shots look very similar - a door or part of a building framing the action with the camera seeming to be slightly facing upward. Also, for all the deep scenes, there are twice as many mundane scenes just meant to build the sensation of realism.\n\nNevertheless, this is a meaningful and thoughtful film that provokes reflection on ageing, death, and family.\n\nHonourable Mentions: No les Llores en La Tumba - a powerful corrido about how people should appreciate their loved ones while they are alive, sung by Los Originales de San Juan. Surprisingly not a major theme of this film - there doesn't seem to be much regret about anything at the end. Nevertheless, it's thematically related."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "steiner-sam",
        "review_rating": "8",
        "review_title": "Understated examination of family relationships in postwar Japan",
        "review_detailed_main": "It's a family dynamics drama set in Onomichi and Tokyo, Japan, in the early 1950s. It follows a couple in their late 60s traveling from a small city to Tokyo to visit two of their children and a daughter-in-law and ends with the immediate aftermath of their return to Onomichi.\n\nShukichi (Chishu Ryu) and Tomi Hirayama (Chieko Higashiyama) had five children; the middle son died during World War II. They live with their youngest daughter, Kyoko (Kyoko Kagawa), an elementary school teacher. Their oldest son, Koichi (So Yamamura), is a doctor in Tokyo, married to the outspoken Fumiko (Kuniko Miyake). Their older daughter, Shige (Haruko Sugimura), is a busy hairdresser. The widowed daughter-in-law, Noriko (Setsuko Hara), works in a busy commercial office. Their middle son, Keizo (Shiro Osaka), seems to work for a railroad company in Osaka, halfway between Onomichi and Tokyo.\n\nThe film follows the interaction Shukichi and Tomi have with their Tokyo family. Noriko, by far the movie's most empathetic character, is the only one to make much time for them. They decide to return home sooner than planned, and Tomi begins to experience health issues on the way. A final crisis brings everyone to Onomichi.\n\nThis film is an understated examination of family relationships in postwar Japan. Increasing Western influences are evident in the younger women's dress and incidents like Keizo wanting to return to Osaka for a baseball match. It provides a very engaging insight into early 1950s Japanese care for critically ill persons and rituals for death. The simple camera style has similarities to the film, \"Jeanne Dielman, 23 quai du Commerce, 1080 Bruxelles\""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "blinkchester",
        "review_rating": "",
        "review_title": "A Classic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "manendra-lodhi",
        "review_rating": "9",
        "review_title": "Interesting characterization, even though slow paced.",
        "review_detailed_main": "I had heard a lot about this film and it did is one of the best films in displaying the realities. When I had finished watching, I was thinking as to why I liked the film. For the two hours show, you will not feel bad at all. This is a film you can watch without thinking too much of your time.\n\nPROS: Yes, it is slow paced. But this is one of those few films (along with The English patient), to be good and charming despite their slow music and character analysis. Another good thing in the film was that there was not too much of crying or unnecessary display of tears or emotions. What makes the scenes beautiful is that the emotions were displayed through the conditions that the couple had to face. The script seems to be a normal one but the way, the major characters were analyzed is amazing. All credit goes to direction. I can't say much about acting because Japanese acting and voices were new to me and couldn't understand their colloquial styles which were somehow important to display the right amount of emotions.\n\nMessage: \"Anything can change overtime.\" Verdict: \"A must watch for film buffs.\""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Sonic_Ocean",
        "review_rating": "9",
        "review_title": "The Significance of Family",
        "review_detailed_main": "Tokyo Story is a beautiful, emotionally devastating film that really shows a side of society that immensely disappoints me. I guess you can say that I developed an instant personal connection to this film, since I've witnessed similar situations. Having to go through the immense lost of my grandfather (who was not only my grandfather, but someone who I can call my dad and my best friend) and knowing for a fact I will be missing him for the rest of my life until I die, I felt greatly disgusted by how a lot of the children in the film treated their parents. I come from a culture where we would NEVER put our parents or grandparents in an old person's home, and we would be more than willing to take care of the people who raised us just the same way they took care of us. If I have to make sacrifices in my job and my me time, then I would make no hesitation, because I LOVE, as well as RESPECT my grandparents/parents. Whatever differences we may have wouldn't even matter and in the end it never did. Not to trying to tell anyone how to live, but I think that showing some compassion and respect towards the people who did a lot for you shows a lot of character. My grandfather may not be with me now, but to know that I did the best that I could to make him happy and not feel alone gives me a sense of comfort in knowing that he was happy.\n\nWe unfortunately live in a society where we all are too busy and have places to be, and it sometimes cannot be avoided, but once we deliberately start to distance ourselves from people, then it becomes a problem, especially for the people we should give more time and attention to. This is the me generation, and we are flooded by technology and corporations trying to exploit many aspects of our lives, which dilutes so many of the basic, yet most important aspects of our humanity. A film like this just goes to show that our so called leaders in society don't put much of an effort in influencing us to stay connected or in at least trying to create outlets that will bring us closer as humans. Instead we live in a system that brings out selfishness. While life can be at times unrestrained in its cruelty, at least we have movies like 'Tokyo Story' that shows a sense of humanity in its most raw and purest form. I like to watch films to escape, but especially ones that show an utmost honesty about our society and what 'Tokyo Story' says to me from watching it is that while life is beautiful and still worth living, it can still be immensely disappointing. What makes Tokyo Story such a strong film is that it brings out the harsh reality that exists in our society, in that many people don't put in any effort to maintain the strength of a bond towards their family. What's the point of being part of a family if that person doesn't even have the heart to set things aside to spend time with their parents? The fact that this film can tug at many people's heart strings goes to show just how much this film is an emotional punch to the gut, in that it shows aspects of human nature that is far reaching and universal. While Japan is one of the many diverse cultures in our world, we still share many of the same issues that can exist in any family relationship. Any film that make me feel this much empathy for its characters is something special and 'Tokyo Story' is that special film."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "thinbeach",
        "review_rating": "7",
        "review_title": "Understated Melodrama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jack_o_hasanov_imdb",
        "review_rating": "8",
        "review_title": "Predictable",
        "review_detailed_main": "The ending of the movie is predictable, but I watched it anyway.\n\nIt was a good movie, I remember the subject of this movie from somewhere, but . . . I do not know. It was an emotional movie."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "freethinkingworld",
        "review_rating": "7",
        "review_title": "After Thoughts",
        "review_detailed_main": "A sweet slow paced story that has a big message. This is not a film a lot of modern viewers will enjoy. It is slow and deliberate with ever scene and not like most Fast paced movies we are used to. I don't say this as something to brag about having watch. The slow pace was hard for me as well. But I stuck with it because I enjoyed what it had to say about the generational conflicts between parents and thier children. You can read most of the conflict by the faces and what is not said by thier children and them as well. This movie is not the most stand out when it comes to camera angles and sound, but the story and theme it represents is masterful. The fact that so much is said without saying it is a true talent by Yasujiro Ozu and the entire cast."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "greggman",
        "review_rating": "5",
        "review_title": "Not all that",
        "review_detailed_main": "I don't really get the praise for this movie. At least in the west I feel like this movie gets praise because of its \"otherness\", not because it's a good movie.\n\nI lived in Japan 15 years so the \"this is different\" is not a draw. Still, the movie is highly rated in Japan as well so that at least gives some support to idea that it's not just this otherness that's making people like this movie, unlike many other Japanese movies that are liked in the west but not in Japan itself. That said, I did enjoy seeing Tokyo in the 50s pre air conditioning and everyone is sweating like crazy.\n\nThe style of having each actor look directly into the camera and speak their lines makes the entire thing feel very unnatural and staged. This same problem plagues other movies by the same director. Instead of filming people having a conversation each person was filmed delivering their lines separately and then the results were spliced together resulting in a extremely stiff and unnatural style.\n\nAs much as I didn't find the movie amazing the basic story did stick with me more than most. It all comes down to the last lines which is that people have their own lives and people outside of the immediate family often don't really have time for anyone else. In other words, mom and dad might have time for their kids and each other but they have no time for grandpa and grandma. They've got jobs and/or other obligations. There is no judgement in that. It's just presented as \"that's life, deal with it\""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "aptpupil79",
        "review_rating": "",
        "review_title": "expectations are a bitch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "nakitah-95722",
        "review_rating": "8",
        "review_title": "Slightly Overrated",
        "review_detailed_main": "In my humble opinion:\n\nThis is not the best film ever made.\n\nThis is not the best Japanese film ever made.\n\nThis is not the best film directed by Ozu.\n\nStyle : both Banshun and TM have great style thanks to the master Ozu.\n\nPlot: TM is a copy of the American film \"Make Way For Tomorrow\" while Banshun is more Original.\n\nActing: TM has melodramatic acting and overacting while Banshun is less melodramatic.\n\nDuration :TM is 137 minutes which is unnecessary for its content and it gets boring and dragged while Banshun is 110 minutes which is perfect for its content and not even a minute is wasted.\n\nTherefore...\n\nBanshun is the best film directed by Ozu.\n\nBut still it's not the best Japanese film ever made."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "badtothebono",
        "review_rating": "8",
        "review_title": "Sho-ga-nai wane or Shikata-ganai ??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "invertedforest-70474",
        "review_rating": "9",
        "review_title": "Nostalgia",
        "review_detailed_main": "I cannot think that this film is about Japanese but foreigners, because all characters are bit different from current people in Japan although this film was made in the old days. For example, such a big family is decreasing in a big city and family relationship changed significantly from those years. However, the theme which is treated in this film is not out of the date. I think that it is a universal theme for every person. In spite of this film doesn't have any action scene, but tranquil scenes and quiet conversations attracted me. Its atmosphere makes me feel good, because it reminds me nostalgic things although I didn't experience."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "raaesquire",
        "review_rating": "10",
        "review_title": "This is Japanese Cinema.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jose-cruz53",
        "review_rating": "10",
        "review_title": "Not as good as I though it would be",
        "review_detailed_main": "Well, lets see, I am not a great fan of artsy films: I am more of an average film goer who loves science fiction and fantasy films.\n\nTrue, this film feels very lifelike, but there are better films about daily life than this one, such as Isao Takahata's, Only Yesterday (a film for which I gave 10/10). This one is flawed: it is too slow going, and so fails to grab my attention as a result I almost feel into sleep during this film. Film critics, with their trained attention spans, are able to appreciate more these slow going films.\n\nAnyway, I still considered this film to be an excellent one, but flawed. But like Citizen Kane, it is rather primitive film and suffers because of it. Yes, modern films are better than these very old ones for the same reason that Van Goth painting is better than the Cave Paintings: a more advanced civilization is able to support more sophisticated forms of art."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Sadelovesmovies",
        "review_rating": "10",
        "review_title": "Relationships do age...",
        "review_detailed_main": "As a Westerner, this film can be hard to comprehend. It depicts a very different family dynamic than I am used to. However, that is what makes the film so engaging. It slowly peels off layers of civility and politeness to reveal a deep humanity and emotional vulnerability that resides within the family. This such a welcomed contrast to the overly dramatic and often one-note American films depicting the subject. Parent-child relationships do change with age, and it is often difficult to navigate. This film is heartbreaking in its honesty."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "CinemaSerf",
        "review_rating": "7",
        "review_title": "Tokyo Story",
        "review_detailed_main": "An elderly couple leave their small fishing village to travel to Tokyo to visit their children and grandchildren. Armed with a small packed lunch and the most perfectly packed suitcase you will ever see, they embark on their train journey to the metropolis. Once there, though, they discover that though they are welcome enough - their son \"Koichi\" ((Sô Yamamura) - a paediatrician, and his beautician sister \"Shige\" (Haruko Sugimura) are pretty much caught up in their own lives and have little time to spend with their parents. In a land where duty is everything, this film depicts the rather unfeeling, though never callous, way in which the elderly pair are bundled from pillar to post, to a spa populated by youngsters and ultimately into the care of their widowed daughter-in-law \"Noriko\" (Setsuko Hara) who makes time to look after and try to entertain them. The film takes it's time. The delicate performances from the older couple are a joy to watch, especially once he \"Shukichi\" (Chishû Ryû) has had some saki with his friends; and she \"Tomi\" (Chieko Higashiyama) is superb as the long suffering, kindly wife who has a stoicism that is both entertaining and laudable. It all comes to an head in quite a sadly poignant fashion, allowing the brief appearance of their other son \"Keiso\" (Shirô Ôsaka) for a conclusion that is both depressing and yet oddly fitting. This is beautifully crafted observation of changing family dynamics, or priorities and of, well, just taking people for granted."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ismamuzzaman",
        "review_rating": "8",
        "review_title": "A lesson in life",
        "review_detailed_main": "An emotionally touching film, with amazing cinematography, great performances and a poignant story about the importance of cherishing every single moment of life."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "rachelrose-87356",
        "review_rating": "7",
        "review_title": "Movie Review Profits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Kdosda_Hegen",
        "review_rating": "2",
        "review_title": "Borderline slow and simplistic film.",
        "review_detailed_main": "This film is a chore to watch. It runs slower than a turtle. The main idea is portrayed quite poorly and in a very boring way. There are barely any problem or drama, yet it preaches us as if there is."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "aprovost-2",
        "review_rating": "",
        "review_title": "Reading too much into Tokyo Story?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "chand-suhas",
        "review_rating": "8",
        "review_title": "No one can serve their parents beyond the grave.",
        "review_detailed_main": "Shukichi and Tomi are visiting their three children in Tokyo. They have a deceased son and his widow Noriko is nice to them. The eldest son is a doctor, eldest daughter runs a beauty salon, youngest son works at a private firm and youngest daughter works as a teacher. All of them are leading a very busy life and when the elderly parents visit them, they find it hard to make time for them except for Noriko. During their stay Tomi falls ill on her way to meet their youngest son. What goes through their lives during their visit to Tokyo, gets documented here while shedding light on what it means to be an adult.\n\nI kept getting reminded of a Kannada film titled School Master which too was inspired from the film, Tokyo Story was inspired from. Unlike the Kannada film or even Baghban, there is no exaggerated depiction of the ungrateful children who refuse to look after their parents. Tokyo Story simply paints the reality as it is and is reaffirmed in a conversation between Noriko and Kyoko towards the end. The children are just busy with their respective lives and that pushes them to not make time for their visiting parents. There is no lack of trying and they have their own guilty feelings to deal with as well. The conversations too are kept as really as possible, be it the father meeting with his friends or even when the couple open up to their daughter-in-law about her remarriage. It's just life and adulting is the larger part of it. The loneliness of the father in the end or the hope the daughter-in-law carries or the way Kyoko looks through the window at a passing train, life goes on is the ultimate message."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jimpayne1967",
        "review_rating": "10",
        "review_title": "SLOW BUT SUCKS YOU IN",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "krational66",
        "review_rating": "8",
        "review_title": "I'm sure most of the disgusting things in this world are unintentional.",
        "review_detailed_main": "I believe that the most disgusting thing in the world is not on purpose,,,, I believe that every murderer had to think this is, I believe that every thief fancies himself in working, I believe that those who married a rich men in touch with a beautiful young lady small delicate hand said, \"my wife don't know what I am\" is true at least half\n\nBut I also believe that the most disgusting thing in this world are the work of the \"innocent\",,, someone said that the most interesting thing in the world behind every great selfless dedication always has a subtle and selfish motives, and each piece of humanity crimes are covered with idealism, beautiful clothes,,, such as the revolution in Paris, such as Hitler\n\nThe world in the cartoon is so called beautiful, because there is always a powerful and evil big boss waiting for us in the distance, and more terrible than a boss that can never be defeated is that there is no boss at all\n\nWhat is evil,,, is famous in the philosophical question of menstruation, and, on the first floor reply say the opposite of evil is good, is the object, all of us should fight,, said fart upstairs on the second floor, there is no such thing as evil, evil is no good,,,, religious people say evil is a kind of trial, is a kind of punishment, is a paradise for sifting who can on the eternal tool,,,, out of the endless squabbling,,, I like a very artistic,,, god is like a candle, and near him, just as the multipoint, away, as the less\n\n\"Evil lies in the details,\" said another. \"I think the story of Tokyo is the perfect commentary on that.\n\nA group of children under the politically correct \"mom dad we love you\" banner, some put the parents to the attic a regardless, others like kicking a ball, a more even surface didn't dew,,, you say they love their parents, and the answer is yes, they all love their parents, but have you ask them if they are good children, this problem is hard to say\n\nThe lovely grandchildren either think about how long their desks will be occupied and whether they can go to the department store, or they don't even bother to talk to each other\n\nMany people often say that children simple kindness, simple is true, but said that children kindness is probably the biggest lie in the world, those who say that children only see the child's desire is simple, than adults make a fortune to be a high official easy to meet much, but did not see once there is no satisfaction after the difficult than adults are much stronger,\n\nIf you can throw all these unfortunate children in this group of shameless, it would be good if we can exalt banner accused them of inhuman this much good,,, but it is not ozu yasujiro,,, they are ordinary people, not too good, nor too bad, they are us and you, even better than some of us,,,, we are always very natural default himself at least is not a bad person, hurt parents like this will only happen on others, never is their own, but from life when we transfer to the front of the screen, see only indifference and selfishness\n\nIt is said that the most horrible thing to see a horror movie is not the ghost crawling out of the screen, but a turn of the head to see the side of the friends watching the movie is the ghost\n\nIn that sense, the Tokyo story is a perfect horror movie"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "sebastianjoseph-55035",
        "review_rating": "9",
        "review_title": "The only chance",
        "review_detailed_main": "This film shows life in the most simplest way. There is only one shot you have to either take or not take it. If didn't take it then you will regret about it some day but life has to go on gather strength from those failures and go on."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ChorusGirl",
        "review_rating": "10",
        "review_title": "Early Reality TV",
        "review_detailed_main": "Quite unlike any other film...with a camera so passive it almost feels like we are eavesdropping into the lives of this family. As in McCarey's similar MAKE WAY FOR TOMORROW, there are no obvious villains here...though the adult children may be selfish, many viewers will be able to sympathize with them. While parents fear dying alone, children fear having the burden of aging parents. TOKYO STORY never lets you forget this.\n\nOzu's style is interesting, avoiding scenes that an American director would have milked for maximum dramatic effect, and preferring to focus on the aftermath instead. The tone is so even, and the film so long, many are likely to find it a tad exasperating. Patient viewers will be rewarded, as the layers of this family are uncovered (the reunited fathers, all in a saki buzz, revealing their disappointments with their children, remains my personal favorite scene). Most memorable: the almost total lack of physical affection displayed, which may come as a shock to Western viewers. See this movie alone, just you and the screen."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "evening1",
        "review_rating": "6",
        "review_title": "\"What a palaver\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Red-125",
        "review_rating": "10",
        "review_title": "A masterpiece from a master director",
        "review_detailed_main": "The Japanese film Tokyo Monogatari was shown in the U. S. with the translated title Tokyo Story (1953). Yasujirô Ozu directed this movie. Ozu and his long-time scriptwriter colleague Kogo Noda wrote the screenplay.\n\nThe movie stars two of Ozu's star actors--Chishû Ryû and Setsuko Hara. They portray father and daughter-in-law. Shukichi Hirayama plays Ryû's wife. (Hirayama was an important Japanese actor, but she isn't linked to Ozu the way Chishû Ryû and Setsuko Hara were.)\n\nTokyo Story is the last film of what has been called the \"Noriko Trilogy.\" It was preceded by Late Spring (1949) and Early Summer (1951). The movies are all independent, but each film features a woman named Noriko, played by Ozu's muse, Setsuko Hara.\n\nAll three films deal with family dynamics. These dynamics exist within the changing world of post-war Japan. Characters adapt--or don't adapt--to the new bustling business-oriented Japan of the late 1940's and the 1950's.\n\nThe story is basic. An aging couple, who live in a rural area, travel to Tokyo to visit their family members. The plot consists of the ways in which they are welcomed, and their reaction to their welcome.\n\nThis movie is over 65 years old, and it has stood the test of time well. I consider it a masterpiece, and I'm not alone. Over 70% of IMDb raters gave it a rating of 8, 9, or 10. It was considered the best film of all time in a poll of film directors by the Sight & Sound magazine. It's among the IMDb list of the top 250 movies of all time.\n\nWe saw this film on DVD, as part of the Criterion Collection. Included as specials were two movies: I Lived, but ... (1983) and Talking with Ozu (1993). I've reviewed both of those films for IMDb.\n\nTokyo Story has a fabulous IMDb rating of 8.2. I had no hesitation in rating it 10."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "sperkinz",
        "review_rating": "5",
        "review_title": "What makes this a masterpiece?",
        "review_detailed_main": "The movie is ok if super long. At 1.75 hours I thought when is the thing they've been foreshadowing for an hour going to happen?\n\nThe acting is fine. In parts lovely and in parts terrible as is fairly typical of 1953.\n\nThe story is fine if it had been an hour shorter. The elderly parents take a trip from the country to Tokyo to see their successful children who are busy. They see some sights and go to a spa. That's the first 1.75 hours. I won't spoil the thing that happens but you've been expecting it for an hour at that point.\n\nThe cinematography is fairly standard for a 1930s movie. There are a hundred shots down halls or through doorways where rhe action is at the end of the framing. I don't know what it's called but it's been used a ton since the 1930s and could have been cut by half. There are scenic shots. There are shots where one person is looking straight at the camera and says their line with a poignant look and then a shot of the person they are taking to responding and a poignant look and back again. This is where a lot of the acting is bad but it's hard when someone is asking you to make a face conveying your thoughts instead of actually interacting.\n\nNearly every scene begins or ends with someone coming or going outside and removing or putting on shoes. There were 10 too many of those scenes and that added up to 10 of the too many minutes.\n\nI don't get it. Acting fine, story fine, cinematography non-inventive, too long by an hour. Why does anyone consider this a masterpiece?"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "dibau_naum_h",
        "review_rating": "",
        "review_title": "Arguably most perfect embodiment of human feelings in art",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "tyson-hunsaker",
        "review_rating": "8",
        "review_title": "A moving and somber picture about time and perspective.",
        "review_detailed_main": "Tokyo Story won't appeal to movie-goers of all kinds but will definitely attract those who enjoy slow-paced character studies with relatable themes that make us think about ourselves and those we love. This 1953 masterpiece depicts an older couple living in country side Japan visiting their children in Tokyo. As they visit their family they receive colder welcomes than expected with the exception of an exceptional, widowed daughter in law.\n\nYasujiro Ozu manages to paint a rather unsettling portrait of post-war life in Tokyo with a strong disconnect from family and a hopeless feeling of loneliness as the couple drifts in the overwhelming landscape of Tokyo. It's obvious great care was taken into the script by the authentic dialogue and humanistic tone of the scenes. The film beautifully explores themes like younger vs older generation gaps, meaning of life in contrast of war, loneliness, and the roles of children and parents.\n\nIt's not easy examining a clear cut story structure but the story seems to be the daughter in law's story as she fills the slot of the audience as an observer watching the family treat each other. Yet, enough character payoff happens to allow some catharsis. While the structure is hard to examine, Tokyo Story feels as complete and thorough as any film can be.\n\nAnyone looking for a deeper and methodical character piece, Tokyo Story is not only highly recommended, it's an incredible study that gets better as each viewing passes and more time passes to mentally digest the film's depth. While it may not appeal to everyone, it most certainly is study reference material for any would be filmmaker on several narrative levels."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "haabub",
        "review_rating": "10",
        "review_title": "Whispers of Regret",
        "review_detailed_main": "\"Tokyo Story\" (1953), directed by Yasujiro Ozu, is a deeply touching film that resonates with profound sadness. It poignantly explores the themes of familial duty and the inevitable regret that follows neglect. The narrative delves into the emotional depths of honoring one's parents, urging viewers to reflect on their own relationships.\n\nThe film's core message is encapsulated in the poignant quote: \"Honor your parents while they're still alive, for one cannot serve one's parents beyond the grave.\" This sentiment is beautifully woven into the fabric of the story, illustrating the fleeting nature of life and the importance of cherishing loved ones while they are still present.\n\n\"Tokyo Story\" masterfully portrays the sorrow and longing that accompany the realization of missed opportunities to show devotion to one's parents. The film's slow, deliberate pacing allows for a deep emotional connection, making the eventual loss all the more impactful. The characters' journeys are marked by a profound sense of melancholy and reflection, highlighting the universal struggle of balancing personal ambitions with familial responsibilities.\n\nThe film's simplicity and understated elegance enhance its emotional power, making it a timeless classic that continues to move audiences. \"Tokyo Story\" is a heartrending exploration of family, duty, and the irrevocable passage of time."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "rejj2369",
        "review_rating": "9",
        "review_title": "Timeless and always relevant",
        "review_detailed_main": "Tokyo Story is a masterpiece deserving of its reputation as one of the greatest films of all time. The minimalist cinematography and the introspective dialogue never falls into obscurity and pointlessness because they have in harmony with each other. The \"tatami\" shots or low angle shots invite the audience into Ozu's masterful interpretation of the real world. And the quietness and unhurried dialogues about famiy feel modern and always relevant. Then you realized it was filmed in 1953! While other films of that time are melodramatic, Tokyo Story lets drama unfolds naturally. I find myself coming back to the film whenever I feel melancholic."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "synsen-40334",
        "review_rating": "9",
        "review_title": "The essence of life",
        "review_detailed_main": "Slow and poignant, almost the mirror of a lifetime. A story greater than the movie, it had to be. We all know the story, no one is exempt from this situation. If not parents, it can also be another family member, or just a friend. The film makes you step back, and just look away for a minute. Years flow through your head, and you wonders what your life really means. Great film, great story."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "valadas",
        "review_rating": "8",
        "review_title": "A Family Story",
        "review_detailed_main": "An elderly Japanese couple who live with their youngest daughter in a small town far from Tokyo decides to travel to the capital to visit their children and grandchildren who live there and they haven't seen for some years. This visit reveals several aspects of human relations within the family from the good sentimental ones to some displays of indifference, selfishness and self-indulgence. Several moving scenes and dialogues ensue in the typical Japanese social atmosphere of delicacy, politeness and courtesy very well depicted. Although there are not particularly dramatic scenes the atmosphere is realistic enough in psychological terms to allow us to be aware of the real feelings of the characters with great depth. And the story has also to do with such deep themes as life and death, young age and old age and the generation disparities It's a very humane, moving and even pathetic movie indeed."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "XxEthanHuntxX",
        "review_rating": "8",
        "review_title": "A simpel casuel masterpiece",
        "review_detailed_main": "When I started playing this film I had very high expectation because I've looked around many films and this one was very highly rated. And I must say I understand why this one is, to many, one of the best films ever made. While It wasnt quite the sort film I usally whatch or use to enjoy, it was very entertaining trough the whole film. Tokyo Story is a beautiful work of art with a very important message, to pay attention to everyone, and in this film especielly your parents. And this The film express with showing two parents visit their children, and you could think its not enough to base a film of but somehow Tokyo Story make it look so simple and deliver it so perfectly. And is what make it so special. An other thing is how its made, The film is of course very old and the way of filming was sourly very didderent back then. But I believe this film even is different from film still from this time period, maybe becausd it is from japan. Anyhow The film is so casual and something other filmakers dont included or think about to included because they dont make any different is in this film very much included and its those little things which make it so speciell. And I think this film could not be made again the same way and could not be made some other way then it did, it just so perfect with the time period, the culture, the characters, the atmosphere, etc. But there is still somethings I can recognise In the time and place I live in."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "benjamin-wasneeplus",
        "review_rating": "9",
        "review_title": "Subtle, dignified and intense",
        "review_detailed_main": "There is a certain aura around Ozu movies that tends to scare away more casual viewers. They are movies about life, about ordinary folks people often say. One might hear that and think it's a bore fest meant for only the more ardent art film snobs. But that would be a mistake. Tokyo Story is not boring. Yes, it takes a while to get going, but if you're afraid of some kind of Andy Warhol experimental visual poetry, then it's time to put those fears to rest.\n\nTokyo Story is a thoroughly engaging drama with all the intensity of a Lord of the Rings or Godfather. It's just that instead of larger than life characters and situations, the movie is about exactly as large as life characters and situations. That life includes family relationships, disillusionment, ageing, illness and death. At the same time the characters are all Japanese and often respond with the kind of outward tranquillity that would make an English gentleman jealous. The emotions are big, but they are all subtly conveyed by the actors. This may throw off some viewers, but it rewards those who pay close attention. There isn't much plot to speak off, but that doesn't mean things aren't constantly happening, nor that the movie doesn't go anywhere. Quite the contrary: at the end it feels like everything has come full circle in a very satisfying way. There are many messages that touch on philosophy and existential questions, for those that like that sort of thing. The main thing I want those interested in watching this movie to take away however, is that this is not just a movie for film buffs. It is a piece that can in principle be enjoyed by anyone who likes drama with a solid emotional core. Don't be scared and give it a try!"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "frshdmirian",
        "review_rating": "5",
        "review_title": "Completely Overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "LenoJeno",
        "review_rating": "10",
        "review_title": "One of Cinema's Greatest Achievements",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Josua_E_van_Hansen",
        "review_rating": "9",
        "review_title": "Tokyo Story - An essential piece of cinema for any Film scholar and cinephiliac",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "h-28658",
        "review_rating": "9",
        "review_title": "This movie is the type I admire.",
        "review_detailed_main": "Revealing its characters and plot through context rather than simply informing the audience, Tokyo Story is a masterful demonstration of conveying emotional impact without relying on base shock. A beautiful exploration of how both tradition and the individual interact in the context of both timeless character struggles (greed, ambition, and selflessness) and a turbulent, changing environment."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "krocheav",
        "review_rating": "8",
        "review_title": "Tokyo Story Surprises",
        "review_detailed_main": "It surprises me to find Tokyo Story regarded as one of the greatest Films of all time. I doubt many of today's audiences, both the young and not so young, would know how to watch a film like this. At first it deceptively seems more like a simplistic documentary - one with very little shape or substance, about the distances between families - then, as it moves slowly forward it begins to unnerve the patient viewer by introducing undertones - feelings and thoughts that each of us may (should) experience at some time in our lives. I'm also sure many who attempt to watch this film won't even get past the first 15-20mins. And, it will be these folk who will die without ever allowing themselves to fully experience the real-life family emotions that motivate this fine work.\n\nSo, it's with great pleasure I find this curiously simple (yet complex) movie being so highly regarded between differing cultures. In some ways, it made me think of the Michael Powell/Emeric Pressburger British classic \"A Canterbury Tale\". While it's true there may be little to compare between the two, they each brought a rich reward to the thoughtful viewer who stayed to the end. Sensitivity is a gift many lack.\n\nThe remastered (Criterion) DVD releases are to be commended for quality; the one I screened was the Madman release. Now to find the 1937 American film this Japanese story was inspired by; \"Make Way for Tomorrow\"."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "marmar-69780",
        "review_rating": "8",
        "review_title": "Tokyo story",
        "review_detailed_main": "Tokyo story is a film that has a very simple story but that is also the reason why it works in such a good way and why is considered to be cult classic and must watch for every movie lover,but even if i liked it and appriciated it,i woudnt say that this movie is one of best ever made,story like i said was very simple,we are following two eldery persons who come from village to Tokyo to see their children,but they ended up dissapointed cause their kids dont have a lot of time for them and they ignore them in some ways,to me such a story lacks more depth and character development and arcs,and here we got very little of that,pacing also in some scenes was very slow and it was dragging a bit,Tokyo story was in end a very satisfaying and relatable movie but to me it lacked bigger emotional impact and richer story development"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mentai-a",
        "review_rating": "9",
        "review_title": "A bond of family",
        "review_detailed_main": "An old couple visits Tokyo to meet their children for the first time in 20 years. However, their children were very hard, and they are unkind to their parents. This movie focuses on family ties and life and death. This movie draws a reality of family in Japan. Almost all children leave their home and live their respective lives. Of course, I think I will be one of them. It is often forgot that parents are always worried about children, and we also have to consider our children. This movie reminds us important things which we tend to forgot. This movie draws a family from the point of view of parents, so we are made notice that we have to be dutiful to our parents. After watching this movie, I consider the importance of family, and I think I want to tell my parents thanks. I want many people watch this movie."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "Marwan-Bob",
        "review_rating": "9",
        "review_title": "Less is more",
        "review_detailed_main": "If there were ever a film to define the phrase \"Less is more\" it would be Tokyo Story. It's so simple yet I find it unbelievably compelling and moving. This is mainly thanks to the nuances of the cast that portray so much emotion. For example, Chishu Ryu's subtle performance conveys everything. In a scene where he is plainly nodding, deep down inside you can feel all the sadness and pain he is feeling and it hits you hard. Ozu also never makes the film feel overly sentimental with earned emotional moments and explores the human condition so beautifully. A true masterpiece of cinema."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "claytonhq",
        "review_rating": "5",
        "review_title": "Slow",
        "review_detailed_main": "I don't normally bother reviewing films on here because the ratings are generally pretty accurate. Not so with this one.\n\nArt critics and film students (I was one myself) might have certain rarified tastes but those with average sensibilities will find this film slow to the point of being an ordeal.\n\nEven though this film is now 70 years old, the message, that young people don't have much time for old people, wasn't even new back in 1953. And that really is all that this film has to convey. As with many art films, (and almost anything by Terence Davis or Ken Loach), the lack of almost any development in the narrative makes it a tedious watch."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "st-shot",
        "review_rating": "8",
        "review_title": "Tokyo's universal story .",
        "review_detailed_main": "Less than a decade after the war, normal everyday life once again concerns the citizens of Japan trying to make a go of working a job and raising a family. Coastal seniors Shukishi and Tomi Hiyarama far from bustling Tokyo and Osaka decide to take the trek to visit their children. More inconvenince than pleasure, the busy children approach what to do with mom and pop with a variety of moods and ideas to keep them out of their hair.\n\nTokyo story is a subtly powerful film dealing with the family dynamic in changing times where the \"Japan miracle\" has little time or patience to deal with visiting parents. They may love and respect them but they are not part of the future and in the way.\n\nThe complete opposite of Japan's world famous action director, Akira Kurasawa, Yasujiro Ozu delivers a patiently moving work with a universal theme, that reaches across all boundaries and addresses all regarding parental relationship. Utilizing a static low angle camera view Ozu quietly unrolls his story without rage or accusation. With supple resignation, his characters suppressed by tradition and guilt trying to maintain a respect by ignoring the undertones evolves into more than one heartbreaking scene especially when the mother and father (movingly played by Chishu Ryu and Chieko Higashiyama) stoically review matters of the past and present. Tokyo Story is a fine work of touching melancholy."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "kamranium",
        "review_rating": "10",
        "review_title": "Timeless monument for the ordinary life",
        "review_detailed_main": "When the movie made almost 70 years ago, in a country so far and culture so different to mine makes me rethink and change some fundamental aspects of my life at 29 - The value and artistic merit become something secondary, almost like a byproduct of a timeless perfect monument build to venerate the ordinary human life."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "pedrodepedra",
        "review_rating": "10",
        "review_title": "Captivating masterpiece",
        "review_detailed_main": "This important story of time affecting families, culture and society is made with a lot of love and attention to detail. Every shot is almost a still that could be in any art exhibition. The low, fixed camera angle for every scene makes you a spectator as if you are sitting inside the Japanese households yourself. Top level cinematography while at the same time maintaining a very high quality in story telling and acting. That is a very rare combination to achieve. It is remarkable how this 1953 film could be so ahead of its time in all aspects of filmmaking. 70 years later you still see elements that inspired so many movies since. A true masterpiece."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "8",
        "review_title": "An influential Classic from Japanese Cinema on Old Age Circle.",
        "review_detailed_main": "Tokyo Story (1953) : Brief Review -\n\nAn influential Classic from Japanese Cinema on Old Age Circle. I don't know if it's valid to mention some other films made on same topic in Bollywood or not because Tokyo Story came much before any other industry would think of it. It is original but still very different from other flicks based on pain of old age life because more than drama it focused on real life. Tokyo Story proved that you don't have to make it over dramatic and highly emotional to give justice to this wide appealing story. While others failed to catch the realism, Tokyo Story caught it way before and at first place. It tells the story of an aging couple who travel to Tokyo to visit their grown children. The film contrasts the behavior of their children, who are too busy to pay them much attention, with that of their widowed daughter-in-law, who treats them with kindness. At last it's all about Solitude and that's what we actually see in real life. I got confused many times while recognising the characters because their appearances were kind of quick and go but by the time it came to conclusion i was all clear about them. Acting by all the actors looked good and as i was too busy reading Subtitles i couldn't pay attention to thier expressions. Screenplay was slow till the half of the runtime but it worked like a slow poison which left impact at the end. Some Dialogues were Amazingly written which tells about how parents look at their grown childrens and what comes from the other side. Director Yasujiro Ozu kept the moral and essence alive throughout the narrative and he didn't fall lose to seek any tear-jerker sequence. Japanese Cinema was ahead of other film industries in 50s decade and Tokyo Story is just another instance for it. Overall, Tokyo Story is cinematically brilliant and stirring portrayal of old age circle which hasn't been achieved by others over the years.\n\nRATING - 8/10*\n\nBy - #samthebestest"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ASuiGeneris",
        "review_rating": "8",
        "review_title": "Ozu has made art here, but it is a unique style that can prove not as easy to view as to admire.",
        "review_detailed_main": "Tokyo Story (Japanese: Tôkyô monogatari) (1953)\n\nAn earnest story, Parents' final visit with Ungrateful children. Elegiacally shot, Timeless tale with much to teach.\n\nI tried really tried, To love this critic's darling. Though praised Ozu's art, Pendulum's steadfast slow pace, Characters hard to relate.\n\nSomonka is a form of poetry that is essentially two tanka poems (the 5-7-5-7-7 syllable format), the second stanza a response to the first. Traditionally, each is a love letter and it requires two authors, but sometimes a poet takes on two personas. My somonka will be a love/hate letter to this film?\n\n#Somonka #PoemReview"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "zzhhhqing",
        "review_rating": "10",
        "review_title": "Ozu's Desolation and Enron",
        "review_detailed_main": "Under the lens of Ozu, there is a rare tranquility and harmony, but it is also full of fun. The characters greet the social changes and emotional fluctuations in ordinary activities, just like a slow river, quietly flowing, the world 's \" \"Samsara\" and \"Impermanence\" revealed that they are sincerely moving ..."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "leonardonolan13755",
        "review_rating": "8",
        "review_title": "Respect To Our Parents...",
        "review_detailed_main": "First InThis Film Camera Working Very Good, In Start You Can See Three People Sitting In The Room In Different Situation In One Shut, The Old Woman Is Talking His Husband Is Listening & Thinking And The Young Girl Is Packing Own Food For Her Work, I Can See A Lot Good Depth Of Field In Tokyo Story, And I like Another Scenes When Three Old Friend Sit In Bar And Talking About Own Children's And They Just Complained About It ,One Of Them Lost Two Boys In War Another One Not Happy With His Son But The Oldest Lost His Boy In War Too & Not Happy Too And They Talk And Drink To Forget They Miserable Life , This Film Is About Real Respect To What We Have And We Don,t Even See, Parents , Family . In One View Father And Mother Sit Next The Big Door House And Talking About Come Back To Own City Or Village With Train, And I Think Ozu This View Meaning The Reall Place For Them Is Something Big Like This Door That They Can Live There And They Need Company For Rest Of Life, Just Respect Them , Our Parents."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "mahmus",
        "review_rating": "10",
        "review_title": "Quietly moving",
        "review_detailed_main": "A movie so beautifuly simple I didn't realize the deep emotional impact it was having on me until it was over and I felt a strange mixture of sadness and calm"
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "I_Ailurophile",
        "review_rating": "9",
        "review_title": "Earnest, thoughtful, and softly elegant",
        "review_detailed_main": "There are obvious broad comparisons to be made to Leo McCarey's underappreciated 1937 film 'Make way for tomorrow,' and filmmaker Yasujiro Ozu is indeed remarked to have taken inspiration from it in fashioning this 1953 classic. Both share kinship in the story of an elderly couple who visit their adult children, and of the gulf that emerges between them in the process. Even with contextual differences of time, culture, and circumstances, both grasp for the same thrust of exploring, more or less with the older couple's perspective, the difficulties of aging, and of parent-child relationships after many years in a changing society. For whatever major narrative disparities there are between the two titles, however, it also strikes me that 'Tokyo story' is a tad more plainspoken and straightforward in its imparting its tale, rather realist; furthermore, most of these 135 minutes come across as especially gentle in their approach, allowing the story to speak to us as it will entirely on its own strength. The pacing is soft, and the tone generally quite even-keeled and almost flat; only occasionally do discrete flames of more concentrated drama rear their heads, mostly in the latter half, and even Takanobu Saito's score varies between the lovely, poignant, emotive themes we most anticipate, and more upbeat themes that partly countermand the otherwise drama.\n\nOne result of these impressions is that I, personally, don't necessarily find the picture to be as completely absorbing and impactful as it could be. No one flick is guaranteed to meet equal favor with all comers, true, and I accept that I'm in the minority in this regard. I wonder if I wouldn't find the piece more strongly affecting were I more in tune with contemporary Japanese culture, though I'm inclined to think it's also owed, regardless, to some combination of the writing and direction: all the right ideas are there, but just not always perfectly realized in a form that totally resonates with me. Despite its lofty reputation and overall excellence, I don't find 'Tokyo story' to land with me with as much success as McCarey's comparable feature, nor some of Ozu's other features (e.g., 'I was born, but...'). Still, this is splitting hairs. By and large the movie is plainly outstanding, and notes of stylistic approach don't significantly weigh on the whole. The direction and cinematography come across as relatively stark and simple, but there's an earnestness and elegance in these that are nevertheless deeply gratifying. More outwardly noteworthy is the acting; though similarly restrained, and not specifically remarkable, each performance is marked by terrific natural presence and nuance that further cements the overarching film-making ethos. The entire cast is excellent, and one would be remiss not to speak to each actor individually, but it's safe to say that Chishu Ryu and Chieko Higashiyama stand out most as Shukichi and Tomi.\n\nIn all other ways this is wonderfully well made, including gorgeous filming locations, production design, and art direction. Nonetheless, the core of the film lies in Ozu and Kogo Noda's screenplay; while I for one don't believe that every idea is brought to bear as meaningfully as they possibly could have been, there's no disputing the fantastic substance that lies at the center of it all. One need not be fully versed in the details of Japanese society in the 1950s to recognize the considerable parity between this setting and any other in which the tale might be told, including our modern world. The particulars may change, but the essence remains the same: the diminishing lives of the elderly, how easily an emotional distance grows between family members, the greater societal pressures that place limits on and may even redefine interpersonal relationships, and so on. Exactly how much each viewer takes away from the picture will vary from one to the next, but surely even those who are the hardest to please will look at 'Tokyo story' and see what a deserving masterpiece it is. That I don't revere this in the way that many others do does not take away from how superb it is when all is said and done. I would stop short of calling it an absolute must-see, but when a filmmaker or a single title operates on the level that Ozu does here, it would be a terrible mistake to pass up any opportunity to watch. Whether or not you end up holding it in the same esteem that so many others have, 'Tokyo story' is a quietly marvelous piece of cinema that most everyone should see at some point."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "jamesrupert2014",
        "review_rating": "9",
        "review_title": "Touching tale of an elderly couple in post-war Japan",
        "review_detailed_main": "Shukichi and Tomi Hirayama (Chishu Ryu and Chieko Higashiyama) leave their home in Onomichi in Southern Japan to visit their children living in Tokyo. Their eldest son (a physician) and daughter (a hairdresser) host them, seemingly more out of feelings of obligation than love, while their daughter-in-law (whose husband died in the war) is more gracious. The film is meditation on aging, on dealing with loss and change, and on the relative importance of the past and present. Not much happens, many of the scenes are slow, and there are numerous images of a rebuilding Tokyo interspersed with the human drama but the imagery is beautiful, especially of the elderly couple sitting together on a bench or on a wall overlooking the sea. 'Tokyo Story' is poignant, almost sad, but never sentimental or maudlin and the characters are very human. A moving, humanist film about the inevitable."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "ssssgelojun",
        "review_rating": "9",
        "review_title": "Tokyo story",
        "review_detailed_main": "Only those who see through life and death can make such a movie.\n\nI was too careless, If I had known it, I should have treated her better when she was alive.\n\nThis line is the Tokyo story of the father after the death of his wife, between the words except for a trace of regret, there is no sadness.\n\nAfter the funeral, all the children and relatives had left the old house, and my father remained in the shabby house, stubbornly at ease. An afternoon can be spent on a cattail fan, a plate of incense and a pot of tea.\n\nJust a little side of his wife, not a woman talking about parents, a little lonely.\n\nThe film ends abruptly, leaving viewers with numerous feelings and feelings of regret.\n\nAh, a home, how to let a person yearn for, but bound to the place of daily necessities."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "trouble50",
        "review_rating": "9",
        "review_title": "Fail",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "naoyashiro",
        "review_rating": "8",
        "review_title": "Surprisingly profound, cinematic awesomeness",
        "review_detailed_main": "\"Isn't life disappointing?\" \"Yes, it is.\"\n\nShige the hairdresser (Haruko Sugimura) and Koichi the doctor (So Yamamura) don't have time to spend with their parents who visit Tokyo. So their sister-in-law, Noriko (Setsuko Hara) takes care of their parents.\n\nI'm a Japanese in Tokyo. So here is my Tokyo story: for me, it's easier to watch Western films than this film which feels too familiar. People here are depressed and impolite because they have their responsibility. \"Japanese is polite\" is a myth. We can't even respect our family, like Shige and Koichi. Foreign people tend to mistake the Japanese as \"racist\", but the truth is we live on such a domestic island and barely see you in person, so we behave like a weirdo when it just feels a bit strange to see you in person. The school teaches us nothing except for useless math equations. And we have mommy/daddy issues as well. I remember I quarreled with my mom because she always asked me to do the chores despite her never asking the same for my brother. I asked her about gender roles, and she said that she didn't even think about it because it is so natural for her who grow up in a conservative, typical Showa family. Since then, she stopped asking me to do the chores. Of course, I don't have a right to be mad. Why could I have a right to be mad?? Sometimes it's easier to take care of strangers than family. We bow, but it does not necessarily show respect because we can do it without our hearts. We're humans as well. Sometimes the conversations with strangers are much more substantive than those with family. When I watched Barbie with her, she only said \"Ryan Gosling was so cool.\" There are so many good things here, though. Everything is clean and I can walk alone at midnight without worrying about serial killers. Matsuri (it's like a festival related to god but far more casual so even atheists and tourists can attend) is so beautiful and magical (I'm not exaggerating. You should see it with your own eyes at least once. Actually, I'm writing this review listening to Taiko.)\n\nI recently started to watch films outside my comfort zone, including this film. Watching it, I realized that I was biased, too. This film depicts complicated humanity in unique cinematography. The characters directly talk to the camera, and it's almost like breaking a 4th wall. Those showa people are human too. They indeed have gender roles but it's their standard and they have their own joy in life. They are very much \"civilized\". I'm disappointed in myself for having been aggressive with my mom without knowing anything a few years ago. Anyway, it's unrelated to this film. But when films resonate with personal stuff, I think it's a sign of a masterpiece.\n\nWe take our family for granted and gradually we can't even care about each other. So it's just too late when the grief knocks on the door. Noriko is always smiling. So when her smile disappeared, I was awed by how much grief she held.\n\nI can't write deeper things because my thoughts were mixed by Ozu. So I just say I'll revisit this film after years."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "rctng",
        "review_rating": "9",
        "review_title": "!",
        "review_detailed_main": "When you finish seeing this movie, I would like to have come to meet a family very much. When a child separated from parents, and I would get married and I married into other family, I thought what kind of thing I would consider. It was thought that it was a humane movie. The problem of marriage and death is faced also at what home. It was the feeling which is looking at its future.\n\nI thought that the scene by which the old couple came for play to Tokyo wanted to be very impressive, and to become an old couple for whom I also regard a partner as important and support. The scene which the stubborn father opened the heart and carried out the cotton of the clock of a wife's keepsake and Shukichi introduces Kyoko shyly felt for its familiar thing, so entered into the talk all the time."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "tosh-661-856104",
        "review_rating": "9",
        "review_title": "The good old day",
        "review_detailed_main": "The good old days of Japanese family are described on this film. It starts from the scene of the life of one family in Tokyo.Father and mother, and two children are there. They invite their parents to their home from the country-side. And they go around some places of Tokyo. However, the parent feel sorry for staying several days and decide to visit and ask to stay their house. In the last scene, the unpredictable accident happens. In this film, likely case family of the previous times is described such as gentle grand parent, a stingy wife. And the conversations of each family members are very peaceful. If you haven't watched, you should check it."
    },
    {
        "movie_id": "tt0046438",
        "movie_name": "Tokyo Story",
        "movie_rating": "8.1",
        "review_username": "pisrgofort",
        "review_rating": "",
        "review_title": "good",
        "review_detailed_main": ""
    }
]