[
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Fun!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "siddhantsutar",
        "review_rating": "5",
        "review_title": "No story, stretched out comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "arsenalunveiled",
        "review_rating": "5",
        "review_title": "Gets you laughing or does it?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "Rohit repeats almost everything in his own trademark style but still manages to make you laugh.",
        "review_detailed_main": "Make way for the First Ever Bollywood Trilogy and that too in the enjoyable genre of comedy brought to you by the lucky director Rohit Shetty. You really need to be both extremely talented as well as lucky to hit the Jackpot three times in a row in this unpredictable world of cinema. But Rohit does it again with his GOLMAAL 3 and he would now be remembered more as the First Bollywood director to deliver a HIT COMEDY TRILOGY in our Hindi Film Industry (looking at its initial box office response).\n\nIn clear words,GOLMAAL 3 has nothing new in terms of storyline, script & content. It has no surprises to offer as you are already familiar with every character and his famous mannerisms on screen and it also cannot be called as a cinematic masterpiece from any angle.\n\nFor instance it starts off with the same Carnival kind of song wherein all the lead actors perform their individual stunts and make grand entries. There is a riff between two opposite groups of friends having one strong man amongst them. A comic gangster walks in with his own funny associates. There is a police inspector who is made fun off at regular intervals. A good fight sequence comes in between wherein the hero makes his action entry at the right times. A girl character is there to add the glamour quotient and she keeps interacting with all the boys in her own vivacious style. And then comes the climax, getting everyone together on the screen fighting hilariously with each other.\n\nSo there is nothing fresh or new as far as the treatment of the movie is concerned. Even the colours on the walls of the sets are also the same reminding you of its first two parts of the trilogy. But despite of all this repetitiveness, very surprisingly Rohit Shetty and his GOLMAAL 3 still successfully manages to make you laugh consistently and provides you enough entertainment to have a good time in the theater. And for that the director and his entire team of writers really deserve their praises (especially the dialogue writer).\n\nThis time Rohit takes his inspiration from \"Khatta Meetha\" (1978) and \"Hamare Tumhare\" (1979) based on the story of two old people getting married having their own young kids who are not ready to adjust with each other in their newly found relationships. Interestingly these two films were also based on two English films and they were \"Yours, Mine, Ours\" (1968) and \"With Six You Get Eggroll\" 1968). Mithun Da and Ratna Pathak Shah play the two elderly lovers here and Ajay, Shreyas, Arshad, Tushar and Kunal are their grown up kids. Kareena is the neighborhood girl who actually is responsible for the pleasant re-union of the couple.\n\nIn short, if you really want to have some fun without thinking logically for a few hours then I would readily like to recommend watching GOLMAAL 3 for four specific reasons alone :\n\n1. If you are a true fan of Mithun Da, then it's a must watch for you as it showcases an entirely different persona of the veteran where he is really enjoying himself playing it loud and comic. So it's seriously a not to be missed venture for all Mithun Da fans for sure.\n\n2. The movie has Johny Lever returning to his great lost form after \"All The Best\". And he is simply superb in the role of a Gangster who suffers memory loss occurring every few minutes in his scenes.\n\n3. The most famous product of GOLMAAL series remains the silent character of Tushar Kapoor having his own hilarious language of actions and gibberish words. And the actor gives the most sincere performance in this third part of the series which really deserves a watch.\n\n4. And lastly there is one particular sequence in the film, wherein all the boys are teasing each other, with only their suggestive actions, without using any kind of verbal exchange between them. The scene which is brilliantly directed by Rohit and superbly enacted by all, stays there for a good 4-5 minutes and can be called as one of the major highlights of the film.\n\nWith every character getting his own justified screen presence, the script-writer and the director handles the big star-cast quite intelligently. Lead by Mithun Da and Tushar Kapoor from the front, GOLMAAL 3 has everyone in its team performing at their best. Ajay looks cool & tough in his rugged look. Kareena fits in her role as a 'T' and plays it real well with all those supposed to be \"Abusive Remarks\". Arshad, Shreyas and Kunal provide their confident support having a good time together. And the supporting cast equally contributes to the laughter with Vrajesh Hirjee, Sanjay Mishra, Mukesh Tiwari, Ashwini Kalsekar and Prem Chopra playing their roles perfectly.\n\nOn the downside, GOLMAAL 3 has a weak soundtrack as compared to its previous films and its Cinematography is almost the same as seen in its first two parts. The look and feel of the movie is nothing different from its earlier versions, which also makes it monotonous at times. Actually the film relies majorly on the comic timing of its talented star ensemble and on its hilarious one liner dialogues written skillfully.\n\nTherefore if you are a game for having a good time, within a seen before kind of settings then GOLMAAL 3 may work for you. Otherwise it is nothing path-breaking or exceptional which can set a new benchmark in cinema. Watch it only for Mithun Da, Tushar and Johny Lever and you will not have anything much to complain."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "MovieInspector",
        "review_rating": "7",
        "review_title": "Good. When you go and watch a comedy, you don't expect a great story; you just expect an entertaining and decent one that you can follow",
        "review_detailed_main": "After Golmaal and Golmaal Returns, i had high expectations of this. I'm pleased to say that it didn't disappoint me. First of all, the performances by Ajay Devgan, Kareena Kapoor, Tusshar Kapoor and Mithun Chakraborty are all good. Arshad Warsi, Shreyas Talpade and co. are also OK. Johnny Lever is hilarious as usual. Secondly, there is more comedy than the first two installments in a decent story. The only thing i'd say is that the music and action sequences could have been improved a little. People say that it is bad because it doesn't relate to the first two. My response to that is that you can't expect a Hindi comedy to continue with the same characters for two films as it will get boring. This way they can continue with Golmaal 4 and even 5. Overall a great comedy.\n\nVerdict: you should definitely go and watch it. I give it 7/10."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "chanakya-dwivedi",
        "review_rating": "2",
        "review_title": "What was Rohit Shetty thinking???",
        "review_detailed_main": "Finally the much awaited Golmaal 3 released and not to my surprise it was really disappointing. Rohit Shetty might have given good comedies like Golmaal, and average comedies like Golmaal 2 and All The Best earlier, but this one was a complete let down. I should more simply put it this way that with every subsequent release, the quality of movies made by him are decreasing. There was nothing new to offer in this movie and all the jokes were old. As always, comedy in the movie was character based rather than situation based. What the director was offering was comedy which would make us laugh on characters that had something wrong with them like someone could not speak, someone stammered and someone forgot things(just like Aamir Khan from Ghajni) and there were no situations as such which made a person laugh. Even good actors like Ajay Devgan and Arshad Warsi could do nothing to save the really really weak script. As always in Rohit Shetty movies, there was a lot of noise, lot of commotion, an irritating Tushar Kapoor, some larger than life fight scenes, but no good humor this time round. Mithun Chakravarty for most part of the movie was just making painful funny faces that left one irritated. I am sure he would not want to do another movie which is even close to similar to this. The story of the movie was very predictable and I would not like to shed any light on that because that would be wasting your time. I should say that this movie did not even qualify for a brainless humor flick. For most part of the movie, everyone was fighting with each other as if they were 5th standard kids. In the end I would just want to say that by all means you should avoid this movie, and still if you are willing to see this movie, it would be on your own risk. And by the way this movie is not a sequel to the previous parts but more like an episode based on the same characters."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "sajj_malik",
        "review_rating": "6",
        "review_title": "Its full of gags and jokes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "estud",
        "review_rating": "1",
        "review_title": "Worst movie of the year",
        "review_detailed_main": "I am not against mindless entertainers (I love One Two Three), and I was able to enjoy some moments in the previous two editions, but this movie is a complete waste of time. None of the scenes are funny and there is just no coherence, all the characters are shouting at all times and going overboard. I got a bad headache after watching it, I am glad that I didn't have to pay to watch it. Clearly worst movies of the year doesn't even deserve a 1 star. There is hardly any plot and the incessant shouting and fighting and impromptu song sequences do not help in any way.\n\nMy sincerest request to the director, please don't make a Golmaal 4 and please stop abusing the name of Hrishikesh Mukherjee's Golmaal!"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "CupcakeLovesMuffin",
        "review_rating": "6",
        "review_title": "Strictly Okay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "garv08",
        "review_rating": "1",
        "review_title": "Not up to expectations",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "arshnbh",
        "review_rating": "9",
        "review_title": "nic movie",
        "review_detailed_main": "Shree Ashtavinayak Cine Vision Ltd.'s Golmaal 3 is a comedy of two families who ultimately unite into one. Pritam (Mithun Chakraborty) drives a school bus for a living and he has three adopted sons – Madhav (Arshad Warsi), Lucky (Tusshar Kapoor) and Laxman (Kunal Kemu). Geeta alias Guddi (Ratna Pathak Shah) has two children, both adopted – Gopal (Ajay Devgan) and Laxman (Shreyas Talpade). Daboo (Kareena Kapoor) is Gopal's girlfriend.\n\nGopal is a hot-headed guy whose temper spells danger. A raised finger at him is all that it takes to instigate him. Brother Laxman stammers while talking. Madhav, Lucky and Laxman keep borrowing money and losing it in suspect business ventures. Lucky has a speech problem – he can't speak. The path of Gopal and Laxman cross that of the three brothers in such circumstances that they become sworn enemies. Even as they can't see eye to eye, Pritam and Geeta meet by accident, and their love gets rekindled. Daboo realises that Pritam and Geeta, who were in love during their youth, still love one another. Since they are both unmarried, Daboo takes it upon herself to get them united in matrimony"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "Pathak and Chakravarty steal the show in this better forgotten mess",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "writetokrish",
        "review_rating": "7",
        "review_title": "You will like what you hate to like",
        "review_detailed_main": "Most of us when entering into a movie hall expect a movie to have at least a story which you can tell your friend/family for at least 2-3 minute. If not, you say it is a bad film. But there are a bunch of bollywood movies where you can not give that same conclusion. Golmaal-3 is exactly that. I did not liked the first one, have not seen the second, went to see the third as it does not cost me anything(I have subscription of a cinema chain which allows me to see any movie). But when got out the theater I realize it would not be hard to spend some money to this movie if I had to.\n\nAs I say the movie do not have any plot so when you are watching it, you can seat-back and enjoy every little gigs/kicks without stressing your brain and when you get out of the theater you will be laughing, relaxed and may be expect the Golmaal-4(:)).\n\nLooking into the technical details this movie do not have much to say about music (which in my opinion was better in part 1 and 2). The acting is very good from all of the characters, especially Aajay Devgan and Mithun. It is surprising to see Mithun with his image these days in TV can do this type of circustic role, which in fact is done terribly well by him. Also a good thing is that Kareena has a good contribution to the movie as she got a good amount of thing to do though out the movie. Tushar as usual terrific with his acts. The film is full of jokes, gigs and entertaining stuffs which you should enjoy if you do not have any legacy to be intellectual all the time.Oh, I almost forgot to mention Johny Lever for this Gazhni like act.\n\nOverall if you are stressed with all your work thought the week you must watch this movie at the weekend. Last but not the least I can not resist myself from quoting a dialog from it... \"Shishe ke gharme rahne wale basement me nahaya kartein hai\" -- Mithun (The rating should exactly be 6.5 but IMDb does not allow that so...)"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "jewel-raz109301",
        "review_rating": "1",
        "review_title": "What/where is the point?",
        "review_detailed_main": "Hello this is Jewelraz, I am going to review this movie from my own perspective of view. I have seen Golmaal 1,2 and just finished watching Golmaal 3. It's was really exciting and joyful to watch Golmaal 1,2 but this last squeal is awful. Absolutely no story and it seems pretty boring. Also criticism is all around this movie. They have criticized Amir khan twice, Also they have stated a statement on Shahrukh Khan's Movie. Rohit Shetty(the producer) just kill some time by twisting several songs which used to be so amazing and beautiful and popular(still) in the past like Disco Dancer, Yaad A Raha hein. I mean what's the point of this movie? Can't even make people laugh, Golmaal 1 & 2 was far more better than this movie."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "sauravjoshi85",
        "review_rating": "7",
        "review_title": "A decent one time watch entertaining film.",
        "review_detailed_main": "Golmaal 3 is a comedy film. The film stars Mithun Chakraborty, Ajay Devgn, Arshad Warsi, Kareena Kapoor, Tusshar Kapoor, Shreyas Talpade, Kunal Khemu, Ratna Pathak Shah, and Johnny Lever.\n\nA single father meets with his college sweetheart in Goa. However, when their respective children go at war with each other, the two find it difficult to reunite.\n\nThe film is loosely inspired from Khatta Meetha and Victoria No.203.\n\nThis is the third installment of Golmaal series.\n\nThis can be termed as a senseless and brainless yet entertaining comedy film which might not be as entertaining as it's first film but much more entertaining than it's second film. The film has some many humorous scenes and the addition of Mithun, Kunal Khemu and Jhonny Lever works as an icing on the cake.\n\nActing in the film is good and almost all of the characters were impressive, music of the film is decent and screenplay is also decent.\n\nOverall a decent one time watch comedy film and can be watched once."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "kambinbh-40655",
        "review_rating": "7",
        "review_title": "nice movie",
        "review_detailed_main": "He enviably suffers from a short-term memory loss. By the end of this flick, you wish, so could you. Or maybe you do. But do imagine a film industry screening of this comedy and all celebs in the house, rotfl (rolling on the floor laughing), as it were. It's truly that filmi. And for most parts hardly as funny for all. The cast and crew certainly had a laugh filming it. They even held an extended discussion on the picture Ghajini for us. Great for them.\n\nHow about telling a story of your own? Well that again, I guess, can be outsourced to '70s Bollywood: Basu Chatterjee's Khatta Meetha (1979), I suppose. Mithunda and his sweetheart once (Ratna Pathak Shah) are single still. Kareena Kapoor plays cupid, and gets them and their families together.\n\nOld man fathers three adopted monsters: Ajay Devgn (can't resist cracking people's fingers), Shreyas Talpade (stammers for our pleasure). Old lady likewise mothers another set of aged orphans: Arshad Warsi, Kunal Khemu (in top form), Tusshar Kapoor (more moronic than mute). The two groups, supremely high on energy, hate each other. Another set of comic villains back the two gangs. Those buffoons have separate stories of their own. The missing link is the movie itself. No one anchors it.\n\nGolmaal was a sleeper hit of 2006. Since then, several ensemble comedies (Dhamaal etc), some of them put together by this film's team as well (Sunday, All The Best) have tried to repeat the run. Golmaal 2 (second- rate stuff) apparently raked in big bucks. Such success can boost anyone's over-confidence. Which explains this turd part."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "jaskunwar993",
        "review_rating": "2",
        "review_title": "What a sad, sad film. Ironic for a \"comedy\".",
        "review_detailed_main": "Regarding Golmaal... as the next one comes out, its quality goes down. Rohit Shetty thought that the formula he used in Golmaal 2 (no strong storyline, cheap, PJ humour, loose funny sequences tied together) would work in 3 as well. 2 was a hit. And I think this one will be too. But, God... why did it have to come out on Diwali? All the lights just went out.\n\nNo, seriously, I swear it. I believe that what constitutes a good film, regardless of a weak storyline, bad script, everything, is if it's able to make you feel the emotions you're supposed to feel. If that happens, then the movie qualifies, because then you know it has a soul. That is exactly the reason why a non-sensical movie like Kick-Ass was a blockbuster. It made you FEEL it. Golmaal... bekaar.\n\nAnd to add to the fact that this film has no soul, it has a very average script, very poor music, no storyline at all, poor sense of humour, OK-OK direction. Alright, I agree that the performances were good... but what's the point trying to give your best in something, when, well, there IS nothing to give your best in! Yes, exactly, that's my point. The purpose of this film was to give bollywood its first ever trilogy, and to try to spread laughter this Diwali. But then, you only ever laugh at a good joke, that makes you FEEL itself! That is why only rare comedy's have provided genuine laugher... like Bheja Fry, Hera Pheri, etc! Even Golmaal 1 had a soul. But no, the soul preferred to leave in 2. And it didn't bother to come back for the three. I give it two stars for the two times out of I-don't-know-how-many it made me laugh, genuinely.\n\nThis is the problem with Bollywood. As I've said in one of my articles on Bollywood (Quantity + Lack of Originality = Bollywood found on http://hubpages.com/hub/Quantity-Lack-of-Originality-Bollywood), there's a reason why Bollywood has produced the maximum number of films and 0 Oscars.\n\nSeriously... people need to start thinking before making a film. It's all in the mind. You have a good idea, use your mind for that, use your hand and all the greatest trained people to give that idea shape. And tell me which person calls that product bad.\n\nMove on, Bollywood. The world has. Don't get left behind. Life is, after all, despite what 3 Idiots says, \"a race\"."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "jayeshyanishrambarassah",
        "review_rating": "6",
        "review_title": "Nonesensical",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "nitinjain_nitin",
        "review_rating": "4",
        "review_title": "A really bad movie",
        "review_detailed_main": "When Golmaal 2 was released I thought that it had devalued the brand Golmaal, but Golmaal 3 is beyond any doubt the worst of the lot. I can't imagine such a trash movie from the cast and crew of Golmaal - the original movie. Tushar Kapoor ceases being funny after an extent and the director has not realised this and has given him an extended role. The action is mindless and has been stretched too far. Ajay Devgan is such a good actor and he has been completely wasted. Humour is given to the public is very small doses. Johnny Lever is the saving grace of the movie. I don't think anyone should waste his or her money on such a waste of a movie. I am a big bollywood fan and it has happened only twice in my 25 years of life (and believe me I have seen many films) that I have wanted to leave the theatre in between a film. To some extent it is a \"inspired\" from Hollywood movie Yours mine and our.\n\nIn all don't waste your money and time and don't go for the movie and I seriously hope that if Rohit Shetty is planning on making Golmaal 4, he comes up with something better."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "kapilkh",
        "review_rating": "6",
        "review_title": "movie is one time watchable",
        "review_detailed_main": "global 3 is far better than global 1 and 2. condition is only if you are looking for brainless comedy. if you are looking for story than this is not the correct movie for you. Every character has some attributes.like Ajay Devgan is in phycho role, Kareena looks good in tom boy role, Mithun DA satisfied with his role, Tushar kapoor is good with his comic style without saying anything, arshad warsi is balanced. ,jonny lever make us laugh with his Bhoola style.movie contains all masala which makes it good movie. Movie started with introducing two families whose children are against with each other. but their step parents are old time lover and because of some circumstances they were not able to get married. after many years they met each other and again they were fall in love and get married than this is the story how their children accept each other with fight and love.\n\nI love this movie and recommended this movie to others too."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "XeriusX",
        "review_rating": "1",
        "review_title": "Don't even bother buying a pirated copy of this film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "anupkumar005",
        "review_rating": "8",
        "review_title": "Fun and entertainment with 'Golmaal is back again!'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "yasin_3061",
        "review_rating": "1",
        "review_title": "Damn...! stop calling it a sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "sachi-tank",
        "review_rating": "5",
        "review_title": "We need some more punches!!!!!!!!",
        "review_detailed_main": "Really!!! We need some more punches in second half. Some of the scenes especially in second half are exaggerated as if director is not having any thing to show. Golmaal 3's so called story revolves mainly around its leading 7 actors. Others are having less work to do. Actors like Hirji, Sanjay Sharma, Vasooli & many more are very much capable to make people laugh with their perfect timing, but they are treated just as fillers.In the most of his act Jonny lever has overacted but in some part he is okay. Mithun Da & Kunal Khemu are good & others are typical Golmaal characters. This is just like other Golmaal movies with no story, more colors & repeated action sequences. Songs are okay but compare to director Rohit Shetty's previous movies, this presentation is bit disappointing & less hilarious. Its not at all justifying its tag of thrice a fun."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "ganeshkss97",
        "review_rating": "1",
        "review_title": "Is this the last Golmaal series,Mr Shetty?",
        "review_detailed_main": "Golmaal 3 directed by Rohit Shetty is the worst of Golmaal series. The story is good. But the jokes are so childish you end up crying instead of laughing. Mr Shetty's poor direction and lame jokes makes Golmaal 3 a bad watch. Music is yawn.The title track topping. Performance wise-Ajay,Shreays,Kunal are bad.Arshad provides few chuckles.Kareena is good.Tusshar is painful.Mithun and Ratna are okay.Johnny Lever is funny.Vrajesh Hirjee,Sanjay Mishra,Murli Sharma,Ashwini Kalsekar,Mukesh Tiwari are common in Mr Shetty's movies.Prem Chopra hams. An advice to Mr Shetty-We do not want more Golmaal.Hope this is the last Golmaal we have witnessed.\n\nGolmaal 3 might appeal to only some.Not everyone."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "asumankaradagoglu",
        "review_rating": "5",
        "review_title": "Goolmaal 3",
        "review_detailed_main": "The acting was good, as always, one of the fun movies of rohit shetty, lucky and lakshmi characters were very good, a movie that I can recommend for those who want to have fun Get ready to watch Rohit Shetty's passion for cars again :)"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "rananbh",
        "review_rating": "9",
        "review_title": "awesome movie",
        "review_detailed_main": "Settling in to watch Rohit Shetty's Golmaal 3 next to me yesterday, a friend and fellow critic discreetly confessed that he'd been to a screening of the same film a day ago. I must confess to being momentarily struck dumb, unable to conceive of someone having turned into enough of a franchise fan to repeat a viewing on successive days.\n\nYet my 'wow, Mr Shetty' line of surprised-impressed thought was almost instantly interrupted by the aforementioned pal, further revealing that he had fallen asleep and now needed to watch the film again to review it. Ow, Mr Shetty.\n\nA little over two and a half hours later, I staggered out of the theatre looking for caffeine, in complete empathetic sync with the friend. The phone rang. Another critic who saw it yesterday had plain forgotten the plot, and so wanted a quick recap. I wish I was making some of this up, but no. The best thing that can be said about Golmaal 3 is that it both enters and exits your system rather comprehensively, leaving behind nothing either memorable or of consequence."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "linkmilan",
        "review_rating": "1",
        "review_title": "Worst typical bollywood film",
        "review_detailed_main": "I purchased this movie on youtube, and believe me unable to tolerate it more than 30 min. Worst typical Rohit Shetty movie, just skip it. Better sleep for 2hrs. Will never watch any Golmaal series or Rohit Shetty directed at any cost."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "knarinder-67761",
        "review_rating": "4",
        "review_title": "Average movie",
        "review_detailed_main": "Movie Golmaal 3 was a Bollywood action comedy film which directed by Rohit Shetty and the sequel to the 2008 film Golmaal Returns and the third film in the Golmaal series. Most of people enjoyed this movie's comedy. But i felt this was not pure genuine movie according to ethic values.The film stars most of the actors from the previous films, including Ajay Devgan, Kareena Kapoor, Arshad Warsi, Tusshar Kapoor and Shreyas Talpade. Starting part of the movie was just new for me. New additions to the cast include actors Mithun Chakraborty and Kunal. Moreover The emotional scenes of this movie was wonderful. Songs were just amazing according to the story. Theme of the movie was average."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "kanujbhatnagar",
        "review_rating": "1",
        "review_title": "Was on for free on TV... changed the channel after a few minutes",
        "review_detailed_main": "The review summary says it all... it was on one of the entertainment channels. Saw a few minutes of it, and it was terrible. What I could not get was why every actor in the movie had to do a promo scene standing on top of a car... by the way, Ajay Devgun did one standing on two. And why not... he's apparently the lead in the movie, he does deserve to be standing on more than one.\n\nI realize this is *supposed* to be a comedy, but I found it few and far between.\n\nSenseless, atrocious movie made just for the heck of it. Might please the rickshaw pullers, the main audience this drivel was made for."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "silvan-desouza",
        "review_rating": "1",
        "review_title": "Headache unlimited",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "deepnbh",
        "review_rating": "9",
        "review_title": "Good Work",
        "review_detailed_main": "The third in the Golmaal series, this one is a farcical comedy without much of a story. Inspired by the television serial, Family No. 1, and the film, Khatta Meetha (old), it is more of an assemblage of funny sequences pieced together in a screenplay by writer Yunus Sajawal. As the story line is thin and not even new or fresh, the emphasis is more on creating laughter in individual scenes. While the attempt is successful upto a point, the monotony in the drama and the lack of an engrossing story hit the audience, especially after interval. No doubt, some scenes in the first half and a few after interval are absolutely hilarious and bring the house down with laughter, but then, there are also scenes which are designed to evoke laughter and fail. Writer Yunus Sajawal's biggest flaw is the addition of the emotional track in the story. That's because while the emotions fail to touch the heart and activate the tear ducts, the track robs the film of the comedy which has, actually, come to become the mainstay of the Golmaal films. So, while the emotional aspect fails to have the desired impact, it does rob the film of its USP – comedy!"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "skeptic9",
        "review_rating": "1",
        "review_title": "Unfunny and downright insulting to audience intelligence",
        "review_detailed_main": "First of all let me say that I am not someone who does not enjoy mindless comedies. For example I loved Sunday which was also directed by Rohit Shetty. It too was mindless but had great performances, funny lines and some memorable scenes. But with Golmaal 3, Rohit Shetty has taken things too far. Not a single dialogue is remotely funny and the recorded laughter in the background doesn't make them funnier. A mute person and one with a stammer are supposed to make you laugh. At least all the other characters keep laughing at their disabilities. I wonder how no one in the crew thought this could actually be insensitive to large sections of society. Then there is no story to talk about. It is just a series of inane scenes pasted together. Many things happen without any apparent reason and characters do many things and spout many dialogues which make no sense at all. The whole thing is a juvenile exercise designed to blow up lots of money and some cars on the sets. What is most insulting is that the director has the cheek to name it after one of the most brilliant comedies in Indian film history. The only good thing about this movie are a couple of lovely songs but watching the entire movie is too high a price to pay just to enjoy two songs. My advice is: avoid it even if it's showing on TV for free. I would have gone with negative stars if I could but IMDb allows a minimum of one. So there."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "shaownmahmud",
        "review_rating": "1",
        "review_title": "WHY DON'T STOP.",
        "review_detailed_main": "Golmaal was good, Golmaal 2 was good enough. Then it was not mandatory that you must make a sequel inspite of having no story. This movie obviously without brain work. Rohit Shetty could have done better rather acting like mindless fool."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "saadgkhan",
        "review_rating": "9",
        "review_title": "Kareena Kapoor stole the show this time, she was literally one of the boys and it's really a huge breakthrough for Bollywood where the Heroin must have a hero.",
        "review_detailed_main": "GOLMAAL 3 – CATCH IT ( A ) Golmaal 3 is such a pleasant surprise and lives up to all the expectations. It's a nonstop fun like the 1st Golmaal movie. Where Golmaal 2 was all over the place and not funny enough, Golmaal 3 dealt with one story at time and put all the entertainment into one single story. I was laughing hard all the time, its literally one of the funniest movies I've ever seen where you don't have to think a lot. Ajay Devgan again proved that he is a veteran actor and whether its comedy, social or action movie, he gives his 100%. Kareena Kapoor stole the show this time, she was literally one of the boys and it's really a huge breakthrough for Bollywood where the Heroin must have a hero. She proved that she is the bestest in all contemporary heroines working in Bollywood right now. Arshad Wasi, Tusshar Kapur, Shreyas Talpade, Kunal Khemu, Mithon Chakraborthy, Johnny Lever and Ratna Pathak did a fantastic job. Rohit Shetty brought his whole gang yet again and put the Box Office on Fire. Bravo!"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "jatinnbh",
        "review_rating": "10",
        "review_title": "full of comedy",
        "review_detailed_main": "In an industry where sequels rarely work, the Golmaal franchise seems to have struck gold with its formula of making sense out of nonsense. If Golmaal-l was sheer fun, the second in the series took a slight dip in terms of merriment. Thankfully, Golmaal 3 sets the graph right by revving up the laughter meter and providing a perfect Diwali getaway for viewers who are hungry for some hungama this festive season."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "jeetanbh",
        "review_rating": "8",
        "review_title": "nice movie",
        "review_detailed_main": "Mithun Chakraborty has his moments of comedy, in which he entertains the viewer. Ajay Devgan gets into the skin of his typical character and comes out a winner. He looks dashing with his very short hair, fantastic physique and stubble. He has great screen presence in the film. Kareena Kapoor is splendid. She has a dream role and is actually the biggest hero of the film. She plays the tomboyish character with such aplomb that she will instantly endear herself to the audience. Arshad Warsi has some very fine lines to mouth. He performs very well. Tusshar Kapoor does his talking-disability act as wonderfully as he did in the earlier two films, Golmaal and Golmaal Returns. Shreyas Talpade's stammering act is cute but lacks novelty. He stands out in the silent scene between the five men. Kunal Kemu makes a nice impression; he has very nice and funny lines (revealing his character's awful sense of humour) to mouth. The guy has lovely comic timing and has the ability to deliver. Ratna Pathak Shah is natural but the audience would've loved to see her doing comedy. Johny Lever is first-rate. His acting is terrific. Sanjay Mishra gets limited scope but is good all the same. Vrajesh Hirjee gets even lesser scope; he is okay. Ashwini Kalsekar has been wasted. Murali Sharma has his moments. Mukesh Tiwari also does a fine job. Vijay Patkar provides able support. Prem Chopra stands out in a special appearance. Jennifer Mayani and Parag Desai lend the desired support."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "kartarnbh",
        "review_rating": "9",
        "review_title": "awesome movie",
        "review_detailed_main": "Rohit Shetty's direction is good but he should not have attempted mixing emotions and crazy comedy. Pritam Chakraborty's music is average and the need of hit songs is sorely felt. The 'Golmaal' and 'Aale re' songs are alright. Song picturisations (Chinni Prakash, Ganesh Acharya, Rajiv Surti and Seema Desai) are eye-filling but not outstanding. Kumaar's lyrics are okay. Cinematography (Dudley) is good. Jai Singh Nijjar's action is of the mass-appealing variety. Sanjay Chowdhury's background music could've been better. Sets (Narendra Rahurikar) are alright. Editing (Steven H. Bernard) needed to be sharper. Production values are grand."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "garrynbh",
        "review_rating": "8",
        "review_title": "nice movie",
        "review_detailed_main": "But no one's complaining. Because Ajay Devgn's angry explosions, Tusshar Kapoor's verbal antics, Arshad Warsi's rougish revelry, Sanjay Mishra's delightful mis-spellings...are all rib-tickling stuff. And providing a perfect backdrop to this brazen display of testosterone and brattish tomfoolery are the senior citizens: Mithun and Ratna Pathak Shah who play the romantic couple in '70s style. Mithun literally recreates his Disco Dancer chutzpah by romancing an Alice-band sporting Ratna Pathak Shah with his signature dance steps. But the one who's obviously having the greatest fun amongst the band of boys is Kareena Kapoor as Dabboo, the orphan who is hell bent on creating the Hum Saath Saath Hain happy family out of the warring factions. Kareena's vibrant, vivacious and ekdum bindaas, almost in sync with the outrageous palette of colours that Rohit Shetty uses for the sets and costumes of his film. You can't be sad, mournful or morose after the colour blast -- red, yellow, orange, pink, purple -- that hits you in this over-the-top film"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "ramnbh-49516",
        "review_rating": "8",
        "review_title": "nice movie",
        "review_detailed_main": "Among the scenes and sequences which stand out for their comic content are the finger scenes with Gopal; the tavaa scene before interval; the telephone conversation between Vasooli (Mukesh Tiwari) and police inspector Dhande (Murali Sharma); the scene in which Daboo mouths the choicest four-letter words which are incomprehensible; some scenes of Pappi talking unrelated things after his memory problems surface at irregular intervals and also the scene in which his hands get stuck to the motorboat and the mayhem that follows; the scene in which Facebook, the dog, goes after the piece of bone hidden in the back pocket of Pritam's shorts, Pappi's sidekick (Sanjay Mishra) always spelling English words wrongly. There is one sequence in which the five young men, thrown together in the same house, give vent to their frustration in sign language. While this sequence is brilliantly conceived, executed and enacted and will be enjoyed by young boys, it will either not be understood by the older generation and the ladies or, if comprehended, may end up repulsing them for its obscene (though funny) connotation."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "mohansinghnabha",
        "review_rating": "9",
        "review_title": "Good Work",
        "review_detailed_main": "If you have suffered through either the half-funny Golmaal or the dimwitted Golmaal Returns, you know what to expect from this franchise built sacrilegiously on the name of one of the funniest comedies in Hindi film history: an Ajay Devgan vanity project where he plays a halfbaked hero while a returning ensemble cast of actors and comics monkeys around, hamming like mad, and led memorably by a mute Tushhar Kapoor.\n\nEarlier versions have included a bevy of dimwitted heroines. But the new film just has the one Kareena Kapoor. Not that any of that matters, the only brief spark of fun you have is with Mithun Chakraborty and Disco Dancer.\n\nYup, the legend lives through a flashback'd romance with his best songs, and references are made to all his most iconic film roles, from Dance Dance to Agneepath to -- and here we must all bow reverentially -- Gunmaster G9. And that brief interlude -- from all the chaotic, finger- breaking yelling and screaming and overacting -- comes to us like an oasis in the midst of murderous mayhem, and we laugh out of sheer relief. Or because it's genuinely fun to see Mithun exchange lyric- turned-dialogue quips with the one and only Prem Chopra.\n\nNot that this lasts. The film's plot consists of Mithun and his onetime lover Ratna Pathak Shah being hustled into marriage by an annoyingly ebullient Kareena, making sure their respective boys -- all sworn enemies -- have to share the same roof."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "navvenjain",
        "review_rating": "8",
        "review_title": "very good",
        "review_detailed_main": "Qwertyuipasdfghjklzxcvbnm LVUWAASAAAglE+oHFnl+NwoXhNCpDSJok0l7o+4zbMfFLDbla5LKI6lR0zdzVvr8 RxYiDZUrCVZB7KFAtQFo5loFZrWM9u3j741RheTlMOtsQBW6Y7HwQ6ki5f80ZV7n a7N58ButZlPy2q2pjbkgWhCjGtQvT081rgzmzKOO0VYT5BDZtLP4Lpr6CH82WfWE ItG4PES5TgQ2iQtErjK8LOaAYNnQDRzHZtTSiCieIrN8NDEIS4SAR9dRTpDAb8Vy 9e/XY/N16NfxfSRT8HnntRva+br4llNf4wLpwkS0hy8oo8tlEPYvBTLkPS5AveMC vDIG2dk5q90u/F1HzJps8U97vEFhtzhx1/DmHFea3XkddhR/MDm4I9/Z9Bt2BUvu bZGfne0sgl4fD86B12C/xUXSbDSgbpkp"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "Li_85",
        "review_rating": "9",
        "review_title": "Fast..Funny..Fun Tas Tick!!",
        "review_detailed_main": "Golmaal 1 was a Funny Hit Film which was very entertaining. Golmaal 2 Promised more fun but was cheap humour and a letdown. Golmaal 3 coming out i expected another Golmaal 2 style cheap humour. I was Wrong as Golmaal 3 was way better then i expected. It had a fresh new storyline, More characters who acted great. Non stop comedy and i could not stop laughing. Sure, there is 1 or 2 bizarrely stupid comedy scenes which was childish (i.e. Hum saath saath hai scene). There is a lot of great one liners which some people may not understand (Mainly the youth) as this film dedicated and spoofs many old Mithun films and classic movie dialouges. Ajay Devgan was great, Mithun was amazing, Its great to see Mithun finally in a entertaining role perfect for him. Normally i hate old couple love stories but This old couple's love story was Great. I use to hate Kareena 10 years back, but currently with 3 idiots and her recent films, she is actually improving and in this film she was wonderful. Arshad was exceptional, Tusshar was great, Shreyas was funny. Kunal was good. Johnny Lever was brilliant. All other supporting cast were great."
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "Kaatil29",
        "review_rating": "10",
        "review_title": "BEST MOVIE IN THE SERIES",
        "review_detailed_main": "THIS MOVIE HAVE A DECENT STORYLINE BUT UNLIMITED LAUGHS & BUNCH OF FUNNY CHARACTERS. I CAN ASSURE YOU WILL NEVER GET BORED OF IT. THE NAME OF THE MOVIE IS ITSELF AN ART \"GO = GOPAL, L=LAKSHMAN, MAA-MAADHAV, L = LUCKY\" NAME OF THE MAIN CHARACTER'S OF THE MOVIE. TOTALLY A WORTH WATCH TO WATCH WITH FAMILY FOR A GREAT TIME. SOMETIMES LOGIC IS NOT THERE BUT I THINK YOU DON'T NEED LOGIC WITH COMEDY MOVIES.(10/10)"
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "BiswajitSince2005",
        "review_rating": "9",
        "review_title": "Golmaal 3 or Khattha Meetha 2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1562859",
        "movie_name": "Golmaal 3",
        "movie_rating": "5.6",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "\"G3\" is the final chapter in the series",
        "review_detailed_main": ""
    }
]