[
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "williampsamuel",
        "review_rating": "4",
        "review_title": "A Hilariously Bad Exercise in Product Placement",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "rjh2200",
        "review_rating": "3",
        "review_title": "Sheer Crap",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Why would I watch this? I am a glutton for punishment!",
        "review_detailed_main": "\"Mac and Me\" was one of the more infamous box office duds of its time. While this would dissuade normal folks from watching it, bad movie buffs like me naturally gravitate to it because it is such a legendary flop. The biggest reason it failed--the public quickly saw it for what it really was--a blatant rip-off of \"E.T.\". And, this time even MORE corporate references are thrown in the viewer's face...with McDonald's and Coke references galore!! Instead of Reese's Pieces, they feed this god-awful corporate shill Skittles! And, to revive Mac's family who are on the edge of death, they feed them Coke!!!\n\nThe film begins with an incredibly ugly family of aliens mysteriously getting sucked into a US space probe. They are then deposited on Earth and their baby, Mac, is lost and must find its way home. In the process it meets a nice disabled kid and makes his life complete. But, when it's no longer safe, he and Elliot, I mean Eric, go on a cross- country race to find his parents and get him home--and evade capture. And to do this, they dress him up in a Halloween-type costume! Need I continue?!\n\nSo is the film any good? Well, if \"ET\" had never been made, sure it would have been reasonably entertaining to very young kids who didn't notice that the film was a giant commercial and who wouldn't notice the bad dialog and abounding clichés. But \"ET\" HAD BEEN ALREADY MADE several years earlier...so the film has zip when it comes to originality. You wonder how the folks associated with the film felt--they must have been really embarrassed at how blatant this was. And, at just about every turn it seems to do it worse than \"ET\"...and often MUCH worse. It's a vacuous, soul-sucking corporate mess of a film in so many ways.\n\nWhen I saw this film tonight, it was decades after its original release and I was startled how ugly and expressionless Mac was. However, I had to remind myself that ET also looks pretty crappy when you see him today because we are used to much better special effects in 2015--though Mac is definitely crappier. The worst is when the dead, expressionless doll is riding on Eric's lap during the big chase! As for the outer space scene, however, I watched it on a very big screen TV and I was surprised because it looked so nice. This space scene along with actually hiring a disabled kid to play a disabled kid are about the only things that impressed me about the film. Otherwise, a pointless rip-off from start to finish---and not even bad enough to make bad movie buffs laugh. But enough overt corporate references to make this a GREAT film to use as a drinking game--taking a shot every time you saw these blatant ads! Believe me, you would get stinking drunk if you tried this!!\n\nBy the way, the kid calls the hideous little alien 'Mac'--an acronym for Mysterious Alien Creature. In no way was this meant to be like 'ET' for the Extra-Terrestrial....yeah, right! Also, perhaps it's just me, but this might just be the most whitebread, corporate and uncool film ever made--especially during the god-awful McDonald's dance scene."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "perni",
        "review_rating": "",
        "review_title": "Oh my, my, my...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "coryleonard-62603",
        "review_rating": "1",
        "review_title": "MST3K",
        "review_detailed_main": "Mystery science theater 3000 just riffed this movie. If that doesn't tell you everything you need to know, I don't know what will."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "GlennCT",
        "review_rating": "1",
        "review_title": "\"Mac\" = Cheese.",
        "review_detailed_main": "I know it's a little silly to write a review of a film 15 years after its release. But this poorly done film made its way onto one of my cable movie channels last night, and I feel the need to have a violent, outward reaction outside of the projectile vomiting I experienced.\n\nPeople, this film is bad. Really bad. Bad like \"Showgirls\" bad, where it's so bad, it's both insulting and laughable simultaneously. And forgive me, but anybody who finds this 95-minute commercial for McDonalds and Coca-Cola to be warm-hearted or well done in any way knows not a thing about what makes a movie good, and needs a great deal of emotional counseling.\n\nFirst, let's reiterate that point about this being an extended commercial. Folks, it is. The product placement in this film is shameless.\n\nNext, there are basic things that make a film \"good,\" like strong acting, a well-written script, superior camerawork or quality special effects. \"Mac and Me\" has none of these. Wooden posts would have made for better actors. The script clunks and thuds with every ridiculous, uninspired line. And the alien creatures of the film, with their bug-eyes and protruding bellies, look about a life-like as melted candles.\n\nI also have to make a point of just how much of a rip-off of \"E.T.\" this film was. Not only is the plot just a poor carbon copy, but even the title of this attrocity becomes an act of thievery when it's revealed that \"Mac\" stands for \"Mysterious Alien Creature.\" I'm not even the biggest fan of uber-cutesy \"E.T.\" either, but at least there the attempts at manipulation are somewhat subtle. Here, the filmmakers fell just short of subtitles at the bottom of the screen that said \"LAUGH HERE\" and/or \"CRY NOW.\"\n\nAnd the cherry atop Stewart Rafill's bile sundae? The scene inside a McDonald's (Our aforementioned sponsor) when normal, everyday patrons suddenly and spontaneously spring to life into a choreographed dance sequence. Yeh, that happens at the Greasy Mac's on Route 1 near my house every freakin' day.\n\nSaps only will buy into laughable hunk of junk... for the rest of you out there, I recommend this movie only if you're looking for new additions to your Ten Worst List."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Idocamstuf",
        "review_rating": "5",
        "review_title": "One of my favorite films as a child",
        "review_detailed_main": "I watch this movie now and I realize how ridiculus it is, but when my sister and I were kids we loved it. I know its really just a lame copy of E.T., but we didnt care. We thought that the aliens were hilarious, all of the whistling and stuff, and that handicapped kid that went rolling down the hill at about 300 miles an hour(which we would play over and over again). My sister used to compulsively rent this movie over and over again. I know adults would never enjoy this movie, but most kids probubly will. I give it 5 out of 10."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Ronald_Mexico",
        "review_rating": "5",
        "review_title": "Hey everyone, dance party at McDonald's; let's go!",
        "review_detailed_main": "The dance party scene was such subtle product placement. I can't say why exactly, but for some reason I was left craving a Big Mac after watching the movie. Hmmm....\n\nIf anyone can watch the dance scene and tell me exactly why it was in the movie, I would love to hear it. Also perplexing were the jogging scene with musical score (even Phil Collins at his worst would have been an improvement) and the cameo by that annoying red-headed kid from 'Different Strokes'. Perhaps someone who has watched the movie repeatedly and considers it a cult favorite could enlighten us....?\n\nI do like the fact that the producers cast a kid in a wheelchair as the star, but the writing was awful and the plot was laughably bad. It was an ET knock-off right up to the end, where you will find a shocking conclusion rivaled only by \"The Usual Suspects\"!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "euryan",
        "review_rating": "1",
        "review_title": "The worst thing humanity has ever created",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "thesar-2",
        "review_rating": "1",
        "review_title": "The Top Twenty-Four Ways Mac & Me is Cheesy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jantis",
        "review_rating": "1",
        "review_title": "A very bad film.",
        "review_detailed_main": "I love kids movies. I have two children and have always enjoyed watching their movies along with them. I worked in an elementary school for several years and have seen a plethora of fantastic children movies.\n\nBut this movie was terrible. In fact, I rate it as the worst movie I have ever seen. Why? Several reasons...\n\n1. It is a blatant attempt to ride the coattails of ET and similar alien-friend movies from this era. Unfortunately, I think it sat on the wrong coat.\n\n2. The film used pity tactics to attempt to draw in your emotions rather than effective writing or visuals, and those tactics failed miserably.\n\n3. The special effects were horrible even for the time. I can relate to chronological limitations in relation to special effects and can respect a film that meets or exceeds the effects available for it's time. But there were plenty of good sfx films out by the time this film was released and this one simply didn't bother with any sfx budget.\n\n4. The dialog was awful. This is an example where no amount of good acting could compensate for the dialog.\n\n5. In relation to reason #4, there was no good acting to attempt to overcome the bad dialog. That might not even be the blame of the actors themselves, as there are simply times when you can't rise above your surroundings.\n\n6. The cheesy marketing and glaring promotions within the film take an already terrible movie and turn it into a true mockery.\n\n7. I have seen B-Movies that were more enjoyable to watch. However, out of morbid curiosity, I watched this film from opening to closing credits.\n\nFrom start to finish, from effects to acting, from dialog to directing - Mac and Me is a very bad movie. Just because a film is made for children does not mean it's OK to be terrible. Children's films, just like any genre, have a majority of moderately enjoyable films, a number of gems, and their share of stinkers. This is a true stinker.\n\nAnd yes - my children thought this movie was horrible, too."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "bradye21",
        "review_rating": "10",
        "review_title": "A true cult classic",
        "review_detailed_main": "You must see this movie immediately. It is so epically bad, that it's amazing. Every scene is just complete madness, it makes you think everyone involved in the movie must have been on hard drugs. The cliff scene, the McDonald's scene, and the 5 minute scene where Eric is jogging (well...) with his mom while a power ballad plays in the background. EVERY scene is a winner. After each scene, you can't wait to see what madness awaits in the next scene. You can't stop. You'll want to watch it again. You'll want a sequel after the \"We'll be back\" is shown at the end, but you will never get one. The alien puppets as well as the studio this was shot in were likely burned shortly after filming completed (which was probably about a week after it began).\n\nBest viewed while extremely tired or under the influence of something."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Kerry_Bradford",
        "review_rating": "7",
        "review_title": "This movie is a gem!!!",
        "review_detailed_main": "First, I watched this movie by way of Mystery Science Theatre 3000 so that alone and them picking out the funny bits as the movie was playing was simply hilarious!\n\nAs a movie by itself, yes, it's a ripoff of E. T. for sure but it's one of those movies that are so bad that it's good/funny/nostalgic. Not taking it seriously, I believe alot of people who haven't seen this yet would have a good time. The acting and alien designs alone are funny as all get-out. I oddly recommend seeing Mac N Me if only for the laughs."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Jordan_Haelend",
        "review_rating": "1",
        "review_title": "A hateful experience.",
        "review_detailed_main": "This is without a doubt the single most atrociously insulting movie I can remember, and I mean that it insults the viewer in what amounts to an almost violently aggressive way. The fact that it rips-off \"E.T.\" in almost every plot-point is bad enough; but did the filmmakers HAVE to turn the basic idea into a giant plug for a well-known burger franchise? Anyone who can't see the exploitation for what it is must be obtuse to the point of imbecility.\n\nThe little alien is badly designed. It's incredibly ugly, and the only time when the aliens stand-out favorably is when they do their haunting whistling. Otherwise, forget it.\n\nThe lead in this, Jade Calegory, deserves some praise. He never let his own real-life disability slow him down and he's actually a pretty accomplished actor. It's a shame that he had to be in this. If he ever had hopes of an acting career, it was effectively MURDERED by his appearance here. It had to be embarrassing for him, unless he's got thicker skin than I give him credit for.\n\nI do, however, have one wish: if anyone who is reading this can make it happen, PLEASE put this out on Region 1 DVD, at least! It would be a hit, if only because so many people would buy it to see how awful it really is.\n\nAnd it is."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "Wow, this brings back memories. Too bad nostalgia doesn't defend the realization of awfulness. What a stinker.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "xtonybueno",
        "review_rating": "1",
        "review_title": "Dreadful, really...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "onepotato2",
        "review_rating": "1",
        "review_title": "A Brave Effort from our Capitalist Comrades!",
        "review_detailed_main": "As is to be expected, in the wake of the very successful E.T., some massively derivative imitators were released. In '86 Flight of the Navigator used Paul Reubens' Pee-wee Herman voice as that of an alien ship which befriends a boy who just wants to get home. To be sure that was a smarmy, 2nd-hand effort. But by far, the other much worse product came with 1988's \"Mac and Me.\" This was so much more appalling, that \"Navigator\" was instantly blown out of everyone's collective memory. Mac and Me is so heinous that it could melt the brains of the unborn.\n\nRemarkably, the movie is so burdened by wall-to-wall garbazh, that stealing the entire plot of another movie could be the least of it's problems.\n\nAn unrelated movie, called \"East Side Story,\" came out in 1997. It's a sort of \"That's Entertainment!\" of Soviet era propagandistic musical numbers on topics as naff as productivity objectives, living in a workers paradise, ideological purity, etc.. Mmmm... delicious! That's what you get when the machinery of state has no natural competitors. But \"Mac and Me\" is what capitalism would be bringing you morning, noon and night if powerful fans of ca$h never had their avarice checked by people who know better; critics and people with taste. As one cynical remark goes: If Thomas Edison had an MBA he would have just kept making larger candles.\n\nThis speed-course in half-assed, capitalist film-making includes, as noted, a plot lifted intact from a more successful movie (Why reinvent the wheel?), takes the form of a 90 minute McDonalds commercial (You want to lose 90 minutes of selling time?), interrupted by Coke commercials, has an alien that looks like a 4 dollar rubber fetus (because it is a 4 dollar rubber fetus), a (sym)pathetic hero in a wheelchair, and a script produced after sniffing the finest glue one could buy at the 99 cent store. Did $omebody $ay MAC-Donald$?\n\nSomehow the execs didn't imagine we'd notice the endless shilling, maybe 200 percent more than in a typical movie, while taking their express-elevator ride to profit hell. So let's acknowledge these brave geniuses, who strived to make capitalism safe for uh... more capitalism, by name so they make it into the history books; Producers Mark Damon, William B. Kerr, and R.J. Louis; AND so this review is inescapably linked to their names in internet search results.\n\nOf course there are questions that capitalism does't answer. Why do the aliens heads look like human scrotums? Why do they walk like babies with a load in their diapers? Why do they like whistling the first few notes of \"Happy Trails (to you)?\"\n\nThis is the lowest point in movie history, in any country, ever. Whoever would try to displace this as the \"Worst Movie Ever Made\" must first use it as a checklist to make sure their movie fails as spectacularly in as many places."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Sparquelito",
        "review_rating": "1",
        "review_title": "The all time stupidest movie...",
        "review_detailed_main": ".....in the history of all time stupid movies.\n\nI watched this with some close friends, back in the summer of 1989 when it first came out on video. Out of deference to the young children who were were seated on the carpeted floor watching the film (and actually enjoying it), we adults stifled our laughter, and wiped our tears as quietly as we knew how.\n\nMac and Me was just plain dumb. Beyond dumb. Beyond the valley of the SHADOW of dumb. What a dog of a movie.\n\nWhat really got me, aside from the McDonald's dance scene, was the overt commercial advertising. McDonald's, of course. I understand how a hack-company like McDonalds would be willing to tie themselves to such a stupid project.\n\nBut Coca COLA?\n\nCoca Cola should be ashamed of themselves for plugging their sugar water so shamelessly. (In case you don't remember, Coke was featured throughout the film, and in the end it was the magical cure for whatever was ailing the goofy aliens.)\n\nGood gosh. I can't believe I just wasted 60 seconds of my life posting a review of Mac and Me. (Shakes head sadly)"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "gavin-thelordofthefu-48-460297",
        "review_rating": "2",
        "review_title": "This isn't a movie! It's a stinking McDonald's commercial!",
        "review_detailed_main": "I couldn't believe my eyes. I... I just couldn't believe it. I have just encountered a movie so bad even as an ET rip-off, but I've also heard from Wikipedia.org that this was made to promote McDonalds to kids. Given the information, I understand why this movie got seriously panned by critics. The story is unoriginal and predictable not to mention plagiarizing elements from Steven Spielberg's classic ET. The dialog is terrible, the direction is messy and unfocused and the pacing is too sluggish for itself. The acting is not only over-the-top, but completely wooden with the exception of Jade Calegory for his emotional performance as the main lead. Even the script is lifeless with moments that are completely unfunny and lacks some wit, charm, and heart to it. The second saving grace, much like Jade Calegory's performance, goes to the music from Alan Silvestri. Not exactly his best score, but still pretty good.\n\nOverall, Mac and Me isn't exactly the worst movie I've seen, but it's still a horrible film that needs to be avoided. A sequel was planned, but given the horrible reception in this piece of crap and it's failure at the box office, it never got made."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "taliesin-8",
        "review_rating": "1",
        "review_title": "Don't lose your time, please",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "belldave50",
        "review_rating": "1",
        "review_title": "I hate, oh I hate those grotestque monsters... and this \"movie (advertisement)\"",
        "review_detailed_main": "You know, I used to walk by this as a kid at my local Blockbuster and look at it and for some reason never wanted to see it. Now I feel a divine hand was at play to keep my love for E.T. and all that is good in the world from being emotionally sodomized.\n\nIt's truly beyond words how much I hate this advertisement and movie that would've been horribly sued if it hadn't bombed.\n\nThroughout this movie I was let down each time the grotesque stupid creatures didn't die a horrible, torturous death.\n\nThe people were just generally bad actors and uninteresting.\n\nI just can't respect this as a real movie. It's soooooo much ET and such a blatant advertisement for diabetes water: coca cola, and MacPoop food.\n\nAnd those aliens... those horrible animatronics and faces that are disturbing to look at. It really highlights how amazing that Spielberg's movie could make an alien that could be seen as almost grotesque, lovable.\n\nMan, these producers in the 80's must've really, really thought children were stupid.\n\nDo not see this whatever you do. Save yourself!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "JesusPlayingGolf",
        "review_rating": "1",
        "review_title": "Possibly the worst film I've seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Mr-Fusion",
        "review_rating": "8",
        "review_title": "I love this movie for all the wrong reasons.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "GISmovies",
        "review_rating": "6",
        "review_title": "Mental programming brought to you by McDonalds.",
        "review_detailed_main": "Mental programming brought to you by McDonalds. The brilliant marketing geniuses at McDonalds manufactured this movie in 1988. It's so obvious and contrived that it's a bad movie classic. Product placement, Bad dialogue and a Musical song and dance number (in a McDonalds nonetheless) makes this movie a cult classic. I suggest renting this movie and eating a big mac and fries at the same time. 6/10"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "r-brasher",
        "review_rating": "1",
        "review_title": "A 90 Minute McDonald's Commercial",
        "review_detailed_main": "I admit it. I knew ahead of time that this so-called \"movie\" (it's a commercial folks!) was going to be the most obnoxious time waster, even worse than \"Underdog\"! But I still had to see for myself just how obscenely bad it really is. So, I went to YouTube (no way was I going to plunk down one red cent to rent this piece 'o crap) and proved myself right.\n\nBad acting, shameless product placement,the most stupid looking aliens in cinematic history and totally unoriginal storyline (E.T. anyone?), not to mention an 80's break dance scene included for no apparent reason only makes one wonder how this could have made it to \"straight-to-video\" let alone theatrical release. And don't get me started on the ending!\n\nIn other words, I Hate, Hate, Hate, Hate, HATE this movie-uh,I mean this McDonalds commercial.\n\nRating: a redundant 0 out of *****"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "pixie-oliver",
        "review_rating": "",
        "review_title": "ET II: Electric Boogaloo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "AJRimmer74",
        "review_rating": "2",
        "review_title": "This movie made me hurt inside",
        "review_detailed_main": "If there was ever a movie that most likely funded entirely on product placement, \"Mac and Me\" is that movie. I stumbled across it on cable and had to rent the film to get the full effect. It involves the predictable \"E.T.\" theme with an alien stranded on Earth and he must rely on children to get him back to his family. These \"Mysterious Alien Creature\"s , or \"MAC\"s, are an amazing bunch that can be literally sucked into a vacuum tube, conduct electricity with their hands and still be able to swim and take showers, and can be rescued from death by drinking Coca Cola.\n\nThe main character in the movie is Eric, a wheelchair-bound boy who moves with his family from Illinois to California so his mom can work at Sears and somehow afford a 3 bedroom house. The family is so oblivious to what goes on around them that they fail to see the Mac wandering around the house, standing behind them and reading the newspaper in front of their house. Not even driving a mini car down the street being chased by a pack of dogs is enough to divert their attention. After being lured down a steep hill by the ever-whistling Mac and surviving a 500 foot drop into the water, Eric vows to catch the creature. After a scene involving a dummy attached to a vacuum cleaner being spun around and pulled on a track, the Eric and Mac meet face to face. They become fast friends and eventually they attend the infamous party at McDonalds. This party includes a dance contest that seems to take place both inside and outside of McDonalds and a rare appearance by Ronald McDonald himself. Carefully trying to avoid detection by advancing federal agents, Mac does a solo dance routine on the McDonalds sales counter wearing a teddy bear outfit. The agents do eventually catch on and chase Eric down a hill and for ,what it seemed like, 10 miles on foot to Sears.\n\nAt this point, I had to check if this movie was made in Canada but it wasn't. It just made no sense whatsoever and begged the question \"why?\" about nearly everything. The acting was horrible, the effects were miserable and it actually seemed as though they tried to make a good movie. That is why it has found a place in my heart along with the old MST3K movies I remember seeing. I liken it to a car wreck.....they are never good to see, but you just have to look."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "TOMNEL",
        "review_rating": "1",
        "review_title": "Nothing' worse than curling up with a six pack of coke, a Big Mac and a bag of Skittles and watching this movie with the ones you love.",
        "review_detailed_main": "In 1982, Steven Spielberg's film E.T. was released, and it was a lovely movie that gained critical attention, and did very well at the box office. Mac and Me seems to have the opinion \"Why not cash in on someone else's success?\" This is a bad rip-off if I've ever seen one. It probably would've been better if Mac and Me copied E.T. scene by scene, because though it would've been an even bigger rip-off, it would have at least retained some of the magic E.T. had. As it stands this is a weird flick, and in no way can it be qualified as magical.\n\nSome aliens are on their planet when a NASA spacecraft lands and vacuums them up. They end up on Earth, and all four of them escape. Three escape into the desert, and the youngest one, Mac, ends up in a suburban area, where he meets paraplegic Eric and his family. It's hard to come up with any more plot synopsis, as this film has no plot. The F.B.I. is after Mac, and they search high and low for him, from the busy streets, to the crazy dance hall known as McDonalds. Chaos ensues as Mac tries to find his family and the idiot F.B.I. agents try to find him.\n\nThis movie has been criticized galore for it's constant references to products. Basically, this is a 90 minute long commercial. Coca Cola is constantly shown on screen, and some scenes play off as actual Coke TV spots. McDonalds is often mentioned, and this film is mother to the infamous synchronized McDonalds dance scene, which is as lame and corny as any other dance scene ever. Skittles also appear frequently and Mac loves them, so should you. Buy Skittles, buy McDonalds, buy Coca Cola and buy any other product we jam in your face. This movie left a bad taste in my mouth that Skittles, McDonalds and Coke would only worsen.\n\nThe acting is OK. It's about standard for an average kid's flick, despite that this was well below average all together. The puppet of Mac was about as real looking as Kermit the Frog, if not less so. Mac, and his family, always had their mouth in the same circular position, and instead of walking, Mac seemed to roll along as though being wheeled around by a talentless puppeteer. Mac is an ugly puppet, as his family are downright scary looking.\n\nDozens of mistakes can be seen throughout the movie, but this is a small thing compared to the incompetence of the rest of the movie. Start a drinking game where you take a shot every time you spot a Mac and Me mistake. I guarantee you won't make it to the end of the movie.\n\nHorrible writing...one awful line after the next! As Mac rides on a remote control car towards a girl and her mother, the mother asks, \"Is that guy crazy or something?\" Does a remote control car look like a guy? That doesn't even make sense. The little girl should have replied, \"No idiot! Are you blind?\" The little handicapped boy is blamed for messing up a room, yet he obviously cannot get out of his wheelchair, but still his mother punishes him. Nice woman, very practical thinker. Eric rides his wheelchair through the street with Mac on his lap as the F.B.I. chases him. Cars are crashing to avoid hitting him, and he just mindlessly rolls away. He should've been locked up for that. What a careless little creep.\n\nI like the musical score here. It's like a good rip-off of John William's score for E.T., but not as good. Still, it's the best part of the movie.\n\nOverall, this movie is just awful. The special effects are bad, the writing is horrendous and the commercials are plentiful. This is recommended only for enthusiasts of cinema that equals a long painful enema.\n\nMy rating: BOMB out of ****. 99 mins. PG for brief mild language and violence."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Fire_Seraph",
        "review_rating": "1",
        "review_title": "Why this wasn't on MST3K when it was on Sci-Fi channel, is beyond me!",
        "review_detailed_main": "This is ONE those movies, that as a kid the trailer tricked me into thinking it was going to be good. I'm sorry to say, that after I finally saw it in my fifth grade class, I was truly appalled and disappointed in it after seeing it.Please bare with me, because I had not seen it since 1989.\n\nI think the teachers did it to get back at many of us for misbehaving in class. Here is my somewhat short summary about it. It all starts on a distant planet, where the aliens use reeds as straws to sip a drink in the ground. I'm not sure if they are supposed to be a race of stretchy, elongated cows or goats, but thats what they kind of looked like to me.\n\nA satellite sent to space, lands and starts collecting dirt and rock samples, but when the aliens get too close, it decides to collect them too. It arrives back home at the (NASA I think ) space station, and when the scientists open it, they escape. While trying to escape to the desert, the baby, alien calf gets lost. Now, all that I've told you so far may make the story seem great, but it starts to take a nose dive once they start the overkill; with product placement.\n\nIf this is what they were going to do, why didn't they simply make fun of product placement in movies, in this movie? It could've been a true cult classic right there, and possibly a landmark movie. I'm not sure how they would've worked those aliens in there, but someone with creative talent could've pulled it off. Maybe in order for Mac and Me to truly be saved, someone like Frank Oz needs to rewrite the script.\n\nJust like he did with Little Shop Of Horrors. Now that movie was turned into gold. Really, it needs a better script without it being bogged down with the said product placement, a better middle without the dorky dance scene, and a much better ending. As long as they don't pollute it with gross out toilet humor, like most so called crappy kiddie films out there.\n\nThat is the only good thing I can say about this turkey, it don't have flatulent jokes in it. Or evil bratty kids for that matter. Also the look of the aliens needs a lot of work. They not only look like they are half asleep, but the adults look absolutely creepy, like something you might see in a carnival fun house. They could use better colors too, not look like dried out leather. Maybe make them look like green martians or something. Really, it is so bad it makes Pod People almost look good! Unless you plan to do a truly excellent remake, don't bothering watching.\n\nLet your kids watch Flight Of The Navigator, Batteries Not Included and E.T. instead."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "council24",
        "review_rating": "1",
        "review_title": "Absolutely Terrible",
        "review_detailed_main": "I wish I could give this film a minus grade. I couldn't believe that I ran across this film again. This film was released almost 17 years ago, but I still remember how terrible it was. It was that bad! This is one of my picks for all-time worst film. This terrible film wasn't only a horrible rip-off of \"ET\", but it had a dance sequence in a McDonald's. Isn't that enough information to understand how bad this film was? Even the little alien was butt ugly. I'm not sure what the makers of this film were thinking. Why they'd even try to make a cheesy rip-off doesn't make a lot of sense. It was more blatant in 1988, but even now it looks pretty crass. A Horrible film! Miss this Disaster!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Wulfstan10",
        "review_rating": "1",
        "review_title": "The Worst Film I Have Ever Seen",
        "review_detailed_main": "Considering that there are many other comments about this film with roughly the same opinion, and that this film so disgusted me that I couldn't watch the whole thing, I shall keep this brief.\n\nI first knew this would be utterly dreadful and a film to avoid at all costs when I first saw it in a video store in the mid-90s. The box alone was more than adequate warning of how horrible this film truly is. Unfortunately, I had the misfortune of glimpsing it one day on television and mistakenly figured I'd watch at little to see how bad it was.\n\nI can think of nothing good about this film. The horrid creature, \"Mac\", is so poorly made that it is truly disturbing. This was the primary impetus for me turning it off because I simply couldn't stand to see that thing one second more. In addition, the acting is utterly abysmal and what I saw of the story appeared to be a moronic rip off of already tired elements from E.T., itself not exactly a great cinematic achievement.\n\nApparently, there is much more about this film that is awful, such as alleged Coke and McDonald's plugs and dance routines, etc., but I couldn't stand the film long enough for those elements to lodge themselves in my brain and I cannot personally comment on them. Suffice it to say, that this film is an absolute monstrosity even without those added negatives.\n\nNormally I do not write opinions of films unless I have seen basically the whole thing, but I felt that in this instance, I had adequate exposure, and my opinion was strong enough, that a comment was appropriate."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "watchtiger1",
        "review_rating": "1",
        "review_title": "Well, not much good to say about this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "herrgaman",
        "review_rating": "1",
        "review_title": "Let it be forgotten",
        "review_detailed_main": "Imagine a rewrite of ET in which he is called \"Reeses.\" Eliminate ET's production values. Then remove any charm or believability from the ET script. What you get is Mac and Me. This movie is not a harmless family film. This movie is not enjoyable, even as trash. This is quite simply the most egregious, and inept, example of product placement in the history of film. I find Mac and Me just as disturbing as Manos: Hands of Fate, because Mac and Me somehow received wide distribution. Please don't let your children watch this movie."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "udar55",
        "review_rating": "10",
        "review_title": "E.T. phone lawyer! E.T. phone lawyer!",
        "review_detailed_main": "I was 13 the summer that MAC AND ME came out and even then I could sense how calculated and commercial it was. Naturally, I didn't see it (like the majority of the world). But with its new cult standing, I had to finally check it out and it definitely deserves its standing. What were they thinking? An E.T. rip off about 5 years too late. And not only that, it rips off a major moment from STARMAN, right down to the aliens walking through fire. The level of product placement is astounding. I haven't seen this much Coke on screen since BLOW (ah, boo yourself!). I counted 15 moments where characters offer up a Coke (Skittles and McDonalds get off light compared to that). Seriously, one could start a Coca-Cola drinking game with this but I fear people participating might have their teeth rot out by the end of the 90 minutes. I will say that I like the alien designs better than the horrifically ugly E.T., even if these aliens do look like Imogene Coca in NATIONAL LAMPOON'S VACATION. I will also give the production credit for casting a real boy in a wheelchair in the lead. I will give them a hug and kiss for throwing said boy off a cliff. Again, what in the world were they thinking? I give this a 10 for being so amazingly blatant."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Goon-2",
        "review_rating": "6",
        "review_title": "Leave it alone!",
        "review_detailed_main": "So it's not another \"Gone With the Wind.\" Is any movie that was designed for a very young audience really going to be that great? \"Mac and Me\", by any terms, is not considered to be a great movie, or even a good movie, but it's ENTERTAINING! I thought the alien was adorable, the relationship between it and the kids wasn't bad, and *bloog* I LOVED the alien's parents at the end. I wonder who played those people, especially the father? I wonder what it would be like to walk around in an alien suit? It was a cute alien suit too. Anyway, who cares if it's not a good movie? How can anybody hate those sweet little creatures? If you do hate it, show it to your younger relatives, or leave or something. You don't have to watch it and put it down!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "colm_sligo",
        "review_rating": "1",
        "review_title": "Utter crap!!!!",
        "review_detailed_main": "I wouldn't let my worst enemy watch this movie! it was as if huge corporations latched on to et. God this film sucked, everything about it sucked, i watched it when it was on TV because i was seriously unable to turn it over, it was so terrible that i had to see where it was going. It wasn't even good, the little boy who finds the alien names it mac as it gets hooked on MC Donald's and he is hidden by the boys sister, an employee, The give him coke and skittles to keep his energy up, and they use them to stop macs family from dying. Some huge marketing people must have had a field day with this film, all sensibility went out the window with this film, Thankfully this film failed at the box office, and if you watch it you'll know why! Worst film ever!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jamison_hult4646",
        "review_rating": "",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "moviesnob1138",
        "review_rating": "1",
        "review_title": "The McDonald's scene is possibly the worst scene ever on film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Pretentious_crap",
        "review_rating": "2",
        "review_title": "A Film About Aliens Becoming Americans!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Thornfield2",
        "review_rating": "2",
        "review_title": "Laughs Galore",
        "review_detailed_main": "You want a good laugh? Then watch this cheesy film that would make the horrid flick, \"Martians Go Home\" look like a Academy Award winner. First of all you got those ugly, creepy little martians that are trying to be cute, when if you were really to encounter one,you would shudder or run like h. Then you have the pretentious little boy who's scenes with the nasty little beast look as fake as little Timmy in Lassie, which is really nausiating. And finally, my stomach hurt for days after watching that stupid McDonald's dance/musical scene. I'm with Shark-19 when he said he was rolling because my eyes were watering from laughing so hard.Depressed? Suicidal? Watch the McDonald's scene from this awful flick and you'll feel great. It's like Prozac."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ironman_988",
        "review_rating": "1",
        "review_title": "Man this movie was terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "MWillis",
        "review_rating": "1",
        "review_title": "One long annoying TV commercial",
        "review_detailed_main": "This movie only makes sense once you examine the many heavyhanded `product placements'. It is one long ad for Coke, McDonalds, and other products. Unfortunately, it is also a bad photocopy of ET. This movie is the worst I have ever seen. It is truly outrageous, but might be funny in a `worst movie contest' film festival."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "matthronick",
        "review_rating": "2",
        "review_title": "Moral: eat Skittles, drink Coke.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Bolesroor",
        "review_rating": "3",
        "review_title": "A Word From Our Sponsor...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Woodyanders",
        "review_rating": "10",
        "review_title": "A hilariously horrible blatant \"ET\" rip-off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "dieseldemon85",
        "review_rating": "6",
        "review_title": "Only the eyes of a child should judge this film",
        "review_detailed_main": "If your an adult, you shouldn't review this film as it is only intended for kids. I remember it as a child one of my favorites along with Flight of the navigator. The story is cheesy, but what was enjoyable is how cute the aliens look with their big blue eyes, and monkey like faces, and even today how many films were made that featured a lead character with a disability? None come to mind so I tend to view it in a different light than most. I do remember the McDonalds scene, and Jade going down a hillside in his wheelchair. It definitely isn't an Oscar contender but if your between the ages of 4-11 you may get some entertainment out of it, a fun companion movie to E. T or flight of the navigator. Another fun nostalgia film if you grew up in the 80's is the 1974 Jack and the beanstalk cartoon."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "falco12351",
        "review_rating": "1",
        "review_title": "the worst Si-fi movie of all time",
        "review_detailed_main": "this film is nothing but a blatant rip off of E.T. with bad acting, bad dialog and bad directing. the sponsors who invested in this movie would have been disappointed and if McDonalds were hoping to raise money for the McDonalds house charity were idiots in fact this movie cost the charity money I mean that money could have saved people from starving to death but they decided to waste it on this insult to entertainment it makes Garbage Pail Kids The Movie look like The Godfather, it makes Howard The Duck look like Indiana Jones it makes Slumdog millionaire look like the Shawshank Redemption and thats why Mac and Me is the worst Si-fi movie of all time, AVOID THIS MOVIE AT ALL COSTS!!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Sandcat2004",
        "review_rating": "",
        "review_title": "Odd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ironhorse_iv",
        "review_rating": "2",
        "review_title": "This movie is no Happy Meal. It was Mc-Waste of My Time. This movie sucks.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "gavin6942",
        "review_rating": "4",
        "review_title": "The Poor Man's ET",
        "review_detailed_main": "A Mysterious Alien Creature (MAC) trying to escape from NASA is befriended by a young boy in a wheel chair (Jade Calegory).\n\nThis is basically the same story as \"E.T.\", except instead of Reese's Pieces we have Skittles, and instead of a bike we have a wheelchair. Same alien being chased by NASA. Same older brother, with the sister now being a neighbor.\n\nThe movie is notorious for its McDonalds product placement. I had heard that the movie was one big McDonalds commercial, and that is not really a fair statement. However, there is about a five-minute scene featuring Ronald McDonald, many choreographed dancers, and McDonalds food galore. It really serves no purpose other than to make McDonalds look like a fun place to be (which it generally is not)."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "rorymacveigh",
        "review_rating": "1",
        "review_title": "A Cheap Rip-off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "lee_eisenberg",
        "review_rating": "1",
        "review_title": "Will somebody please send all copies of this celluloid atrocity to another planet?",
        "review_detailed_main": "OK, so what's the worst thing about \"Mac and Me\"? Is it that the movie is a blatant \"E.T.\" ripoff? Or is it that the movie is essentially a 90-minute commercial (complete with a dance sequence in a McDonald's)? Whatever the answer is, the point is that this movie is the celluloid equivalent of a human rights abuse. It has NO good qualities, not a single one (it was incidental that this was Jennifer Aniston's debut). I have seen a number of crummy movies that turned out to have sort of an enjoyable side. Hell, I even took \"Myra Breckinridge\" and \"Mommie Dearest\" seriously (no, really, I did). But \"Mac and Me\" is probably the movie that Dr. Forrester and TV's Frank could've shown Mike, Servo and Crow to make them go insane on \"Mystery Science Theater 3000\". For the life of me I cannot figure out why Steven Spielberg didn't sue the makers of \"Mac and Me\" for copying \"E.T.\" (then again, maybe it's better that he didn't, since it would've given the ripoff undeserved publicity).\n\nIt should come as no surprise that this litany of awfulness regularly shows up on lists of the worst movies ever made. It makes any Ed Wood movie look like a cross between \"Citizen Kane\" and \"Dr. Strangelove\". Thankfully, audiences recognized it for what it was and it bombed, and so there was no sequel."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Jordan-11",
        "review_rating": "2",
        "review_title": "Okay, the product placement?",
        "review_detailed_main": "So this movie was bad, right? I mean, I understand the \"E.T.\"- slash-Reese's Pieces combo, but Mac the alien and McDonald's? Come on. The dance number . . . more bumbling mobsters . . . or were they government agents? I don't know; it was bad, leave me alone.\n\nInterestingly, the young lady who works at McDonald's (The neighbor?) was marginally attractive, yet her other film roles are nonexistent.\n\nOh, and did I ask why no one lost their mind when they realized that THERE IS AN ALIEN BEING IN THE MINIVAN?!?\n\nFinally, I know it's a McDonald's movie, but it was a little too weird P.C. for me--one of the kids was Wheels from the BK Kids Club sans the wig and bad glasses.\n\nBad."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "PCC0921",
        "review_rating": "4",
        "review_title": "Thank You to Paul and Conan",
        "review_detailed_main": "I only knew about Mac and Me (1988), from the Paul Rudd comedy-bit, that he has done on every appearance, he ever made on the Conan O'Brien show, over the last 20 years. The infamous scene of the wheelchair going over the cliff is a huge part of that bit. Finally, over 35 years after the release of the film, I saw Mac and Me (1988), after reading, that it's one of the worst movies ever made. So, I went into this movie with a very open mind and what I have concluded is, it's a very weird movie. I really wanted to give this film an E for Effort (which on my ratings scale is considered fair/good/average 5/10), because it was winning me over in the first quarter of the film. I did find it interesting, that after I saw the Paul Rudd bit so many times over the years, might bias my opinion of Mac and Me (1988), so I made sure to look at the film as objectively as possible. It is clearly capitalizing off of the success of E. T. the Extra-Terrestrial (1982), six years later.\n\nThings begin to crumble for the remaining 75% of this movie. The overall plot of Mac and Me (1988), starts to go down hill quickly and the product-placement you see all over the screen, actually doesn't bother me, as much as the unexplainable dance number that breaks out in the McDonald's, in order to sell the product. It totally derails the pace of the film, among a few other really goofy moments with the aliens. Also, these E. T. the Extra-Terrestrial (1982), rip-off character designs, are really creepy looking compared to the lovable Steven Spielberg space-Bambi. The special effects aren't too bad for a low-budget, 1980s film, but that means, other areas of the film will suffer, because all the money went into the effects, such as acting, editing, soundtrack, no notable stars, audio mistakes, creature designs, you name it. The cheapness of Mac and Me (1988), flattens the good special effects. I can't say it's one of the worst movies ever made, but even influence from Paul Rudd can't save Mac and Me (1988), from still being labeled as a failure, but one that deserves to be watched, because you have to see this movie to believe it. Still a joy of wackiness.\n\nPMTM Grade: 3.9 (F+) = 4 IMDB."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "angicornl77",
        "review_rating": "5",
        "review_title": "This movie is alright",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "dvbiz",
        "review_rating": "9",
        "review_title": "So Fun! Love the 80s. Why such bad reviews? Anything in the 80s awesome",
        "review_detailed_main": "I don't understand the bad reviews. It's a very fun show that's from the 80s with great nostalgia. In the category of ET, short circuit, and any other movie with little out of this world creatures. Anyone who dislikes the show, their reviews are Fromm the past 5 years, lol! Nobody these days know how to review a movie! So these bad reviews should help you to ignore any of these millennial punks. Only halfway through the movie and I guarantee you I'll be perfectly fine all the way till the end. There's no way that you could hate 80s movies. Ignore the bad reviews and give it a watch."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "stacy3",
        "review_rating": "7",
        "review_title": "thought this movie was cute",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "cande56755",
        "review_rating": "1",
        "review_title": "A child's eyes in wonder and a parents in shocking wide eyed disbelief",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "uds3",
        "review_rating": "",
        "review_title": "I will stand up for this film under threat of torture.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "movieman-1408",
        "review_rating": "2",
        "review_title": "pretty bad ok very bad",
        "review_detailed_main": "I liked it when i was 8 years old but dont age well cheap special effects its a full lenth coomercial for mcdonalds n coke. Thank god no sequal got made people says its an e.t rip off menoting et in same sentence as this is given it to high praise. I sat dont waste your time may be one of the worse films of the 80s n id say it is worse film of 88. Bsd filmaking all the way. Even worse than gsrbage pail kids n howard the duck no im not kidding. I guess ive bashed it enough. Like i said dont bother watching it has it ever put on dvd? I dont know n bother bothered to check. The alien wasent funny either last thing ill say about tis."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "luvdatbud",
        "review_rating": "1",
        "review_title": "Two ways to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "dylanhenty",
        "review_rating": "3",
        "review_title": "I wish i could have rated this lower but it was too funny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "shunkhood",
        "review_rating": "2",
        "review_title": "not enough mcdonalds",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "vertigo_14",
        "review_rating": "3",
        "review_title": "Stinkronicity. (spoilers)",
        "review_detailed_main": "Alright, \"Mac and Me\" was a lame attempt to recreate E.T. in some form and fashion, but for crying out loud, I could name a hundred movies that merit a place on IMDb's Worst 100 Movies list, and this sure as hell ain't one of them. I mean, in the first place, it's a kids movie. Filmmakers are entitled to some corniness and take advantage of some branding (where they or the studio executives lack the drive for creativity). If nothing else, this is a horribly embarrassing time capsule artillery of 80s cheesiness. And I have to wonder why filmmakers assumed the easiest way to relate to kids' interest was with some dorky \"streety\" dance scenes?\n\nThis one is the story of a family of newcomers to California where there just happens to be a stranded Alien baby (or whatever you want to call it) who strays from his Alien family which are transported to Earth after being sucked up by a NASA satellite. The baby befriends the youngest son. As it was in E.T., the boy tries to convince only those he trusts most (his brother and the neighboring siblings) of the Alien's existence and help return the thing to its family. Look for John Ward as the older brother (hubba! hubba!) and a super-cheesy slice of sentimental in the finale. Kids might like it. Apparently not too many others do."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "bowdock",
        "review_rating": "10",
        "review_title": "A global achievement in cinematography perfection",
        "review_detailed_main": "I was a depressed and soulless body for years tredding the line of life and death. When all was said and done and the outlook on life at its darkest point I stumbled upon a blockbuster vhs rental of mac and me. I had nothing else to lose so I went home and put the video tape into my age old television. The next 90 minutes were the most vibrant and beautiful moments of my life. The joy I had eclipsed the birth of my only son. Especially the wheel chair scene which had me clawing dents into my 1947 rocking chair. The new lease of life enabled me to watch the movie 4 times before I fell into a deep slumber of mac and me dreams n memes. If you're fortunate enough to ever find a copy of this master piece your endorphins will peak to a level only a seasoned crack addict could after their best weekend of excess. All in all the film is pretty nice and worthy of your viewing if not only to realise that is ET whom plays second fidel in this universe."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "bowmanblue",
        "review_rating": "6",
        "review_title": "Help me. I liked this",
        "review_detailed_main": "I guess there comes a point in your life where you realise that maybe you just have no taste. 'Mac and Me' is terrible. It was terrible when it was first released. It was so terrible it gained infamy throughout the years as to how a movie so terrible could have been greenlit in the first place. And it remains as terrible today. I did see it back in the eighties. I didn't like it. I didn't hate it, but there was so much better around and 'E. T.' was only a few years old by then and 'Mac and Me' was just nowhere near as good as it.\n\nI don't know why I watched it nearly thirty-five years later (free on YouTube!), but I actually liked it. Yes, I know there are loads of films which you can enjoy because they're 'so bad they're good.' And this could definitely be described that way. I could leave it there if it wasn't for the fact that, even though I could tell it was awful, I actually found myself enjoying it UNironically (I need help, clearly).\n\nEven if you haven't seen 'E. T.' you probably know the story - cute alien left stranded on Earth, befriends a young boy (government in hot pursuit). Well, someone must have copied and pasted that in terms of 'Mac and Me,' but without the decent script, special effects (and possibly been high on some sort of illegal substance at the time).\n\nI think maybe the major 'flaw' with the film (in 1988 and today) is its weird tie-in with McDonalds restaurant - get the title - (Big) 'Mac and Me?' Yet, for a movie which literally uses a product as its title, there's actually not that many references to the fast food chain, besides the truly surreal song and dance routine roughly halfway through. In fact, if I didn't know better, I'd say the film should really be sponsored by Coke a Cola.\n\nI can't possibly recommend this film to anyone. Objectively, it's that bad. Obviously, if you're into those sorts of 'so-bad-they're-good' films then you may enjoy it on an ironic level. But I think there will be few out there who - like me - actually claim it's an enjoyable romp, no matter how bad it really is. I'm now off to seek some sort of professional help for my clear lack of taste."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Awful",
        "review_detailed_main": "This has been described as a rip-off of ET. While I won't go as far as to say that personally, the resemblance between the two movies is uncanny. Except for this, one is a classic, one is a stinker, shouldn't take long to guess which is which.\n\nMac and Me is an awful movie is on its own terms. In my opinion, the sole bright spot is Jade Calegory, who gives a courageous and touching performance, plus she is the only actress who looks natural within the film. The rest of the acting is not good at all, even from Christine Ebersole. Coming off worst is Jonathan Ward who is incredibly obnoxious and annoying here.\n\nAs for Mac himself, he isn't in the least bit endearing, he is ugly, artificial and annoyed me rather than touched me. The story is predictable, and further suffers from clichéd characters, uneven pacing and a flat ending. The production values look as though the film was on the cheap, the music is execrable and enough to rip out your ear-drums and the direction is uninspired. The script is absolutely awful too, being both unfunny and cloying.\n\nOverall, an awful movie. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Dockelektro",
        "review_rating": "",
        "review_title": "A laughable rip-off",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "so bad that it's bad",
        "review_detailed_main": "A NASA probe lands on an alien planet. A family of aliens are sucked into it and gets sent back to Earth. The young baby alien escapes and stowaway in the Cruise family van. It's single mom Janet (Christine Ebersole), older son Michael, and wheelchair-bound youngest Eric. They move into a new home next to neighbor Debbie and her older sister Courtney.\n\nThis is a legendary cult ET ripoff. My first exposure is Conan O'Brien showing the same ridiculous clip over and over again. It has all the elements of a truly bad movie. It is sincere. It has an overt tie in to a commercial endeavor, in this case McDonald's. Ronald McDonald is actually talking. It has the undeniable copying of a real iconic movie, but it does it in a truly bad way. The alien design is ugly, amateurish, and silly all at the same time. They are pot-bellied, sleepy-eyed, butt-head, o-faced rubber suits. Ebersole is a solid actress as the mom but the kids are all lower level actors. They don't have enough charisma to be bad. If not for laughing at it, there isn't much here. The basic story is structurally sound but the movie is really bad. One has to shake one's head at the dance break. Just replace kids with bikes with a kid in a wheelchair."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "2",
        "review_title": "This is what pain feels like",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "zubairhobbiest",
        "review_rating": "1",
        "review_title": "Good movie for its time but very cheesy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "TrailsWest",
        "review_rating": "1",
        "review_title": "\"It's the Real Thing, Coke Is.. MAC and Me sucked big time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Josephpr1990",
        "review_rating": "1",
        "review_title": "Absolute stinker",
        "review_detailed_main": "I've only seen some bits of this 1980s film on the internet before. I thought I never watched any 1980s films like that before in my entire life. It doesn't look very good as ET the Extraterrestrial. It appears to be a total rip off of the same 1982 film. Besides I really don't like it at all.\n\nI've heard it's utterly rubbish. I'm sure it is one of the worst films of all time.\n\nI'd say ET the Extraterrestrial (1982) is way better than that awful 1988 film.\n\nOrion Pictures (which is owned by MGM) should definitely be sued by Universal for copying their beloved franchise ET the Extraterrestrial, you know.\n\nIf you dislike this film, don't watch it. Don't attempt to waste your money on DVD nor Blu-Ray.\n\nGo and watch ET the Extraterrestrial instead."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jaws1780",
        "review_rating": "1",
        "review_title": "More like \"Mac and Cheese.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "interestingfunstuff",
        "review_rating": "1",
        "review_title": "The First Alien Ever Named After A Disgusting Fast-Food Hamburger! WoW!",
        "review_detailed_main": "That's right folks! That's why our cute little alien buddy is spelled \"Mac\" instead of \"Mack.\" There's even have a scene where we get to see a crowd of young adults singing & dancing in a McDonald's restaurant while Mac is attempting to escape some men-in-black! Mac and Me is the ultimate product placement movie! Sheer evil genius! I lost track of how many times they mentioned something about McDonald's in this film. It's so pervasive Mac and Me should be considered one long commercial and it should have been free to watch when the film was released!\n\nOn a more somber note. This could have been a great movie. Sure it's an E.T. carbon copy. But so what! You could tell somebody was trying hard to write a meaningful story. What a shame! Too bad corporate backed insanity won the day!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jonesberney",
        "review_rating": "10",
        "review_title": "MAgiC and MEga!",
        "review_detailed_main": "A lot of people compare this film, often unfavourably to E.T. However, the similarities it does share with that film are massively outweighed by its differences. E.T is a little brown alien, MAC IS AN ORANGE ALIEN! E.T says things like, \"Ee-ll-i-ooot\" and \"Oow-ch\", MAC CAN'T SAY HUMAN WORDS! E.T has a glowing finger, MAC DOESN'T! E.T is alone on planet Earth after his family leave him, MAC'S FAMILY ARE ON PLANET EARTH WITH HIM! Elliot from E.T has no physical disabilities, THE BOY FROM MAC AND ME IS IN A WHEELCHAIR! The music from E.T is an original score from John Williams. THE MUSIC FROM MAC AND ME IS BY SOMEONE WHO LIKES THE BACK TO THE FUTURE MUSIC AND HAS JUST TRIED TO COPY IT! Where is the McDonald's dance scene in E.T? Oh thats right, there isn't one. Where are the big name stars in Mac and Me? Oh that's right, there isn't one!! Come on people, lets stop saying these films are similar. People say me and my brother are practically the same, but there's loads of differences between us. Please judge these brother films on their separate merits."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Scotty-65",
        "review_rating": "7",
        "review_title": "How can you not like a film like this",
        "review_detailed_main": "I must admit that the first time I saw this film, on a plane no less, I was less than impressed. But nostalgia got the better of me when one of the guys rented the film one stormy winter's afternoon.\n\nSeveral viewings later and we realised what a classic we had. The whacky completely inexplicable \"racoon scene\" where, as filler between scenes, we get to watch a racoon knock over a trash can. (why?? who cares).\n\nMac \"swimming\" to the rescue warranted a chuckle - very Prince of Tides with the view from below as he swims past.\n\nThen the \"Wacky D's\" dance routine is worth the cost of the video rental itself.\n\nIt's been year's since I watched but I'm ready to see it again."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "thedanny-10831",
        "review_rating": "3",
        "review_title": "Almost everything in this movie doesn't work absolutely. A lot of product placements and less substance",
        "review_detailed_main": "This film tries to be original or even better than the unforgettable E.T., but everything is absolutely embarrassing, even the characterisation of the aliens' family. The nonsense of many scenes is indescribable. I can't stop to think for example to that scene where the house is turned upside down by the alien and the mom blames his son..... ON A WHEELCHAIR; or the infamous group dance at McDonald's as a sort of excuse to promote the fast food company. And the ending... oh my God, so stupid and nonsense too. After this film, E.T. would have probably changed his mind about the human kind and would have been part of the aliens' team on the board of the tripods in War of the Worlds, destroying everything and everybody.\n\nBad bad bad."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "starwarslady",
        "review_rating": "",
        "review_title": "I LOVE THIS MOVIE!!!!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "TheMarwood",
        "review_rating": "1",
        "review_title": "Calling this a movie is like categorizing spam as meat",
        "review_detailed_main": "Most of the budget was funded by McDonald's and Coca-Cola, but Skittles also gets in on the action about an E.T knockoff befriending a young wheelchair bound boy. Mac and Me truly fits the bill as one of the best bad movies of all time. Watch the filmmaker's souls evaporate into burger grease as an inexplicably random McDonald's dance sequence, with the big man himself Ronald, is thrown into the middle of the film. It's a movie written around product placement and cashing in on the success of E.T, but this shameless corporate shill of a film bombed a bloody death at the box office - but not before the filmmakers threaten the audience with a 'we'll be back' title card."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jellopuke",
        "review_rating": "4",
        "review_title": "MacDonald's and Me",
        "review_detailed_main": "An alien family gets sucked to earth and escapes. The baby (MAC) meets a boy in a wheelchair and together they go on an adventure to be reunited.\n\nThis knock off of ET is neither as touching nor as entertaining as the original. The one thing it does have is the most crass and exploitative use of product placement of maybe any 80s movie up to that point. The dancing McDonald's scene alone is worth seeing just for how insane it is. The rest, not so much, but that one part is epic level garbage fun B movie schlock that deserves a place in your library and your brain for all of eternity... or at least as long as you have the capacity to remember."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "camarossdriver",
        "review_rating": "1",
        "review_title": "A 3.4 IMDb rating is WAYYYYYYY TOO HIGH!",
        "review_detailed_main": "I want to sue someone...ANYONE who had ANYTHING to do with this heap of garbage! The precious minutes of my life WASTED on this (I guess you could call it a movie) it's closer to an hour and a half commercial for McDonald's and Coca-Cola...and disposable drinking straws. Whoever put this pile of trash on the big (and little) screens should be VERRRRY ashamed of themselves. How the HECK didn't the creators of E. T. not win themselves a HUGE LAWSUIT by suing the PANTS off the thieves that put this (cough cough) movie together???? If you are even THINKING of watching this dumpster fire,I am warning you now...just step away from the Blu-Ray or DVD player now. You will thank me for telling you this. Honestly...this \"film\" isn't even so bad it's good...it's just bad...REALLLLLY bad.\n\nToodles."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "sonofoddin",
        "review_rating": "5",
        "review_title": "Respect the fact that people can enjoy this film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ericstevenson",
        "review_rating": "3",
        "review_title": "They blew up a mall!",
        "review_detailed_main": "It's kind of sad to say that I've seen much worse knockoffs of ET. \"The Pod People\" and \"Nukie\" are considered some of the worst films ever. This movie features an alien known as Mac that befriends a boy named um, Eric. It's sad to know that my name was used in such a bad film. Eric moves with a wheelchair and you can tell it's just a ripoff of Elliott riding his bike. I guess it's at least not as bad as \"Leonard Part 6\".\n\nMac and his family get better by drinking Coca-Cola. There's a dance number at McDonald's. Good thing I already ate by the time that scene happened. I would have rather went there than see this movie. The worst part might be how the aliens blow up a mall at the end and it's never brought up again. Yeah, no one cares that they probably killed people! *1/2"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "stlouisblues-85757",
        "review_rating": "1",
        "review_title": "The only way to describe it:",
        "review_detailed_main": "No, Satan. I would like to keep my faith in humanity."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "drhoads-93743",
        "review_rating": "1",
        "review_title": "So bad that it's bad",
        "review_detailed_main": "The Room is so bad that it's good. Then way below that, there's Mac and Me. Then below that, there's nothing. Because literally nothing is worse than this film."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Movie Nuttball",
        "review_rating": "9",
        "review_title": "Good E.T. like film!",
        "review_detailed_main": "Mac and Me maybe similar like E.T. but I really like the movie.It has many good moments and and is some times funny.The acting is good and the story is fine. and the effects are good.The music by Alan Silvestri is pretty good too.If you are a fan of E.T then I think you'll like Mac and Me!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ariasisaac-89085",
        "review_rating": "6",
        "review_title": "It's actually growing on me.",
        "review_detailed_main": "It was a good story, I actually felt genuine emotion for the characters. The only thing I didn't like about it was the Mc Donald's Sequence, it wasn't Necessary to be in the movie. Don't listen to the hate, it's worth watching if u want to see a goooooood sci-fi movie."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "chow913",
        "review_rating": "2",
        "review_title": "Cheap 'E.T.' Non Toxic Backwash",
        "review_detailed_main": "First off I'd like to state that haven't seen this film since 1990 on HBO. But even the trailers warned of doom. When the trailer isn't narrated by Don LaFontaine but by Ronald McDonald (not kidding) you know this film isn't even trying to be taken seriously! 'Mac and Me' was obviously trying to exploit the phenomenal success of 'E.T.' which remained playing in theaters for over 3 years into 1984! But it was only available on VHS in bootleg format until 1989. Hence, in 1988 there was a void that needed to be filled. America was E.T.less until 'Mac and Me.' Well first off this film isn't nearly as bad as everyone says. It's just rightfully one of the most hated films of all time because it's such an obvious rip off of 'E.T.'!!! Right down to scene by scene! Not kidding, some scenes are identical to 'E.T.' like the G men chasing the school kids.\n\nIt's pointless to describe the plot because it's exactly like 'E.T.'!!! I can't stress this enough! From how the boy meets the alien to how the single mom finds out her sons have been hiding it, it's exactly like 'E.T.' Except not good. But not really that bad.\n\nImagine if the Lifetime network was given the screenplay for 'E.T.' rather than Steven Spielberg.\n\nThe cartoonish action violence is also WAY over done. Sure E.T. himself took some Tom & Jerry style blows but here poor Mac gets the full Ren & Stimpy treatment. Getting sucked through vacuum cleaners more than once and getting bounced off car windshields.\n\nIf all this is supposed to be comical, it's NOT. Poor Mac is like the Wiley Coyote of cute aliens.\n\nThe only other difference is that this time Elliot is in a wheelchair. This way McDonald's which produced the film can boast about how the Ronald McDonald House helps the families of crippled kids.\n\nIn conclusion I can think of no reason to watch this film other than the fact that 'E.T.'s Blue Ray release has been totally bastardized by new shoddy CGI FX and reedited to be more friendly. Such as removing the G men's hand guns and changing some dialogue. WHY? 'E.T.' was perfect! Just leave it the fxxx alone! Once again the clear solution to this problem is to simply watch a bootleg VHS of 'E.T.'"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "BlackJack_B",
        "review_rating": "",
        "review_title": "A landmark film...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ryantarnold_13",
        "review_rating": "2",
        "review_title": "MAC and Me, as in McDonald's and Coca-Cola",
        "review_detailed_main": "There have been a lot of MST3K episodes which I love, but this movie, showing 1st in The Gaunlet series is stellar. Haven't coughed out a lung laughing so hard in a long time. Yes, its 2/10 for actual movie; MST3K review: 10/10."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "Awful ET ripoff.",
        "review_detailed_main": "Whenever there's a popular movie you tend to get rip offs and ET was one such movie. We got things like \"Nukie\", \"Badi\" and of course \"Mac & Me\". A movie so self aware that they named the alien after one of their biggest sponsors McDonalds. Technically it was financed by Gordon Food Services, the company that supplies McDonald's with their products, but it does star Ronald McDonald in one scene and McDonald's is mentioned many times in it so make of that what you will. You will also notice that other products make their way into this. Coke plays a huge role as being the only thing that people in this movie drink. Sears is the best store in the universe, so much so that the mother moves her family across the country to work at one. Skittles are shown prominently and has nothing at all to do with Reeses Pieces that were in that other alien movie. And for some reason Valvoline. Dunno why that one is there but maybe they needed a couple of oil changes.\n\nThe movie starts when a bunch of creepy looking aliens discover a probe sent to Mars and are literally sucked up by it before they're returned to Earth. They're separated and little Mac, as he's known, winds up stowing away in a mini van to wind up with the people who's Mother works at Sears. Through a series of events little Mac tries to communicate with them, the boy in a wheelchair falls off a clip, there's a dance off at McDonalds and the power of Coke brings dying aliens back to life. Yes, this is as silly as it sounds.\n\nThere is no redeeming feature for this. Although if you want a laugh, check out the dance contest going on at McDonald's it's hilarious. And supposedly there's a young Jennifer Aniston as one of the dancers there."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "sixhoos",
        "review_rating": "1",
        "review_title": "Sooooo baaaaaad",
        "review_detailed_main": "This movie is, in fact, so bad it's funny, especially if you watch the MST3K version. Horrible acting. Incongruent plot. \"Special effects\" out of a high school play. Stupid ending."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Sherparsa",
        "review_rating": "1",
        "review_title": "yes, gave it 1 * only but ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Edge49",
        "review_rating": "5",
        "review_title": "Not great, had that 80's feel",
        "review_detailed_main": "I really hope no one went into this one with high expectations. It was what it was. Just another 80's cheesy movie trying to be like ET. That said it wasn't horrible and I don't understand the super low rating.\n\nI really did enjoy the vibe of the movie. It had all the cheesy cliches from the 1980's that I grew up with. Even the music was spot on. It sounded a little like Back to the Future and it may have been the same music, I don't know.\n\nI do not like the ending at all. It was just so ridiculous and cringy. I'm talking the last 5-10 minutes.\n\nAlso there was an alternate scene that they left out on the version I saw. I had to go to YouTube to watch it. I can see why they took it out but it was also an important part to the story."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "RudeArtAndDesign_Com",
        "review_rating": "3",
        "review_title": "Watch the MST-3000 Version... Its watchable!",
        "review_detailed_main": "Wow, is this movie bad... that's not a question, it's bad! However I just watched Mystery Science 3000's new take on Mac and Me, and they made this movie into something the original creators couldn't, they made it watchable! So maybe this dog-fart of movie may gain a new audience other than stoners and people without cable or internet or a book or a radio or anything in the world else to entertain themselves for an hour and a half. Well maybe all those people but the stoners, they'll watch anything :-)"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "pauljamesross",
        "review_rating": "3",
        "review_title": "Mac and Paul",
        "review_detailed_main": "Didn't mind watching this movie as a kid growing up! Made it a normal routine after awhile. Thoroughly enjoyed it! Haven't seen it since,so as time goes on and we as kids turn into adults,a Lot of things we found enjoyable as kids,don't seem as enjoyable as adults. Guess,this would be one of those things!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "beltranadam-16078",
        "review_rating": "8",
        "review_title": "I enjoyed watching this cheesy film again...",
        "review_detailed_main": "Yes I know the movie is cheesy, but it's a classic to Me as a child. I Loved it and even today after years of the last time I saw it, I still craved McDonald's and I don't really even eat Micky D's anymore. I know that technology is so much better nowadays, but any movie I see from the 80's looks crazy to Me now. And I laughed My butt off today on the dancing scene remembering that most of the 80's movies had dancing scenes like that in them. I watched it today and still enjoyed the cheesy'ness of the film and enjoyed the memories it brought to Me and My childhood watching it with Siblings and Neighbors."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "cgenho",
        "review_rating": "7",
        "review_title": "Hey everyone",
        "review_detailed_main": "My daughter and I just watched it and she loved it as so did I when I first seen it. True it's not the best acting or the aliens didn't look at all right but it is a fun movie to watch because of the nostalgia of our life growing up. I remember going to McDonald's for bday parties. Somebody said this is a knock off of et totally different story line people."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Wizard-8",
        "review_rating": "1",
        "review_title": "Talk about chutzpah...",
        "review_detailed_main": "Orion Pictures seems to have realized before releasing this movie that they had a real turkey on their hands, since they not only didn't have any critics screenings for the movie, they had to resort in TV commercials to showcasing comments from young children who had just seen a screening of the movie! That alone rings alarm bells, but the movie turns out to be even worse than what you are properly expecting. As you probably know, the movie is a blatant rip-off of \"E.T.\", so much so that it's a shock that Steven Spielberg and Universal Pictures did not sue. But the plagiarism wouldn't be all that bad had the movie been executed with enough skill and heart. However, the movie fails in every way you can think of, from the stiff-faced and unexpressive aliens to the human characters coming across as unbelievably stupid. And yes, the many blatant product plugs are pretty shameful. With the original \"E.T.\" movie being freely available, there is no reason to see this shoddy rip-off in its original version. The \"Mystery Science Theater 3000\" version, however, is pretty amusing, though it suffers from cutting about 20 minutes from the movie's running time, resulting in a few severe plot gaps."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Douglas_Holmes",
        "review_rating": "",
        "review_title": "The best thing about this flick-",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "crtshghs",
        "review_rating": "2",
        "review_title": "Only worth it if.....",
        "review_detailed_main": "I watched this movie as a byproduct. Only worth the watch via Mystery Science Theater 3000! (Hence the \"extra\" star!)\n\nJust....just GAWD AWFUL!!\n\nWhich (I'm sure \"former\") studio executive green-lit this dumpster fire of a flick?!? This is pure nightmare fuel!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "decmcg",
        "review_rating": "3",
        "review_title": "So appallingly bad... it's good!",
        "review_detailed_main": "This is without-a-shadow-of-a-doubt one of the most dreadfully APPALLING films of all time!! It's a (disgracefully) shameless rip-off of \"E.T.\" sponsored and financed (SO obviously so) by McDonalds and Coca Cola.\n\nIt's so ludicrous and shameful that once you get beyond that what it falsely claims to be... it actually proves so very enjoyable as the piece of steaming pile of drivel that it actually is.\n\n\"Mac & me\" is the \"Plan 9 From Outer Space\" of its time."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "biyytoo",
        "review_rating": "2",
        "review_title": "Aliens at the McDonald's",
        "review_detailed_main": "Aliens, sci-fi creatures from outer space, do they exist? Or do they not? Are we alone in the universe? Here Steven Spielberg...oops I meant Stewart Raffill, gives us an answer...more thoroughly (I don't think those are his intentions) by copying a successful cult film, but with sad (fortunately) results.\n\nIn the movie we get into that situation where humans steal aliens to study them, but then things happen, blah blah blah and a baby alien (with a terrifying design) ends up in a house with a child in a wheelchair, and between a mcdonald's, a coke and skittles it ends happily ever after for everyone.\n\nObjectively horrible film, 2 out of 10 stars."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "one9eighty",
        "review_rating": "1",
        "review_title": "Just keep him dancing and they'll just think it's a teddy.",
        "review_detailed_main": "Next time you want to win an argument about the worst films, if nobody already has, try dropping \"Mac and Me\" into the argument and see what happens. Regarded as one of the worst films of not just the 1980's, but modern cinema, this film is part rip-off of other successful films, and part advertisement for the American fast-food industry. Having watched this film in the 1980's, I subjected myself to another viewing 30+ years later - why oh why did I did that?? Would I recommend this film? Well, if you are competing with friends to find a bad film then yes. If you want to watch a film which is supposed to be serious but might just having you in ironical stitches of laughter because it is so bad, then yes. If you want to watch this as a serious film and think that it is a good alternative to \"E. T.\" then keep moving. If you want to suspend your disbelief without getting angry and wanting to throw something at the TV, then this isn't a good idea. This film doesn't have many redeeming features and there is a reason that various film forums rank this in the top 10 worst films not just of the 1980's, but of all time. I didn't enjoy watching this in the 1980's when I was a child - I haven't enjoyed re-watching it 30+ years later. If I live out the rest of my life and don't watch this film again, it's been a good life - sorry, that's harsh, but I really didn't/don't like this."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "monarchgallerycambria",
        "review_rating": "5",
        "review_title": "Much, much better than I thought it would be - the main issue is the puppet",
        "review_detailed_main": "For years, one of my comfort videos on Youtube was a Fanboy Flicks review of this film. I was so excited to finally watch it on Tubi with my dad. Turns out -- we both actually really liked it! I really like the mom and two brothers, and thought the acting was pretty okay all around.\n\nI mean: It's not a GOOD movie. But I don't think it's as bad as I had hoped it was.\n\nIn my opinion, the main problem is the PUPPETS. The puppets are just awful looking. But I was still endeared by the puppets, and I still laughed at them. I got a lot of joy out of the puppets, and they did no harm to me."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "MrPaull0324",
        "review_rating": "3",
        "review_title": "A cheesy ET ripoff mixed with a promotion for McDonalds",
        "review_detailed_main": "This was nothing but a shameless and unsuccessful attempt to cash in on ET's past success along with advertising McDonalds.\n\nA family of aliens living on a barren desert planet stowaway on a human satellite and wind up on Earth, particularly California. Upon arriving on Earth, they escape from a NASA sight with ridiculous ease. While the parents and younger sibling flee into the desert, Mac, the older sibling, hitches a ride aboard a station wagon driven by a family moving in from Chicago. Soon, Mac befriends a wheelchair bound boy named Eric, who helps the former find his family and eventually integrate into human society.\n\nThe acting is completely dull. All the human characters sound bored and their performances are unconvincing. The aliens are borderline criminals, as the father steals a security guards' gun and waves it around dangerously inside a grocery store late in the film. Plus, unlike ET, they're also reckless idiots who make no attempt to hide themselves despite the government being on their tail. Mac himself isn't any better or sympathetic, being an annoying troublemaker. Early into the film, he gets Eric into trouble and even nearly gets him killed by mistake.\n\nThe alien designs and animatronics here are poorly made and hideous, also unlike ET, who is cute and ugly mixed together and was played convincingly. Mac and his relatives have gaunt builds, pale skin, bulging eyes, swollen cheeks, and mouths in a constant o-shape. Mac himself sometimes cuts between a kid in a suit and a very unconvincing animatronic. The rest of the effects are equally cheesy and low-grade, like the space shuttle landing and the stop motion effects in the very first scene which set the stage for the rest of a very lame and unfunny sci-fi flick.\n\nThe only real bright side is that the soundtrack was composed by Alan Silveresti, who was far too good to be involved in a third-rate film like this. The pop songs \"You're Not a Stranger Anymore\" and \"Take Me I'll Follow You\" are especially notable but even that isn't enough to save this movie by a long shot."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jacobnunnally",
        "review_rating": "4",
        "review_title": "a turkey - but with high production values",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "urbanhippie126",
        "review_rating": "10",
        "review_title": "i wish i had seen it when it first came out !",
        "review_detailed_main": "then instead of being a cynical 20 year old sneering at the sappyness of it all i would have been 6 year old loving every minute of this cheaper, yet just as magical, version of E.T. The scene at the end of the aliens getting their citizenship was precious. And I want to know which planet is filled with soda."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "mariusjansevanrensburg1",
        "review_rating": "1",
        "review_title": "Directions to watch..",
        "review_detailed_main": "Get high, and then watch this. The movie is terrible, but it is absolutely hilarious when high."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "kirsty_uk",
        "review_rating": "",
        "review_title": "The ending makes me cry everytime",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "gogarrett",
        "review_rating": "4",
        "review_title": "Recommended on a \"so awful it is good\" movie list",
        "review_detailed_main": "I watched this one because I used to be a fan of awful movies. They cracked me up, but were not trying to be funny. This one was trying to be funny and I don't think I laughed once.\n\nI give all the actors credit for being very attractive to watch and also being good actors in the roles played. If it wasn't for them I could not have made it to the end of this muddled and extremely cheesy story.\n\nIt is extremely difficult to make aliens believable in a movie like this. Opening the movie with the aliens was not subtle. The production team seemed to LOVE overexposing the audience with their alien creations, which I believe were actual people in body suits?\n\nI heard about and was interested in seeing the scene at McDonald's, 55 minutes into the movie. It was even more bizarre than I expected. I also did not realize this would be the cheesiest product placement film ever! I believe E. T. was the first to advertise a product in a movie in 1982 with Reese's Pieces. They went ALL OUT in this movie and COKE was used in a similar manner to Reeses Pieces, even to the point of saying \"This must be like what they drink on their planet\".\n\nOverall, it was not that enjoyable of a movie for me. I hope the actors were able to recover from it."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Lackluster-Me",
        "review_rating": "2",
        "review_title": "Preeeeeetttty niiiiiiiiiiiice",
        "review_detailed_main": "Oh boy, oh boy. I've been looking forward to watching and reviewing this and I'm happy to be here finally. This movie is infamously awful and sadly it brings down ET's overall quality just by its own existence but at least \"Mac And Me\" owns it. Similar to other \"so-bad-they're-good\" movies like \"The Room\", Mac And Me knows that it's bad and knows that it's a rip-off of family classic ET, but here's the thing folks. Mac And Me doesn't care at all what you think of it. Where ET had moments of a beautiful friendship, Mac And Me had insensitive stereotypes. Where ET pulled at heart-strings and left viewers in tears, Mac And Me has a 8 minute dance sequence in a McDonald's restaurant. (by the way, the main character is in a wheelchair and forced to just watch as all his friends and Mac in a bear costume are dancing and having a good time. How rude!)\n\nThis movie is bad, yes, there's no denying that. But you know when we get a bad sci-fi movie, we also get a great MST3K episode covering it (which is actually how I discovered Mac And Me)"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "rhqb-61895",
        "review_rating": "1",
        "review_title": "Hahaha what was this?",
        "review_detailed_main": "They spent 13 million on this movie!? Bwahahahaha! It's so bad. So bad..."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "LW-08854",
        "review_rating": "4",
        "review_title": "Baffling 80s kids movie",
        "review_detailed_main": "A really baffling movie experience. The movie makes some really bad choices endlessly plugging junk food and making it an integral part of the plot, not only that but the creature design and puppet work is also really poor. The film has some decent cinematography but I felt like a few scenes were also missing. The movie does still have the feeling that at least it's message is well intentioned if rather on the nose. The best thing about it probably are the performances of its young cast who are all doing actually a really good job, you like them each as characters and the roadtrip aspect worked probably the best. The ending of the movie is utterly ludicrous but it doesn't take itself all that seriously on the whole. It certainly feels like a product of the 1980s. Unlike something like The Garbage Pail Kids it at least didn't feel insultingly kidish or weirdly gross and meanspirited."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "marci-last-dance",
        "review_rating": "1",
        "review_title": "MST3K review was funny, but this was torture",
        "review_detailed_main": "I watched this movie through MST3K when Jonah, Tom Servo, and Crow had to endure \"THE GAUNTLET,\" this movie though, if you try to block out Jonah and the robot's voices, is terrible.\n\nThis movie is painfully trying to be like E. T. E. T. is the superior film while this is just a joke. The film has bad writing, bad characters, awful costumes for the aliens, and the product placement is shameful.\n\nA redeeming quality is that it's so bad, it's good. It's also funny as a gag that Paul Rudd shows the clip of Eric falling in the water as a way to drive Conan crazy. Like seriously, Paul's been doing it for years to Conan, it's hilarious.\n\nMST3K review: 10/10 Paul Rudd joke on Conan: 10/10 Actual movie:1/10."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "bl-63974",
        "review_rating": "2",
        "review_title": "Oh wow and I thought I'd seen some bad ones",
        "review_detailed_main": "Like everybody else I have to say this isay this is a really really really poor rip off of ET. One reviewer said it should make your top 10 list of the worst ever. I very much disagree with him! In my opinion it should be a viable contender for # 1😄"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "blamdrum",
        "review_rating": "1",
        "review_title": "Out of touch corporate poo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "Awwwwwwww",
        "review_detailed_main": "Great movie. A real tear jerker. Ignore the thousands and thousands of bad reviews. They're just being mean."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "beef-638-121436",
        "review_rating": "6",
        "review_title": "Nice eigthies movie for kids.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "afijamesy2k",
        "review_rating": "1",
        "review_title": "This thing should have been in the trash",
        "review_detailed_main": "This is one of the worst movies ever made and it's certainly no E.T. (even flight of the navigator is better than this one), this thing rips off E.T. and gets away with it, I Saw this on cable when I Was a kid and I Hated it, it is a piece of trash, there is nothing good about it, you know the boy and it's alien, this is more like a McDonald's commercial than a movie, even the special effects are a train wreck, the acting is horrible, the screenplay is a disaster on every scene and the writing is a train wreck, believe me, this movie deserves to be one of the worst movies of all time and it shows. just another example at how horrible Hollywood really was, want to see a better science fiction movie from the 80's, see E.T. and to lesser extent flight of a navigator."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "darbski",
        "review_rating": "2",
        "review_title": "El Maco",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jeremycrimsonfox",
        "review_rating": "2",
        "review_title": "A Movie That Fails To Captialize On E.T. By Being A 90 Minute Advert",
        "review_detailed_main": "Mac and Me is one of those films that try to capitalize on the success on another big name movie of the time. With this one, it tries to match the success of Steven Spielberg's classic film, E. T.: The Extra-Terrestrial, which, since its first release back in 1982, has become successful to the point of becoming pop culture (as Elliot and E. T. on the flying bike was used as the logo for Amblin Pictures). However, where E. T. succeeds, Mac and Me falls flat.\n\nIn this movie, an alien family from a desert plant is sucked into a NASA probe and escape a goverment base. However, the child is seperated from the parents by sneaking into a minivan driven by single mother Janet Cruise, who is moving to Los Angeles with her two sons Eric and Michael. Eric, who uses a wheelchair, befriends the alien after he saves him from drowning, and naming him Mac (short for Mysterious Alien Creature) it leads him on a magical journey where he, Michael, and new friends Debbie and Courtney try to reunite the alien with his parents.\n\nYeah, this is a bad movie with its own cult following (as Paul Rudd would use a scene as a way to troll Conan O'Brien on The Tonight Show), as the movie is a alien abomination from start to finish. Mac and his parents have to be one of the ugliest alien designs I have ever seen, and the movie has an overload of product placement (one of them being a dance number at a McDonalds, complete with Ronald McDonald himself). Also, the writing is terrible and the acting is bad."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Hitchcoc",
        "review_rating": "2",
        "review_title": "The Worst of the Worst",
        "review_detailed_main": "The first reviewer did an awesome job of describing what a mess this is. We have the childish plot and the incredible shameless commercialism joined with vapid dialogue. The obvious rip-off of ET goes beyond imitation to a sales job for the Golden Arches and Krispy Kreme. That said, I am convinced that as this thing was being formed, the producers knew exactly what they were doing. This is one of those films that crosses over the line so far that it is beloved by those who are looking for just that--an over the top negative experience that especially kids can hoot at. I only watched it because I hear how awful it was. Not disappointed."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Bmore-Hero",
        "review_rating": "2",
        "review_title": "E.T. Light",
        "review_detailed_main": "\"Mac and Me\" is a film that struggles on nearly every front. The plot is a blatant rip-off of E. T., but without any of the charm or heart. The special effects are laughable, and the product placements, particularly for McDonald's and Coca-Cola, are so heavy-handed that they distract from the already weak storyline. The acting is mediocre at best, with the characters lacking depth and believability. While it has a few moments that might entertain very young children, it's hard to recommend this film to anyone looking for quality family entertainment. Overall, \"Mac and Me\" is a poorly executed attempt at capitalizing on the success of better films."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "mark.waltz",
        "review_rating": "1",
        "review_title": "When they made E.T.'s cousin into looking like a blow-up alien.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "theduk",
        "review_rating": "1",
        "review_title": "Shocking",
        "review_detailed_main": "Even for an 80's film this one sucks, no wait the aliens suck, no really that's all they can do is suck."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "arthur_tafero",
        "review_rating": "1",
        "review_title": "Greatest Sci-Fi Film of All TIme - Mac and Me",
        "review_detailed_main": "Although the title could have been \"Big Mac and Me\" or \"Getting Coked in California\", Mac and Me is obviously the greatest sci-fi film of all time. Why might I come to that conclusion? So, I can get my kickback from Coke and/or McDonalds for giving this turkey a 10 star review. Thank God for MST 3000. This was a film made in heaven for this series. If you don't howl with laughter at this unintentional comedy, there is something seriously wrong with you. Not since El Topo has there been a film so hilarious. Any resemblance of this film to ET is purely coincidental and highly intentional. It is recommended that you have a Big Mac and supersized coke and fries with this movie. My 9 yr old son, Joseph and I were in tears by the end of the film.....tears of laughter. Please do not miss this on cable with MST 3000 as backup. It was priceless."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "burgersandsausages",
        "review_rating": "10",
        "review_title": "One of the best films of the 1980s",
        "review_detailed_main": "When a film critic refers to a film as one of the best movies of the year, they have mean a film has enough potential and drive to become THE best film. Few films of 1989 will be able to surpass the magic of Stewart Raffill's \"Mac and Me\". It is CERTAINLY the best film of the year, and possibly one of the best films of the 80's.\n\nIt tells a beguiling story of friendship, compassion, and undeniable warmth. What makes \"Mac & Me\" such a masterpiece is that it is able to (let's face it) rob a previous concept and make a bigger, bolder film out of it. This puts ET to shame.\n\nOne of the film's best sequences is also its most heartbreaking one. MAC (mysterious alien creature)is found in tears is he mourns his missing family. Moments like this are what makes movies as strong as they are today.\n\nThe first time I saw \"Mac & Me\", I expected a sappy over-sentimental film (ala The Right Stuff), but instead, I saw a blazing masterpiece of American cinema. I believe \"Mac and Me\" is charged with such velocity, that in a decade, or even two, people will look back on it as a prime example of the medium of film. What a shame that it would have taken them that long."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "HAL9000-11",
        "review_rating": "",
        "review_title": "at least there's no sequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "drfinchsince1977",
        "review_rating": "10",
        "review_title": "The greatest achievement in cinematic history",
        "review_detailed_main": "Where do I start? ET eat your heart out! It doesn't matter what kind of mood you're in, this movie will lift your spirits. It's smart, heartwarming, beautifully written, entertaining, and joyful. Mac and Me is a national treasure! You'll love it, your kids will love it! Even your dog will love it! Maybe not your cats though, those little hateful things are hard to please. The special effects are out of this world, and the story is amazing. Who knew the power of coke was so incredible? Not that coke, the soda. Although the other coke might increase your viewing pleasure. So start a fire in the fireplace, grab a blanket and some popcorn, and snuggle up to this classic. I would suggest you watch the version on MST3K though, otherwise it's unwatchable garbage."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "myftiu71",
        "review_rating": "",
        "review_title": "Why do the aliens look like disfigured sock puppets?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "tolentino_b17",
        "review_rating": "10",
        "review_title": "Mac and Me brings me the nostalgic feelings of childhood",
        "review_detailed_main": "Mac and Me,\n\nI considered it as my lifetime movie... it was more than 10 years ago when i first saw this movie and still i have in me some of the scenes i treasured... i even actually cried if i remembered right on some parts of it (specially the part when mac is looking for his family and when he was chased by a dog)... The theme song of the movie, \"Take Me, I'll Follow\" was so sentimental to me that back then... eventhough i don't know the title and the exact lyrics, i sang its melody... I just found out the title two years ago after 10 years of looking... I heard it while I and my girlfriend have our first dance in our promenade party back in high school... it was so magical and so timely that i really am so happy that night . Its nice to Bring back a part of me that was almost forgotten more than 10 years ago... Thank you Mac you made ME complete. I am looking forward to seeing you again!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "scooter1zscott",
        "review_rating": "",
        "review_title": "awful...just awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "dell62",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "For some reason the majority of people who have commented on this movie do not appear to like it but most of the derogatory comments in my opinion are not justified. All our kids loved it and our eldest daughter who is now 20 still remembers it with affection. It is definitely good entertainment and a joy to watch. There is some advertising especially in relation to coca cola which rather annoyingly the aliens seem to never be able to get enough of. But advertising, as everyone is aware, is now commonplace in movies and to a much greater extent than this one. The music score matches the emotional content of the movie and the ending scene where the aliens (now fully clothed with suits, dresses and hats) become US citizens is hilarious."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "kinskimonkey",
        "review_rating": "",
        "review_title": "Works on three distinct levels",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Sandra-durand80",
        "review_rating": "10",
        "review_title": "A very nice movie!",
        "review_detailed_main": "An underrated movie. I remember watching this movie when I was young and I enjoyed it very much. Now I have my kids watching it. They enjoyed it just as much."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "HuggyBear1",
        "review_rating": "",
        "review_title": "Hidden Meanings!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "MorbidMorgan",
        "review_rating": "10",
        "review_title": "There is still much to recommend of this quirky and at times quite touching sci-fi adventure",
        "review_detailed_main": "Personally I love the excellent ' MAC And Me ' and regard it as one of the most enjoyable family flicks of the 80's. Despite the obvious comparisons to Steven Spielberg's ' E.T. - The Extra Terrestrial ' and the much derided product placement of McDonald's and Coke, there is still much to recommend of this quirky and at times quite touching sci-fi adventure.\n\nThe plot has an alien family sucked aboard a NASA space probe on Mars and accidentally brought back to Earth. MAC ( Mysterious Alien Creature ), the mischievous alien child, is seperated from his family during the confusion of their arrival and stows away in the camper van of the Cruise family. The Cruise family are on their way to a new home in California, one which MAC singlehandedly proceeds to terrorize, his antics blamed on ten-year-old Eric. Eric conspires to prove his innocence and capture MAC. He befriends the lonely visitor and enlists the help of his teenage brother Michael ( Jonathan Ward ) and their friends Debbie ( Lauren Stanley ) and Courtney ( Tina Caspary ) to reunite him with his family whilst evading the authorities.\n\nReal life spina bifida sufferer Jade Calegory gives a wonderful performance as Eric and his friendship with MAC is rather sweet - MAC himself a wonderfully realised special effects creation, a fully mechanized robot. Director Stewart Rafill manages to inject an even balance of humour and dramatic content into the movie and the top score by Alan Silvestri underlines this.\n\nThere was a sequel intended for a summer 1989 release but negative reviews resulted in it being pulled. A pity really as it would have been nice to see MAC and his family settle into life on Earth, and as there is no ' E.T. II ' for it to have been compared with, it would have given the filmmakers a chance to prove that MAC is pretty much his own character."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "TSHunter",
        "review_rating": "",
        "review_title": "The Worst Movie of All Time!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "coolbluem",
        "review_rating": "10",
        "review_title": "Mac&Me",
        "review_detailed_main": "WOW this is one of the best film's of my child hood and its still one of my favourite one of all time something that you can watch over and over again and love it just as much as the first time, Buy it watch it and love it.\n\nSome people call Mac& Me a rip of as it was made after E.T but to me this film is much more interesting and exciting than that one hey check it out and if you like post a comment on here I'm sure yous will love this movie just as much as i have ITS BRILLIANT\n\nWATCH MAC & ME WATCH MAC & ME WATCH MAC & ME, WATCH MAC AND ME, WATHC MAC AND ME, WATCH MAC AND ME, WATCH MAC AND ME, WATCH MAC AND ME WATCH IT\n\nITS SO COOL"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "spost8260",
        "review_rating": "",
        "review_title": "Ignore the negativity of the MST3K drones!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "evilgnik",
        "review_rating": "10",
        "review_title": "Yeah it's awful but I don't care!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "jaws!",
        "review_rating": "",
        "review_title": "Im ashamed to admit it, but I like this movie just as good as E.T.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ladyimzadi",
        "review_rating": "8",
        "review_title": "Boy are people mean!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Larkin-2",
        "review_rating": "",
        "review_title": "Wonderful movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "RalfieDelites4u",
        "review_rating": "10",
        "review_title": "So odd",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "cliffordx2000",
        "review_rating": "",
        "review_title": "Yikes! An atrocity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "haysifantasy",
        "review_rating": "10",
        "review_title": "Best movie ever!",
        "review_detailed_main": "I loved this movie mac is the coolest alien ever! especially when he is dancing in the bear suit!\n\nI could watch this movie over and over again.\n\nAnyone who hasn't seen it should really watch it!\n\nEven if you don't have kids its fun to watch.\n\nSo much takes place in this movie its kinda hard to fit it all in to words!\n\nIf you haven't seen it rush to your nearest video rental place and try to find it and if they don't have it buy it online a.s.a.p.\n\nI don't know why people criticize this movie the way they do its good family fun!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "80sChild",
        "review_rating": "",
        "review_title": "A fun, feel good movie for a rainy day!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "multiscan152000",
        "review_rating": "10",
        "review_title": "Brilliant, overlooked film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "SanDiego",
        "review_rating": "",
        "review_title": "A Ronald McDonald Production",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "redgemini8219",
        "review_rating": "10",
        "review_title": "It's a GREAT kids film!",
        "review_detailed_main": "Are you kidding? This film is anything but rubbish! As a kid who hated E.T. I loved this film when I was like nine or ten! This is a great movie for little kids. I loved the fact they used a little boy in a wheel-chair, not many fun films did that in the 1980's, well one's that were aimed at kids that is. As a kid I always remember how much I wanted to find one of those little aliens under my bed. It is one of those films you can put on and let the kids watch while you go about your daily chores without them bothering you though. I bought it for my three-year-old nephew and he absolutely loved it as well! (So much so that he watches it on a daily basis.) I say go out and buy it for the kids!!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "kerrysadiamond",
        "review_rating": "",
        "review_title": "Childhood Memories",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Teek",
        "review_rating": "10",
        "review_title": "not so bad!!!",
        "review_detailed_main": "I know that I will have lots of enemies after stating my opinion, but this movie was not that bad! It was very comical, and entertaining, for those who can appreciate a low budget movie. I have watched this movie many times, and have enjoyed the dance scene in McDonalds. Don't get me wrong, I do not have brain damage, I just thought that the movie was different, and people were too hard on it. I own the movie, and my friends are threatening to burn it, but I am willing to fight for the protection of Mac & ME!!!!!!!!!!! It really wasn't THAT bad!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Warlock-5",
        "review_rating": "",
        "review_title": "A bunch of unknown people starring in.....\"Product Placement!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "saint_brett",
        "review_rating": "8",
        "review_title": "Decent Horror Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Baerwb",
        "review_rating": "",
        "review_title": "One of my favorite movies as a child...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "tomdoh345",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "Mac and Me is a great movie for kids, and they love it. I watched it with my kids when it was released on video rental and we all loved it. I rewatch it every now and then and enjoy it every time I see it. I do not understand all this negativity that some people seem to have for this exceptional movie. I wish there had been a sequel ! BTW I liked this move way more than ET ( and Fisher-Price toys can not be made into a radio in this or any other parallel universe )."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "IonicBreezeMachine",
        "review_rating": "",
        "review_title": "A brazen rip-off of E. T. that's as shameless as it is hypnotically fascinating",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "sarahlilyjenner",
        "review_rating": "10",
        "review_title": "My favorite childhood movie❤",
        "review_detailed_main": "I've been loving this movie since I was a little girl, I never get enough of it, I was liking the way they showed aliens as a family and not something to scary of."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "David, Film Freak",
        "review_rating": "",
        "review_title": "ET Rip-off?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "bryonyjs-66736",
        "review_rating": "10",
        "review_title": "It's a 10 from me",
        "review_detailed_main": "Call me crazy but I absolutely love this film and even more so as a kid. The soundtrack is insane!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "wynbrks",
        "review_rating": "",
        "review_title": "ReLiving Through The Kids",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "elwoodjames",
        "review_rating": "9",
        "review_title": "Come on..... its 20 years old",
        "review_detailed_main": "Whilst i appreciate the negative comments this film gets and to be honest it looks pretty naff now adays, But i remember watching this when i was younger and i loved it.... I watched this more than i ever watched ET.\n\nSame as my little 4 year old loves it now... I guess its just one of those films that require a level of imagination that only kids have....\n\nGive this film a break... Let your kids watch it and let them decide on your votes....\n\nAs my little one loves it so much he decided it deserves 9 out of 10...\n\nCome on lets get that score up a bit"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "ashbro13",
        "review_rating": "",
        "review_title": "Disappointed about having no sequel!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "Loving and heart-warming...",
        "review_detailed_main": "You gotta love \"Mac and Me.\" I mean, the title sounds so nice, and this whole child vs. alien thing is totally 80s, and very much so, too!!!!! If you want to sit on down to a fun-loving, excellent, beautiful, nerdy, happy, nice type of family film from that period of time known as the 80s, then watch this movie. It's like watching \"E.T. The Extra-Terrestrial,\" only better. Actually, I think both movies are good. Very good. Much better than that sorry excuse from Spain called \"Los Nuevos Extraterrestries\" (spelling uncertain)! \"E.T.\" and \"Mac and Me\" - a perfect combo - good movies either way - you can never, I repeat, never go wrong!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "NoArrow",
        "review_rating": "",
        "review_title": "One of the worst things that was spawned by the eighties...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "genocideofall",
        "review_rating": "10",
        "review_title": "BETTER THAN E.T!!!",
        "review_detailed_main": "I dont know what the fuss is all about with this movie, this is amazing!!! It way better than e.t the characters are funny and charming and mac is so much better than e.t will ever be. Definitely give this movie another shot because this is truly a masterpiece of movie history."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "single_in_in",
        "review_rating": "10",
        "review_title": "I dont get the hate",
        "review_detailed_main": "Everyones been programmed to think only Spielberg can make good movies. FYI ET was supposed to be a horror film. Then it got downgraded. This film it more entertaining by a long shot. The Alien does way more than stay inside a house for 2 hours. Again its much better. Plus loads of people have admit to ET scaring them to death . Whete as I have never heared that once fr this movie."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "elisereid-29666",
        "review_rating": "8",
        "review_title": "Underneath the cheese is a good movie",
        "review_detailed_main": "Yes, it's corny. Yes, the product placement is blatant as hell. Yes, it was probably made to capitalize on E.T., which is totally cynical.\n\nHowever...\n\nThere is a part of me that wants to defend this movie because unlike most movies about disabled kids, this one refuses to push an ableist narrative about his disability. The hero of this film is a kid in a wheelchair, but the plot doesn't really revolve around this aspect of him, nor does it end with the sickening idea that the only reason to feature a disabled character is so he can get up and walk again and be \"like normal people\" eventually. In this regard, Mac and Me was 30 years ahead of its time.\n\nThis is all of course to say nothing of the message this movie sends to non-disabled kids-which is simply that disability changes nothing about your character. And that's *such* a good, important message to send.\n\nAlso, I could see myself as a kid enjoying this movie in spite of its flaws (even though I first saw it as a teenager, and then only because I was a bad movie buff and had heard how awful it was). It's nowhere near the level of E.T., but it manages to be kind of fun and silly in its own way. And who says a movie has to be a deep, meaningful experience? What's wrong with escapism for its own sake? And if an escapist movie can send a good message about disability along the way, all the better."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "CriticsVoiceVideo",
        "review_rating": "8",
        "review_title": "Better than E.T. Yes, I said it.",
        "review_detailed_main": "I'm still waiting for the sequel to drop! Way more fun with a beautiful film score by Alan Silvestri and a kickin' 80s pop soundtrack. It's silly fun. \"E.T.\" takes itself waaaay too seriously and is just less entertaining for me."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "adamdustin6",
        "review_rating": "10",
        "review_title": "The Best Kind of Bad",
        "review_detailed_main": "Yes, the movie is a horribly shameless E.T. ripoff sponsored by Ronald McDonald, but viewing it with your friends while drunk is one of the great movie watching experiences."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "akira_1977",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "tfoote01",
        "review_rating": "10",
        "review_title": "Still waiting for the sequel!",
        "review_detailed_main": "This movie is a masterpiece! It had a 13 million budget, surprisingly more than the movie it tried to ripoff.\n\nThis is a horrifically BAD movie! So bad it is amazing to watch! Ugh The 'aliens' are grotesque and wander into the desert!! MAN Smoke a lotta weed and watch this!! It's sooo good."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "js1801",
        "review_rating": "9",
        "review_title": "Better than E.T.",
        "review_detailed_main": "This film has often been compared to E.T. Yes, it is like E.T. but better than E.T. When I watched this film when I was a kid, I thought it was better than E.T. Now that I am an adult, I still believe it is better than E.T."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "anandh-47513",
        "review_rating": "9",
        "review_title": "Nice Film",
        "review_detailed_main": "Nice Plot, Musical score Fantastic, Worth Watching..."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "Jack-Wareing-Films",
        "review_rating": "8",
        "review_title": "Charming!",
        "review_detailed_main": "IMHO Mac and Me is far superior to E.T. I can understand the obvious comparisons, but I just really loved Mac's interaction with his Mom and Dad, ALSO how their whistling communication could express the emotions they were feeling at a given time. I know I am in the minority about this, but I like the movie a lot."
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "fire-child",
        "review_rating": "9",
        "review_title": "The Citizen Kane of 'so bad, it's good'",
        "review_detailed_main": "I avoided this for decades, but finally watched it to see if it had the curious cult status it warrants.\n\nOh man, I wish I had watched this earlier! It is, as other reviewers have said, utter tripe on the one hand - an utterly shameless, ET envying, bargain basement monstrosity, that only young children will look at with any wonder.\n\nI also genuinely feel sorry, for any and all the established actors whose careers were probably finished by it, when just in need of a paycheck. The child disabled actor in particular deserved far better for his career. You can see he puts his heart and soul into trying to make this pile of singing excrement have some feeling.\n\nNow, onto why on earth then it gets 9/10 from me...? Well, on the other hand: it also weirdly succeeds as the most surrealist, dark and bizarre comedy I've seen in many, many years. Although you may want to watch ET before you ever watch this: it'll make it 50 times as funny if you do.\n\nI had huge belly laughs as a 40 something man watching this: more than I have had in a long time. I'll just say vaguely to avoid spoilers: a particular wheelchair journey in nature; the vacuum cleaner; and an end courthouse scene to state a few - had me in absolute stitches. Stand up comics could not do this better, people.\n\nYou have to see this at least once, as an adult. Preferably id recommend as part of an adult frat and sorority party, with just enough drinkable and smokeables alongside (legal, of course :). It would make for an unforgettable college bonding, trust me. Kind of like watching Teletubbies did in the same manner at one point back in the 90s, in the same way - only far better.\n\nTo sum up: this was, in a way, the last of the film times in the 80s, before CGI and huge scale tent pole filmmaking from the 90s onward made even most knockoffs look ok. It's part of surrealist, unintentional campy comedy gold.\n\nDo not deprive yourself, anybody reading, and just see it. But do this as a social with buddies. If you have a funny bone in you, you'll laugh till you wet yourselves!"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "elainabeckmedia",
        "review_rating": "8",
        "review_title": "Disability Rep in the 80s??",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "smartytart2002",
        "review_rating": "10",
        "review_title": "Mac & me brought me back childhood memories",
        "review_detailed_main": "I remember when I saw that movie in elementary school & I thought Mac is so adorable & It's a good family film about a boy in a wheelchair helping the little alien to find his family.Even though it got very bad reviews & It's a rip-off of E.T.,I don't care & I love Mac & me,it's a gr8 cult classic that got Mac in a bear costume doing a dance number @ a party @ McDonald's,Mac driving a toy car while being chased by the neighborhood dogs & it was very touching that Mac reunited with his family.I would be watching that movie when it's on YouTube or that I'll be getting the DVD over & over again when I feel like it & The ending have really touched my heart when Mac and his family use their powers to bring the boy back from the dead & they became citizens in the U.S.,when mac blew a bubble from the gum that said \"we'll be back\",I don't think there's a sequel coming but,I wish they'll be 1 so I can see it"
    },
    {
        "movie_id": "tt0095560",
        "movie_name": "Mac and Me",
        "movie_rating": "3.4",
        "review_username": "rsabol-13799",
        "review_rating": "10",
        "review_title": "This movie was a masterpiece",
        "review_detailed_main": ""
    }
]