[
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "KIng-SIngH",
        "review_rating": "9",
        "review_title": "Plain Excellent",
        "review_detailed_main": "This movie is just the best movie i have seen. (I have watched around 570 movies) (Its my favorite movie).It has all the elements that a good movie must have:\n\nExcellent Dialogues.\n\nExcellent Music.\n\nExcellent Acting. (Even the extra's where excellent)\n\nExcellent Story/Plot.\n\nGood Songs.\n\nAnd it has much genres, who are handled very well in this movie: Action/Comedy/Romance/Drama/Adventure/Thriller (not really, but a kind of Thriller)/Musical/Crime. Each word of this movie is excellent. I think it has the greatest story ever! I was hurted when i came to know that Mr. Ram Gopal Varma is remaking this classic... Despite becoming the most successful film of its time, it failed to win any major popular or critics awards. The lone Filmfare award it got went to M.S. Shinde for Best editing. The plot is about a retired police officer Thakur (Sanjeev Kumar) who hires two convicts Veeru and Jai (Dharmendra and Amitabh Bachchan) to capture Gabbar Singh (a Dacoit) who had killed the cop's entire family (except the cop and his daughter-in-law).\n\nWho has not seen this movie, try it once, you will love it. *****"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "ahsen",
        "review_rating": "9",
        "review_title": "Great Movie... Everyone should have seen this movie at least one time !",
        "review_detailed_main": "Great Movie... Everyone should have seen this movie at least one time ! I bought this movie on DVD now, although I am not a big fan of elder films... i love this film, and especially the dialogs of GB ! For all Amitabh fans its a must have movie ! The whole story is really good and the movie has a flair of an American western. Even the sound of Sholay and the atmosphere which is given to the watcher are one of the best i have seen in Bollywood. I have heard, there will be a remake of this film, but I think it could not be as good as the original Sholay. All because of the actors like Amjad Khan who was born for this role. This film is one of bollywood's best movies ever."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Xstal",
        "review_rating": "8",
        "review_title": "The Magnificent Two Samurai...",
        "review_detailed_main": "Epic in all proportions, a thoroughly entertaining wild east cowboyesque film fizzing with vengeance, violence and, for the time, visionary film making and performances. There's a reason some films embrace longevity and not just through their duration, if you fancy a wild, fierce, ferocious and untamed piece of excitement then set aside an hour or three and a half, charge your beaker to the rim with stimulants and embrace a unique and original take on an often visited theme that wont leave you disappointed."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Fella_shibby",
        "review_rating": "10",
        "review_title": "Awesome movie. My all time fave. The best villain in the history of bollywood.",
        "review_detailed_main": "This movie is just one of the best Hindi movie i have seen. Its one of my favorite film. It has all the elements that a good Hindi movie must have. The settings of the hilly mountainous village, the dusty n tough terrain, the train sequence n the villain Gabbar played menacingly by Amjad Khan, were all awesome. Such is the impact of the villains acting is that u always remember him by his character's name frm the movie. One of the movies you remember for life. Amitabh Bachan and Dharmendra were awesome too. The character of Hema malini was cheesy n unbelieavable though. A woman riding a horse chariot that too in the cow belt area wher rape is rampant. Nevertheles the film is solid entertainment. It is a story of friendship, courage and revenge, based loosely around the concepts of Akira Kurosawa's Seven Samurai & The Magnificent Seven with shades of Once uopn a time in the west. A true cinematic masterpiece."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "moviesenthil",
        "review_rating": "",
        "review_title": "No arguments.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "hprill",
        "review_rating": "10",
        "review_title": "Brilliant",
        "review_detailed_main": "If you liked \"Once upon a time in the west\", \"The magnificent seven\" and \"A fistful of dollars\", you will love \"Sholay\". It takes all the good ingredients of a western, spices it with a lot of Indian ingredients and lets it simmer until you get one of the finest \"curry\" westerns imaginable. Though obviously very much inspired by the \"spaghetti\" westerns of the late 1960s/early 1970s, this easily surpasses most of the films it's modeled after. A masterpiece."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "emptor",
        "review_rating": "10",
        "review_title": "Perfect Movie",
        "review_detailed_main": "Can't find a single flaw in the movie. Probably one of the best ever made in Hindi. The camera work is flawless and grips you. The acting is inspired. The music is memorable. One of the movies you remember for life."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "breakdowndawalls",
        "review_rating": "10",
        "review_title": "The Definitive Masterpiece...",
        "review_detailed_main": "As a strong fan of the American Western genre and of course the directing of Sergio Leone, it is with great enthusiasm that i recommend Sholay to any audiences or fans of Westerns and Bollywood cinema.\n\nPerhaps, the greatest film in the history of Bollywood cinema (with one of the longest theatrical runs in Bollywood history), this is the definitive Bollywood action epic movie in the same way that Leone's 'The Good, The Bad & The Ugly' was the definitive Western.\n\nThe film features the acting talents of such Bollywood legends...Amitabh Bachan and Dharmendra and focuses at its heart, a story of friendship, courage and revenge, based loosely around the concepts of Akira Kurosawa's Seven Samurai & The Magnificent Seven.\n\nIf you have not watched it, then make it your priority to watch it at least once in your life, as this is definitely one of the movies that every person needs to experience.\n\nA true cinematic masterpiece."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sauravjoshi85",
        "review_rating": "10",
        "review_title": "SHOLAY the pride of Indian Cinema",
        "review_detailed_main": "Sholay is an action movie directed by Ramesh Sippy and stars Dharmendra, Late Sanjeev Kumar, Hema Malini, Amitabh Bachchan, Jaya Bachchan, Late Amjad Khan, Late Satyen Kappu, Late A.K. Hangal and Late Mac Mohan. Asrani, Late Keshto Mukherjee, Late Viju Khote, Late Leela Mishra, Late Iftekhar, Late Jalal Agha and Helen were in supporting but pivotal roles.\n\nBefore going down kindly be informed that this is not a review. It's a feeling expressed by a fan. I am in no capacity to review this masterpiece.\n\nThe movie itself is a brand and still carries the same charm when it was released. The movie has lots of stories and trivia behind it such as casting of Amjad Khan in place of Danny. Slow pace of the movie in the initial week of it's release and so on and I think every movie buff must have read, heard or read about it.\n\nThe movie is known for the best execution of a predictable plot with a seasoning of comedy and emotion. All most all the characters of the movie is a legend in fact the side characters are also immortal now be it 'Mausi', 'Angrezo ke zamane ke jailer', 'Soorma Bhopali', 'Kalia'or 'Sambha'.\n\nProbably this is the only movie who might have given birth to lots of parodies and those parodies are still in making.\n\nThe mesmerising songs which suits every occasion such as beautiful 'Holi' song, the song representing the eternal bond of friendship or to please your love interest, and yes the dialogues which we all would have copied in all the funnier situations like 'Itna sannata kyun hai bhai', 'kitne aadmi the' and so on\n\nWith immortal characters and dialogues Sholay is a classic which can't be created and in fact will never be created."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "nadkarnisumeet",
        "review_rating": "10",
        "review_title": "Sholay is immortal.",
        "review_detailed_main": "Sholay review :\n\n15th August 1975. The day Ramesh Sippy's magnum opus Sholay released at the Minerva cinema, Mumbai.\n\nUndoubtedly, this film doesn't need a review. We all know Sholay and we all love Sholay. It is a benchmark in Indian cinema and each one of us has his own story to tell about the classic. From seeing it more than 50 times to purchasing ticket in black for an obscene amount or memorising every dialogue, personal stories around the legendary film abound.\n\nI first experienced the Sholay phenomenon in the year 1985 during Diwali time when I visited my paternal grandparents place at Mahim. The society had hired a huge screen and projector to film it in its premise. The euphoria at the time of screening with loud ceetes and people mouthing dialogues along with the characters and dancing during the songs is a moment I will never forget ever.\n\nI have seen the movie multiple times later on VHS (during video cassette era) and on DVD. It is a regular on satellite channels also where I still catch it whenever possible.\n\nRecently in 2014, the film re-released in 3D format and I took my family to watch it. That was actually my first theatrical viewing of Sholay. I have preserved its ticket stub to show my future generation that I was amongst that lucky generation which got to see Sholay in theatres.\n\nOne unfulfilled wish in my life is not able to watch Sholay at the iconic Minerva cinema in Mumbai where it ran continuously for 5 years from 1975 to 1980. The film enjoyed multiple re-runs in this iconic theatre right till 2004.\n\nInfact, I had almost made it when Sholay re- released at the Minerva in 2004. The theatre was playing Sholay in matinee and 'Kyun Ho Gaya Na' for regular 3 shows. When I reached the theatre for the matinee show, it was housefull and I didnt get the tickets for Sholay (The black ticket rates were too exorbitant for me). Surprisingly, a new release like 'Kyun Ho Gaya Na' was playing to empty seats while Sholay was sold out for the entire week. I returned home disappointed. Will always envy those fortunate who watched Sholay at Minerva!\n\nMovies will come and go....but Sholay is immortal.\n\nRegards, Sumeet Nadkarni"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "melis-rik",
        "review_rating": "7",
        "review_title": "One of the best Indian movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Peter_Young",
        "review_rating": "8",
        "review_title": "A rare Hindi film of the times",
        "review_detailed_main": "I think Sholay is a great Hindi film of its times, although with the amount of praise and superlatives it has been getting throughout the years, I must admit it's a little overrated. The film was indeed ahead of its time in many ways. First, the action was really good - there were some glitches here and there, but it was far more credible than what the times had set the public for. Secondly, the attention to detail, as expected from Ramesh Sippy, is first-rate. Sippy, a great director whose combination of professional, technically skilled direction, impressive storytelling, and the delicate yet honest depiction of his stories, produced several classic Hindi pictures. Sholay is a good product although sadly it mixes too many genres and is overlong for the story it tells. It could have easily edited out some parts. Given the extraordinary brutality of the villainous characters and the situations, as well as the marked contrast between the good and the evil, I think the comedic parts (except for those of Basanti) were grossly redundant, among others, as they dragged the narrative and undermined its consistency as well as the minimalist approach that was so successfully employed by Sippy in some key scenes.\n\nSet in a rural, remote region in southern India, the film is beautifully shot, and Sippy manages to capture the essence of the village and its people. One wonderful scene shows the routine of the village and the different activities of its inhabitants in the morning, a rare glimpse into the cultural weight of the place, which few directors would bother to tap into. This is where our heroes and villains are thrown, in an interesting story which benefits from Sippy's unique direction. The realism with which some of the situations are portrayed is striking, and it is matched by a careful handling of the proceedings in ways the Indian moviegoing public, which was used to being spoonfed by Hindi filmmakers, had not been accustomed to. Note for one the way the romance between Veeru and Radha is portrayed. Just watch the scene in which Jai is playing his harmonica as Radha is walking around and turning off the Kerosene lamps. Such subtlety is rarely seen in Hindi films. This is not to say that the film is devoid of any sentimentality. Still, the overall thing is really good - the film is both entertaining and then it is also quite moving and heartbreaking in some hard-hitting scenes, not to mention the famous, harrowing parts.\n\nThe film's authenticity is achieved in large parts through the acting, particularly the grounded, authentic performances of the main characters. Sholay is in my view Sanjeev Kumar's story as it is his character's determination that carries the narrative forward. He is tremendous. Dharmendra plays the energetic and happy-go-lucky Veeru pretty well, but Bachchan is fantastic in a subdued, quiet performance as Jai. Hema Malini is wonderful as the iconic, highly talkative and kind-hearted village belle Basanti; her comic timing is top-notch, and her dance numbers are never less than fabulous. Out of the two couple, it is Jaya Bhaduri of course who can always be trusted to do so much by doing so little. Her quietly understated performance is one of the film's assets, the other one being Amjad Khan's phenomenal turn as one of the greatest screen villains of Hindi cinema. Sholay is greatly aided by the great background score which enhances some of the most difficult scenes and helps alleviate others. R. D. Burman's soundtrack is as memorable as the film. Sholay is definitely a classic in many ways. It is not flawless, nor do I think it matters. In many ways it is a landmark film, and I'm sure non-Indians might enjoy it just as much."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "kramachandran",
        "review_rating": "7",
        "review_title": "Movie well made",
        "review_detailed_main": "This movie needs no introduction. This stands as the largest all-time grosser of Bollywood. Considering the fact that in that same year 1975 , there were several other movies that became hits later on and this movie faced a lot of competition from these movies. This is a 'multi-starrer', a trend in those days.\n\nMany dialogs in this movie became very popular in every home in India and this movie itself became a household word. Every major star in this movie has done an excellent job. The direction is very good , the photography flawless. The background music score is very apt, though it resembles the spaghetti western score.\n\nBut in my opinion this movie only deserves 7 stars for the mere fact that this movie is a plagiarized though Indianized version of The Kurosawa's Japanese classic \" The Seven Samurai\". The above is a well known fact but what is little known is the trivia that this movie also borrowed a lot of its powerful ingredients from the Gary Cooper's classic \"High Noon\". Another tit bit is that the movie \"Mera Gaon Mera Desh\" that was released a few years before was another inspiration for this movie Sholay. Though the movie \"Mera Gaon Mera Desh\" has taken after \"High Noon\" to a greater degree. Also, many scenes in this movie are influenced by the spaghetti western style of movie making.\n\nBut all said and done a great movie and as they say it in Hindi \"Paisa Vasool\".. certainly worth watching at least once."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "omvimi",
        "review_rating": "1",
        "review_title": "This movie is not a masterpiece",
        "review_detailed_main": "Often overrated or seen-too-much by so-called \"film critics\" and 'bollywood' viewers, THIS MOVIE IS NOT A MASTERPIECE!!! why? first of all Darmendra overacts in most parts of the film. I have seen many scenes of this film taken from 'The good, the bad and the ugly' in 1966. When they can't do anything original, don't even copy then!! what they do is add some few songs to the film to make it longer, add an actress or dancer who will dance and entertain the bollywood viewers who become greatly impressed by the copied actions and scenes in the film. Bollywood viewers need to watch more and more variety films to know what is really going on here and not just clapping their hands to something that is not worth so much reputation and glamour. The director and producer of this film boast so much about something they have copied and even get great awards for this plagiarism. To whom should the credit really go? WATCH THE FILM I HAVE MENTIONED ABOVE FOR FURTHER DETAILS YOU WILL EXPERIENCE YOURSELVES."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "kokje",
        "review_rating": "",
        "review_title": "one of the greatest Hindi ever made !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "asksahil",
        "review_rating": "10",
        "review_title": "SHOLAY..........the name says it all(BEST Hindi MOVIE EVER)",
        "review_detailed_main": "I am shocked seeing that the IMDb ratings for this classic is just 6.6. Why? Because the movie is strongly influenced from the Westerns? or It it isn't entertaining enough?\n\nThe 2nd cant be true because the movie had everything: strong script strong direction excellent characters and performances good action,comedy,romance,friendship,etc\n\nIf the 1st is true then i feel sorry for the viewers because being influenced is not being copied.Besides there would remain only like 50-60 original scripts if counted correctly.\n\nI cannot find a single flaw in the movie which is my personal thinking and as it would be of true Hindi cinema fans.\n\nSo people please judge the movie on its merits and not on something which is totally baseless.\n\nRATING:- *****/*****"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "anant_mathur",
        "review_rating": "10",
        "review_title": "The Greatest Story Ever Told!",
        "review_detailed_main": "\"Kitne Aadmi Thei\", every Indian film fan knows this dialog by heart. Sholay was released in 1975, also the year I was born in, coincidence, perhaps. The film became the longest running Indian film in the theaters, a record that stood for over 25 years until it was broken recently by another classic \"Dilwale Dulhania Le Jayenge\" (holds the current record 500 Weeks and still going - as on May 07, 2005).\n\nSholay was written by the great Duo of Javed Akhtar and Salim Khan know as Salim-Javed. The duo also gave us films like Don, Shakti, Shaan, Zanjeer, Seeta Aur Geeta and Deewar. The film was directed by Ramesh Sippy and had music of legendary R.D. Burman. Sholay gave us a Character called \"Gabbar Singh\" played by Amjad Khan, who made his debut with this film. The character of Gabbar Singh is so creative that many film makers have tried to imitate him for their films.\n\nSholay did for Indian Cinema what Casablanca did for Hollywood. It became an instant classic and broke all the rules of film making and characterization, while preserving the values of Indian cinema.\n\nSholay just won the Filmfare Award (2005) for being the Best Film in the last 50 years of Indian Cinema. Sadly, when Sholay was first released in 1975 it didn't win any major Filmfare awards. But when you think about all the great films that were released in that year, its easy to see how it may have been over looked. 1975 may have been the best year for Hindi films with the likes of Deewar, Chupke Chupke, Hera Pheri, Khel Khel Mein, Julie, Mausam, Ponga Pandit, Rafoo Chakkar, Uljhan, Dharmatma, Do Jasoos, Faraar, Geet Gaata Chal, Chhoti Si Baat, Aandhi and Milli - all releasing along with Sholay.\n\nSholay had the biggest star cast of its time with the likes of Dharmendra, Hema Malini, Amitabh Bachchan, Jaya Bhaduri, Sanjeev Kumar, Sachin, A.K. Hangal, Leela Mishra, Satyen Kappu, Mac Mohan, Jagdeep, Asrani, Helen, Jalal Agha, Iftekhar, Keshto Mukherjee and of course Amjad Khan. The Greatest Cast Ever Assembled for the Greatest Story Ever Told!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "lastliberal",
        "review_rating": "8",
        "review_title": "Once Upon a Time in Bangalore.",
        "review_detailed_main": "The Indian filmmaker G.P. Sippy died last December at the age of 93. his son Ramesh directed this film, which remains the most famous Hindi-language movie and the biggest commercial success for Bollywood. If you want to watch one Bollywood film in his honor, this is it.\n\nThis epic has everything. It has a magnificent Seven type story, but there are only two who come to save the village. They are thieves hired by a former policeman to capture the bandit leader.\n\nIt is a spaghetti-western of sorts as there are plenty of horses, and shooting, and fights.\n\nIt is a lavish musical with amazing color and costumes as the villagers really put on a show for their simple festival of colors.\n\nIt has comedy, slapstick, romance (but NO kissing!), music, a little horror, almost continuous action, tragedy, and triumph. Like, I said, if you only see one Sippy production, this should be it."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Everybody knows this is the Best Bollywood film ever made",
        "review_detailed_main": "Everybody knows this is the Best Bollywood film ever made. I am surprised that this films rating in IMDb is not 10 /10 that it deserves. If you ask any Bollywood genius about this movie, they will tell you its the Best film of all time. Its no. 1 in the top 100 Best Bollywood Movies Stardust magazine. This movie had all the elements to make a great movie. Great Acting, Great Dialouges, Great music, Violence, comedy, Romance, Emotions and Relationships (Friendship). It stars Bollywood's Greatest ever actor Amitabh Bchchan in a Powerhouse performance. Dharmendra in his Best film that I've seen. Hema Malini is fantastic as the in famous fast talking Basanti. Jaya Bachchan is superb as the quiet widow. Amjad Khan steals the show as the legendary famous Villain Gabbar Singh. The other cast have done a decent job. This is the Greates Film Bollywood have released. Fullstop."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rajesh-51591",
        "review_rating": "10",
        "review_title": "Biggest Blockbuster movie.",
        "review_detailed_main": "No1 Movie af all time in India. The character of each and every one is fabulous and mind-blowing."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "IPyaarCinema",
        "review_rating": "10",
        "review_title": "Cult Classic",
        "review_detailed_main": "Review By Kamal K\n\nSholay is one of the best Indian film ever made. Every cast fits the role to perfection be it Amitabh Bacchan as Jai or Dharmendra as Virru or Asrani as the hilarious cop or..... The list is never ending. A movie worth watching 100 times with some great music stuff from R. D. Burman. Action Scenes are the best ever made in Indian History. The climax was wonderful. The late legendary actor Amjad Khan as notorious Dacoit Gabbar Singh is Phenomenal, Menacing and Excellent. Hema Malini and Jaya Bacchan acted really very well. Sanjeev Kumar as Thakur Baldev Singh was the second reason for the film'es stupendous success. Asrani and Jagdeep were really humourous. Their jokes are remembered until today. R. D. Burman gives great music to the film. This is the greatest movie ever made."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "h_thakor",
        "review_rating": "7",
        "review_title": "Assessment of film",
        "review_detailed_main": "TIt is a landmark film being the first ever 7o m.m film.made in India.Adapting a Western film theme to Indian Conditions is a remarkable achievement and the gun -weilding action scenes remind One of the Sergi Leone Spaghetti Westerns like 'A Few Dollars More\".The Cinematography is classical.\n\nWhat demarcates this film from an average one is the classical direction. The way scenes showing the Thakur's arms being amputated by Gabbar,the Thakur's grandson being shot by Gabbar and Ahmed ,the village boy being tortured to death are effectively cut reveal this aspect.The way Gabbbar Singh is introduced is classical where he is shown walking on the rocks revealing only his legs .However there are contradictory aspects in the film's script like a Thakur defending the lives of the village peasants(Traditionally Thakurs were landlords who terrorised the peasants)and 2 urban based gangsters wishing to settle down in a village.\n\nSholay falls marginally short of a classic like Mughal -E-Azam.It does not relate to Social reality as films like \"Mother India'or Do Bhiga Zameen' nor has the philosophical depth of films like 'Pyaasa' or 'Mera Naam Joker'.\n\nThat does not deny that it is the best film of it's type ever made in India and it's impact on the Indian psyche has been unparalleled in the history of Indian Cinema.The acting of Amjad Khan and Sanjeev Kumar are displays of true genius.\n\nThere is also a moral aspect to the film unlike the Italian Spaggheti westerns of the 1960's.\n\nBy Harsh Thakor"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "hypergurlgowri89",
        "review_rating": "10",
        "review_title": "A very enjoyable movie",
        "review_detailed_main": "I didn't think much of Sholay till I actually saw it. I can understand why it's so famous.\n\nFirst of all...the acting! Ah! Just wonderful.\n\nDharmendra plays the hero, who is basically comical...even while he's getting arrested. I mean, his jokes are just hilarious! And those funny faces he makes! I couldn't stop laughing!\n\nThen there's his best friend, who is played by Amitabh. Though Amitabh is not as goofy as his friend, he is funny. He makes all sarcastic comments and you can see why he shot into superstardom with his performance.\n\nThough I never thought Hema Malini was a good actress...trust me, in this movie she is sooooo funny. The girl just can't stop talking! The scenes with Dharmendra and her are really funny.\n\nThen of course there's Jaya Bhaduri, who is more of the depressed type, and her and Amitabh fall in love just by sharing glances, it's awfully cute. Her gloomy look is very effective.\n\nLet's not forget Sanjeev Kumar, a good strong performance. He makes a dark voice that really adds effect on his character. At first he seems heartless, but later you realize that he does really care.\n\nThe only performance that was not so good was Amjad Khan's, though many liked it. His stupid accent was not very enjoyable and it seemed like he was trying to get bhojpuri into his dialect when he shouldn't have been.\n\nSo there are cons in this movie...the violence is not very good. I mean, I enjoy fist fights, but there's only one in this movie and the rest in like gun shots...which I think is boring. The music could've been much better. The only good songs are \"Haan Jab Tak\" and the other one that's okay was \"Holi Ke Din\". I think if Ramesh Sippy had taken someone like Laxmikant Pyarelal, the music would've been much much better.\n\nThe beginning is really funny, Asrani as the overacting jailor is hilarious. The movie is very touching at the end though, very sad I'll have to say. Even though I'm telling you all the cons in the movie, I'm not saying that you shouldn't watch it...because you should! After watching this movie Dharmendra and Amitabh have become my favorite actors. It's a great movie, even though I have some stuff against it, because of the comedy and performances...I'll have to give it a ten out of ten."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "calspers",
        "review_rating": "6",
        "review_title": "Decent but flawed western-inspired Bollywood film",
        "review_detailed_main": "\"Sholay\" directed by Ramesh Sippy is a western-action film from India and regarded as one of the most essential films to have come out the Bollywood industry. The film revolves around a police officer whose family is murdered by a gangster, who then hires some hitmen to avenge the gangster.\n\nI was not impressed with the film. It had a decent script by Salim-Javed, but overall mediocre performances around the entire cast, except for the convincing Sanjeev Kumar's potrayal of Thakur Baldev Singh.\n\n\"Sholay\" was clearly amibitious for 1975, but has major staging problems in executing its action sequences, resulting in a range of horrible stunt scenes. On top of that, I thought it was marked by sloppy direction, in that the quite simple plot was layed out in approximately three and a half hours. In spite of the obvious shortcomings of being a great film, I thought it had several qualities.\n\nFor one thing, it had a believable antagonist - Gabbar, and in particular protagonist, Thakur. Apart from this, a big quality to the film is its cinematography - the DP utilizes nice pans and wide-shots, as well as interesting close-ups, clearly inspired by the cinematographic style of Sergio Leone. Also, I found the score to be quite nice in certain parts.\n\nI had a reasonable amount of fun watching it, but to me, it was at least one hour too long. I can appreciate that \"Sholay\" is surrounded by nostalgia to domestic Indian audiences, but I was not impressed in spite of its reverred status as a masterpiece. Perhaps though, it is just that by Bollywood standards."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "slazenger_7",
        "review_rating": "3",
        "review_title": "Most Overrated Hindi Film Ever: Pure Plagiarism!",
        "review_detailed_main": "Before adding my own review of this widely acknowledged iconic film of Hindi cinema, I went through several of the reviews of this film. Majority of the reviewers appear to have been born just before or just after this film was first released in August 1975. In other words, they didn't experience it firsthand at theaters and were probably already preconditioned with all the incredible hype surrounding this film. I remember its original release at Minerva Theater in Bombay very well. I have seen this film in both its endings: The one in which the Gabbar Singh character gets killed by Thakur and the alternative ending where Thakur just stops short of killing Hari \"Gabbar\" Singh at the behest of the police. Salim Khan (father of actor Salman Khan) and Javed Akhtar wrote one of the most memorable dialogues for a Hindi film character in Gabbar Singh. However, this film's key storyline is nothing but a rip off of several classic Westerns: Both from Sergio Leone and from John Sturges' remake of Akira Kurosawa's SEVEN SAMURAI. Gabbar's killing of Thakur's family is nothing but a rip off of Henry Fonda's \"Frank\" who kills off the McBain family (including McBain's little boy) in Leone's ONCE UPON A TIME IN THE WEST. Amjad Khan (son of veteran Hindi film villain Jayant) owns this film. Without his interpretation of Gabbar Singh, this film would not be worth watching. With that being said, his interpretation of Gabbar is also a rip off of the great Italian actor Gian Maria Volonte's \"Indio\" from Leone's FOR A FEW DOLLARS MORE. The base theme of SHOLAY is a Hindi reworking of SEVEN SAMURAI / THE MAGNIFICENT SEVEN. The vast majority of the Hindi film audience who praised SHOLAY to no end were not aware that its key points were plagiarized from the classic Italian and Hollywood Westerns. There were also some really silly scenes: Dharmendra's ridiculous mock \"suicide\"; the very annoying Basanti character of Hema Malini; etc. Aside from Gabbar Singh, the only interesting characters were that of Thakur (portrayed by Sanjeev Kumar) and Thakur's widowed daughter-in-law (portrayed by Jaya Bhaduri). Film director Ramesh Sippy ought to be ashamed of his plagiarism of the classic Westerns he ripped off and never openly credited. Aside from the key action scenes, SHOLAY really drags. SHOLAY is hardly a true \"Hindi\" film in the tradition of Golden Age classics of Hindi cinema which were truly Indian subjects (e.g., Roti-1942; Do Bigha Zamin; Pyaasa; Sahib, Bibi, aur Ghulam; Mughal-E-Azam; Pakeezah; etc.). SHOLAY is one of those movies which can be truly be labeled \"Bollywood\"...AKA when (way too often) Hindi cinema rips off Hollywood. Having seen SHOLAY in its 2nd week of release back in late August 1975 at Minerva Theater and a couple of times since, I can only state that SHOLAY is the most overrated Hindi film ever."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "vitalstatistix",
        "review_rating": "",
        "review_title": "Superb!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "namashi_1",
        "review_rating": "10",
        "review_title": "A True Masterpiece!",
        "review_detailed_main": "Ramesh Sippy's 'Sholay' is Amongst The Great Cinematic Moments in The History of Film. An Outstanding Motion-Picture, that oozes perfection & flamboyance. A True Masterpiece, that re-defined Hindi Cinema!\n\n'Sholay' Synopsis: After his family is murdered by a notorious and ruthless bandit, a former police officer enlists the services of two outlaws to capture him.\n\n'Sholay' is an Outstanding Motion-Picture. I've seen this Masterstroke a number of times & I can't get enough of it. Salim-Javed's Screenplay is a Milestone. The Script is Super-Strong, The Characters are Mesmerizing & The Narrative is Magnificent. The film runs for a 190-Minutes, but not a single moment does the momentum come down. In fact, the film gets bigger & grander with each passing scene. Ramesh Sippy's Direction is Fantastic. He executes this unforgettable story, with magnetic ease. Cinematography is fabulous. Editing is razor-sharp. Music by R. D. Burman, is legendary.\n\nPerformance-Wise: Amjad Khan as Gabbar Singh, delivers an astonishing performance. He makes Gabbar, the most despicable villain you'd ever see on the big screen. Sanjeev Kumar as Thakur, is flawless, as always. Amitabh Bachchan as Jai & Dharmendra as Veeru, are heroic & extremely competent. Hema Malini as Basanti, is lovable. Jaya Bachchan as Radha, is graceful. Viju Khote as Kaalia & Mac Mohan as Sambha, are excellent. Jagdeep as Soorma Bhopali & Asrani as a Jailer, are hilarious. A.K. Hangal as Imam, Sachin as Ahmed & Satyen Kappu as Ramlaal, are good.\n\nOn the whole, 'Sholay' is a Masterpiece. Its Simply Too Damn Good!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jmathur_swayamprabha",
        "review_rating": "9",
        "review_title": "It has assimilated with the Indian folklore",
        "review_detailed_main": "In the Indian mythological epic - Ramayan, Sage Vishwamitra asks King Dashrath for his sons - Ram and Lakshman to take on the might of the evil demons, creating havoc in the pious forests inhabited by the saints and finally the twosome kills all the evil ones, restoring peace and Dharma once again.\n\nMillenniums later, in the celluloid era, a movie was made in Japan - Seven Samurai (1954) which portrayed the story of a veteran Samurai (Japanese militaryman) taking six others with him to get the better of a dangerous bandit which is synonymous with terror in his village. This story inspired many Indian cine-script writers to make its Bollywoodish versions which came in the form of Mera Gaon Mera Desh (1971), Khote Sikkay (1974), Karma (1986), Army (1996), China Gate (1998), Keemat (1998) etc. However the most impactful of the Indianized versions of Seven Samurai is definitely - Sholay (1975) which was written by the high-profile cine-script writers, Salim-Javed. Though they had taken inspiration from Seven Samurai, yet, by default, Sholay turned out, not at all a shadow of these or any other movie on similar lines. It developed an identity of its own and became a legendary movie of the Indian cinema.\n\nSholay (flames) is based on the theme of the revenge-seeking mission of an ex-copThakur Baldev Singh (Sanjeev Kumar) whose all family members but for himself and his young daughter-in-law, Radha (Jaya Bhaduri) have been killed by the dangerous dacoit - Gabbar Singh (Amjad Khan) who has deprived him of his hands too. Handicapped Thakur seeks the help of two petty thieves - Veeru (Dharmendra) and Jay (Amitabh Bachchan) who visit his village, Ramgarh only to earn money in return of helping him. However knowledge of the truth transforms their hearts and they fight tooth and nail with the bandit and his gang, Jay loses his life in this mission whereas Veeru gains the love of his life in the form of Basanti (Hema Malini).\n\nIt is said that good pieces are made through hard, sincere and planned work but masterpieces are born by default. The same thing has happened to Sholay. It's a masterpiece by default and not by deliberate effort. The screenplay contains many loopholes and its definitely over-dramatic, devoid of the naturalness to a large extent. Still it keeps the viewer hooked. In fact, had the story been portrayed naturally, perhaps it would not have been able to be considered a masterpiece. The over-the-top nature of the picturization alongwith comic and witty dialogues (and their memorable delivery) is something which makes this entertaining movie nor only more entertaining but also an unforgettable experience for the viewer. This only provides unmeasurable repeat value to this movie. No surprise that several spectators have watched it dozens of times.\n\nThere are two major plus points of this movie adding spice to its already high entertainment value - 1. The mannerisms of the villain, Gabbar Singh and his theatrical dialogue delivery, 2. The comedy generated by Veeru, Basanti, Jay and some insignificant characters like the Jailer of the British times (Asrani) and Soorma Bhopali (Jagdeep). The scene of Veeru climbing up the water tank in a drunken state, threatening to commit suicide and demanding the hand of Basanti in marriage, is definitely the best comedy scene of Dharmendra's career.\n\nSholay is just like a dish in every ingredient and every required spice is just optimum, making it a highly delicious one rendering the eater a taste to remember forever. And that taste is such that it draws the eater again and again towards the dish. It's not a realistic movie about the bandits of India. It's an entertaining movie, providing wholesome entertainment through the activities of the characters who may not be found in this world. I consider Sholay as the biggest fantasy whose unique characteristic is that apparently it does not render the look of a fantasy.\n\nDirector Ramesh Sippy has directed the movie well despite loopholes and inconsistencies which are overlooked by us because we are mesmerized by the entertainment we get through the narrative.\n\nTechnical and production value aspects are quite high despite the fact that almost the whole story takes place in the rural setting. Music by R.D. Burman is quite OK, neither excellent, nor bad.\n\nThe biggest strength of the movie is the dialogues, especially the dialogues of the villain, Gabbar Singh. These dialogues alongwith Gabbar Singh, his sidekick - Saambha (played by Mac Mohan) and a member of his gang - Kaalia (played by Viju Khote) have become so popular that now they are a part of the Indian folklore. Who can forget - 'Arre O Saambha' and 'Tera Kya Hoga Kaaliya'.\n\nThe high-profile star cast of Dharmendra, Sanjeev Kumar, Amitabh Bachchan, Hema Malini and Jaya Bhaduri has excelled in the roles assigned. Everybody gets full marks for the underplay (Amitabh, Jaya and Sanjeev) and overplay (Dharmendra-Hema) as required by the situation in the scene. Asrani has been given the get-up of Hitler in his completely over-the-top role of Angrezon Ke Zamaane Ka Jailer (the Jailer of the British times) but he and others like him generate laughters as demanded by their roles. Leela Mishra, A.K. Hangal, Sachin etc. also leave their mark in their cameos.\n\nAnd finally, it's Gabbar Singh (Amjad Khan) who has become immortal because of this movie. Never in the history of cinema, a villain had amassed so much popularity which overtook the popularity of the hero / heroes. Amjad Khan never got such a role in his career again and also could never come out of the hangover of this role. Gabbar Singh with his mannerisms has become a legend.\n\nSholay is a movie in which the negatives also turned out to be the positives and everything just fell in place to render it a class of its own. It has been re-released many times and the Indian folklore has absorbed it."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "shikihiv",
        "review_rating": "10",
        "review_title": "One of the Best Buddy films of all time",
        "review_detailed_main": "Sholay is one of those movies, the kind that you watch when no one else is around, so that you can laugh and get choked up without any one watching. The friendship between Dharmendra and Amithab was excellently put on film, the journeys between the two are remeniscent of the adventures of Butch Cassidy and Sundance. I would definetly recommend this film, as it is a cornerstone of early Hindi blockbusters, and definetly worth watching."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "dinbhardwaj",
        "review_rating": "10",
        "review_title": "best movie ever seen",
        "review_detailed_main": "This is best ever made Indian movie. Having everything starting with comedy to ending with thrill. It covers all areas. It deserves to be called as the best movie in Hindi cinema. Nothing could be as great as this. Just go on and watch it. Don't watch just once. Watch watch and keep watching in every few months. Nice story with nice direction, nice acting by each character. Everything in just one movie. I comment could be best movie ever seen.What more you want to read. I feel this is sufficient. Just don't delay any more. Go for movie. Watch acting by amitabh, darmendra, angrejo ke jamane ka jailer and basanti. See the beauty of the dialogs. Gabar is the best part of the movie, Keeping you alive to watch a good fight."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Ibuk",
        "review_rating": "10",
        "review_title": "Sholay- The ultimate Bollywood movie",
        "review_detailed_main": "In my opinion the best Hindi film ever made. Everything is top notch, the theme tune, songs,dialogues, the casting and so much more. This is the highest grossing action movie ever, most classics such as KKHH AND DDLJ were love stories. Sholay was inspired by the Hollywood hit The Magnificent Seven which in turn was a remake of the Kurosawa masterpiece The Seven Samurai but in my opinion Sholay is just so so much better In my opinion Sholay is a mix of genres, there is action,romance comedy etc. Another remarkable quality is the characterizations, The characters are just so well thought out. There was the vengeful Thakur (played by the superb Sanjeev Kumar), Jai and Veeru( Amitabh and Dharmendra) Basanti (Hema Malini) and last and certainly not least Amjad Khan as the tyrant Gabbar. His entry sequence is one of the best and well known in Bollywood history. Gabbar set the standard for Bollywood villains, especially in the scene when he cuts off Thakur's arms. His dialogues are often repeated especially Kitne Aadmi thee.\n\nMost people claim this is just a revenge movie but its much more than that, Sholay is also a tale of redemption. Jai and Veeru at the start are no for nothing crooks but during the movie they start to change. For instance when they first turn up at Thakur's house they plan to rob him and flee but later on during the movie they return his money and say that they will get Gabbar for nothing. They even decide to stop their evil ways and start making a living farming like the villagers.\n\nSholay is also a tale of friendship, probably the best ever portrayed in a Bollywood movie. Two great instances is when at the end Jai spares Veeru's life by sending him back to the village and gets killed himself. Another great instance is after Jai dies Veeru goes to kill Gabbar and then lets him go after Thakur reminds him that it was Jai that had promised that Gabbar would be returned alive, after that Veeru says if it was his promise he would have broken it.\n\nAnother remarkable quality of Sholay is the emotional impact. I don't normally cry whilst watching movies but Jai's death scene gets me every time. Also the scene where Ahmed gets killed by Gabbar and he is sent back to the village on a horse is just unbearable for me.\n\nAll the cast play their roles to perfection but it is Sanjeev Kumar that stands out for me. For instance the last scene where he demands Gabbar to give him his hands. Amjad Khan also more than delivered. I cannot imagine any other actor playing him other than Amjad Khan.\n\nThe music by the my genius R.D. Burman was superb. My favourite are yeh dosti or Mehbooba (sung by R.D. Burman himself). In my opinion this was his best score for a movie. The action scenes also deserve a special mention, the sequence in which Sanjeev Kumar, Dharmendra and Amitabh are trying to fend off bandits whilst travelling on train is one of my favourite action sequences ever.\n\nIn fact until a couple of years ago I could only remember seeing the edited version (damn T.V. channels lol) and they had completely deleted all scenes of Soorma Bhoopali and Asrani. There are not many thirty year old movies that can still excite me when I watch them but Sholay is one of those movies that defies that rule. I can go on ranting about my passion for Sholay, thank you Salim Javed for providing me hours of entertainment."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "ShitizSays",
        "review_rating": "10",
        "review_title": "The Biggest thing of Bollywood",
        "review_detailed_main": "Lets accept the fact, even some great movies have their own flaws but that does not means that they are not great films. Sholay is the most profitable and biggest hit in Indian Cinema. It wont be an understatement if I say that Indian Cinema can be divided into time before Sholay and time after Sholay. Indian movies are basically protagonist based and rest of the characters are build around it but Sholay was different. Every character in the movie had its own life and its own fun. You come out of the hall even praising the antagonist or a very minor character like Surma bhopali whose screen presence was not more than 3 minutes. The film is a mass entertainer with all the elements of screen writing that are required in a hit film in abundance. Legends like Sanjeev Kumar, Amitabh Bachchan, Dharmendra, Hema Malini, Amjad Khan(who was not a star then) and other actors like A.K.Hangal, Jagdeep, Asrani, Keshto Mukherji left their marks on whatever role was given to them. Some say that the story is been lifted from Seven Samurai's and Magnificent seven but it doesn't matter because when you will watch the movie you will find the treatment to be totally Indian as only the basic plot is taken from those movies which for me is not a crime. Coming this movie from master writer duo of Salim-Javed and hands of Director Ramesh Sippy, you just can't afford to miss this entertainer. Watch this because in India if you don't know Amitabh Bachchan or have watched Sholay then you have no right to call yourself Indian or visit India or talk about India. Watch Sholay and get the license."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "cherold",
        "review_rating": "6",
        "review_title": "Sometimes excellent, sometimes not",
        "review_detailed_main": "In spite of initial negative reviews, Sholay became, thanks to word of mouth, a huge hit and an acknowledged classic. It is also, by Western standards, a bit of a mess, and something that would be a better movie with an hour chopped out.\n\nThe movie is shot like a western (although in spite of initial impressions it's not a period piece) and is gorgeously scenic. The opening train action sequence is good, though not great, and it illustrates an issue seen throughout the movie: it's clear no fist ever comes close to a face and the fighting has an over-choreographed look that makes it unconvincing.\n\nThis is followed by the film's nadir, a painfully unfunny \"comic\" sequence about a prison martinet with a Hitler mustache. Not only is it the worst part of the movie, but it's also completely unnecessary; it adds nothing to the movie. Then there's a musical number. This seems odd, but it turns out Sholay is a western-musical-action picture. Go figure.\n\nIf you can make it that far (about 45 minutes in) then things pick up with a talkative horse-cart driver whose amusing, narcissistic chattering proves that the movie can be funny if it tries.\n\nSholay has the look of a 50s-era western, but it also has the darkness that moved into cinema in the 60s and 70s. The most effective movies are its darkest, and once the film shows that side (towards the middle), the action, broad comedy, suspense, romance, drama, and even dancing, work pretty well.\n\nLike the Seven Samurai, Sholay is about heroes protecting a village from bandits, but unlike the Kurosawa film, these heroes have no sense of strategy. It is amazing how it never occurs to anyone in the film to take any precautions or even consider for a moment that being surrounded by bandits probably makes a lot of things dangerous.\n\nIn spite of a few grim moments, overall Sholay is your basic popcorn flick, and something I probably would have enjoyed more when I was 14 watching a Saturday afternoon movie marathon. 3 1/2 hours long and crossing genres willy-nilly, Sholay really *is* a movie marathon.\n\nCut a few scenes out and trim pretty much everything that's left and Sholay would be a much better movie. As it is, it's a bit of a curio that I can't quite recommend."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "kichdi",
        "review_rating": "10",
        "review_title": "SHOLAY The World's best Movie Ever made",
        "review_detailed_main": "Sholay is the ultimate movie, it has all emotions, action, comedy & romance. This is the only movie in which none of the big stars outshine the other, Sanjeev, Dharam, Amitabh, Hema, Jaya & Amjad. All excelled in their roles. People call it a western remake but the original had almost no emotions, no comedy, just a bland movie. Sholay cannot be compared to low films like DDLJ which had nothing properly made, there are 100s of Hindi movies which outclass DDLJ in every era.\n\nSholay's dialogues are still being told by the masses, it is the ultimate cult movie. The only black spot in the movie is Asrani's (otherwise my favourite comedian) he plays a British period jailer, his comedy looks sick. Jagdeep was well limited with a small role otherwise he would have destroyed all the good work, I wonder when he acted well in which movie? Amitabh's timely comments & his conversation with Hema's mausi was superb. Amitabh fills the comedian's role superbly.\n\nA must watch for all movie goers from all over the world, this proves the old Hindi movies were 1000s of times better than all the new age khans combined movies.\n\nP.S. Do not ever remake this Diamond Movie"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "alan-d17",
        "review_rating": "6",
        "review_title": "Awful, Plain Awful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jaysshukla",
        "review_rating": "4",
        "review_title": "Poor and Inconsistent writing",
        "review_detailed_main": "The movie focuses on two thieves Veeru and Jai(played by Dharmendra and Amitabh Bachchan respectively). They experience the turning point in their lives when they are hired by the retired Police officer, Thakur Baldev Singh (played by Sanjeev Kumar) to capture the ruthless dacoit Gabbar Singh (Amjad Khan).\n\nI could clearly see how this movie managed to achieve the classic hit status. However, I could not ignore the major flaws.\n\nThe inconsistency in the storyline is clearly visible. I have come across to quite a few talkative people with various backgrounds but never have I come across to someone who would talk like \"But you will have to tell me whose house you're going to. Basanti, take me to so and so's house. Because if I don't know where you wish to go, where will I stop the carriage? And how will the carriage stop if I don't stop it? You see, there's one thing worth considering, who's driving the carriage? I'm driving it. And if I don't know-\" This quote was quoted by Hema Malini's character Basanti. Just because the character is talkative, one shouldn't write random lines to form a dialogue. That's not creative. I assume the character is talkative and not mentally challenged. And if it is only for the comedy purpose, then I must say it was a lame humour. The comedy looks perfect when it is situational.\n\nAnother example I can think of is how Thakur rushed to confront the Gabbar's gang alone after seeing the dead bodies of his family. The character is a veteran police officer and he sure must've experienced the similar kind of a situation in the past while being on duty. It is very unconvincing that he would be so impulsive. Unlike the Basanti's character, this flaw is less forgivable. This scene directly connects to the movie's primary storyline and yet it was badly written and was flawed.\n\nSimilarly, it was unconvincing how Jaya Bhaduri's character turned out. She had an interesting backstory and if there was supposed to be a romance between her and Amitabh Bachchan's character, the writers should've grabbed this opportunity to further develop her character. She went through a lot and may have lot to say on her experiences but that subject was never brought up. We viewers don't get to know her thoughts. She even rarely interacts with the Amitabh's character Jai. They are just romantically interested in each other and we are supposed to believe that. So, not only the movie is full of flaws but the writers showed laziness even when there was a potential.\n\nNevertheless, I could clearly see why this movie is so popular. I am not really good at judging the acting performances but most of the actors, especially Amjad Khan, looked perfect in their respective roles. So much that their dialogues became popular and are frequently used (mostly for the reference purpose) even today. Overall, the songs are catchy as well. These things only add to the entertainment value.\n\nOverall, the movie is watchable but there are so many better movies out there. So, try not to waste time on this one."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sesht",
        "review_rating": "",
        "review_title": "Reviewing the 2014 3D theatrical version for now",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Calliegrl03",
        "review_rating": "10",
        "review_title": "Great, Great Movie!",
        "review_detailed_main": "I rented \"Sholay\" from an Indian store around where I live and I loved every moment of it! It's funny, sad, romantic, and very ACTION PACKED! Dharmendra and Amitabh Bachchan have excellent chemistry. I loved the the Buddy Buddy song they sing together, it's really cute and funny but \"Holi Ke Din\" is the BEST song! I was particularly touched by the \"silent\" love between Bachchan and his real life wife Jaya Bhaduri. The movie is well acted, Bachchan's character reminded me of James Dean and Steven McQueen. And I was haunted by Bhaduri's performance. On a shallow note, the lead men in this movie are some serious eye candy, especially Bachchan. I was thought he was a handsome guy back in the day, (Hell, he still is!) but in Sholay, he's so incredibly GORGEOUS! I mean, I was drooling over him! This movie is a must see for Bachchan fans.\n\nP.S. Parents, this movie is VERY,VERY, VERY violent! Children and young adults are killed brutally. It's a PG-13er all the way..."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "lumyamerislamamer",
        "review_rating": "10",
        "review_title": "one of the best Indian landmark movies",
        "review_detailed_main": "a landmark movie and one of the best.i give it 10 out of 10.\n\ni also want to say that this movie is not a remake and the plot is original. and any American who says that it is a remake then he is rude and a dirty liar because it is just inspired by other western movies and this movie is an Indian western that is much better than any American western because the Indian actors and actresses have true and warm emotions that the American actors and actresses don't have. it was directed with an unmatched excellence.i recommend it very much to everyone.\n\nit is such a wonderful movie.\n\na true masterpiece."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Koya",
        "review_rating": "10",
        "review_title": "One of the truly great films ever made",
        "review_detailed_main": "I have yet to come across anyone who has disliked this film; even people I know who dislike Indian films admit that Sholay is a truly great film. The reason is quite simple....the genres covered are universal, and the acting and direction is quite phenomenal. The characters are so brilliantly portrayed that one can sense their emotions within oneself. It has long been argued about who is the best actor in the film. Well for me, it is impossible to tell. Amjad Khan plays Gabbar Singh magnificently, but then again you have Amitabh as Jai, Dharmendra as Veeru, Hema Malini as Basanti and Sanjeev Kumar as Thakur Baldev Singh, all of who put in immaculate performances. How can one choose between them? To 'put the icing on the cake', Sholay also contains two of the greatest songs in Bollywood history(yeh dostee and jub koyee haseena root jaatee hai). When I first watched this film as a child, I was almost crying at the end. Even now when I watch it I find myself getting emotional. Yet there are parts in this film that make you laugh hysterically. So no matter what kind of films you like, this is definitely one to watch....it really is one of the truly great films ever made."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "daanveerkaran",
        "review_rating": "10",
        "review_title": "A Great Movie",
        "review_detailed_main": "One thing that strikes most about this movie is the characterization. Millions of people still remember the characters in this movie. The plot is inspired from \"Seven Samurai\" but it is adapted well to the Indian backdrop. This movie was made at a time when bandits were not an extinct species. The plot is simple, Thakur (Sanjeev Kumar) is a cop who arrests a notorious bandit Gabbar Singh (Amjad Khan) only to gain his wrath. The bandit escapes and massacres Thakur's family and severs both his arms. Thakur hires two men, Veeru and Jay (played by Dharmendra and Amitabh Bachchan) to capture Gabbar.\n\nAll the characters of this movie have left a mark on Indian cinema for a long time and will continue to remain so. Amitabh Bachchan, Dharmendra, Sanjeev Kumar, Jaya Bachchan and Hema Malini are all brilliant in the movie. But one man steals the show as the villain who is cunning, merciless and evil. Gabbar Singh's character was played by Amjad Khan and he is fantastic in the film. It is because of him that the movie became the greatest Indian film ever !! 10/10"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "dhiman33",
        "review_rating": "10",
        "review_title": "\"The\" perfect movie of bollywood that contains everything",
        "review_detailed_main": "Now what can I say about this one?This is the best movie bollywood could ever produce;everything is just perfect about this film--it contains action,romance,suspense,comedy,great acting,beautiful songs,unforgettable characters and dialogues and what not!Even after so many years,it's craze remains the same.One surprising thing is that when the film was released,it was considered to be just another average film,it also didn't received many awards or nominations..just when the theaters were going to stop showing it,people were seen in great queues outside the cinema-halls!Suddenly there were rush towards the theaters,and it unexpectedly became so big a hit that it became the first ever bollywood film to observe a silver jubilee!I recommend this film very very much;thogh would also like to mention that people not connected to Indian culture,or people who doesn't know much of it,might find it not so magical..I see some people are considering the comic scenes total nonsense,but without them(surma bhopali and jailer scenes) the movie seems incomplete to me.Here at IMDb,people who hate this film says all the songs but \"mehbooba mehbooba\" are bogus!I strongly disagree to that and think they only tell so because songs other than \"mehbooba mehbooba\" have Indian tunes in them.Just see this film and you will be wondered to discover no matter how many times you watch this;watching it over and over again will never tire you!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "vpvp",
        "review_rating": "10",
        "review_title": "a movie as great as this will never be made again..",
        "review_detailed_main": "This movie has everything. Awesome action, wit and humour in the dialogues, the greatest hero of indian cinema, the greatest villain of all times. It captured the imagination of every movie goer and even today mothers discipline their children by telling them about gabbar singh.."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "markovd111",
        "review_rating": "7",
        "review_title": "Unbiased western review!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "darashukoh",
        "review_rating": "10",
        "review_title": "The Ultimate Indian Blockbuster",
        "review_detailed_main": "***SOME SPOILERS*****\n\nSholay, directed by Ramesh Sippy in 1975, remains the most successful Hindi (perhaps Indian) film ever made. While a couple of films have made more money and recently Dilwale Dulhaniya Le Jaayenge surpassed Sholay's unprecedented 5 year run at Minerva Theatre in Bombay, Sholay leads by dint of the sheer impact it made on not just Indian cinema, but popular culture in general.\n\nThe film is a loose adaptation of the Magnificent Seven (itself based on Kurosawa's Seven Samurai) and borrows freely from other movies - Hollywood or Indian. However, its adaptation is uniquely Indian and it remains, to my mind, immeasurably superior to the movies it is based upon. The story is about two crooks, Jai and Veeru, in rural central India - a region ravaged by dacoits (outlaws) - who are hired by a village landlord, Thakur to catch Gabbar Singh- a notorious outlaw - alive. Jai is the quiet reflective crook, while Veeru is loud, boisterous, impetuous, and a lothario to boot.\n\nVeeru falls in love with Basanti - a garrulous taangewali (horsecart driver) while Jai silently wooes the Thakur's widowed daughter-in-law, Radha.\n\n******SPOILER ALERT*****SKIP THIS SECTION IF YOU HAVE NOT SEEN THE MOVIE\n\nIt appears that Gabbar had been arrested by the Thakur while the latter was a police inspector and had exacted revenge upon escaping jail by massacring the Thakur's family. The Thakur's attempt at evening scores was met by capture and by the chopping off of his arms in a chilling scene. Hence, the need for mercenaries.\n\n****SPOILER OVER****\n\nGetting the bandit and the eventual shootout is the climax of the film, but it is greater than the sum of its parts. Each character, including minor ones like the jailer, the braggart lumber merchant (Surma Bhopali), the Maulvi, the family servant, have been well fleshed out and have significant parts - at the very least they entertain. The script tends to meander, but Sholay was not meant to be a simple revenge film - it conveyed a larger picture of villages, the dacoit menace so real then and even now.\n\nThe film was shot in South India at Ramnagram rather than at the place where it was set (central India) but the stark, rugged scenery was worth it. As the first 70mm film in India and the first to use stereophonic sound, Sholay secured a place in Indian film history.\n\nIts success derives from a good script which does not allow for a dull moment (full marks to Salim-Javed for doing this), excellent direction and editing and excellent cinematography.\n\nWhile the film was fairly violent it was characteristic of its period. Its legacy however, is the dialogues of the major characters which the producers were able to sell as a separate LP record in 1975 - a first in Indian cinema. A generation later, most Indians who know Hindi understand \"Kitne Aadmi the?\" \"Loha Lohe ko Kat taa hai\" \"Tera Kyaa Hoga Kaalia\" - so much so that these dialogues have entered the lexicon and are frequently used in commercials.\n\nRD Burman's music was a big plus with a fantastic score and even better background music. Indeed the background music from the faux \"Western\" theme music to music that announced major characters like Gabbar Singh is recognized even after three decades.\n\nSholay made the career of Gabbar Singh as the first psychopath on the big screen ( though some might argue that Danny Denzongpa had essayed that in Dhund) in India, though he could never get a comparable role later. Sanjeev Kumar's controlled rage as the Thakur was a close second performance. Dharmendra and Amitabh Bachchan were very good with both exhibiting comedy especially in the water tank scene, though Hema Malini was a bit over the top. The supporting cast of Asrani (jailor), Surma Bhopali (Lumber merchant) and others were very good.\n\nA must see that seems to transcend time. I am obviously biased but years of screening this film for international as well as Indian audiences have convinced me of its worldwide appeal."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "phharshu",
        "review_rating": "7",
        "review_title": "Watching it after 45 years",
        "review_detailed_main": "The movie begins with the two friends who are robbers who gets caught by police and somehow they manage to escape from there. Later on they are given a mission to bring the thugee named Gabbar alive by the police officer Thakur. Thakur wants to take a revenge from Gabbar for killing his whole family. The two friends find their love of interest in the same village. Will the two friends able to complete their mission? Will they will get love of your life? The story is based on this two criteria. Personal comment : I am watching this movie after 45 years of its release. I felt movie was good in the end, but as things happened it got bored."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "JakeBrinkman",
        "review_rating": "3",
        "review_title": "Entertaining, but flawed and far too long",
        "review_detailed_main": "I've only seen a few Hindi films so far, mostly from the 1990s-2000s. The most common factor I've seen in those movies is directing, cinematography, and screenplay that are all 30+ years behind the times compared with cinema from any other nation.\n\nSholay is not one of those films. This 1970s curry western has all of the elements I would expect to see from a Hollywood 70s action flick. It has the good, as in respectable cinematography, mostly interesting dialogue, entertaining action, and the occasional laugh. It also has the bad, which includes occasional over-the-top humor, a few action sequences that too obviously staged, and blood brighter than any Holi orange.\n\nThe concept of this movie is good enough to make me wonder, \"What went wrong with Hindi cinema in between Sholay and the 1990s?\" However, there are a few more poor aspects that brought my rating even lower. This movie has the typical Bollywood song scenes that add nothing to the film except to break your immersion. The female lead was entirely unlikable. One fight was so ridiculously faked that it completely killed the tension in the scene. Worst of all, the film was about an hour longer than it needed to be. Two separate love stories made the scenes in between the action feel very dragged out. This is a 3:15 movie, but it easily could have been 2:15 if they cut one love story and all the songs."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "prawal_1971",
        "review_rating": "10",
        "review_title": "A case study for management students.An outstanding creation, the movie made in 1975 has a timeless feel to it.",
        "review_detailed_main": "An outstanding creation, the movie made in 1975 has a timeless feel to it. one can watch it any day and still relate to it. each and every depiction in the movie is appropriate. it depicted the extremes of human emotions of the protagonist and antagonist, village life, its superstitions, the simple joys and sorrows of life. the pace of movie is fantastic. the dialogues are most apt for the situations and i wonder if there was any better dialogue possible for those characters. The cult status which has been attained by this movie is likely to make life difficult for someone who wishes to make a remake of this movie. comparisons are going to be very strong and purists would deal with a substandard replication very severely. This movie is the white demonstration of film making, a bouquet of excellent performances in acting and technical departments where the impact of the film is far greater than sum of impact of all departments. A case study for management students."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "JamesHitchcock",
        "review_rating": "",
        "review_title": "An Eastern Western",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "amitrami3",
        "review_rating": "10",
        "review_title": "Indeed!! Greatest Story Ever Told. Best Starcast Possible!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "ganeshkss97",
        "review_rating": "10",
        "review_title": "All Time Favorite",
        "review_detailed_main": "Sholay,directed by Ramesh Sippy is an all time favorite of mine.\n\nIt has a story,it has great actors,good music,memorable scenes,superb dialogs.What else would you want? There is not even a single scene which puts you off.\n\nDirection by Ramesh Sippy is truly masterpiece.\n\nThe music is very good.\n\nThe dialogs are superb.Especially the ones delivered by Gabbar Singh.\n\nThe story is well written.\n\nPerformance wise-Even though the main actor is Dharmendra and Amitabh Bachchan.Amjad Khan steals the show.He is excellent!Dharmendra is great.Amitabh Bachchan is superb.Sanjeev Kumar is amazing.Hema Malini is cute.Jaya Badhuri is good.Jagdeep is funny.\n\nOverall Sholay is a Classic."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sforstory",
        "review_rating": "10",
        "review_title": "Great",
        "review_detailed_main": "How do you properly describe a film which feels like family? We know all the dialogues, our kids love doing Gabbar Singh imitations, and watching the film even for the first time gives us a feeling of deja- vu. Sholay is a part of every Indian, four decades after its release, and it will remain so for many decades more.\n\nHow is the casting so perfect? How did Amjad Khan, a complete newbie to films, deliver such an iconic performance as Gabbar Singh? Did the legendary writer duo Salim-Javed have any idea that their dialogues would be recited decades later by my five-year old cousin? And how is it that Sholay has become nothing short of immortal?\n\n10/10"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "arshdav-93817",
        "review_rating": "10",
        "review_title": "Best thriller ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "santoshkasimani",
        "review_rating": "9",
        "review_title": "A true Indian classic",
        "review_detailed_main": "Sholay is arguably one of the most complete movie ever made in India, during its release it was panned by critics and everyone expected it to flop but word of mouth reviews made it into one of the biggest success in Indian history it ran for 286 weeks in one theater in Mumbai also it ran for 50 weeks in 50 cities in India, In the 80s and 90s its claimed that there is not a single Indian who has not watched this movie, I have watched it at least twenty times, many people know almost all the dialogues in the movie by heart Dharmendra and Amitabh Bacchan play convicts with a heart of gold who are recruited by Sanjeev Kumar who lost his entire family to capture dreaded bandit \"Gabbar Singh\" played by Amjad Khan alive, they are supported ably by Jaya Bhaduri and Hema Malini as female leads, I feel that you cannot review a film like Sholay, you have to watch it to know it"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "SnoopyStyle",
        "review_rating": "7",
        "review_title": "Bollywood western classic",
        "review_detailed_main": "On a personal vendetta, retired policeman Thakur Baldev Singh recruits lifelong thieves Veeru and Jai to capture bandit leader Gabbar Singh. Two years earlier, Thakur had captured the two thieves. While transporting them on a train, they are attacked by bandits. Thakur releases them to help fight off the bandits. He becomes severely wounded in the fight but the guys risk imprisonment to save his life after flipping a coin for the decision. Along the way, the boys befriend talkative village girl Basanti.\n\nThis is a blending of Bollywood and a spaghetti western. It definitely has elements of both and is able mix them well. There are lots of action although sometimes they fall short in terms of staging. There is also the song and dance element. There is broad comedy. I like Basanti but I'm less taken with the Hitler-stached jailer. He is way too broad. The main leads are charismatic and compelling. Overall, there is a solid Magnificent Seven feel and this is only a small step beneath that level of cinema."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "wazkhan",
        "review_rating": "10",
        "review_title": "it is a great classic",
        "review_detailed_main": "Film review\n\nFilm name Sholay classic\n\nCast Amitabh Bachchan Dharmedra Amjad Khan Sanjeer Kumar Jaya Bachchan Hema malin\n\nThe storyline about 2 thieves who are Jai (Amitabh) & Veeru (Dharmedra) who help Thakar (Sanjeer) to capture Gabber (Amjad ) who is a bigger criminal.\n\nI like this film because everything was great I liked the songs and it was funny and with lots of action.\n\nPerformance : it was a great performance from all the actors .\n\nOne part I didn't like was when Jai (Amitabh Bachchan) dies, it was very sad .\n\nYes, I do recommend the film to all of you, it 's an all rounder & I have seen this film 10 times."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jboothmillard",
        "review_rating": "7",
        "review_title": "Sholay",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "bibliomane123",
        "review_rating": "1",
        "review_title": "Putrid",
        "review_detailed_main": "I can't believe that this is considered one of the greatest Indian films ever. The acting throughout is comical and unsubtle, the action scenes laughable and poorly executed, and the screenplay disjointed and confusing, especially all the ridiculous back stories that keep disrupting the meager narrative flow. Technically the film is embarrassingly primitive, on par with early Edison and Lumiere brothers shorts. Except for the sound, the over-exposed color photography and the bell-bottom pants, think 1905, not 1975. Every film that is said to have inspired Sholay--Seven Samurai, Once Upon a Time in the West, The Great Train Robbery (1903), and even The Great Dictator (the character of the jailer is clearly lifted from Chaplin's classic spoof of Hitler)--is in every way superior to this three-and-a-half-hour monstrosity."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "cb429",
        "review_rating": "10",
        "review_title": "Anything less than a 9 is an insult",
        "review_detailed_main": "This is the greatest movie ever created in bollywood cinema. It will not be replicated as the acting performances cannot be even reached by actors of today. The story will grip you throughout and the performances are utterly impeccable. In 1975, it had a greater impact than The Godfather did at its time. This movie will rock you to your core. It contains all elements that contribute to an epic masterpiece. Comedy, Action, Tragedy, Romance. All elements are evident and yet the movie does not lose its simple and yet undeniably unique touch. Again greatest movie to ever grace Indian Cinema and i say this in February of 2009. You can enjoy this regardless of race or culture. Just watch it and don't insult it with a mediocre rating. It is the equivalent of giving the Godfather a rating of 7 in an Indian movie review site."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "subdhara",
        "review_rating": "10",
        "review_title": "Sholay",
        "review_detailed_main": "What should i say or write ? No words, Nobody can describe in words about SHOLAY.\n\nIts a landmark movie in Bollywood Cinema same like Mother India, Paathar Paanchali...\n\nIts a movie of the century in Bollywood Cinema.\n\nAfter this much year everybody know about Gabbar Singh, Jay, Veeru,Basanti,Soorma Bhopali,Jailer and Jaya Even Dhanoo and Non other than Thakur.\n\nTera Kya Hoga Kalia..... Saap ha-tho SE Nani paro SE kuchla... Tumhara naam kya hai Basanti... These dialouge like a words of the century."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "eldreddsouza",
        "review_rating": "10",
        "review_title": "Bummed that it's copied.",
        "review_detailed_main": "There's absolutely no doubt that this is The Best Indian film ever. The writing, the performances, the chemistry as well as the songs are all top notch. The writing of Salim-Javed is tight that 3 hours and 20 minutes fly by. In today's day and age good luck finding a short 2 hour film that will hook you like this film does. They're rare, but Sholay is an absolute Classic.\n\nI had rated it a 10 obviously, that is before coming to know about it being a copy of the 1960 film, \"The magnificent 7\". Thus I'm changing my rating to an 8. It however still remains the greatest Bollywood film, in terms of quality to date. No other film comes close even."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "saytosandeep",
        "review_rating": "9",
        "review_title": "MY REVIEW: The Ageless Bollywoodish Entertainer!!",
        "review_detailed_main": "As said by a critic; 3D, 2D or no D, Sholay is still D for Delicious. It's an ageless entertainer made from all bollywoodish ingredients; Songs, dance, melodrama, dialogs etc. But make no mistake, there is undeniably excellent storytelling, well developed characters, an engaging emotional script with ample scope of ruthless action, sincere performances by all lead actors, first rate background score and technically apt direction. For nitpicking, you can say that more than 3 hours is too long and few scenes could have been edited but the charm of this movie is too magnetic that even after 38 years, it is able to fill half of the seats of the theater on its re-release. I may not agree that this is the greatest story ever told but yes it is the finest commercial effort till date by Bollywood. For those who have doubts, Sholay in new 3D format with digitally enhanced sound and picture quality is worth every single penny of your expensive ticket. What a way to start 2014 in theaters!!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "ranzzit",
        "review_rating": "10",
        "review_title": "one of the best screenplays in Indian cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "archismansen",
        "review_rating": "10",
        "review_title": "greatest movie ever made",
        "review_detailed_main": "this possibly is the GREATEST movie ever made. The story, screenplay, cinematography, Direction, action is all top class. THe movie made with primitive equipment has withstood the test of time and probably will rule the minds of generations to come. It will be an understatement to say that sholay is a cult movie cause it is much more than that. It is a statement on the times(the '70s) and is the greatest cast ever assembled and the best technicians ever assembled. And for all the sholay connieuers the book on \"making of sholay\" is a must read. The director has to take the credit for backing such a monumental work and carrying it off brilliantly. Interestingly except for 1 award the film did not get any filmfares or critical acclaim but the movie still rules the hearts of millions of fanatics."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "susanboyd-06006",
        "review_rating": "",
        "review_title": "Way too long with unnecessary musical numbers but a good watch nonetheless",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "classicsoncall",
        "review_rating": "6",
        "review_title": "\"An honorable death is any day better than a life of humiliation.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "preetamkd",
        "review_rating": "10",
        "review_title": "Greatest movie of all time",
        "review_detailed_main": "I cant believe this movie has a rating of only 7.6 here.We are talking about THE SHOLAY here. Perhaps the best Indian movie of all time.Everybody whether they are old or of new generation has this film at least once.Somebody even seen about 50 times.Me personally seen this 20 times.Every time i watch i get completely mesmerized by it.It has become a part of our culture.The character names or the incidents are used in our everyday lives.I bet there is not a single soul who does not know this film.It is beyond great.You cant describe such films.They have their own place from where you cant displace them.It is like a \"Dhruv Tara\".As long as Indian film industry lives it will remain the numero uno film.As somebody said i quote \"indian films are divided in two parts 1]pre sholay 2]post sholay\".Everything in this film is great."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jerrel100",
        "review_rating": "6",
        "review_title": "Lame, but can easily be transformed to flame...",
        "review_detailed_main": "This movie is in essence a well crafted film. Camera-work and sound recordings are superb. However, the storyline could be drafted much more to the point. To value this movie I made my own version by cutting out 70 minutes of unnecessary side and back stories which makes this movie tedious and boring.\n\nMy cut is a 135 (instead of 204) minutes movie, full of action with increased pace. I deleted the songs \"Ye Dosti\" \"Holi Ke din\" \"Koi Haseena\", the background story of Jaya Bahaduri, the Asrani sequence in jail and Mausi's approval for having Veeru engaged to Basanti.\n\nGabber Singh is performing breadth taking and the action scenes are very raw. This rawness is the real beauty of the movie."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "deschreiber",
        "review_rating": "2",
        "review_title": "not this Westerner's cup of tea at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "chopragsc",
        "review_rating": "10",
        "review_title": "A Classic Masterpiece - Deserves a 10",
        "review_detailed_main": "For heaven's sake watch the movie again - Each and every shot was meticulosuly shot - each and every \"STAR\" was treated the same as an \"extra\" - Original one crore and one year almost took 3 crore and 3 years to complete - even with the Censors and public's initial bad response not one SCENE was re shot ...\n\nIT IS A MASTERPIECE - everything from MUSIC, Editing, acting, Lyrics, direction, cinematography, action .. everything - not one movie comes close to this - No wonder after 25 years its still draws house full crowed...\n\nyou are not doing justice by just saying \"I don't think this should be in the top 250\"..\n\nI respect Satyajit Ray and all the others but I have done research on this movie for over 20 years - and don't agree with you here Feel free to send me any doubts and or questions that you might have. I will do my best to answer. I would also like to start a fan club for this movie - if you would like to be a part of this let me know Thanks Singh"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "arupananda-yash",
        "review_rating": "10",
        "review_title": "one of the greatest movies ever made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "pushkarw",
        "review_rating": "10",
        "review_title": "Tumhara naam kya hai Basanti.",
        "review_detailed_main": "This is the greatest Indian movie ever made. Each dialogue, each scene, each song, each character is immortal. I have seen this movie at least 10 times and it does not fail to evoke deep emotions every time. From the very first train sequence, Gabbar Singh's entry, a father's plight after discovering his son's dead body and the final clash between good and evil, this movie is masterful story telling. Although Zanjeer created the angry young man image for Amitabh, this movie surely set him on the path to super stardom. This movie was so good that even Ramesh Sippy, the direcor, has since not been able to create a movie to match this one."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Umar Mansoor Bajwa",
        "review_rating": "9",
        "review_title": "A Superhit Indian Western !!",
        "review_detailed_main": "Undoubtedly, this mega movie is a milestone in the Bollywood filmography. The film has good characterization of vengeful roles, brilliant portrayal of tragic and terrifying sequences, as well captivating cinematography reminiscent of Hollywood western movies.\n\nThis was the Indian motion picture which set the stage for a different type of movies, that is to say, action movies with vital ingredients of violence, not yet crafted by Indian producers/directors and unknown among the local audience.\n\nThe full and befitting advantage of this sort/dimension of Indian cinema went to Amitabh Bachan (the Fighter/Angry Hero)and the inevitable looser was the then Super Star - romantic Rajesh Khanna who was very much unable to fit into or appropriately perform angry, violent and action studded sequences that happened to be the cry of those days.\n\nAll said, the Indian Cinema moved from moral based drama to western styled Hollywood movies that was not the quintessential forte of Indian polity. You can say that the cinematic imagination transformed from the sublime to the crazy and temporal.\n\nSholay is a very interesting movie directed by the same man who had just a couple of years ago directed Andaz - a very different family movie based on real-to-life social drama. All credits to Ramesh Sippy -the Trendsetter."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "yaserpaki",
        "review_rating": "10",
        "review_title": "this is a \"must see movie\"",
        "review_detailed_main": "if you ever want 2 watch an hindi movie it must be \"sholay\", you cant go wrong with thid movie it has comedy, romance, tragedy, action,western and it is musical aswell. it has one of the best bollywood heros which is BIG B and it has a good villian, amjad khan, (decaesed). once you have seen this film you will want to watch it again. It is about two brave theives who are best freinds (big b and dharmendrah) who get arrested by a policeman (sanjeev kumar). some bandits attack them , the two theives risked their own lives to save the policeman. many years later he needs the help of the two theives to capture a bandit."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Chimpu",
        "review_rating": "10",
        "review_title": "All-Time Indian Classic",
        "review_detailed_main": "Well, this movie speaks for itself. 'Sholay' is the quintessence of a very popular genre in Bollywood - \"Crime+Drama\". Acting, Dialogues and Cinematography is impeccable. Regarding the plot - its novelty, people may argue that its a mixture of many Hollywood movies (of 'western' genre). I have seen most of those movies which are claimed to be the 'archetype' of this classic. It surely carries the hints of them but you should know that - \"to steal ideas from one source is 'plagiarism' but to steal from multiple sources is what is known as 'research' (no offense to researchers !)\". The Sholay crew did their groundwork and research and delivered a true MASTERPIECE.10/10"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "bal_singh",
        "review_rating": "",
        "review_title": "24 years on ... its still the best!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Superb Entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "manishw75",
        "review_rating": "10",
        "review_title": "The Greatest Entertaining Film of Highest Quality",
        "review_detailed_main": "The Best Star Cast.. The Best Background Music.. Best Direction... Best Script... Best Photography... Best Location... Best Performances... Best Debut of a Villain... Best Action...\n\nThe Movie Has Action, Comedy, Drama, Tragedy and everything else which together combine to form the best commercial Indian film ever made for mass consumption..."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "v-singh",
        "review_rating": "7",
        "review_title": "A game inspired by Sholay",
        "review_detailed_main": "Inspired by the cult movie, a movie has been developed based on the famous character Basanti. The game itself is called 'Basanti' and can be played at Koffii dot com.\n\nThe game is all about getting Basanti to Ramgarsh, safe and sound and riding her beloved mare 'Dhanno'. The path, a treacherous one filled with dacoits riding high on their horses has Basanti scaling the tracks skillfully and also picking up weapons and other freebies to get to Ramgarh before dark.\n\nThe game is already witnessing huge number of hits due to its indigenous flavor, something with which everyone can identify. We've lived the era of some fantastically popular movies and the game version of it is something contemporary but I'm sure everyone would like to try their hand at it."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "skekses",
        "review_rating": "3",
        "review_title": "What a let down.",
        "review_detailed_main": "My father and I anxiously popped in this DVD that was suggested by a friend. After reading many reviews and seeing the high rating on IMDb I thought we were in for a real treat. What a load of garbage this movie turned out to be. A combination of all the wrong ingredients for a epic western. Growing up on Rio Bravo, Bite the Bullet and The Professionals I couldn't wait for Sholay to end. Sholay is three hours of total misunderstanding of Western movie culture. My view of Bollywood movies has been tainted for quite a while with this movie. John Wayne would be rolling over in his grave if he saw two-cowboys in leisure suits, with poor comic relief. I will describe one seen from the movie. The two wanted heroes get caught and are serving jail time. The new warden at the jail is a poor representation of Charlie Chaplin playing Hitler. That was one of the few highlights... In conclusion this is a horrible movie that tries to mesh musicals, comedy, and drama from Western culture into a Bollywood hit. It might have worked for Bollywood, but any fan of Hollywood westerns would be smart to steer clear of this crap."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "10",
        "review_title": "Sholay is truly the Greatest Hindi movie ever made of all times everythingwise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "vamshi",
        "review_rating": "10",
        "review_title": "One of the greatest ever",
        "review_detailed_main": "Sholay is a remarkable film...can you believe that Amitabh shot for both Sholay and Deewar at the same time? He shot for Sholay in the day near Bangalore and took a train to Bombay at night to shoot for Deewar. The film features great performances all-around and is technically sound, the film has great editing. A classic action film that includes Romance and Comedy...As far as entertainment is concerned this is the best of Hindi Cinema"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Hurck",
        "review_rating": "10",
        "review_title": "Absolutely breath-taking.",
        "review_detailed_main": "This movie was absolutely breath-taking and amazing. I watched it for the first time a few weeks ago and my views and perceptions on films has changed dramatically. No other movie lives up to the marvel of \"Sholay\"."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "iamricky",
        "review_rating": "10",
        "review_title": "a monumental feat, that cannot be paralleled in the history of cinema",
        "review_detailed_main": "It is the most perfect movie I have ever seen in my life. From the casting, to the direction to the performances. But the most amazing feat was achieved by Amjad Khan. Even today, people remember Gabbar Singh, the infamous dacoit played superbly by Amjad Khan. His opening scene is known to every Indian kid like a poem in the English class...\"Kitney aadmi they?...\". In comparison, people seldom remember that Amitabh's name was Jai and Dharmendra's name was Veeru in that movie. This is not to play down their roles. It just amazes me how a new-comer could side-line such stalwarts. Ramesh Sippy has not been able to repeat his directorial performance, with \"Shakti\" not living up to its promise."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "manishw",
        "review_rating": "10",
        "review_title": "THE BEST EVER",
        "review_detailed_main": "This is unarguably the best Hindi movie of all times till date. It arrests your atention even after 26 years it was released. Each time you see the movie, you find newer things to admire. Its just too good.\n\nIt is THE MOVIE you are guaranteed to enjoy for unlimited number of times."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "simon_booth",
        "review_rating": "",
        "review_title": "Pretty good :)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "wvriend",
        "review_rating": "7",
        "review_title": "Two gold hearted hoodlums help former inspector catch the bandid",
        "review_detailed_main": "A story that could challenge a good old fashioned western (cowboy movie). With back flashes that explain the history of the main character prior involvements this India western has a solid story with actors that resemble characters you might (during the almost three hours) feel sympathy for. Very enjoyable."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "the red duchess",
        "review_rating": "9",
        "review_title": "A popular film that exalts body, mind and spirit.(possible spoilers)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "ajay-92672",
        "review_rating": "7",
        "review_title": "Not the greatest movie ever",
        "review_detailed_main": "Some call it the greatest Indian movie ever but i disagree this movie which deals with 2 small time thieves which are then hired by an ex cop who wants to take revenge by catching Gabbar that too alive i would say this is good movie overall not that great,probably one of the few old movies which i watched"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "magnuspy",
        "review_rating": "5",
        "review_title": "Great if you understand the culture",
        "review_detailed_main": "If you are steeped in the socio-economic and cultural milieu of the Indian subcontinent, and buy into the local entertainment paradigms, you will love Sholay. In fact, by such standards, this is the best film ever made and occupies an almost mythical spot in the Indian psyche.\n\nThe further you are from the state described above, the less you will appreciate Sholay. In particular, Westerners with little exposure to Eastern cultural or entertainment norms will consider this film laughable and amateurish.\n\nI have my feet on either side of this divide and consequently have chosen to provide a '5' rating."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Sparrowmaniac",
        "review_rating": "10",
        "review_title": "Friends for Life, Revnge for Death",
        "review_detailed_main": "Two Friends who are like brothers, get into a spot when they agree to bring in a notorious dacoit for a person, alive. The cops have got a healthy tag on his head (Dead or Alive) but this man wants him alive, to avenge his family's death.\n\nAmidst all this things turn personal when the dacoit captures a village girl the love of Viru's life and kills Jai in action. The short tempered Viru gets infuriated by the death of his best friend and gets the job done by capturing Gabbar, the dacoit.\n\nOne of the landmarks in Indian movie history, Sholay is just another story of the life style in a typical village in the late 60's and early 70's. Common thieves snaking their way out of prison, boys falling in love with simple village girls. Ramesh Sippy brings out the story very clearly through a lucid script and Amitabh Bachchan and Dharmendra play the part of the two inseparable friends Jai and Viru to perfection. Amjad Khan, the man who went on to become the villain for many future movies, makes a superb debut with Gabbar. Hema Malini plays the role of the simple but outspoken village girl very well and Jaya Bhaduri is also marvelous as the widow of the landlord. But the entire movie stands out and is based on two characters. Gabbar and Thakur. Sanjeev Kumar gives a mind blowing performance as the handicapped thakur, a retired police inspector who is crippled by Gabbar, for sending him to jail. As a consequence for his actions he kills off Thankur's family members sparing him and his youngest daughter in law.\n\nAn excellent movie which also brings out the smooth and melodious music which creates a grim emotion for the viewer. Overall, it is well worth watching and it may be considered to be a \"The Good, Bad and The Ugly\" of the east. 10/10 from me.........."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "tramani",
        "review_rating": "10",
        "review_title": "It still holds your interest",
        "review_detailed_main": "Watched this one many times during 1975 to 1980. In the 90s watched it on VCR and now on DVD. Nothing matched the experience of watching on mint condition 70 mm print with 6 track stereo sound among 1200 fans in theater on the first day ( It came late to Madras on Dec 5th 1975). Only time I felt that it is not all original was when I watched the train scene of the English western and learnt the thrilling scenes and angles were carbon copy. Still for a Hindi movie at that time it was breath taking.\n\nAfter this many years I still enjoy ( remember the lines of this movie despite the fact that I don't speak Hindi ) . In fact my entire vocobulary of Hindi will have 80% for words spoken in this movie. For a 3hr 15 mins movie, not much was spoken.\n\nThe alternate ending being shown now does not really matter anymore. It would have been a hit whichever way it ended."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Pratik112",
        "review_rating": "10",
        "review_title": "The Biggest Hit of 1975 and an old time classic",
        "review_detailed_main": "\"Sholay\" means \"Flames\" and this is what the Sippys were able show in this movie, which had a multi cast: Dharmendra, Amitabh Bachchan, Hema Malini, Jaya Bachchan, Amjad Khan as \"Gabbar Singh\" and Sanjeev Kumar. The other members of the cast include: Asrani, Jagdeep and the late Keshto Mukerjee.\n\nA Thakur, a former Police officer, hires two small time criminals, whom he had captured once, Jai and Veeru, to capture the most wanted bandit, Gabbar Singh, who had killed almost all members of his family and left him with a widowed daughter - in - law. The bandit and his men are also terrorising the villagers. Jai and Veeru except the deal offered to them that they must capture Gabbar Singh alive. But all the time, they try and make arrangements to loot the Thakur's \"safe\" and run away with the money until the daughter - in - law catches them trying to open the safe.\n\nHowever, after an encounter with Gabbar and his men, Jai and Veeru inform Thakur that they are no longer interested in capturing Gabbar Singh, as they could no longer do the job for a men who is not prepared to grab hold of a weapon to try and help them. It is then that they realise that Thakur's hands were cut off by Gabbar after he killed the family members.\n\nThis has some of the most memorable dialogues: Gabbar to one of his men,\"Abh Tera Kya Hoga Kaliya?\" There were only two of them and three of you!But you still came back, thinking that, I, your leader will congratulate you and be happy!\"\n\nVeeru to Gabbar Singh: \"Gabbar Singh! I am coming.\" Thakur to Gabbar Singh during the final encounter: \"My legs are more than enough for you!\" \"Give me those hands Gabbar.\"\n\nThe songs, the story, the acting and not to mention the script by Salim - Javed is brilliant as are the songs and especially \"Mehbooba Mehbooba,\" sung by the late R.D. Burman.\n\nA good family entertainment.\n\nIn the re - make of this classic 1975 hit, Amitabh Bachchan is to play the role of a modern day Gabbar Singh, while his son, Abhishek is no longer playing the part of Jai but is playing the part of Jalal Agha, singing \"Mehbooba Mehbooba\" with Urmila Matondkar is to perform the dance sequence, while Amitabh sits and watches.Ajay Devgan the role of Veeru. The part of Basanti is being played by Nisha Kothari and Sushmita Sen, the part of Radha - the widowed daughter - in - law. The exception here is that the name \"Radha\" will not be used, instead she will be known as \"Devi\" who will not be the daughter - in - law, but instead she will be the former inspector's brother's widow."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "BiswajitSince2005",
        "review_rating": "10",
        "review_title": "Kitne Aadmi The....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "balasrini",
        "review_rating": "10",
        "review_title": "One of the best movies ever made",
        "review_detailed_main": "Sholay is one of the best Indian movies ever made. Every cast fits the role to perfection be in Amitabh as Jay or Dharm as Veeru or Hasrani as the cop or ..... the list is never ending. A movie worth watching 100 times with some great stuff music from RD.Fights which are the best ever made in Indian history. The climax wonderful, the work excellent its got no flaws what so ever. This movie when aired on screens just keeps getting revenue. Even now it did.A movie which changed the life of Bachhan moving him to the no 1 spot from where on Bachan went on to become all time best. Sippy needs special admiration for remaking this western classic in a very special Indian way"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "MoneyMagnet",
        "review_rating": "8",
        "review_title": "Terrific",
        "review_detailed_main": "Just wanted to add the perspective of someone who didn't grow up watching Indian movies: This is terrific entertainment.\n\nMaybe you're new to Bollywood movies... maybe you like the newer movies and aren't sure if you would like one from the '70s. Trust me, you can't go wrong with SHOLAY. This is Hindi film-making at its best. High production values (even for the '70s), a great buddy story, a smooth villain, exciting stunts, amazing camera work, and the musical numbers are very entertaining even without the subtitles.\n\nThey just don't make 'em like this any more... in Bollywood OR Hollywood!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "desiensus",
        "review_rating": "",
        "review_title": "Bollywood Western",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "briancham1994",
        "review_rating": "7",
        "review_title": "Indian Western",
        "review_detailed_main": "Taking cues from the spaghetti Western genre, Sholay is an early example of the Indian \"masala film\" combining many influences. At heart it's a buddy comedy with two bumbling thieves, but there is also a cheesy romance and hard hitting gangster backstory. At times the film struggles to balance these three subplots and often veers into bloated scenes and tonal inconsistency, but overall, it is a fine watch that really sells the friendship of the protagonists against the odds."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "riddhijoshi",
        "review_rating": "10",
        "review_title": "Probably one of the best Indian movies ever made",
        "review_detailed_main": "Before I review this movie..Id like to make a statement: Indian, especially Hindi movies will not appeal to the western user unless he his very familiar with indian culture /asian culture. Indian movies are very popular in almost the whole world except for the americas, western europe, and south east asia including japan and china.\n\nSholay is probably the most popular hindi movie ever made. It was made in 1975 and played a very important part in establishing amitabh bachhan as the superstar of hindi cinema. It made a small time character actor named amjad khan into one of the most famous movie stars in India. The plot is relatively simple and straight forward with the normal love story, violence evil v/s good, etcc in a hindi movie. What makes it outstanding are the brilliant dialogues, the amazing performance especially the ease with which the two lead stars amitabh and dharmendra switch from comedy to action at the drop of the hat. The movie also contains probably the most famous lines delivered in bollywood namely \"Kitne aadmi the?\" or \"How many men were they?\"\n\nIt is an evergreen movie , and even 30 years later it rocks..."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "nayyervampire",
        "review_rating": "1",
        "review_title": "Whole movie is a copied",
        "review_detailed_main": "Why giving such high rating .not a original movie .whole movie is an adaptation from the magnificent seven"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "COOLJAZ",
        "review_rating": "10",
        "review_title": "Truly Breathtaking, a Timeless piece of film making.",
        "review_detailed_main": "An amazing story that encompasses love, hate, adventure, an attempted train robbery, tragedy and pure evil in the personification of Gabbar Singh. The dialogue has become legendary in its own right, from the cowardice of Soorma Bopali and the pompous wit in the form of the \"English\" Jailor, to Jai's deflating discussions with Veeru anmd Gabbar's terrifying words to his henchmen - \"tera kya hoga kaliya?\"."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rfikss",
        "review_rating": "10",
        "review_title": "Was the success of Sholay rely on Gabbar Singh character by Amjad Khan?",
        "review_detailed_main": "Lets talk about Sholay! The moment Sholay is mentioned, honestly the first thing comes into our mind is the \"Gabbar Singh\" with his popular dialog which is remembered until today. I would like to recommend that Sholay was a big hit just because of Gabbar Singh character. There are thousands of movie had been made and non has the Gabbar Singh villain type of quality in it. Fair enough, each character was good in the movie, but i will still stand for the Gabbar character which was wonderfully acted by late Amjad Khan. If the character were to act by some other famous villain of that time, its possible that the film have will some credits definitely, but not as what it achieved by taking Amjad Khan.\n\nSecondly, the character of Thakur Baldev Singh was the second reason's of the success. The other characters of the film has also contributed to the success of the film. The pair of Jay and Veeru was truly spirits of DOSTI. Basanti was just marvelous. Jaya was good and also Satyen Kapuu. Asrani and Jagdeep was real humorous.Their jokes are remembered until today. The Imaam Saab and the Azan scenes, touches millions hearts.The ever fear introduction of Gabbar Singh with the thrilling back ground music are the best entry of a villain ever seen of any Hindi movie.The song Yeh Dosti, Ha Jab Tak Hai Jaan and Mehbooba Mehbooba are the most popular song of the movie. RD.Burman gives great music to the film. Kader Khan - best dialog, Salim Javed - best story and script, Veeru Dev Gun - best action, Ramesh Sippy - Best Direction and all those who was involved in the film has done a very good job ever.Sad that the film was not awarded even millions have watched the film over and over again. It was blockbuster during it time and well remain ever-green movie!\n\nFinally, a complete, good and best film ever made and its impossible that there will be any other film which will be able to over take G.P Sippy SHOLAY from the main chart. Never!A film that should not been miss and worth watching. \"Aur Film Kab Hain? Kab Hain?................. Syaabas!!!\""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "dev_alok",
        "review_rating": "9",
        "review_title": "Best film yet for me",
        "review_detailed_main": "Even after 47 years and repeated viewing of this movie, I still can not find anything that I don't like about this movie. If you have to see just one Hindi movie see this! Every aspect of the movie is superb. Special mentions to acting, music (background), photography and editing."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "bhatian",
        "review_rating": "10",
        "review_title": "Best Indian Film Ever",
        "review_detailed_main": "Excellent characterization, acting, scripting, directing, and cinematography all put together in this film brings out the best film ever made in India.\n\nThe film story line is very simple, yet very interesting to watch. Acting and dialogs in this film hold a very high caliber according to various film aficionado's. The film is about two young men hired to stop a group of bandits in a small village.\n\nI especially recommend every film student to watch this film at least twice in order to grasp the tradition of quality film-making. \"Sholay\" has a winning formula which is rare to find in todays film-making.\n\nWatch it! SCORE: 10/10"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "info-namdev",
        "review_rating": "10",
        "review_title": "Movie of a LifeTime",
        "review_detailed_main": "All in all a complete movie consisting of Wonderful Action, Drama, Best Comedy, Great music, awesome screenplay, excellent camera work, Superb Star Cast, well directed, extremely well acted , well scripted dialogs and I am sure many more things.\n\nFrom the start till the end it was very well narrated. Sanjeev Kumar, Amitabh , Dharmendra, Hema Malini and \"Gabbar Singh\" by Amjad Khan have done more than justice to their role by performing extremely well. RD Burman has scored a great music and writer Duo Salim Javed have done an excellent work in terms of Story & Dialogs.\n\nTo conclude, The Best movie ever made in Bollywood by far."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "dangertoon",
        "review_rating": "9",
        "review_title": "Sholay: A Film That Keeps Calling You Back",
        "review_detailed_main": "+ Direction: This was Ramesh Sippy's first out-and-out action attempt. Every scene has been set-up with a lot of thought and it shows. The character treatment is one thing that is also quite unique about Sippy's direction.\n\n+ The duo of Amitabh and Dharmendra: Where do I start? Amitabh Bacchan plays the straight-faced ex-con. Dharmendra plays the quirky, playful, hopeless romantic. Both characters are poles apart in terms of their personalities, yet so close. So much that they would kill for each other.\n\n+ Gabbar Singh: Any good action/thriller would be incomplete without a good antagonist. Amjad Khan as Gabbar Singh is more than just good in Sholay. Khan plays a dacoit who is feared by the local villagers and is unrelenting in everything he does. Brutal, unforgiving, selfish, savage, barbaric, bloodthirsty, and vengeful. He encompasses all these adjectives and some more.\n\n+ Action: Sholay has some of the most iconic action sequences that excelled in every aspect. Technically sound and so well-executed.\n\n+ Performances: Sanjeev Kumar, Hema Malini and Jaya Bhaduri top the list in this department. Kumar plays the hapless but vengeful Thakur Baldev Singh who is out to do whatever is necessary to get his revenge from Gabbar Singh. Hema Malini plays the local horse-cart driver who lends some much needed comic relief with her never-ending barrage of words. Jaya Bhaduri plays the mellow and unassuming widow to Thakur's late son.\n\n+ Music: Every song compliments that particular moment in the film's timeline in which it features. That said, each one of them is a gem. Essentially 70's RD Burman in every sense.\n\n\n\nSholay can be termed as the first Westerner-inspired action classic, custom made for Bollywood. In essence, Sholay is a true blue revenge-action film. A film that gained cult status over these years. It shall always be the film that inspired many to at least try and make a film that can rule the hearts of millions.\n\nEvery scene is a gem. Be it Jai and Veeru's first tonga ride with Basanti, Gabbar's reprimand when his cronies return empty-handed from the village, the Holi massacre and the subsequent scene with Thakur and Gabbar, the train shootout, or the climax. The list is just endless to be honest.\n\nYours truly is guilty of having watched this gem many times over. There's no keeping count anymore. And one can't be blamed for it. It's a film that keeps calling you back."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "suresh_krishnan1961",
        "review_rating": "8",
        "review_title": "Some major Goofs",
        "review_detailed_main": "One of the greatest movies ever made, no doubt. I have seen this movies some umpteen times in my life, was just 14 when I saw this movie in 1975. Downloaded a DVD (XVID) version from internet (Director's Cut Version) 205 Min's. One of the major goofs I noted is (which is also there in the actual theater release). Now for the GOOF\u0085Jai and Veeru are fighting the last encounter with the bandits. Jai is left alone to fight the bandits and he is using both the hands for holding the guns and pistols, keeps firing from them regularly. Later Veeru returns and holds Jai in his arms, during that period you can see Jai's both palms in open position, there are many shots and for many minutes that shows his open palm, but at the end Veeru is seen picking up the \"Magic\" coin from one of Jai's closed fist. Can a dead man take out a coin from his pocket and hold it, nor can a person use guns holding a coin in his palms ? When Basanthi is being chased by bandits, while crossing the wooden bridge she does a small stunt, she moves the horse cart and breaks down the bridge and moves ahead, so the bandits are forced to take a detour to catch her. Veeru follows them and also find the bridge broken and takes a detour. Both Basanti and Veeru are caught by the bandits and Jai rescues them later. While returning after being saved by Jai from Gabbar's den, Veeru, Basanti and Jai are seen crossing the same bridge which is FULLY intact. Also just before the final climax the bridge is seen FULLY intact before the bridge is blown off by the bomb thrown by a bandit. During that fight the bridge does not have any dead bandit, but when Veeru is seen riding a horse to have a dual with Gabbar, crosses the same blown off bridge you can note a dead bandit lying on the bridge. (TWO MAJOR GOOFS in an important climax of a great movie)"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "raja_dlx",
        "review_rating": "",
        "review_title": "A brlliently produced epic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "areehal",
        "review_rating": "1",
        "review_title": "Woefully pathetic curry western",
        "review_detailed_main": "Unashamedly plagiarises spaghetti westerns. Cliched, over-the-top, 1-dimensional heroes and villains. Glorifies violence against women. Director desperately wanted to make a movie that would be accepted in the west. Unfortunately, an utter lack of talent and vision meant that the best he could do was steal scenes from other films and string them into a cheap melodramatic hodge-podge. The only bad film that the brilliant Indian actress Jaya Bhadhuri has participated in. This film makes me ashamed to have an Indian ancestery."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "mykkanwar",
        "review_rating": "10",
        "review_title": "Indian Movie of The Millennium",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jen-122-636160",
        "review_rating": "9",
        "review_title": "This is why I love Indian movies",
        "review_detailed_main": "They even do spaghetti westerns better than we do!!!\n\nDespite a couple of sloppy visual mistakes (you can see the coupling towing a motorcycle and towards the end an assistant peeks his head up behind a bush behind a very pivotal scene), this is an excellent movie.\n\nThe acting is fabulous. The plot line engaging. The horse chases are amazing. There is a horse chase with a train, horse chasing carriages, bridges being destroyed. A guy taking a horse down with his bare hands!\n\nIt is filmed in a location with large rock formations - like the Vasquez rocks where so many US westerns were filmed so that the shootouts have that same western feel. It even has an Ennio Morricone style soundtrack! But I don't ever remember being this emotionally engaged - on the edge of my seat biting my fingernails with tension engaged - watching a Sergio Leone movie. And I love Sergio Leone.\n\nThe bad guy is crazy bad. The good guy is crazy too - his final scene where he fights the bad guy unarmed - you would NEVER see that in a US movie.\n\nThe story is heartbreaking at the end - I cried. Not as much as I do when reading a Zane Grey novel - but still - it's pretty heartbreaking and so well acted!!!\n\nMy one request is for someone good, like Vinod Chopra, to remake this movie starring Abhishek and Faran Akhtar. And I know this movie is so good no one wants to remake it, but ... the remake of Don with SRK is excellent and even better than the original. And I hear the remake of Agneepath is excellent too. With the right director and cast - yeah - I totally want to see what Abhishek does with the role!! And Faran - yeah- him too! What would make my fantasy remake of this movie complete? Amitabh in the role of Thukar.\n\nThis movie is a perfect example of why I've pretty much stopped watching western movies. Indian movies are better. Even their westerns are better!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "Nice movie!",
        "review_detailed_main": "The 3D version of this all-time classic should work for two reasons: One, the simplicity on display, when one compares it with the recent releases that are infested with VFX. Two, the invigorating and revitalizing drama writers: Salim-Javed that leaves you awestruck, even though you may have lost count of the number of times you've watched this incredible entertainer. With 3D, every pivotal character stands out quite literally in the film. On the whole, there are films and there is SHOLAY. Frankly, it would be sacrilegious to miss this classic. Watch it. Now.The 3D conversion could've been more polished for a film of this stature. Still, the effect is spellbinding. The train sequence still the best train sequence ever shot in Hindi cinema is the highlight – new effects have been added to enhance the 3D element. With a length of over 3 hours, the 3D gets tiresome in parts but the sheer grandeur of the film keeps you going. India's epic adventure is back – rush to the screens now!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "shubham-mittal91",
        "review_rating": "10",
        "review_title": "Entertainment, Entertainment, Entertainment",
        "review_detailed_main": "I don't know from where to start. Sholay is a perfect blending of all spices and makes it a delicious curry which you want to have again and again. It has Emotion , Drama , Romance , Action, and what not , you name it and this movie has it. Though a little lengthy, but one won't mind as it never ceases to entertain at any point of time. I don't reckon a single movie where every character becomes legend irrespective of their screen presence.\n\nThis movie works on concept of 3E's which is Entertainment, Entertainment, Entertainment and makes it an epic. I am short of adjectives for this movie. Mesmerising at its best, flawless , perfect etc. etc.\n\nIf you haven't watched it , do yourself a favor and add it your bucket list. I am sure you will regret it for not having it watched earlier."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sumankumarganguly-454-264875",
        "review_rating": "9",
        "review_title": "The Bible of Mainstream Cinema!",
        "review_detailed_main": "(Reviewed on the basis of watching on VCD 30 years after release)\n\nPlot: Two petty thieves are hired by an ex-policeman to capture a most- wanted bandit. Will they succeed in the toughest mission of their life?\n\nReview: The 70's decade is considered the 'golden era of Bollywood'. If that's true, then 'Sholay' is it's brightest jewel! Honestly, this film can't be rated or reviewed; but I offer this as a humble tribute as to what this writer thought of this film which is much more than just cinema.\n\nIt is widely believed, what is there in this world is there in the 'Mahabharata' and what is not in it, is nowhere. The same ideology applies in the case of 'Sholay'. All possible spices that one can add in a mainstream potboiler is present in this film and nothing else could have been added more. It boasts of everything in top quality with the whole cast & crew in top form.\n\nFirst the star cast comprising of 3 top heroes and 2 heroines with a newcomer villain who turns out to be the biggest star of all, Amjad Khan. But unlike other multi-starers all the stars have roles which fit them to the tee; and what performances they deliver! Did Sanjeev Kumar ever let us feel that he is actually two decades younger than 'Thakur'; or that Amjad was a débutante? Dharmendra and Hema Malini are naturals as the effusive and bubbly 'Veeru' and 'Basanti' respectively. But Amitabh and Jaya as 'Jai' and 'Radha' are revelations. They manage to leave a lasting impression with their body language and personality despite limited dialogs. But the best part is that even the small roles of A.K.Hangal, Asrani and Jagdeep also become memorable.\n\nDirector Ramesh Sippy excelled in his choice of locations for 'Ramgarh' with the dry, hilly, rocky terrain of Rama Nagar creating a village- scape that one never saw previously in Bollywood. One hardly sees the cliché sights of river-banks and farmlands depicting villages in other films. The way he handled the scene of Gabbar attacking Thakur's family was masterful. The action scenes, especially where Jai fends the goons alone, is executed realistically and at occasions innovative. He inducts a new style of direction.\n\nThe script by Salim-Javed is a master-piece. It has all ingredients of action, 2 contrasting kinds of romance, tragedy, comedy and social message (widow re-marriage). Even the small characters become a highlight. And equally immortal are the dialogs ranging from hilarious to bone-chilling, especially Gabbar's. We know we are in for a treat when at the start, the officer delivers this gem:'I don't know what work you have for them, but I know they are absolutely of no work.' The only loophole being the inaction of police who despite knowledge of Gabbar's hideout don't mount an attack on him; instead they announce rewards for others to catch him!\n\nR.D.Burman as usual delivers with 'yeh dosti','mehbooba' and 'haan jab tak hain jaan'. But his background score outscores his songs with the opening theme, Jai's mouth-organ melody and the screeching sound of a swing when Thakur sees his family. He must also be lauded for not giving any music in the scene where Jai alone fends the goons. It lend-ed a superb eerie feel to raise the tension!\n\nSpecial mention must also be made of Dwarka Divecha for his riveting camera-work (especially in the train sequence which in itself is a highlight), the foreign fight-masters and choreographer P.L.Raj for his innovative sequences especially in 'Yeh dosti'.\n\n'Sholay' set new standards in all departments of film-making. If the world were to end this year, then this is the film one must watch before leaving.\n\nBox Office Verdict: Despite a lukewarm opening due to lackluster reviews and posters(the only low point of the film with the only person recognizable being Amjad, a débutante!) the film expectedly broke all records. But more important is the cult status it has attained in the minds of all Indians with all the characters, songs and of-course the dialogs(specially 'yeh haath mujhe de de Thakur') getting iconic status. Above all you can't be an Indian if you haven't seen 'SHOLAY'!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Quinoa1984",
        "review_rating": "9",
        "review_title": "A total blast that exceeds expectations; Leone and Kurosawa would have dug it if they saw it",
        "review_detailed_main": "Veeru and Jai- Bachchan and Dharmendra, two men who would take your wife and my wife within five minutes and what position would we be in to argue, like why are yoy booing them they're right- are the leads in one of the more unabashedly entertaining, and totally transparent in how the makers wear their influences on sleeves and pant legs and even off of sideburns and big (and small) mustaches and scraggly evil-beards, motion picture epics of the 1970s.\n\nWhat's so much fun here is that the director, Ramesh Sippy (and that's so cool that I could, and I'm sure others have already, write about the oeuvre of a Mr. Sippy), loves giant personalities for his cast of characters, whether it's our intrepid anti-hero outlaws (essentially hired for a revenge plot, though not without some reason - think a much dirtier Spaghetti Western knock off take on the Magnificent 7... er here the Magnificent 2), and the one man who is playing it deadly seriously, Sanjeev Kumar as ex cop and pissed-off armless rich-guy Thakur Baldev Singh (he's such a BFD he has three names), is intimidating as a heart attack.\n\nIt's a movie that was made in that magical, rough and tumble time where if they wanted to have a dozen or so men on horses chasing after a train and then Veeru and Jai have to get out of their jam and fight like hell and get whats there's, it had to be done all practically and Sippy stages and edits everything together for not like Peckinpah viscera but just more of a slambang action-adventure spectacle. It's one of those times like with RRR where it's not only something that should be seen in a theater (in this case I had to settle for a decent but unrestored full screen dvd) but that should have a massive crowd to laugh and hoot and holler and be on the side of that one lady with the horses who won't shut her mouth.\n\nSholay is certainly far from subtle, and matter of fact it is so many things packed into 204 minutes, not least of which Exploitation with a capital E (but Exploitation you coild watch with your grandma), but it is that sweet spot of being a full-bodied epic that is completely charming when it comes to how the characters interact and throw themselves into the emotion of the moment. Or, charming when it isn't dangerous or suspenseful in that way Leone got so well down; you are sometimes on the edge of your seat not simply for what is in the scene but for how long the filmmakers extend a moment or a look or how long it takes for a gun to go off. You almost get so caught up with the story that the songs and musical mumbers (all high quality for this or any period of Bollywood) become a pleasant surprise.\n\nThis should get a restoration Stat - I want my Greasy A-Hole Vllains doing the Big Evil Laughing-for-a-minute-straight in 4K, dangnabbit! (Or, if not that, a revival 70mm screening near me)"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "kundanbbisht",
        "review_rating": "10",
        "review_title": "Epic",
        "review_detailed_main": "Epic and vintage. Was a masterpiece. From story to characters everything was just too perfect."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Overlong but epic Indian western with iconic villain",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "artzau",
        "review_rating": "2",
        "review_title": "Disappointing to the max **SPOILER**",
        "review_detailed_main": "The great \"curry\" version of a western is hardly a saga. The entire film wanders trying to define itself. Is it a comedy? Is it slapstick? Is it serious? A thriller? A cops and robbers? Or, is it a musical? Frankly, this film proves that it can't be all things and becomes a confused mass of people scrambling through cardboard settings in a slow developing plot burdened with sidetracks and one non sequitur after another. The stereotyped characters become caricatures of themselves as the plot slowly drags on. On the positive side, there are charming scenes of the Indian countryside and the actors seem to be having a good time. Also, there are many cultural puns which can explain its appeal to its Indian audience. However, to compare this montage of confused and confusing images with its muddle of traditional and western images to Sergio Leone's dark films is way off the mark."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jawedjhms",
        "review_rating": "10",
        "review_title": "5 Star Entertainer head line given by Deccan Chronicle in 05-10-1975 movie review",
        "review_detailed_main": "This blockbuster movie Released in Hyderabad on 03-10-1975 in these Theaters (Ramakrishna 70mm print - Skyline - Alka -Shanti- Natraj 70mm - Shobhna - Kamal) first i saw this movie when i was 9 years old in Manohar theater Secunderabad"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Vartiainen",
        "review_rating": "8",
        "review_title": "The Great Indian Western",
        "review_detailed_main": "Sholay is probably the crowning achievement of the so called Curry Western genre, meaning films that imitate the American western genre without being made in the US. Curry Western of course being a play on Spaghetti Western, westerns made in Italy.\n\nSholay is the story of two close friends, Veeru (Dharmendra) and Jai (Amitabh Bachchan). They're criminals, outlaws and con artists, as well as quite credible gunmen, who end up being recruited by their one time adversary, police officer Thakur (Sanjeev Kumar), who wants them to protect his village from a demented criminal, Gabbar Singh (Amjad Khan), and his band of outlaws. At first the two are quite reluctant, but slowly the idyllic mountain village and its people win them over.\n\nSholay is an epic. Much like the Dollars trilogy by Sergio Leone, it takes its sweet time, allowing us to get to know its main characters. Yet it knows how to pace itself. There's just enough action, character drama, moodiness and atmosphere to make the film feel dynamic, always in motion. And yet there's tranquility to it, underneath which lurks violence.\n\nI like the characters most of all. Veeru and Jai are rogues. Utterly likable, charming and outside the boundaries of law, yet there's something dangerous about them. Thakur is dignified and steadfast, whereas Gabbar is all sevens shades of crazy.\n\nIf I had to name a flaw, I would point out that the female characters are rather outdated and sexist. Hema Malini as Basanti, a local girl who operates the local horse cart service, is the only one of them to rise above clichés and quiet, forlorn sighs, but she alone is not enough to save this film from being a completely and utter sausage fest.\n\nBasanti as a character is awesome, though. Make no mistake.\n\nNevertheless, Sholay is a great film. One of the best westerns I've seen and easily in my Top Five Indian films."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "mrigchopra",
        "review_rating": "9",
        "review_title": "Superb Movie....my all time favourite",
        "review_detailed_main": "One of the best ever made in Hindi. The camera work is flawless and grips you. The acting is inspired. The music is memorable. One of the movies you remember for life. CULT FILM......Rating 9/10"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "pankajchopra-83067",
        "review_rating": "10",
        "review_title": "Eternal classic",
        "review_detailed_main": "Amjad khan, Dharmendra, Sanjeev Kumar, RD Burman! Brilliant direction."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Paakhi",
        "review_rating": "10",
        "review_title": "Basanti in kutto ke samne mat naachna !",
        "review_detailed_main": "Legends, Story, Dancing, Beautiful Hema Basanti, Funny Dharam paaji Viru, what a villian Amjad Khan Gabbar Singh, most talented Sanjiv Kumar Thakhur sahab every supporting artist, be it Viju Khote, Sachin, Hangal, Lila Mishra, Jalal Aga, or even those whose names I don't know and of course watch for charismatic Mr, Amithabh Bachchan, the brooding Jai. Generations will come and go, see this movie and learn how to have fun with friends, stand for friends, maasti of Love, colours of holi, horse riding, explosions, and eternal sacrifice.\n\nSorry Jaya Bachchan don't remember your character name..haaaa... I think you are the only one who could easily have been replaced by any other heroine during that time like Sharmila, Rakhi, Nitu, Nanda, Sadhana, Mumtaz anyone at all really and it would have made no difference to the movie at all..:-( Who knows they would have even left a mark in the movie, unlike you.."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "subhamchourasia",
        "review_rating": "10",
        "review_title": "ONE OF THE MOST EPIC MOVIE",
        "review_detailed_main": "Review? I can write a whole book on this movie I mean movies like this comes once in a decade This movie has everything like #DRAMA #ROMANCE #COMEDY #TRAGEDY #ACTION songs of this movies are also great And dialogue s of this movies are EPIC"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "ghias-azam2",
        "review_rating": "10",
        "review_title": "Brilliant.",
        "review_detailed_main": "So many on here just complaining and most of them with a pre-conceived dislike of bollywood movies, just heard it's highly rated and give it a go. It's long, there's songs and it's camp. It's supposed to be like that and you watch it as entertainment, it's not supposed to be watched as something factual. Plagiarism? Maybe but those westerns were themselves lifted from elsewhere, Kurosawa anyone? If I were to watch The Lion King and in my review said that I just sat through almost two hours of drawing of animals AND THEY TALK!!! Are you kidding me? You get the idea."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rabani",
        "review_rating": "",
        "review_title": "The dynamic duo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "arjunrajkss",
        "review_rating": "2",
        "review_title": "Boring and disappointment",
        "review_detailed_main": "This movie might have been a bit when it released. I just watched it now and find it very boring. Even the stunts are not logical. So many loop holes. There are too many unnecessary scenes. If they have cut it out then it would not have 3 hrs length."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "mankshar",
        "review_rating": "10",
        "review_title": "Best",
        "review_detailed_main": "Best, Best, Best, Best, Best, Best, Best, Best,Best, Best, Best, Best,"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "economistchinmay",
        "review_rating": "10",
        "review_title": "Best 10 Movies (and 11th too!)",
        "review_detailed_main": "Best 10 Movies\n\nPather Panchali, Bandini, Saaransh, Shole, Shakti, Anand, Awaara, Satya, Golmaal, Hera-Pheri.\n\nand 11th Shwas (Marathi Movie!)\n\nBasically, whether a person likes a movie or not is subjective. Still, there are certain guidelines to rate a movie. The subject of the movie (Pather Panchali, Bandini, Saaransh), the way it is presented (Awaara), production quality (that is why I discarded Andaaz apana apana), camera angles (Shole is best in this section but satya, aawaara are great too!), the dramatization of the subject (Shakti, Anand) are some of the elements that makes a movie great. Comedy is one of the hardest skill to acquire and perform. That is why I included Golmaal and Hera-Pheri. The seemingly easy subject are presented in such a hilarious ways that these movies definitely deserve accolades.\n\nShwas is my personal favourite. It is a Marathi movie. And the story is about a grandfather and his 6 years old grandson, who is about to loose his eyesight due to rare cancer."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Popeye-16",
        "review_rating": "10",
        "review_title": "Unique concoction of all movie ingredients to create an Icon in Indian Cinema",
        "review_detailed_main": "This is a fantastic movie and a must watch for all movie lovers. Although the ending is somewhat sad (in my opinion) the movie is an icon for Indian cinema. Never before had any single movie brought together such great actors and given each actor a lead role. The characters in the movie are very powerful and very well depicted. The theme of the movie was also very refreshing and the dialogues of the movie have been etched in each and every mind. Furthermore the songs are very melodic. It would have been fantastic had the movie been available on DVD."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "worldphrase",
        "review_rating": "10",
        "review_title": "Apex Success of the Silver Screen",
        "review_detailed_main": "Absolutely phenomenal success. Nearly 70% of Indian population has seen the movie at least once. If were to count people having seen more than once, number of hours watched of this movie crosses 14 billion hours!! Currency converted value, it has garnered nearly 150 million USD, plus equal amount is black market. All needed now is to have superb sound in 3D Surround, and this movie will fetch another 500 million USD, as Bollywood is getting much needed exposure to global consumers. I am very sure this movie will remain most watched movie in the cinema world for ever, as its charm has not vanished, at least in South Asian viewers."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "cxw1065",
        "review_rating": "10",
        "review_title": "a wonderful fulfilling film",
        "review_detailed_main": "I love this movie, it has everything: a bit of humour, some romance, a tragic ending, a happy ending and also that undefinable something that gives a film Magic! The stars were never better, and Salim-Javed were at the peak of their powers in providing the script for this movie. It's simply the best!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rupanisp",
        "review_rating": "10",
        "review_title": "Something very Big....",
        "review_detailed_main": "I still remember that day on which it was released in 1975 (around\n\nAugust 15).\n\nSold out for three weeks in advance....\n\nMy Father along with my Uncle got a pass to see to it on First day...\n\nDharmendra came and sat beside them...\n\nIt was very unusual....\n\nI had a experience of my life time in New Excelsior (70 mm) when I\n\nsaw it for second time... First time in Badal...\n\nRamesh Sippy's best ever...\n\nWell written. Well Directed...\n\nBut the most important thing was very well released....\n\nDialogues and Songs were running in markets well before\n\nrelease...\n\nPeople were very impatient for its release....\n\nIt was my first time in New Excelsior Cinema...\n\nCouple of Samosas and Chicken Sandwich ( with Lettuce ) made\n\nme very happy....\n\nThanks and Regards.\n\nSam Rupani\n\nHouston, Texas, United States of America.\n\nJanuary 26, 2003. 1:35 PM. Houston Time."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "pimukherjee",
        "review_rating": "9",
        "review_title": "An unparalleled cinematic experience",
        "review_detailed_main": "The \"Godfather\" of hindi movies. It has all the ingridients of a masterpiece....memorable scenes, bavura performances, dialogs which are more popular than the country anthem and a music score which is ageless.\n\nSippy manages to make a simple cops and robbers plot into dynamite. A triumph for all involved."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "saurabh",
        "review_rating": "",
        "review_title": "The Super Masala of Indian Film Industry",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "yatinsrivastava",
        "review_rating": "3",
        "review_title": "Overhyped",
        "review_detailed_main": "I remember buying the DVD for this cult classic,but I was hugely disappointed. The movie is marred by overacting,over the top scenes. I guess such loud acting was the norm back in the day but personally I wasn't impressed at all given the mountain of expectations this movie comes with. This is your typical Bollywood \"masterpiece\", don't expect good cinema,that's all."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "eklavya-cwk",
        "review_rating": "10",
        "review_title": "how good is it?..... Damn man, its the epic we are talking about",
        "review_detailed_main": "Yeah Sholay or amber draws its cinematography from western spaghetti movie genre but this movie is a epic in its own respect. Amazingly multi layered, multi styled, multi varied yet singly packed this film is one blasting bomb of cinema.\n\nIf you loved Once upon a time in west, the good the bad and the ugly then this movie is a step cohesive with them in a whole different style and still packed with much more enriching entertainment and music that can't be forgotten in many centuries. Number of attempts have been made to make a successful western styled movie where movies like unforgiven failed (though they win Oscar when they don't have much competition that year and were made in the USA) but nothing and never will any movie be made that can invoke this style and make a huge lot of progress in its shot.\n\n'Masala film' is the nick name given to its effect because this movie provides you with one of the best tonic of involvement and entertainment. Extremely well-made, beautifully edited, amazingly written, melodiously sung, damningly acted and truly evolved , Sholay is a movie for human beings."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "mohanty-sambit",
        "review_rating": "10",
        "review_title": "diamonds are forever",
        "review_detailed_main": "released on 15th august 1975 ,29th anniversary of Indian independence,SHOLAy ran in theatres for over five years,and altered the course of Indian cinema.even today it remains box office gold standard:a reference point for both the Indian film going audience and the film industry.because SHOLAY is not merely a film,it is the ultimate classic:it is myth.the characters Jai,Veeru,Gabbar,Thakur,Smbha,Radha,Vasathi,Jailer,Soorma bhopali-are the stuff of folklore.even the animal,Dhanno,the mare,is immortal. sholay grossed 35 crores in its first run,an unimaginable amount at that time.in its rerun in 80s it doubled its previous distributer price.its tickets were priceless,where other hit films tickets were blacked for 15-20 rs,it crossed 100rupees mark quite easily to an willing audience who were ready to pay the sum. the story is about a police inspector whose family gets massacred by a dacoit,the dreaded GABBAR.he hires two crooks JAI ,VEERu to catch GABBAR alive for him.like VEERU tells in one of the popular dialogues of the film,the story contains emotion,comedy,drama,tragedy all in all.probably world cinema's only character SAMBHA ,is the only character to be immortalized by only one line\"poorey pachas hazar\". like diamonds SHOLAY is forever."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "seephothi",
        "review_rating": "10",
        "review_title": "The film for everyone!!!",
        "review_detailed_main": "This film is for everyone, has everything you would want from a film and will never cease to amaze you however many times you watch it.\n\nThe music captures you from the first song to the last, the action is breathtaking, the romance subtle and in you face with the two love stories respectively. The drama and suspense has you sitting on the edge of your seat and I defy anybody not to have a tear in the eye when Jai is close to death and the slow version of dhosti is played over the scene. The comic timing of the characters is excellent, Dharamendra is brilliant, Amitabh is wonderfully moody, Hema is stunning and Amjad is the best baddie in any film ever! All in all, the best bollywood movie of all time, introduced countless people to bollywood and kept them. Nothing better, before or since..."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "toecutter-2",
        "review_rating": "",
        "review_title": "get your geography straight!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "gk303007",
        "review_rating": "10",
        "review_title": "Perfect",
        "review_detailed_main": "Let me write crisp and factual details of the film. 1. A film whose every dialogue is famous. 2. First flop then blockbuster and later a cult. 3. Each and every character is famous in one way or the other. 4. All songs are above average. 5. Copied concept from The Seven Samurai and yet original. 6. I think the last climax scenes are real emotional and best movies fail to portray such instances. 7. A film which can never be remade. 8. If you haven't watched it, you are missing something in life.\n\nA must watch."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "hXz0r3",
        "review_rating": "10",
        "review_title": "Few Epics like this can never be re-made.",
        "review_detailed_main": "10/10 and still a gem for people who belong to 80s/90s era.. Comedy is still hilarious with dialogue delivery on required scenes."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "kakir_jk",
        "review_rating": "10",
        "review_title": "An all time best movie!",
        "review_detailed_main": "I have seen this movie myself many times and I loved it. The main reason why this movie is considered the one of the best in Bollywood is the time in which it was made. It was made during the 70's where blockbuster movies were in much much more demand than critically acclaimed ones. This movie combined the effects of both. It has an engaging and nice plot with a bit of suspense , romance , comedy , plenty of action , brilliant music , superb acting and some moral lessons(SOME). It's excellent dialogues have become very popular in India where the majority of the population is aware of them and you can say that an Indian movie goer comes to age by watching this movie [ and a few others such as Mother India , 3 idiots , etc]. This is a must watch movie in my opinion. People of today may not like it so much but if you some other movies of the 70's , go back a little in time to the India in the 70's and perhaps you will simply fall in love with the movie."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "abhi-16044",
        "review_rating": "10",
        "review_title": "All time best movie of Bollywood !",
        "review_detailed_main": "No movie can be the best movie of bollywood other than this.\n\nJust watch it, nothing to say more.\n\nI watched it more than 3 to 5 times but it never feels like outdated or boring."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "gurdeepmann59",
        "review_rating": "5",
        "review_title": "The greatest story ever told with the greatest cast",
        "review_detailed_main": "This was a great movie with action, comedy and romance all perfectly blended together\n\nThe movie has Sanjeev Kumar recruiting two crooks Dharmendra and Amitabh to avenge the death of his family which happened because of the notorious dacoit Gabbar Singh\n\nDharmendra was quite funny and so was Hema Malini Both of them shared some amazing chemistry Amjad Khan will always be remembered for his menacing role Jaya Bhaduri hardly said anything in her widow role Amitabh Bachchan was memorable for being calm unlike Dharmendra's lively personality"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Manu_Srinivasan",
        "review_rating": "",
        "review_title": "\"Gone With The Wind\" of India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "10",
        "review_title": "A all time classic",
        "review_detailed_main": "I heard it is copied from about 5 different movies. But sholay is an absolute masterpiece no question about that. It took about 5 long years to make if I'm not wrong. It opened below expectations in cinemas but it picked up eventually as it should have done. I've been watching this film sins my kiddie days. I dont know how many times I must have watched it over the years. Just recently I watched a 3d remastered version of sholay. They did a fantastic job with it and it was the right choice to re-release it in selected cinemas when they bought out the remastered version. Sholay simply never gets old or boring. There are plenty of films that I enjoyed so many times and ended up getting my self bored of them, but that has never happened with sholay. I couldn't give it any less ratings then 10/10."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "adambenjamingibbons",
        "review_rating": "10",
        "review_title": "Seriously flawed but still 10.",
        "review_detailed_main": "One of my favourite films. There is a review on here titled \"Lame, but can easily be transformed to flame.\" The review has only 2 out of 7 marked as helpful but it is spot on. In the review they have spoken about editing out scenes and songs and making a shorter better film. The songs they removed are the worst 3 and the scenes are ones, which spoil the film. I do not doubt for 1 minute that this imdb users version is better than the original. Sholay has potential to be amazing and this user made it amazing by the sound of things. Unfortunately I don't have this edit and have to cringe through the unbearable scenes. R D Burman did 3 great songs here and the film is amazing but the jail arc, the colour dance and some of the other cheesy scenes and songs have no place ruining this great film. I would be embarrassed to recommend to a friend, the whole jail thing would result in a harmony of \"turn it off, now.\" The jail scene, bike scene and the dozy horse girl scenes, seriously, what were they thinking?\n\nThe intro music is really memorable, the fighting scenes are great action scenes. The villain is one scary dude. You look at Gabor and you think damn this guy looks hard as nails. The characters for the most part are really likeable. I think this is a stand out feature that the characters are so different yet all rather likeable.\n\nGive it a try but expect a film charged with emotion, cliche and cheese. It is not a masterpiece of cinema but it is a masterpiece."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jibreelgilani",
        "review_rating": "9",
        "review_title": "Amazing Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "tinkugho",
        "review_rating": "9",
        "review_title": "The one and only epic of the Indian Cinema",
        "review_detailed_main": "The one and only epic of the Indian Cinema.Each and every dialogue of this movie were now a days treated as Popular proverbs. Gabbar,Jay-Veeru,Thakur, Basanti these characters are Just irreplaceable."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Lavnishkrsharma",
        "review_rating": "10",
        "review_title": "No Reviews",
        "review_detailed_main": "Writing a review of this movie will be a disrespect to the actors, directors, writers, musicians and all those persons who have contributed their lives into this movie. This movie is a master piece and no critic can ever deny this."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rajesh_kaul_the_friendly",
        "review_rating": "9",
        "review_title": "One of the best movies in the 70's decade",
        "review_detailed_main": "Well, what can I say, its a film with multiple emotions, Humour, Action, Drama and Friendship. I would also say its pretty much inspired from the cowboys in Texas those days, but what makes it more original is the Indian background. Therefore in other words, I would say the film is very interesting and a worth watch. The friendship of Jai and Veeru has been shown so strong, it just reminds me some of my old buddies at school.\n\nI remember I was just 11 years old when I saw 'Sholay' in the hall...and now in thiseneration... while watching the DVD again and again, I just go back to my old times. Thanks to the DVD."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "pyasa-sajal",
        "review_rating": "8",
        "review_title": "The movie is a landmark...Gabbar singh remains the most popular character ever",
        "review_detailed_main": "Only non-Indians will say its not a great movie...I wouldn't give it a 10 because my personal favourites are always the realistic and artistic movies...but when it comes to masala movies,there are few movies which are comparable to this movie. Agreed,the movie draws inspiration from many western movies.But thats nothing to be ashamed at.In present days,filmmakers are almost making remakes while copying ideas...that must be avoided but taking inspiration is not bad.moreover what made sholay so successful are the performances..especially the aspect of dialogues and dialogue delivery...now that wasn't copied...the whole actress aspect wasn't lifted and is so much loved. Gabbar sing became a huge huge success...33 years later I played this character in my college fest and I was a star after that.such is the craze level of this character. I agree it isn't that great in technical terms or in matters of storyline..but the fact remains that everything in the movie fits in so perfectly.You can take all the tasty ingredients but unless you have a perfect mixture,you wont have the perfect taste....this is what sholay is...a perfect mixture...That will remain something to be proud of."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Spuzzlightyear",
        "review_rating": "3",
        "review_title": "What??? Am I Missing something???",
        "review_detailed_main": "Lets pause for a moment and talk about the East Indian Movie. I know about these things, and people have been talking about Sholay! like it was the best thing since sliced bread, and well, I would have preferred the sliced bread.\n\nYour typical East Indian move generally has all the plot under the sun, musical numbers aplenty and acting that is extremely laughable. Sholay! does this all about threefold. Yess, for 3 numbing hours, we see the tale of 2 lifelong friends trying to save one hick town from the evil guy (who admittedly, was very good) and while we arent getting flashback after flashback, get entertained by really wild Indian songs. The Colorful day number was cool, but really, this was 3 really long hours!!!!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sanjuz",
        "review_rating": "",
        "review_title": "one of the best - east or west *very slight spoilers*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rachelrose-87356",
        "review_rating": "8",
        "review_title": "Movie Review Profits",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "asdalahymhmd",
        "review_rating": "10",
        "review_title": "The most complete movie in history",
        "review_detailed_main": "Shulai is a film that will never be the same again, a complete and wonderful film."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "hprashantarora",
        "review_rating": "9",
        "review_title": "A legend that lives on",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Tejas_Vinda_AITS",
        "review_rating": "10",
        "review_title": "The film of the century.",
        "review_detailed_main": "Sholay happens once in a while. Once in a Life time. Never will there be another gem like Sholay.\n\nA master class with master performers in Dharamendra, Amitabh, Hema and Jaya. Of course two of the greatest performers in Sanjeev Kumar and Amjad Khan. Equally supported by super taleted Asrani , Jagadeep, Keshto Mukherjee and AK Hangal."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "grooviecookie-70534",
        "review_rating": "10",
        "review_title": "Sholay Recollection - 20 Years Later",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "davetree",
        "review_rating": "1",
        "review_title": "Ugh! The Poor Horses!",
        "review_detailed_main": "Half way through this repetitive mess punctuated by Bollywood \"musical\" songs & dance. The guns rarely run out of bullets; the hammy actors rarely run out of long stares, and the horses--are constantly running & jumping--poor babies! What a phony snore fest."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "salirocket",
        "review_rating": "",
        "review_title": "Brilliant Movie! Unmissable, unforgettable and enjoyable!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "binoopwarrier",
        "review_rating": "9",
        "review_title": "calssic of classics",
        "review_detailed_main": "Yea its the classic of classics,because those actors were specially born for this movie , each shots of the movie is merging like a iranian movie tale! expressive altogether."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "gilandmagda",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "lalitchoudhary-39358",
        "review_rating": "10",
        "review_title": "A rare Hindi film of the times",
        "review_detailed_main": "I think Sholay is a great Hindi film of its times, although with the amount of praise and superlatives it has been getting throughout the years, I must admit it's a little overrated. The film was indeed ahead of its time in many ways. First, the action was really good - there were some glitches here and there, but it was far more credible than what the times had set the public for. Secondly, the attention to detail, as expected from Ramesh Sippy, is first-rate. Sippy, a great director whose combination of professional, technically skilled direction, impressive storytelling, and the delicate yet honest depiction of his."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "vkvvkv",
        "review_rating": "10",
        "review_title": "A tale which caught the imagination of the Hindi cinema",
        "review_detailed_main": "Sholay is an action movie with an impressive comedy which has a special place in my heart. Most of the characters in the movie have become house hold names and part of the Hindi vocabulary. All the actors who reprised the roles small or big are part of the imagination of people : Angrezo ke jamane ke jailor, shoorma bhopali, gabbar, mausi, kalia, sambha, thakur and above all gabbar..\n\nthe movie is very well paced and well written dialogues which fit the storyline very well. The songs are also good and everything in the storyline is part of \"folk lore of the indian cinema\" ..... I always watch this movie whenever I get a chance. These days it is freely available on the youtube so dont even have to search for the DVD. This is a truly great movie."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rughoonauthvinoba",
        "review_rating": "9",
        "review_title": "Mera Gaon Mera Desh part 2",
        "review_detailed_main": "Sholay is definitely the greatest Indian movie made.\n\nIt had all the ingredients and a great repeat value.\n\nThe star cast is perfect.. Performance is fantastic.\n\nBut do you know..it has many similarities with a film released in 1971.. Mera Gaon Mera desh.. Starring Dharmendra again and Vinod Khanna.. The villain name was Jabbar Singh ..close to Gabbar Singh.\n\nSo we are now sure that Sholay is not original but a copy.. a best copy.\n\nAnd also do you know that.. On same day of Sholay release another movie made its debut.. Jai Santoshi Maa.. It did great business and was a big hit also.\n\nSholay will remain a best movie for eternity.. Rating 9 out of 10."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Sanjay73844",
        "review_rating": "9",
        "review_title": "Near Perfect movie",
        "review_detailed_main": "Will we ever have a perfect movie! No one knows, But if there is one movie that clicks on all boxes, this is the one. Perfect cast, photography, dialogues, screenplay and direction.\n\nIts a viewer's dream and a creator's guide."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "mukherjipoulomi",
        "review_rating": "8",
        "review_title": "Film Review for 'Sholay'1975",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "svorva",
        "review_rating": "5",
        "review_title": "A Stranger's Take on Sholay",
        "review_detailed_main": "Greetings fellow Top 250 enthusiasts. This might sound overdramatic, but I owe a great debt to IMDb. This website has helped me discover both entertainment and films that have shaped my life. Recently, I have to credit the top 250 list for introducing me to a new genre. Indian movies haves made a controversial splash here on IMDb. To settle aggravated parties, India became the first and only country to get their own hall of fame. These (mostly) Hindi language films have introduced a new word into America lexicon: Bollywood.\n\nFor me, the most invigorating flavor to rise from Bollywood are Masala movies. In good ole USA, calling a film \"unfocused\" or \"busy\" is almost always a negative criticism. Masala (translation: spice mix) films contain equal parts action, comedy, drama, romance, and always musical numbers. To accommodate, these films often require epic runtimes by Hollywood standards. Their energy is infectious. The best masala films are spirited, engaging, and make 3 hour+ runtimes feel insignificant. Masala and Bollywood have received harsh criticism from both professionals and internet trolls, but I believe the elite examples are on par with Hollywood's consensus great movies. Given this opinion, you can imagine my excitement when first hearing about Sholay. This western masala is considered a classic that continues to influence Bollywood after its release over 40 years ago. I have seen countless spaghetti westerns, a couple \"kimchi westerns\", and now I was going to see the king of all \"curry westerns.\" Well, you have seen the star rating. Now I must detail my disappointment.\n\nSholay opens with retired officer Thakur in search of a pair of misfits he once arrested years ago. Thakur was impressed by their bravery. In flashback, we see that on the way to prison the pair repelled a dacoit attack and took wounded Thakur to a hospital. The duo, Veeru and Jai, are living life on the run, in and out of prison. They are not hardened criminals however. These good hearted tricksters commit petty crimes, usually while staying a step ahead. Upon encounter, Thakur has a proposition. He will provide accommodations and an award if the pair return with him to protect his home village of Ramgarh. There they must fight the bandit captain Gabbar and his band with whom Thakur has an overwhelming vendetta. Veeru and Jai think, flip a coin, then acquiesce to this quest. At Ramgarh, both fall in love and shed blood while confronting the cruel Gabbar.\n\nFans of westerns will immediately notice that the plot is a touch similar to Magnificent Seven Samurai. This is just one of many, many, resemblances to classic westerns. Sholay was released in 1975, almost a decade after the West's last great hurrah. This era is clearly a source of inspiration, but Sholay overreaches. At first, picking out details is an enjoyable hunt for Easter eggs, the familiar sandwiched between masala elements. We strangers have never seen these landscapes and characters before, but they recall comfortable memories. Unfortunately, the novelty continually wears over the 3½ hour runtime. One painful moment is directly lifted from Once Upon a Time in the West. There is a recreation of the massacre at the McBain Farm. Gabbar is a despicable villain, but these cinematographers create an image that is inept compared to Fonda's blue eyed stare. Imitation can be creative, enjoyable, and flattering, in Sholay it can be excruciating. At the time, Sholay challenged censors resulting in a theatrical version and a post release directors cut. Even in the uncensored cut the violence is downright cute compared to what Peckinpah was doing five years earlier. Gun shot, cut to a bloodless victim thrown backwards. Some western connoisseurs on the lookout for international influence will be amused, but when Sholay is derivative, it usually does not work.\n\nSo what? Defenders might say. Perfect originality is an unreasonable expectation. Why is it when Sholay draws from the well of classics it fails? I think the problem is Sholay's runtime. Attention is the currency of art. When you ask an audience to sit for 3 ½ hours, the burden is on you to keep them in their seats. When Sholay borrows bits it invites greater scrutiny on the original. Suddenly there is an unbearable amount of pressure on scenes that are just supposed to be fun, even camp. Not all of these moment works. Yes, I am judging humor in a language and culture context I cannot hope to understand. However, I feel confident calling out this international trope: the chatterbox. Why some one thought this gimmick was funny enough to become a love interest is beyond me. No more nitpicks. Enough works. Gabbar deserves to ride with the all-time great bastards in cinema. Veeru and Jai do get up to some amusing hijinks. Still, Sholay is a part of that mid-tier of masala. Films with heart lost in such a tangle that I want to take a machete and cut me a new film."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "gsd1121",
        "review_rating": "",
        "review_title": "Typical Indian movie, whole idea is copied out of Hollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "reyanshraghuvanshi",
        "review_rating": "10",
        "review_title": "Dharmendra show",
        "review_detailed_main": "Dharmendra is the life and soul of this film. Everyone else has acted well. Gabbar villain doesn't have impact couldn't even last 3 minutes in one on one combat with Dharmendra lol"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "aaravsheth",
        "review_rating": "10",
        "review_title": "Naughty grandson",
        "review_detailed_main": "The movie is good but the grandson is hurami. Please watch the movie tho guys and support the Yash Sippy family AMEN."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "harishraval-04533",
        "review_rating": "10",
        "review_title": "Miracle,,of the movies world.",
        "review_detailed_main": "Can you imagine that any movie's dialogues and scenes be remembered even after 45yrs been passed? Yes this is the only movie has made this miracle."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "jinujosephs",
        "review_rating": "9",
        "review_title": "Every dialogue is a hit",
        "review_detailed_main": "The only movie I know which has each dialogue a classic. Tough to create one. The star cast are known by their reel name. Jay, Veeru, Thakur, Sambha, Basanti, even Kalia (hardly 1% of screen space shared), mausi (too small role), chacha, beedi ka karkhana, even the horse Dhano.... The best movie ever made, imagining the canvas it huge setup.. Have seen these movie enormous time, My parents have see and remember every line. I saw it and my now my kids have also seen the movie."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rkstylo",
        "review_rating": "10",
        "review_title": "10 out of 10 - THE BEST HINDI FILM EVER MADE",
        "review_detailed_main": "Is kahani me romance hai, drama hai, tragedy hai. It's arguably the best hindi film ever made and probably the most ENTERTAINING FILM EVER MADE. I still get glued to the TV screen when I see this playing on any tv channel.\n\nThe main plot is so strong, full of a strong storyline, which gets revealed slowly but at the right moments in the movie and seamlessly integrate with the present to tell u the full picture. The storytelling is marvellous. The acting is brilliant. The emotional bond of 2 friends is the best part of the movie. And yes, the antagonist, the VILLIAN of the movie - GABBAR SINGH - he steals the show for me as the best actor of this movie. Not to forget Sanjeev Kumar, a guy who plays twice his age effortlessly. The sub plots are also amazing and provide some comic moments in an otherwise fast moving and tightly knit main plot. Watch it to see how FANTASTIC Indian Hindi Cinema is."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "theanukalpsinha",
        "review_rating": "9",
        "review_title": "Nixe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "tabishhinspired",
        "review_rating": "9",
        "review_title": "Classic Movie from India",
        "review_detailed_main": "What wasn't there in this movie ? Direction. Music. Story. Dialogue. Screenplay. Aahhhhhhh. Everything at it's very best...."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "adarshjustice",
        "review_rating": "1",
        "review_title": "Pathetic and dreadful movie.",
        "review_detailed_main": "I do not see anything special in this movie. It's an exaggeration to even call this a watchable. This movie is serves the agenda of karachiwood ."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "shahsudh",
        "review_rating": "10",
        "review_title": "Great!",
        "review_detailed_main": "An amazing cult classic movie with an evergreen story, dialogues, love story, comedy and uniqueness. Movies like this make their separate fan-base among everyone and everyone enjoy it!\n\nThe casting is perfect and the mighty villian gabbar singh. The first movie in bollywood to introduce the concept of anti-hero and also the first movie where villian became more famous than hero!.\n\nThe director's cut is more good but our dumbass cbfc again showed it's immaturity. But this is also brilliant and is recommended to everyone!"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "kingharshkumaraj",
        "review_rating": "10",
        "review_title": "The best movie of indian cinema history",
        "review_detailed_main": "This film has everything. Just watch it . It's a re creation of 1975 sholay"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "sonnykaran-97744",
        "review_rating": "10",
        "review_title": "Just a perfect movie...for everyone",
        "review_detailed_main": "One of the best things to happen to Indian cinema. One of the few movies that has everything that a movie should have or need. The music, the story, dialogue everything stands on its own merit and complements each other."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "hamkohamo",
        "review_rating": "10",
        "review_title": "Hamko Hamo",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "naveenkumar-915-152223",
        "review_rating": "10",
        "review_title": "Must Watch For Cinema Lovers",
        "review_detailed_main": "Must watch for Cinema lovers No VFX no six pack abs. Good story good directing and good acting. All songs are up to the mark and has left biggest impact a movie / song can to a cinema industry."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "CoolSalster",
        "review_rating": "10",
        "review_title": "The mother of all movies",
        "review_detailed_main": "What can be said about Sholay that has not been said. This is a masterclass in direction, script writing and performances."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rajeshked",
        "review_rating": "9",
        "review_title": "One of the masterpieces produced from Indian Film Industry",
        "review_detailed_main": "Sholay is one of the masterpieces produced ever from Indian Film Industry there are many reasons for it. This is the best childhood memory related to watching this movie as this first ever Hindi movie my father took when I was a just 5- year-old kid. There are a lot of aspects which made this movie in the top of the list of will have lasting memories which can be preserved for ages.\n\n->A very Strong Script - well-defined script written by legendary writers - Saleem Khan and Javed Akhtar - Powerful writer due who ruled Bollywood for 2 decades - 70's and 80's.\n\n-> Direction - Ramesh Sippy - well-executed scenes and craftsmanship and every shot so well framed and positioned which will embed in audience photographic nostalgic memory.\n\n-> Casting - All the actors even the supporting cast where finest of India at that point of time - Sanjeev Kumar, Amitabh Bachchan, Dharmendra, Hema Malini, Amjad Khan (who raised to stardom with this movie alone), Hema Malini.\n\n-> Music - RD Burman - background music will leave a mesmerising impact on the audience mind and blends really well with every scene.\n\nI used to remember where I had long conversations with my father on every aspect of the movie and every scene. There are some iconic scenes where no movie was able to match even today.\n\n-> Introduction of antagonist - Gabbar Singh - this character inspired so many villains roles in Indian Cinema.\n\n-> Scene between Jaya Bachchan switching off the lamps in the evening and Amitabh Bachchan playing the mouth organ. (Even heard that the director waited for the exact evening light to justify the scene). If you could read between the lines there is a lot of philosophical touch to this scene. A widow who is shutting all the lamps and wants to close her doors of the inner world closing all the avenues and another lover playing a blissful melodious music trying to open the doors and asking her not to give up.\n\n-> Jay dying in the hands of best friend Veeru -> where a friend will not his fellow friend not to follow the wrong path but will die in the end making his friend to stay in the right path and keeps a lie. (Coin toss). Also, reminds of true friendship which is depicted in God Father's novel and underlines the statement of Don Corleone \"Friendship is beyond talent\".\n\nThe movie became iconic and even the makers had to admit that they cannot reproduce the same classic as the idea of Sholay-2 has been shelved and given up as certain time Iconic movies can be produced once."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rupak_speaking",
        "review_rating": "8",
        "review_title": "Among Bollywood's Best",
        "review_detailed_main": "What to say of this 'almost perfect Bollywood movie' and arguably among the greatest from the industry, it had absolutely everything in it, a blend of all the facets of Hindi cinema, yet modelled on the Western movies running in Hollywood at that time and before. No need to elaborate on any of the elements of this film, as any Hindi movie lover would know; but to mention just one, I would talk of the action sequences in the running train which were such perfectly shot that they seemed way ahead of its time. It had a slow opening in the theatres but gathered steam in the second week and o boy, it never looked back from there. I still remember it running as late as the 90s in some theatre or the other in the city and had a release every year whenever they found a slot for this classic. If the number of times a movie been watched by any viewer is the question, it would perhaps make the Guinness Books by now. 8/10"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rdas-05733",
        "review_rating": "9",
        "review_title": "Probably best movie of Amitabh bachan",
        "review_detailed_main": "Totally entertainment and best song of friendship. The dialogue was fantastic I don't no how it miss the oscar"
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "gangotribasu",
        "review_rating": "10",
        "review_title": "Legendary film",
        "review_detailed_main": "Sholay is a cult film and defines Indian cinema. A must watch for each and everyone."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "rajputshri",
        "review_rating": "10",
        "review_title": "HINDI CINEMA WORLD NO 1 MOVIE",
        "review_detailed_main": "Amitabh bacchan , dharmendra , Sanjiv kumar , hema malini , Jaya bacchan starrer this movie unbeatable record till now Sholay one of the most running box office movie in Hindi movies this movie running in theator around 4 years in theator Nobody beat its record till now , movie dialogues ans story script unpredictable songs Lata and rafi megastar."
    },
    {
        "movie_id": "tt0073707",
        "movie_name": "Sholay",
        "movie_rating": "8.1",
        "review_username": "Calhoun-2",
        "review_rating": "",
        "review_title": "Yes great, but owing great DEBT to Sergio Leone",
        "review_detailed_main": ""
    }
]