[
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "ragana",
        "review_rating": "5",
        "review_title": "Here kitty, kitty, kitty",
        "review_detailed_main": "An incestuous mother and son (Krige, Krause) of preternatural origin move to a small town to find a young female virgin (Amick) the son may take the life force of and feed the mother with.\n\nIt's Stephen King, who wrote the screenplay, at his not bad best. Interesting music; I've never heard Enya in a horror movie before but surprisingly it works. As with Ron Perlman, I'd pretty much sit through anything with Alice Krige in it.\n\nThe down side is that although the mother and son are interesting beings the curiosity about them the movie arouses is not satisfied. What are they? A kind of feline lineage is hinted at as they can morph into variations of cat like creatures yet cats are their mortal enemies (a scratch can be fatal). Where are they from? Egypt is hinted at (the origin of the worship of Bast, perhaps). Why are they called Sleepwalkers (origins of the incubus/succubus/vampire mythologies)?\n\nDespite the questions raised and unanswered the film is still an enjoyable gore-fest horror break from reality.\n\nWorth a rent/buy used, especially for fans of Stephen King's work."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "disdressed12",
        "review_rating": "6",
        "review_title": "not spectacular,but entertaining",
        "review_detailed_main": "this Stephen King adaptation was entertaining but not great,by any means.it's worthwhile to pass time.it''s probably as weird as any of the King adaptation i have,and even weirder than others.this movie sort of felt like a fairy tale to me.although not a kid's fable,obviously.i did like the cast,many of whom have gone on to other things,since then.Brian Krause also appeared in the TV show Charmed,Madchen Amick (who could be Kim Delaney's twin sister)has been in several smaller budget pictures.Alice Krige was seen most notably as the Borg Queen in Star Trek:First Contact,while Ron Perlman was previously seen in The TV series beauty and the Beast.his most notable role(In my opinion)was in Hellboy as the title character.like in most King movies,king himself appears in a cameo.at least three other modern horror masters(Jon Landis,Joe Dante,and Clive Barker also have cameos.anyway if you wanna pass 90 minutes or so,i'd say this movie is worth it.for me,Sleepwalkers is a 6/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Jonny_Numb",
        "review_rating": "5",
        "review_title": "The Cat in the Hat Goes Splat",
        "review_detailed_main": "Director Mick Garris has commented on how \"Sleepwalkers\" was a troubled production, and one only has to watch in disbelief to see what he means. Before its 1992 theatrical release, I remember the film being heavily hyped as Stephen King's first foray into cinema with a completely original screenplay (and as was true with most adaptations of his work--with or without his involvement--at the time, the reviews were less than sympathetic). Ironically, Garris would become better known for helming TV-miniseries versions of some of King's best-known works (\"The Stand\"; \"The Shining\"; \"Desperation\"), directing right from the author's own scripts. Needless to say, these made-for-TV works outshine \"Sleepwalkers,\" which simply further proves that King's writing style (heavy with internal dialogues and detailed, unspoken perceptions) is better suited to a format that can fully develop his themes and characters. This tale of an incestuous mother/son duo who shapeshifts into bloodthirsty felines, roaming from small towns to dine on virgin prey, is fairly decent for the first 50 minutes--King's use of 'local color' (and the resulting humor) is well-rendered, and Garris does a fine job of creating an atmosphere of mystery and intrigue. But just when \"Sleepwalkers\" seems headed for the zone of good (if not truly memorable) King adaptations, its final third devolves into overblown, ridiculous action sequences (as though the producers chopped away 30 pages of King's script for explosions and shootouts) and a queasy imbalance between absurd humor and sentimental melodrama. The end result hobbles the overall experience--had King's ideas been thoroughly fleshed-out, \"Sleepwalkers\" may have been a solid entry in his filmography...but as it stands, it feels like a lament over what could have been. The cats are incredibly cute, though."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Dr. Gore",
        "review_rating": "",
        "review_title": "Madchen Amick dates a cat hating, mother loving freak of a monster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "quitwastingmytime",
        "review_rating": "2",
        "review_title": "Stabbed with a...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "gavin6942",
        "review_rating": "7",
        "review_title": "As Much as I Want to Hate This Film, I Love It",
        "review_detailed_main": "A shape shifting young man (Brian Krause) and his mother (known as \"sleepwalkers\" for some reason) arrive in a new town. But the mother (Alice Krige) needs to feed, so her son Charles must find him a pure young woman. But who will he love more, his mother or the beautiful Tanya Robertson (Madchen Amick)? \"Sleepwalkers\" is a film that has a special place in my heart. I saw it repeatedly on television as a teenager watching our local horror host, Ned the Dead. And while I never thought it was great, I found it entertaining. I place it in the same category as \"Maximum Overdrive\" -- cheesy and fun, though by no means a great film. And look at the cameos in this film! Mike Mayo tears this film apart, calling it \"arguably King's worst film\". He says the \"script meanders through pointless chitchat scenes.\" Director Mick Garris \"doesn't know how to photograph\" and throws in \"close-ups of knees.\" Wow. He has nothing nice to say about this film, giving it a dismal 0 on his one through four scale. I must beg to differ with Mike on this one.\n\nFirst of all, King's worst film is \"Langoliers\". Second, I did not notice these pointless chitchat scenes he speaks of. Some of the plot is a bit loose, but nothing is completely pointless. I furthermore do not recall any shots of knees, though if the knees belonged to the beautiful Madchen Amick I think this is forgivable. Mick Garris has made many a bad film, this is true. And \"Sleepwalkers\" is by no means a masterpiece. But I think to lay down such heavy scorn is misplaced and really ignores the \"fun factor\" of this picture.\n\nOddly enough, Howard Maxford, whom I almost never agree with, seems to get this one. He calls the film \"silly but quite lively\" and points out the \"nifty effects\" and \"gag cameos\" (Stephen King, Clive Barker, Joe Dante, Tobe Hooper and John Landis). And there you go -- recognition of the fun this film was and still is.\n\nRon Perlman (\"Hellboy\", \"Pro-Life\") plays a cop and doesn't get nearly enough screen time. Not sure what else to say about that. Clearly they did not foresee the star power in Perlman."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "lost-in-limbo",
        "review_rating": "5",
        "review_title": "When felines attack\u0085 in human form.",
        "review_detailed_main": "There's something about the b-grade sleeper \"Sleepwalkers\" that keeps me from liking it, but not enough to entirely hate it either. It kept me entertained, but I wasn't all that satisfied. Director Mick Garris' handling might come off stagy (which took any sense of atmosphere) with an almost TV-like feel, but remains crisp and well paced in its actions. Some imagery shows moments of creativity with the illustrative camera-work with its scopes and tilts. I just wished it had been much more darker in its visual styling. Stephen King would adapt his own book, where the premise creates a wickedly novel concept that would turn upon its sly tone with nonsensical and over-the-top dramatic lashings. This goes for its outrageous, if clumsy climax. While the jolts are grisly, they do come off quite risible with it being punctuated by sadistic heavy-handedness. The eccentric make-up FX is decently pulled off, even with some cheesy and blotchy trimmings. The script is rather ill-defined, but still has a neat touch of morbid humour and a sexual charge thanks to the seductively deranged performances by Alice Krige and Brian Krause in their mother and son relationship. Mädchen Amick is suitably appealing in the victim role. Ron Perlman makes a short, but commanding turn. Also keep a look out for some amusingly interesting cameos by Stephen King, Tobe Hooper, John Dante, John Landis, Clive Baker and Mark Hamill."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Dragoneyed363",
        "review_rating": "7",
        "review_title": "Admit it, this was fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Theo Robertson",
        "review_rating": "2",
        "review_title": "Based On An Unpublished Stephen King Story ....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "BA_Harrison",
        "review_rating": "7",
        "review_title": "Features the only 'death by corn cob' scene you'll probably ever see.",
        "review_detailed_main": "The first of several Stephen King adaptations to be directed by Mick Garris, Sleepwalkers is dated somewhat by its (then cutting-edge) CG morphing effects of the kind seen in Michael Jackson's music video for Black and White, and later in the Buffy the Vampire Slayer TV series. Creaky CGI trickery aside, the film is actually a whole lot of silly fun, with a daft story about a shapeshifting mother and son, Mary and Charles Brady (Alice Krige and Brian Krause), the sleepwalkers of the title, who must feed on the lifeforce of female virgins to survive.\n\nMoving to a new town, Charles quickly sets his sights on schoolgirl Tanya (the gorgeous Mädchen Amick), but his nefarious plans are thwarted by the local cat population, who gather forces, their scratches deadly to the sleepwalkers.\n\nThings get off to a wonderfully sordid start with a spot of incest between Charles and his mother, and the bonkers fun continues with hilarious attack by Charles on Tanya at a local graveyard make-out spot, some very silly gore (a pervy teacher loses his hand, a cop is stabbed in the ear with a pencil, Charles has his face seriously messed up, Ron Perlman gets his fingers chewed off, a guy is stabbed in the back with a corn cob, and a sheriff is impaled on a picket fence), several pointless cameos from horror luminaries (Stephen King, Joe Dante, John Landis, Tobe Hooper and Clive Barker), and a completely nutzoid finalé that sees the cats launch an all-out attack on Mary Brady, who has assumed her true reptilian/feline form.\n\nTo summarise: Sleepwalkers is by no means a classic King adaptation, but it's never a boring one.\n\n6.5 out of 10, rounded up to 7 for IMDb."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Doylenf",
        "review_rating": "5",
        "review_title": "Calling all cats...hurry, hurry to the scene of the crime...",
        "review_detailed_main": "SLEEPWALKERS starts out promisingly enough to be a creepy tale about a mother and son vampire team--needlessly involved in an incestuous relationship--played by BRIAN KRAUSE and ALICE KRIGE. These two handle their roles extremely well and the creepy atmosphere of the story makes you believe you're in for a good Stephen King thriller about a small town about to be devastated by vampires seeking nourishment.\n\nThere's even a pretty girl (MADCHEN AMICK) who flirts with the new boy in town, first at the movie theater where she works and then at high school--and these three characters carry the first part of the film nicely. You start to wonder whether the girl is going to be an easy victim of the mother and son team or whether she'll fight them off.\n\nBut as the plot thickens, so does the absurdity of the whole thing, all directed in comic book style so that none of the characters have any dimension beyond being puppets in a horror story that is so grotesque and over-the-top, particularly in the last half-hour, that you'll wonder whether a sane hand had any part in these proceedings. All of the business involving a menagerie of cats that sit on the couple's front lawn becomes laughable before the story uses them in a way that lacks any credibility at all.\n\nTo be fair, there are some scenes that do hold the interest, usually because a quirky supporting character, such as the black cop with his trusty traveling companion Clovis (a cat), provides some much needed humor--but those moments are few and far between. And any attempt to provide humor by having Stephen King play an obnoxious local man seeking help from a sheriff, fails utterly to do anything but convince the viewer that King should leave bit roles to professionals.\n\nWhatever potential it had as a thriller is diminished by the outlandish ending which has Alice Krige losing her marbles completely. She hasn't had an eerier role since she played the girl who came back to life to haunt men in GHOST STORY ('82). But as good as she is, she can't save a trashy horror film from looking absurd."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Marincho97",
        "review_rating": "8",
        "review_title": "''I lied! It does have to hurt!''",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Hey_Sweden",
        "review_rating": "7",
        "review_title": "It's just you and me, Clovis.",
        "review_detailed_main": "Brian Krause ('Charmed') and Alice Krige (\"Star Trek: First Contact\") play a son-and-mother pair, the title creatures who are vaguely feline in origin. They live a nomadic existence, moving from town to town and obtaining sustenance from the life force of teenage virgins. Their one weakness? Cats. Apparently any substantial scratch from a cat is enough to kill a Sleepwalker. Trouble arises for Krause and Krige when their current intended victim (Madchen Amick, 'Twin Peaks') turns out to be a real fighter.\n\nDon't take this screen original from Stephen King seriously - at all - and it's possible to have a generous amount of fun, as I did. It's positively goofy stuff, with some incredibly groan-inducing moments, but since most of the laughs do seem to be intentional, I was able to forgive this sort of thing. It's pretty predictable, to be sure, with most of the adult characters or authority figures proving to be completely useless. The visual effects by Apogee are pretty good, and Tony Gardners' Alterian Studios supplies some decent-looking monsters. Another bonus: \"Sparks\", the cat who plays Clovis, is every bit as appealing as human protagonist Amick.\n\nA solid assortment of familiar faces helps matters: real-life former couple Cindy Pickett and Lyman Ward, who'd played Matthew Brodericks' parents in \"Ferris Bueller's Day Off\", as Tanyas' folks, Ron \"Hellboy\" Perlman as a moronic state trooper, Jim Haynie (\"The Bridges of Madison County\") as the sheriff, Rusty Schwimmer (\"Jason Goes to Hell: The Final Friday\") as a housewife, Stuart Charno (\"Friday the 13th Part 2\") as a crime scene photographer, and the late Tim Burton favorite Glenn Shadix (\"Beetlejuice\") as a creepy teacher. There's also a handful of quick cameos from genre icons, and Mark Hamill appears unbilled in the opening pre-credits sequence.\n\nI would tend to agree that BY NO MEANS would this ever be considered a \"great\" film, but it provides ample entertainment for horror fans. It does make great use of Enyas' haunting song \"Boadicea\".\n\nSeven out of 10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "moonspinner55",
        "review_rating": "3",
        "review_title": "Well-cast, but inappropriately bright and snappy",
        "review_detailed_main": "I have nothing against a fast-paced fright-flick, but this Stephen King-derived nonsense is too freshly-scrubbed, too bright and modern. The plot, about a new teenage boy in a small town who is a \"Sleepwalker\"--sort of a cross between a vampire and a werewolf--and who feeds on the blood of female virgins, begs for a more mysterious, ambiguous treatment. This thriller is given an inappropriately colorful look and feel, with hardly any atmosphere. The kids are predictably pretty and energetic, but the big plus is Alice Kridge as the boy's mother; Kridge, from \"Ghost Story\", never broke out of the filler-female mold, and it's a huge loss that she hasn't been used more. Her performance is creepy and intense, and gives hint that \"Sleepwalkers\" might've been a much better film with a different focus and tighter direction. It's too over-the-top and commercially-driven, with an uneven tone that swings wildly from thriller to comedy to drama. Stephen King pops up in a cameo, as do real-life directors John Landis and Tobe Hooper. *1/2 from ****"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Baron3000",
        "review_rating": "",
        "review_title": "Surprisingly Good for a Horror Picture",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "hexfield",
        "review_rating": "3",
        "review_title": "You'll need a shower after this one...",
        "review_detailed_main": "If you're the kind of movie-goer who enjoys original content and intelligent suspense...then look elsewhere, kids, cause Sleepwalkers really sucks. Usually I'm more eloquent than that, but...wow...this was bad. I especially love it when Charles offers Tanya a ride home, she declines, and then he is seen WALKING HOME. Where's his car?? Anyway, just don't see it, folks. I really want to be more specific, but words escape me. Cats jumping on people. A guy getting stabbed by corn. Cheesey lines up the proverbial \"wazoo\". Just don't see it. Wait, I take that back! See it for writer Stephen King's cameo as the guy who owns the graveyard. He's actually pretty good. Even with guest appearances by Mark Hamill and Ron Perlman, King gives the best performance of the film. But, other than that...wow...BAD."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "FlashCallahan",
        "review_rating": "7",
        "review_title": "no vegetables, no dessert.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "petra_ste",
        "review_rating": "2",
        "review_title": "Catfight",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "rose-294",
        "review_rating": "7",
        "review_title": "Silly and fun",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "jimkis-1",
        "review_rating": "1",
        "review_title": "Unbelievably horrible",
        "review_detailed_main": "This film has its share of negative comments and I have to agree with those who consider it one of the worst movies ever made. True, most of the films based on the works of King are pretty bad, but this one goes beyond bad into the realm of horrible. There is not one scary moment in it unless you consider stupidity scary. It is typical King garbage -- myths twisted around that made no sense in the first place, mixed with obvious and belabored so-called \"scares\" that are about as shocking as PeeWee's Playhouse (which, at least, is entertaining). It is full of ridiculous moments, not the least of which is Alice Krige's character. When she goes on a rampage and starts quipping like the villain in an old Batman TV show, it is so absurd as to be sickening. All the people who had cameos in this (including John Landis)are lucky they still have careers. But the most absurd part has to be the cat costumes towards the end, which look like cheap rubber outfits someone bought at K-mart. The best part of the movie is the appearance of some real cats who actually out-act the people in the movie."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "bayardhiler",
        "review_rating": "7",
        "review_title": "Good Fun From the 90's",
        "review_detailed_main": "While I can't say that Stephen King's \"Sleepwalkers\" is a great film, it certainly is not the worst one either. In this movie Stephen King actually does try to do something original, in that he creates a race of supernatural beings who for some unknown reason call themselves sleepwalkers. These beings are psychic vampires (meaning they feed off of psychic energy as opposed to blood) who can transform themselves into bipedal were-cats. In addition, they also possess powers of telekinesis and invisibility, which makes things more interesting. This film follows two of these creatures, Charles and his mother, Mary, who are forced to live nomadic lifestyles because it turns out that regular house cats are deadly to them and always seem to find them in their new neighborhoods. Another constraint is that they can only feed off of the life force of young, female virgins such as young Tanya Robertson, who \"Twin Peaks\" fans will recognize as Madchen Amick. She happens to meet Charles in her creative writing class, thinking that he's falling in love with her; little does she know that Charles (played decently by Brian Krause) wants to suck the life out of her. All the actors play their parts well, however the real star of the movie is the talented Alice Krige, who plays the deliciously evil matriarch who will do anything to protect her son. A number of people have expressed dismay over the film and there is some truth in that: the direction by Mick Garris does not always flow right, the early CGI effects, although not terrible, seem a little dated today, and a few plot holes are present, such as what is it about cats that make them so deadly to sleepwalkers? Still, the movie never drags, the physical makeup they used for the creatures was very convincing and probably more so than some of the effects you see today, and the creatures are a pretty cool idea. One other thing that adds to the movie is the theme song, done by Enya, I think, that manages to be both beautiful and haunting. I'll admit that I'm a little biased in that I love just about anything from the 90s. Yet, give \"Sleepwalkers\" a chance. Besides, there are worse Stephen King Movies out there; just watch \"Rose Red' and you'll see what I mean. 7 out of 10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "NateWatchesCoolMovies",
        "review_rating": "8",
        "review_title": "terrific",
        "review_detailed_main": "Stephen King's Sleepwalkers has a reputation as one of the lesser quality adaptations of his work, which led me to put off watching it for years. Well I don't know what film the critics saw, cause the one I watched was wicked good. Nestled in that perfect area of 80's horror where the blood was corn syrup, the flesh was latex, there wasn't a pixel or rendering in sight and atmospherics mattered more than excessive violence, this is one serious piece of horrific eye candy with the backbone of King's wicked imagination to hold it steady. The story tells of a small Midwestern town (is there any other kind in the man's work?) That falls prey to a pair of vampire werewolf hybrid creatures who subside off the blood of virgins and morph into slimy behemoths that conveniently show off the impressive prosthetics. Brian Krause is one of said creatures, drifting into town with his creepy mother (the wonderful Alice Krige) and setting his sights on severely virginal schoolgirl Madchen Amick, by dialing up the charm past eleven. People and animals start to die all over town and the suspicions arise, but the pair are cunning and have most likely been doing this for centuries almost unnoticed. It's nothing too unique as far as the concept goes, but the fun of it lies in the gooey special effects and one demon of a performance from Krige, a veteran stage actress. She is one part beautiful seductress (even to her son, in one unsettling scene) and one part volatile banshee, setting your nerves on edge time and time again throughout the film. Krause does the demonic James Dean thing nicely and Amick shows blossoming reilience beneath the required mantle of terrified scream queen. The three of them run amok in a beautifully realized fever dream of psycho sexualized terror, small town atmospherics and a classic old school horror climate. This film loves it's cameos, so watch for Clive Barker, Ron Perlman as a grouchy state trooper and King himself as the world's dumbest graveyard caretaker. Baffles me why this was panned upon release. It's actually one of the best films I've seen based on King's horror work, and there's a lot to compete with."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "bwallarab",
        "review_rating": "7",
        "review_title": "Solid, entertaining, and fun",
        "review_detailed_main": "Sleepwalkers is no masterpiece, but it is a fun, well-put together little B horror flick. The acting is solid, the practical make up effects are effective and not overly cheesy and the pacing allows the movie to zip right along. Horror buffs will love the cameos as well. Kitty cats rule!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Nordicnorn",
        "review_rating": "2",
        "review_title": "Just Plain dumb",
        "review_detailed_main": "There are no spoilers here... Because there is no plot to spoil. Madchen Amick is living proof a face can make a living acting-- no talent required. The only bright spot are a few really good one-liners delivered very nicely by Alice Krige, but then again, she IS Alice Krige. Her soft dreamy voice gives the only hint at just how seductively dangerous these odd creatures can be. She is believably creepy in this otherwise unbelievable plot. How they got her to agree to this project remains a mystery. The screenplay writers must have been medicated when they submitted this script. It has major continuity problems, superficial stereotypical characters, horror formula writing, and simply falls short of making any sense what-so-ever. The creatures, while they have neat skills like going \"dim\", the question of where they come from and what they are is never so much explored.\n\nDon't waste any time on this one."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "A Complete Mess of a Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "poolandrews",
        "review_rating": "5",
        "review_title": "\"Why don't you just think of yourself as lunch.\" Watchable enough horror film but nothing special.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Coffee_in_the_Clink",
        "review_rating": "7",
        "review_title": "Absolutely mental and derided film that is entertaining from start to finish",
        "review_detailed_main": "This is a unique Stephen King film in that it is not based on any story he wrote, but a screenplay he wrote directly for the screen. \"Sleepwalkers\" has a very cheap '90s TV and \"Buffy the Vampire Slayer\" feel to it, and it was derided by critics at the time and still jeered today. It is very quirky and mental from start-to-finish, which is to say it is very entertaining! The special effects/monster transformations are enjoyable and the last half hour is especially off-the-wall and wraps up nicely. From car chases to cat attacks, murder by corn-on-the-cob and impalement by picket pence, countless bear-traps catching limbs and one gorgeous, nostalgic-inducing cinema scene - you might say this one has it all."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "raypdaley182",
        "review_rating": "1",
        "review_title": "Very weird story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "weasl-729-310682",
        "review_rating": "6",
        "review_title": "A Little Better Than It's Rating",
        "review_detailed_main": "*** MAY CONTAIN A MINOR SPOILER\n\nOkay, we're not talking about academy award material here, but the film did win some minor awards. Weirdly, Alice Krige won both a best actress and a best supporting? Guess that shows how minor they were, but boy is she hot! IMO she was a supporting actress, but when she got screen time, she dominated.\n\nIf you go into this for an entertaining, out of the box, horror/vampire movie you just might not be too disappointed. I don't even like most vampire/werewolf movies, but I liked this one.\n\nThe cast is pretty good-looking, for the most part, which helps. Alica Krige, the boy vampire's mother could not be a lovelier monster. There are also some comic relief moments that help elevate it too.\n\nIt'll also help to be a cat lover. One scene with Clovis the cat, where he climbs onto his dead law enforcement master's chest, actually brought tears to my eyes. The relationship between Clovis and his master is touching and comical. What cop would be allowed to bring his pet cat along on patrol? But Clovis saves the day time after time. You GO Clovis!\n\nLook for Stephen King's cameo as the cemetery caretaker.\n\nIf you're looking for a serious film, go elsewhere. The gore makeup is pretty durn lame, but also not too disturbing because of that, which allowed me, at least, to enjoy other elements of the movie.\n\nThere's a pretty good jump scare. I screamed out loud, though this is the second, maybe third viewing for me. I won't spoil that one. Like all good jump scares, that tactic isn't overused in this movie.\n\nSo if you like a less than serious, not too disturbing horror flick give this one a go. It just may engage you."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kshihab-64848",
        "review_rating": "1",
        "review_title": "This movie needs a remake,",
        "review_detailed_main": "This story needs a remake with some rational scenes and explanations,i don't know who to blame for the disaster of this movie, the director, the editor or the visual artist.\n\nIt's a great story being covered by some stupid adaptation."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "johnfanning-53228",
        "review_rating": "6",
        "review_title": "Typical Stephen King Screenplay",
        "review_detailed_main": "Stephen Kin is one heck of a writer. There is no question on that. However, when it comes to making movies, be it directing or writing screenplays, he needs to leave it to the professionals. I watched this movie the other day as I had not seen it in over 20 years. Cheesy, bad special effects, but still a ton of fun. The female lead is one of the saving graces of this movie. Madsen (however you pronounce her last names) was delightful, energetic, and just did a great job."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Coventry",
        "review_rating": "5",
        "review_title": "Look Charles...mommy brought you a virgin!",
        "review_detailed_main": "Okay, put aside the vampires, werewolves, Godzillas and masked serial killers for a while\u0085. What we have here is an entirely new breed of horror species. The Sleepwalkers, as based on Stephen King's unpublished story, are reptile-like creatures that feed on the vitality of young virgins. Charles Brady and his foxy mother are the last of their kind and have a torrid incestuous relationship. But in order not to become extinct, Charles needs to seduce the cute Mädchen Amick so he can suck her dry and pass the energy on to his mum. Pretty far-fetched, isn't it? That's exactly the problem with the whole movie. It tries to be something completely new and inventive but the story fails to give a proper background to these \u0096 basically interesting \u0096 creatures. Why are they called Sleepwalkers? Why virgins exclusively? What's their origin and how come they're as good as extinct? How come they have the ability to appear invisible and \u0096 most importantly \u0096 why are ordinary cats their biggest threat?\n\nIf you don't bother about the constant illogicalness and major plot holes, you'll sure be entertained. 'Sleepwalkers' contains tons of gore (especially near the end when it's a total cop-massacre) and the silly humor. It's pretty amusing to see a chubby cop getting stabbed by a corncob! 'Cop-Kebab!!!!!' Yet, it has to be said, in between the badness, Sleepwalkers does feature some terrific elements and a few highly entertaining trivia-aspects. The beautiful songs 'Boadiccea' by Enya is one of the best sounds ever featuring in a horror movie. And the film is stuffed with fun cameos of other horror directors like Clive Barker, Tobe Hooper, Joe Dante and John Landis. Stephen King himself shortly appears as the cemetery caretaker. The best advice I can give you when watching this film: Switch your brain to 'off' and have fun."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "FlorisV",
        "review_rating": "10",
        "review_title": "Underrated: among the best Stephen King films out there!",
        "review_detailed_main": "Best Stephen King film alongside IT, though this one is more fun than scary.\n\nThis one's got it all:\n\n-a great cast with a Alice Krige and Brian Krause and a fun cameo from King himself;\n\n-well dosed horror in an amusing storyline;\n\n-great use of music, Santo & Johnny's \"Sleepwalk\" in particular;\n\n-likeable characters in a typical King setting: middle of nowhere village;\n\n-lots of humor. You can't really get good scares here because it's too much fun and over the top;\n\n-old but really nice makeup effects like they don't make anymore!\n\nA 4,5 rating: I don't get it really. When was the last time a horror film was as much fun as this one?"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "animeprettygirl",
        "review_rating": "7",
        "review_title": "Great Horror Movie, But Also Gross",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Peach-2",
        "review_rating": "2",
        "review_title": "What a joke...",
        "review_detailed_main": "This has to be one of the worst films I have ever seen without a doubt. The only thing interesting in this film is the cameo appearances from some great genre directors and King himself. The film has a great premise, but falls apart about 15 minutes into the story. I did like Madchen Amick in this film and think she could have a very good career in film."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "XFA",
        "review_rating": "",
        "review_title": "kind of reminds me of Cats Eye",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "whitezombie",
        "review_rating": "1",
        "review_title": "Commits the cardinal sins for a horror movie",
        "review_detailed_main": "No spoilers here -- all I can say is that this movie commits all the cardinal sins for a horror movie. It is tedious, boring, predictable & just plain uninspired. Everyone involved in this production must have been on Qaaludes, and was sleepwalking from start to finish. To paraphrase an old nursery rhyme & apply it to E.A. Poe & Stephen King, you could say that \"when they were good, they were very, very good; and when they were bad, they just sucked.\" Everything about this film was mediocre. The writing, direction, acting, special effects, etc. In 40 years of watching horror movies, from the silents to \"Bubba Ho-Tep\", I have seen a lot of stinkers. Some are so plain terrible that you just have to look at them, like a bad highway accident. This movie is like a gigantic injection of Novocaine. It does introduce an element of incest (in case you had fallen asleep in the meantime), but I don't think that it would interest anyone other than forensic psychiatrists or sexual perverts to witness the several gratuitous and wholly unattractive scenes of the alleged mother & son vampire-werewolf-(whatever) \"sucking face\". I suppose that necrophilia's might get off on the fact that the \"mother\" looks like a bulimic, red-haired Karen Carpenter. Immediately after I watched this spew, I put on \"Kiss the Girls\", with Morgan Freeman & Ashley Judd. It was like night & day -- there are \"good\" movies & \"lousy\" movies. Put \"Sleepwalkers\" in the latter category."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Bart-James",
        "review_rating": "7",
        "review_title": "CHEER! - (7 stars out of 10)",
        "review_detailed_main": "The stage curtains open ...\n\n\"Sleepwalkers\" is based on a story by Stephen King that he wrote specifically for the big screen. Originally, he had written it in short story form, but it went unpublished, so he decided to turn it into a screenplay instead. He has a cameo in the movie as a cemetery caretaker.\n\nIt is the story of a mother and son who are the last of their kind, vampire like and can shape shift. They feed off of, and drain, the life force from virgin women in order to survive. But, like any other such creature, they have their weaknesses - one of which are cats who can see through their imposed illusions and cause very damaging wounds with their claws. Because of their homicidal lifestyle, they are forced to move from town to town in their efforts to continue living. In their new town, they focus in on a local girl who becomes infatuated with the son. As the mother's hunger grows, the son has to become more aggressive leading to a tense, climactic finish.\n\nI know this film wasn't well reviewed and is generally considered to be one of Stephen King's worst, but I personally enjoyed it. I felt it was original, well shot with excellent make-up and special effects and an engaging story that keeps things moving forward nicely. The use of the song, \"Boadicea\", was perfectly utilized here, really setting an ominous feel for the movie. There is some incestuous activity between the mother and son that may not sit well with some, but it wasn't overdone and fit the story.\n\nI would recommend this one. It's not one of the best of its kind, but a fun diversion and good for late night viewing. In it's originality, \"Sleepwalkers\" is one of a kind."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "wes-connors",
        "review_rating": "5",
        "review_title": "Cat Scratch Fever",
        "review_detailed_main": "This film begins with a helpful definition of Stephen King's \"Sleepwalkers\": \"Nomadic shape-shifting creatures with human and feline origins. Vulnerable to the deadly scratch of the cat, the sleepwalker feeds upon the life-force of virginal human females\u0085\" Then, in Bodega Bay, California (an obvious reference to Alfred Hitchcock's \"The Birds\"), officer Mark Hamill (in a cameo appearance) discovers a home populated by hanging dead cats. From there, director Mick Garris moves the action to Travis, Indiana...\n\nWe are introduced to shirtless hunk Brian Krause (as Charles Brady) and his still hot mother Alice Krige (as Mary Brady). They are obviously a nostalgic duo, evidenced by their slow dancing to Santo & Johnny's 1959 hit \"Sleep Walk\". A likely choice. Anyway, the son and mother are also lovers. But, Mr. Krause needs to suck the life force out of a virgin female to satisfy Ms. Krige, who is \"famished\". Krause is too old for high school, but he attends anyway; and, after rebuffing his gay teacher, he decides to hook up with implausible virgin Mädchen Amick (as Tanya Robertson).\n\nHorror novelist King and some others appear in small roles. Together, Ms. Amick and Krause look a little like older versions of Brook Shields and Christopher Atkins. Hmmm. In Bodega Bay, with \"The Birds\" and the cats. It all must mean something, but what?\n\n***** Sleepwalkers (1992) Mick Garris ~ Brian Krause, Mädchen Amick, Alice Krige"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "randrox",
        "review_rating": "7",
        "review_title": "Quirky, Confusing but Memorable",
        "review_detailed_main": "Having seen several very low ratings in the reviews, I have to stick up for this unique movie. I don't contest the flaws it has, which are listed in the negative reviews, but I also don't contest the opinions that point out the excellent casting. Like many other fans, I think Alice Krige can be relied on to give a riveting performance even in a flawed production. Very similar to her seductive, layered role in one of my fave scary movies, \"Ghost Story\", she is the ice cold heart of Sleepwalkers. Brian Krause has been a long-time hearthrob for me, with his blonde, milk-fed smoothness, and when he has a role that fits, as in this movie, he is quite good at suggesting the ugliness of character possible behind the beautiful-boy facade. I remember having a real girl-crush on Madchen Amick after seeing this movie years ago. I totally disagree with the reviewer who claimed she was an example of looks substituting for talent. I've seen her in other roles & have always been impressed with her charisma and uniqueness as an actor, in addition to being a beautiful young woman in a natural way, not an enlarged-fake-boobs-&-trout-pout-way. In this movie, she is appealing & believable as a small town teen curious and conflicted about her sexual desires and resentful of the caring but controlling expectations of her parents (and society). The entire cast is good. I'm not a fan of King as an actor, but as others have said, the cameos are part of the quirky charm of the movie. I guess I like this movie so much because I'm quirky and prefer an almost cartoonish approach to movie violence in a horror movie rather than the extreme, realistic blood and gore so expected in modern horror movies. I find Sleepwalkers' special effects and makeup certainly adequate and professional, in my admittedly amateur opinion. I really dont care for excessive CG. I feel It takes the place of character development many times. As others have said, this movie succeeds on many levels despite some flaws."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "BaronBl00d",
        "review_rating": "5",
        "review_title": "The Corpse Who Loved Cat Dancing",
        "review_detailed_main": "Two shape-shifters(mother and son) arrive in a new town. They engage in a quick incestuous roll in the hay and then son is off to school. He has his work cut out for him as he must find his mother a virgin to satiate her growing appetite. Talk about a frozen dinner! Son soon likes the girl he has found and complexities ensue. Sleepwalkers is a different film to be sure. It has horrific elements such as the opening scene of a house left by the two shape-shifters. It is eerily-shot with cats dangling on ropes from the ceiling, and one can almost feel the loathsome, dampening decay stagnating in the air. But that mood quickly changes and we have the story of incest and mediocrity begin. The script has flaws. It is trying to be an honest horror film and then veers toward comedy. The result is somewhat of an uneven blend to be sure. Notwithstanding flawed script, uninspired direction, and a series of ridiculous endings successively hurled at you, the film is entertaining. It has some genuine scares and even made me laugh a few times. Most laughs came courtesy of Glen Shadix as an English teacher and a policeman with a cat named Clovis. But that right there tells you what lies in store. How many troopers have a cat riding shotgun with them? The shape-shifting couple is played by Brian Krause and Alice Kirge(Boy, I remember when she had so much potential to be the next big star many, many years ago). Both of them are decent as is female lead Madchen Amick(?) The film also has a bunch of horror cameos with John Landis, Joe Dante, Tobe Hooper, Clive Barker and Stephen King. Again, nothing real special here, but what other film can offer what Sleepwalkers offers. The ending alone, though totally unrealistic, is worth a look as a yard full of cats and their leader Clovis get ready to rumble. What a hoot!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "briandwillis-83825",
        "review_rating": "7",
        "review_title": "Silly Fun If You're In the Right Mood",
        "review_detailed_main": "Go into Sleepwalkers expecting edge of your seat suspense and chair jumping scares and you'll leave deeply disappointed. If you go in with a more open mind, you might leave pretty happy having had a good time. It's not Stephen King's best work, but the story about a mother and son who are shapeshifting cat-like creatures who have moved to a new town to sacrifice a virgin for their next meal is entertaining with just the right amount of campiness. Alice Krige as the mother turns in the most memorable performance and manages to play a nice mix of sexy, scary, and even a little funny."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "LavigneLove",
        "review_rating": "5",
        "review_title": "Not as bad a critics say!",
        "review_detailed_main": "This film has its fun moments. It IS silly, but if you take the whole thing as a bit of fun then it will give you some enjoyment. It is probably best watched when drunk with some friends. Madchen Amick is the best thing in it, being adorable and so good to look at (just her face alone) that you may feel the need to cry yourself to sleep at the mere thought of her. Stephen King said that he had a blast writing the script for this, but it is obvious that he didn't spend much time on it. The music in this film is pretty good (it was originally by Enya, but has since been sampled on a couple of popular records by bands such as the Fugees). Just watch it for Madchen's wonderful face if nothing else."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Pan-12",
        "review_rating": "8",
        "review_title": "Gotta love those cats - Spoiler?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Andy B-8",
        "review_rating": "7",
        "review_title": "Not that bad at all.",
        "review_detailed_main": "Because of all the negative reviews of this film I almost didn't watch it. However, I was pleasantly surprised that it was a fairly enjoyable horror movie. The acting wasn't great - apart from the wonderful Alice Krige - but some of the dialogue (\"Just consider yourself lunch.\") was quite amusing.\n\nOn the whole an above average Stephen King effort - 7/10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "lor_",
        "review_rating": "",
        "review_title": "A Stephen King mishmash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kjunhyun",
        "review_rating": "1",
        "review_title": "This movie sucked.",
        "review_detailed_main": "Everything about this movie was awful. The girl's high-pitched screams made it worse. I never want to watch a movie this bad ever again... My energy was completely gone after having to sit through this movie. I thought there would be a twist at the end (such as the girl and her parents being sleepwalkers too) but I was disappointed. Stephen King, you have truly disappointed me... I had expected so much more. Could the reason for this movie being so horrible have to do with it being made in the 90's? Otherwise, I can't find a reason why this movie is the worst movie that has probably ever been made. Horror films at its worst. It sucked more than any of the worst movies since the inception of movie making. Don't ever watch this movie on free-will. I would only watch this movie ever again if I were given a reasonable amount of money to sit through this garbage."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "PredragReviews",
        "review_rating": "7",
        "review_title": "For Madchen Amick fans, otherwise...",
        "review_detailed_main": "Stephen King's \"Sleepwalkers\" introduces you to these mysterious creatures that cats don't like. They appear human most of the time but can change either voluntarily and sometimes involuntarily into their cat like forms. They feed off human virgins it seems they suck their souls right out of them per oral. The plot is kind of thin and it could have been more developed, but it was still pretty good. The movie leaves a lot of questions about what these things are. If you are a movie watcher that likes to know all the facts this may not be the movie for you. The special effects were not all that great and I think the monster's appearance could have taken a little more attention, but I have never rated special effects above the plot. Plot holes? Certainly. Cameos by directors who ought to stay behind the camera instead of in front of one? Definitely. While the movie isn't exactly played for laughs and never fully descends into the campy netherworld, it's hard to take it too seriously.\n\nThe cast is extraordinary for a rather cheap production such as this. Alice Krige, who some might remember as the Borg Queen of Star Trek fame, is excellent in the role of the evil mother. Also a must- see seeing is young Mädchen Amick, whom we know from \"Twin Peaks\" - she is as sexy as it gets and pulls off some really cute dancing that really blew me away. As a special bonus you get short appearances of Mark Hamill (Star Wars), Clive Barker (Hellraiser) and Stephen King himself. The visual F/X were cutting-edge when the movie came out it 1992 - it was one of the first to feature computer-generated morphing effects. Still looks good today although not spectacular. What I enjoyed is that the filmmakers didn't try to take the film too serious which enables the viewers to just have a good time watching the film. Many may call the film campy, yeah there is some camp to the film. But I think that Alice Krige and Dan Martin carry the film very well with their performances.\n\nOverall rating: 7 out of 10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Caps Fan",
        "review_rating": "3",
        "review_title": "HAHAHAHAHA!",
        "review_detailed_main": "Oh dear me! Rarely has a \"horror\" film bored me, or made me laugh, as much as this one. After a spirited start with an intriguing premise, it descends into not much more than a slasher flick, with some supernatural and sexual asides. The usually excellent Alice Krige is wasted in this one, and the plot twists are ludicrous. Don't bother unless you're really desperate. Rating: 3/10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Pet_Rock",
        "review_rating": "7",
        "review_title": "Grade-A Cheese: The most fun I've had in a while.",
        "review_detailed_main": "A woman who hates cats (Alice Krige) and her son (Brian Krause) have moved into a small town, and must deal with a mean teacher (Glenn Shadix), their incestuous relationship, a lovely girl (Mädchen Amick) and one hell of a big secret.\n\nOkay, so technically, this is a \"bad film\". But, who cares? It's so very fun!\n\nImpossible things (involving corn) happen, people freak out about kitty cats, there's bad one-liners, there's too much cheese to handle!\n\nSo, yes. You will enjoy this. A lot. It won't move you, touch you, scare you, or thrill you in any way, but it will keep you entertained and laughing!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "jonathan45",
        "review_rating": "4",
        "review_title": "sub-par, could have been a better movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "view_and_review",
        "review_rating": "6",
        "review_title": "Cats Are Good",
        "review_detailed_main": "Only a month ago or so the world was treated to a home security video clip of a cat saving a little boy from the neighbor's dog. It was a sight to see. It is clear that Stephen King is a cat person (see Cat's Eye). Cats are the heroes again in the movie Sleepwalkers.\n\nSleepwalkers is about an inhuman freaky-deaky mother and son. As the opening caption stated, they feed off of \"the life forces of virginal human females.\" Apparently the son does the hunting while the mother stays at home and awaits nourishment. They've moved to a new town and identified a new prey and so the movie goes.\n\nThe movie was rife with clichés. You already know them: cat jumping out of the closet, assuming the bad guys is dead, exploding cars, etc. Besides the clichés and some so-so acting the movie was alright. Sleepwalkers were a different being to explore. Vampires, zombies, slashers and werewolves have been done so much that it was cool to see some other types of beings. The effects were really good for 1992. The movie was more of a thriller than a horror with some gratuitous blood thrown in there. The movie wasn't bad, it was well worth the price I paid to watch it. Nothing."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "FiendishDramaturgy",
        "review_rating": "1",
        "review_title": "Lost Opportunity",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kannibalcorpsegrinder",
        "review_rating": "9",
        "review_title": "Far better than expected effort",
        "review_detailed_main": "Arriving in small-town Indiana, a woman gets involved with a strange man and his domineering woman who each have a sinister reason for an extreme phobia towards cats as they try to blend in only to have word of their secret get out again while trying to live their lives.\n\nThis one was quite the overall enjoyable effort. One of the better elements in the film is the rather demented and utterly depraved mother-and-son relationship at the heart of the film. While this isn't the first time this kind of relationship was featured, this one is explicit in detailing the incestuous nature of what's going on with the two of them openly flirting and being tender with each other in far more blatant experience than expected. As well, there's also the deep make-out sessions they share as well as the sweaty sex scene between them that really manages to further this storyline which really carries the first half here. By going on the rest of the film with this already set-up, the other story lines here come across far more impactfully with their being placed alongside the great action featured in here, from the really fun car chase through the rural roads that comes with the great shock transformation and the novel manner of concluding, the fantastic ambush in the cemetery where he reveals his true nature to her before the chase around the woods and the great confrontation that occurs by the front gate which is what sets up the great finale. The house abduction comes with some great action of her breaking through everyone to take her away before the spectacular finale where the violence is turned towards humans and the action and intensity picks up, as the cats begin attacking more purposefully at the house by breaking in leading to some wholly enjoyable action to occur here as the monstrous secret gives this one plenty to like alongside the bloody kills. The other big plus here is the creature makeup which is sporadic but effective at displaying their powers and gives this enough positive elements to hold out the few flaws. The film's biggest problem is the lack of explanations for anything, from the origin of the creatures to why cats can kill them to why the teacher went after him to begin with as there's little explained at all within here in regards to anything going on. Beyond the fascination with the Native American mythology, that's all that's given about their history as sleepwalkers so everything here is really mysterious. Likewise, some of the violence towards cats could be problematic here as this tended to have full- on views of cats having their heads twisted off or bitten and shaken like rag dolls which isn't something that would be very appealing to many. These here are the film's biggest problems and hold it back the most.\n\nRated R: Continuous scenes of dead and mangled cats, on-screen animal deaths, Graphic Violence, Language and themes of incestuousness."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "bowmanblue",
        "review_rating": "6",
        "review_title": "Strangely watchable Stephen",
        "review_detailed_main": "Yes, it's a book-to-film adaptation of another one of Stephen King's horror novels. And, if you know anything about how well his stories transfer across medium, you'll know they have a history of not really working. For every Pet Sematery and IT there's a dozen 'Sometimes They Come Backs' and 'The Dark Halfs.' However, Sleepwalkers is oddly sit-throughable.\n\nI use the word 'sit-throughable' over good, because I want to set you expectations at the right level. You'll be okay to walk in and out of the film to make a cup of tea and come back without really missing that much.\n\nIt's about, er, things. They're like people during the day, but sometimes monsters. And they have powers. You don't really get much back story concerning where they're from, what they are and what they're capable of, but never mind. They're a mother and son couple. And, when I say 'couple' – I mean couple. Yes, yuk! They move from town to town sucking the life – literally – out of people – mainly teenage girls the son manages to seduce with apparent ease. And did I mention they don't like cats? And it's not a case of a mild allergy where they sniff a bit whenever Mr Tibbles walks into the room, they go a bit mental. But then cats hate them, too.\n\nYeah, it's all a bit of a mess. They move to a town and the cycle starts all over again, but will they manage to suck the life out of Twin Peaks' Madchen Amick? Yes, this is probably her biggest role since leaving the cult TV show and she... well, she's okay, but much capable of more.\n\nBasically, if you don't mind cheesy horror that could be so much better then you'll be okay with this. It's short. That's a bonus. It doesn't drag. But don't expect anything to really make sense. Things happen just to move the plot forward and that's about it. Your expectations need to be low. In fact, in these days of remakes and prequels, this is one film I'd actually like to see a prequel to. There's so much left out of the history of the characters, a prequel might explain some of it."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "JamesMetal1",
        "review_rating": "3",
        "review_title": "sucked, sucked, and sucked. Did I mention sucked?",
        "review_detailed_main": "Ok, I first saw this movie like at 9:00 on Cinemax a few weeks ago and thought it would be award winning, boy was I 180d on that. This movie bit the big one. I mean, the mother of the monsters shows her true form only at the end of the movie. I'm going \" That's it? Why doesn't she show it briefly a little bit more earlier in the movie.\" The plot being the mother and son feast on the blood of young women. Wouldn't it be better if they just went on, you know, a killing spree killing like a couple of young women each, then having the sheriff or a cop find out about and get into the old find a way to kill the monsters,save the young woman/women, and have 1 or 2 more people killed in the process? I think it would be a hell of a lot better that way. It also sucks because the son is the main character and he gets killed first. Why not get rid of the mother first? Plus, how does she have that strength at the end of the movie when she starts killing people? She said it herself she was too weak. What the heck was wrong with Stephen this time? I can never, ever dis the acting on any movie by any actor, after all, they try their best. If it weren't for good acting, I'd have given this movie a 1/10. 3/10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "richard-wheeler",
        "review_rating": "",
        "review_title": "\"Why don't you see yourself as lunch?\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Fella_shibby",
        "review_rating": "5",
        "review_title": "All ye kebabs lovers, we have 'cop kebab' here n a corn cob as a deadly weapon.",
        "review_detailed_main": "I first saw this in the mid 90s on a vhs. Stephen King's name was suffice to shell out ten rupees for the rental. Revisited it recently. BA_Harrison rightly stated in his review bah the corn cob stabbing. U have to see it to believe it. The movie starts well with what appears to b some ritual killing of lots of cats n a dead body of a small girl as if she had been sucked out dry. We r later introduced to a mother n son who r d last remaining shapeshifters. They can become invisible along with their car, they have cats as their enemies n the mother needs to have incestuous relationship with the son to constantly feed herself. The middle act becomes a bit comedic with all the faces n body turning into cat -like, plenty of gory kills, Ron Perlman's fingers r chewed off, etc."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "vampiri",
        "review_rating": "7",
        "review_title": "Horror movies are not what they used to be",
        "review_detailed_main": "Nope! Horror of today is not as good as it was 20 odd years ago. Once or twice we see a couple of scary ones like Insidious and the Lady in White. But these type of horror films rely on sound and surprise.\n\nPlot: teen girl gets swept away by the new boy in Town. Only he is not just a boy...\n\nWhat horror Movies lack today is mood and color. By \"mood\" I mean the style John Carpenter shows off in his early Movies like Halloween, the Thing, Escape from New York, They Live, Attack on Presinct 13 and Prince of Darkness. It is, of course, difficult to explain \"mood\", but those of you who know Carpenter's work and/or are horror fans do likely know what I mean. By \"color\" I mean the tone of the print, it is kind of bleak or dull which adds so much to the mood.\n\nMood and color is what makes Sleepwalkers so enjoyable, as well as the effects which are good and still hold.\n\nThe cast is convincing, the then soon to be Twin Peaks star Mädchen Amick is Lovely, Brian Krause works both as the innocent boy and villain. Ron Perlman appears as well, he hasn't changed a bit since then, neither his acting nor looks.\n\nThere are a couple of goofs, illogical moves and bad acting from some of the cast.\n\nSleepwalker is one of the better King adaptations I have seen. Much better than the terrible the Langoliers, just as good as Salem's Lot, slightly below Pet Sematary and the Dead Zone.\n\nI give it 7 out of 10 due to mood, color, high production values and its compact storytelling, i.e. there is no dull moments slowing down the story."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Cochese-6",
        "review_rating": "2",
        "review_title": "Wow... this was disappointing",
        "review_detailed_main": "\"Sleepwalkers\" is the first film which Stephen King has written a script for. Given this, and the excellent Santo & Johnny song that they used as the theme of the movie, you would be expecting a odd, and ultimately fulfilling viewing experience. Unfortunately, that's not what you'd be getting. The thing is, they could have probably made it a good movie. The beginning is intriguing what with it's small town spooky atmosphere. But something strange happens about 20 minutes into the film. The film turns funny for no apparent reason! From that moment on the whole atmosphere of \"Sleepwalkers\" is ruined.For those of you who have seen it, who can ever forget good old Johnny screaming out \"COP KABOB!!\" after jabbing the pencil into that one cop's ear?!? But don't get me wrong, the humor has no redeemiing quality. I just rented it again to see if mabye I was wrong the first time around, given how original the plot sounded, but I was right. Man, what a waste. I can't believe they got the rights to that Santo & Johnny song. I gave this a 2."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Poppysma",
        "review_rating": "6",
        "review_title": "Cats, candles and coprolalia",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Honesticedragon69",
        "review_rating": "1",
        "review_title": "At Least Alice Kraige Is In It.....",
        "review_detailed_main": "So, let's get the Obvious out of the way, yes, I like Alice Kraige as an Actress judging from the roll that I know her from which is playing The Borg Queen from Star Trek First Contact and Various of other Star Trek Projects. And even her small roll-on Thor The Dark World Good I thought as Eir. So anyways the Only Good and Positive things that Things that I could say about this movie is, that the first is that I Love and Adore the Poster and the Shout Factory Variant Cover that I have both of those are Absolute Gorgeous it just that Unfortunately the Film itself is not or rather Far from it, especially the Shout Factory variant one, that's the Best Part about this Film Sadly. And the last thing I like about it is the Concept of it was just handled poorly, in My Personal Opinion.\n\nNow On to the Negative Parts the first must be that I Personally don't find any Characters Particularly interesting or even remotely likeable. The Next that the Special Effects are really Laughable Sadly especially that one part where Charles Bradly only transformed his face during a car chase scene to scare the cop or something. Well, let's just say I've seen Better Transformation Effects and Just Effects in General in the Live Action Super Mario Film from way back when, and I'll even go as far as it's even better than the Special Effects and Effects in General then The Live Action Dragonball Evolution Film Combined to the point where it makes those Films look like Classic and Master Pieces. That goes for the Character Likeability and Story and all-around Film as well. In the Age of Remakes and Reboots and everything in between, this Film should be Remade in to something hopefully Better, because I truly wanted to Enjoy this movie. Just Unfortunate out of all of the times that I've tried watching this I've only Managed to only watch All the Way Through Once Only Once. I Guess the Title Fits Sleepwalkers, because I Feel you need to Sleepwalk through this Film, if you're going to get through it. Sorry about the Bad Pune."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "HorrorDisasterGuy-90617",
        "review_rating": "7",
        "review_title": "Stupid horror movie, but really enjoyable.",
        "review_detailed_main": "The story is unique with vampires that are also werecats that feeds on life force from a female virgins. The movie moves along in a decent pace and it's never boring throughout. I found the Sleepwalker creatures to be interesting creatures with their background and powers. I like how the cats in the town are suspicious on them and the Sleepwalkers are afraid of them. I also found the climax to be really enjoyable and I like how it ends.\n\nOne of the flaw is that the tone feels really uneven with some parts that feels way too comedic and the movie doesn't do a good job on the creepiness factor. Also the movie is easily predictable and have some cheap jump scares. And some scenes happens way too quickly."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Samiam3",
        "review_rating": "5",
        "review_title": "Stay away from screen writing Mr. King",
        "review_detailed_main": "In his work, Steven King is usually good at making nastiness into scariness. It works well in 'The Shining' and 'Misery', but not with Sleepwalkers, which is just pain vicious as well as cheap and gory. If this was written as a novel, Sleepwalkers might have worked. As a novelist, King is good at pacing, fleshing out characters, and making a story frighteningly subjective. As a screenwriter however, he is reduced from a genius to a cheap Hollywood story teller. Such a shame.\n\nCharles Brady and his mother are new residents in a small Indiana town, coming from Ohio. They are the last of a dying breed of monsters, known as Sleepwalkers. Wherever they go, Charles is always forced to feed his mother. This time, his selected victim is Tanya, a girl in his class who likes artistic photography (and him). After a failed attempt on her life which leaves Charles mortally injured, Mrs. Brady (who is subject to the worst acting in the genre) goes crazy and lots of blood and guts follow. The shallow story ends in a lame showdown between her and the sheriff's department along with all the cats in town.\n\nLike so many similar films, Sleepwalkers amounts, to little more than a gory, dumb, and even perverted piece of B-movie making, and is too grizzly to be fun. With Stephan King in the writer's chair, I had some hope, but that was a mistake. In the end, I suppose there is a little fun to be had with here (like seeing King act) but not enough to make it worth your time. Skip these vampires and try 'The Lost Boys' or 'From Dusk Till Dawn' instead."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "lee-96696",
        "review_rating": "8",
        "review_title": "Purrfect mix of horror, campy comedy, cats; life force vampires too",
        "review_detailed_main": "I was not expecting much, since I barely remembered seeing it back in 1992 on its release. But what a fun film! It has aged really well.\n\nSleepwalkers is a horror film written by Stephen King (and not adopted from a novel or story). It stars Brian Krause as Charles Brady, an adolescent \"sleepwalker\" who, along with his mother Mary (Alice Krige), is am ancient shapeshifting energy vampire who feeds off the life force of virgin women. The film also stars Mädchen Amick as Tanya Robertson, the young woman who becomes Charles's target.\n\nThe film starts with dozens of cat corpses hanging outside the Bradys' last home in rural Ohio. Cats see through the Brady's shape shifting ways and get mightily peeved so it's cat traps and gutting for them. Worse, mom and sonny have exhausted the supply of virgins, so they move west to a small town in Indiana. Charles starts high school and immediately sets about to recruit Tanya. He attacks her on their first date, at a cemetery of course, and from there the fun begins.\n\nWe encounter bumbling country cops. Car chases. Shape shifting. Several cringe incest scenes. (But mom and son are really, down deep, not human but reptilian, so I guess it is OK). A hero police cat, Clovis The Attack Cat. His many cat friends who menace the Brady's homestead. Attacks on the locals. Impalings on a white picket fence. Even fun cameos: Tanya's parents are played by Cindy Pickett and Lyman Ward who played Ferris Bueller's clueless mom and dad. \"Tanya, be home by five!\" At the cemetery crime scene we run into Clive Barker, Tobe Hooper, John Landis and Joe Dante.\n\nBest performance: Alice Krige as the steely, protective mom-vampire. Kudos to the cat wranglers.\n\nGreat fun."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "LeonLouisRicci",
        "review_rating": "6",
        "review_title": "STEPHEN KING'S 1st TRY SCRIPT-WRITING...CAMEOS & FUN GORE-FEST",
        "review_detailed_main": "This One of those Times when so Many \"Names\" of Movie-Makers Congregate, that the Unspoken or even Spoken Mission was Endow the Project with a Wink and a Nod to Cover any or All Criticism that May Blow-Back and Bruise Egos or Perhaps to Defend an Indefensible\n\nIt's a Twisted Gore-Fest with Incest Lovingly Embraced Nakedly and on Full-Display.\n\nThis is Just \"Horror-Movie-Fun\"...Don't You Get It?\n\nThose with Screen Appearances...Mark Hamil...Clive Barker...John Landis...Joe Dante...Tobe Hooper...and the \"King of 'em All Y'all\"...\n\nStephen Shows His Face as a Grave-Yard Caretaker Saying Repeatedly...\n\n\"It's not my fault, it's not my fault.\"...Hmm, Wonder What He is Talking About Here?\n\nThe Mega-Selling Horror-Scribe with Millions of Fans, Stephen King Wrote the Script Intended for the Screen.\n\nFor Many who Read His Books and also Witness His Failed (by traditional metrics) Attempts at Writing and even Directing Movies,\n\nDoesn't Go Very Far, After the Fact, to Try and Rearrange or Put a \"Happy-Face\" on a Flop.\n\nThe Side-Attractions of \"Sleepwalkers\" are Many and are of Peripheral Intrigue that is Trivial but Intriguing Nonetheless to Fans of Horror-Movies and Movies in General.\n\nThe Story is an Ancient One of Wanderers Through the Ages of Spiritual-Sucking (their sustenance not blood) Vampire-Like Shape-Shifters...\n\nCat-Fever Sensitivities Disrupting, and can even Kill, Their Existence.\n\nThe Loving-Couple, Mother and Son in More Ways than One, Show Up in the 1990's and the Son (Brian Krause) is in High-School and Recruiting Feed in the Alluring-Form of Madchen Amick.\n\nMom (Alice Krige) is the Nurturing Type Devoted, Willing and Able to Fight the Cats and Small-Town Police.\n\nResulting in Gory Battles that the Movie Showcases with Repulsive Fangoria.\n\nIts Early Use of \"Morphing\" is also an Attraction for the Fan-Base, along with the Bloody Flesh-Ripping-Head-Bashing-Bone-Crushing Served on the Movie-Menu for those Hungry Connoisseurs that Eat this Stuff Up.\n\n2 Other Recognizable Faces Emerge... Glen Shadix (Beetlejuice) and Ron \"Hellboy\" Pereman.\n\nCat Lovers will Either Love or Hate this Feline-Infested Movie...They Rule this Thing from the Start...\n\nDefinitely a Must-See for Horror-Film-Fans...\n\nFor Others it May be too Silly, Incestuous, and in the Gore-Zone for those with Sensitive-Taste."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Gafke",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "I still can't believe I paid full ticket price to see this dung bomb.\n\nAn incestuous mother and son move from town to town, picking out virgins and sucking them dry...literally. Mother and son are members of some bizarre race of feline-people, yet they fear cats because cats can destroy them. Whatever. This movie is so stupid it hurts. The acting is atrocious, bordering on unbearable and unwatchable. The script is filled with unfunny jokes and even lamer attempts at seriousness. The plot makes no sense whatsoever and none of the characters are very likable at all...not even the virgin heroine, whose sole facial expression consists of bulging her eyes at the camera until they threaten to pop out on their stalks.\n\nI give this movie one star, and that one star is for all the poor feline extras who did not ask to be in this film. I hope they were paid enough catnip to keep the memory of this horrid excuse for a movie out of their little kitty minds for the rest of their nine lives."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "callanvass",
        "review_rating": "",
        "review_title": "entertaining as hell",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "TheMulderFox",
        "review_rating": "4",
        "review_title": "Heeere kity, kity, kity",
        "review_detailed_main": "A charming boy and his mother move to a middle of nowhere town, cats and death soon follow them. That about sums it up.\n\nI'll admit that I am a little freaked out by cats after seeing this movie. But in all seriousness in spite of the numerous things that are wrong with this film, and believe me there is plenty of that to go around, it is overall a very enjoyable viewing experience.\n\nThe characters are more like caricatures here with only their basis instincts to rely on. Fear, greed, pride lust or anger seems to be all that motivate these people. Although it can be argued that that seeming failing, in actuality, serves the telling of the story. The supernatural premise and the fact that it is a Stephen King screenplay(not that I have anything specific against Mr. King) are quite nicely supported by some interesting FX work, makeup and quite suitable music. The absolute gem of this film is without a doubt Alice Krige who plays Mary Brady, the otherworldly mother.\n\nKing manages to take a simple story of outsider, or people who are a little different(okay - a lot in this case), trying to fit in and twists it into a campy over the top little horror gem that has to be in the collection of any horror fan."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "AngelHonesty",
        "review_rating": "7",
        "review_title": "Flawed, and yet a good watch",
        "review_detailed_main": "I wasn't sure what to expect, lots of bad reviews, but it's really not terrible. There are some things in the movie that are odd, like the mother and son having a sexual relationship. Or the fact that not much is really explained of what is going on. It is cliche with the whole - we need a virgin to feed on thing. And the story is very simple, but aren't most horror movies simple? They're about someone or something killing people.\n\nSleepwalkers is a visually beautiful movie. Each scene is creatively constructed to appeal to the eyes. The main actors are stunning to look at with zero flaws. The simple story movies at a nice pace that quickly turns into a bloodbath. There are some cheesy moments with some very cheesy lines, but it adds character to the film. And it was nice to get a glimpse of the great Stephen King in one of the scenes. If you're a fan of old horror films, I would definitely add this one to the watch list."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "5",
        "review_title": "Clearly not a good movie, but not entirely void of entertainment value",
        "review_detailed_main": "I've never really been a fan of Stephen King. He always seems to write basically the same story, the same characters... and use the same scares. The movies based on his films are not always bad... but for the most part, they are even worse than his books. Mick Garris is the man who typically directs films of the books King writes. Usually these films are made-for-TV... and after/if you see this exception, you'll know exactly why that is. You'll also realize that it's for the best. The film is about vampire creatures who are deathly afraid of cats, apparently because of the animals importance and symbolism in ancient Egypt(!). The creatures look quite a lot like cats themselves... when not in human form, of course. They have the ability to cloak themselves and the things around them... except, of course, from the sharp senses of their natural enemy, the cats. The ridiculousness of this film doesn't stop there... but I wouldn't want to spoil anything. The film is quite entertaining, if only for the fact that it's so incredibly poorly made and corny. The one-liners, the effects, the situations... oh the humanity! It needs to be experienced to be believed. The plot is decent, however unbelievable. The pacing is fairly bad; for being so short, the film is boring a lot of the time. The acting is barely passable. The characters are mostly stereotypes. The dialog has its moments, but they're few and far between. I'm not certain if the film was supposed to be corny and cheesy, or if King just gave up half-way through the script and started making a stronger emphasis on the humor. There an idea in the film that the audience should feel sorry for the sleepwalkers, but it's so vague and underdeveloped that it doesn't work. Then there's the incestuous mother-son relationship between the sleepwalkers, which I'm sure has turned many viewers(potential as well as actual) off(pardon the pun), as well as disgust them to the point of turning it off or deciding against watching it altogether. Something that will probably be a kick to the horror-fans out there(it was for me, anyway) is that five known names in horror have cameos in the film; Tobe Hooper, Joe Dante, John Landis, Clive Barker and Stephen King himself. In conclusion, this film is really only worthwhile for die-hard fans of cheesy horror flicks. I recommend it to fans of the genre and/or of corny horror films, as well as anyone who's willing to sit through it to spot one or more of the five aforementioned horror persona's. 5/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Scarecrow-88",
        "review_rating": "7",
        "review_title": "Sleepwalkers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "pingonvodka",
        "review_rating": "1",
        "review_title": "Here's yours",
        "review_detailed_main": "This film is total garbage but finds itself among a category of film known as 'so bad it's good'. There is, technically speaking, nothing of genuine value about this flick. That is not why I find this film unbelievably good. There are performances in this that are so ungodly awful, some plotlines so inconcievable, that not even a cast of magical cat demon people with ridiculous, spontaneous powers is the worst part. Unless you have read the source material, you will have no idea where the story will go. Putting this on is still one of the best mistakes the five of us made during our bender. This movie is a masterpiece. Please watch this movie."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "CharltonBoy",
        "review_rating": "6",
        "review_title": "Silly ,but not without its moments",
        "review_detailed_main": "Sleepwalkers comes under the category of one of Stephen Kings poorer adaptations but by no means the worst. This is about a mother and son who move from town to town living on the blood of young virgin women. They are monster like shapeshifters that are incestious and charming when trying to lure their victims. The only way they can die is if they are scratched by a cat! i know it's hardly a steak through the heart but thats the story. The first 45 minutes is quite good and does have it's scary moments but the longer the film goes on the sillier it gets. Stephen King makes his obligitory cameo appearance as the caretaker of a graveyard. 6 out of 10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "108YearsOld",
        "review_rating": "3",
        "review_title": "Sleeper not",
        "review_detailed_main": "The movie is so much better in the first half and really had potential to grow into a memorable movie, unfortunately plots that have built up are just falling apart or it feels like a different person is directing the movie after Charles turns into a manic killer in the graveyard. One star for the theme song Sleepwalk."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "benjithehunter",
        "review_rating": "8",
        "review_title": "Watch Out For Corn on the Cob!",
        "review_detailed_main": "Stephen King's Sleepwalkers is one of the precious few screenplays that King himself has written specifically for the screen and it's a fun one. It centers around a shapeshifting mother and son who need young virgins to feed on to keep themselves alive.\n\nSleepwalkers is a tonally odd affair from the get go. There's a lot of post-modern humor and some of it is genuinely cheesy, but the basic story is interesting and the actors treat it with the upmost sincerity. Alice Krige deserves special mention for her slinky performance as the mother. It's impossible to take your eyes off of her throughout and she also gets to perform one of the single most bizarre murder scenes in the history of film when she impales a victim with a piece of corn on the cob. Sleepwalkers is a lot of things, but you can't say it's forgettable."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Leea_GoDuke",
        "review_rating": "3",
        "review_title": "Good premise, bad movie.",
        "review_detailed_main": "I love the whole 'idea' of the movie, but the actual movie itself leaves a lot to be desired. The only thing that makes it bearable, to me, is Alice Krige. Her performance as Mary Brady, Charles's maniacally protective mother, is one of the very few bright spots in the film. She says the name 'Charles' in a way that makes it sound exotic & foreign. I love it. Unfortunately, the film never actually gets scary, and when it tries to be, it's just embarrassing. Not the worst to watch if it's already on TV, but not worth the rental price, either."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Milo Jerome",
        "review_rating": "",
        "review_title": "A shame, but it's rather shameful.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Rodrigo_Amaro",
        "review_rating": "3",
        "review_title": "Cats United Will Never Be Defeated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "The_Void",
        "review_rating": "6",
        "review_title": "Rubbish, but in an entertaining way",
        "review_detailed_main": "By 1992, pretty much everything that Stephen King had ever even breathed on had been adapted to the screen already, so filmmakers had to start raiding King's catalogue of unpublished stories. One of them came across a story called 'Sleepwalkers', and obviously thought it would be a good one to adapt. I don't really know if it was a good idea or not; as while the story itself does have massive potential, this film doesn't realise it. Having not read the unpublished work, I cant say whether this is the fault of the author or the filmmakers; but given the lack of quality in most King films that doesn't translate to the books - I don't think I'm being unfair in blaming the filmmakers. The story has all the elements to make a great horror, and follows the incestuous relationship between a mother and son. There's more, however, as they're both 'sleepwalkers'. The last of their kind, these sleepwalkers are like vampires only more feline. They're afraid of cats for some reason, and they need to suck the life from humans in order to survive...and mother hasn't eaten in a while.\n\nTo be fair, this film isn't a complete dead loss. It is entertaining, and although many opportunities are missed; some aren't, and they make the film better. Personally, I just can't get over how great this film could have been. We have an incestuous relationship at the centre, which is as disgusting as it is intriguing. Furthermore, these two have only one fear; the normal domestic feline, and these animals surround their home. Add the pessimism of the fact that they may be the last of their kind, and a whole new breed of monster into the mix and you've got a film that should be garnering universal praise. The makers of this film were clearly more bothered about making a quick buck than a good movie, and that is shown by the fact that the movie is resoundingly low quality, and it features a large number of genre cameos - which serves as an obvious draw for horror fans. I really can't find a single good reason to recommend this film. I won't lie; I did enjoy it, but that was more because of my strange love for rubbish films. If you're a King completist, you can get away with seeing this by using the \"it was unpublished!\" excuse...but I suppose there's worse films about if you do want to waste your time."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "vehvilainenniila",
        "review_rating": "5",
        "review_title": "This shi* really scared me off",
        "review_detailed_main": "Movie was well producted in my opinion but the story was not it for me. Loved the theme of it but it was quite poorly writed. Just feels like im watching not fully done product. Idk. Still the 90 horror movie theme and atmosphere were all there and i loved it.\n\nJumpscares looked like they were maked poorly. Not a fan of jumpscares but it really is a big part of this movies atmosphere.\n\nAs a fully product the shi* was scary as my dads belt. But the plot was not for me really looked like they just didnt care how they do sum things innit. Dont watch it before bed lol. Had nightmares that night lmao..."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "pixelman-1",
        "review_rating": "6",
        "review_title": "I can buy into the craziest of ideas except one...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Aaron1375",
        "review_rating": "5",
        "review_title": "Could have been better, but it had its moments.",
        "review_detailed_main": "Not all that good or bad this film suffers from a plot that could have went somewhere, but instead gets rather stale. The story of a mother and son who have a strange secret (they are some sort of monster) come to a new town where they must find someone to feed upon. This mother and son do have a nemesis though, a rather strange nemesis considering what the mother and son look like in their more natural form. Well the son soon finds a girl and he sort of falls for her as she seems to understand his plight. This leads to this and that and a confrontation with a police officer and another at a cemetery. Then the final confrontation and you will notice not really all that much is developed during this time. Sure you get an interesting kill or two, but for the most part the only thing keeping the movie afloat is Alice Krige's acting ability. She does the psycho loving creature very well here. So the movie does go by fast, but for a new monster to be introduced it isn't really fleshed out all that much except of course for the very bizarre weakness."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "lee_eisenberg",
        "review_rating": "6",
        "review_title": "now this one was just ridiculous",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "snitzell",
        "review_rating": "3",
        "review_title": "Ahead of it's time.",
        "review_detailed_main": "Sadly the older reviews are sickened by the incest but everything since 2016 is more Ho Hum she probably 'DATED' her father so now she's 'DATING' her son...several times a day. And that no talent screamer crossed a line when she told the cop 'But we came here in a red car. Now it's a blue Trans-Am. People in rural areas without running water know what a MUSTANG is. If she didn't there's a Mustang emblem on the dash.....Golly gee Charles what's this cute little horsey thing here?\n\nAlthough boring an attaboy to King for wanting more screen time but he has no acting talent...just do the same scene several times with different guys 'This ain't my fault. I locked the gate!!!!'.Well good Forest,when we leave you can cut the grass on the football field.\n\nAlthough the Director missed something the entire film there seemed to be an actual sub plot building with the screamer's family being possibly a worse type of monster but it was accidental.\n\nIn a Child's Play sort of fashion this movie with another Chucky is not a bad comedy if you accept it for what it is. Loved the screamer at the end who just had her whole family and every cop in town murdered while hideous monsters tried to kill her being so calm 'Clovis we're all alone now.'Too bad the writers missed the obvious fact the Trans Am would have become visible when monster woman died. The screamer would have owned a sweet car to impress her friends next day ay school."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "BrandtSponseller",
        "review_rating": "10",
        "review_title": "Easily transcends any flaws",
        "review_detailed_main": "As we discover from an opening title card, The Bradys--Charles (Brian Krause) and Mary (Alice Krige), are \"sleepwalkers\"--shape-shifting, leonine, proto-vampiric and lycanthropic humanoids who must feed on the essence of a virgin to rejuvenate themselves. Because of the nature of their sustenance, they are usually quickly found out and must move from town to town like gypsies. As the film starts, they've just moved to a small town in Indiana.\n\nSleepwalkers has a lot going for it, most strongly its attitude. This was writer Stephen King's first script written exclusively for the screen, and director Mick Garris' first King project, so they both have something to prove. They did so by creating a \"balls to the wall\" horror film that's just as daring and disturbing in its dramatic material as it is in its more traditional horror material. At least in retrospect, it may be a bit rough around the edges, both technically and artistically, and its final moments are slightly clichéd, but its spirit easily makes up for that.\n\nThe beautiful Santo & Johnny song \"Sleepwalk\", the B.J. Cole version of which was also used to great effect in 12 Monkeys (1995), may have been the catalyst for the whole affair. I can just picture King listening to the song, his imagination going to work on a twisted demonic family slinking through the night seeking the élan vital of a virgin. The song occurs a number of times throughout the film, always during intimate moments between Charles and Mary (whose very names have countless historical connections, not the least of which was a skewed-by-today's-mores engagement between Queen \"Bloody\" Mary Tudor and Holy Roman Emperor Charles V), whose relationship is sure to shock some viewers. Given my artistic/philosophical dispositions, motivations, and views, I'm always a great fan of taboo breaking, so putting this material at the beginning of the film already had me strongly on King and Garris' side.\n\nThe performances in the film are delightfully curious. Partially due to King's writing, the characters all have distinct quirks, and the cast plays them with a subtle exaggeration that almost threatens to become camp, but remains more in the realm of surreal weirdness. Many of the supporting roles stand out just as strongly as the principles, especially Jim Haynie as the sheriff who loves sing-songy adolescent dirty rhymes, limericks and the like, and Ron Perlman as the police captain who is comically gruff and cynical, as only Perlman can be. There are also a number of cameos that are extremely fun for genre fans--King, Clive Barker, Tobe Hooper, John Landis, Joe Dante and Mark Hamill.\n\nThe gore and special makeup effects are excellent for the film's era. Sleepwalkers is also one of the earlier horror films to use computer-morphing, ala Terminator 2 (1991), for special makeup transitions. Genre fans will take note that the \"early\" stages of the sleepwalker transformation strongly resemble the vampire makeup in the Buffy the Vampire Slayer (1997) and Angel (1999) television series. It's difficult to imagine that this was not one of the influences on the Buffy development team.\n\nShot in an oddly bucolic area of Los Angeles near Beverly Hills, Sleepwalkers also features terrific locations, sets and cinematography. The Brady house is intriguing in that it looks a bit dumpy from the outside, but the interior is almost gothically lush. There are also a lot of cats throughout Sleepwalkers, and it's the first time I can remember the mere presence of domestic pets doing so much to create an overall eerie atmosphere."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Bloodwank",
        "review_rating": "6",
        "review_title": "Very silly but somewhat endearing shape shifter schlock",
        "review_detailed_main": "It can be a real sad thing to see, the yawn of the gap between potential and execution. Sleepwalkers has no time for sadness though, once it ditches the interest inherent in its plot it simply makes a gleeful dive for the pools of absurdity, ending up a pleasingly ludicrous romp if you don't take it remotely seriously, or have some booze on the go. The plot sees teen Charles Brady trying to make his way in a new town, with the hots for lovely classmate Tanya. However there's the small matter that he also has something hot going with his gorgeous mom Mary. And both Charles and Mary are immortal lifeforce draining shapeshifters with a thirst for blood and a mortal fear of cats (their only weakness). In the hands of a decent writer and a director with a flair for the erotic this could have been wonderful stuff, but instead this was the first Stephen King project written wholly for the screen and it isn't one of his better efforts. King seems always to have had problems with letting stories lurch out of control and this one does so around about the halfway mark, maybe earlier. Its a shame as the opening discovery of a derelict house replete with cat traps and a body in a cupboard suggest some measure of menacing potential but once the slaying starts and the film lays on the full range of Charles and Mary's abilities it gets very silly very quickly. Not that I minded too much, as as far as silly films go its done with a good deal of gusto. The leads are fortunately game, Brian Krause has a good youthful mix of the awkward, arrogant and aggressive whilst Madchen Amick does a good job of frightenedly reacting to situations as Tanya. Alice Krige is the standout as Mary though, radiant with dreamlike seductive elegance she is a treat for eyes and ears and really throws herself into the part, making for some good chuckles at the increasingly idiotic dialogue she spouts (seriously, one or two of her one liners are horrific). There are also for no good reason a rash of blink or you'll miss 'em cameos for various horror luminaries such as Tobe Hooper and Clive Barker, I guess they were all in on the joke. The pace is smart too, and once the film builds to a head it sustains a sense of lunatic fun till the end, with a bit of good time bloodshed, some nicely shonky visual effects and even a cool monster. All in all this isn't a terribly good film, as many others have noted. I enjoyed it though, I guess I'm more disposed to this era of junk than most. Not especially recommended unless this sort of thing is really up your street, but a fair 6/10 from me."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "pearcebelshaw",
        "review_rating": "2",
        "review_title": "Stephen King made a Anime!",
        "review_detailed_main": "Incest, check! Rape, check! Cats, check! Equals Anime!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "jordanzumbahlen",
        "review_rating": "",
        "review_title": "Worst movie I've ever seen.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "mcpalmer-82208",
        "review_rating": "3",
        "review_title": "3 enthusiastic stars",
        "review_detailed_main": "One of my all time favorite bad horror movies. Love to show this one to unsuspecting newbies. A little campy, a lot incestuous. Clovis is my dream cat."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Rainey-Dawn",
        "review_rating": "6",
        "review_title": "Not All That Good But Entertaining",
        "review_detailed_main": "First of all I would call this a comedy-horror - there is so much deliberate comedy in this one that it's hard not to tag it as such.\n\nSecondly, this isn't King's best work and it's not a heavy film like \"The Stand\", \"The Shining\" or \"Stand By Me\" for examples but it is a fun, light horror film that is good for a few giggles.\n\nThird: Cats rule!\n\n6/10."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "ksf-2",
        "review_rating": "5",
        "review_title": "not the best stephen king.",
        "review_detailed_main": "According to the card, this takes place at Bodega Bay, which just happens to also be where Hitchcock's Birds took place. It's a Stephen King story, which usually rate pretty high. not this one. The cops arrive to find cats. dead cats. and a dead body. i only recognize a couple names in the cast list, and they aren't in the lead roles. which probably explains the pretty low rating. charles, the new guy in town starts getting hassled when he speeds around town in his flashy car. and of course, the bodies start piling up. apparently they can make things disappear, like his fancy car that everyone knows by sight. cheesy acting. cheesy special effects. so many cats! this one just wasn't up to stephen king standards. directed by mick garris. they worked on many projects together, but this wasn't the best one. king even has a couple lines in this one, and they probably should have been cut also."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "SnoopyStyle",
        "review_rating": "6",
        "review_title": "Liked the concept more than the execution",
        "review_detailed_main": "A Sleepwalker is a nomadic shape-shifting creature with human and feline origins vulnerable to the deadly scratch of the cat. It feeds upon the lifeforce of the virginal human female and is probably the source of the vampire legend. The police investigates the Brodies residence in Bodega Bay, California where mother and son have gone missing. It is bloody and filled with dead cats. They find a mummified little girl. In Travis, Indiana, Charles Brady (Brian Krause) lives with his lover/mother Mary (Alice Krige). They have their hatred of cats. He has his sights set on classmate Tanya Robertson (Mädchen Amick) who works at the local movie theater.\n\nI like the Stephen King concept but director Mick Garris fails to bring enough cinematic style to the movie. The effects range from cheesy bad to competent. The monster cat looks rather uninspired. The big full costume is a little bit more appealing. The blood work looks low budget. The general tone of the movie is a simple TV production. It never elevates the tension or the scares. I do like the fire work. The special effects run the whole spectrum of old fashion with a couple of weak CG additions. The three main leads do a relatively good job especially Alice Krige. The mother son creepiness is good. The movie could held it back to be revealed around the middle and pushed it a little bit more. The cats are a fun touch. A big problem with the script is that the whole movie is revealed early on. This movie could have used a bit of mystery."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Bored_Dragon",
        "review_rating": "5",
        "review_title": "Cats Rule",
        "review_detailed_main": "\"sleep'walk'er n. Nomadic shape-shifting creatures with human and feline origins. Vulnerable to the deadly scratch of the cat, the sleepwalker feeds upon the life-force of virginal human females. Probable source of the vampire legend.\" - Chillicoathe Encyclopaedia of Arcane Knowledge, 1st edition, 1884\n\nThe first half of the movie is quite promising and I was glad to finally have the opportunity to see the horror that is also a quality movie. Adapted from the story by Stephen King, directed by Mick Garris, with a bunch of familiar faces, among which are Leo from \"Charmed\", Shelly from \"Twin Peaks\", enchanting Alice Krige, Hellboy, John Landis, as well as my favorite horror authors Stephen King and Clive Barker in minor roles. Unfortunately, somewhere around half, movie unexpectedly turns into completely ridiculous crap and stays that way till the end.\n\nThe epilogue, which I would like to add to the end of the film: Half a century later we see Tanya, which has since remained the old lady spinster, lying dead on the couch in a dusty little apartment, surrounded by dozens of cats. I am not saying that this would significantly improve the impression, but a bit of black humor is always welcome spice.\n\n5/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "adambombnola",
        "review_rating": "6",
        "review_title": "One \"cop kebob\" coming right up.",
        "review_detailed_main": "Original, over the top fare with a side of cats. Garris and King cook up one hell of a romp in this dark fairy tale. You'll laugh, you'll cry, you'll squirm."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "lisafordeay",
        "review_rating": "5",
        "review_title": "Hilarious",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kysta",
        "review_rating": "8",
        "review_title": "Transported into a surreal fun story",
        "review_detailed_main": "Watching this again today in 2023 and still one of my all time favs from the 90's. Unlike some movies you go back to revisit this one has aged on the better side thanks to quite a few factors.\n\nGo into for what it is...a fun, surreal ride with a creepy story. Not straight horror nor scary. I never actually read the book (not a huge fan of King's writing) but think it is time i actually did to see what further that may add to the story. Great cast, good story and a leader for it's time attempting some new and cool effects.\n\nThe humor is well played and appropriate giving it a light hearted approach among the fun madness. And cats, so many many cats lol."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kosmasp",
        "review_rating": "7",
        "review_title": "King made me do it",
        "review_detailed_main": "I think I have to read the book this is based on. Stephen King may have a small role in this (and many other very well known horror faces pop up here and there), but this feels ... strange in so many ways. Not all good that is.\n\nThat begins with the scene King is involved in. I reckon it is supposed to be funny ... yet the joke is not really translating. Or aged quite badly. The effects, if you watch the uncut version are more than decent. And this gets quite violent. The \"real\" effects that is - because the \"CGI\" is quite ... bad. Especially the \"morphing\" scenes. Very badly aged - no pun intended.\n\nMädchen Amick is as innocent as an angel may seem - on the other hand, her friends make quite the nasty hand gestures when she is about to go out on a date ... or just hang out with the new boy. These weird moments mount up to quite the crazy thing - a really weird mixture you get served here.\n\nAdd to that the cats that are conveniently popping up (literally) and you may go insane if you try to make sense of it all. Again, I can only imagine the book being so much better ... or at least my imagination of what King has put on page."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "mwilson1976",
        "review_rating": "5",
        "review_title": "Cheesy and borderline average Stephen King horror film about shape shifting vampires.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "craiglappe",
        "review_rating": "",
        "review_title": "Good Movie. Why is there so many bad reviews?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "One of the worst Stephen King adaptations",
        "review_detailed_main": "Don't get me wrong I do like Stephen King a lot, his writing is growing on me all the time, and I do like a vast majority of the adaptations based off his work. Sleepwalkers, alongside TommyKnockers and Thinner is one of the worst King adaptations for me.\n\nAlthough most of the effects are corny, some of the transformation sequences are surprisingly neat and some of the cameos from King himself, Clive Barker and John Landis are fun to spot, even if they pointlessly come and go.\n\nOn the other hand, that's it. The film starts off shaky with a daft prologue and right up to the equally daft ending it never recovers. The pace is disappointingly dull, the dialogue is underdeveloped and reeks of cheese, the plot is thin and idiotic and there is no genuine atmosphere and jolts as a result. Apart from the fun to spot cameos, the acting unable to do anything with sloppily written characters is dire. Director Mark Garriss does try his best, but he is hampered by the mess that are the script, pace and story, so all the flashy gyrating camera work seems like a wasted effort in the end.\n\nIn conclusion, a mess and one of the worst films based on the work of Stephen King. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "zombiezen",
        "review_rating": "6",
        "review_title": "Purrrfect trash",
        "review_detailed_main": "I hated this film when i saw it at the theater, but years later on dvd it\"s actually quite an enjoyable campy horror film and Alice Krige is great in her role as the mother. The rest of the actors are bad to moderate in their ability to perform but this does not take away from the film.\n\nThe plot is about a pair of Shapeshifters, mother and son, who are also lovers. They can be killed by cats, so they avoid them like the plague. The effects range from poor(the effect when he transforms with the cop) to excellent(all the dead cat corpses at the first house). It could have been written better sure, if it was supposed to be taken seriously.The gore effects could have been more explicit, and it could have been much scarier, but then it would be Sante Sangre or Track 29 and it would not be this movie, and that would be a shame cuz this flick is purrrrfect the way it is."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Rumples",
        "review_rating": "5",
        "review_title": "A barely watchable 'B' movie",
        "review_detailed_main": "This film is the type of thing you would have liked to have seen at the drive-ins on a date, a little bit scary and certainly not too demanding. Unfortunately, that's about all there is to it - it appears to have been made for the late night cheesy horror slot. That said, it is not the worst movie in the world. For some, Kreig's performance will hold some interest apparently, for me, it was the lovely Madchen Amick that made it tolerable. In all, wait for this to come on t.v. My vote 5/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "paul_haakonsen",
        "review_rating": "6",
        "review_title": "This is good old classic horror movie...",
        "review_detailed_main": "The 1992 \"Sleepwalkers\" movie based on a Stephen King story is actually not all that bad. In fact, it is a movie that I have seen maybe four or five times since it was initially released in 1992.\n\nFor a horror movie, then the storyline and script is fairly straightforward, albeit offering very little in terms of surprises or keeping the audience guessing the outcome of the movie. But still, the movie is actually entertaining and enjoyable. And I will say that this movie has that particular feel of a good old classic horror movie to it - you know, the way that they used to make horror movies.\n\nThe story briefly summarized is about two shapeshifters having relocated to a new town where they have to find sustenance off of the local residents. I am not going to delve further into details about this story, as it is one that you should watch for yourself.\n\nWhile \"Sleepwalkers\" definitely bears the passing of age and time on its CGI effects, the practical effects and creature designs actually still look good when you watch the movie today in 2020. So the bad CGI is not a major concert for the movie.\n\nThe movie bolsters a pretty nice ensemble of cast, which includes the likes of Brian Krause, Mädchen Amick, Alice Krige and Ron Perlman. The movie also have some nice appearances from Stephen King himself, along with Clive Barker and Tobe Hooper - yes indeed. And noticeable is Mark Hamill in the start of the movie. This movie was definitely carried so nicely by Alice Krige, to the extend of where it became her movie. She was so well-cast for this particular role and movie.\n\nIt is rare that I really notice the soundtrack for a movie, but for \"Sleepwalkers\" I must say that the music was great. Especially the main theme, that is oddly haunting and beautiful at the same time. Once you've heard it, it is hard to forget this particular melody.\n\nMy rating of \"Sleepwalkers\" is a sound six out of ten stars, and if you haven't already seen this 1992 horror movie, and if you are given the chance, you should do so. Definitely do so. Well worth the time and effort."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "marmar-69780",
        "review_rating": "2",
        "review_title": "bad but funny",
        "review_detailed_main": "Movie is bad and ridicolus but at same time funny and a good watch if you want something like that"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Leofwine_draca",
        "review_rating": "6",
        "review_title": "Stephen King horror delivers cheap thrills throughout",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "whatch-17931",
        "review_rating": "2",
        "review_title": "They forgot to duh in the record scratching sound",
        "review_detailed_main": "The genre shift at the 30 minute mark needed that sound.\n\nThey should have decided whether it was serious horror or cornball parody horror. Either could be good with this story, but not one for 30 minutes than 60 minutes of the other."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Nightman85",
        "review_rating": "8",
        "review_title": "\"when exactly did I lose your trust?\"",
        "review_detailed_main": "Creative and underrated Stephen King horror was the first King flick to be directed by Mick Garris.\n\nYoung man and his mother are actually mythical cat-like creatures that are seeking a teenage virgin to feed upon.\n\nWith an inventive premise, sharp direction, and a twisted sense of humor, Sleepwalkers is a truly entertaining supernatural shocker. Garris shows his great flair for direction, giving the movie plenty of well-done action sequences and plenty of horrific moments all of which are set against a seemingly safe, Norman Rockwell small town. The cemetery and attack at the Robertson house sequences are especially great. The special makeup FX are excellent and nicely graphic!\n\nThe film's sexy star Brian Krause does a terrific performance as the charming, yet deadly teen (where has this actor gone?). Madchen Amick of Twin Peaks fame does well in her victim role. Actress Alice Krige is perhaps the best of all though in her powerful role.\n\nOverall, it's an under appreciated film that's great fun for those who are game for some strong horror.\n\n*** out of ****"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "preppy-3",
        "review_rating": "7",
        "review_title": "VERY frustrating movie",
        "review_detailed_main": "Sleepwalkers are creatures who drain the life force completely out of humans to survive...but they can only use virgins (it's not explained why). Charles Brady (Brian Krause) is one such who needs to feed his mother Mary (Alice Krige). He goes after likable Tanya (Madchen Amick). Will she escape?\n\nOn one hand this is a GREAT horror film. Fast-paced, plenty of blood and gore and a nice, twisted sense of humor. There are plenty of in joke references for horror buffs (Castle Rock is mentioned once). Also Krause is excellent (who would have thought he could act after \"Return to the Blue Lagoon\") as is Kirge and Amick. But I find this film annoying.\n\nIt was written for the screen by Stephen King and it's maddeningly vague. The sleepwalkers are never fully explained. Where are they from? Why are they called that? Why does the son have to feed the mother? Why do cats hate them and can kill them? What are their powers after all (at one point Krause makes a car disappear AND change color and style!)? Why do they need to feed off peoples' life force? Why does it have to be only virgins? Why is the son having sex with his mom? None of these are explained leaving the story confusing. It's really too bad because, those questions aside, this is an excellent horror film. Excellent makeup and special effects too.\n\nFast, gory and lots of fun. If only the script were better. Also a fairly explicit sex scene between Krause and Krige was edited (you can tell) to get an R rating. I can only give this a 7."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "michaelRokeefe",
        "review_rating": "4",
        "review_title": "Smiling faces sometimes change.",
        "review_detailed_main": "Written by Stephen King, but this treatment is not as solid as most of his stories on film. A mother and son move into a small Indiana town with a secret. They are Sleepwalkers, feline type creatures that feed on young virgins. This little story has its share of gore and special effects; plus hints of incest.\n\nAlice Krige is outstanding as the mother. Others appearing are Madchen Amick, Brian Krause and Cindy Pickett. Look for very small roles for John Landis and Clive Barker. Stephen King cameos as the caretaker of the cemetery."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "666pandemonium",
        "review_rating": "",
        "review_title": "Appalling, but with TWO classic moments *SPOILERS*",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "edwardrevans",
        "review_rating": "4",
        "review_title": "Awful B movie fare",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Scooter-22",
        "review_rating": "6",
        "review_title": "Stephen King... BIG TIME HOMOPHOBE!",
        "review_detailed_main": "As much as I have loved horror in general and several of King's movies, I am SO sick of his continual homophobic portrayals of gays in his books and films... In \"Sleepwalkers\", Brian Krause's high school English teacher makes a pass at him during an ill fated attempt at blackmail... come on Stephen, spank your inner moppet and get over whatever icky queer fear you got going and GROW UP...and while I'm in a pissy mood, I'll follow up with the observation that since Stephen King fired his editor back in the late 80's, the quality of his writing has gone way downhill. His ideas are wonderful, but since he has forgone his previous editor, his novels have become run on, slow in pacing, and hardly worth the reading... but back to the movie. For such an interesting take on the vampire legend, the dialog sucks and the only redeeming feature of this movie has to be the lovely and amazing Alice Krige.."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "anthony_mifsud-939-682778",
        "review_rating": "5",
        "review_title": "I can't believe king wrote the script",
        "review_detailed_main": "I'm a big fan of Stephen King but when it comes to Sleepwalkers, it's a little too awkward and feels like a movie made for SyFY. The premise is a little too strange to accept. It deals with a mother and son who are sleepwalkers, weird cat people who feed off of a virgin female. So the son moves to another city and starts going to school acting like he's a normal kid named Charles Brady from Ohio. So then he decides that he's going to get a girl named Tanya Roberson and ask her out then when it was time he was going to feed her to his staving mother. The acting is pretty good but the dialog can't make up for any great acting.The dialog feels too awkward and just doesn't make up for some of the good acting. The Sleepwalkers also have some powers like turning invisible or showing there cat form. They also have a weakness cats. Wait why cats isn't that what they are. Why would Mr.King choose cats if that's pretty much what they are.There is a funny scene where a cop's cat attacks Charles Brady. And the thing that I can't get over is the scene where the son and mother make love.All I could say after this is I can't believe king wrote the script.The reason I gave this a 5 is because it's so entertaining and fun. It's one of those movies that's actually pretty hard to hate because it's so much fun. I probably would have given this a 3 or even a 2 , if it wasn't so entertaining . So that's the good of sleepwalkers. Overall If you happen to find this film , it's worth checking out. But don't expect to much or you won't be in luck.\n\n5/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "HabibieHakim123",
        "review_rating": "7",
        "review_title": "It's Just Ok",
        "review_detailed_main": "\"Well this one i can say better than Cat's Eye, i am more enjoying this one, it's more scary and gory, still some of a special effects are bad, some of a scene are weird and non sense, some of a act are excessive , overall this one is ok, not bad and not really good\""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "khodgman",
        "review_rating": "4",
        "review_title": "wonderful actress and concept drowned",
        "review_detailed_main": "I saw this in the theaters and was reasonably satisfied. It did have some of the best early (much emphasized in the tv ads of the time) computer morphing effects. But effects can't save a movie. Sadly, Alice Krige's excellent performance and basically good story premise can't save a movie that's fighting itself (read as: other actors, direction, story implementation and editing.) Alice Krige is wonderful, music is good and the effects were good for the times but everything else is well below average. That's why this one broke my heart. Some aspects hit home runs, but most strike out every time. One or two great players can't make a majority of weak players a winning team:( My Vote: 4/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "HabibieHakim123",
        "review_rating": "7",
        "review_title": "It's Just Ok",
        "review_detailed_main": "\"Well this one i can say better than Cat's Eye, i am more enjoying this one, it's more scary and gory, still some of a special effects is bad, some of a scene are weird and non sense, some of a act are excessive , overall this one is ok, not bad and not really good\""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Anonymous_Maxine",
        "review_rating": "4",
        "review_title": "A good example of why Stephen King rarely writes directly for the screen.",
        "review_detailed_main": "Stephen King writes such a wide variety of fiction and comes out with so many totally different movies that they seem to span almost all genres (although it's not likely that he is going to come out with a children's movie anytime soon). Sleepwalkers is one of the lesser known Stephen King films, and for good reason. For the most part, King, like Steven Spielberg, comes out with two radically different kinds of movies. Spielberg does fun fantasy films like Jurassic Park and Minority Report, and then he does shockingly relevant films like Schindler's List and Saving Private Ryan.\n\nSimilarly, King makes two main genres of films, although not quite the same genres as Spielberg's. He does the hugely successful and well-made films like Hearts In Atlantis, The Green Mile, Stand By Me, and The Shawshank Redemption, but in the tradition of what he is best known for, he also does (not as much anymore, but almost constantly earlier in his career) hardcore horror films, which are straight horror and, in many cases, cheesy to the point of being bad (Graveyard Shift, The Silver Bullet, Creepshow, etc.). There are exceptions in both cases, but for the most part, those are the kinds of things that we can expect from them.\n\nSleepwalkers is one of the last sort. A mother and her son move to a small New England town and try to fit in, only to have things go horribly wrong almost from the start. The son, Charles, meets Tanya at a movie theater that doesn't seem to have a single other customer or very good electricity. The blatant attempt to make the set look spooky has resulted only in making it look cheap and fake. It is revealed very early in the film that Charles and his mother Mary are not much interested in following in the footsteps of the Biblical figure after which she was named. They have sex regularly, and she becomes insanely jealous when he meets Tanya, even though we know from the opening credits that they are creatures that feed on virginal human females.\n\nWhile this bit of text at the opening of the film leads you to believe that, at the very least, you are about to watch a movie with a lot of gratuitous and generally unnecessary nudity, the film does not deliver any at all. Instead, we see Charles and Mary move to this town, Charles get involved with the very first girl he meets, and everything falls apart from there. There are so many more things that needed to have been done in this movie. When you look back at it after watching it, it becomes clear how empty the story really is because of how little it told.\n\nThere are some great cameos in the film, including one from Stephen King himself (who appears in many of his own films), and the police officer with the cat steals every scene that he's in. The horror is bad, the blood excessive and unconvincing, and the comic relief some of the worst I've seen in a horror movie in years. Sleepwalkers is not a complete failure as a horror film, because despite everything counting against it, it manages to entertain, but if you are in the mood for a Stephen King night, you can't really do much worse than this (note: stay away from Creepshow, too).\n\nSleepwalkers is a mildly entertaining but pretty badly made horror film and not much else, but at the very least, it does have an important moral to teach the world \u0096 Anyone who hates cats is obviously a shape-shifting beast that is more monster than human. Please make a note of it."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "RoyStead",
        "review_rating": "10",
        "review_title": "Magnificent",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "acidburn-10",
        "review_rating": "6",
        "review_title": "Entertaining B-Movie Schlock",
        "review_detailed_main": "'Sleepwalkers' is a fun, cheesy, campy, and over the top horror film that features a twisted yet interesting narrative, an odd tone, an uneven mix of horror and comedy, and a bizarre incestuous relationship subplot thrown in for good measure and what do you get well an entertainingly unhinged thrill ride from the mind of Stephen King.\n\nThe Plot = Charles Brady (Brian Krause) and his mother Mary Brady (Alice Krige) move to a small town in Indiana having recently fled California after killing a young girl and draining her lifeforce. The mother and son duo are not human, they are in fact creatures from another world called Sleepwalkers and need to feed on the lifeforce from young women to survive.\n\nThis movie isn't based on any of Stephen King's books or short stories, it's his own original screenplay and what he's created here is an odd and interesting feature that manages to a more subdued slow burn horror while also being a schlocky b-movie. The combinations of these elements don't always work, but then there's the 2nd half of the film which is where things really go off the rails and becomes pure b-movie entertainment.\n\nThe cast performances here are pretty good for the most part and works well within the context of the film. Brian Krause gives a believable performance as the handsome and charming Charles before switching things up and going completely hammy and unhinged and it's a delight to watch. Alice Krige gives a solid performance that really elevates the production and her chemistry with Charles is incredibly strong yet in a creepy way. Madchen Amick gives a fantastic performance as the female lead Tanya; she proves she's more than just a beautiful face as she's the heart of this entire movie and rises above the questionable dialogue she's given.\n\nOverall 'Sleepwalkers' is a goofy yet fun time that never fails to entertain and while it may not be the best thing Stephen King has ever written, it's still a hell of a ride."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "DigitalRevenantX7",
        "review_rating": "3",
        "review_title": "An interesting spin on the vampire film, ruined by Garris' clumsy humour.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "vchimpanzee",
        "review_rating": "",
        "review_title": "Don't listen to me; I don't like horror movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "4",
        "review_title": "Cat got my tongue. No, really, I'm not kidding...",
        "review_detailed_main": "So on the Chills Network on cable they are having \"Vampire Month\", I'm such a dork, but I love vampires. So after a few duds that they showed I was pretty disappointed, but then I noticed Sleepwalkers was written by Stephen King. So I decided to go ahead and check it out, well much to my surprise, this movie was really bad. Most Stephen King films are entertaining and some are very scary. While Sleepwalkers was bad, it was a beautiful kind of bad. I had a good time laughing at this movie and just taking it for what it was. I've never read Sleepwalkers, from what I understand this is the only real vampire story by King, so I can't really compare book to film. I don't know if it was just my TV, but Sleepwalkers looked like it was made for TV. The special effects were corny and the story was a bit far fetched, even if it is fantasy, it had a lot of problems.\n\nCharles Brady and his mother Mary are vampires who feed off the life force of virgin women. They are considerably more resilient than humans and have powers of both telekinesis and illusion. Their one weakness is cats, who are not only able to see through their illusions but whose claws are capable of inflicting severe to fatal wounds upon them. They also maintain an incestuous relationship. Charles and Mary have taken up residence in a small Indiana town. Charles attends the local high school, and there he meets Tanya Robertson in his creative writing class. Tanya does not suspect the real reason why Charles wants her so much; to take her life force for his mother, who is starving. At first, it seems that Charles has fallen in love with Tanya. On their first date, however, a picnic at the nearby cemetery, Charles attempts to drain the life force from Tanya while kissing her. As it happens, Deputy Sheriff Andy Simpson who had earlier tried to pull Charles over for speeding, drives by the cemetery and notices Charles' car. When Tanya runs to him for help, Charles tracks Andy down and kills him. When Charles then turns to resume his life force-depleting make out session with Tanya, the deputy's cat, Clovis, rises to the occasion and nearly kills Charles by scratching him in the face and chest. Mortally wounded by Clovis, Charles staggers back home to Mary. Mary then seeks vengeance on Tanya's family.\n\nSo to sum this movie up basically you should expect the cheese to overflow. The scene where Charles attacks Tanya for the first time is very cliché and you almost vote for Charles to win just because Tanya is one of the dumbest female leads in horror movies. Then you gotta love the scene where Mary has a gun and shoots it at a cop car and somehow the whole thing explodes, God bless Hollywood explosions and exaggerations. I'm taking the movie for what it is, it's just so deliciously bad that it turns into a dark comedy for me that I could just enjoy making fun of. I'm not sure if this is what Stephen King wanted to see for his story, but he does have his typical cameo in the film. So my suggestion if you watch this movie, just take it for what it is and don't over think it, it's mindless entertainment with corny effects, bad casting, a silly story and enough cats to make the crazy cat lady from The Simpson's say \"Wow, that's a lot of cats\".\n\n4/10"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "minamurray",
        "review_rating": "7",
        "review_title": "Not near as bad as it could be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "danew13",
        "review_rating": "4",
        "review_title": "was this meant to be a comedy?",
        "review_detailed_main": "This Steve King film is so bad its funny. The cops are useless...can't even get a shot off...an entire police department is killed off by a mother and son monster team...but the action is so badly directed and acted, its a total joke...funnier still stephen king has a small part in this turkey."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "sauravjoshi85",
        "review_rating": "7",
        "review_title": "This film exceeds expectation!!",
        "review_detailed_main": "Sleepwalkers (also known as Stephen King's Sleepwalkers) is a horror directed by Mick Garris. The film stars Brian Krause, Mädchen Amick and Alice Krige.\n\nA nomadic mother-son duo of energy vampires settle in a remote town, where the son begins courting a clueless young girl in order to drain her life-force so as to feed himself and his mother.\n\nI was watching this film with almost no expectations but was quite surprised with this film and the film entertains the viewers in its own way.\n\nThe plot of the film is decent and execution is good. With no to negligible special effects the film impresses.\n\nActing in the film is decent and all the characters were impressive. The BGM works in the favor of the film. The film also scares and thrills in it's own way. The only drawback of the film is it's pace as the speed of the film gets slow at many places. The climax of the film is not very impressive but still will not disappoint.\n\nA surprisingly good film to watch."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "justin40580",
        "review_rating": "5",
        "review_title": "so-so",
        "review_detailed_main": "I've never read the story but this movie is ok with an unusual plot in which shapeshifting cat-like monsters who are also incestuous (mother and son) feed on the blood of young women. It's a quite different premise for a movie, but i thought that the girl who played Tanya was effective. I really felt sorry for her, i don't know whether it was the helplessness in her voice or the way she acted. She is quite a beautiful actress i think, even moreso than some A-list actresses that i have seen. I am really biased in my opinion because of this girl since she struck a cord within me. If you don't agree with me upon seeing this than i apologize for making you watch and otherwise ok movie."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "bgajunkie",
        "review_rating": "6",
        "review_title": "The plot is silly, and only worth mentioning in that Cat's Eye did it better",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "BandSAboutMovies",
        "review_rating": "5",
        "review_title": "Clovis is the best part of this.",
        "review_detailed_main": "What's a sleepwalker? How about shapeshifting energy vampires that survive off the energy of virgins, who can cast illusions, move things with their minds and transform into werecats? Oh yeah and their biggest weakness is cats, who can see them and kill them with their claws. And before we forget, the only way the males can feed their female mothers is by having sex with them. Got all that? Then if you can get your head around all of that, you're ready for Sleepwalkers.\n\nCharles Brady and his mother Mary (Alice Krige, the Borg queen!) are on the run, settling for a bit in Indiana. They've just escaped California, where they killed a young girl (who emerges as a screaming skeleton from a closet, shocking the police — including Mark Hamill among them) and left behind a house surrounded by dead cats.\n\nSomehow, Charles is able to fake the necessary paperwork (this is pre-internet) and attend the local high school, where he chases Tanya (Mädchen Amick from Twin Peaks). Is it love or is he just trying to feed his mother? Well, on their first date, he tries to suck out her lifeforce, so she jams a corkscrew in his eye. If that's not young love, what is?\n\nDeputy Sheriff Andy arrives, having been searching for Charles ever since he was speeding and trying to run down young girls (not to mention slicing. the hand off of a pedophile teacher). Oh yeah — the deputy has a partner. Clovis. A cat who sits in the front seat. As Andy attempts to save Tanya, Charles kills him, drawing the ire of Clovis, who scratches him. He staggers home, where his mother uses her powers to hide them from the police. However, the area cats are having none of this as they gather around the house."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "famousgir1",
        "review_rating": "10",
        "review_title": "One of Kings most different movies, but still brilliant.",
        "review_detailed_main": "Mary Brady and her son Charles move out from there old town into a new town. Mary and Charles are not your normal mother and son though, as they are both Sleepwalkers. (They are not human and can change their appearance.) They are warring away though and to keep her strength up, they need the life force from a young women. So, Charles decides to go in search of one and he finds a nice young girl named Tanya. When Charles asks Tanya out, Tanya agrees, but soon she realises what he and his mother really are, she tries to escape from Brian on one of there dates, not before getting past the evil Sleepwalkers though.\n\nI really enjoyed Sleepwalkers. It's a great Stephen King movie and one of his most different ones. King is also has a cameo role here. Brian Krause and Alice Krige who play Charles and Mary give interesting performances here too."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "neil-476",
        "review_rating": "7",
        "review_title": "Not bad, but feels like a TV movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "gwnightscream",
        "review_rating": "4",
        "review_title": "\"Kind Of Strange!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "fugu_286",
        "review_rating": "",
        "review_title": "A couple of brief musings",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "dwpollar",
        "review_rating": "4",
        "review_title": "Campy vampire-like Stephen King movie...",
        "review_detailed_main": "1st watched 4/29/2007 - 4 out of 10(Dir-Mick Garris): Campy vampire-like Stephen King movie has so many strange and goofy elements that you start laughing over the extreme weirdness about 3/4 the way into the movie and you wonder if this movie might have a cult following for King fans. It's the story of a mother and son who are sleepwalkers(a shape-shifting feline-like, flesh eating, life needing, near extinct breed of humanoid) who move from town to town searching for virgins to feed on to keep themselves alive. They come across as pretty normal upper-class folk except they are secret lovers and cats hang around the outside of their home, day and night. Cats are deadly to them, so they set traps in their yard to try and keep the population down. We get to see them break a couple of their necks when they attack(which is also a first in my movie-going experience) --- hopefully no real cats were harmed in the making of the film. The boy is after a sweet girl that he has a crush on until he turns into a \"sleepwalker\" and then he just wants her body. There is so much campy uniqueness to this movie that it might have been better if it was an all-out satirical comedy on suburban life, but the director instead tries to scare you every couple minutes until you wish he'd just get over it and bring out the gore. Eventually that happens and the movie winds down to it's typical Stephen King downbeat ending. The movie is interesting because King's humor comes thru more than usual but his weirdness is also very present and what you have is a movie that his fans will probably like and should have in their collection, but as a worthwhile movie experience it really doesn't cut it."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "elo-equipamentos",
        "review_rating": "6",
        "review_title": "Weird and dared production has their enchants!!",
        "review_detailed_main": "After a long time that I'd watched it on Cable TV, which l found it a real trash picture even wrote by Stephen King, now the official DVD come out recently, I've stay for a while in doubt to buy or not without appeals at IMDB to don't influence me concerning the picture, well l have purchase the DVD expecting a proper time to watch, yesterday l did, always with a foot behind, surprisingly this picture has their enchants, a odd story, scariest , but pretty fun, enjoyable, of course with many technical inaccuracies over some scenes, also those weird cat monsters as well, as bad in some parts and fine in another, a several cameo appearances of the Stephen King, Tobe Hooper, Joe Dante and John Landis proves it to be an dared production, won't be wise to discard but maybe it not appropriate to all tastes!!\n\nResume:\n\nFirst watch: 2002 / How many: 2 / Source: Cable-TV-DVD / Rating: 6"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "AlabamaWorley1971",
        "review_rating": "5",
        "review_title": "Not Stephen King's best work",
        "review_detailed_main": "See, this is an original movie. The creatures are KIND of like vampires, but they look more like lions or something. Alice Krige is her usual regal self, and Madchen Amick isn't totally annoying as the girl in peril. If you're an Alice or MA or Brian Krause completist, check it out. Otherwise, skip it."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "videorama-759-859391",
        "review_rating": "6",
        "review_title": "Gore, cats, incest, and more cats",
        "review_detailed_main": "This ambitious effort is just another SK book to movie adaption, that comes off unsuccessful, despite really good performances from it's 3 star leads. Sleepwalkers is almost over before it's begun, but to me, felt like a film that wasn't really going anywhere, in terms of not really being an effective and scary horror. Too many stagnant pauses were getting in the way, where King should really stick to writing novels instead of movie scripts. There'a a lot of plain or matter of fact dialogue throughout the piece, but overall what I liked about King's dialogue, is that he uses a lot of short sentences, a less is more approach. Cat lovers should really steer away from this, where we have an intriguing start, played across against an instrumental 90's music score, I really liked, again heard in the finale, and some other moments in the movie. Too good to be true hunk (Krause) who plays his part to a tee, charmingly brilliant, has mysteriously arrived with his devoted incestuous mother (the brilliant Kringe, who reminds you of Carrie White's mother in Carrie (she would of been great by the way in that role) in their new residence, after a run in with a sea of cats. Cats really hate these two vampire figures, and they really hate and fear em. Kringe desperately needs a source of blood, so new student Krause, soughts out class mate, virgin hottie, the beautiful Madchen Amick (Twin Peaks) such a beautifully photogenic actress that really made me remember and appreciate 1992. So, then the blood starts flowing, and you can stereotypically guess the rest. Gore runs pretty high (the M version was shown in cinemas) here, where you really need your gore's worth with the R one. An inventive, original kill, has a redneck cop, getting corncobbed to death. Peartman's funny in an overacted small part, in the last third, as a brash country yokel cop. One thing you can't complain about in this, is the acting, the most notable quality, besides the radiant Amick visual presence, in not a bad horror filled, time passer, that really could been a lot of better. Too many dead stops, like a couple of cars make in this movie. Cindi Pickett is great too as Amick;s Mum. Again, Kringe is fantastic."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "FlyByNight32",
        "review_rating": "4",
        "review_title": "Another \"Could-have-been\" movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "pulikd",
        "review_rating": "7",
        "review_title": "Super/Natural Enemies",
        "review_detailed_main": "One can rightfully say this movie is Stephen King's take on both vampires and werewolves. Obviously, you can accuse the author of borrowing a thing or two from others, but you cannot deny King is, indeed, creative with the material as the screenwriter. The mysterious creatures and the horror, however, are not the most important part of this picture, tragedy is. But that tragedy does not prevent the movie from using a sense of humor in the right places. Also, there is \"forbidden love\" here that may have inspired \"Twilight\", only this, again, is a horror story, and there may be no place for the \"true love conquers all\" cliché this time, and though the bad and the good are clear, the movie still does not make the heroes pure good and the villains pure bad. This may be fiction, but not a fairy tale.\n\nAnd two individuals that seem to fall in love with each other may be the source of the tragedy here, but that tragedy isn't how the two cannot be together because of strong barriers between them, the tragedy here comes from the lives lost because of the situation their relationship ends up triggering. The monster effects include both practical and computer generated components, and they both work fine, the actors, the cinematography and the music are very strong. The only truly weak element here is the editing, but that only goes for the unrated cut of the film where literal handfuls of seconds here and there damage the pacing and the tone of the otherwise perfectly solid motion picture."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "LouisBetonBerlin",
        "review_rating": "10",
        "review_title": "Just watch it, you're gonna love it",
        "review_detailed_main": "Hands down, this is one of the best trash horror films you are going to see from the 90s. An underrated gem that shifts between horror & comedy, not sure what they wanted to achieve back in the days, but it's HILARIOUS. Really, watch it, a six pay or a dubie will probably help, but I love it."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "The-Sarkologist",
        "review_rating": "7",
        "review_title": "The Best Thing I Liked About this movie were the cats",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "tex-42",
        "review_rating": "",
        "review_title": "Bizarre movie, a big letdown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "frankbannister-1",
        "review_rating": "6",
        "review_title": "abstract derivation of death",
        "review_detailed_main": "Although Sleepwalkers is definitely not a good movie, it has something special that other films (including really good flicks) haven't. Until the half of the film, it's a weak monster-slasher-horror, nothing original or memorable. But approximately after the scene in the cemetery the film begins to work on a different level: then borns the spellbound of Sleepwalkers. This spellbound, I admit, is very bizarre or morbid - it's upon the power of the mother, which demonstrates the variability of death. I mean, when the film focuses on the mother's rage and desperate, the whole world of the film transforms into an abstract derivation of destroying, agony and death. This aspect of Sleepwalkers doesn't turns it into a great film but turns into a great experience - if someone can accept it. The worth of Sleepwalkers is upon this level, not the success of direction, cinematography etc. Anyway, the women are beautiful - not just Madchen Amick, but the elder Alice Krige as well; they both produces some erotic tension not only in the provocative scenes. The dance of Madchen Amick nearly the beginning, is very charming. So, if someone doesn't interested at all in horror movies, better to avoid this picture; otherwise, if someone would see a film which not necessarily good, but very interesting (even with its stupidities), I would recommend this."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Doraemon34542",
        "review_rating": "7",
        "review_title": "Corn stabbing feline mother",
        "review_detailed_main": "\"Sleepwalkers,\" written by Stephen King, lacks a detailed backstory about the mythology behind the cat vampires. Instead, it presents a straightforward horror story about a date gone wrong and a mother seeking revenge. Alice Krige, who is stunning in her younger years, gives a captivating performance. The movie is brief but fun while it lasts, featuring some ridiculous death scenes, like the corn bit with the line, \"no vegetable, no dessert.\" It's an enjoyable watch for those who appreciate simple, quirky horror.\n\nThe special effects are just fine for its time, featuring early CGI morphing effects yet the vampires creature effects is not even slightly scary, maybe to 12 years old. Also feature violent scenes against cats, not real of course but cat ladies watching might get angry."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Bernie4444",
        "review_rating": "10",
        "review_title": "This has that Stephen King feel",
        "review_detailed_main": "Stephen King says what is scary is when you are just in the realm of reality and possibility. Then the spooky extraordinary seems scarier because this may be taking place next door.\n\nThis is a pretty good adoption from print to the screen. Of course, the disadvantage is selecting what to show. The big advantage is not having to use the King potty mouth on every sentence. A few descriptive words are needed for the ambiance, but King goes overboard in his writing.\n\nAlice Krige the Borg queen and ghost is the perfect person to play Mary Brady as she can be so sweet and forceful at the same time.\n\nIf you look closely, you will see Stephen King as the Cemetery Caretaker. He is a much better token than Alfred Hitchcock ------------------------------------------------------------------------------ We all know that there are some truth too fantastic creatures reported through the ages. This is the story of a pair of the last of the bread of shapeshifting creatures called Sleepwalkers. They are a very close nit mother and son. They must live on the life essence of good girls and at all costs must avoid cats as cats are the mortal enemy of Sleepwalkers. Watch as they barely escape with their lives and set-up house in a rural community."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "moscow-29155",
        "review_rating": "8",
        "review_title": "good movie",
        "review_detailed_main": "Charles Brady and his mother are werewolves. Their favorite prey is young virgins, who give them vital energy. But the new victim turns out to be stronger and more inventive than his pursuers. Schoolgirl Tanya Robertson finds a weapon against the bloody family. More than anything, they are afraid of cat claws."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "john-taylor34",
        "review_rating": "10",
        "review_title": "Cool for cats",
        "review_detailed_main": "This is a true so-bad-it's-good movie. It's right up there with Death Race 2000 and Nine Songs (only joking, I think) as one of the great after-pub films. To its credit it doesn't try to be meaningful or intelligent, but concentrates on the more important business of killing off the characters (mainly the rural cops) in imaginative ways. There's a longer-than-usual cameo by Stephen King, and Clive Barker and Tobe Hooper also make appearances. The real heroes, though, are the cats. They are consistently more resourceful than the human characters and, unlike the cops, have mastered the important skill of entering and leaving buildings. The climax is a riot of silliness. Great fun!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "hu675",
        "review_rating": "8",
        "review_title": "A silly, strange horror premise is actually fun to watch.",
        "review_detailed_main": "Charles Brady (Brian Krause) is a seemingly charming young man, who been forced to kill young virgins to feed his sexy incestuous mother (Alice Krige). They moved to every small town to keep finding ways to survive. Which they are \"Sleepwalkers\", a shape changing creatures that they are able to stay alive by feeding on the life force of young female virgins. Charles has an crush on a beautiful girl named Tanya (Madchen Amick). When the two just start a relationship, his mother selected Tanya as Charles's next victim but Tanya is actually tougher than expected.\n\nDirected by Mick Garris (Psycho 4:The Beginning, Desperation, Riding the Bullet) made an entertaining if thinly plotted horror film that is fast-paced and filled with a twisted sense of humour. Garris, who went on to make several adaptations from Stephen King's novels for television. Which King wrote an original screenplay for this movie, based on a unpublished short story. The incestuous relationship between the mother and son will turn off some viewers. Die Hard fans of King's work might enjoy this much more.\n\nDVD has an sharp anamorphic Widescreen (1.85:1) transfer (also in Pan & Scan) and an terrific-Dolby Digital 2.0 Surround Sound. The DVD would've been great if it had a commentary track by the director and King or at least an Interview with King. Since this film did quite well, when it came out back in 1992. There's no doubt, this unusual movie has a cult following. Especially when the director included filmmaker cameos like Clive Barker, Tobe Hooper, Joe Dante and John Landis. King appears in a hilarious bit part as a Cemetery Caretaker. Mark Hamill appears in the opening sequences, which he's uncredited. (*** ½/*****)."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Sandra-durand80",
        "review_rating": "10",
        "review_title": "Great movie!",
        "review_detailed_main": "This is a great movie! One of my favorite Stephen king movies. The acting was great. Pure entertainment!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "FreakOfNature",
        "review_rating": "8",
        "review_title": "Sleep Walkers",
        "review_detailed_main": "I thought the movie was all right, I mean I personally think that Stephen King could do so much better. The graphics were a little off and I think that the \"sleep walkers\" could have looked so much better. They looked very plastic with a water rubbed all over them. I thought the scene with the face changing and the disappearing parts were very creative and was well put together. The story was good, I thought the cats being the sworn enemy of the sleep walkers was extremely creative."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Dianafan79",
        "review_rating": "9",
        "review_title": "I love Sleepwalkers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Holly_Golightly_",
        "review_rating": "8",
        "review_title": "Handsome Sexy Man of her dream turns out to be a killer and a cat hater",
        "review_detailed_main": "Woah! Is one thing I can say about this movie. Personally I'm one of those people who loves cats so that would have been a big down side to the movie, but I loved it how cats from every were got their revenge at the end.\n\nI liked the movie, but I have to admit it was because I found Brian Krause who played Charles Brady very very irresistible, I guess lust got the better of me while watching this movie.\n\nThere was one thing that I was disappointed over. I've watched Charmed before and Brian Krause is married to Holly Marie Combs, his kissing scene was O.K. in Sleepwalkers, but really bad compare to his kissing scenes with Holly Marie Combs, I don't know if it is because Krause and Combs have great chemistry or maybe more it a bit more, that was the only disappointment in the movie but I guess it was made up for with Brian Krause in those tight ass jeans he was wearing in the movie.\n\nIf you are use to seeing Brian Krause as Holly Marie Combs heavenly husband and the father of her son your in for a big surprise with this movie, he was nothing like angle boy. Although now that I think about it, it would be great to see Krause's character on Charmed taken over by evil making him something like his was in Sleepwalkers.\n\nI also have to say the music was GREAT in this movie too!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "GOWBTW",
        "review_rating": "9",
        "review_title": "Strange, yet interesting movie!",
        "review_detailed_main": "This Stephen King novel \"Sleepwalkers\" was something worth reading about. A team of mother-and-son vampires who stalks virgins, hey even Dracula would be proud. Unlike most vampires, sleepwalkers are being kept at bay by cats. Why's that? A cat scratch can weaken these creatures. Charles Brady(Brian Krause) and Mary Brady(Alice Krige) dance to the same song, but they get their groove when they hunt for fresh virgins. The hunter is her son, and when he goes to school he meets a very lovely woman named Tanya(Machen Amick). He would carve the letter \"T\" into his arm. In one scene, Tanya took the picture of Charles and makes a frightening discovery of him. The body count piles up, and the the hunt for Tanya assures. The mother's hunger was so great, she couldn't take it anymore. Now it's up to Tanya to take out the scary duo, and get help from the feline allies as well. If you got allergies, don't watch this movie. If you're a \"Sleepwalker\", you're in big trouble! 4 out of 5 stars!"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "eagle804",
        "review_rating": "10",
        "review_title": "At The Drive-In",
        "review_detailed_main": "Stephen King was raised on flicks like this. -Flicks NOT films.\n\nMovies like this and 'Jeepers Creepers' are \"throwbacks\" to the good 'ol day drive-in horror flicks. They are meant to be fun, cheaply made and hopefully: a few good scares.\n\nAnyone looking for a theory on the human condition should pass on this creature feature because that's all this is... all it ever will be.\n\nStop trashing what has already deemed itself as trash. -Good, fun, trash!\n\nIf you enjoyed this I recommend: 'Jeepers Creepers' 'Jeepers Creepers 2' '30 Days of Night' 'Scarecrows'('88) 'They Live' 'Planet Terror' 'Death Proof' and 'Halloween III: Season of the Witch'"
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kalebharris",
        "review_rating": "9",
        "review_title": "Dude, this is one of goofiest movies I have ever seen since Killjoy",
        "review_detailed_main": "NO SPOILERS\n\nOkay, where do I begin...\n\nThe visuals in this movie can be only described with one word and one word only: what? Because that the only word I could say throught out the entire climax of this movie. Its astounding how surreal and downright bonkers this movie goes just to tell a not even compelling story; the acting: subpar, the plot: transparent, the logic: none, the tone: all over the place. It is one of the best worst movies I've ever seen, especially one of the best Stephen King movies ever and highly suggest watching this movie one some sort of substance or just with a group of good friends on a friday night.\n\n9/10: due to it dragging at times but it is SO worth at the end."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "MinusMikey",
        "review_rating": "8",
        "review_title": "A dark and enjoyable movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "antgreenj",
        "review_rating": "8",
        "review_title": "Best worst movie ever",
        "review_detailed_main": "One of the most crazy over-the-top best worst movie ever. It's one does movie where you turn your brain off and enjoyed the ride. Watch this with a close friend or family member."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Timofey1980",
        "review_rating": "10",
        "review_title": "I remember watching it on a VHS tape",
        "review_detailed_main": "Charles Brady and his mother are werewolves. Their favorite prey is young virgins, who give them vital energy. But the new victim is stronger and more inventive than his pursuers. Schoolgirl Tanya Robertson finds a weapon against the bloody family. More than anything else, they are afraid of cat claws."
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "chriscastaneda-73236",
        "review_rating": "10",
        "review_title": "Exceeded all expectations!!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Ii_fut_in_gura_pe_stelisti",
        "review_rating": "",
        "review_title": "Cop-kebob!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "todd2u",
        "review_rating": "",
        "review_title": "the creatures sucked",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "brandonsites1981",
        "review_rating": "",
        "review_title": "* * * out of 4.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Itsrae1",
        "review_rating": "",
        "review_title": "Tongue Firmly in Cheek",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "mboyd1986",
        "review_rating": "",
        "review_title": "Not worth the time or money...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "kublakhan13-1",
        "review_rating": "",
        "review_title": "hehe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "I Am Sleeping. I Am Walking.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Dethcharm",
        "review_rating": "",
        "review_title": "The Cat's Pajamas...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "mcfly-31",
        "review_rating": "",
        "review_title": "if only they'd thrown out the second half...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "mentalcritic",
        "review_rating": "",
        "review_title": "The real problem is that it can't make up its mind...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0105428",
        "movie_name": "Sleepwalkers",
        "movie_rating": "5.4",
        "review_username": "Possessed",
        "review_rating": "",
        "review_title": "I'd rather see a movie with real sleepwalkers... *yaaawwwwn***",
        "review_detailed_main": ""
    }
]