[
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "An enjoyable but gender biased comedy that would be LOVED by the boys and (most likely) HATED by the girls for their silly & mean portrayal throughout.",
        "review_detailed_main": "Despite moving on a similar-seen before path, the film still scores well in terms of entertainment basically due to its young realistic feel, local language, enjoyable dialogues and performances specifically written from the point of view of its 3 victim boys projecting the girls as simply mean, ignorant, greedy, money-minded and wicked witches just there to exploit their foolish boyfriends using them to the maximum. So where the boys are truly going to love it, the girls would more likely hate it for their silly, dumb and unpleasant portrayal throughout.\n\nDescribing the theatre experience, the film right away comes to the point with its 3 male characters speaking their comic dialogues in a typical Delhi-NCR lingo with many annoying beeps. But the young viewers easily get to understand what's being said (behind the beeps) mocking the questionable Censor Board, that insists on muting some key words even in a film given an ADULT rating pointing towards all confusing standards. Introducing the three girls next, PKP2 goes on maintaining the young feel and the well written dialogues, executed superbly on screen do not disappoint at all till it says intermission.\n\nIn the second half, though the viewers can easily judge that its nothing new from the team progressing on exactly the same format of its prequel, they still don't mind enjoying it as the fun continues in its final hour too, but following a strictly one sided mindset ridiculing the three girls. Moreover it all ends on another high point in the police station sequence wherein once again it's the boy playing the winning stroke insulting the girl for not coming up with the truth in front of her father.\n\nIn few words there are three basic reasons why PKP2 works majorly for the young boys despite having a stale subject talking about the same things. Firstly, because here we have a completely natural actor Sunny Singh who never lets you miss the most loved character of the original i.e. Liquid (played by Divyendu in PKP1). Secondly it's the realistically written dialogues of the film every boy can easily relate too, making an instant connection with the viewers. And thirdly it's the superbly executed 6.30 minutes long monologue brilliantly performed by Kartik that receives a roaring applause from the audience as if it was their personal feelings expressed by the man on screen so truthfully.\n\nIn the performance section, I would like to rate Sunny Singh scoring the most (playing Chauka) as it was certainly not an easy task to match up the performance of Liquid in the original and that too with a contrastingly different (and strong) physical appearance not suiting his sheepish character at all. Next is Kartik Aaryan playing almost similar role as in PKP1 but again coming with a fabulous monologue scene deserving all the attention. And then Omkar Kapoor playing it real cool in a pretty decent manner as the main financer of the trio irrespective of an illogically written character constantly being fooled by his greedy girlfriend.\n\nComing to the girls, Ishita Raj scores the maximum (especially due to her belly dance scene), followed by Nushrat Bharucha working hard on her dumb character that at times also turns to be hamming in some specific sequences. Sonalli Sehgall looks hot and beautiful taking a few steps further than the prequel and the supporting cast does a fine job too including Sharat Saxena, Mona Ambegaonkar and the two girls playing Nushrat's (Cheeku's) friends. Technically PKP2 becomes better in art direction, cinematography, editing and background score supporting the theme aptly, but this time its vision as well as the writing becomes more biased supporting the boys in particular.\n\nStating the downers, PKP 2 doesn't offer anything worth mentioning in its soundtrack and one frankly misses a song like \"Ban Gaya Kutta\" in its various sequences. The basic characterization also turns out to be hugely contradicting when we get to see a supposedly talented and educated person earning 3 lacs a month (Omkar) being fooled so easily by a girl met in a gym, living alone in a big apartment. And then the otherwise confident boy (Kartik) forgetting all his smartness once the girl says 'Yes'.\n\nFor friends who think the film is once again misogynistic in nature as earlier, it's actually not the same as seen in PKP1 which did have some major features pointing towards the same. As per definition, a misogynist is a person who hates, dislike, mistrusts or mistreats women. Whereas in PKP2 the boys are all loving, trusting and believing in their girls wholeheartedly right till the end and it's the girls only who repeatedly ditch them on purpose either for money, security or being plain dumb like the one portrayed by Nushrat. As a result, the three girls simply get projected as someone highly selfish, intolerable, manipulative and always looking for money or security in their man, instead of love or togetherness.\n\nIn comparative terms, where PKP1 could easily be called as a fine satire on love and cracking relationships among the youth, PKP2 is a more comical take on the subject conceived specifically from a male point of view as being the key sufferers.\n\nInterestingly, sex doesn't become any centre of attraction of the script this time for a change and it's the humour that takes care of every shortcoming of the film providing a fine return of your money and time spent on the multiplex outing.\n\nHaving said that, though PYAAR KA PUNCHNAMA 2 surely deserves a good rating for its entertainment factor well taken care of, it still remains 'a guilty kind of enjoyment' derived from a one dimensional project sidelining its female characters."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "7",
        "review_title": "An awesome entertainer and slightly better than its prequel",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "sohylejain",
        "review_rating": "8",
        "review_title": "Fun watch and completely buck worthy!",
        "review_detailed_main": "After the first part, with a not a completely different cast Luv Ranjan has again made it to the young hearts, especially the males. Pyaar Ka Punchnama 2 is a comedy movie with humorous scenes and dialogue, fast paced and full of 'punch' lines which is surely not a waste at all. Just like the PKP1, this movie too revolves around three male roommates, Sunny Singh Nijjar, Omkar Kapoor and Kartik Aaryan(same cast as PKP1) who fall for three women(same cast as PKP1) at the same time and their life is not the same anymore. A roller coaster fun ride of three men in a relationship, is a must watch for every guy who is or wishes to be in a relationship. Kartik Aaryan's 7 minute long dialogue is awe aspiring, jaw dropping, inspiring and one of the most entertaining part if the movie. Hat's off to Kartik Aaryan's acting. Basically a male centric adult movie, this movie is I repeat, this movie is NOT for all all types of audience, choose your company well to enjoy it the fullest. If you are a fan of the Pyaar Ka Punchnaama 1, you will surely love this more not less and you can't afford to miss this one. Laugh, Whistle, Enjoy!"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "A Laugh Riot!",
        "review_detailed_main": "The sequel to the 2011 hit Pyaar Ka Punchnama, 'Pyaar Ka Punchnama 2' is a superb sequel, as this one's A Laugh Riot! Its purely for Men & I must admit, I had a ball!\n\n'Pyaar Ka Punchnama 2' Synopsis: After falling in love, three roommates experience extreme changes in their lives.\n\n'Pyaar Ka Punchnama 2' is hilarious, in most parts. Watching the three protagonists struggle in love, is amusing & very, very funny. The characters are well-written & you really feel sorry for the guys. The women (clearly this is a sexiest film) are shown wrong, but again, this is a story about men & their misadventures in love. While the first-hour is entirely funny, the second-hour slows down for a bit, but things get back on track during the finale.\n\nRahul Mody, Tarun Jain & Luv Ranjan's Screenplay is truly humorous. Though one-sided, the Writing still remains engaging & the dialogue, are simply superb. Luv Ranjan's Direction is very good. He has maintained the energetic mood, from start to end. Cinematography is fine. Editing could've been sharper & the film needed some trimming, by at least 15-minutes. Music by Various Artists is decent.\n\nPerformance-Wise: Sunny Singh makes a terrific debut. The actor shines on-screen & his comic-timing, is spot-on! Omkar Kapoor (a former child actor), also impresses in his adult debut. Kartik Aaryan is quite good, however, his long monologue in the film's latter half on women, is fantastic & brings the house down! Nushrat Bharucha is a hoot. She's consistently annoying & very believable. Sonalli Sehgall is effective. Ishita Sharma looks sexy & delivers seductively. Sharat Saxena stands out in a supporting role.\n\nOn the whole, 'Pyaar Ka Punchnama 2' works! Go, laugh out loud!"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "monty465",
        "review_rating": "10",
        "review_title": "Every guys life story - Ten on Ten",
        "review_detailed_main": "You remember why millions of us love the TV show FRIENDS from 90's till date the most? Because all of us live our lives through each of the character. PKP2 is the next in succession! This is the story of 90% of us. The 3 guys fall in love with 3 different girls, in 3 different situation and faces 3 different problems, which in reality overlaps in our own lives. It's the wisdom of this movie that counts the most till the end. Until I watched, I was doubtful that part 2 cannot get better than its prequel, but I am happy to say I was so wrong. There wasn't a moment of boredom or a time where the story seemed to get off-track. The direction and the story are beyond perfection, and the cast is the best suited for these roles,even the best of the Bollywood actors/actresses couldn't have done it better. I laughed my wits off till the end. And definitely look forward to PKP3!!!"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ajit2106",
        "review_rating": "6",
        "review_title": "Not misogynistic but gives a glimpse of Women's acquisitiveness and obliviousness.",
        "review_detailed_main": "It is again three guys and three girls but this time guys are rich. They again fall in love with the girls who possess characteristics of the women fraternity which have been described as greed, confusion, indifference, inconsideration, gullibility, impracticality etc.\n\nIt packs the right punches in some scenes, the screenplay is little inconsistent and loses the main focus as some situations are impractical and we cannot identify with those.\n\nHowever, it has been researched well as it conveys the message that love cannot be superficial and it requires a commitment from both sides. Being covetous and unreasonable is the reason of struggle and it also requires a respect for both. And finally all roads lead to home that is mother; mother's love for a child is unconditional.\n\nAll the actors have done their jobs brilliantly; they personified the characters with plausibility and some the scenes stand out, the scene at the police station where Chauka delivers the perfect dialogue which worked like an eye opener or the monologue by Kartik.\n\nThe songs are forgettable but the good thing is that movie did not have many songs.\n\nOverall a decent effort by Luv Ranjan, a movie for the youth who can easily put themselves in the shoes of the characters, and \"the wearer knows best where shoe pinches.\""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "rhlbhole",
        "review_rating": "10",
        "review_title": "Basic structure of the movie is same and it's exactly what we wanted. Epic sequel ...Anshul/Gogo 7 min monologue is epic again !!",
        "review_detailed_main": "LoL the majority of average rating is coming from the feminist side i assume :D\n\nWell definitely the movie will give you a burst of laughter if you're a male and we were expecting exactly the same, the movie live to the hype of the PKPN1. In beginning i wasn't expecting it to stand any where near to its prequel but i'm glad that i was wrong.\n\nThough Thakur couldn't gel up as a replacement for Chaudhary, i personally feel the boys cast should be the same... missed the bonding of Rajjo, Liquid and Chaudhary but Chouka takes that place as a nice replacement package. Its a story that revolves around women's 1. the money minded.. 2. the best friend conscious.. and 3. girl concerned with family... the movie scenes were well shot and Anshul/Gogo monologue is longer, better and epic.\n\nI will agree to the fact that First half is more fun and dominant over the second but the story ends really well Talking to their mothers;)\n\nDon't listen to any1, if u r a fan of first PKPN you will definitely enjoy this movie without any disappointment, cheers!!"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "rahulagarwal19",
        "review_rating": "7",
        "review_title": "Overrated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "bansi-awasthi",
        "review_rating": "9",
        "review_title": "I never laughed this much in my life.",
        "review_detailed_main": "I didn't think that they can make this movie better than it's prequel but I was mistaken. This movie is one of the best romantic comedies ever made. Amazingly written,extremely hilarious, it is a total fun ride.\n\nThe movie is about three guys living together,who fall in love at the same time. And as the title suggests it didn't go so well. The movie depict relationships the most believable and hilarious way possible. The movie isn't slow or boring for even a instance and maintains it's pace for the whole length. The three main characters have great chemistry together which results in some of the most funny moments of the movie.\n\nThe movie have nice music, good dialogs, well crafted comedy scenes and appreciable acting. If you go to movies for fun and entertainment you will love it. There is no need to watch the prequel if you haven't, the story is not related. Conclusively, It is a must see, as it is enjoyable, witty and a comical flick. It is one of the best comedies of bollywood."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "nikhil_kamra",
        "review_rating": "6",
        "review_title": "Fairly fun. Not more than one-time watch.",
        "review_detailed_main": "Generalizations and Sexism are at the core of PKP movies. And that doesn't really make it bad. People liked the first one, didn't they? So, why a 6/10?\n\nWell, this movie is a slight improvement to the last one, but still there are a lot of things that don't work. Even if we ignore the constant sexism this movie portrays, it is a little strange that every happy/sad/\"katta\" moment for every couple, happens at the same time. They even have their first dates and break up on the same day. It's like the six people were dating each other! Got on my nerves cause it's practically impossible. Especially considering how the three couples were COMPLETELY different than each other.\n\nAnd don't even get me started on the background score. It is a little better than the previous movie, but still annoying as hell. Felt a bit like I was watching an Indian MTV show.\n\nThen the fact that this is a A-Rated flick, but still all the curse words are bleeped out. Even the word \"gha**a\" (bell). Like.. Seriously? What is this, 1990? You can do better, Indian Censor Boards! By that logic this movie should have been at least U/A. But NOPE. Made it more annoying.\n\nAlong with that, a lot of the \"jokes\", especially near the end were merely laughter at the pitiful state of the guys. I mean, being a guy and living in the same world as them, I was empathizing with their situation. Laughing at someone's pitiful situations is NOT COOL. Were these emotional moments? No. Were they supposed to be? Yes. But no, everything is good because it's a comedy flick aimed at the male population and laughs are supposed to be delivered. If they deliver even a bit of \"feelings\", the movie will no longer be a d**k-flick.\n\nAnd the last but not the least, almost nothing shown in the movie is REAL. It's just an exaggeration of all the things that actually happen. Fiction, eh?\n\nI understand the hype! And I clearly understand why almost all guys relate to this movie. But a 10/10 movie is supposed to be more than just merely entertaining whilst bordering on offensiveness.\n\nTo summarize, entertaining (loved the monologue!), a fairly fun movie to watch, but LITERALLY nothing more than that."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "Bigger and better than the original !!! Highly recommended",
        "review_detailed_main": "There comes a time in life when you want to break free away from all the tension, stress and depression. In that scenario, movies plays a crucial part in de-stressing and re-energizing your vibe. The sequel to the cult classic 2011's cult classic Pyaar Ka Punchnama, Pyaar Ka Punchnama 2 has right dose of medicine to uplift your mood and entertain you to the core.\n\nPyaar Ka Punchnama 2 tells the stories of 3 room-mates in the city of Delhi and the after-effects in life when they meet their dream- girls.\n\nNow when you watch the film, you will notice the premise to be same as original. In fact, the director Luv Ranjan has kind of remade his own film ( Yes, the seven minute famous monologue/rant scene by Karthik Aryan is repeated once again) But the good news is that the sequel is bigger and better the original. Luv Ranjan goes one step further in Pyaar Ka Punchnama 2 and gives you a sensational film. The plot is a simple and predictable battle of the sexes but it is the handling of subject with aplomb and sensational performance with well-written screenplay that will keep glued on to the screen till the end. Luv Ranjan does a fairly good job in keeping you entertained with hilarious dialogues and is sure to bring down the house with hilarious moments in the first half. The second half becomes monotonous with occasional speed bumps in form of unnecessary inclusion of songs and loose screenplay but defined colorful characters with strong presence will compensate for the loose ends. Cinematography is outstanding. Background score gels well with the mood of the film. Editing should have been better. Music is tuneful.\n\nOut of 3 main protagonist , Karthik Aryan and Sunny Singh stands out with superb performance. Both of them should be applauded for fine comic-timings. Omkar Kapoor does well as a new comer. Actress did justice to their part.\n\nPyaar Ka Punchnama 2 is a laugh ton which will be remembered for its utmost hilarious moments. Good 3.5/5\n\n– Ketan Gupta"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "heartmak",
        "review_rating": "7",
        "review_title": "An entertaining, innovative and hilarious movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "nairtejas",
        "review_rating": "4",
        "review_title": "Moms Are The Best. ♦ Grade D+",
        "review_detailed_main": "Moms are the best: That's the moral of story which is obviously similar to its prequel.\n\nThree ultra rich bachelors have it easy to woo and subsequently date three hot women, and as they begin their relationships find it hard to cope with the perils. But don't worry, all that happens in these so-called relationships is nothing like what happens in reality. Exaggerated instances of girlfriend pampering, gold digging like it's the end of the world, pretentious party-sex-sex-party brawls are some of the elements that the story uses to create humor. While the first half is periodic and comic, the second is dramatic and overlong.\n\nThat (all) women who enter a relationship are in for the perks is the main theme of the Punchnama films, and in here, the theme has been remodeled with sexier men and women, plush apartments, Apple products, and mild sexism. Had the narrative added women's viewpoints, I would have rated more generously.\n\nFamiliar one-liners, anti-climactic second act, and lack of visual sex scenes is what salvages the whole movie from becoming a putrid bore. The jokes are on women, and men's struggle in wooing them; and it is funny to a certain point. If you are not a purely platonic couple and do make love to each other on the kitchen bench, and like to watch (or re-watch) six hot people analyzing stereotypes about modern romance, this one is for you.\n\nBOTTOM LINE: Pyaar Ka Punchnaam 2 is a sexier version of Pyaar Ka Punchnama (2011) which believes that it is easier to score in India, and that Moms are the best people to say \"I Love You\" to.\n\nGRADE: D+\n\nCan be watched with a typical Indian family? NO\n\nProfanity: Medium"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Good sequel though quite predictable yet funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "adarshnair-78027",
        "review_rating": "10",
        "review_title": "Awesomeness",
        "review_detailed_main": "OK this is the first review i have ever done.. Totally worth it .. Reason you ask .. Only if i a, sure the right perspective will not be represented by the votes. A very male centric movie , a side which is barely represented because its a taboo now to speak up as the man being in any state of vulnerability . It is for men what gone girl was for women. Yes a phycho ****** slashing up people sent chills down my spine. Over all a very well constructed movie at a shoe string budget . The perspective about the other gender being exploited has been represent umpteen number of times. I am sure no human bring will deny such couples don't exist . Being from delhi loved it"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "badaamit",
        "review_rating": "7",
        "review_title": "Review",
        "review_detailed_main": "A man can't understand woman is right but luv Ranjan's( the director) home work about woman is very good...."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "blackquestionmark-emoico",
        "review_rating": "6",
        "review_title": "Made it's mark in Bollywood.",
        "review_detailed_main": "This movie kept it's reputation over it's long 'Frustration over girlfriend' dialogue which was also in previous movie but this time it was 2x. Overall I liked it but the starting felt a bit too exaggerated. Actors did a great job there. If you want to pass some time out with friends then go for it.\n\nThe movie brilliantly portrays the youth and their life. Scripting is brilliantly done and the movie keeps your interest throughout. But the disappointment is that the movie felt a bit exaggerated during the bold scenes and it looked completely unreal and the jokes really didn't make me laugh much, it was as if you're trying to tickle a person but he only giving a response back with a little grin. That 'Frustration over Girlfriend' dialogue will not disappoint you. It will make you laugh and cheer over it, Brilliantly written but sadly it's only going to be remembered for this dialogue. The ending was well written, the way they find out the truth in the end was unique but somehow, the ending at the bar felt one sided but the message was well given.\n\nIf you're into a pass-timer and light comedy movies where you expect a good laugh then this movie is for you. This movie has definitely made it's mark in Bollywood."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "dhanapatis",
        "review_rating": "10",
        "review_title": "Well all girls are not angel. We can be a**holes too!!",
        "review_detailed_main": "Just an FYI :) Loved the movie though !! Tuuuduuuuuu lalalallalalalalalalallalalala Tuuuduuuuuu lalalallalalalalalalallalalala Tuuuduuuuuu lalalallalalalalalalallalalalaTuuuduuuuuu lalalallalalalalalalallalalalaTuuuduuuuuu lalalallalalalalalalallalalalaTuuuduuuuuu lalalallalalalalalalallalalalaTuuuduuuuuu lalalallalalalalalalallalalalaTuuuduuuuuu lalalallalalalalalalallalalalaTuuuduuuuuu lalalallalalalalalalallalalala"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "Jini-B",
        "review_rating": "6",
        "review_title": "Almost As Good As The First One",
        "review_detailed_main": "I wasn't quite sure whether this one would work as well as the first movie, since two of the main male actors have been replaced and the audience is familiar with the story-telling, but I was happy to note that this movie worked almost just as well. The two new faces made their roles their own and didn't really give me much chance to miss Liquid and Chaudhary. Chauka and Thakur were so much fun and had their own personalities that led me to root for them too.\n\nThe movie was fun although the music could have been better. My one big problem with Luv Ranjan movies is that the female leads are all shown negatively. Just one time, I wish he would have a female character not as air-headed or annoying. Moving on to the acting, all three male leads were great. Sunny and Omkar filled the shoes of their characters and Kartik was again fantastic, especially in his 5 minute long monologue. The girls were okay, although their characters were pretty vapid. Overall, the movie was entertaining and a fun watch."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "makkusidhu",
        "review_rating": "8",
        "review_title": "Not Disappointed...Worth watching",
        "review_detailed_main": "Salmon pink, Old rose pink, Carnation pink, Hot pink, Mergenta pink... Seriously I have never imagine that a pink color can be so difficult to understand. But the movie was not that difficult. The trailer was slightly disappointed but movie did not. It works guys. Story line was similar to first part and which has carried up correctly. Movie is full of fun and some emotions. Dialogues are outstanding. Specially the speech given by Kartik Aryan (as Gogo). Yes, I am talking about the speech. They added this time as well with equal humor. You will feel it less if have already heard it in first part. If we talk about cast then I can say that you will not gonna miss Liquid or Chaoudhary. It is not because new guys has replaced them but I will must day that they has created there own space. Now you have Chouka and Thakur to talk about. The guys managed to do handle there roles well. While watching you will not feel like you are watching this again because it is different one.\n\nI don't think I need to tell you about the story because it is expected one but the music is good. You can have it in your next parties. The puppy's noise had perfect timing. You gonna love it. Luv Ranjan holds the craze of movie. Movie budget was high as this time as holiday was in Thailand not in Goa. All three relationship stories had there own taste. The awesome thing about this movie is that you can feel the life of characters because it is every next door's story.\n\nIn the end I will say that it was worth waiting and worth watching. The the taste of Pyar ka Punchnama is in there."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "deysarkarmonalisa",
        "review_rating": "5",
        "review_title": "Only funny to male viewers",
        "review_detailed_main": "While the comic effects of the movie were holding up and was enjoyable from time to time, for me the fun was a little marred seeing an image of urban woman portrayed this way. Not going into the debate of which is 'feminism' and which is 'femiNazism', I just don't think a comedy lives up-to its name successfully if it is only funny to a certain gender. The previous reviews have already covered the material of plot and other theatrics. I only wish to say that a comedy movie shouldn't leave its viewer with a bad taste in mouth, as 'Payaar ka Punchnama' did for me. I leave the women this advise, \"Watch the movie, but be ready to force a laugh or two, if you don't want to be termed a dirty feminist, and blackballed by the male companionship, who will find this movie highly 'realistic'\"."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "akkypaul",
        "review_rating": "10",
        "review_title": "Every girl should watch this movie with their guy!",
        "review_detailed_main": "Girls are gonna hate but guys, you are gonna love it! This movie is for all those good guys out there who treat their girl like a princess and end up becoming a victim of their atrocities. I have personally experienced all the kind of girls that have been showed in the movie and I must say that it was a confidence booster making me realise that when all the time, I was made to feel guilty of things I was not responsible for, I was actually right and they are wrong. The fact that there are 10 guys available for any girl out there has given girls the liberty to exploit the guys and use them are \"use-and-throw\" stuff. Long have they forgotten that guys, no matter how masculine they are have a heart too. This movie is a pat on the back for all those heroes who have survived such girls and a wake up call for all those guys who are being used as resources rather than humans. The acting in the movie is fine but what's powerful is the dialogs and the content. They film makers have portrayed the reality from the point of view of a guy and is a feel good factor for every guy out there who is having a difficult time in his relationship!"
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "adityadhingra",
        "review_rating": "10",
        "review_title": "Ridding the Funtastic journey of Love,Money & a lot of Chu**yap-pa",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "jay-techie2007",
        "review_rating": "8",
        "review_title": "Watch It For Brilliant Humor And Comic Timing",
        "review_detailed_main": "Pyaar Ka Punchnama 2 is a story about three flatmates/friends whose lives are going perfectly going fine till they fall in love with three girls and since then everything they never ever dreamed of, starts happening. It is a sequel to the movie with the same title released in 2011. The plot is exactly the same as the one in the prequel but the movie doesn't disappoint at all with brilliant dialogs, perfect comic timing.\n\nStory and Screenplay (8/10): For some, the story might be shouting out loud - misogynist - and may well be exaggerating the male dilemmas of the relationship. However, there wouldn't be any humor in the movie without that. When the plot and the story doesn't leave much room for creativity, the only thing directors need is an excellent screenplay. And that's what the movie boasts off. While there are some dull patches in between but overall, Luv Ranjan, Rahul Mody and Tarun Jain does a great job with some brilliant punches throughout the movie that the audience will remember after walking out of the cinema hall. The amount of thought and detailing that has gone into the seven minute monologue of Kartik Aaryan is beyond imagination!\n\nActing (7/10): PKP2 doesn't boast of any brilliant acting performances. However, all the newbies do well enough to the demand of their roles and thanks to their good comic timing that covers up for expression flaws. However, if there is one person you will miss in the entire movie, it would be Liquid (Divyendu Sharma) who had created a good fan falling after the first movie. While Omkar Kapoor looks sophisticated enough for the character he plays in the movie, he looks too cool (or may be expressionless) to be frustrated, happy, sad or angry with anything. Sunny Singh Nijjar makes a good attempt to replicate Liquid's level of frustration but misses it by miles. Kartik Aaryan shows some promise in the movie and steals the show with his epic seven minute monologue that tops up his earlier performance. The girls have been given largely similar roles and they respond with largely similar performances.\n\nDirection (8/10): Luv Ranjan has impressed with his direction in both the movies. Especially, given the challenge with PKP2, he does well in terms of execution of an already told story. The movie relied heavily on the screenplay, humor quotient and the dialogs and that's where Luv Ranjan directed all his efforts. Climax could have been shorter. For twice or thrice, you feel like its going to get over but it doesn't. With only four songs, he even saved about 15-20 minutes he had wasted in his earlier movie.\n\nOverall (8/10): Overall, PKP2 is a great entertainer if you are fine with some adult comedy. The point of view is exaggerated but that's where the fun is."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "rom_fm",
        "review_rating": "10",
        "review_title": "Laughter all the way",
        "review_detailed_main": "Laughter Hard ...all the way. It was funny till the end. Awesome and I really felt that I would never laugh so much in any movie.\n\nIts hilariously awesome !!!!!!!!!!!\n\nThe movie looked like a reality show with a comic feel. Its not possible NOT to laugh. You cant stop laughing , that is the way the movie is.\n\nThe direction is intelligent and the acting is superb. The script is outstanding. Movie is made freely showing reality and not worrying about anything. Result is a SUPER comedy entertainment. I may have to watch this movie again and again."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "sunilsach-14175",
        "review_rating": "1",
        "review_title": "Pyar ka p..................",
        "review_detailed_main": "one out of ten because..all the three girls are of three different nature. Chiku is from a high-profile family, who is shoptalk, has her own style of living, does not mind even having her 'male best friend' share flat or room. Chiku feels that her boyfriend shall be always available to take her as well as her friends for shopping, beauty parlours. Supriya is from a middle class conservative family, who is afraid to commit in love because of her parents. Kusum is independent-spirited, always conscious of sharing the bills (which is non-negotiable for her), keeps on sharing her concern over Tarun spending his money over his friends.\n\nHow the three couples' relationships are projected in the movie? What all complications arise? Who takes the control of the relationships? Do the boys find the girls cool even after dating as they appeared to be initially? The film does mention the fatness with which the face-book relationship status and profile photographs are updated. The boys blabbering and complaining about the girls' behaviour and regret of their freedom being curbed generates laughter in parts, but most of time, these are bit annoying and irritating."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "jmoneyjohal",
        "review_rating": "8",
        "review_title": "PKP2 is a laugh riot, and its way better then the sequel. A film every man will relate too.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "nitishkumarmohanta",
        "review_rating": "8",
        "review_title": "One of the best Youth Oriented 20th Century Movie!",
        "review_detailed_main": "This movie perfectly defining today's era's relationships before marriage. Ha ha it's definitely close to reality. And if you're a 'Single' then must must recommending it from my side. You should surely go for this one but I'm warning you if you're in a relationship then it's a Red alarm for you 'Don't ever try to watch it with your partner' 😂ha ha😆 It may affect your relationship that's it.\n\nOverall a fun journey of entire 2hr 20mins. You can simply observe brilliant performances by the actors especially the boy trio, they all justified their roles in this entire movie. Songs were average but okey to listen. Direction was absolutely brilliant and Screenplay was also pretty gripping.\n\nAnyway! 8 out of 10 Stars from my side. It's better to avoid watching with your family, but yeah! If you are that much close with your cousins or siblings then you can go for it, just you have to take care of Kissing scene and bikini scenes comfort. It's completely great to watch with your beloved friends. I'm damn sure you're gonna enjoy it."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ss-ece-sit",
        "review_rating": "10",
        "review_title": "An Eye Opener",
        "review_detailed_main": "Movie is awesome and eye opener. Must watch. Much like the first film, Pyaar Ka Punchnama 2 traces the love life of three men who are foolish enough to fall prey to three women (who may not be manipulative or scheming per se, but simply take advantage of them) and their whims and fancies. But the sequel is even more hilarious than the previous one - so much so that you are most likely to ignore the 'anti-women' part of it all together.\n\nAll the actors fit perfectly into their characters: The boys effortlessly depict what men often discuss during boys' talk and the girls play dumb as and when the character demands.\n\nFull marks to movie....."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "laddeepesh",
        "review_rating": "9",
        "review_title": "Just an awesome movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ba-amitk5",
        "review_rating": "1",
        "review_title": "what a f***ed up movie",
        "review_detailed_main": "one of the horrible movies ever saw, I was feeling so bad for myself for wasting my time. director should resign from making such movies and actors should refuse to accept such stories. I think i need to watch Porn to clear up my head.\n\none of the horrible movies ever saw, I was feeling so bad for myself for wasting my time. director should resign from making such movies and actors should refuse to accept such stories. I think i need to watch Porn to clear up my head.\n\none of the horrible movies ever saw, I was feeling so bad for myself for wasting my time. director should resign from making such movies and actors should refuse to accept such stories. I think i need to watch Porn to clear up my head."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "Abby_qadir",
        "review_rating": "8",
        "review_title": "Luv Ranjan has some serious issues with his girlfriend..",
        "review_detailed_main": "Pyaar Ka Punchnama 2 (2015) directed by Luv Ranjan starring Kartik, Sunny, Omkar, Nushrat, Supriya & Ishita in the lead roles.\n\nAfter falling in love, three roommates experience changes in their lives.\n\nThe movie is certainly one of the best comedy movies of 2015. I don't remember when was the last time I had laughed so much. Luv Ranjan direction is brilliant in each and every aspect. Dialogues works as an icing on the cake for the story. I was not able to see any flaws in the movie but then Kartik looks less confident then the first part. I will specially mention Thakur's character (Omkar Kapoor). His performance was dazzling. The way he acts in the movie was so good that no one can say that it is his first movie. Chauka (Sunny Singh) reminds us of Liquid (Divyendu) in some scenes. Out of all the three actresses, Kusum (Ishita) was very honest with her character, rest all done an average job.\n\nIt is a reality check for all the guys who are or wants to be in a relationship and while watching the movie one can easily relate the situations. While guys will find this movie entertaining, girls will be judging as an one sided drama."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ashik_ahmed84",
        "review_rating": "10",
        "review_title": "Best movie I ever see in my life.",
        "review_detailed_main": "Great movie. Just loved it. Story is great. Direction is super and all the characters was really fantastic. Keep it up."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "dj_ivon",
        "review_rating": "9",
        "review_title": "Much better than the first part and full on entertainment.",
        "review_detailed_main": "Even though it has a similar style of first part, this story line is much more entertaining and much more realistic. And the cast does a wonderful job."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ThebossVEGETA",
        "review_rating": "10",
        "review_title": "Take note boys : Moral of this movie fits perfectly from us men perspective",
        "review_detailed_main": "First of all the movie relieves the viewers from boredom and the whole plot is entertaining and fun , but the real lesson learnt from this movie is don't be chutiya and i just loved the 7 min fire nonstop dialogue of kartik aaryan based on truth, and also another lesson this movie gives to us men is just focus on your career, work hard for your career and mainly stay away from dating girls or even making girlfriends as you know the outcome of relationships from this movie STAY SINGLE CAUSE SINGLE LIFE ROCKS MY BOYS CHEERS 🍺🍺🍺."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "binducherungath",
        "review_rating": "2",
        "review_title": "Pyaar ka Punchnama 2 may manage to entice people who genuinely have some vendetta against women.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "y-shubhash",
        "review_rating": "10",
        "review_title": "amongst the top three bollywood movies I have ever watched",
        "review_detailed_main": "Laugh riot while watching. But the movie has a serious message. A must watch for guys.\n\nOverall, ' Pyaar Ka Punchnama 2' is a hilarious movie. It is certainly a movie based on sexist theme but in general not far from truth. It is especially unfair for girls who are straightforward in their relationships.\n\nSynopsis: Three young guys share a flat, have easy-going life and are great friends. However, their lives change dramatically after they fall in love.\n\nThe story and dialogues are well-written and told. The actors have done a great job. I feel like the movie could have been half an hour longer though. It seems as if the mood of the movie is changing very fast. Therefore, the story could have been expanded at least at the expense of the songs. In general, I do not understand the purpose of having songs in the bollywood movies. It is pointless and disturbs story-telling, which applies to this movie as well."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "Rawal_Afzal",
        "review_rating": "9",
        "review_title": "A hilarious film!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "ddddishaaaa",
        "review_rating": "1",
        "review_title": "Who makes such garbage ? Women Hate movies",
        "review_detailed_main": "It is utter crap ! Actress who works in such film are degraded and shown such poor light I wonder why they are choosing such horrible movies. It is just busy taking jab on women. Full of sexist joke and women hate."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "dineshprakash",
        "review_rating": "2",
        "review_title": "It got proved that first part was by chance or borrowed",
        "review_detailed_main": "Story is conceived by Director himself and he is also co written screenplay but it seems that he had directed the film in half sleep. Not a single shot is impressive. Story is totally confusing. Screenplay enhances this confusion. Whenever they want, they jump to song or random scenes. Dialogues are OK but fade up with repeating 'Chu...' word with all male characters, like it was only word to express their irritation. Surprising film is 'A' certified but again full of beeps. Even 'Gangs of Wasseypur' came without beep, then how anyone can impose beep in this childish foul language in compression of dictionary of slangs in 'Gangs'. Beeps irritate. You can't relate with any of characters. All are exaggerated. Without any reason father opposes daughter marriage with a boy? How and why? A girl can doubt her male partner but don't mind sleeping her male best friend in a bed!? Is she mentally challenged? First part background was interesting and fresh but this part have irritating score. Look of film is very good. Every frame looks beautiful. Credit goes to cinematographer #SudhirK.Choudhary . Monologue of this film shows that how much they have gotten carried away with their appreciated work in first part. This monologue is lengthy too and have some interesting punches but bores due to rush and meaningless performance. Actor was in so hurry that he was not acting but participating in some 100 meter race. This film deliberately tries to cash all good things of first part but fails badly. First half is slow and second half in unbearable. I like taking of few scenes, like all three couples come in frame one after another, while saying their point of view. Long scene of mall, where couple is talking and moving on escalator. Basically steady cam work is very good. Performance wise Kartik Aryan as Gogo and Omkar Kapoor as Thakur are OK. #SunnySingh as Siddharth is impressive. He looks good and acts perfectly according to character and scenes requirement. Sonali Sehgal as Supriya and Ishita Sharma as Kusum are good. Nushrat Bharucha as Ruchika alias Chiku is below average. Music is peppy."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "abhak-48344",
        "review_rating": "1",
        "review_title": "Stereotypes women and basically tends completely to the male audience in the most cringey storyline",
        "review_detailed_main": "Most of the movie is based to please their male viewers and does nothing but bound women into 3 stereotypes (which are shown by the three relationships displayed in the movie.)\n\nMost of the plot is the most basic crap you would see in a wattpad fanfiction (if it were meant to be a stereotype on women.) Half of the movie is so ridiculously predictable that after a moment you wonder if you're just here to see famous celebrities make fun of women based on their societal stereotypes.\n\nThe reason this tends to the male audience is because it feeds them that the stereotypes about women are not only true, but also shows that in the end its male friendships which always win over relationships, which is why you should never take relationships seriously (unless it is with your mother/sister) and only cater to your male friends. Apart from this there are many scenes which a woman seeing would absolutely cringe upon and get overcome with rage but would make male audiences (those who don't care about portrayal of women) laugh or instead make them hot and bothered.\n\nMost other critics say it is not misogynistic because it \"doesn't hate on women,\" which is true. It doesn't. But it reduces women into mindless creatures bound into 3 stereotypes."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "lordabdullah-85153",
        "review_rating": "4",
        "review_title": "Massive Downgrade from the first",
        "review_detailed_main": "I can't believe this movie has even close to the same rating as the first one. This movie basically takes everything that made the first one good and makes it bad. I only watched the first hour and just couldn't bare it anymore. The acting performance are honestly terrible, Neha/Chiku's (I don't know her real name) performance was such a massive downgrade from the prequel. Whereas there, she played her character of a manipulative girlfriend so well it was almost scary, while here she just overacts in every scene and basically speak and react like a child and it's just impossible to take her character seriously. The screenplay is also added with cringe bollywood tropes that the first movie brilliantly avoided. I don't recommend this."
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "tushargupta-27286",
        "review_rating": "5",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt4430136",
        "movie_name": "Pyaar Ka Punchnama 2",
        "movie_rating": "7.2",
        "review_username": "maulin5",
        "review_rating": "5",
        "review_title": "Can be skipped easily, better to watch part one",
        "review_detailed_main": "I don't know why, but, before its release, I lost the hope that this film will do something. And because of this thought, I didn't enjoy this sequel while watching. One another factor is tiredness because of Navratri. And just the day before, I went to watch Talvar, a masterpiece. So, lot's of factors affects on me to dislike the film. Though, story is as same as its prequel. But, it contains less humor and more unrealistic drama. I can't be able to figure out how those couples fell in love with each other! Even I'm confuse about the girls' behavior, which has been shown in the movie, is real or not! I know, all the boys have to suffer a lot in a relationship, but, those things have been shown in the prequel, so I was expecting something better and good. But, the movie fails to impress me. In the whole movie, I laughed hardly 4-5 times. Even the 8 minutes long dialogue of Kartik also fails to give some impact on me. Everyone in the theater is just seeing, without laughing. Performances wise, the movie is okay. Not a single character can stand along with Liquid. Kartik is above average. Omkar Kapoor is just okay. Sunny Singh is below average. All the three heroines are okay. But, especially I liked the character Chiku, played by Nushrat Bharucha. Only this girl remains in my mind after the movie. Music is as poor as it was in prequel. Even, I can say more than the prequel. Not a single song is there that can touch my mind or heart, and which I can think about to download. Dialogues could have been written better. This can be also said in terms of story and screenplay. Only 2 dialogues made me laugh - 'Haath se shaadi karlo' & 'Bhai hai, muh bole? -Na, Bina bole!' So, on the whole, according to my experience, Its a waste of time and money, can be easily skipped, better to watch its prequel on laptop, or else do whatever you want to do man!"
    }
]