[
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "bobjohnson994",
        "review_rating": "5",
        "review_title": "Broke Too Many Rules",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "view_and_review",
        "review_rating": "3",
        "review_title": "This was Pathetic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "imace-38156",
        "review_rating": "5",
        "review_title": "Poor choice to put out.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "darthMisaskernew",
        "review_rating": "1",
        "review_title": "14 years for this??? MY THEATER WAS LAUGHING THE ENTIRE TIME!",
        "review_detailed_main": "What were they doing in those 14 years between 2 and 3, staring at their shoelaces? I love the first two films because they are both scary and well made, but WOW, this film is GARBAGE. TRUST ME, this is coming from a HUGE JC fan! The film takes place between the 1st and 2nd movie, which is dumb because nobody wanted to see what happened between the 1st and 2nd movie. I wanted to see what happened after the 2nd movie, but even then, it's really confusing because the plot keeps jumping back and forth between all of these dumb characters. I couldn't tell if the film was set in the present day, in 2001, or in the 70's because of the craptastic pacing. There's even a scene where you can see a 2016 Chevy truck in a film that supposedly takes place in 2001. Speaking of pacing, there is none! Nothing happens in this movie and the film ends right when it should've started! There are so many characters that the film gets lost in itself. The first film had Darry and Trish, simple and easy. The 2nd film had the athletes and a side-plot revolving around an angry father, but it was still easy to follow and well balanced. Here, we have an old lady getting visions from her dead son, then we have Sargeant Tubbs from the first movie, then we have the anti-Creeper gang, then we have some teenagers, then we have a country boy who has a crush on a girl, and said girl also gets her own storyline. All the characters are pointless and are not flushed out because the film is trying so hard to give equal focus to everyone. The CGI is SO BAD and is EVERYWHERE in the film. It's so bad that my theater was laughing louder than the actual movie! The Creeper doesn't do ANYTHING, no smelling fear, eating body parts, he just sorta walks around and grunts. There's one good scene where a group of teenage bikers finds The Creepers truck in the woods, and it's the only good scene in the entire film. That's it! Worst of all, WE STILL DON'T KNOW THE CREEPERS'S ORIGINS!!! I've been waiting nearly 2 decades and we STILL DON'T KNOW WHERE HE COMES FROM??? The film ends on a cliffhanger but I do not want a 4th movie. This feels like it should've been made for the SyFy channel and seeing this on the big screen is like seeing Lake Placid 6 on the big screen. Just don't do it!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Bibleman_Adventures12",
        "review_rating": "1",
        "review_title": "A serious contender for worst film of the year.",
        "review_detailed_main": "Oh man, where do I even begin?\n\nI've been waiting for Jeepers Creepers 3 since elementary school. When the day was finally announced last month, I couldn't contain my excitement...well, I could, simply because Jeepers Creepers had worn off a bit. I had realized that the first film, though good in certain aspects, was an overall flawed film, and that the second film was an outright piece of garbage. I predicted that this film would be bad, but oh man, I never could've guessed it would be as awful as it turned out to be. JC3 makes JC2 look good. There's so much wrong with this movie that I'm not even sure where to start.\n\nFirst, let's start off with the plot, or lack thereof. There are several stories Jeepers Creepers 3 could've told, but it's like they didn't know which one to choose, so they just made a film with no plot at all. JC3 takes place in between 1 and 2, which is a baffling decision since that story didn't need to be told and it ruins the continuity of the JC timeline. The film revolves around, like, 9 characters and I don't even know which character would count as the \"main\" character because nobody gets adequate enough screen time. We have Officer Tubbs from the end of the first movie, a character so minor in the original that it really makes you wonder why Salva would write him a lead role. Then we have the team of Creeper Hunters led by Stan Shaw. We also have some dementia-stricken old lady, her teenage daughter, the country hunk that's crushing on her, a group of punk teenage bikers, and the Creeper himself. They all have notable screen time but most of them are totally pointless and some don't even have resolutions of concussions to their characters. Notice how out of all of these characters, I never mentioned Trisha? Despite Gina Phillips's on-poster credit, she is not in the movie at all and instead has a 15 second cameo at the very, very tail end of the movie. The film constantly flip-flops back and forth between all of these characters at the most inconvenient times, and by the time the story has come back around to a set of characters, we've already forgotten what's going on with them because the story has packed so much into a 5 minute span, yet so little at the same time.\n\nThe errors in the plot continue as, well, there is no plot. Pacing is something that seems totally oblivious to Salva and company, as the film had no distinguishable act structure of any kind. The film still felt like it was in it's 1st act at the hour mark, and I'm honestly not even sure what the climax was supposed to be, if the film even had a climax to begin with! We're just watching the film and suddenly, seemingly out of nowhere, the screen turns black and the credits begin to roll. Tonal shifts are aggressive in this film, as one minute it's an episode of Degrassi, then it's John Carpenter's Vampires, then it's Evil Dead 2, and then it's American Horror Story. None of it matches and it feels like 3 or 4 random scripts were cobbled together without any editing. There are some moments the feel like Salva was trying to make a borderline comedy, but it's unclear mostly due to our next point...\n\nNext is the production. Salva is a great cinematic director and the first two movies are filled with gorgeous shots and atmosphere so thick you could cut it with a blade. I suppose Salva got lazy with JC3 because this movie feels like it was made for TV. The film is laden with abysmal CGI, some of the worst I've ever seen in a theatrical release. The CGI in the original film looked better, and that came out in 2001. The editing and lighting are often so awful that you can't even tell what's happening; there is one instance where a biker is snatched, or something, by the Creeper, but it's so quick and shot so poorly you can't even tell what happens. An audience member behind me said \"what just happened?\" and I was glad I wasn't the only one. The production actually reaches \"so bad it's hilarious\" status on several occasions, including a slow-mo scene with the Creeper that was so over-the-top that it had the theater erupting in laughter. Trust me, it wasn't the only serious scene where the audience laughed hard at something meant to be serious.\n\nEven The Creeper himself is ruined. One of the most intimidating horror villains of the modern horror age has been reduced to a slightly irritated staggering drunk. Whoever decided to give him that bright red T shirt should be fired, as it looks severely out of place on him. Oh, and we STILL don't know his origins. By this point, being teased on his history comes off as a cheap gimmick, like even Salva has no idea what to do about his backstory.\n\nSo there you have it. JC3 is possibly 2017's worst film so far. Too many main characters, an unfocused story with no conclusion, too much plot yet somehow not enough plot, absent pacing, a nonthreatening and goofy looking villain, Syfy channel levels of production, some of the worst CGI ever, and a massive kick in the groin towards the JC fan-base. I used to wonder why this film was denied a worldwide theatrical release, thinking Salva's history may be the culprit. I've now realized that the more likely reason is that the producers saw how awful this film was and couldn't bear to release this on the big screen. It's most definitely a home release, and that's where it should've gone. Judging by how hard my theater laughed at every scene, I doubt I'm the only one who holds these opinions."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "blametaker77",
        "review_rating": "1",
        "review_title": "low rent, pretentious, and pointless. The Creeper deserves better!",
        "review_detailed_main": "Jeepers Creepers 3 is less of a movie and more of a prolonged bowel movement. Production wasn't delayed, it was 14 years of cinematic constipation, but unfortunately, they finally crapped out a pitiful, useless end to the Jeepers Creepers saga. Ironically, the budget was probably less than a roll of toilet paper. Also, for the record, I am a die-hard fan of the first two films and I promise you I went into part 3 determined to like it, despite the garbage trailers and negative online buzz that was surrounding it. Bottom-line, the first film is scary, the second is fun, and the third is cancer. The creeper did not age well. Someone behind the camera has clearly lost their touch because this one just felt like a cheap, direct-to-video cash grab made without love or legitimate purpose. Avoid this one like the creeper himself and hope it goes away for 23 years... and then another 23 after that.\n\np.s. The ending is the biggest slap in the face to fan ever because the filmmakers know they won't be making another one... and I thank God for that."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Ducsoup",
        "review_rating": "1",
        "review_title": "Awful movie by any standard",
        "review_detailed_main": "It did not live up remotely close to the others. Story was bad. Acting was bad. Plot was bad. Special effects were bad.\n\nLet me save myself some typing and you some time. Everything was really bad.\n\nGo ahead. Watch it if you want. But you'll be all like \"man that was bad.\""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "destinymann-72348",
        "review_rating": "1",
        "review_title": "Total Let Down of the Jeepers Creepers Franchise",
        "review_detailed_main": "I love the Jeeper Creeper Series but this was terrible. From drive the truck while standing on the hood, the rigged truck, the buried hand, and overall poor acting, except from the horse. I watched better acting on \"In the Heat of the Night\" in \"Sparta Mississippi\" and in my Charles Barkley voice, this movie was turrible."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "daytrader-2",
        "review_rating": "1",
        "review_title": "Bad bad bad - Almost the entire movie was done during the daytime, sunny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "bromumen",
        "review_rating": "1",
        "review_title": "Worst outcome after 14 years of waiting!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "alsadag",
        "review_rating": "9",
        "review_title": "Excellent addition to the series",
        "review_detailed_main": "Watched it at the one day only release on Sept 26th. A really fun addition to series, more in the lines of Part 2 rather than the dark and scary tone of Part 1. One of the first positives that come to mind are the production values and the cinematography. Some of the camera angles are pretty awesome. Very hard to review this without giving things away. Another positive is some(attempt at) character development similar to Part 1. More screen time for creeper than probably both movies put together, which is awesome. Not every thing is rosy though...acting, especially that of the lead actress was wooden at best. Some claims which Salva made about the movie were not true, which was a huge disappointment for me. To summarize, don't miss it at any cost if you are a JC fan. Oh and there is a surprise cameo as well :)"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "dlmfilms",
        "review_rating": "6",
        "review_title": "Fun...But weird.",
        "review_detailed_main": "Jeepers Creepers 3 is a weird movie going experience. I loved the first one, and really liked the second one. I went into three wanting to love it. I didn't. But here is the weird part. The movie felt like it was never fully finished. Almost like a very rough first draft was the finished product. It almost looked as if they ran out of money before it was completed. It was very strange. If you are a fan of the first two, you will like to see the characters you love. If this is your first experience with the characters, you will be like what the hell did I just watch!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "cpellot-65050",
        "review_rating": "2",
        "review_title": "Disappointment",
        "review_detailed_main": "I waited 14 years to be disappointed. The acting was terrible, the story lines were terrible, and the plot was inconsistent. Because of the time difference between when the second Creepers was filmed and the third, everybody has aged especially the sheriff. It was obviously he had on a wig and it made him look comical. Despite my disappointment I continue to be a Creepers' fan and hope that the fourth installment makes-up for the third."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "brandenbass",
        "review_rating": "1",
        "review_title": "Complete garbage",
        "review_detailed_main": "Everyone was laughing it was so bad. I just felt stupid because I haven't been to the movies in two years and I wasted my time on this trash. NOTHING like the first two. I kept expecting them to stop the movie and say it was a joke and play the real movie the whole time. The first bit is too dark to see anything, then by the time you do it's just total crap. I've seen better effects on YouTube, and the story makes no sense."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ofumalow",
        "review_rating": "4",
        "review_title": "Jeepers, this one isn't very creepy",
        "review_detailed_main": "Normally with a movie like this that took so long getting and presumably had trouble securing financing, you'd expect the problem to be a restrictive budget. But actually \"JC3\" would have been better-and more like the earlier films-if it were smaller scaled and less costly. There's too much action here, too many characters, all unconvincing and sometimes silly.\n\nBut what's really inexplicable is that there's way too much of the Creeper, who is no longer a seldom-seen figure of mystery but one seen WAY too often, in broad daylight, moving around like a regular guy albeit in some kind of Comic Con costume. He's not scary this way. He's just some dude in a mask. Nor is the hitherto teasingly doled-out mythology at all heightened by overly graphic FX views of him in flight, or so much dwelling on the armored truck he's got that isn't just a \"death wagon,\" it's made out of indestructible stuff and has all kinds of lethal gizmos more appropriate to a \"Phantasm\" movie.\n\nLingering on a few characters in peril, with few and frightening glimpses of the Creeper, was clearly something that worked well for the prior installments. All that gets thrown out the window here, only lessening atmosphere and suspense. Victor Salva remains a technically proficient filmmaker (at least compared to most direct-to-video-level horror directors), and there are scattered things to like, notably giving Meg Foster a major role. Having #3 bridge the narratives of #1 and #2 was at least an unexpected decision. The movie isn't good, but at least it isn't dull (something you can't say about some of those later \"Phantasms\"). Getting an interview with Creeper actor Jonathan Breck, who appears a pleasant guy, provides a nice (if sole) bonus feature.\n\nStill, this is a disappointing film that goes from generally wrong-headed to just plain ridiculous at its ill-judged climax, at which point the Creeper becomes so feeble a menace he might as well be shown dancing to \"The Monster Mash.\" It's almost as if Salva wanted to deliberately kill off his own franchise, no matter that (of course) he claims #4 is already written."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "blondekitty1972",
        "review_rating": "1",
        "review_title": "Very bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "AlsExGal",
        "review_rating": "4",
        "review_title": "Lacks interesting characters and any sense of dread or mystery",
        "review_detailed_main": "Arriving 14 years after part 2, this latest installment in the supernatural monster movie series is a dreadful disappointment. Acting as a direct sequel to the first film from 2001, the story follows events from the following couple of days as the Creeper, a mysterious demonic killer of great power, continues his activities.\n\nHe awakens every 23 years for only 23 days, during which he causes mayhem and kills and consumes fearful human victims. A contingent of law enforcement officers try to finish him off, but he's determined to reclaim a lost relic that has been hidden away by a local farm family.\n\nWriter-director Victor Salva had trouble securing financing for this film, and it shows, with bad FX work and missing shots. There's also a surplus of badly-done green-screen work. A lot of time is devoted to the Creeper's distinctive truck, which is revealed to be loaded with booby traps. Besides the poor production values, this entry lacks interesting characters or a sense of dread and mystery (found in the first film), or any cleverly executed monster attack moments (as in the second)."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "rainyairaftersleep",
        "review_rating": "1",
        "review_title": "Shame!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "michaelbaltazar-31857",
        "review_rating": "3",
        "review_title": "Not The Best",
        "review_detailed_main": "Honestly, to me the movie was a complete and utter let down. I had some high expectations for this movie because the 1st and 2nd movie were so good and I thought this 3rd movie would have been way better. Although, when I went to the movies to see the movie I was really disappointed on how it turned out. There were many flaws from the movie. For example on how the video effects and cinematography turned out, this had way more green screen action then the 1st and 2nd movie those two movies took place in the open and I think this movie didn't get enough of the open area.\n\nAlso I was a little disappointed that they didn't tell us who Jeepers creepers really was. That was one of the reasons I wanted to see the movie. I do understand why the movie looked the way it did because the video effects and it was because they were on a low budget which is also why it wasn't advertised as much. So probably why a lot of people didn't know about the movie's release date or anything. Even with a lot of the things that was wrong with the movie I just hope in some way if they make another movie it comes out to be better."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "impactsker",
        "review_rating": "1",
        "review_title": "Jeepers Creepers 3 = Worst Movie Ever Made.",
        "review_detailed_main": "Theatre was full of laughter of how terrible the CGI and acting was. Jeepers Creeper's makeup was the only thing that was half decent but the acting again, terrible. Don't understand how the original can be so great as this ruined its legacy as a whole. Overall, I was waiting for the movie to end the entire time."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "user-15159",
        "review_rating": "10",
        "review_title": "Great old school horror",
        "review_detailed_main": "I loved the movie. It has a nice old school horror feel to it, and was shot beautifully. Quite atmospheric. Creeper looks fantastic. Great kills. I'd say it's better than plastic It.\n\nI hope they make Jeepers Creepers 4. I can't wait to see what happens next"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "whatgift",
        "review_rating": "7",
        "review_title": "Silly, gory and fun",
        "review_detailed_main": "Sure it doesn't compare to the previous movies, is cheesy, has some really hammy acting, and takes itself too seriously, but it's a fun and entertaining ride!\n\nSome great deaths and a fast pace keeps it from getting boring, shame that people don't seem to appreciate it for the silly slasher it is."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "blood-lust666",
        "review_rating": "4",
        "review_title": "Big Let Down",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "FilmBuff0409",
        "review_rating": "1",
        "review_title": "So boring",
        "review_detailed_main": "You'd think after 15 years the special effects would get better, but the creeper looks just as cheesy as in the first movie. This was beyond boring, I fought myself the entire movie not to turn it off when I wanted to. I just kept waiting for something to happen and nothing did. The characters are ridiculous, the plot is non-existent, and the movie just plain awful."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "valfrae",
        "review_rating": "1",
        "review_title": "They ruined it",
        "review_detailed_main": "They had soo much to work with. The music, the sub plots, but no. They complicated it way too much and the story made no sense at all. Jeepers Creepers gave me no creeps at all like he did in the first movie. In fact, in this movie, he was a comical character. Just a fat guy with a beer-belly, wearing a mask, and swinging swords. And the bad editing, oh my god. It looks like some 90s C-grade horror movie, not a 2017 movie.\n\nThe teen girl escaped him by doing nothing at all. Horrible acting by both the antagonist & the protagonist. Lack of romance in the relationship between those two teens.\n\nLack of empathy towards characters, cause I felt no connection.\n\nAND THEY DID NOT EVEN EXPLAIN HOW OR WHERE IT CAME FROM AND WHAT IT IS EXACTLY. They honestly had so much to work with and instead of a horror thriller, they made a romantic comedy"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "biancawhitlock",
        "review_rating": "4",
        "review_title": "utter disappointment",
        "review_detailed_main": "i am the kind of person who will watch a good horror/thriller if it sounds interesting with a low rating, i just think 'why not give it a try, and some times they end up worth he watch. but this was NOT one of them movies. i don't know if it is because i know how great the other 2 are, so i am comparing, but either way to me this movie was not worth a watch. from the whole boring police scenes, and the shitty acting from the leads, its ridiculous !! i loved how jeepers was set around a couple, then a bus.. this... was set around boring police and a really story line! defiantly did not have the same feel to it as it did !\n\ni am NOT a hater of new franchises being made and remakes. but this is just a let down, should of just left it were it was!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "zakaryanmary",
        "review_rating": "2",
        "review_title": "I'm so disappointed",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Joshua_Penczek",
        "review_rating": "1",
        "review_title": "Hahahahaahhahahahahahahahahahahaha (translation: We've found the next Birdemic)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ejmc111",
        "review_rating": "4",
        "review_title": "Sad to say I wanted more for the wait",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "michaeljcummings",
        "review_rating": "5",
        "review_title": "Unsatisfying Letdown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "theairmaxsstalker",
        "review_rating": "9",
        "review_title": "give Salva his possibility to shot please!",
        "review_detailed_main": "I am not a fan of finding fault with films, I like to find any little things and assign them to the pluses. I know the director's past. This is my favorite director despite his mistake. He is very talented. This movie was almost great. It is basically a scenario. The only thing that upset me was the worst CGI. In the first two films, he was gorgeous. And that was 20 years ago. I understand that there was a low budget for part 3. It is sad. The director is so talented that he takes out the film for script and direction. People made sure that a director like Steven Spielberg could no longer produce masterpieces."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "petrun-42039",
        "review_rating": "6",
        "review_title": "Not totally satisfied with this one",
        "review_detailed_main": "I cannot say I was totally satisfied with this one, but there are a couple reasons for it. First, they never tell you or go into great length to tell you anything about the creeper's origins, reasons for eating or why he even exists. The second is that they did not completely close off the story, in my opinion. I also did not find it as exciting as previous creeper movies, my own perspective on that one. Enjoyable, yes, but I felt as though they could have done more on this one. If there is another creeper movie in the future, I hope it is better than part 3. Left much to be desired for me."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "rcappold",
        "review_rating": "1",
        "review_title": "Worst Movie",
        "review_detailed_main": "Don't waste your time seeing this movie. The best part of the movie was the interview after the credits. The fact the movie was only released on 2 days and is premiering on TV within a month tells you how bad this film is. For someone who enjoyed the first 2 films, I was shocked how bad this movie was. Stick with the first and the second movie, because this one will be a total let down!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "uwnavi",
        "review_rating": "1",
        "review_title": "Absolute Trash...What did I just watch?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "optymus",
        "review_rating": "5",
        "review_title": "Effects!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "RuthlessGoat",
        "review_rating": "1",
        "review_title": "Should have been named Jeepers Stinker",
        "review_detailed_main": "Jeepers Creepers 3 (2017) O.K., I knew this would be a bad idea. The original Jeepers Creepers was a dark, creepy and effective horror movie until about the last 20 minutes. It has been awhile since I saw the original, but I remember the introduction to the Creeper was pretty terrifying. Jeepers Creepers 2 was just awful, as to be expected from a sequel of a movie like the original horror flick.\n\nThis brings us to the subject at hand, Jeepers Creepers 3, a film that I recorded from the SyFy network so that I could watch what turned out to be the greatest World Series slug-fest ever, Houston defeating The Dodgers 13-12. It was a good choice watching the baseball game as when I finally got around to watching Jeepers Creepers 3 it was simply horrible.\n\nHere is the synopsis of the movie. It was not about a monster, it was about a pouting girl who cannot afford to feed her horse. She also had a crazy Grandma who sat on a tractor staring out into space. Eventually Grandma dug up a Creeper hand and all Hell broke loose, or what passes for Hell breaking loose in this stinker of a film. That's about it, thanks for reading. Just kidding.\n\nMoving forward, the horse gets his lunch and the sad girl is out with some clown at the feed store who wanted to get into her pants, so he bought feed for Flicka. They ended up out in the woods, and when danger reared its ugly head, of course, the truck would not start. I will say that Meg Foster as Grandma was the scariest thing in this movie. I don't know what they did to her, maybe they sent her to Ugly Bulimia Camp, but she really looked rough.\n\nAnyway, just meh on this movie. It was not creepy, it was not scary and it was shot nearly all in broad daylight, which totally jettisoned any chance of this lazy effort being remotely scary. Only at the very end of the movie was it dark and foggy, but the ridiculously poor acting and editing (not to mention the cheap, annoying soundtrack) made it more laughable than horrifying. What made things worse (or better, depending on your perspective) is that there was about 10 minutes of commercials on SyFy for every 5 minute of movie. Thank Goat for DVR and fast forward\u0085or not. I cannot properly articulate just how bad this movie sucked. Victor Salva may have learned how to toss salad in prison, but he sure didn't learn how to make a movie sequel.\n\nJonathan Breck, who was a terrifying presence in the original, was totally squandered in this movie. I really don't care anymore as I am typing this review while the movie is still running. The Creeper just goes around in broad daylight, doing his thing, and avoid the police by the use of his police scanner. He was also inexplicably wearing a red shirt. I mean, why? Instead of scaring the Hell out of us flying around at night, he is running through a field (with his red shirt) wielding an axe that looks like it came from a LarpFest. The ending of the movie was absolutely pathetic. I mean what in the Hell does a random rabbit and that stupid horse have to do with Jeepers Creepers? Plus, the ending left the door open for another movie. Victor Salva should be returned to prison for this movie, much less if he ever attempted to make another one. Just, no."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "dcarsonhagy",
        "review_rating": "2",
        "review_title": "HUGE Letdown",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "steamboatwillie1928",
        "review_rating": "1",
        "review_title": "Made for DVD release",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "nogodnomasters",
        "review_rating": "5",
        "review_title": "This thing breaks all the rules",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "darrengabbe",
        "review_rating": "1",
        "review_title": "convoluted",
        "review_detailed_main": "I remember watching the first Jeepers Creepers and straight away wanted more. Again a few years later with 2. Not with this. I found the characters unrelatable, unlikeable and boring (so much so I fast forwarded in places) IT IS THAT PREDICTABLE!!! Seriously, I'm sure the SYFY channel threw a few bucks at this to rush it out before Halloween as an after thought. I heard a year or two back that another film was in the making. SO DISAPPOINTING IT WAS CRINGWORTHY"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "baileycrawly",
        "review_rating": "8",
        "review_title": "I Actually Enjoyed It",
        "review_detailed_main": "I don't really understand why so many people hated this movie. But, since the vast majority of the people who will read the reviews for this film are doing so to have their own negative opinions validated, we'll start with the things I didn't like:\n\n1) The acting was hit-or-miss. Some of the characters I enjoyed and was rooting for, while there were others I was just waiting to fall victim to the Creeper. 2) I'm not a huge fan of the multiple daytime scenes with the Creeper. I feel that he's best represented in the shadows of the night. That being said, the Creeper is at a place where most horror franchises wind up. The more of a villain you see, the less frightening and intimidating they become. The Creeper is kind of on the border of that; he needs to be treated carefully going forward or he could easily wind up being satirical (think along the terms of the later Elm Street sequels pre New Nightmare). 3) I'm not a fan of the Creeper's red shirt. It just doesn't suit the character well, I thought. 4) It's not quite the film Victor Salva wanted to give fans of the franchise, and it shows. The original Jeepers Creepers 3 was subtitled Cathedral, and the script for that original concept has been leaked online to show a much more complex movie that would've relied on a special effects budget much higher than the film could generate. If the stories circulating around the internet are factual, securing funding for this film was a major issue, resulting in Salva watering the script down to something to fit the budgetary restrictions. Some liberties were taken with the Creeper as a character and the things it's capable of doing, which were off-putting but, ultimately, this movie is a good example of working with what you have available to you, however little that may be. This film would've worked better as a sequel versus a prequel, showcasing a more technologically evolved Creeper in the next 23-year cycle.\n\nThat being said, what I enjoyed about this movie - and what led to me giving it such a high rating - is pretty simple: I just enjoyed the movie. It was a fun slasher from start to finish. It was as different from the other films as Jeepers Creepers 2 was to the original. It takes the character of the Creeper, includes enough of the previous entries in the franchise to please the fans, while at the same time telling a fresh and relevant story in an interesting way. Victor Salva, for all the controversy against him and all the protests, has proven yet again what an incredibly gifted writer and director he is. I only hope he keeps Cathedral on the shelf for consideration as a fourth part down the road.\n\nFinal note: without spoiling anything, I love that Victor leaves this film open-ended. He famously set the 23-year rule as a way of ensuring no sequels would be made (something Francis Ford Coppola managed to exploit to get the sequel), but at this point he seems to have fully embraced the fact that the Creeper is a popular figure in the horror movie universe and that, as long as there's an audience for horror, people are going to want to see more of the character. This film doesn't leave you with the question of whether or not there will be a sequel; it pumps you up for a sequel that's almost certainly in the works right now. So, despite it not being the film Salva wanted to give his fans initially, it's still a pretty fantastic and entertaining bit of horror."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Platypuschow",
        "review_rating": "6",
        "review_title": "Jeepers Creepers 3: Best one yet",
        "review_detailed_main": "We waited 14yrs for a third part to the Jeepers Creepers franchise, but did it deliver?\n\nWell let me clarify the previous 2 movies got a 3 and a 5 from me so they've hardly blown me away. I did however want to see the series continue and was looking forward to this.\n\nSadly the road to release wasn't easy for Jeepers Creepers 3, people didn't care about the movie so much as wish to boycott it due to the director/writer Victor Salva being a convicted paedophile. This frustrated me because though I understand peoples wishes to screw over this disgusting human being they are too blinkered. Can we kindly remember that this movie provided the livelihood of hundreds of people not just Salva, bigger picture people.\n\nAnd the movie, isn't half bad actually. In fact I'd say it's the best one yet. Full of interesting ideas, great kills and really builds up the mythology.\n\nSadly that's also its greatest flaw. This third part really humanizes the creeper, takes it away from being a mysterious creature cloaked in shadow. We now begin to find out it's origins, but alas the movie poses questions, gives the characters the answers but never relays them to the audience.\n\nThis wouldn't be so bad if it were a AAA movie guaranteed another part but this simply isn't. Will we get answers? Will we get a 4th part? Will we wait almost 15yrs for it again? Will it even get made due to the boycotting?\n\nIf they'd done a better ending complete with answers then I'd consider Jeepers Creepers 3 a really quite good film but in its current state it's enjoyable but flawed.\n\nThe Good:\n\nSome great characters\n\nWell cast\n\nThe Bad:\n\nVery much feels like a made for tv movie\n\nFAR too open ended\n\nThings I Learnt From This Movie:\n\nMeg Fosters eyes still stun me"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "teilarmimms",
        "review_rating": "3",
        "review_title": "Waited years only to be disappointed.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "anonveli",
        "review_rating": "4",
        "review_title": "Jeepers Creepers 3 fails to hold up to the first two",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "codycball",
        "review_rating": "3",
        "review_title": "I agree...probably the worst movie of the year.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "crashing and burning",
        "review_detailed_main": "The Creeper wakes every 23 years to consume human flesh. Sheriff Dan Tashtego and Sgt. Davis Tubbs have the Creeper's booby-trapped van. As it gets towed, the Creeper attacks and takes back his van. Kirk is taken after his dirt bike friends are killed. Next, teen Addison Brandon is taken. Tashtego and Tubbs continue on the hunt.\n\nThe first problem comes from the silly booby-traps. The van has more gadgets than a James Bond car. The menace of that van driving down the road in the original movie is lost. The Creeper in full daylight is not my favorite move of the franchise and there is too much of that in this film. This also suffers from a scattering of protagonists which does not allow them to gel together. It's also trying to bind the three movies together. Unless one has watched the other two recently, it's hard to put together the pieces. On top of everything, the CGI is cheap. This is a franchise crashing and burning."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "aldiboronti",
        "review_rating": "2",
        "review_title": "Terrible micro-budget sequel. Avoid!",
        "review_detailed_main": "Don't waste your time on this one. Salva clearly didn't have the budget to do the Creeper justice. Instead of the scary monster from the first movie we get a drunken hobo waving a dime-store toy axe. The plot is practically non-existent, the acting is terrible and I've seen scarier episodes of Scooby-Doo.\n\nThis is a bad bad film and Victor Salva should hang his head in shame for cheapening the whole series with this rubbish. Avoid at all costs."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "kosmasp",
        "review_rating": "4",
        "review_title": "Tying in",
        "review_detailed_main": "Meg Foster is in this, which is really nice to see. And seeing Jonathan Breck is back as the Creeper, which is also very nice. What is not nice is the convoluted story. While this tries to tie in the other movies (and the end is a nice tip of the hat one might say), there are so many flaws here, that it is difficult to really get behind the movie and the story.\n\nFor some the fact that there are allegations against the director was enough to boycott the movie, which after having seen it, doesn't seem necessary. I don't think the production had any trouble or issues - while the stories and allegations exist a long time (beginning of his career), I think they came up again, when the movie was about to hit cinemas. Not sure what your view is on that or if you even care, but it is worth mentioning.\n\nAlso worth mentioning, even if you don't care, is the fact that while this starts where the first movie left us off (character returning), this includes new \"gadgets\" and other stuff, that do not work well in context with what we had seen in the movies before. But maybe you don't care about that either and you just enjoy new things coming up.\n\nSo while this really lets the viewer down most of the time, the beginning and the end are really almost saving the whole thing entirely! Especially in the context with the other movies that already exist ..."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Wild-43358",
        "review_rating": "1",
        "review_title": "Jeepers creepers is one of my favorite horror films",
        "review_detailed_main": "And you know what? I even enjoyed the second one!\n\n(Not to mention I'm a massive fan of Justin Long because he's a wonderful actor and he's a horror icon in the acting industry. I have yet to see a horror film he was in that I did not like. And I even liked his other films of other genres.)\n\nSo because I enjoyed the first 2 movies soooo much! I was DEEPLY excited for this one! But.... Heh.. even watching the trailer I just knew ... \"this is not going to be a good horror flick..\"\n\nBut because I love this small franchise I watched it anyway just to see what it was all about. As most of the accurate reviews have already pointed out, and knowing that most remakes and horror films in general these days have been so terrible to the point where I gave up hope in the horror genre. Just knowing that If we ever get to see a real good horror film it will be VERY VERY rare these days at this point.\n\nWith that being said, coming from a massive Jeepers Creepers fan.. I slowly sunk in my seat... and hated the entire movie. I am so disappointed I'm not even excited for Jeepers creepers reborn."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "sequinlan",
        "review_rating": "1",
        "review_title": "This is the worst jeepers creepers yet!!",
        "review_detailed_main": "This was horrible! It was not like any of the other ones. It looks like it had zero effort. They should've never made a reborn if it was going to turn out like this. The flying cross looked so fake the part where she was being poured with blood and those people circling was stupid andthe girl being stabbed had already bled out. Also what a coincidence that the ambulance and the cops show up right when they leave that place. Why did they put her in the cop car she should've been riding in the ambulance if she had that wound! This was horrible I don't ever want to see it pops up anywhere. I don't ever recommend watching this!!!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "RosanaBotafogo",
        "review_rating": "8",
        "review_title": "Very good, I love the franchise...",
        "review_detailed_main": "Very good, I love the franchise, it's at the bottom 136th of Cineplayers, but that's it, I have a peculiar taste for trash's and horror B movies, having strange deaths, a lot of blood, bizarre beheading scenes and a minimally laughable plot, it's already adorable , when they take something grotesque seriously, I fall in love... The wonderful killer van reminded us of our late Christine...."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Kinsha",
        "review_rating": "7",
        "review_title": "Good to see the old Creeper again after all these years",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Allierubystein666",
        "review_rating": "1",
        "review_title": "They should be ashamed of themselves",
        "review_detailed_main": "I have seen many horror films throughout my life, especially throughout the last few years, but Jeepers Creepers 3 may just be one of the worst of them. Simply said, there is absolutely nothing redeemable about this movie. It takes a film of which I love and takes a hideous dump on it in the worst way imaginable. Let's be honest, the second Jeepers Creepers wasn't anything great either- but despite it being a forced cash grab with little to no plot- it tried to be something different and it tried to live up to the legacy of the first film. This film is not one to try. The final product is worse than fan films I have seen people make on Youtube of other horror properties, and the special effects are so blatantly horrendous and obvious that you can't help but squirt with how cringeworthy it all is. The dialogue feels like it was written by a computer and the characters are so thin you'll forget most of them even existed by the end of each scene. The acting is so triflingly bad you can hardly believe the actors were able to take themselves seriously, let alone the horrible line delivery that they have to focus on with such sincerity. To make things even better, the film just makes no sense, and looks so cheap it could have honestly been shot on an iPhone. Green screen is literally visible in shots, technology feeling more dated than Sharkboy and Lavagirl despite the 12 year gap. In the end, Jeepers Creepers 3 is a disaster of epic proportions and easily the worst horror film i've seen from the 2010's.\n\nMy Rating: 1/10."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "simonwebb-73141",
        "review_rating": "1",
        "review_title": "Why is there no 0 stars",
        "review_detailed_main": "Crap!! I have watched some crappy films, a lot in fact but this is a contender for the worst film ever made. If I had a choice between watching this again or clearing out the drains I would opt for the drain clearing. I am hopeful that whoever made this film is now banned from ever producing another movie ever. However on a positive note about the film it did end although I didn't make it to the end as it was such painful watching."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ryanshortfilms",
        "review_rating": "4",
        "review_title": "Jeepers Creepers is Back!!",
        "review_detailed_main": "I enjoyed the one night event the film had with fathom events! The movie was really good, had some cringe worthy moments, but was overall awesome! Yeah, the CGI was terrible, but the practical effects were incredible! The film is by far the scariest of the series, but the first film is forever the best! I still can't wait to own it on Blu-ray though, and watch it again for a second viewing! And I will watch this film every year with a marathon of all 3 films!!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "JoesDreaming",
        "review_rating": "1",
        "review_title": "As bad as it gets...",
        "review_detailed_main": "This movie was absolutely horrible (and laughable) in just about every respect. The truck itself is the star of the movie and even that's weak. I was wondering why the movie was already being shown on the sy-fy channel. It took one minute of actually watching it to see why. lol Disappointing, to say the least..."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "stankovicaleksandar",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "Perhaps I'm very disappointed, because it was a movie sequel that I waiting impatiently and that I really wanted to see. Also, I must say that I am the big fan of the Jeepers Creepers franchise. The story throughout the movie is unconnected and boring. In same scene, there is daylight in one movie frame and night in another (only few seconds apart)? Second mistake is the selection of the time-line. I don't think anyone is interested in what was happening between the first and second movie. Maybe I was disappointed so much because I expected sequel not prequel. In addition, I think that the audience would be much more interested in knowing what happened after the second part when they killed Jeepers Creepers. Perhaps Salva choose that period for third part because he wanted to make another one. However, regarding all that was happening with this movie release (all the protests and everything) I am sure that Salva will not shoot another Jeepers Creepers any time soon. All that makes this movie total failure. I saw it once, and I don't think I want to see it again."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "amspaugh-56-450645",
        "review_rating": "1",
        "review_title": "What happened?!",
        "review_detailed_main": "This will go down as the worst sequel to any franchise. It's bad enough that fans really loved the first one, and even found things to like in the second movie. 14 years later! And this is what we have. It was shot mostly during the day. The jeeper guy had a mask on and wore a red shirt. Just plain cheesy. Absolutely no take always or plot development. Bad acting, horrible effects and now I'm just f up space here so I can finally move on with my life and write this off as one bad experience."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Coventry",
        "review_rating": "4",
        "review_title": "Let's put this franchise on the shelf for at least 23 years now, shall we?",
        "review_detailed_main": "I shamelessly admit being a fan of the first and the second \"Jeepers Creepers\" films, and I'm also one of the people who closely - and seemingly endlessly - followed the production status of the third film; which was already announced shortly after the release of the second. But, probably for a wide variety of reasons and much to the frustration of myself and many others, part three didn't immediately come. I remember that, at a certain moment, the inexistent sequel was even going to be named \"Cathedral\" and had really cool teaser poster, but alas, Victor Salva made the inferior stalker thriller \"Rosewood Lane\" and the passable backwoods demon chiller \"Dark House\" instead. Now, almost out of the blue, \"Jeepers Creepers 3\" is here after 14 years, but it doesn't have a cool extra title anymore and the plot - as well as the entire production - is formulaic and disappointing. One of the gimmicks in this franchise is that the protagonist monster only prowls once every 23 years. Perhaps Salva also should have waited 23 years to take the time and pen down a worthwhile finale to the series.\n\nThe \"Creeper\", a sort of lonesome demon with a hideous mug and an unclear mythology, is busy slaughtering random teenagers and terrorizing the area with his old-timer van full of death traps. It's being pursued by the obsessive Sheriff Tashtego and a small vigilante army, but the Creeper proves that he's not the type of demon that can easily get killed. There's also a weird and confusing sub plot with Meg Foster (who actually looks scarier than the Creeper) receiving messages from her murdered son regarding the monster's origins, but that leads absolutely nowhere. \"Jeepers Creepers 3\" lacks tension, likeable characters and genuine menace coming from the Creeper character. Suspense & atmosphere were two things that parts 1 and 2 had plenty of, and therefore they still stand as modest genre classics. Considering the exaggeratedly long pre-production phase and the overall weakness of the third installment, I don't think a \"Jeepers Creepers 4\" is desirable, though."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "DJ_Shilo",
        "review_rating": "4",
        "review_title": "He Will Find You!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Colbee2121",
        "review_rating": "9",
        "review_title": "a solid building block for the 4th installment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "kamalbeeee",
        "review_rating": "6",
        "review_title": "Good horror thriller...!!",
        "review_detailed_main": "A weird man kills people once in 23 years for 23 days.\n\nSome of the Victims family try to destroy him and police also try to catch him... Good story and screenplay but some logic missing... Due to fast screenplay we couldnt catch the logic mistakes.. There is no flashback about that weird man.. there are 3 parts of the movie... All watchable.. A weird man kills people once in 23 years for 23 days.\n\nSome of the Victims family try to destroy him and police also try to catch him... Good story and screenplay but some logic missing... Due to fast screenplay we couldnt catch the logic mistakes.. There is no flashback about that weird man.. there are 3 parts of the movie... All watchable.."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "BA_Harrison",
        "review_rating": "3",
        "review_title": "Creeper crap.",
        "review_detailed_main": "Jeepers Creepers 3 sees the return of that hideous monster who likes to prey on defenceless young boys. But that's enough about HIM—let's get on with talking about the film\u0085\n\nThis third entry in the Jeepers Creepers series stars Gabrielle Haugh as Addison, who finds herself gathered up and thrown into the back of the rusty old truck owned by 'The Creeper' (Jonathan Breck), who has returned after 23 years to once again feed on unwary teenagers. Out to try and rescue her is Buddy Hooks (Chester Rushing) who isn't happy about Addison being snatched away before he can declare his love for her.\n\nAn incredibly muddled script, sloppy editing, dreadful CGI, a seemingly invincible creature that drives a cartoonish vehicle loaded with booby traps and a range of fancy weaponry (including a Creeper\u0099 javelin, Creeper\u0099 shuriken, and Creeper\u0099 homing road mines), and loads of unanswered questions (despite suggesting that we might at last be given some facts about the monster's origin): JC3 is an extremely disappointing sequel in almost every way imaginable.\n\nWhatever your opinion of director Victor Salva as a person, it's hard to deny that he can turn out a fairly decent film when he really tries, but this one feels like little more than a life-less cash-in to bleed money from avid fans. If you're looking for revolting gore or decent scares, definitely look elsewhere: this one has neither (unless you count Meg Foster's frightening countenance. Old age can be a cruel mistress)."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Wuchakk",
        "review_rating": "5",
        "review_title": "The Creeper is baaaacccckkk",
        "review_detailed_main": "RELEASED IN 2017 and written & directed by Victor Salvo, \"Jeepers Creepers III\" is set between the first film and the second one and therefore the events take place in 2001. Sheriff Dan Tashtego (Stan Shaw) and a team of Creeper-hunters hook-up with Sgt. Tubbs (Brandon Smith) to destroy the flying creature as it terrorizes a farming community in the South. Meg Foster and Gabrielle Haugh appear as a troubled grandmother and mopey granddaughter respectively. Chester Rushing plays the latter's wannabe boyfriend.\n\nI can see why some would be disappointed by this flick: (1.) The story opens in an unnecessarily convoluted manner. (2.) Until the climax, the Creeper appears mostly in broad daylight, which naturally takes away from the creature's mystique. (3.) The Creeper now has his own eye-rolling 'Mystery Machine' with built-in weapons and defenses. (4.) While the movie teases us with explaining the Creeper's origins, it doesn't deliver. Instead, the ending (with a cameo from Gina Philips from the first installment) is a lead-in to a possible fourth movie.\n\nAddressing these criticisms: (1.) While it's true that the story begins in a convoluted manner, everything eventually comes together and makes sense, sort of. (2.) Yes, the Creeper loses his mystique, but the daytime sequences can be defended on the grounds that the Creeper only has 23 days every 23 years to conduct his diabolical business; thus it makes sense that he'd be active day and night, not just night. Besides, there are several night scenes. (3.) I agree that the Creeper's vehicle is too cartoony and it takes away from any sense of genuine horror, but it provides the opportunity for some slasher thrills. (4.) I was anticipating discovering the secrets of the monster and so was disappointed that its genesis wasn't explained, BUT this compels me to see the next (and presumably final) movie, IF there is one.\n\nIn other news, the female cast is scant, but Gabrielle Haugh certainly makes up for it with her tight jeans in the last 10-15 minutes, lol.\n\nTHE FILM RUNS 100 minutes and was shot entirely in Louisiana (St. Francisville, New Roads, Ethyl, Jackson and Baton Rouge).\n\nGRADE: C+"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "swilliky",
        "review_rating": "3",
        "review_title": "A lower quality addition to the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "FlashCallahan",
        "review_rating": "3",
        "review_title": "We waited 14 years for this rubbish?.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ma-cortes",
        "review_rating": "5",
        "review_title": "Average follow-up with terror , action , creepy scenes and violence",
        "review_detailed_main": "So-so and thrilling horror movie with an eerie and creepy monster. As revealed in the comics, the Creeper's evil goes back millennia, demanding Human Sacrifice and having wiped out the local farming community. The Creeper relishes tormenting its victims physically or mentally, and shows no care at its actions once accidentally causing an entire town to be destroyed. Shortly after the events of the first 'Jeepers Creepers' film, the police discover the Creeper's truck filled with dead bodies. It results to be a bizarre truck owned the Creeper (Jonathan Breck) which appears each new 23rd spring, after several years. The truck has been rigged with several booby-traps, including spikes that emerge from the bed of the truck, and a safety system composed of 2 internal sabers and a spear that is ejected from the rear , shooting out from the tail-pipe , in addition to some poles in the doors . After a massacre Sheriff Dan Tashtego (Stan Shaw) arrives, Sergeant Davis Tubbs (Brandon Smith) tells him what happened and Tashtego informs him that the Creeper has been around for thousands of years and must be stopped. Tubbs assembles a task force to destroy the Creeper and they are travelling across the rural South to meet him once and for all , while growing closer than ever before to learning the secrets of its dark origins. He needs humans for a good barbecue and some young riders are menaced by the murderous maniac Creeper, they then flee and looking for to save their own skin , when the cannibal go after them things go awry . Meanwhile, the monster terrorizes a local farm inhabited by Gaylen Brandon (Meg Foster) and her granddaughter Addison Brandon (Gabrielle Haugh) . The Creeper regularly slaughters all in its path, target or not, and demonstrates utter sadistic relish in every evil it commits. Every 23rd Spring, for 23 days, it gets to eat. Welcome to day 23. This summer feed your fear. Are you hungry for more? The Creeper is back for more. By the time you hear him, by the time you see him it's too late. Like a bat out of hell. He can taste your fear. Feed the Fear. Its time has come. Third Time's the Charm. Fear the Creeper. It's coming...and it's hungry. Something Wicked Has Returned .\n\nThis exciting movie with original monster , displays terror, suspense , cannibalism , thrills, and lots of blood and gore . The genuinely scary monster packs an excellent make-up, is played by Jonathan Breck who gives a real chill as the horrible creature , furthermore appears the veteran Stan Shaw who confronts Creeper along with Brandon Smith who appeared in the first entry as Sergeant Tubbs . So Brandon Smith and Jonathan Breck reprise their roles, while Gina Philips has a brief cameo at the end as Patricia \"Trish\" Jenner. The Shuriken of Bones that the Creeper used was made from cattle bones that were carved, varnished and welded . The motion picture was regularly written and shot by the franchise director, Victor Salva, he tries for profundity at the end and blow it . Salva is an expert on suspense's creator of atmospheres, such as he proved in : 'The nature of the beast¨, ¨Powder¨, ¨Rites of passage¨ and ¨Clownhouse¨. This director is a craftsman who usually makes a cameo appearance in his movies.\n\nThe saga is formed by the following ones : ¨Jeepers Creepers¨ (2001) with Jenner brothers, named Patricia: Gina Philips and Derry: Justin Long , Jonathan Breck, Patricia Belcher , Brandon Smith, Eileen Brennan. ¨Jeepers Creepers 2¨ (2002) with Ray Wise , Eric Nenninger , Nicki Aycox , Travis Schiffner, Lena Cardwell in which Gina Philips turned down the chance to reprise her role from the first Jeepers Creepers movie, but Justin Long has a cameo . ¨Jeepers Creepers 3¨(2017) , though it is set between the first and second film. ¨Jeepers Creepers: Reborn¨ (2022) by Timo Vuorensola, stars : Sydney Craven, Imran Adams, Jarreau Benjamin."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "Boring Characters and a Pretty Weak Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "bf-vietnam",
        "review_rating": "3",
        "review_title": "$10,000 budget?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "rjsdavis1",
        "review_rating": "2",
        "review_title": "What was the point of that?",
        "review_detailed_main": "In short - this film is garbage. Utter garbage. If you liked the original, you'll hate JC III. This has all of the look and feel of a TV Movie, or a low budget film that was sent straight to DVD.\n\nThe story is utterly lame. There are no shocks in it. It is not creepy in any way. This time, we see an awful lot more of the Creeper and the film-makers have seemingly tried to give it some \"character\" or even some \"back story\". This was such an error.\n\nThe reason that the first film makes you jump, is because you don't see too much of the Creeper, and know almost nothing about what it is or what it's capabilities are. This changed in JC II - which in part was more of a comedy horror film than an all-out shock-fest, where it was demonstrated that he could be brought down with a large harpoon in the chest, and subsequently in the head (not a spoiler as JC II is 14 years old!).\n\nReleasing this nonsense, that supposedly sits between JC and JC II in the timeline makes no sense and offers a few more tricks on the part of the Creeper (various weapons that appear from the truck during the film) to \"spice things up\", but in fact it fails epicly to deliver anything new that's in anyway creepy or scary. Everything is predictable. There are no shocks.\n\nOh, and what was going on with that cameo from Gina Phillips (not a spoiler as she's named in the credits)? A film that takes place \"a day or two\" after the original JC (2001), where Gina is supposedly now a day or two older, but is in fact 16 years older and no longer looks like a teenager (she was in fact in her very early 30's when playing a late teenager in the original JC!), but she now looks like a woman in her 40's (because she is in fact 47 now), but is still trying to pass herself off as a few days older than her persona in the original JC? That was simply moronic.\n\nThe acting overall is lame and lifeless (Stan Shaw - what happened to you man?). The actors are entirely unable to convey any sense of peril or fear. This is making low-rent movies by the numbers, and I hope it made a big loss so that they don't make anymore of this nonsense.\n\nWhat should they done? Picked up after where JCII ended, with an aged Ray Wise and his son ready to take it on right from the get-go in their barn and see where that went when it awoke - 23 years later.\n\nJC III as a storyline was such an error. I fear for JC IV which apparently has been written. If it's set in the same time period, this will be an error too.\n\nPS - have a think about where some of these weapons are appearing from on the truck. It's just stupid, if weapons and defence mechanisms entirely defy the laws of Physics. (The Creeper flying not included in this of course!)"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Patient444",
        "review_rating": "5",
        "review_title": "More Saw than anything.",
        "review_detailed_main": "How did it come to this? Are they serious? Is this a syfy production? What's with the effects? Was logic also abducted by the creeper and dropped somewhere in a corn field or something?\n\nWhat a letdown! Man oh man! JC1 is one of the best horrors out there. So much tension. Suspense. Build up. Real, genuine scares, not cheap jump scenes! And don't get me started on the Creeper! Also, the cast of the first film does an amazing job. Just unbelievable!\n\nAnd we skip part 2 in order to reach the 3rd one faster: cartoon characters that do nothing more than die. Horrible special effects, complete lack of belief in the monster and let's not forget the new add on to the series: booby traps! All over! As many as possible! And of course the Creeper itself gets these new uber powers, him and his truck also. He becomes something like Hulk in an Iron man suit I think.\n\nOverall, if you are a die hard fan of the series, you'll watch this no matter what. It feels like after Alien 1 and 2, they throw in Alien 3. And they expect you to like it as well. Just go with it..\n\nAll in all, a fourth movie is in talks. It looks like they chose to return to form. Problem is this one did so bad, I'm pretty sure the hype will die out. Even finance should be a problem. They can't use the same camera work they did in this one. It's a disaster. And so many cut scenes it feels like the job is just not finished yet. Seems more like a sneak preview.\n\nNow you've been warned. It is as bad as they say it is.\n\nCheers!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "tornadoman140",
        "review_rating": "8",
        "review_title": "Worthy Addition to the JC Canon",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "a_chinn",
        "review_rating": "6",
        "review_title": "And unexpected franchise remains solid",
        "review_detailed_main": "This underrated horror series is not going to appeal to all tastes, but this third installment absolutely delivers the goods for fans of the series. The Creeper returns, as does Jonathan Breck playing The Creeper, with series writer/director Victor Salva recounting the events between the first two films, which involves a small town sheriff and a team of Creeper Hunters led by Stan Shaw taking down this flesh and blood urban legend. I think what I like most about this series is that it's basically a straightforward monster movie set-up, but each film stands apart from the one preceding it. The first film was more of a creepy \"Children of the Corn\" like rural urban legend story. The second film was more of an action packed horror suspense film. This third film combined those two elements, adding onto the lore surrounding The Creeper while also providing a number of suspenseful and scary action set pieces. The budget on \"Jeepers Creepers 3\" is noticeably smaller than the previous films, but it's nonetheless an effective horror film that's filled with suspense, action, and send-a-chill-up-your-spine horror imagery. It's also a lot of fun to see the return of the BEATINGU truck driven by The Creeper from the first film. Overall, the third entry is not as frightening as the first film and is not as large of scale as the second film, and is easily the weakest of the three, but it's still a wildly fun horror film for genre fans."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "harlequinofmars",
        "review_rating": "1",
        "review_title": "It's a no for me dawg",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "satelite_finder",
        "review_rating": "1",
        "review_title": "Marcelo , Florianópolis Brasil",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "drewnes",
        "review_rating": "2",
        "review_title": "\"So you're just okay now? I just saw you rollin' around on the ground like you were having your brains scrambled.\"",
        "review_detailed_main": "I should've never watched this. The little material that was good in the other movies got completely changed and ruined in this low budget tripe."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "sweetdimples-49128",
        "review_rating": "1",
        "review_title": "Makes no sense",
        "review_detailed_main": "If Buddy was supposed to be on the school bus in the 2nd film, you would think they would have had a \"buddy\" in the 2nd film. Fans of the 2nd film knew every single teammate on that bus including the cheerleaders and freckle McGee wasn't one of them! Those kids on that bus had no idea what they were dealing with besides minxie (due to premonitions). If \"Buddy\" was on that bus, he would have warned the teammates what they're up against. They messed up the entire storyline."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mayenkkhadka",
        "review_rating": "1",
        "review_title": "Not scary at all",
        "review_detailed_main": "1 & 2 were good. And now they have messed it up. Not scary at all.."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "dwharton-15601",
        "review_rating": "3",
        "review_title": "If you like the Jeepers Creepers franchise, ignore this!",
        "review_detailed_main": "This movie was honestly awful. As a standalone movie it would still be bad, but it really makes a mockery of the franchise. I like to pretend this one doesn't exist."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "slhma-86182",
        "review_rating": "4",
        "review_title": "What happened to the monster?",
        "review_detailed_main": "Having been a huge fan of JC 1 AND 2 i was sadly disappointed with this third installment.First of all,the monster has lost his creepiness.I should give the movie no stars just for that mistake alone. He is ,as others have said,too human.There was nothing human about him in the first two movies.The kill scenes are completely left out....instead of leaving the monster mysterious,they leave the kill scenes out! My favorite of the three movies is the second one because of all the gory and creative kill scenes. This installment is a continuation of the first movie,which i thought would be interesting but there were too many sub plots..none of them interesting.I never cared about any of the characters.I hate a movie that drags out sub plots.Again i have to say my biggest complaint is the monster himself.....why did they make him seem like a human serial killer? Why did they drag out the sub plots instead of setting up an interesting movie from the beginning? I shut the movie off three quarters of the way through..i didn't care to see the ending."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mannyvelazquez",
        "review_rating": "10",
        "review_title": "Jeepers Creepers 3, The Best Horror Film of 2017, so far!!!",
        "review_detailed_main": "The Best Jeepers Creepers film to date. Alright. I'm not going to spoil nothing so go see the film October 4th again.. The film was a complete homage to the first two Creepers films. Mostly, the first one. It was way darker and had more kills than ever.. We even almost got close to finding out the Creepers true origins that could be the secret to killing him ( Hopefully, Not). All of the characters had a connection to the Creeper that made it more interesting then the first one.The acting in the film was decent. The film moved very fast and was an excitement. And Gina Phillips cameo makes you really want to see Jeepers Creepers 4. Just hopefully they bring Meg Foster back for Part 4 because she made the film for me, she was a riot and those eyes are amazing! As a filmmaker of horror myself I condemn the history of Salva. And have seen every film he has made and think he has more of a vision then these crappy so-called filmmakers now. At lease it wasn't a complete remake more like a Prequel/Sequel. I hope they make the fourth film and keep it going until Part 12. If Nightmare on Elm Street and Friday the 13th can have a hundred sequels and remakes they should do it for the Jeepers Creepers franchise. Great Film."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "kluseba",
        "review_rating": "7",
        "review_title": "One should be glad this movie even saw the light of day",
        "review_detailed_main": "Being a fan of the first two installments, I had been looking forward to this third film for years but the release had been delayed multiple times and once it got released it received overtly negative reviews. The film wasn't played in any movie theater near me and once it got released it cost thirty bucks which was way too much in my opinion. I had to wait until very recently to pick the film up for ten bucks and didn't have any expectations anymore at that point.\n\nAs it turns out, Jeepers Creepers 3 is much better than its reputation. It isn't as atmospheric, creepy and intense as the first film but it's clearly better than the odd second installment in my opinion. A lot of people criticized that the film follows too many characters. I actually think this is a strength that keeps the movie diversified, entertaining and even surprising from start to finish. The different characters also have enough depth to convince. We follow cool black Sheriff Dan Tashtego and a group of citizens who want to see the titular monster dead because they have lost family members and friends to it twenty-three years earlier. Other parts of the movie focus on sharpshooter Sergeant Davis Tubbs who sees his police officers decimated by the mysterious creatures. We encounter mentally unstable farmer Gaylen Brandon who has lost her son to the creature. We meet her solitary granddaughter from a broken family who tries to defy the monster's attacks with the help of a young gentleman who has a love interest in her. The movie also shows what happens to the rude brother of the granddaughter's best friend and his three mates who go on a fateful biking trip. Despite all these story lines, the movie never loses focus or momentum as everything revolves around the titular monster and its gruesome actions. One could actually say the monster is the lead character here.\n\nAnother element I liked is the importance of the monster's vehicle in this film. It is filled with traps that prevent victims from escaping and others to get inside the vehicle. The vehicle almost seems to be an otherworldly entity which adds a fresh mysterious touch to the franchise.\n\nThe film is set between the first and the second installment which some people criticized. However, the movie connects all three movies and their characters very well. It gives some more background information on the creature without revealing too much which would be fatal for such a horror franchise.\n\nThe movie oozes with atmosphere since numerous scenes are set in the disgusting vehicle and because the titular monster gets a lot of screen time and is seen flying, investigating, killing, running and smelling in order to get as many victims as possible. Even though most parts of the movie take place during the day, the film manages to evoke a creepy atmosphere.\n\nDespite an abysmal budget, the movie is filmed with care. The special effects look solid and never too artificial. The camera work is calm and not shaky. The sound effects blend in very well. The soundtrack is appropriately chosen for this type of movie. The actresses and actors deliver overall realistic performances.\n\nHowever, the film also has its flaws. First of all, the film fails to surprise and is missing some intriguing twists and turns. The story could have been more imaginative. The conclusion is rather underwhelming and indicates that there might or might not be a sequel at a certain time which is frustrating after a waiting time of a decade and a half between the second and the third installment.\n\nSecondly, the movie has a creepy atmosphere but is missing some truly horrifying scares that made especially the first part so intense. This third entry focuses on character development but fails to elaborate upon its horror elements. One could rather describe this film as drama with supernatural elements.\n\nThirdly, the movie obviously hasn't met everybody's expectations and one could have expected something more spectacular after such a long waiting time. The film feels as if it were mostly just trying to cash in on the commercial success of the first two features instead of bringing anything new to the franchise. Don't get me wrong, Jeepers Creepers 3 is still an enjoyable movie in my book, but the delivery is too safe to leave a deeper impression after all.\n\nIn the end, fans of the franchise should ignore the overtly negative reviews and give this film a fair try without any unrealistic expectations. I'm glad the movie finally saw the light of day and was positively surprised by it. I can't wait to watch the three films in a row in the near future."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "jboothmillard",
        "review_rating": "4",
        "review_title": "Jeepers Creepers 3",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "jimibommarito",
        "review_rating": "",
        "review_title": "Embarrassment to the franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Still as dumb as ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "jithu00",
        "review_rating": "1",
        "review_title": "Just Run............!!",
        "review_detailed_main": "oh Boy last 14 years we're all waited for this Crap........?? I could'nt believe the same director is directed this Crap. There is no plot in this movie. looks like they shooted some clips and join together and put the Name Jeepers Creepers 3... most of the scene doesn't have continuity... pathetic............!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "karyn-28173",
        "review_rating": "1",
        "review_title": "Just Plain Awful",
        "review_detailed_main": "Horrible! Complete garbage. Everything about it was amateurish and laughable."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "dreamsinger-73873",
        "review_rating": "3",
        "review_title": "A Definite Disappointment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "karyn-16150",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "Literally the worst movie I have ever seen. The acting, CGI, and whole movie in general are cringe worthy. I'm a huge fan of Jeepers Creepers 1 but this is just ridiculous. It looks like a couple college students with $20,000 budget made this movie. I waited years for part 3 to come out, totally disappointing."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "13Funbags",
        "review_rating": "2",
        "review_title": "How could you think it might be good?",
        "review_detailed_main": "My biggest problem with this movie is that they changed the monster's whole back story and then had to spend 40 minutes explaining it. And not explaining it like, \"Here's how it fits in with the first 2\" but more like \"You don't understand what's going on because it's all stupid\". It's not as bad as the others say, I see worse all the time, but it's not good."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "godfreyanywar",
        "review_rating": "1",
        "review_title": "Laughably bad!",
        "review_detailed_main": "This is actually so bad it's unwatchable. What were the producers thinking"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "boramaster",
        "review_rating": "8",
        "review_title": "A worthy entry",
        "review_detailed_main": "First off. let's deal with the director. He did something awful and he paid for it, as far as the justice system can do. What is blindingly obvious is that he is an exceptional director (I mean, even 'Powder' sticks in the mind with some awesome beauty). Michael Bay can only weep (all the way to the bank, but still). This guy is exceptionally good at what he does. It is probably best to keep him away from young boys. It was probably best to keep Charles Dodgson (Lewis Caroll) away from young girls also. All that said. This is a worthy addition to the Creeper story-line and I must admit to looking forward to more."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "garrymangan-13404",
        "review_rating": "7",
        "review_title": "actually good",
        "review_detailed_main": "Surprisingly good all filmed in daylight I found very odd for horror this was good addition keeping in with the prwv films v good effort"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ryanpersaud-59415",
        "review_rating": "2",
        "review_title": "I Don't Even Know What To Say",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "GreenLanthorn",
        "review_rating": "",
        "review_title": "Worst Jeepers Creeper Yet!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "rod2623",
        "review_rating": "1",
        "review_title": "0/10.",
        "review_detailed_main": "It is undoubtedly one of the worst movies ever made. I'm not afraid to say that it's on my top 5 of the worst movies ever.\n\nThere's nothing good in this film, and despite it's kinda a new movie, the visual effects spoiled my eyes."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "PsychoBeard666",
        "review_rating": "1",
        "review_title": "UUUUUURRRRRGGGGGHHHHHHHH!!!!",
        "review_detailed_main": "Zero redeeming qualities and somehow worse than the 2nd film.\n\nThose FX, the wigs, the script, the heavy editing, the acting, the unlikeable characters, the inconsistent Creeper mannerisms, the nonsensical plot...\n\nUUUUUUUUIRRRRGGGHHH!!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Third time does not make the charm...",
        "review_detailed_main": "The \"Jeepers Creepers\" franchise should have stopped after the first movie. The sequel, \"Jeepers Creepers II\", was less than mediocre in comparison to the first, and this third movie is just downright abysmal and boring.\n\nThe storyline was inadequate and really had no solid story to sell. And it seemed like they were just making things up as they went along for the most part. I wasn't impressed in any way.\n\n\"Jeepers Creepers III\" had some very dull and one-dimensional characters milling about on the screen, which really didn't help to promote the enjoyment of the movie.\n\nThe movie was full of predictable events, and that didn't help to improve on the movie that was already fast sliding downhill. I actually fell asleep from sheer boredom. Yep, the movie was that boring.\n\nThe only reason why I am rating this third installment of \"Jeepers Creepers\" a four out of ten stars rating is because of the special effects, the creature design, and also because there was a fair amount of killing in the movie.\n\nHowever, and let's be bluntly honest, \"Jeepers Creepers III\" is not really worth the effort."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ericrnolan",
        "review_rating": "4",
        "review_title": "A review of \"Jeepers Creepers 3\" (2017)",
        "review_detailed_main": "Jeepers.\n\nThe first two \"Jeepers Creepers\" movies are vastly underrated classics, in my opinion — they're well scripted and boast a truly original and frightening bogeyman. The third, regrettably, struggles to retain even a B movie charm. It's a substandard horror film that I'd only grudgingly rate a 4 out of 10.\n\n\"Jeepers Creepers 3\" (2017) is cloddishly written and awkwardly filmed. The film also suffers from action sequences that are absolutely cartoonish. A lot of this stems from the titular Creeper's antique vehicle, which is now inexplicably depicted as being \u0085 conscious? Possessed by the Creeper? It drives itself, deflects bullets, launches projectiles, and contains booby traps that defy physics. This leads to some Wile E. Coyote-style fight scenes with the story's various protagonists, in which the saddest victim is the franchise's credibility.\n\nAbout those protagonists — there are far too many to examine with any real success; the two ostensible teenage main characters fall a bit flat. There are so many characters that have backstories connected with the Creeper (and his signature, decades-hopping supernatural murder sprees) that the film simply becomes confusing. And that confusion is made worse by this film's chronology with the previous movies — it takes place immediately after the first, but before the events of the second. (In all fairness, maybe the problem is me \u0085 I am being quite honest when I write here that I just do not follow movies as well as other people.)\n\nWith all of this exposition, though, one bit of lore is egregiously omitted – contrary to some of the movie's advance press, we learn nothing about the creature's origins. And this is extremely odd, because a bunch of characters do. There is a befuddling central plot point where the good guys methodically gain knowledge of their otherworldly foe by \u0085 touching one of its severed body parts. But we, the viewers, learn nothing.\n\nEven the makeup and special effects were inferior to the prior films.\n\nI'm confused by all of the things I've written above, as \"Jeepers Creepers 3\" was written and directed by Victor Salva, who wrote and directed the excellent previous movies in 2001 and 2003.\n\nI hope I'm not being too hard on the movie, because there's still some fun to be had. Jonathan Breck still chews the scenery quite nicely as the Creeper, and the monster's character concept still manages to please. In a horror movie market often dominated by seemingly interchangeable serial killers and undead little girls, the Creeper is a truly inventive monster — part human; part gargoyle; part body-stealing feral, Frankenstein's monster. He's fun to watch, particularly for horror fans who've grown tired of the Patrick Batemans and the various angry ghost children that endlessly haunt the zeitgeist. You could do a lot worse for a plot-driving antagonist.\n\nAnd, thanks to so brutal a bad guy, there are occasional moments of tension in the movie. It's genuinely scary, for example, when he attacks a group of teenaged motorcyclists.\n\nThis isn't enough to make recommend paying for the movie, however — even if you're a fan of the franchise, as I am. I'd wait for \"Jeepers Creepers 3\" to hit Netflix or Hulu, or wait until it's playing on SyFy again."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "queenvalbrient",
        "review_rating": "1",
        "review_title": "AM I A JOKE TO YOU",
        "review_detailed_main": "I am huge fan of the first movie... second... i wasnt so disappointed... but THIS!!! WHAT AN ACTUAL JOKE?! I cant even write a reviews without being so angry and laugh about it. Totally trash."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "gemini58",
        "review_rating": "1",
        "review_title": "Lower rating than JC3? Now that's bad",
        "review_detailed_main": "Jeepers Creepers 1 & 2 are among my favorite horror movies. As is usually the case, all subsequent movies in a franchise just become comedy. It's sad. JC Reborn lacks all the things that made the first two movies great. Even the Creeper is poorly acted. The cast is not much better. The story had a chance by starting out prequel but, after leaving the past it loses its potential before segueing into the present. And how is it that the first two Jeepers Creepers (2001 & 2003) has much better CGI twenty years ago?! Too bad the Director didn't have the skill, motivation or money to make a movie that wouldn't be only memorable for just how bad it is."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "donaldricco",
        "review_rating": "1",
        "review_title": "Every 23 years a terrible movie comes out...",
        "review_detailed_main": "The story takes place between #1 and #2, and starts up right after #1, so the premise seems promising! But this is one mother of a waste of time! BEATNGU, the creeper's vehicle has a bunch of new magic powers and is the main \"bad guy\" of this tale. And the makers of this film really Sharknadoed it, meaning the special effects are terrible and completely fake looking. The only scary thing is Meg Foster's appearance. Don't waste your time - just watch the first 5 minutes and then the last 5 minutes, and you'll see all that you \"need\" to see."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "waynehorrorshow",
        "review_rating": "8",
        "review_title": "It was good but he looked to human for me i liked his mistery",
        "review_detailed_main": "Was a good film enjoyed it like i did with the other ones, only problem was they got him close to camera made him look to human i like when hes in darkness or far way so he looks more of a mistery and made him more creepy and scary next time keep him a far worth the watch ddo"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "lojitsu",
        "review_rating": "6",
        "review_title": "Smack dab between 1 and 2",
        "review_detailed_main": "Oct. 19\n\nA-Z Horror Movie of the Day...\"Jeepers Creepers 3\" (NR - 2017 - US)...Corny fun!\n\nSub-Genre: Paranormal/Monster My Score: 5.7\n\nCast=5 Acting=5 Plot=6 Ending=7 Story=3 Scare=4 Jump=6 F/X=6 Creep=7 Monster=8\n\nSheriff Dan Tashtego and a team of creeper hunters enlist the help of officer Davis Tubbs to help stop the monster's eating spree.\n\n\"Fear has a scent...I've seen that thing inhale it.\" I will put this smack in the middle of the first two movies. It takes some of the good stuff from the first and the corniness of the second. I like the creeper and the kills are good, but they took too much away from the story in favor of cheap theatrics. It's a pretty fun watch, but nothing to write home about."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "irenesevier",
        "review_rating": "2",
        "review_title": "What The Hell?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Narcissist00",
        "review_rating": "1",
        "review_title": "Should be called Creepy",
        "review_detailed_main": "I was naive going into the first films and didn't know about the directors past. This is the only film I will ever rate without watching. Gutted because the first two were great B Grade horror movie. I just could t watch this, knowing!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "CriticXfactor",
        "review_rating": "1",
        "review_title": "👎",
        "review_detailed_main": "Please hired me to help write Jeepers Creepers 4. Let's shoot for an release date of 2019, so we able to make it up to all the fans, due to an total let down. I will make it a box office hit...this movie was a flop and had enough star power were it could have been an success. Please don't make the fans wait another 10 years for you to release some more 💩."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "morinoravenberg",
        "review_rating": "5",
        "review_title": "Yikes",
        "review_detailed_main": "This has to be the worst Jeepers Creepers movie ever, and in my honest opinion the original was the best- the sequel wasn't better but this one...wow....this one just makes you go like wtf did I just watch. Make very little sense to me. The story line is completely mashed up and is unoverviewable."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "benjamynkaye",
        "review_rating": "1",
        "review_title": "Oh Dear",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "drownsoda90",
        "review_rating": "5",
        "review_title": "Scattershot sequel",
        "review_detailed_main": "Long-awaited after over a decade of rumored production starts and stops, \"Jeepers Creepers III\" follows a small town battling the Creeper during his feeding time. A group of people with intimate connections to the Creeper bond together to stop him.\n\nSeeing the first \"Jeepers Creepers\" in theaters as a junior high schooler was something of formative experience for me, and while I don't think the original is a perfect film, it is finely-crafted. The sequel was good (but not great), and this third installment is unfortunately worse. The production values here are clearly hurting—it shows in the special effects particularly, which are both hokey CGI and poor practical effects. It's not surprising to me that many fans of this series have complained about the villain's appearance (which in and of itself is overstated). His face shows on screen more like a mask than anything else, and the monster now has an arsenal of elaborate weapons and his truck now built with souped-up security features that rival those of Fort Knox.\n\nThat's not even the half of it though. The main problem with \"Jeepers Creepers III\" is that it's spread far too thin, with its script juggling multiple plot lines ineffectively. There are too many characters, too many subplots, and not enough time to connect them in any meaningful way. It becomes weirdly episodic until the last third of the film, and even then, it all seems arbitrary. It almost feels as though Salva was writing the film as he went along, cramming as much as he possibly could for the series' swan song. Even weirder is the attempt to tether the film between the first and the second, which seems narratively inconsistent and tonally unbalanced if nothing else.\n\nMeg Foster has the most interesting character in the film, and she is without a doubt the best actress here. The younger supporting cast are serviceable but nothing to write home about; Stan Shaw is also likable as the sheriff and chief hunter of the monster. The finale is rather dull as well, with pacing that resembles everything that's led up to it.\n\nIn the end, \"Jeepers Creepers III\" is a weak followup to two rather good horror films. The visual effects and repeated slow-motion scenes wear on the senses, and there are far too many narrative strands to accommodate in a runtime under ninety minutes. It is somewhat amusing overall, but ultimately looks and feels like a television film, and fails to offer anything aside from a few mildly fun vignettes. Foster's performance is far better than the material demands, and that is one of the film's few additional strong suits. 5/10."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "SilverOrlov",
        "review_rating": "3",
        "review_title": "Once - Yes. Twice - Well, ok. Thrice - Damn, no.",
        "review_detailed_main": "If the silly horror movie clichés of early 2000s worked as a fuel that warms up the interest of an inexperienced public, and in the second part it could be simply forgiven, as a kind of justification for the canonical behavior of many sportsmen of this kind, in whose head there is more testosterone than \"brain mass\" ...Throwing such idiotic actions and characters in the face of the audience in the third film, is already disrespect for the audience and banally disrespect to such a concept as \"quality\". A small part of the scenes were interesting and effective, for which I will give 3 points, but otherwise it is bad."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "lauramcinnis-33909",
        "review_rating": "1",
        "review_title": "So many questions",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "drahulrajjsd",
        "review_rating": "10",
        "review_title": "It's Great To See An Old School Horror Flick Back On The Big Screen After A Long Time!!!",
        "review_detailed_main": "It's the 6th of December and I just finished watching Jeepers Creepers 3. It's actually kind of a shock to me that they are actually playing it over here in my country, Malaysia! First of all, I've seen a lot of bad reviews for this movie and also about the director's past. Anyway, I'm not here to do a review of the director's life. I'm here to do a review of this third chapter in the series. It's a direct sequel to the first chapter and it's really scary good, with eerie elements from part 1 and straight up action from part 2. It combines great performances from the legendary Meg Foster as Gaylen Brandon, Stan Shaw as Sheriff Dan Tashtego, the one and only Jonathan Breck, reprising his role as The Creeper, and also a big surprise cameo at the end. The practical effects were awesome and the CGI effects were not that bad, compared to a lot of the overrated bullshit that Hollywood produces in this day and age. I really loved the scenes where the scary stuff is happening in daylight, with action-packed and heart pounding scenes. Plus, some of the scenes were captured in slow motion, which I thought was really cool. It's really great to see an old- school horror flick on the big screen after a long time and I really hope there's a part 4."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ilanskipro",
        "review_rating": "7",
        "review_title": "Jeepers Creepers 3 is a surprise return!",
        "review_detailed_main": "Part 1, the Creeper makes an example of his victims. I know that wasn't very nice! But it really is true. This Thing is an IT, he's a demon of some kind. Part 2, the Creeper is onto his next batch of victims and never lets up! And now 14 years later (never too late), Part 3 brings the Creeper back to the old town to cause some, damage. Gore is there. Scares are there. And just overall good cinematography and cool scenes. Also, his BEATNGU truck is a character of it's own! Go see this!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "jwalkeruh",
        "review_rating": "1",
        "review_title": "Terrible movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "j0hn22",
        "review_rating": "3",
        "review_title": "The worst movie of the franchise",
        "review_detailed_main": "First of all, that movie was completely POINTLESS. The plot of the movie wasn't interesting and not similar to tye previous movie's plot. The storyline was terribly written, there were many plot holes (especially, about the chronological order of the movies). The characters weren't well-developed and they weren't interesting, at all. In my opinion, it's the worst movie of the franchise. Also, the killcount was awful. There weren't many kills and most of them, weren't bloody and gory. The opening scene of the movie wasn't good. Overall, it was a silly movie, that I still don't understand how it was connected with the previous movies. Moreover, it was so boring (especially, the last 40 minutes). The ending wasn't very well explained, it was so complicated. Actually, I didn't really care what was gonna happen, lol. Anyway, I'm really hyped about the 4th film of the franchise \"Jeepers Creepers : Reborn\" and I hope it's gonna be good..! Last but not least, the keeper's appearance wasn't really good."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "DreamerX616",
        "review_rating": "3",
        "review_title": "No Jeepers, No Creepers !!",
        "review_detailed_main": "I don' think I'll be able to add anything that hasn't already been said, I did not heed their warnings and give this a wide berth and for that I have only myself to blame.\n\nA lazy hack job of a horror movie, with next to no story line, undefined characters to root for, no scares, no atmosphere and no tension. It was all very underwhelming.\n\nEven the 'promise' of yet another sequel does not bode well for this franchise"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "james_wands",
        "review_rating": "1",
        "review_title": "What happened?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "uturnfilms",
        "review_rating": "3",
        "review_title": "Diminishing Returns",
        "review_detailed_main": "Wow what a steep drop off from the original two films. The script is terrible. The acting is super hammy- everyone is just constantly yelling. The Creepers outfit is lame. The effects are incredibly cheap- squibs, explosions, Creepers wings, car crashes, etc. Comical. Everything is really cheap, and all the characters are dull and one dimensional. I hate to say it, but the only decent thing is the direction, with some solid shots and compositions. This doesn't feel like a film that should have taken place largely in sunny daylight. The finale, if you can call it that, is abysmal. Just pretend this one doesn't exist."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "krystalsbeauty",
        "review_rating": "1",
        "review_title": "Boring load of s**t",
        "review_detailed_main": "Boring load of s**t, seriously don't waste your time... 1 hour 45 mins I ain't getting back"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Edvis-1997",
        "review_rating": "3",
        "review_title": "3",
        "review_detailed_main": "It is just very bad. Very very bad movie. It made me laugh because it was so ridiculously bad."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "wesleydavid-41531",
        "review_rating": "1",
        "review_title": "Not worth the time",
        "review_detailed_main": "One of the worst movies you will ever watch. Please do not bother watching this. It was produced and edited entirely by potatoes."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "aliciajmetcalf",
        "review_rating": "10",
        "review_title": "Was a good movie and can't wait for the 4th one.",
        "review_detailed_main": "I waited so many years for part 3 and glad they made. I know a lot people are disappointed because so many things were left out which I agree there was. Which is also why there's going to be another one and I hope they finally tell us about the Creeper's origin and how it came to be."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "AndyVanScoyoc",
        "review_rating": "6",
        "review_title": "Major plot sluggishness but I liked it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "dgfblackwell",
        "review_rating": "3",
        "review_title": "Terrible!",
        "review_detailed_main": "Bad filming, bad acting, bad story.\n\nShouldn't have been made."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "StuartNewman10000",
        "review_rating": "5",
        "review_title": "BEDISPOINTNGU 5 stars - but only because I love the Creeper.",
        "review_detailed_main": "Feels like 100 people were asked to write different parts of the film without knowing what anyone else was writing, the only requisite being to disappoint JC fans."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Sicknology",
        "review_rating": "3",
        "review_title": "They did the same with Strawberry Ribena",
        "review_detailed_main": "Jeepers Creepers the original was one of the best horror films to come out in a long time and had a real creepy style. the manner in which it was shot was simply beautiful. From the road trip scene, the distant yet very personal look of the creeper and the brutal inhuman kills, it was a stand out film. Jeepers Creepers II was a worthy sequel, it didn't have the shock value of the first, but it kept the legend alive and hope was put in for a third. This third instalment gave me the same feeling as tasting the new reduced sugar strawberry Ribena for the first time, knowing what you had for years and then the realisation that someone destroyed it. Simply put, Jeepers Creepers was something amazing to build on, part three is destroying the Creeper legend, taking all the goodness out and leaving you with a bad taste."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "myemail-38116",
        "review_rating": "2",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "awwplutto",
        "review_rating": "5",
        "review_title": "Better than 2, worse than 1",
        "review_detailed_main": "Not a bad horror movie. In that case being better than the lazy part 2, but better than the horrifying original."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "queme",
        "review_rating": "2",
        "review_title": "Crap",
        "review_detailed_main": "No details on its origan... No original humor like it had before poorly sown and they couldn't even get the kids mane at the beginning right. Wasn't jerry was darry. Butheads. not any were as gory or bloody as the 1st 2 films. I honestly can't say whether they should make another movie, but if they do please have someone else write and direct it , with the damn origan story. What the hell is this thing???!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "garbotalks-43212",
        "review_rating": "1",
        "review_title": "i couldn't even get though the whole thing, it was that bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "jt_boricua1981",
        "review_rating": "2",
        "review_title": "Not worth the 14 year wait",
        "review_detailed_main": "I was siked when i heard that part 3 finally got the ok to b made. I was beyond excited. It finally got a release date. I was even more extatic. The day finally came. Me and my brothers were ready!! We watched it. We looked at eachother when it was over. We shaked our heads in disgust. We couldnt believe what we just watched. The worst freaking movie ever. Definitely not worth the wait. Very disappointing."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "multiplayerxgesource",
        "review_rating": "10",
        "review_title": "GENIUS.... OBVIOUSLY THERE ARE PAID TROLLS LYING ABOUT REALITY",
        "review_detailed_main": "This is not the final movie first of all. Secondly....what fake CGI? This movie fills in a lot of questions about the TRUCK and other things. It doesn't have to explain anything. Kind of like how Steven Kings IT is a mysterious interdimensional entity that can be stopped by a TURTLE God or something. Soooooooo basically what we have are teenagers and kids slamming something they just don't understand. Most likely that OR paid TROLLS. Bottomline: If you want an entertaining thrill fest Halloween style horror movie, Salva delivers again!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "eventlaunch",
        "review_rating": "6",
        "review_title": "Just dont go into it with high expectations",
        "review_detailed_main": "And you will have a great time watching this mess of a soon to be cult classic"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "profsmichael",
        "review_rating": "4",
        "review_title": "Poorly written script and direction. At midway point a disaster",
        "review_detailed_main": "The original film was fantastic and has progressively worsened each iteration. Now, this third installment is quite frankly: terribly penned. Until midway, the film is fine. Nothing special, but rather bland fare. This I can stomach. The second half? Be ready for leaps of logic, physics, and honestly: cartoonish plot devices. Wiley Coyote Acme branded \"tools\" , \"weapons\" and a vehicle. Added to the nonsense; cartoonish and pretty terrible special effects for these parts of the movie. I literally fell out of my chair laughing at what was totally meant to be serious. The ridiculousness spoiled the entire movie for me, and made this an avoidable movie for anyone not a fan of unintentional farce. I am actually a fan of really bad movies, but you can't start this garbage midway thru a movie that you are striving to make serious. This is actually STUPID all in caps. I will avoid this writer/director combo in the future."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Fernando-Rodrigues",
        "review_rating": "4",
        "review_title": "\"According to director Victor Salva, Jeepers Creepers 3 will be the most frightening Jeepers Creepers film to date.\" - IMDb Trivia",
        "review_detailed_main": "Definitely not as tense and as atmospheric as the previous movies. It has weak CGI, weak actings, and an abrupt ending. Unnecessary."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "cathelltube",
        "review_rating": "1",
        "review_title": "Cheaper Producteper!",
        "review_detailed_main": "I just made the account to post how bad this was. It was wrong in so many ways that i cann't believe it."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "stevehanisch",
        "review_rating": "1",
        "review_title": "Whew. You better be drunk to watch this thing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "selenaignjatovic",
        "review_rating": "2",
        "review_title": "Who are the writers kidding?",
        "review_detailed_main": "It's mentioned several times in a movie that by touching the Creepers detached limb shows his origin and how he became to be. Of course it wasn't shown, because even the writers don't know. They can't think of anything that would make sense. And how could they? What possible \"origin\" can be thought of about a creature that it's one of it's kind, can't die and apparently uses magic (he extends his arm from a far, body lifts up and the axe goes back to it)? There is no \"origin\" for that. And the ones who \"saw it\", still couldn't figure out how to kill it. Because even the writers don't know how to kill it. They created such a character that even they can't figure out. As a writer myself - that must hurt, especially with a large fan base that expects explanations, which they can't give.\n\nBtw, poor dude that plays Creeper. I'm sure after 2 movies, he got to know his character. And now he couldn't play the REAL Creeper, but this poor sad sack that just whines and growls for literally no reasons whatsoever. He couldn't even do \"sniff and pick\". They made him go around killing people for fun, even though Creepers DOESN\"T do that! He kills who he wants to eat and who is useful to him... doesn't kill teens on bikes for joy and amusement! Dude, sorry you had to play this character like that. When the script comes and you still want to have a job after reading it - you agree even if you don't like it."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Adam_Lj",
        "review_rating": "1",
        "review_title": "One of if not the worst movie I have seen.",
        "review_detailed_main": "I grew up with Jeepers Creepers. The first movie was my go to scary movie as a kid. The 2nd was a decent flick to see.\n\nThis however... I have no words. The story is all over the place. The acting is horrible. It is set in mostly bright daylight with no scares. The CGI is some of the worst I have ever seen. The Creeper himself looks like a halloween mask. The CGI looks like it was made by a Youtuber in his basement.\n\nI was sitting in my couch laughing at how bad this movie was. It is sad to say the franchies probobly died with this movie."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "sjg-67529",
        "review_rating": "1",
        "review_title": "Total disaster",
        "review_detailed_main": "I love the 1st one, 2nd was eh but this was so bad it's not funny."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "zachgaston-05603",
        "review_rating": "1",
        "review_title": "Huh?",
        "review_detailed_main": "What was this? Was this a fever dream? Did this movie really happen? I'm legitimately questioning reality right now. I'm not sure if this was a joke or a genuine attempt at making a horror film. Either way it was awful. I would rather watch The Room 36 times in one sitting than watch this monstrosity again. If you plan on seeing this then I recommend skipping it and eating sawdust instead."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "bethlori",
        "review_rating": "9",
        "review_title": "A Heart Pounding Thriller!!",
        "review_detailed_main": "This is a good movie!! It's gory and crazy!! I Don't care what people say!! Victor Salva came back to make a third one and it's great!! The creeper is just bone chilling!! Good actors great script and Gory murders!! If you want to buy it got to Redbox and get it for $3.99. It ended in a Cliff hanger and a part four to JC 3 would be Awesome!! See ya!!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Vivekmaru45",
        "review_rating": "",
        "review_title": "This is not the final Jeepers Creepers movie, rather a sequel to the original film, following events before Jeepers Creepers 2.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "akaaisia",
        "review_rating": "6",
        "review_title": "Not terrible but.....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Stevieboy666",
        "review_rating": "4",
        "review_title": "The Creeper is back...unfortunately",
        "review_detailed_main": "Jeepers Creepers was a very good horror movie. Part 2 was something of a let down in comparison but still fairly decent. Part 3 just shouldn't really exist, other than to try and breath new life into the franchise and obviously make a few dollars. Don't get me wrong, it is not a bad movie. It just isn't a good one either. Bottom end of average in my opinion. It is an acceptable brain-in-neutral, watch it once. forgettable horror flick. Apparently this one is set between parts 1 and 2, so a tad confusing to those of us who are not big Creeper fans. We see way too much of him, and most of the film takes place in daylight, reducing any sort of scary atmosphere. Some of the CGI effects are on par with an average Sci-Fi channel movie, in particular a rolling truck that looks truly awful. Is there or will there be a part 4? I for one don't really care."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "paulocox",
        "review_rating": "1",
        "review_title": "Zzzzz",
        "review_detailed_main": "Utterly forgettable 3rd installment. 1 was ok, 2 was bad, this is just plain awful"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "wasteofpaint-63845",
        "review_rating": "1",
        "review_title": "Jeepers Creepers why'd they make this garbage.",
        "review_detailed_main": "Was this a made for TV movie? Very rarely do I fast forward movies or not watch the ending but that is just what I did for this joke of a film. I was expecting so much more considering it was made in 2017. Hoping it would have something with actual substance and get back to the roots of the original which was, in my opinion, a fun and a somewhat intense horror movie. However, it did quite the opposite and didn't do this the franchise any favours. If you're a Jeepers fan don't taint you're love for it with Part 3."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Paulo_Clemente",
        "review_rating": "3",
        "review_title": "Really Disappointing",
        "review_detailed_main": "A group force tries to finally take down the Creepers monster when he comes back 23 years after the last appearance. Let me start by saying that I like the first Jeepers Creepers , it´s my kind of movie, I know it´s a lot of horror clichés and so on, but I like this kind of movies. Then I watched the second and I did like it also. So when I saw that number 3 is out I was interested and wishing to see it. Well what a disappointment, this is a bad movie, really bad, the story is confused, the sequence sometimes is strange, and even the Creeper acts strange if you compare with the first two movies. I´m sorry to see that they ruin the series and please don´t do another. Waste of time watching this."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "luvdaball",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Horrible movie how did anyone give this over a 1!? Lol"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "hakeemtarabulsi",
        "review_rating": "3",
        "review_title": "Disappointing!",
        "review_detailed_main": "Well, it took them too long (from 2003 to 2017) to get the third movie ready, but unfortunately it was not up to the expectations, or let me put this way, it was not what I had hoped it was; incompatible scenes with a flimsy plot."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mider2009",
        "review_rating": "1",
        "review_title": "terrible (minor spoilers)",
        "review_detailed_main": "This movie was pretty bad, I had previously had it on pre order from Amazon but decided to watch it on the syfy channel to see if it was worth the twenty dollars. It starts off well, the plot is interesting, and there are cool things for the movie to work with such as the creepers origin, his weird truck and how it now seems to be alive. Instead of using messing these things into an enjoyable story it went down hill pretty fast."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "sandra-mich",
        "review_rating": "1",
        "review_title": "What did I just watch?!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "alexeevna",
        "review_rating": "10",
        "review_title": "wonderful",
        "review_detailed_main": "Almost 15 years later, a new part of one of the scariest horror films, Jeepers Creepers, has been released. Victor Salva, the director of this creation, delayed the third part for a very long time, they say that due to personal circumstances. The third part takes place between the first and the second, which is a little strange.\n\nThe plot is that the winged monster returns every 23rd spring, dissecting on his rusty truck and terrifying all living things. It is in this part of Jeepers Creepers that they will show in all its glory, it will appear before the audience in daylight, a grin, a look, gestures, all this can be considered. The truck has also undergone changes, in general, you will see everything for yourself.\n\nIn the center of the plot is a young girl Eddie, who lives on a farm with her grandmother, the woman suffers from mental disorders, her main goal is to save her granddaughter and take revenge on the clawed monster.\n\nA group of people are trying to confront Jeepers Creepers, how will the battle end?\n\nThe third part does not reach the first and second parts, I still wanted more horror, but in general I liked the film, and perhaps those who were in the subject and followed the story will like it. I was very pleased with the acting. There are practically no moments when they do not play out or overplay. Everything will be here, intrigue, confusing meaning, a logical plot and a very unexpected ending. My rating is 10 stars. It is up to you to decide whether or not to go to the cinema, the film can already be found on the Internet. I recommend Jeepers Creepers Part 3 to watch."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "vincentboudreau",
        "review_rating": "7",
        "review_title": "A worthy contribution to the Jeepers Creepers' canon. What'wrong with you???",
        "review_detailed_main": "Good acting and good production values. Nice photography. Good direction. This third instalment brings new new knowledge as to what the creature really is.\n\nWell sorta.\n\nThe story is refreshing and the plot original.\n\nI really enjoyed this and I am still scratching my head about all the 1 to 4-5 evaluations. Makes me wonder: aren't those critics rating their view of the world rather than the world itself?\n\nHmm..."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "theOGLovelace",
        "review_rating": "1",
        "review_title": "This is NOT Jeepers Creepers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "caseyliddle",
        "review_rating": "3",
        "review_title": "Wrong direction.",
        "review_detailed_main": "The first two movies are completely different wave length to this one most likely because of the age gap.\n\nThe movie became boring to watch midway through and led you to disconnect from the story. The story we was hoping to get a full back story of the creature yet to be disappointed.\n\nIt went away from having a small amount of victims to the police department and more off spring characters. This was the wrong direction from the other two movies. A shame beacuss of the potential this movie had.\n\nCL"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "jerralagbayani",
        "review_rating": "5",
        "review_title": "This movie is highly rejective but yet deserves credit...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "rellik0078",
        "review_rating": "3",
        "review_title": "A 14 Year Wait For This Trash. The Worst Jeepers Creepers Film Too Date. Let Down",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "parry_na",
        "review_rating": "2",
        "review_title": "Disappointing.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mzefabulous",
        "review_rating": "3",
        "review_title": "Waste of time",
        "review_detailed_main": "How long it took the writers to write this? One night? One and two was good, but this one fell short in so many ways. I expected answers, but in the end, I have even more questions."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Wizard-8",
        "review_rating": "3",
        "review_title": "Third time is definitely not the charm here",
        "review_detailed_main": "I feel I should first admit that the first two \"Jeepers Creepers\" movies weren't among my favorite horror movies of all time (though the first one had its moments). Still, I was curious to see what this third entry was like, mainly because the user comments at this web site were so negative about it. Sadly, the other user commenters are correct; this is simply not a good movie at all. I could go on for some time listing what is wrong with this movie, such as the sub-par CGI effects, the absurd abilities of the Creeper, and some really incompetently directed moments. But the biggest problem I had with the movie was that it had a really inconsistent tone and feel. First, the screenplay feels like it was assembled from pieces from two (or more) different screenplays. The story goes way over the map, with lots of padding as well as half-baked plot threads and character arcs. Likewise, the movie also feels like it was directed by two (or more) people. There isn't a consistent feel to the movie, and as a result it's hard to get involved with what you are seeing because you don't quite know how you should feel. The only real positive thing to say about the end results is that the photography is pretty good for what had to be a limited budget. But that's not anywhere enough for me to want to see a \"Jeepers Creepers 4\"."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "miroslavmilosevic-22770",
        "review_rating": "2",
        "review_title": "Horrible movie",
        "review_detailed_main": "Absolutely a disrespectful movie to fans or to any one really.\n\nHuge disappointment."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "no-other_than_themunz",
        "review_rating": "10",
        "review_title": "Disappointing but still a good film",
        "review_detailed_main": "Much like some, I was disappointed when watching this film as I was expecting a continuation from Jeepers Creepers 2 with Ray Wise at least returning in part. I enjoyed Jeepers Creepers 2 more than the first as it had a bit more action, humor and gave the Creeper more character. After watching the new JC: Reborn last night in cinemas and rewatching JC3 right now, it does not deserve a low rating that it has received. This film does deliver; good story, acting and ties together 1&2 well whilst setting up the next film quite well. It is sad to say that we may never see a worthy conclusion due to controversy surrounding Victor Salva. By no means should this controversy surround such a great franchise."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "JoelChamp85",
        "review_rating": "6",
        "review_title": "If Only It Got The Investment It Deserved",
        "review_detailed_main": "The film is tarnished with the lack of budget - half the original film's budget - so instead of sexy filmstock cinematography and well incorporated FX, we get digital cameras and somewhat cheap looking CGI. Which is a shame because I do like the film but there are some FX shots I could have done on my home computer. Nether the less I accept the film as part of the Jeepers Creepers saga and enjoy the mythology of the beast. I'd recommend watching the trilogy in the order of 1,3,2."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "janders-10406",
        "review_rating": "4",
        "review_title": "wow, plot holes",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "anthonycannella550-767-293061",
        "review_rating": "1",
        "review_title": "Beyond Awful",
        "review_detailed_main": "I waited 14 years for this? Complete garbage.Shot mostly during daylight hours with some of the worst CGI I've ever seen. CGI is on par with most movies shown on SYFY.This dumpster fire will air on SYFY on November 18th and that's exactly where it belongs,with the other garbage.The creeper deserved better than this!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "tantamusca",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "That was one of the worst horror movies that i have seen so far , the story was awful and the computer effects were disaster they were made by very nonprofessional team The cast were bunch of non actors trying to be actors. It was a very low budget movie , and was a bad mistake to continue with the sequence They should have stopped the production at the second movie"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mpjmeyer",
        "review_rating": "1",
        "review_title": "Couldn't watch 30 mins of this movie",
        "review_detailed_main": "My wife and I had a horror movie night which insisted of Jig Saw, IT and Jeepers Creepers 3. After Jig Saw, we decided to proceed to jeepers Creepers 3. This was by far the worst purchase I have ever made at the Redbox!! We couldn't last 30 mins watching this garbage. We loved the first 2 but this third installment is pure trash. I think my blu ray player actually spit it out before I could hit the eject button. If you're debating on watching this movie, debat no further because I can assure you your time will be more well spent watching paint dry."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "aramt-07935",
        "review_rating": "4",
        "review_title": "Was expecting so much more...",
        "review_detailed_main": "One of my favorite horrors of all times...and no I don't mean this one, I mean the first part... second one was o'k...but third is just nothing...barely watchable..."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "naraeol",
        "review_rating": "1",
        "review_title": "worst of the three",
        "review_detailed_main": "What an absolute disappointment! I loved the Jeepers Creepers and was really looking forward to this. It was boring, every single character was unlikeable and pointless, there was no suspense, nothing. I don't even know what to say, this was absolutely TERRIBLE.\n\nDon't even think about spending money to see this trash and re-watch the first (and maybe the second)."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "scott_dunning",
        "review_rating": "1",
        "review_title": "The sad comical demise of the Creeper franchise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "diescobarmdq",
        "review_rating": "2",
        "review_title": "What the hell happened here?",
        "review_detailed_main": "The first two movies were great mainly because their stories were simple and original (1st had Trish and Darry being chased by the creeper and 2nd the teens trapped in the bus being attacked by the creeper), but in this one there is just too much going on and everyting seems to be the focus. And it's not nearly as interesting as the previous two movies. A waste of time."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "shox341",
        "review_rating": "10",
        "review_title": "What's wrong with people?!!",
        "review_detailed_main": "T H I S is the real horror movie.It's not some modern shit with lots of effects like movies novadays.I'm fan of Victor Salva's work,my favourite is Clownhouse.People today watch horrors with same stories over and over.Like ooohh the curtain is moving oooh the sound of the doors opening is scary ooohh.I mean really? 10/10"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "richard1321",
        "review_rating": "6",
        "review_title": "Not that bad-",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Dodge-Zombie",
        "review_rating": "2",
        "review_title": "Head shaking.",
        "review_detailed_main": "Everything that was good about the previous movies has been taken away. All the characters are basically written as idiots. Suddenly the movie is about a truck not the actual creeper. Even when the creeper does appear it's pathetic in comparison to the previous movies.\n\nThe effects are terrible. The acting is shocking. The story is weak.\n\nJust NO."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "d_penn",
        "review_rating": "2",
        "review_title": "Only reason I watched was to complete the JC universe",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mattfrancis-03963",
        "review_rating": "3",
        "review_title": "Harsh reviews but fair..",
        "review_detailed_main": "Bitter responses were written as predicted after this substandard and weaker instalment of the franchise. Now, for the rest of us who are loyal to the original which was sensational and some of the second film, this one is a letdown. However haters want to describe it unfortunately for you the fourth which got pushed back is on its way this year after the lockdown and so the movies can't be as bad as the uninterested would imply.\n\nThe third in question was shot in broad day light mostly, which was intended to be more realistic and eerie with more memorable horror moments. Of course this didn't happen. This time the local characters battle Creepers by eventually forming a last minute plot to kill it, the problem isn't just that the characters impetuousness does not happen as fast or effective as it should or the needless dialogue, the problem is mainly they lost the intensity, the hairs on neck raising fear factor the original had and therefore instead what we got was more like a low budget college made film with dodgy acting.\n\nHopefully the fourth will be better suited to what the usual horror marathon quick to judge keyboard warriors will approve of. These people didn't like the first two not just this one. Actually the fact of the matter is we needed a better film for the time gone without one as the concept and fear factor didn't come off this time but the movie isn't quite as bad as people would describe and for anyone falsely stating none of the three films made you jump out your skin at some point it's clearly just a lie or you didn't watch it properly.\n\nThree out of ten. So It's still fairly bad though let's face it just not to the one out of ten people scored it as. Still, the fourth will be better after the former characters come and get me plea. Right..."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "snakesguitar",
        "review_rating": "1",
        "review_title": "15 years for garbage",
        "review_detailed_main": "I don't even know what to say really. I waited the 15 years for this like everybody else and it was garbage.\n\nThe whole movie was just people giving each other weird awkward looks. The scenes dragged on for far too long which was really annoying.\n\nNot much creeper time, action or killing and when there was it was incredibly lame. Like the creeper having magic abilities that just automatically make weapons show up in his hands.\n\nThe beatngu truck, also had stupid magical abilities.\n\nThe creeper no longer had his personalty nor did any other characters.\n\nWhat really pisses me off is that they dug up his hand and it apparently has magical abilities that lets who ever touched it, know it's secrets and what is and crap. So a bunch of people touch it and all they find out is that it gets to eat every 23 years.\n\nWE ALREADY KNEW THAT !!! From the first film even !\n\nSo we find out nothing about it. The film literally had no ending at all.\n\nActing sucks, no story or plot. Characters sucked. Special effects sucked. Everything sucked.\n\nBy the 3rd quarter of the film I didn't know if I was supposed to be laughing, like is it a drama/comedy ?\n\nAlso all the bad words and who knows what else is edited out. Pretty much no night scenes. All broad daylight.\n\nAnd what is with the vampire skull hanging in the beatngu truck ? Why was that never explained ?\n\n15 years for a stupid syfy TV movie. This is just sad."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ashfordofficial",
        "review_rating": "4",
        "review_title": "Disappointing",
        "review_detailed_main": "Jeepers Creepers 3 - Syfy Television Premiere Version\n\nWeird choice to set this movie taking place in between Jeepers Creepers and Jeepers Creepers 2. First of all this film looks like it's set in the 2010s unlike the first and even the second film that supposed to be came AFTER this film, secondly it's ended on a confusing cliffhanger set for a sequel that got abandoned after Victor Salva's controversy. Except some fantastic cinematography and creative direction, the rest of the film didn't hold up like the previous two entries. The VFX was horrendous and the low budget was a hindrance. Nonetheless the movie was entertaining but the third act was flawed and confusing."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mitzigolf2004",
        "review_rating": "5",
        "review_title": "Jeepers!!!!!",
        "review_detailed_main": "Reading all these reviews one would think this movie was awful. What were people expecting?!?! I know I got exactly what I expected...an entertaining continuation of a series that I love. I was not frightened and some parts were laughable but I was not bored either. The first 2 movies were not Oscar winners so i don't know why anyone expected so much from this one. I thought the actors did great with what they had to work with. It did leave a lot of questions unanswered but I think I will be able to go on with my life."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Weirdo-Magnet",
        "review_rating": "2",
        "review_title": "So Annoyed",
        "review_detailed_main": "I love the first 2 movies. I thought they were done so well and the creature is so original. This movie absolutely ruined it for me. I cant believe I waited this long for a movie that should have gone straight to DVD. Considering this movie was made only 3 years ago (2017), it is so poor and just.... cheap. I have read that they are making a forth movie. I really hope they do a good job and don't make it for the sake of it. (I promise I didn't mean for that to rhyme) After watching this one I have very low expectations. An amazing franchise - DESTROYED by a third movie. It will be VERY hard to come back from this. I doubt many people will look forward to a forth instalment. So disappointed. 2/10"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "mrcowdenbeathfc",
        "review_rating": "1",
        "review_title": "Serious ?",
        "review_detailed_main": "Nothing to add apart from this . You should be ashamed to have actually released this to normal people with a brain . Astonishingly bad"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "nseries-surid",
        "review_rating": "10",
        "review_title": "Best Vintage country Horror film available in Hollywood",
        "review_detailed_main": "Now, those people who are complaining about the CGI, none of you have real taste in horror films. Jeepers creepers story line is 10 out of 10. Yeah I know it's 2017, you guys are so into CGI things, man now look at The underworld movie series, Resident evil series... They have good CGI and they are crap. Everything about this movie has an old school taste, and I bet this Was not shot in recent years. This is a fine excellent movie stop complaining about CGI."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "cartola10-532-262590",
        "review_rating": "",
        "review_title": "So so",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Sober-Friend",
        "review_rating": "6",
        "review_title": "Worth Seeing",
        "review_detailed_main": "This film is entertaining. The Creeper is back and he is just as mean as ever. Lots of jump scares and a plot that is plausible and ties in nicely into the previous films.\n\nThe film opens with a shuriken flying through the air and hitting a wooden post as a man runs for his life. When the man reaches the road, the Creeper drops from the sky and flies off with him\n\nAnd that's for starters."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "evileyes_gt",
        "review_rating": "1",
        "review_title": "Uttered disappointment",
        "review_detailed_main": "If you are a fan of the previous Jeeper Creeper movies, do your self a favor and stay away from this film. As someone who would rate the first 2 films as 9/10, this film just suck to be frank, it was so bad I couldn't even finish it.\n\nIt fails on all ends, poor acting, horrible plot and outrageous Choreography, it was an utter disappointment to what was an amazing story. This marks the official death or the franchise, or the start to a line of poor low budget films."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "akshatmahajan",
        "review_rating": "2",
        "review_title": "Nonsense",
        "review_detailed_main": "I didn't like the original and the second installment but atleast they were a decent watch but this third installment was just unconnected scenes with some yelling and some unnecessary subplots.\n\nThe story was just bad and boring, the screenplay was also bad, the direction was average and the performances couldn't be more worst. The suspense, thrill and horror elements were totally missing from the movie and Creeper was also missing from most of the movie. It's truck had more screentime.\n\nOverall, it was a bad and unnecessary installment which missed everything which made this franchise famous."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "MB-reviewer185",
        "review_rating": "3",
        "review_title": "Fear the creeper",
        "review_detailed_main": "The first movie Jeepers Creepers (2001) was a good horror film that I thought was fun and creepy, and Jeepers Creepers 2 (2003) was not better than the first movie, but it was entertaining, fun, and creepy to watch. Now, having seen Jeepers Creepers 3 (2017) I thought this movie was bad but in an entertainingly bad way.\n\nThe Creeper in this movie is still scary and still played well by Jonathan Breck. The problem is that the Creeper is too over exposed in broad daylight most of the movie, which makes it look funny and less threatening when he is attacking people.\n\nThe acting in the movie is not good, and the characters make dumb choices that I was getting me annoyed most of the time. The characters do not have good dialogue and I was just waiting for the Creeper to kill them in entertaining ways that was stupid but worth looking at.\n\nThere are slow moments and random moments that would happen. There are uses of CGI that I noticed that looked fake and less practical, it is also laughable to look at especially on how obvious the CGI looks bad looking and obvious in how they use it along with weird editing.\n\nJeepers Creepers 3 (2017) was not as good as the first two Jeepers Creepers movies, but if you want an entertainingly bad horror movie with over-the-top moments then this movie will give you what you are looking for."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "sforrester-3",
        "review_rating": "1",
        "review_title": "Oh my god",
        "review_detailed_main": "First of all I am going to put my hands up and admit I never made it to the end of this film and I would normally never write a review unless I had watched the whole thing. I am making an exception because I know many people, myself included, have great fondness for the Jeepers Creepers films and must be warned. This is awful and I mean really awful. The first film was quite scary, the second less so but quite fun but this is a giant turd. The acting was questionable at best, the creeper was laughable and the plot was pretty much non existent. It kind of felt like the cast and crew were just turning up at different places and making it up as they went along. It had the production value of the video I took of my kids school show. If you like the previous films as much as I do then please don't watch this, it will spoil your fond memories. I really wish I had read the reviews first."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "sameerputhran",
        "review_rating": "1",
        "review_title": "Worst of the Installments by far!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "bombersflyup",
        "review_rating": "3",
        "review_title": "A disappointing addition to the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "clintstevens",
        "review_rating": "1",
        "review_title": "Jeepers Crappers",
        "review_detailed_main": "Evidently, the writer, producer, director wanted to wring every last cent out of this character. It is just an awful movie. I won't bother to point out the ridiculous plot or the unexplainable scenes. The one plot line I kept wondering about...why, since the Creeper knows all and does all, does he not know there are victims in his truck that are only pretending to be dead? The scariest thing about Jeepers Creepers 3 was how awful Meg Foster looked. Hopefully it was done with makeup!"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "griffinbequer",
        "review_rating": "1",
        "review_title": "Please don't support the convicted child molester directer",
        "review_detailed_main": "The original Jeepers Creepers was one of my all time favorite fun horror movies. I'd been waiting for this third movie to come out just like all the other fans. Last year I learned of the director's- Victor Salva- conviction of child molestation. It's not up for debate, he filmed himself molesting his then young actor in one of his films. He served 15 months in prison. FIFTEEN MONTHS. The system failed this young boy- but we can still hit this monster where it really hurts- his pocket. I refuse to watch this movie and it doesn't look like I'm missing much anyway. As much as I love the first one, I'll never ever watch it again. This little tidbit is also on his IMDb trivia page...can't make this stuff up."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "CRISTOBALDEMIAN",
        "review_rating": "10",
        "review_title": "Worth the wait.",
        "review_detailed_main": "As a fan of Jeepers Creepers, I enjoyed it a lot.\n\nBrought with it the impredictability I was accustomed with these series of movies, the thrill and also the familiarity of the Creeper.\n\nThe third installment takes place between Jeepers Creepers 1 and 2 and it delivers. I watched the other two many years ago and I would place this thrid movie at the same caliber. I read some reviews of people being disappointed with the story, well I am not. I just watched it with no expectations and I found it scary which is the real test for a horror.\n\nCan't wait for the 4th movie."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "ricemuscle",
        "review_rating": "6",
        "review_title": "Better than a 3.9",
        "review_detailed_main": "Don't get me wrong this is absolutely the weakest of one two or three. But the ratings on websites like this are just completely ridiculous. If someone doesn't like a film they just put one. I take ratings on things like this serious because can you talk about for example I feel like the Meg, I hated it. It was horrible compared to the novel. But I'm not going to get butt hurt over the fact that I didn't like it and give it a one because if that film is a one, what is a movie like sharknado? What is a movie like me straight to TV sci-fi movies? Is that a one also? It's just not comparable. If you gave this movie A one, what would you give the newest one? You can't go any lower than one but the newest one was way worse than this. Realistically this movie is probably like a six. Any movie that goes into the theaters is automatically at least a four my biggest issue with this and I think what really ruined this movie the most is the budget. If you give this movie a better budget and it had better graphics, I think this movie is much much better. The story is good the ending kind of sucks but it moves the story forward. Had they made a fourth film that actually had Trish Jenner come back, I think this would have been a good film to develop the story into that. There were definitely some potholes and bad graphics but it was very entertaining and there were some cool kills and we learned some new stuff. I would have changed the ending but aside from that and the bad graphic it was a quality sequel. If you watch the newest one, that was horrible movie. Unfortunately the fans of this franchise are getting punished by the doings of the director. The director's past made it so this movie didn't get a budget or get a full release. Dont get me wrong he is a monster and a horrible person but you can love the work of someone who is a horrible person. If Jeffrey Dahmer painted a beautiful picture, it doesn't take away from the fact that he's a monster but you're allowed to like the picture. I wish the director had just stepped aside and allowed someone to make a proper sequel with Trish Jenner any quality budget but like I said the only one really getting punished for the director's actions, is the fans of this franchise. But I think most people will agree after seeing the newest sequel that this movie wasn't that bad. And I will say one more time if you give this movie a few more million dollars to clean up the graphics and you change the ending a little bit you have a much better film. But even as it is it's much better than a 3.9."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "timeout2006",
        "review_rating": "2",
        "review_title": "Cheap and gimmicky",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "Gunnar_R_Ingibjargarson",
        "review_rating": "5",
        "review_title": "More of the same",
        "review_detailed_main": "Jeepers Creepers III, is kind a like of watching the first two films all over again, there is nothing new to offer, even though the third film is much more gory and bloody then the two first. So Jeepers Creepers is good fun, but if you seen I & II, don't expect much."
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "safeinsanity",
        "review_rating": "5",
        "review_title": "Jeepers Creepers 3 is not so good",
        "review_detailed_main": "Not too impressed with part 3 of the \"Jeepers Creepers\" movie series especially after making us wait 15 years for a 3rd sequel when we were ready for one way back then when it was still fresh in all of our minds. I felt a little lost at first also after not seeing the other films for so many years. It just somehow seemed more silly and less scary than the other two movies. Nothing good enough in it to even make me want to watch it again. The Creeper was far less mysterious than in the past films and was just sort of out there all the time killing everybody compared to the previous movies where he made fewer but far more memorable and scary appearances . Maybe it was because the low budget or just poor writing this time?"
    },
    {
        "movie_id": "tt1139592",
        "movie_name": "Jeepers Creepers III",
        "movie_rating": "3.9",
        "review_username": "alexhenderson-11711",
        "review_rating": "1",
        "review_title": "I feel bad for anyone who was hyped for this.",
        "review_detailed_main": ""
    }
]