[
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "howard.schumann",
        "review_rating": "9",
        "review_title": "Skewers the Nazi cause as effectively as Casablanca",
        "review_detailed_main": "In celebrating the 75th anniversary of the release of Casablanca, it is easy to overlook another anti-Nazi film, Ernst Lubitsch's \"screwball\" comedy To Be or Not To Be, a film that skewered the Nazi cause with equal effectiveness. While not as dramatic or filled with memorable lines and patriotic songs, To Be or Not To Be, like Casablanca, the film features two main Hollywood stars, Carole Lombard and Jack Benny and a love triangle in which romance must be subordinate to a greater cause. Set in Poland just before the German invasion of September 1, 1939, the film opens as a mustachioed man bearing a close resemblance to German Chancellor Adolf Hitler is seen walking alone in the streets of Warsaw.\n\nThis Hitler, however, turns out to be the actor Bronski (Tom Dugan), a bit-player impersonating the Fuhrer in a play being put on by a Polish theatrical group. Is Hitler \"by any chance interested in Mr. Maslowski's delicatessen?\" teases the narrator in the opening segment. \"That's impossible—he's a vegetarian!\" Responding to all the \"Heil Hitler\" salutes, Bronski asserts \"Heil myself\" as he walks through an open door. Bronski is playing a secondary role to the famous Polish actor Josef Tura, played by Jack Benny, then a radio star whose trademark straight face and deadpan humor marks the film.\n\nTura's wife Maria, also a popular Polish actress, is played by Carole Lombard who was to meet a shocking death in a plane crash in January, 1942 shortly after the film was completed. In the film, Maria is two-timing her actor husband by romancing a young flyer Lt. Sobinski (Robert Stack) who falls \"head over heels\" for the actress. The running gag in the film is that whenever Josef is playing Hamlet and delivers the line, \"to be or not to be,\" it is a signal for Sobinski to get up from his seat in the theater and go backstage to meet Maria in her dressing room. It appears that Tura is more upset about his speech being interrupted than what happens behind the curtain.\n\nThe sudden Nazi invasion, however, puts all romantic trysts on the back burner and the mood shifts to solemn. The plot now becomes more involved with espionage and patriotism than acting when Sobinski, now a pilot for the Royal Air Force, discovers that respected Polish professor Siletski (Stanley Ridges) is a double-agent working for the Nazis. When the Lieutenant returns to Warsaw to eliminate the traitorous professor, Maria and Josef team up to help by launching an elaborate charade to trick the unsuspecting Nazis. While the film takes its name from the famous line in Hamlet, Shylock's monologue from the Merchant of Venice, spoken in front of Nazi swastikas, is recited by Jewish actor Felix Bressart, \"Have we not eyes? Have we not hands, organs, senses, dimensions, attachments, passions?\" he asks the Nazis, \"If you poison us, do we not die?\"\n\nIt is a noteworthy plea for tolerance in the days of rabid anti-Semitism even though the line \"Hath not a Jew eyes?\" is not spoken. According to Thomas Doherty writing in Tablet magazine, \"the word \"Jew\" was seldom heard on the Hollywood screen, even in war-minded scenarios where the topic of anti-Semitism was front and center.\" He also quotes film historian Lester D. Friedman saying that \"The studio bosses were always—even at this point—afraid of thrusting Jews into the spotlight.\" Whatever the reason, To Be or Not to Be is marked with the genius of one man, the great Jewish director Ernst Lubitsch who said, \"What I have satirized in this picture are the Nazis and their ridiculous ideology,\" and that the tone and temper of the film \"cannot leave any doubt in the spectator's mind what my point of view and attitude are toward these acts of horror.\"\n\nWhile the film is a broad and biting satire, from the beginning of production in November 1941 to its completion on December 24th, however, events made sure that To Be or Not to Be, as well as Charles Chaplin's The Great Dictator, was no longer a laughing matter."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "alansabljakovic-39044",
        "review_rating": "8",
        "review_title": "Well made",
        "review_detailed_main": "Great comedy like Chaplin's Great Dictator, right in the middle of ww2 making fun of Hitler is amazing. Humor is so good on every level and I wish it was longer movie. Anyway, this is one entertaining and enjoyable movie if you aren't a Nazi."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ElMaruecan82",
        "review_rating": "8",
        "review_title": "Fiction can make fun of reality, that's the revenge of reason over barbarity...",
        "review_detailed_main": "\"To Be or Not To Be\" doesn't trivialize the barbarity of the Nazi regime as much as it ennobles art and gives an aura of metaphysical importance to laughter, as the main characteristic of the reasonable person. It's precisely because Ernst Lubitsch could laugh at the Nazism that one shouldn't underestimate the sadness and terror that devoured his soul. One could say the same about Chaplin's \"Great Dictator\", more focused on the inner heroism of the little people while Lubitsch' movie is a love letter to artists, and the work of a true one.\n\nLubitsch grew up in Berlin and became an acting sensation after World War I before becoming one of the most promising directors of Hollywood. A precocious talent with a sense of sophistication that would be known as the 'Lubitsch touch', he was probably under the influence of that boost of creativity and flamboyance that made Berlin an artistic Mecca in the early 30s (like in Bob Fosse's \"Cabaret\"). His film opens on Warsaw, a more suitable place for free art once Germany surrendered to swastikas. And as if he anticipated the criticism over his subject, the story features a play named \"The Gestapo\" and satirizing the Nazis. During a rehearsal, the man playing Hitler (Irish actor Tom Dugan) delivers a hilarious and unexpected \"Heil myself\". The line gets cut by the director who makes it a matter of ethics not to make Nazis funny, much to the actor's reluctance.\n\nBasically, Lubitsch asks us the question: should we sacrifice a good line for the sake of seeming decency? How many times haven't we felt the necessity to cross the barrier of good taste because it was so tempting. So the line is censored because of the risk of offending Hitler and when the Germans come on a day of September 1939, the play is cancelled once and for all. The situation resonates like Churchill's parable about war and dishonour, fearing the Nazis is the dishonourable attitude, even when meant to play safe, you're never safe with them, so let's just use your best weapon, guns or gags it doesn't matter. While I was wondering if Lubitsch would have been as loose on the Nazis if he knew about the Camps, I was hiding a chuckle because the line \"so they call me Concentration Camp Ehrhardt\" kept springing to my mind. Should I feel guilty?\n\nNo less than for any movie that dared to turn the subject into laughing matter, from Donald Duck's \"Der Fuerher's Face\" to \"La Vita e Bella\". It's because Nazis were human that their crimes were horrific, it's because they were human that they should be mocked. Art is the triumph of the intellect over the brutal force, the sensitivity over cynicism, it can be sophisticated and fancy but it can't really do without powerful sentiments, this is why the film makes a good use of Shakespeare's lines (borrowed from \"Hamlet\" and \"The Merchant of Venice\") and even more why it focuses on a married couple, the greatest actress of Poland Maria Tura (Carole Lombard) and her hammy husband Joseph (Jack Benny). The film opens with a sort of vaudevillian mood where Maria exploits her husband's \"Hamlet\" soliloquy to bring the handsome aviator Sobinski (Robert Starck) to her room, the running gag is not overused so Marie doesn't appear too cheap and Joseph too dumb.\n\nThere's a fine balance between the romance and the screwball situations and they all get along with the intricacies of a plot that involves a sinister but seductive spy named Professor Siletski (Stanley Ridges), who proposes Maria to become an agent. Meanwhile, the troop must absolutely capture the man, confiscate the documents that contain names of Polish Resistant members and get rid of the spy, and this is where their Nazi costumes get quite handy. So we see Jack benny and all his friends impersonating Nazi officers and even Selitski with variable effects, sometimes with the right timing, sometimes a delay force them to rewrite the script. In a sort of meta-referential nod to his own art, Lubitsch directs actors playing directors, actors and writers, proving that sometimes a good act can be a matter of life and death. Hammy too much and your cover is blown if not your head. Maria proves to be a more restrained actress so she can dodge the Nazis' flair, same can't be said about Joseph and Benny's antics endanger the film's credibility in their exaggerated audacity, the man pushes his luck so often it's a wonder how he did survive.\n\nThe film also suffers from a series of contrivances that happen all too conveniently near the end leading to a rushed climax only redeemed by the hilarious ending. Still, the real black spot in the film's legacy is of course the haunting of Carole Lombard's memory. The actress died in a plane crash a few weeks after the film's release, the USA had just entered the war and she was collecting bonds during a tour across America. In a way, she was a victim of that war though she lived far from the ruins and ashes of Poland, her death cut one of the most promising careers short and made Gable so inconsolable he joined the war too... I avoided that film for a long time because of that story, it had saddened me a lot even more because I happen to be afraid of flying.\n\nI couldn't believe how many times she referred to flights during the film, the simple fact that she loved an aviator gives it an eerie feeling, it's just as if the film was doomed to be clouded by tragedy, individual and universal. However, and that might be the secret of \"To Be or Not to Be\", It's all fiction, it's not reality, the film was criticized when the war was still raging and now it's a classic, once reality is as dead as fiction, what remains is the essence of art.as"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "TheLittleSongbird",
        "review_rating": "10",
        "review_title": "A question of taste",
        "review_detailed_main": "A number of interest points here. A brilliant premise. Material that was daring at the time, that one is amazed at what it got away with even if some of it may be an acquired taste. That it was the final film of the lovely Carole Lombard, who died far too young in a plane crash not long after with much more to give. And that it was directed by Ernst Lubitsch, a personal favourite of mine who had one of the most distinctive directing styles for any director often cited as \"the Lubtisch touch\".\n\nFound 'To Be or Not to Be' a truly fabulous film, have seen many very good to masterpiece films recently (as well as inevitably some duds) and this stands out among the very best of them. What could easily have been tasteless and offensive, with what it was satirising and considering the time, turned out to be one of the funniest comedies seen recently and ever actually and wartime comedies have seldom been funnier or more original. It also contains some of the best work of all involved. In front of and behind the camera, am aware that sounds very cliched but to me it's true.\n\n'To Be or Not to Be' looks great, immaculately yet atmospherically designed with a real sense of period and beautifully shot without being too glamorous. The music is neither too jaunty or low key, while Lubitsch's direction is one of 'To Be or Not to Be's' biggest stars in its sophisticated style that one can recognise from anywhere.\n\nRegarding the script, it is intricate and full of sharp wit and hilariously quotable lines that as mentioned above in my first paragraph when talking about the material being daring. The opening gag is hysterical and one that one does not expect, while the running joke concerning Robert Stack as Maria's (played by Lombard) admirer is an example of a running joke that doesn't get old prematurely and doesn't get repetitive, dangers with running jokes. 'To Be or Not to Be' is not just non-stop hilarity though, there is also surprising pathos that one doesn't always get in comedy and is genuinely poignant. Affectionate and inspiring are further things to describe and never had any problem with the pace.\n\nLubitsch's direction is one of two particularly wonderful things about 'To Be or Not to Be'. The other is the simply sublime cast, showing Jack Benny at his funniest and Lombard being an absolute joy in all senses (found her touching too but a lot of it was to do with it being her final film and what a talent she was). Stack is amusing and charming and Stanley Ridges and Sig Ruman are great fun.\n\nAltogether, fabulous. Even in films that fit in the \"loved it\" category, improvements can be pointed out in order to be balanced, but in the case of 'To Be or Not to Be' there is nothing to fault. 10/10"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "littlemartinarocena",
        "review_rating": "10",
        "review_title": "An Immortal Comedy",
        "review_detailed_main": "I'm not sure how many time I've seen it but it doesn't matter. Every time is like the first time. Carole Lombard in her last film before her untimely death is not just beautiful and impossibly funny but modern, profoundly modern. A performance that will still be relevant a hundred years from now. Jack Benny is perfect in what must be his very best film. Robert Stack, beautifully wooden, as usual, reports to duty with a delicious Lubitsch touch. As if all this wasn't enough, this film was made in 1942 and that in itself will give film lovers and historians a lot to tal;k about for centuries to come."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "gogoschka-1",
        "review_rating": "10",
        "review_title": "The Nazis have never been mocked better",
        "review_detailed_main": "Comedies rarely stand the test of time - this one does: one of the funniest films I have ever seen.\n\nWhen I was 16 (20 years ago, sigh...), this was re-released for a short time in a local art-house cinema, and my father insisted I go watching it with a friend. Well, teenagers don't normally line up to see 50 year old black and white comedies, but - man, was I glad I did!\n\nThis is a pitch black comedy that feels as fresh today as it must have then; in fact, this must have been kind of a shock in 1942. There are no cheesy clean characters or cringe-worthy lines: this is a firework of fast, witty dialogue with an edge and the sexiest, cleverest (and most morally ambiguous) female protagonist I have ever seen in a film before the \"New Hollywod\" era.\n\nEven the structure and the way the story evolves are very modern; there are flashbacks and twists and turns that might be very common in contemporary films but must have seemed almost \"avant-garde\" at the time.\n\nThe biggest fun, of course, is how Lubitsch takes the pi** out of Hitler's blind, fanatic followers. I don't believe the Nazis have ever been mocked better than in this comedy masterpiece (and I only hope old Adolf has seen it, too). Mel Brooks' remake is not bad, but the original is simply killer.\n\nSee it, and then see it again (and again).\n\nPriceless. 10 out of 10\n\nFavorite films: http://www.IMDb.com/list/mkjOKvqlSBs/\n\nLesser-known Masterpieces: http://www.imdb.com/list/ls070242495/\n\nFavorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/\n\nFavorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "FrenchEddieFelson",
        "review_rating": "",
        "review_title": "An indecent masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Balthazar-5",
        "review_rating": "10",
        "review_title": "One of the great romantic/satirical comedies of all time",
        "review_detailed_main": "There is a famous review of this film by the late Sunday Times critic, Dilys Powell which begins 'Is the joke funny?'... what Miss Powell was getting at was that, given the horror of the Holocaust, it is appropriate to laugh at the Nazis. The answer is, ultimately, irrelevant to the viewing of this modest masterpiece.\n\nLubitsch was, by this time, coming to the end of an exquisite career that defined the nature of sophistication in 'light' cinema. 'To Be or Not To Be' skips lightly over all of the minefield of a subject like this and it is difficult or impossible to think of any other filmmaker who might have managed it (if you look at Mel Brooks' limp remake, you can see why).\n\nIn 1996, I presented a massive season of 'the greatest' films in Belfast for the centenary of cinema - 250 titles in 9 months. Of all of them, this was the film which got the greatest ovation - about 5 minutes with a nearly full house standing and applauding! They may have applauded for many reasons, but here are certainly some of them...\n\nThe very complicated narrative is presented virtually flawlessly and the comedy is never allowed to hold up the narrative. The principle actors - Carole Lombard (breathtakingly beautiful) and Jack Benny in particular, but many of the supporting cast as well - throw themselves into the affair with a gusto that is completely infectious. Apart from the satirical aspect of the story and the way in which Hitler and the Nazis are mercilessly ridiculed for their authoritarianism and the fear which is their only motivator, the film pokes gentle fun at the vanity of actors in a warm and happy manner. Finally, and most important, is the notion of farce. Farce rarely works in the cinema, but here it does, and in the grand manner - just look at how many times the situation regarding Professor Siletsky changes profoundly during the film - it is dizzying - yet the characters manage to come up with (often self-defeating or inappropriate) schemes on every occasion.\n\nThis is a wonderful work that, I have no hesitation in saying, is absolutely vital for anyone who wants to really understand the glory of the cinema. But to answer Dilys Powell's question... yes, the joke is deliriously funny."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "IamWilliamBlake",
        "review_rating": "9",
        "review_title": "A controversial classic that was actually made in 1941",
        "review_detailed_main": "This movie was made before while the US was still playin' both ends against the middle. Makin' huge profits while staying \"neutral\" The film was not allowed to be released until after, the US entered the war.\n\nEasily the best of the screen versions. The cast is tight and the timing is impeccable. You can really tell that the cast believed in the film. Since America had not taken a formal stance at the time this went into production the producers, cast, and crew were really making something revolutionary and controversial. So much so that the making of this movie was not even mentioned on the Jack Benny radio program. Which is a major deal for those familiar with Old Time Radio, Jack's film career provided excellent material for comedy writers on the radio show, but also the radio show was an excellent opportunity to promote a movie. It is doubtful that this was a missed opportunity, what is more likely is that his sponsor or perhaps the network did not want to advocate a position.\n\nThis movie is wonderful for so many reasons. Not only is it hilarious, there is suspense, intrigue, and history. Another poster, mentions the Nazi's jumping out of the plane at the order of a radio transmission by Hitler. The thing to remember here is that the Nazi army was seen as an unstoppable war machine, so efficient, that soldiers would commit suicide if asked. This was less humor than it was to evoke fear of fascism.\n\nEveryone remembers Bob Hope and his travels during WWII, well Jack Benny and Carole Lombard were no slouches either. After all they made this movie. Carole died in a plane crash along with her mother and twenty others returning from a war bond rally before the film was released. Jack went where few if any cameras or radio transmitters could reach. He could be found in the most remote parts of the world entertaining the troops. Not to take anything from Bob, he went there as well, he just had more photo ops.\n\nBottom line watch this movie--twice, maybe more, the dialogue is so quick and witty there is a good chance you might miss it the first time, them again it is worth at least to looks."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "brankocerny",
        "review_rating": "9",
        "review_title": "Beats JoJo Rabbit by a mile",
        "review_detailed_main": "While in JoJo Rabbit both the absurd and the dramatic seemed to be achieved by excessive force and stylization, here they are subtler, exist much closer to each other, and on both ends resonate much much deeper. It's a hilarious film and a beautiful film about a very sad time; yet it's never pedantic and it's never obnoxious. Masterful."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "classicsoncall",
        "review_rating": "7",
        "review_title": "\"Wait a minute. I'll decide with whom my wife is gonna have dinner and who she's gonna kill!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Steffi_P",
        "review_rating": "10",
        "review_title": "\"In the hands of a ham\"",
        "review_detailed_main": "It has long been controversial to make a comedy out of war and tragedy, but often it is among the best ways of dealing with a difficult subject. Being able to satirize evil and imagine humour even in the most desperate of plights is a big part of coming to terms with these things. And when done in the right way, it can make some of the most compelling works that cinema has to offer. With To Be or Not to Be, director Ernst Lubitsch, who had spent most of his career making sophisticated and often innuendo-laden comedies with absolutely no political content, surprised everyone by tackling the most urgent of topical issues head-on, yet still maintaining the frivolous comedy style that was his forte.\n\nCo-written with Melchior Lengyel (who had provided Lubitsch with his earlier hit Ninotchka) To Be or Not to Be features a brilliant premise – that of actors turning their skills to do underground work. As such it takes a light-hearted yet affectionate view of stage acting (which is where Lubitsch started out). This was a rather timely subject in Hollywood at the time. In the early days of sound, a lot of theatre actors had been called in to do the talkie business, but now the trend was shifting towards subtler, more naturalistic performances, as especially encouraged by directors like William Wyler and George Stevens. And there's nothing wrong with that approach – Wyler and Stevens were making some excellent pictures – but as a result the good old ham actor was becoming a somewhat marginalised figure. To Be or Not to Be makes the theatrical scenery-chewers into the heroes. The debate between the different styles is itself the subject of many of the gags, for example Lionel Atwill continually having to be reminded not to overact. The young Polish airman who woos Lombard is named Stanislaw, perhaps after Stanislavski, the nemesis of ham actors.\n\nThe casting of To Be or Not to Be is like a celebration of the little hams. You won't find theatrical legends like Charles Laughton or John Barrymore here, but supporting players like Atwill, Felix Bressart and Tom Dugan are exactly the sort of people who were now a dying breed in the Hollywood movie. Here they can be seen at their unashamed best. The two leads on the other hand are not hams at all, but they were among the best comedy actors of the era. Jack Benny was ironically a master at underplaying scenes, often at his funniest when doing very little, such as drawing out the pause before beginning Hamlet's soliloquy. Carole Lombard was a consummate comedienne, often adopting a tone of complete sincerity that made little throwaway lines (like her enraptured \"It certainly does (interest me)\" when Robert Stack is talking about his bomber) sound comically ridiculous. But she could turn that sincerity to dramatic purpose as well, for example her very genuine look of trepidation when she is questioned trying to leave the hotel.\n\nAnd finally let us talk of Lubitsch himself. There isn't much to say about Lubitsch's direction here that I haven't said in one of my many other reviews of his pictures. One thing that is specifically worth mentioning now though is the attention Lubitsch gives to minor performers. Another feature of the more modern directors is that they gave very little screen time to bit players. The aforementioned Wyler would often get supporting players to do their scenes with their backs to the camera so as not to draw attention from the leads. Again this is not intended as a criticism – it is right for Wyler's dramas. But Lubitsch was one director who always found a little bit of camera time for even the most inconsequential of actors. There are obvious examples in To Be or Not to Be with the many members of the acting troupe, but notice how in the scene with the Polish aviators in Britain, he treats several of them to close-ups. These aren't \"face-in-the-crowd\" close-ups that you might see in a montage. Instead it's as if each of these men has become a lead character for a few seconds, even though they will soon disappear from the story. But Lubitsch did not do this indiscriminately. In the scene where Lombard passes on the photograph at the bookstore, there are two Nazis in the background. We don't catch a glimpse of their faces, we just have to know that they exist. It seems that when Lubitsch lingers on a character's face he does so out of affection. And that is really the attitude that permeates To Be or Not to Be – contempt for the villains, affection for the heroes, even through all the wit and satire. It is this ideal that really makes that fusing of the tragic and the comic work."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bandw",
        "review_rating": "6",
        "review_title": "A dissenting opinion",
        "review_detailed_main": "This movie about a company of Polish actors during the Nazi invasion of Poland in 1939 does have laughs (Hitler's \"Heil myself!\") and it is intricately and cleverly plotted and plays well as an intrigue. But I had a hard time with the mixing of comedy within the context of a real setting. One minute we are witnessing an air raid on Warsaw and the next we have Carol Lombard imagining what a triumph it would be to play the role of a concentration camp victim wearing an elegant dress. Maybe that was meant to illustrate the dominance of personal ego even in the face of tragedy, but the mood shifts were too much for me.\n\nThe Nazis are made to appear as easily duped buffoons. Mocking the insanely serious using comedy can work, but it has to be done with some idea of a payoff other than a few laughs. What is the point of making a high-ranking Nazi appear a fool? Is such misrepresentation meant to give comfort in having those viewers in 1942 think that the Nazis would be pushovers? Is being made to believe that Nazis are easily persuaded by simple ruses a worthy goal? I don't see it.\n\nI ask myself why this film and Benigni's \"Life is Beautiful\" seriously bothered me whereas I found Chaplin's \"The Great Dictator\" and Kubrick's \"Dr. Strangelove\" hilarious and trenchant. I think it is because the latter two are marked as satire from beginning to end, whereas the former two are stories set in a real time and place. While the targets of Chaplin's barbs in \"The Great Dictator\" are immediately obvious, the slight remove from reality makes all the difference."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bigverybadtom",
        "review_rating": "4",
        "review_title": "Starts Well But Fizzles Out",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "Witty and mocking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "david-1764",
        "review_rating": "10",
        "review_title": "A gem of a picture!",
        "review_detailed_main": "This comedy excels due to witty dialog and superior direction. Set against the backdrop of Hitler's invasion of Poland, due acknowledgment is made of the tragedy of that event. This was a wartime picture, after all. But the satire serves as a perfect antidote, and \"To Be or Not To Be\" is simultaneously funny and sharp. Right after I watched this movie, I wanted to watch it again--it was that entertaining. The stars and character actors were all superb. Having Jack Benny play the lead was an inspired casting choice. Felix Bressart and Tom Dugan as Greenberg and Bronski, sort of the Rosencranz and Gildenstern of this movie, are hilarious. If you have not yet seen this movie, rent or buy it and treat yourself to a real gem!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "theowinthrop",
        "review_rating": "10",
        "review_title": "Swan Song in Warsaw",
        "review_detailed_main": "In 1940 the American public was shocked when Charlie Chaplin released his first all talkie movie THE GREAT DICTATOR, in which he lampooned Adolf Hitler and Benito Mussolini. Despite the new European war, we were yet still at peace with both Axis states. Hollywood, with rare exceptions (BLOCKADE, CONFESSIONS OF A NAZI SPY, ESCAPE) had been gingerly tackling the Nazis and Fascists. Yet public reaction to THE GREAT DICTATOR was odd. It had a big box office success, and yet many were appalled because it chose to say Hitler could be laughed at. Chaplin's response was that if he had been laughed at to begin with he would never have become such a threat.\n\nActually other voices were beginning to stir in Hollywood. One was the great comedy director Ernst Lubitsch, who poked an occasional jab at the Nazis. Lubitsch had to wait until 1941 for a full assault on the Nazis - TO BE OR NOT TO BE, a film that looked at the German invasion of Poland, and it's occupation of Warsaw. It had an interesting cast. The lead went to Carole Lombard, who had many comedy performances under her belt. She played Maria Tura, the leading lady (and wife) of \"that great actor\" (as he always prefaces his remarks) Joseph Tura. Joseph is Jack Benny.\n\nOf all the leading men in her career, Lombard never played opposite one who was really more of a star in a different medium. Typical co-stars for Lombard were John Barrymore, Fred MacMurray, Cary Grant, Ralph Bellamy, William Powell, Robert Montgomery, Clark Gable, and Fredric March. Here it was Benny, who while he had a string of movie credits was basically a radio comedy star (and later would be a television star). His best films (GEORGE WASHINGTON SLEPT HERE, ARTISTS AND MODELS, CHARLIE'S AUNT) were not record breakers at the box office. In fact, while his performances were good in these, he did not necessarily shine in them (Laird Cregar, in one simple moment in CHARLIE'S AUNT, got the biggest laugh of the film). Nobody realized that his performance as Joseph Tura would be his best one, and that within two years he'd make his final starring fiasco in THE HORN BLOWS AT MIDNIGHT.\n\nBenny and Lombard proved to work well together as the egotistical, but oddly loving couple of theater hams. In fact the actors making up the Tura company are all good, including Lionel Atwill (who briefly is seen playing Claudius to Benny's Hamlet), Felix Bressart as Greenberg (who dreams of doing the Shylock speech from THE MERCHANT OF VENICE), Tom Dugan as Bronski (who hopes to play Hitler on the stage), Charles Halton as Dubosch (the stage manager, and the head of the Warsaw underground), and Maude Eburne as Lombard's cynical maid Anna. The screenplay did give plenty of time showing the difficulties and tensions of a stage company working together, and of handling temperamental stars and their egos.\n\nWhile putting on a play lampooning the Nazis (whom Benny and the others dislike), the government of Poland (Frank Reicher) says that due to the growing problems with Germany the play can't be produced. So the troop put on Tura's production of HAMLET. Benny as the Prince of Denmark (giving the great soliloquy) goes through the proper steps, although knowing the comedian from Radio one expects him to start it with \"WELL!\". But he finds that a man in uniform (young Robert Stack) leaves his seat in the middle of the third aisles just as he begins, \"To be or not to be....\" He does not know (until later in the film) that Stack had arranged to do this to keep a rendezvous with Lombard in her dressing room. Subsequently he treats her to a plane flight (he is a Polish Air Force pilot). When war comes he and his fellows fight, but the survivors make it to England.\n\nThe grimmest section of the film is the occupation scenes. Like the comedy in THE GREAT DICTATOR, because we know what actually happened these scenes seem slightly unreal. But in 1941/42 they still get the fears and difficulties of the occupation across. Signs of stores and streets we saw hanging normally earlier are in ruins (including a delicatessen). The theater is boarded up. Had Lubitsch wished to do a tragic film he could easily have done so. But he allows the situation to blossom into a black comedy.\n\nStanley Ridges plays Professor Siletsky, a secret German Agent who has fooled the Allies into going back to Warsaw. He has the names of families of the pilots. Stack is sent back to Warsaw to stop him, and contacts Lombard who helps. Soon the entire theater group gets involved. But will their theatrical egos blow their anti-Nazi plans? That is the running theme of the concluding portion of the film.\n\nAlso along for the ride is Sig Ruman as Col. Ehrhardt, the Gestapo Chief who relishes the name \"Concentration Camp Ehrhardt\", but who keeps running afoul of Professor Siletsky (it is the Professor, isn't it?), when he makes seemingly harmless comments about Hitler. His reaction is usually to yell for his adjutant, Schultz (Henry Victor), whose whole purpose is apparently to be there to be yelled at.\n\nThe film was a great success, but the death of Carole Lombard in a plane crash a month after it was shot cast a shadow over it. Yet it was a fitting swan song for that divine comedienne's career."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "AAdaSC",
        "review_rating": "8",
        "review_title": "Encore!",
        "review_detailed_main": "Husband and wife Carole Lombard (Maria) and Jack Benny (Joseph) are the leading lights in a Polish Theatre Company during the outbreak of World War 2. They are currently performing \"Hamlet\" and soldier Robert Stack (Sobinski), who is obsessed with Lombard and attends all her performances, is there in the audience on every occasion. Lombard and Stack arrange meetings with a pre-determined code. When Benny gives his \"To be or Not to Be\" soliloquy, that is Stack's cue to get up and leave and go backstage, much to Benny's outrage at someone getting up and leaving during his finest moment! When traitor Stanley Ridges (Professor Siletsky) passes through Poland on his way to deliver a list of names of Polish Resistance members to Hitler, the actors jump into action to prevent him reaching Germany with the list. Can they get away with their daring charades?\n\nThis film is funnier than I expected and had me laughing out loud on a few occasions. Jack Benny is excellent in the lead role and the whole cast are on form. There are loads of humorous scenes and the film has a great ending to round things off. It's a shame that they cut Carole Lombard's line about what could possibly happen in a plane from the film. This would have given extra poignancy to the film given that she died in a plane crash after making this film. I think the line should have remained in there.\n\nBasically, a gang of actors come good and defeat the Nazis through various deceptions. It's lightweight entertainment that really does entertain."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "gbill-74877",
        "review_rating": "8",
        "review_title": "Ah, Lubitsch",
        "review_detailed_main": "Only Ernst Lubitsch could have balanced all of the aspects of this film and had it come out right. He satirizes the Nazis without diminishing the evil they represented, delivers a comedy amidst the light drama of a resistance movement, and adds a little element of romance besides. The timing for the film was extraordinary; while it was being shot America had not yet entered the war, and before it was released, Carole Lombard had tragically died at age 33. The film opens a troupe of Polish actors rehearsing a play satirizing the Nazis in August, 1939, a month before the invasion, and it was highly topical at the time.\n\nLombard is simply radiant in her last film, and finds the right restraint and touch between comedy and cooing out double entendres. Jack Benny is funny in the role of her husband, a ham actor whose wife begins talking to an ardent admirer in her dressing room when he begins Hamlet's soliloquy. The other man (Robert Stack) is a Polish airman who soon sweeps them up into an effort to stop a spy within the resistance's ranks.\n\nAs always Lubitsch treats his viewers with such respect, letting us connect the dots without hitting us over the head with explanations or plodding along linearly. His humor is so clever, and varies between an actor raising an eyebrow which the audience will know the meaning of, and things like the repeated line \"So they call me Concentration Camp Ehrhardt?\". He also gets in a lot of jabs at the idiocy of the fascists, the most memorable being when two Nazis are told to jump out of a plan without parachutes and do so with a couple of Heil Hitler's and no questions asked. There are also moments that are quite touching, such as the Jewish member of the company quoting 'The Merchant of Venice' (\"If you prick us do we not bleed? If you tickle us do we not laugh? If you poison us do we not die?\").\n\nMy favorite lines were the sly repartee from Carole Lombard to elude the Production Code: Stanislav: You might not believe it, but I can drop three tons of dynamite in two minutes. Maria: Really? Stanislav: Does that interest you? Maria: It certainly does.\n\nSiletsky: Shall we drink to a blitzkrieg? Maria: I prefer a slow encirclement."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Lejink",
        "review_rating": "8",
        "review_title": "Benny good, man!",
        "review_detailed_main": "This is a quite brilliant Ernst Lubitsch film which manages to skilfully combine wartime dramatic pathos with wonderfully barbed humour, without doing so in an overtly propaganda-laden way. Set in Warsaw, just before and then during the initial German occupation which itself triggered World War 2, it starts in a relatively light-hearted manner as we're introduced to an acting troupe headed by husband and wife team Jack Benny and Carole Lombard, he the hammish, self-confident leading man, she the toy-boy-chasing leading lady. When the group's latest production, topically called \"Gestapo\" is closed down for fear of reprisals by the fearful authorities, they and their company join the local resistance. Amongst the rest of the cast are two spear-carrying extras who each dream of bigger parts, one who recites Shylock's \"If you prick me do I not bleed\" speech any chance he can, the other convinced he could pass for Hitler to the general public. When these foibles are adroitly woven into the plot at a climactic stage later in the film you appreciate how well written and crafted the movie is.\n\nI've never seen Jack Benny in any other feature and only know him for his deadpan humour on American TV much later than this but he's great here as the cuckolded husband pressed into action by the Polish resistance, struggling to balance his personal life with the National Good. His timing is spot-on and really you have to wonder why movies didn't also become his medium the way they did for say Bob Hope, but if this is his one major film role, then it's certainly a memorable one. Lombard I've sometimes not appreciated in some of her other roles but she's delightful here, coquettish, but clever with it.\n\nThe film shows the Polish resistance running rings round their German occupiers and also lampoons Hitler in bold fashion which surely wouldn't have been lost on wartime viewers. I loved the interwoven plotting as well as the frequent laugh-out-loud gags - right from the first humorous \"Heil Myself\" to the last \"To Be Or Not To Be\" running gag. There are only a couple of misfiring jokes like when Lombard complicity moans \"Heil Hitler\" when receiving a kiss from the Polish traitor or the too obvious \"Friends, Romans and countrymen\" line from Benny but there are far more hits than misses for sure.\n\nFor me this film could have worked as a drama without the comedy and as a comedy without the drama. That's how strong both elements are here and yet put them together as well as Lubitsch does here and you have something special.\n\nAbout that there is no question."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jotix100",
        "review_rating": "8",
        "review_title": "Playing Hamlet in Poland",
        "review_detailed_main": "Having seen most of Ernst Lubitsch American films, we had missed this one because it's not played often these days. \"To Be, or not to Be\" is a wonderful satire that only a director like Lubitsch, with his European background could have pulled. The film is a good comedy that seems to has kept some of its freshness intact.\n\nThe film works because of the great contribution of Jack Benny and Carole Lombard, who sadly, died before the film had its premiere. They play the Turas, a Polish theatrical couple that foresee the Nazi invasion of their country.\n\nIn fact, Jack Benny, a man associated as a comedian, first on radio, then on television, was an actor with an uncanny sense of timing. Mr. Benny was a natural for this type of comedy, as he proves in the film. His pairing with Carole Lombard was a stroke of genius. In fact, for being associated to lighter fare, he demonstrates with his take on Joseph Tura, he was an actor of stature.\n\nCarole Lombard is seen as Maria Tura, a grand dame of the Polish theater. Ms. Lombard gave a marvelous performance and her contribution to the success of this film is amazing. Robert Stack is seen as the pilot Sobinski. Other faces in the cast include Felix Bressard, Lionel Atwill, Sig Ruman, George Lynn, and others that are perfect under Ernst Lubitsch guidance.\n\nThis is a film to be treasured because of the work of Jack Benny and the impeccable direction of Ernst Lubitsch."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "grantss",
        "review_rating": "6",
        "review_title": "Lightly entertaining",
        "review_detailed_main": "German-occupied Warsaw, WW2. A band of actors, headed by husband-and-wife superstars of Polish theatre, set out to prevent a German spy from revealing key members of the Polish underground and families of Polish airmen fighting in Britain.\n\nLightly entertaining. Is a comedy-drama but doesn't entirely succeed in either area. More weighted to comedy, the comedy is largely farce, with the usual sequence of problem arises - much consternation and mad scramble for a solution - gets fixed by something that causes another problem - rinse and repeat. There are some good, even great, comedic moments but they are few and far between as the movie largely trades in cheapish gags.\n\nWhile predominantly a comedy, the movie had potential as a drama. There's the intrigue re the spy, the plight of the Poles in Warsaw, the general examination of war and its consequences. However, with the emphasis on comedy, these sub-plots and themes largely take a back seat. There's also a romantic angle, which just cheapens the drama.\n\nOverall, entertaining and not a bad way to spend 100 minutes, but not brilliant."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "krorie",
        "review_rating": "10",
        "review_title": "Jack Benny as Hamlet",
        "review_detailed_main": "This is one of the great movie farces of all time. I would rank it very close to my all time favorite \"Dr. Strangelove.\" There are several tiers of interpretation as is true of any noteworthy satire. It is not only poking fun at the stupidity and vanity of Nazism, but at aggressive war in general. Referring to Joseph Tura (Jack Benny) playing Hamlet on stage, Colonel Ehrhardt (Sig Ruman) states, \"What he did to Shakespeare we are doing to Poland.\" Only someone with the comic genius of Ernst Lubitsch could compare the Thespian rape of Shakespeare with the physical rape of a country and make it work.\n\nJack Benny, although one of the most popular entertainers of all time, never got his just deserts for his acting abilities. Though he utilizes many of his physical mannerisms that worked so well for his comedy routines on radio, in the movies, and later on TV, he also does some very fine acting in \"To Be Or Not To Be.\" He is teamed with the multi-talented Carole Lombard yet keeps up with her all the way. The two work well together. Had Carole Lombard not been tragically killed in a plane crash while serving her country just before the release of this film, she would possibly have been teamed with Benny again. The rest of the cast, including newcomer Robert Stack, keep up the pace and give all the support needed to make Lubitsch's film a winner, in particular the histrionics of Sig Ruman, the definitive Nazi stooge, later parodied in the popular TV series \"Hogan's Heroes.\"\n\nThe script which Lubitsch himself helped put together blossoms with hilarious one-liners such as \"So they call me Concentration Camp Ehrhardt?\" To read a few of the most famous ones, see IMDb quotes for the film. Better still, rent or buy a copy of this classic and watch it a few times to hear them for yourself. IMDb only lists some, not all, for that would take several pages.\n\nThe story sounds like one for a typical romantic or screwball type comedy. A troupe of Shakespearean actors in Warsaw, Poland, appear to be on the road to success due to the fame of the leading lady, Maria Tura (Carole Lombard). Her husband, Joseph (Benny), seems to be in her shadow, though he does his best as the Prince of Denmark, Hamlet. Yet each time he does the famous soliloquy that begins, \"To be or not to be,\" the same man gets up and walks out. This leads Joseph to think he is a failure as Hamlet until later in the film he learns that the young man, Lt. Stanislav Sobinski (Robert Stack), is leaving each time for a rendezvous with Joseph's wife, Maria. At this point Hitler invades Poland and the theater is closed as the Nazi's come to town. A Nazi professor, Prof. Alexander Siletsky (Stanley Ridges), flies in with a list of names of traitors (Polish patriots) who are to be taken care of by the local Gestapo headed by Col. Ehrhardt (Ruman). It is up to the Shakespearean troupe to keep these names out of the hands of the Gestapo and then to escape with their lives. So they use their acting talents to impersonate Gestapo officers and even Hitler himself. Joseph becomes Ehrhardt but botches it when the professor brings up the relationship between Maria and Lt. Sobinski who is now in Warsaw also. The rest of the film involves several funny mix-ups and mistaken identities filled with satirical buffoonery.\n\nThough this was somewhat controversial when first released because some, including Jack Benny's own father, misunderstood the satire, the film is possibly even more funny and relevant today than during World War II when the Nazi menace was for real. Because Lubitsch made the spoof universal in nature, \"To Be Or Not To Be\" transcends time and space."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "daustin",
        "review_rating": "6",
        "review_title": "Decent but disappointing",
        "review_detailed_main": "Sometimes classics live up to their reputations and sometimes they don't. This one didn't. It wasn't bad - some quite funny bits, likeable, never boring, but nothing outstanding, except perhaps in the subject matter. I've been watching a few Lubitsch movies recently and I ended up watching this one within a few days of watching Shop Around the Corner. I was struck by how much sharper and wittier \"Shop\" (which I felt was everything it was cracked up to be) was in comparison to To Be or Not To Be. Benny's character was a little too buffoonish, Lombard's character was a little too boring (though the first scene between Ehrhardt and the false Siletsky was excellent). Unfortunately, this film was just a little too over-the-top, silly, and conveniently plotted, without ever tapping into the fun of a real screwball comedy. Oh well..."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "vyto34",
        "review_rating": "3",
        "review_title": "So it was hot in 1942, but it's not 1942 anymore",
        "review_detailed_main": "Cheaply made, unconvincing story of assorted characters pretending to be somebody else in wartime Poland. Supposed to be a comedy, but very few chuckles. Weak script does not help. It was Carole Lombard's last film, but she appeared in much more entertaining vehicles. Plus, in this one, her good looks had rather faded."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Snow Leopard",
        "review_rating": "",
        "review_title": "Classic Satirical Comedy That Gets Even Better As It Goes Along",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "YorhaUnit2B",
        "review_rating": "10",
        "review_title": "A Completely Overlooked Gem of a Comedy Film",
        "review_detailed_main": "While I enjoy comedies, I was never one to \"burst out with laughter\" during any comedy film. That was, until I viewed 'To Be or Not to Be'.\n\nSimply put, this film does not hold back on its satirical humour of, not only Nazi Germans, but the theater/stage community and the extreme levels of passion many actors/actresses involve themselves in. Despite the heavy elements of satire, the humour never goes overboard into crude or absurd (compared to many satirical films of today). Every bit of humour, whether dialogue or action, is delivered perfectly and hits the right note. There are very few, if not none, \"dud\" moments.\n\nThe acting is, of course, excellent, with each actor/actress giving off performances that make it seem as if the role were tailor-made for them (which appears to be the case for Jack Benny).\n\nAfter viewing this film, it is surprising to see that it is often excluded from many \"Greatest Comedies of All-Time\" lists, and may be overlooked. If you enjoy characters pretending to be others, finding themselves in awkward/precarious situations, and their attempts to squeeze their way out, you will find this film hilarious. Either way, it is a must-watch.\n\n10/10"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "MoviesGivesLifeMeaning",
        "review_rating": "10",
        "review_title": "One of the best written movies.",
        "review_detailed_main": "Everything was so perfectly written in this movie that its hard to believe its a 1942 movie. Everything was so good about this movie, from screenplay, dialogue, jokes. It did not bore me for a second even when it is made in 1942 and almost all old movies bored me at some part of it but this movie did not. Must watch movie. Absolutely loved it."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "mutantdani",
        "review_rating": "9",
        "review_title": "Must see classic",
        "review_detailed_main": "Comedy and drama match perfectly in the classic masterpiece. One of the greatest of the history."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "hildarichards",
        "review_rating": "10",
        "review_title": "10/10",
        "review_detailed_main": "Joseph and Maria Tura operate and star in their own theater company in Warsaw. Maria has many admirers including a young lieutenant in the Polish air force, Stanislav Sobinski. When the Nazis invade Poland to start World War II, Sobinski and his colleagues flee to England while the Turas find themselves now having to operate under severe restrictions, including shelving a comical play they had written about Adolf Hitler. In England meanwhile, Sobinski and his friends give Professor Siletski - who is about to return to Poland - the names and addresses of their closest relatives so the professor can carry messages for them. When it's learned that Siletski is really a German spy, Sobinski parachutes into Poland and enlists the aid of the Turas and their fellow actors to get that list back. I love the 40s since when I Was In middle School."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "HotToastyRag",
        "review_rating": "10",
        "review_title": "An excellent dark comedy",
        "review_detailed_main": "To Be or Not to Be is one of those great classics that can make a fan of old movies from someone who would never normally want to watch one. My brother and sister-in-law are two examples; he'll only watch something in black-and-white if forced to, and she'll fall asleep in ten minutes during any movie that doesn't star Benedict Cumberbatch. Both of them loved this movie for the simple reason that it's fantastic.\n\nYou may have seen the Mel Brooks remake, but I prefer this version because it was made during the time that no one knew who was going to win the war and everyone was terrified. There's an added sense of fear and desperation in wartime movies that's absent from any other movie made after 1945. In this dark comedy, a Polish theater troupe get in over their heads after the Gestapo take over their country. Everyone in the film is frightened, and everyone who watched it at the time was frightened. And, adding a terribly tragic tone to the finished product, Carole Lombard died one month before the film's release. It's a very unique feeling to watch an actress risking her life for her country in a movie when that's exactly what she did in real life.\n\nCarole and her egotistical husband Jack Benny are the stars of a theater troupe, and when she has an affair with a young flyer, Robert Stack, their lives catapult from the stage to the warfront. Robert is involved in the Polish rebellion, and when a Nazi spy infiltrates his mission, Carole is enlisted to help save her people before the spy hands over a list of names to the Gestapo. The story itself is extremely dark and frightening, but Edwin Justus Mayer's screenplay is so clever and fast-paced, you'll find yourself laughing while you're tensely on the edge of your seat. I won't tell you what happens because it's so much fun to see it all play out, with surprises around every corner.\n\nCarole's comic timing is its usual best, and Ernst Lubitsch balances the line between comedy and drama in every scene. In the supporting cast are Sig Ruman as an incompetent Nazi Colonel who continually shifts the blame to others, Charles Halton as the theater's producer, Miles Mander, and Halliwell Hobbs. Felix Bressart is Jewish actor in the troupe, and since he was a German refugee to the United States, his lines carry an extra depth of emotion. He delivers Shylock's monologue from The Merchant of Venice three times, each time with a different meaning behind his delivery. This is an excellent film, so even if you're not usually drawn to movies made 80 years ago, give it a chance. I know you'll love it."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "brogmiller",
        "review_rating": "10",
        "review_title": "Acting up",
        "review_detailed_main": "As Ernst Lubitsch's preferred writer Samuel Raphaelson chose not to be available for this project on the grounds that it would face accusations of being in bad taste, the idea that had been shaped by Melchior Lengyel was fleshed out by Edwin Justus Mayer. Released a few months after the attack on Pearl Harbour, the film was deemed to be not only tasteless but also inappropriate. The tragic death of its much-loved leading lady further dampened audience enthusiasm whilst many found lines such as 'we do the concentrating and the Poles do the camping' just too much and probably still do.\n\nThe passage of time however has cemented its reputation as an undisputed classic and one of the most masterful depictions of Nazis as buffoons.\n\nAlthough Jack Benny's far from spectacular film career was effectively finished off by the embarassing 'The Horn blows at Midnight', he is perfectly cast here as a first-rate-second-rate actor and will later utilise his impeccable comic timing, trademark deadpan style and ever so slightly 'camp' demeanour to hilarious effect on the small screen. Luminous Carole Lombard's performance in 'Twentieth Century' made her the ideal choice for this and it is bittersweet to watch this stylish, enchanting artiste at the peak of her powers in what was fated to be her swansong. This also marks the finest filmic hour of Sig Ruman and Stanley Ridges.\n\nAmerica is not exactly renowned for its lasting political statements and it is fitting that here an immigrant director has used the powerful weapon of Satire to exact revenge. What he has done to the Nazis is what they were doing to Poland."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Horst_In_Translation",
        "review_rating": "6",
        "review_title": "Starts really great, stays solid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jamesrupert2014",
        "review_rating": "9",
        "review_title": "A great comedy about dark times",
        "review_detailed_main": "A troupe of Polish actors, led by vain Josef Tura (Jack Benny) and his gorgeous wife Maria (Carole Lombard, in her last role before her tragic death) manage to stay one step ahead the Gestapo in Nazi occupied Warsaw. The comedy is poignant, black, and very funny (the obsequious Col. Ehrhardt and his minion Schultz are clearly antecedents of Col. Klink and Sgt. Schultz in 'Hogan's Heroes'). The entire cast is excellent as is the script, which manages to sneak some loaded innuendos past the post-code censors, and the story is complex and clever (although a few conveniences and implausibilites need be forgiven). The film was made just before the Americans entered the war and several years before the true horrors of the Nazi regime became known outside of the occupied territories; nevertheless, making a comedy about the occupation of Poland must have taken some chutzpah (similar to Chaplin's lampooning of Der Fuhrer in 1940's 'The Great Dictator'). Although the word is never used, the actor Greenberg (Felix Bressart), who dreams of playing Shylock, is clearly a Polish Jew and from a post-1945 perspective, it's a bit chilling to hear him frequently quoting Shakespeare, saying \"If you poison us, do we not die\". Remade with Mel Brooks and Anne Bancroft in 1983."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "kyrat",
        "review_rating": "6",
        "review_title": "uncomfortable to watch/in questionable taste",
        "review_detailed_main": "I can certainly see why this movie was controversial and had a poor box office turnout when it came out. For the US to have just entered the war, and reconciling the unfolding events with a comedy making light of the situation is extremely questionable.\n\nEven now, with the distance of time, having not lived through the horrific events myself, I was still uncomfortable watching this film.\n\nNot that it doesn't have funny moments (\"Heil myself\"), or that you can't make a comedy using serious historical events. But there are just moments where you're a little disgusted at the sheer refusal to really take the situation seriously. For example, People shot are used in the film as jokes or props to a joke. The most eggregious example is when millions of people dying horrifically in the camps is reduced to a joke by a German officer, \"We do the concentrating, they do the camping\". That's just not funny, it's completely tasteless!!\n\nThe filim is worth watching, it is funny and has lots of snappy dialogue and plot twists - but I think it is important to think about the implications of making and releasing such a film in '42, much less at all."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bibikovromann",
        "review_rating": "3",
        "review_title": "Theatricality",
        "review_detailed_main": "An example of how a theatrical performance is being passed off as a film. Everything is simulated, stupid and not realistic."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ivan-22",
        "review_rating": "",
        "review_title": "Sublime",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Benjamin-M-Weilert",
        "review_rating": "9",
        "review_title": "An expert mixture of comedy and suspense.",
        "review_detailed_main": "I don't know about you, but I've found that World War II movies were released closer to the end of the war have a certain amount of emphasis that has seemed to fade with time. In fact, I'd almost wager that the comedies produced during the war are some of the most poignant films I've ever seen on the subject. Sure, making fun of Nazis is easy when you're not affected by them-but when the threat is still real, there's an amount of satire that can both entertain and thrill.\n\nMuch like Charlie Chaplin's The Great Dictator (1940) that came before it, To Be or Not To Be (1942) works off a bit of mistaken identity and farse to make the jokes that much funnier. The comedy in this film is expertly carried by a young Jack Benny-who manages to gnaw on every piece of scenery in every shot where he's allowed to work his comedic magic. What's more impressive in this movie is how the thrilling dramatic tension that acts as a counterpoint to the comedy is so expertly woven together to make the two sides of this narrative ebb and flow with nail-biting suspense and laugh-out-loud jokes.\n\nConsidering that the war was still going on in 1942, it's interesting how our hindsight colors our interpretation of To Be or Not To Be. If the Nazis had won the war, I don't think they'd have looked at this particular creative product with any lenience. The bold realities of those in Poland may have come as a surprise to the movie-goers in America who might not have been aware of what the Europeans were dealing with at the time. Sure, Jack Benny brings in the laughs, but the plot considers the plight of millions. Consequently, this isn't a perfect film, but it certainly comes close.\n\nAn expert mixture of comedy and suspense, I give To Be or Not To Be 4.5 stars out of 5."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bkoganbing",
        "review_rating": "8",
        "review_title": "That Is The Question, Lubitsch Or Brooks?",
        "review_detailed_main": "One of the very few people who would think to remake an Ernst Lubitsch picture would be Mel Brooks who satirized just about every genre there was in Hollywood. But I doubt that Jack Benny, Carole Lombard and Robert Stack would have lent themselves to the slapstick type film that Brooks turned To Be Or Not To Be into and Mel's version is very funny.\n\nWhen the film opens the biggest problem that Jack Benny has on his mind is who's this secret admirer who keeps sending flowers to his wife Carole Lombard every night while they're on stage. Although it's helped his Hamlet performance, the angst Benny is feeling about Lombard being faithful, pretty soon Benny, Lombard, Polish airman Robert Stack and the whole touring company that Benny heads are all caught up in the Nazi German invasion of Poland which inaugurates World War II.\n\nStack joins the Polish squadron of the RAF and there's a nice little Polish colony as with other occupied nations during World War II. One of them is Stanley Ridges who does propaganda broadcasts for the BBC. And he gets to be good pals with the airmen. But after he leaves for Germany on a 'secret' mission it's discovered in reality he's a German agent and is going back to Germany with a list of exiled Poles so that the Nazis could retaliate against families. Stack goes back to Poland after Ridges.\n\nWhere he meets up with Lombard and Benny and the rest their troupe and let's just say that their talents as actors are never more needed than in the series of performances they give the occupying Germans.\n\nWhether dealing with marital problems or Nazis breathing down their necks Lombard, Benny, and Stack have no shortage of wits about them. Carole and Jack are old hands at comedy, but Bob Stack showed a nice gift for it as well. Of course Ernst Lubitsch's type of comedy is a great deal more sophisticated than Mel Brooks. He also was making his film at a time when the USA wasn't in the war yet and the outcome for Poland and the rest of the world remained in doubt. Not to mention what was left of a liberal spirit in Germany where Lubitsch was an exile from.\n\nThis was Carole Lombard's farewell performance. Completed in 1941 To Be Or Not To Be was released just in time for Pearl Harbor and it certainly beats a lot of hastily made propaganda films that came out to tap into the national anger. It also got the same kind of knocks The Great Dictator did in satirizing the authoritarianism of the Nazis. But both films have stood the test of time. And it's not as preachy as The Great Dictator, but Lubitsch gets his point across. As for Lombard she went on a war bond tour which ended abruptly in a plane crash outside Las Vegas. FDR from the White House proclaimed she was as much a war casualty as any GI at the front and there were few who would disagree.\n\nIf your taste runs to an earthier form of comedy Mel Brooks will certainly satisfy you. But for those who value sophistication as embodied in that phrase the Lubitsch touch, this To Be Or Not To Be still pulls in the laughs."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "djayesse",
        "review_rating": "10",
        "review_title": "So, they call me \"Concentration Camp Ehrhardt\"?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "treagan-3",
        "review_rating": "9",
        "review_title": "Where Have You Gone, Jack Benny?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ma-cortes",
        "review_rating": "8",
        "review_title": "Splendid wartime comedy and referenced as an over-the-top classic movie",
        "review_detailed_main": "This black and white classic comedy well produced by Alexander Korda deals with the friendly marriage Joseph and Maria Tura (Jack Benny , Carole Lombard), they along with a troupe of scene actors spontaneously become involved with the Polish resistance. The valiant marriage uses their talents of theatrical interpretation to save Warsaw freedom fighters from the invading Nazis. Meanwhile , during the representation of the famous play 'Hamlet' by playwright William Shakespeare, a spectator, lieutenant Stanislaw (Robert Stack), gets up his seat and goes to dressing room of themain player .....\n\nUnforgettable characters , lots of laughs , one of the best films of the film history and the best of the great director Ernest Lubitsch, a real cinema classic. Sensational Jack Benny and sophisticated Carole Lombard who wears lush gowns , this is her last appearance , but shortly after she was deceased in a plane crash . Phenomenal secondary cast such as : Stanley Ridges as professor Siletsky and special mention for Sig Ruman as inefficient concentration camp's Colonel Ehrhardt. However, it was only nominated to musical score for the maestro composer Miklos Rozsa, though the movie deserved several Oscars, unfortunately , did not win Academy Awards . The motion picture was magnificently directed by Ernest Lubitsch incuding his usual 'Lubitsch touch'. At the time of the movie, for the 40s, this one failed and obtained lukewarm reception by public, being a flop at boxoffice, and had lousy reviewers. As Lubitsch was framed to deal slightly with a very serious issue, the 1939 Nazi invasion on Poland. Although in 1966, fortunately , the Congress of United States justly included it in the 'National Film Registry', considering as an American cultural treasure . Of course, in Germany and other countries in German influence was really prohibited, and in Spain retarded thirty years its premiere .\n\nThe film was remade as an inferior musical version (1983) by Alan Johnson starred by marriage in real life , Mel Brooks (role of Jack Benny) and Anne Bancroft (Carole Lombard's character and Charles Durning (Col.Ehrhardt)."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "krains",
        "review_rating": "10",
        "review_title": "I hope the real Nazis saw this one...",
        "review_detailed_main": "Of course they probably wouldn't have gotten it, or even Hogan's Heros.\n\nNever again will there be such a class combination of Benny, Lombard, Lubistch and seasoned, well-loved character actors rolling along in this vehicle perfectly suited to their foibles. Anyone with even a little high school drama production or a small love of the theater will eat this up. \"Get the pigs out before you drop in the ham!\" Sad that Miss Lombard died related to the war effort, I can almost picture Gable sitting with the window open in the rain as in Gone With The Wind.\n\nThis was Mel Brooks before Mel Brooks, Strangelove before Strangelove.\n\nDaring, yes it was. The only way to relate this to today's young people is if all the best-loved SNL comedians in just the right combination were to pull off such a feat, but I doubt they could - no wit compared to this cast nor the class -- too crass. So hat's off to the Golden Age of Hollywood, which never shone more brightly than in \"To Be or Not To Be\"."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "paulclaassen",
        "review_rating": "7",
        "review_title": "So funny!!",
        "review_detailed_main": "'To be or not to be' is a comedy about stage actors set during World War 2 (interestingly, the film was also released during the war).\n\nMaria Tura (Carole Lombard) is a famous stage actress. She has a secret admirer who sends her flowers every day. His name is Stanislav (Robert Stack) and he is a lieutenant who flies a bomber. Intrigued, Maria agrees for him to meet her in her dressing room when her husband Joseph Tura (Jack Benny) is on stage. The cue for him is the moment Joseph speaks the line \"To be or not to be\". Stanislav declares his love for Maria, hoping she will leave Joseph for him.\n\nWhen the news of war breaks, the show is cancelled, and shortly after Warsaw is bombed. Professor Siletsky, leader of the Polish Resistance, is on his way to Warsaw and must be stopped before he reaches the Gestapo. Now, the stage actors must perform the roles of their lives to fool the opposition, and stop Siletsky.\n\nThere are many hilarious moments, but the war elements are also treated with respect. The film's first moments were the funniest with hilarious dialogue. I loved Tom Dugan in the role of Bronski, who portrayed Hitler in the stage play. The satire to the 'Heil Hitler' salute was also hilarious. I thoroughly enjoyed this comedy drama!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "gazzo-2",
        "review_rating": "8",
        "review_title": "You've heard of that Great, Great actor....",
        "review_detailed_main": "Terrific movie! The opening gag with 'Hitler' walking out into the street is a scream. Tense, funny, satiric, suspenseful; with some of the better bombastic teutonic actors in the business at the time: Lionel Atwill, Sig Rumann, etc. Much fun! Love seeing 'Unsolved Mysteries' Man there at age 24 or so, as a leading man type. (Lord-Robert Stack's almost 10 years Younger than me in that film...) You also get to see how good Carole Lombard was, and it's sad she was dead before the movie was out.\n\nIf you have ever wondered about just how good an actor Jack Benny was, check this out. Unbelievable job. Great stuff!\n\n**** outta **** rating, one of the best. Do see it!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "movieman-200",
        "review_rating": "6",
        "review_title": "Outstanding War Time Comedy with Dark Humor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "rose_lily",
        "review_rating": "1",
        "review_title": "A film that never should have been made",
        "review_detailed_main": "Some topics lend themselves to satire; genocidal military dictatorships do not. This is perhaps one of the most offensive, ill-conceived movies ever produced in the name of public \"entertainment.\" To portray Nazis as idiotic buffoons and to script in dialogue and insert one- liners about the comedic aspects of concentration camps\u0085well that's got to just be a laugh a minute.\n\nAnd here Jack Benny portrays a pretentious Polish actor, Joseph Tura, which gives Benny full license to present us with his comedy persona in full form. Tura, who craves greatness as Shakespeare's Hamlet is prime Benny, the smug, mocking, self-satisfied comedic fool only satisfied when he can make everyone else look foolish. So guess what?! THAT makes him smart. Got it? Hilarious!\n\nThis film, Carole Lombard's last, is a sad coda to her sparkling career. Purportedly her husband Clark Gable urged her not to take the part of Maria Tura, but she liked the script?!\n\nThe esteemed director Fritz Lang, half-Jewish, (his Jewish mother had converted to Catholicism) and an émigré from Nazi Germany who fled that country just in time, should have known better.\n\nThis movie was a disaster when it was made at the height of World War II, and more than 70 years later is still, to put it mildly, an embarrassment. No matter what Leonard Maltin thinks."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Ron-181",
        "review_rating": "9",
        "review_title": "A CLASSIC",
        "review_detailed_main": "A delightful spoof of Adolph Hitler. Filmed early during World War II, the movie was probably several generations before its time. Great cast including Jack Benny, Carole Lomard, Robert Stack, Lionel Atwill and Tom Dugan among others. Jack Benny's facial expressions alone are worth watching this great film."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "atlasmb",
        "review_rating": "9",
        "review_title": "A Wonderful Film Featuring Benny And Lombard",
        "review_detailed_main": "This cinematic satire, directed by Ernst Lubitsch, contains some excellent acting--especially by its leads, Jack Benny and Carole Lombard. Its story is clever and funny. Lubitsch certainly earns, again, our respect for his directorial skills.\n\nBut regardless of the talents on display in \"To Be or Not To Be\", this is a film that should be seen for its place in history.\n\nJust two years before its release, Chaplin gave the world the wonderful film \"The Great Dictator\", a tour de force spoof of Hitler. And it was very successful. It found an appreciative audience in the early days of the world conflict.\n\n\"To Be or Not To Be\" did not receive the same warm welcome, mostly due its place in the chronology of its time:\n\nFirst: The film is shot\n\nThen: Pearl Harbor is attacked, bringing the United States into the war.\n\nThen: Carole Lombard dies in a plane crash while supporting the American war effort.\n\nThen: The film, edited and completed, is released.\n\nObviously the pall of Carole Lombard's death hung over the film. How difficult would it be to laugh at a film under those circumstances? Then consider the tremendous stresses of a country just entering a global conflict on multiple fronts--relatives going off to war, families trying to find a new balance, the challenges of a nationwide effort to reindustrialize, the profound shift in economics on a national scale, the fear of military enemies whose motives and methods seemed somewhat unfathomable.\n\nLooking back now, it is easier to enjoy this film, even though we have a much greater understanding of the horrible realities of Hitler's plans. Though our viewpoint is clouded with wistfulness, this film deserves to be celebrated, especially for the performances of Benny and Lombard, which are seminal in the careers of both artists."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "planktonrules",
        "review_rating": "9",
        "review_title": "Excellent propaganda comedy",
        "review_detailed_main": "During and just before WWII, there were a lot of propaganda films created by Hollywood to drum up morale in our fight against Fascism. Nearly all of them were deadly serious war films. And, while many of them were great, after a while they all tended to blend together. Because of this, TO BE OR NOT TO BE is a real standout picture. The movie is a comedy and yet is every bit as effective in inspiring the war effort. Now it's not surprising that the film is so well-made as its director is Ernst Lubitsch and he is ably supported by lots of wonderful character actors such as Felix Bressart and Sig Rumand (among others). However, the nice surprise about the movie was the acting of Jack Benny in the starring role (along with the wonderful Carole Lombard). For years, Benny made fun of his acting and the movies he made, but he was great and the film was great. Aside from the rather dopey HORN BLOWS AT MIDNIGHT, in fact, I really like the few films he made.\n\nAll-in-all, a fine and fun film--chock full of quality."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "wild_willy_m_d",
        "review_rating": "10",
        "review_title": "Think of it---Jack Benny doing Hamlet ! !",
        "review_detailed_main": "One of the great comedies of all time, by a master, Ernst Lubitsch. Practically a flawless film, damning to the Nazis, ennobling the Polish resistance.\n\nBenny is wonderful as \"that great, great actor, Josef Tura\", making use of his trademark pause and stare. This was the last role of Carole Lombard, tragically killed in a plane crash on the homeward leg of a war bond selling tour, and she is magnificent. Truly she was THE comedienne of the late 1930's and early 1940's.\n\nI also need to mention the work of (in my opinion) the greatest comic supporting actor ever--Sig Rumann. Unfortunately, few people remember him, except as a caricature. Forget John Banner as Sgt. Schultz. Look for Rumann in \"A Night at the Opera\", and \"Stalag 17\". This was a great man.\n\nAt all costs, avoid the Mel Brooks remake."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "EUyeshima",
        "review_rating": "10",
        "review_title": "Luminous Lombard and a Never-Better Benny Light Up Lubitsch's Classic Nazi Satire",
        "review_detailed_main": "There is a certain sense of melancholy I feel when I watch this 1942 classic Ernst Lubitsch movie, as it represents the last appearance of the luminous Carole Lombard, surely the most breathtaking and high-spirited of actresses during Hollywood's golden era. In a rush to get home to husband Clark Gable after a successful war bond tour, she died in a plane crash during the film's post-production, and as the result proves without a doubt, the world lost one of the great treasures of the silver screen. She and co-star Jack Benny play Maria and Joseph Tura, the egocentric stars of a Polish acting troupe who are caught in the 1939 Nazi invasion of Warsaw. As a world-class flirt, she is carrying on with a handsome young pilot named Stanislav Sobinski, and their trysts begin once he hears his cue to get up from his theater seat, Hamlet's famous opening line to his soliloquy as spoken by an increasingly perturbed Joseph.\n\nThe romantic triangle quickly takes a backseat to an espionage thriller involving a German spy named Professor Siletsky, who holds the names of members of the Polish underground. His intention is to kill them, but the acting troupe, now with their theater in ruins, band together to stop him. This includes the need for the extremely vainglorious Joseph to impersonate Siletsky in front of the befuddled Colonel Ehrhardt and for Maria to seduce any Nazi official who stands in their way. While it sounds like a piece of wartime propaganda, the film actually becomes more farcical even as people are getting killed.\n\nAs Joseph, Benny has never been better, conveying both self-absorption and cunning expertly, and the script by Edwin Justus Mayer and an uncredited Lubitsch gives him a number of great one-liners. With her honey-toned voice and smoky elegance, Lombard is at the top of her game as the seductive Maria, as she dexterously shows her comic and dramatic sides with precision and unparalleled style. Delivering her lines with subtle finesse, she provides a strong match for Benny. Sixty-four years later, and there is still no one who can touch her. The rest of the ensemble is memorable starting with Sig Ruman's hilarious turn as Ehrhardt. A fresh-faced Robert Stack, all of 22, plays Sobinski with a callow, zestful energy, while Felix Bressart excels as the ultimately heroic Greenberg.\n\nThe movie makes direct commentaries on the concentration camps, and the satirical aspects are blissfully unapologetic. The stylishness of the comedy in light of the virulent wartime setting is what makes the film memorable and it proves what a master Lubitsch was at this level of subtlety. The 2005 DVD comes with two extras both featuring Benny - an ancient twenty-minute comedy short from 1930 called \"The Rounder\" and a brief commercial for war bonds. I wish they could have included some tribute to Lombard as it would have been fitting on this disc."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "GoranSkalArmand",
        "review_rating": "10",
        "review_title": "The Best American Comedy of all time",
        "review_detailed_main": "I love classic comedies of Hollywood's Golden Age, but this is the best of all those masterpieces, and (along with \"Gone with the Wind\") my favourite American film of all time. The Lubitsch touch is justly celebrated and you can see why if you watch this movie full of wit. The lines are still hilarious, the score is still catchy and the performances are simply perfect. Jack Benny is outstanding as 'that great, great actor ...' Joseph Tura, while Lombard is enchanting in her last role. The supporting cast is equally impressive ... this is simply a perfect movie featuring a superb mix of war drama, romance, suspense and high comedy"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Linnell",
        "review_rating": "",
        "review_title": "Witty comedy at its best",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "AaronCapenBanner",
        "review_rating": "7",
        "review_title": "WWII Comedy.",
        "review_detailed_main": "Ernst Lubitsch directed this satirical WWII comedy that is set in Nazi occupied Poland, where an acting troupe led by Joseph Tura(played by Jack Benny) is performing Shakespeare. Tura's wife Maria(played by Carole Lombard) has an admirer in the audience who always sends her flowers, pilot Lt. Sobinski(played by Robert Stack), whose efforts to track down a double agent with valuable Allied information involves the actors, who are enlisted to impersonate Nazi officers to intercept him and thwart their plans, assuming they aren't discovered... Funny comedy has a fantastic opening(\"Heil Myself\"!) and premise. Good acting, directing, and script, even if this is fundamentally absurd! Tragically, this was Carole Lombard's last film, as she was killed in a plane crash before its premiere. Not a hit upon release, this has since gotten the recognition it deserves."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "PseudoFritz",
        "review_rating": "8",
        "review_title": "Fun Film! (But...)",
        "review_detailed_main": "While I enjoyed this movie a lot, there's one thing which REALLY bugs me. The IMDb editors wouldn't accept this as a \"Goof\", but I can't let it pass without comment...\n\nThe plot requires that Maria meet with Sobinski in her dressing room while Joseph is delivering the \"To be or not to be\" soliloquy from HAMLET, III:i. But since since Maria is playing Ophelia, THIS CANNOT BE. Ophelia is IN that scene, both immediately before and immediately after Hamlet delivers this 33-line speech. It's doubtful that she leaves the stage at all (there are no stage directions calling for an exit and re-entrance), and she would CERTAINLY be no further from the stage than the wings.\n\nOK, OK, I'm being anal. It's creative license, and like I said I DO really like the movie. But still, it seems like this ought to fall into the category of \"Factual Error\", even though it's a forgivable error."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Supachewy",
        "review_rating": "7",
        "review_title": "Nothing is Better Than Nazi Comedy",
        "review_detailed_main": "The comedy To Be or Not to Be is directed by Ernst Lubitsch and stars Carole Lombard and Jack Benny. The film takes place between 1939 and 1941 in Poland.\n\nThe film starts off with a man believed to be Adolf Hitler standing in the middle of the streets of 1939 Warsaw. It is then discovered that he is only in a play and proving a point to the director that he does look like Hitler when the director said that the man does not. Maria and Joseph Tura (Lombard and Benny) are both actors for a theatre. Maria has a secret admirer in the audience who always comes to see her when her husband reads the line \"to be or not to be\" and Joseph gets extremely offended by this. Then the war has started between Poland and Germany and the Turas have a part in helping their country...\n\nThe screenplay for this film is one of the strongest aspects of the film. It has many classic one liners and is one of the best satires of the time period. The plot stays interesting the whole way through and the characters are all likable even though most of them do not have any depth. One of my favorite parts of the film is any scene with the Nazi Colonel in it who always blames his Captain for the mistakes he made.\n\nLubitsch's direction for this film was mediocre. It was very straight forward direction, there was no risks in the shots he took, no complexity, just him deciding to put his camera right in front of the action. Lubitsch was able to get solid performances out of his whole cast, so that is a plus one for him as a director. I thought the film was lacking in the reaction shot close up department because that only makes a funny line funnier when I see the reaction another character has to it.\n\nAlong with the direction the editing was very plain and simple. There were a lot of fade to blacks which made it seem like it was a play and that a scene had just finished. The shots were all very long, there was never any editing for any stylistic use. Now I know what many of you readers are saying now, it's 1942 not the 90s where every movie has stylistic editing. Well I agree with you but it is nice to sometimes see some variation.\n\nThe acting for the film was another strong aspect. Lombard was excellent as Maria Tura. She acted like an actress and did so brilliantly and delivered her many witty lines just as brilliantly. Benny was fantastic as the great Polish actor Joseph Tura. Every line he said he delivered with such force that the comedy was great since he had the majority of the jokes. The rest of the supporting cast were all equally wonderful and had many memorable moments.\n\nThe score for this film was exactly what it needed to be to add another layer to the humor. Deservingly so it was nominated for an Oscar. With all the slapstick humor in this film a good score is needed or else nothing will really be that funny and this score delivers the laughs.\n\nOverall I give this film a 7/10. I would recommend this film to anyone who enjoys classic comedies, especially satires. This one is much different than the comedies from today, and that's a good thing."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "adamchenmo",
        "review_rating": "4",
        "review_title": "What the hell is this",
        "review_detailed_main": "Consider the plot and interesting, the screen writing is poor, and there's no suspense, it's not funny at all, how did it get a point to."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Guru-7",
        "review_rating": "10",
        "review_title": "The most witty movie ever made",
        "review_detailed_main": "This is probably one of the most smart movie ever made and the witty of them all. The satire, especialy regarding the absurdity of a pascist and tyrannic regime, is perfect. Together with Chaplin's 'The Great Dictator', that was made (more or less) at the same time, they are Hollywood's bright answers to what was going on in Europe at the same time. I can conclude that this shows that a funny movie and a good laugh never goes out of style."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "psh34",
        "review_rating": "10",
        "review_title": "A must for fans of comedy!",
        "review_detailed_main": "This is by far one of the wittiest movies ever made. Ernst Lubitch was a genius, Jack Benny was the king of comedic timing, and Carole Lombard had no peers!! Mel Brooks made a nice remake, but this original is a far superior movie!\n\nGo rent this movie!!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "JGatsby",
        "review_rating": "10",
        "review_title": "Lombard, Benny and Lubitsch?",
        "review_detailed_main": "All you really need to know about this film is that it stars Jack Benny and the sublime Carole Lombard and is directed by the great Ernst Lubitsch. It's just about perfect. I only wish Lombard and Lubitsch had worked together more often! It's a dream match! Lubitsch had a way with witty, sophisticated comedy that has never been equalled and this film displays it magnificently."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "susansweb",
        "review_rating": "10",
        "review_title": "Best comedy - ever!",
        "review_detailed_main": "Coming up with a list of the funniest movies ever, is pretty hard (there are so many to choose from) but this movie is head and shoulders above the rest (\"Blazing Saddles\" is the only movie that can come close). This movie has got it all. Ernst Lubitsch was of the few people that used the restrictive Hays code to his advantage with his extremely witty and suggestive dialogue. Jack Benny and Carole Lombard are great but I will always have to say my favorite person in the movie was Sig Ruman. How he got most of the great lines over Benny, is beyond me. Only Robert Stack got the short end. Most of the time he was the straight man and compared to the rest of the cast came off looking a little stiff but someone had to carry the plot along. I hate it when people say this but this movie is one that everyone should see."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "smatysia",
        "review_rating": "9",
        "review_title": "Delightfully droll",
        "review_detailed_main": "Not exactly hilarious, but more delightfully droll and witty. Carole Lombard was just amazing. Her beauty and charm were, I'm sure, mourned deeply when lost so early. Most of the humor here was lampooning the Nazis. As someone else mentioned, it's one thing to mock Hitler and his ideology in the 1980's, and quite another to do so in 1942, when the outcome of the war was in serious doubt. Grade: A+"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Josef Tura-2",
        "review_rating": "10",
        "review_title": "It has 'it'",
        "review_detailed_main": "I have seen this film probably over ten times and each time I see it I still think it is one the funniest movies in all of film. What makes me pull out my ratty tape and watch a half a century old film over and over? To tell you honestly I don't know. It works. It has that quality that has never found a good name, perhaps just... 'it'. If you've never seen it watch it and see if you can put your finger on that 'it'."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "searchanddestroy-1",
        "review_rating": "",
        "review_title": "Lubitsch or not Lubitsch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "zetes",
        "review_rating": "7",
        "review_title": "Good flick, but a little uneven; 7/10",
        "review_detailed_main": "To Be or Not to Be is an interesting WWII era film about actors in Poland who lead a resistance against the invading Nazis. It is mostly a comedy, but there is a dramatic side to the proceedings. The acting is good, especially Jack Benny. Most of the rest of the actors don't do anything particularly special, except for maybe Robert Stack.\n\nUnfortunately, as good as this film is, it has a difficult time reconciling its dramatic angle with its comedic angle. First of all, most WWII movies that were made in America during WWII are a little weak because the makers could only guess at what was really going on in Europe before the US entered the war. The best example of that is Charlie Chaplin's The Great Dictator. Chaplin himself said that he could have never made that film if he had known what was really going on. Ditto To Be or Not to Be. After having seen the atrocities which happened in Poland in a film like Schindler's List (although I believe the massacre I'm thinking of from that film happened in Krakow; I have not seen it for a long time) really ruins you for a film like this. However, even if it were not weakened by the actual history, the film still has problems reconciling. Robert Stack's role is never really resolved, for instance."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jacobs-greenwood",
        "review_rating": "8",
        "review_title": "Carole Lombard's last film was this hilarious satire, later remade by Mel Brooks",
        "review_detailed_main": "An hilarious satire produced and directed by Ernst Lubitsch from the story by Melchior Lengyel. Werner Heymann received his third of four unrewarded Oscar nominations for his Score; the film was added to the National Film Registry in 1996. #49 on AFI's 100 Funniest Movies list.\n\nJack Benny and Carole Lombard (her last film) star as the leaders of a Polish acting troupe that works to foil the Nazis during World War II in occupied Warsaw. The actors themselves are of the over-the-top variety, so part of the comedy is in the portrayal of the Nazis as buffoons who can be fooled by such \"hams\", intent on intercepting a spy's information that would damage Poland's resistance movement.\n\nRobert Stack plays a Polish officer who is not only part of a love triangle that includes Benny and wife Lombard, but is also the one given the mission to keep the German spy (Stanley Ridges) from delivering his list of resistance members names to the stereotypically brutish German Colonel (Sig Ruman).\n\nFor patriotic reasons, Benny helps Stack anyway, directing his group of actors (Felix Bressart, Lionel Atwill, Tom Dugan, George Lynn) to play various roles to foil their common foes. Charles Halton (as a theater producer), among others, also appears."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "SnoopyStyle",
        "review_rating": "7",
        "review_title": "Good wartime suspense thriller",
        "review_detailed_main": "It's 1939. Husband and wife, Joseph (Jack Benny) and Maria Tura (Carole Lombard), are theater stars. He's a self-obsessed diva and she has an admirer in bomber pilot Lieut. Stanislav Sobinski (Robert Stack). After the German invasion, Sobinski is in England. He meets Professor Siletsky who is going back to Poland. Everybody gives him family and friends names to send greetings to. Sobinski is suspicious when he doesn't know who Maria Tura is. Before Sobinski could tell the higher ups, he's gone back and Sobinski is sent after him.\n\nThis is a suspenseful thriller with some jokes thrown in. The remake is funnier and jokier. This one still has the funniest line \"Heil myself\". Mel Brooks makes walking out on \"To be or not to be\" much funnier than Jack Benny. Jack is less outrageous than Mel. This one is just more of a spy action movie being shown right in the middle of the war. It does struggle with the tone as it keeps going back to the big laughs with Jack Benny. It's a battle between the dark serious subject matter and Jack Benny trying to ham it up."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "fqsxbyt",
        "review_rating": "1",
        "review_title": "bloody awful mate",
        "review_detailed_main": "I felt i was watching paint dry.\n\nHuge waste of time"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "johannesdufva",
        "review_rating": "9",
        "review_title": "Simply the best and most well crafted comedy ever!",
        "review_detailed_main": "Here I sat, going through my long forgotten watchlist looking for something different. Something much needed to rinse my palette from the same flashy, forced material that Netflix, Disney+ and all the streams spit out most days. My lord was I in for something different.\n\nThe story excites from the very first second and delivers plots and twist without even once losing it in logic or magic. Even the not so frequent actors give the audience moments that make us feel much more than other movies can only dream to accomplish. We laugh, we cry and we feel the profoundness.\n\nWithout knowing on beforehand that it was directed by the great Ernst Lubitsch, let us say that it did not come as a chock afterwards. Simply another masterpiece!\n\nSpoil yourself with this movie and perhaps think about, if one was able to compose a movie like this during the Second World War with all its death and destruction, there is never a good reason to not stand up for what is right, make the best out of one's situation and remember to spare some time for laughter!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "alexdeleonfilm",
        "review_rating": "8",
        "review_title": "A wishful thinking wartime comedy about dumb Nazis and smart Polaks",
        "review_detailed_main": "\"To Be or Not to Be\" starring comedian Jack Benny, 1942 image1.jpeg\n\nA wishful thinking absurd wartime comedy about Dumb Nazis and Smart Polaks. Plot: A bad Polish actor is appearing on stage as Hamlet when the war breaks out and Warsaw is occupied by the invading Germans. His wife has had the annoying habit of entertaining young Polish officers backstage during his \"To be or not to be\" soliloquy. When one of these officers comes back from England on a Secret Mission to thwart the Gestapo the actor takes charge and comes up with a plan for them to harass the Germans and escape to freedom.\n\nIn 1942 Nazi Germany under Hitle r had conquered most of Europe including France and American morale was at a low point. As a kind of followup to Chaplin's prewar The Great Dictator (1940 prior to America's entry into WWII in Dec. 1941) this was mainly a Jack Benny vehicle. Benny, Jewish, was the most popular American radio comedian of the time and only appeared in a few movies, but this is his one famous leading role and worth a look-see if only for that. His wife in the film, Carole Lombard, was a very popular Hollywood star married to the \"King of Hollywood\" Clark Gable (Rett Butler in \"Gone with the Wind\"). Lombard was killed in a tragic airplane crash returning from a troop entertainment tour just before the movie was released.\n\nIn the film Benny is the Polish ham actor playing Hamlet in occupied Warsaw. He and his theater company dress up as German soldiers to bamboozle the German military command and thwart Gestapo's efforts to wipe out the the Polish underground leadership. At one point Benny impersonates Hitler himself on a visit to Warsaw, phony mustache and all. Director Lubitsch, known for sophisticated comedies, was a refugee from Hitter Germany and obviously relished the idea of making fun of the Nazis on screen but the public at this stage was in no mood for fun and the film, unlike the big success of Chaplin's earlier Dictator, was a flop at the box-office despite the star appeal of Benny and Lombard.\n\nIn retrospect it can be seen as a World War II Hollywood landmark that is funnier now than it was then. Both comedic and dramatic with certain languors here and there it still stands the test of time fairly well and is certainly a picture of some historical importance. The film was produced by famous British Hungarian film impresario Alexander Korda (The Thief of Bagdad) and the script was written by expatriate Hungarian writer Melchior Lengyel. A digitally restored print was shown in a series or restored classics here in Budapest last month, (October, 2017) Alex, Budapest\n\nSent from my iPad"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "kindofblue-78221",
        "review_rating": "10",
        "review_title": "One of the darkest and funniest films of all time.",
        "review_detailed_main": "To be or not to be is not only one of the funniest films of all time its also one of the finest denunciations of tyranny ever seen on film.\n\nThis film has me in hysterics at times. It's so funny.\n\nBut behind all of this is a very serious theme. Sometimes the most effective method of exposing the evils of totalitarian regimes is to ridicule it.\n\nI never get bored of this film with its series of running gags and hilarious one liners Jack Benny was never this good again. For Carol Lombard it was a fitting finale.\n\nTo be or not to be is fast. It's funny. It's poignant.\n\nIt's perfect."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "851222",
        "review_rating": "10",
        "review_title": "Brilliant movie",
        "review_detailed_main": "Greetings from Lithuania.\n\n\"To Be or Not to Be\" (1942) was a very funny, smartly written, superbly acted and directed movie. I was very surprised of how much i liked it and I had no idea what this movie was about before seeing it. Plot was ingenuis as well as it was superbly writen. I loved whole twists this movie had and overall experience of this movie was very positive, despite it's subject.\n\nOverall at running time 1 h 39 min \"To Be...\" was amazing movie. Despite it's age this movie holds up superbly even first time seeing it in 2022. The craftsmanship was brilliant and so was the film. Great movie."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "curtisherenow",
        "review_rating": "9",
        "review_title": "Very, very, very good movie",
        "review_detailed_main": "I saw the film for the first time today. Before I saw this film, I saw Tarantino's \"Inglorious Barsterds\" and in retrospect it is once again clear that Tarantino have many ideas and inspirations for the movie from grandmaster Lubitsch.\n\nIch kenne keinen anderen Film der so gut die psychologischen Wirkmechanismen der Nazi-Ideologie wiederspiegel. Great job!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "PaulusLoZebra",
        "review_rating": "8",
        "review_title": "Brilliant and audacious satire",
        "review_detailed_main": "There were many anti-Nazi films made in the late 30s and early 40s, and they varied greatly from rah rah propaganda pieces to more subtle \"message films\" and even to some comedies, or more precisely satiric mockeries of Hitler and his followers. In the latter category, Lubitsch's To Be or Not to Be and Chaplin's The Great Dictator stand out. The Lubitsch film goes to great lengths to develop multiple characters and plot lines, so that we feel we re watching their stories, and they just so happen to be occurring in the backdrop of the German invasion of Poland. As the movie progresses, the anti-Nazi focus increases, but the film never abandons its characters and their stories for political purposes. Jack Benny is great as the protagonist, but it is Carole Lombard whose sweet, impish guile elevates the proceedings to a higher level. The ensemble cast is GREAT."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "w2amarketing",
        "review_rating": "",
        "review_title": "Odd Parallel to \"Strangelove\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "SusanJL",
        "review_rating": "7",
        "review_title": "Treat to see a young Jack Benny!",
        "review_detailed_main": "Never before had I seen Jack Benny perform as a younger man, he was a bit handsome back in the day! This movie was pretty good, glad I watched it."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Kdosda_Hegen",
        "review_rating": "8",
        "review_title": "Magnificent comedy.",
        "review_detailed_main": "This film was not only extremely funny, but extremely well written too. It takes many great risks and is quite controversial and might have offended many at the time of it's release, but it succeeds at everything. It's a remarkable experience of a film, truly interesting work. It's as good as Dr. Strangelove and it even came before it, I highly recommend watching both."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "thespeos",
        "review_rating": "7",
        "review_title": "Acting is Superb. Story is a Mess.",
        "review_detailed_main": "Very well-acted, but dull and confusing nonetheless.\n\nHere's my breakdown:\n\nSTORY: This story is (practically) a collection of sub-plots that appeared forced into a whole.\n\nPart of the problem is that you have a story that's theater within theater, and it switches from \"reality\" back to acting, and does that throughout the story.\n\nThis was done with perfection in the film \"The French Lieutenant's Woman\" (1981), though there are other attempts using the same tact.\n\nBut here, the resulting impression is an unfortunate combination of confusion and boredom.\n\nACTING: The acting firepower here is immense, and they all deliver excellent performances. Sadly, great acting can not overcome poor or mismanaged story.\n\nENTERTAINMENT: Low to moderate value depending on your preferences\n\nTEMPO: OK, but the excess context-switching muddles the continuity\n\nCINEMATOGRAPHY: Cheap\n\nMUSIC / SOUND: N/A\n\nDIRECTING / WRITING: Director: Lubitsch did a great job shooting \"The Shop Around the Corner\" (1940), and his work here demonstrates solid technical skill. Whether or not he contributed to the mess here I can't say.\n\nWriters: Mayer just never created work that piqued my interest, and maybe (dunno) this shows me why.\n\nIs it a good film? Yes, and no\n\nShould you watch this once? I just don't know ...\n\nRating: 7.0 (for outstanding acting)"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "EclecticCritic",
        "review_rating": "1",
        "review_title": "Propagandistic Pig 🐷 Swill",
        "review_detailed_main": "Where to begin with this mess? The ludicrous plot? The artificial dialogue? The self-satisfied smugness? The unsuccessful attempts at wit? The insipidity? The dullness? The odd casting choices? All of the above? None of the above?\n\nWell, here goes: Members of the National SOCIALIST Party were many things but stupid they were not. The filmmakers would have you believe that they would be incapable of tying their own shoes or counting to ten. What subtle wit. The gang that couldn't shoot straight isn't even aware when a large group of strangers is in their midst. WWII should have only lasted a week or two, I guess.\n\nPropaganda almost always looks bad after the cause for the propaganda has passed, and this is certainly the case here. A cinematic universe has been created in which no one behaves as any human being ever would. This wouldn't be so bad if anything happened that was interesting. At the theater I was at, I saw many people looking at their watches. Half of the sizable crowd had left before the final curtain. Unfortunately, I was not one of them.\n\nI would like to add one rather controversial comment, if I may. I have an unblemished record of heterosexuality in my long, all-too-long life, but I feel compelled to let you, my dear readers, know that I found Robert Stack more attractive than Carole Lombard in this turkey. He seemed to practically glow with vitality, while she seemed pasty-faced and lifeless, something that, as it turns out, she was soon to be.\n\nAdded almost 2 1/2 years after my original review: Please disregard the 1 out of 14 helpful rating of my review (as of 8/30/23). This is simply a case of thirteen people who liked this movie not liking that I didn't. The merits of my review were meaningless to them. It is this immature \"I will automatically be critical of someone's opinion that differs from my own\" or, in this case, \"I will find a review \"unhelpful\" because the opinions expressed differ from mine\" that is at the heart of much of the strife that has and always will be a part of existence on the earthly plane. Learning from different viewpoints is at the heart of personal growth, and a sign of wisdom.\n\nThe thirteen people should be ashamed of themselves, but, sadly, won't be. And for the one \"helpful\" voter, congratulations. You get it.\n\nAdded later: I see four more tools have weighed in.\n\nAdded even later: One more tool has weighed in-and one perceptive reader. The few perceptive souls in this rather clueless world always bolster my spirits when I am feeling down, as I tend to be when watching pig 🐖 swill such as this. Two out of twenty (as of Apr 13, 2024)? Yes, that ratio is about right."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "quaseprovisorio",
        "review_rating": "9",
        "review_title": "so many readings into this perfectly crazy themed hitler mockery.",
        "review_detailed_main": "Its reputation is definitely real: this film is probably one of the best comedies ever made. This doestn't give justice to it: it's a classic, a classic along the lines of any classic we can remember of. This is theater saving us. it's deception at his finest.it's the art defending us from evil.\n\nthe plot is quite intricate, and even is very well made it is not the most fascinating thing: for me the most astonishing point about this picture is how it depicts two equal situations but one in the north pole and the other one in Antarctica. it's how it goes from one point to another by giving us what the characters need to hear. i think this is one of the most articulate scripts and directing ever.\n\nthe narrative structure is very clever. it reminds me a bunch of things. \"o pai tirano\" the tyrannical father\" is a portuguese comedy from the same time (actually one year before, 1941 - check it if you can, it's a very real depiction about the type of cinema we were doing, and the type of society people lived, blended in an accurate comedy) where theater is the key; \"inglorious basterds\" - tarantino film is in one way a spiritual sequel to this, at least it's how i see it - where cinema is the solution. but also mel brooks's comedies and even monty python. this is also surreal at its finest.\n\nand is an utmost meaning that this was made when everything was happening. this was released after 1941. these guys were playing with the real fire. the real power and menace. and they did it perfectly. a movie where a theater company plays part of a huge conspiracy to help polish resistance. How will they do it? By acting. but there are conflicts in there. Those conflicts sometimes are mixed with the acting. sometimes they're real inside the fake body, sometimes they're fake inside their real body. the movie subverts everything at its own pleasure: that's why is so amazing. it's lubitsch inside the nazis.\n\nthe teatralization is perfect: the actors embody in a greatly way the fact that when it's cinema they are in cinema and in theater in theater. that distinction is very balanced. this is a movie about actors acting, inside a lubitsch comedy, inside an anti nazi film. and it's all of that and mostly it's still is a lubitsch comedy. So all the dialogues are on point, the silences are perfect, the music conducts the physical comedian act. There's a lot of things here to be analized, magnified and appreciated.\n\nand, above all, is a very but very funny movie. all of its structure was made in order for the comedy to work. there are some tense moments too, and that is actually important here, but the meat for me is in all comedy timmings, being them good or bad for the faith of the characters. they all work in such a timely art that's hard to describe.\n\nSo... t's an amazing film and one of the best mockery to the nazis ever. In the first minute i was sold already. Without much to add, because i could be here the whole night, but there's something i can imagine that is still way more important than anything else (even how great this whole movie is): imagining families with the fear of being bombarded, of having their lives at risk, being able to laugh their asses one time together by waching this crazy hitler movkery. more than a must watch, it's mandatory."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "LeonardKniffel",
        "review_rating": "8",
        "review_title": "The Best Jack Benny Movie",
        "review_detailed_main": "Remarkable as it is, this comedy about an acting troupe that becomes embroiled in a Polish soldier's efforts to track down a German spy was released in 1942 but filmed in 1941, before the USA entered World War II. The spy has information that would be damaging to the Polish resistance and the troupe must prevent its being delivered to the Germans. Set in Nazi-occupied Poland, the film stars Jack Benny and Carole Lombard, and it is difficult to imagine how they managed to pull it off, but critics continue to site this film as one of the best mockeries of the Nazis ever done. Lombard died in a plane crash along with her mother and twenty others returning from a war bond rally before the film was released. A 1963 remake of the film, directed by and starring Mel Brooks in the Jack Benny role, has always left me wondering why it was necessary to remake a film that was about as good as it was ever going to be the first time around."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "calspers",
        "review_rating": "8",
        "review_title": "Hilarious and brave nazi mocking",
        "review_detailed_main": "\"To Be or Not to Be\" (1942) directed by Ernst Lubitsch is masterful mocking of the Nazis in a very brave time being produced in the midst of the second world war.\n\nThe plot revolves around Joseph and Maria Tura who operate and star in their own theater company in Warsaw. Maria has many admirers including a young lieutenant in the Polish air force, Stanislav Sobinski. When the Nazis invade Poland to start World War II, Sobinski and his colleagues flee to England while the Turas find themselves now having to operate under severe restrictions, including shelving a comical play they had written about Adolf Hitler. In England meanwhile, Sobinski and his friends give Professor Siletski - who is about to return to Poland - the names and addresses of their closest relatives so the professor can carry messages for them. When it's learned that Siletski is really a German spy, Sobinski parachutes into Poland and enlists the aid of the Turas and their fellow actors to get that list back.\n\nIt is simply great with excellent writing, direction, production and scenery. Highly recommended dramedy."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "cemalaydemir",
        "review_rating": "10",
        "review_title": "I like it",
        "review_detailed_main": "Life in Poland, which was under German occupation during the Second World War, is very difficult for anyone who is against the Nazis. A spy who could seriously harm Poland's resistance to the Nazis must be stopped as soon as possible before it reaches the Germans. A group of theater actors led by Joseph Tura and his wife Maria engage in a relentless struggle with the Nazis. The film, which successfully describes the interventionist attitude of oppressive regimes towards art, is directed by Ernst Lubitsch. Let's not forget to underline that the film was shot during the years when the war was going on with all its brutality."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "secondtake",
        "review_rating": "8",
        "review_title": "uneven, both brilliant and flawed",
        "review_detailed_main": "To Be or Not to Be (1942)\n\nThis is a powerful and yet peculiar and flawed movie. The best of it is the satire of the Nazi regime and Hitler himself. You have to remember this is during the war, and so it was aimed at the enemy.\n\nCarole Lombard is clearly the lynchpin here, acting with aplomb-both humor and, oddly, gravitas at times. Jack Benny is all over the map-both humor (of course) and sometimes the serious actor they needed from him. But he's sometimes off pitch, hitting chords that are out of step (for me) with the script. One example would be the overextended use of Hamlet, which is meant to add another layer both deep and comic, but it runs dry fast.\n\nOf course, behind this all is the strong direction by Lubitsch, who was trying for an elevated mix of humor and irony. Sometimes it's spot on, as when the dramatic comedy is interrupted by a bombing raid and the leading actors are in a shelter. Briefly.\n\nMost of the time there is a mix of actors pretending to be Nazi types and usually getting away with it, with the laughs you'd expect. But underneath it all is the dreadful truth, which the audience felt all too deeply, and which you can still sense today.\n\nI see the movie is highly rated, and I'd say the best of it is sublime. But not every scene or every character rises to this level, and the larger result is a mixed experience. One worth seeing, however."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "briancham1994",
        "review_rating": "9",
        "review_title": "Surprisingly complex comedy",
        "review_detailed_main": "I wasn't sure what this film would be like, but it definitely lived up to my expectations and more. It's surprising what they could get away with - a black comedy about the Holocaust made while it was happening - a point which is even satirised within the film itself when the play gets shut down. It features an energetic cast who play actors doing their best to survive in occupied Poland by impersonating Nazis and tricking everyone with a complex acted plot. This insane plan puts them into equally insane scenarios which are hilarious and unpredictable - \"your friend appears to be dead!\" This film is an underrated classic that showcases the best of a clever script, engaging scenarios, witty dialogue and masterful acting."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Scott-205",
        "review_rating": "",
        "review_title": "Great film, poor timing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Doylenf",
        "review_rating": "6",
        "review_title": "Amusing comedy has the Lubitsch touch...",
        "review_detailed_main": "JACK BENNY and CAROLE LOMBARD are ideally cast as a ham actor and his zany actress wife in TO BE OR NOT TO BE, a story of Poland facing the Nazi invasion and how a theater troupe gets to do some real acting by fooling the Nazi authorities.\n\nThe real comedy highlight of the film is SIG RUMAN as Col. Ehrhardt, foolishly thinking that Benny is a loyal German involved in spying activities for the Fuhrer and afraid of showing any disloyalty to Hitler by telling Earhardt a joke poking fun at the Fuhrer. His scenes with Benny and Lombard are a joy to watch.\n\nROBERT STACK plays the young pilot who always walks out on Benny's \"to be or not to be\" oration as soon as it begins, for reasons unclear to Benny. STANLEY RIDGES does a nice job as the real professor doing the spying for Hitler, the man Benny must impersonate with some hilarious results.\n\nMust have seemed way ahead of its time in '42. Sadly, it was Lombard's last film. Shortly after filming ended, she went on a bond selling tour and was killed in a plane crash on her return to Hollywood and Clark Gable, her husband.\n\nThroughout, the direction is well paced and assured under Ernst Lubitsch's clever and light-hearted touch. Well worth watching."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "VicTheDaddy",
        "review_rating": "9",
        "review_title": "Hail my self",
        "review_detailed_main": "I watched this film recently and thought id leave a brief comment,i found this original version better than the remake although the one with Mel Brooks is good as well.What i like about this Jack Benny version is that the humour is never forced,you can see the sincerity in the actors as although they are playing for laughs they are also saddened by the dark humour in their scripts,this film was probably Ernst Lubritsch's way of drawing the publics attention to what was really going on during that period in Warsaw,Chaplin did the same thing when he made the Great Dictator.Sometimes the best way to get your point across to people is through comedy as the horrors that were really going on during this time were being very played down by the press and the government and yet the public had to be made aware in some way.I found this a very intelligent comedy,in that its funny when it wants to be and yet makes sure you see its serious nature.And on the other hand making fun of your enemy is a great way of getting back at them.Great film a real pity that it was Carole Lombards last."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ShootingShark",
        "review_rating": "6",
        "review_title": "Clever, Funny, Well-Acted Comedy Adventure Of Polish Theatre Troupe Outwitting Nazi Invaders",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "hadaska-53290",
        "review_rating": "1",
        "review_title": "Hollywood selling horror as humor",
        "review_detailed_main": "It was 1942, and incredibly, making fun of Hitler and the Nazis seemed a grand idea to the Hollywood movie making world. By this point in time Nazis occupied Europe. And..in early 1942, only months before this movie was released, top Nazi brass had met to formalize what was called The Final Solution for the elimination of Jews worldwide. Yet, here was a movie that several noteworthy Jews in the movie industry participated in and saw as appropriate entertainment. Those being Ernst Lubitsch, the Director, Jack Benny and Felix Bressart. Almost 80 years later, this movie is as offensive in its concept today as it should have been back then. I'd go even further and call it shamelessly vile."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "proffate",
        "review_rating": "8",
        "review_title": "Interesting take on the times",
        "review_detailed_main": "In 1942, Hitler had not yet been defeated. That makes this an especially entertaining take on his reign (as opposed to Mel Brooks' remake).\n\nFunny stuff abounds in both versions, assuming you don't identify with the anti-smoking, vegetarian Hitler. He'd be politically correct by today's standards.\n\nBoth versions are worth watching."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Sergeant_Tibbs",
        "review_rating": "9",
        "review_title": "Sardonic, hilarious and tragic. One of the finest films the 1940s has to offer.",
        "review_detailed_main": "My first taste of Ernst Lubitsch and one of the greatest films I've seen in a long time. To Be Or Not To Be doesn't waste a moment. It's one of the most impeccably paced films of the 1940s that hits every beat and leads down unpredictable paths. Instantly you can feel the heat of Billy Wilder's admiration for Lubitsch as they share similarities in a simple shooting style, love triangles and sardonic dialogue, and in a way To Be Or Not To Be does it better than Wilder ever managed. It's a battle of egos but they're deeply human underneath, balancing dry humour and tragedy beautifully. This is simply one of the funniest, intelligent and most poignant films of the 1940s. It's got a lot of bite and a lot of character. Lubitsch's brand of satire will be one to watch for me.\n\n9/10"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "rmax304823",
        "review_rating": "8",
        "review_title": "Don't Spit On My Field Gray Gabardines.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "itamarscomix",
        "review_rating": "9",
        "review_title": "Hilarious",
        "review_detailed_main": "It's often overshadowed by The Great Dictator, which preceded it by two years and was technically the first American WW-II themed comedy, but To Be Or Not To Be deserves the honor both for being the first comedy to refer to Hitler and Nazi Germany by name, and also for being made while the US was very much an active side in the war. It's still incredibly funny, but it's much more impressive, almost shockingly so, when you realize that it was made while Hitler was alive, and just how powerful it was back then. Carole Lombard is show-stoppingly terrific, and it's probably the best place to see her talent on display, since sadly it was her final performance."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "hennystruijk",
        "review_rating": "9",
        "review_title": "A truly wonderful movie!",
        "review_detailed_main": "From the screenplay to the performances to the direction--a perfect film that seems timeless. A young Robert Stack, the best Jack Benny on film, and sadly-the wonderful Carole Lombard in her last film. A gem from beginning to end!!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Incalculacable",
        "review_rating": "10",
        "review_title": "Goodbye, Carole.",
        "review_detailed_main": "To Be or not To Be is Carole Lombard's last film before her tragic death in a plane crash and Jack Benny's finest. Another special thing about To Be or not To be is that it made fun of the Nazis \u0096 so much so that some were very uncomfortable seeing it. There are few films that can boast this daring achievement \u0096 making fun of Nazis in the midst of World War II. As well as succeeding at making some people uneasy, it also succeeded at making many laugh.\n\nThe story of To Be or not To Be about a theatrical company in Nazi-occupied Warsaw which is preparing to perform an anti-Nazi melodrama. Maria (Carole Lombard) and Joseph Tura (Jack Benny) are cast as the leading roles. However, the Polish government cancels the play as they are afraid it would have disastrous consequences. So instead they perform Hamlet, and when Joseph Tura is speaking those immortal words: \"To be, or not to be\", he notices a young man, Lieutenant Stanislav Sobinski (Robert Stack), slipping out of the audience. He is, in fact, visiting Maria Tura backstage. When war breaks out, Sobinski makes it to London to fight with the RAF, and the Turas stay in occupied Warsaw. Hilarity ensues when Maria Tura is captured by the Gestapo and to rescue her, Joseph and their friends dress up as Nazis.\n\nThis movie is absolutely hilarious, witty and clever. When I was watching it, I was dumbfounded that anyone could think of such an intelligent story which kept you constantly guessing as to what they would do next. Ernst Lubitsch manages to handle such a delicate, fragile issue and make it into a side-splitting comedy. This is an especially bittersweet movie for me as I am a big fan of Carole Lombard but I am so grateful she went on a movie such as this: a truly priceless and hilarious portrayal of Nazis. This movie is not to be missed."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "dougdoepke",
        "review_rating": "",
        "review_title": "Shakespeare Does Hitler",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "CinedeEden",
        "review_rating": "6",
        "review_title": "Heil myself!",
        "review_detailed_main": "I watched this film for the sole purpose of Carole lombards last motion picture. And the comedian that is Jack Benny. These people had the balls to make fun of the Nazis during this as the war in europe and now in asia was still looming over them. I heard this film was a box office bomb and when audiences saw Carole on screen they clapped and cheered and their is no evidence to suggest the film makers took out a plane line she said in the film. Carole also said this was one of her favorite films. Director Ernst Lubitsch did a fine job on this film and I am only familar with trouble in paradise (1932) and Ninotchka (1939)"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "morrison-dylan-fan",
        "review_rating": "10",
        "review_title": "\" A laugh is nothing to be sneezed at .\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "andropeter",
        "review_rating": "1",
        "review_title": "Good for 1942 but now not credible, not really funny and poor script",
        "review_detailed_main": "Did it occur to anyone that the Germans are supposed to speak German with each other? How do a bunch of Polish guy manage to impersonate German soldiers. And this scene where Hitler is in the theater and his double manage to fool the all army. Really not credible.\n\nThe high ratings are not deserved at all. The only remarkable thing is that it was made in 1942, but now it is just a very foolish movie.\n\nPlot: Husband and wife Carole Lombard (Maria) and Jack Benny (Joseph) are the leading lights in a Polish Theatre Company during the outbreak of World War 2. They are currently performing \"Hamlet\" and soldier Robert Stack (Sobinski), who is obsessed with Lombard and attends all her performances, is there in the audience on every occasion. Lombard and Stack arrange meetings with a pre-determined code. A professor double agent needs to be killed."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "elvircorhodzic",
        "review_rating": "9",
        "review_title": "\"If I shouldn't come back, I forgive you what happened between you and Sobinski. But if I come back, it's a different matter.\"",
        "review_detailed_main": "Interestingly, when the serious and tragic theme of the Second World War used as the basis for a great comedy. From this point of view it is difficult to separate the horrors in people's lives and the way that fashioned this comedy. Comedy based on the tragedy is not entirely correct thesis. TO BE OR NOT TO BE is extremely brave, required and great project. The title is not a parody phrase from Shakespeare's works, but alluding to the existence and struggle for survival.\n\nFrivolous and inappropriate descriptions are that only correspond to the characteristics of the genre. Hilarious fun theater company in Warsaw trying to outwit the Nazis during the war. This is enough to man peed with laughter. Not pertinent, but it is necessary.\n\nThe film can be seen as shocking joke, making fun of the Nazi approach and spectacle, but certainly not anti - Polish propaganda. The characters in the film do not cease to be what they are. They are actors. With good acting, improvisation, ingenuity and courage, winning terrible enemy.\n\nCarole Lombard as Maria Tura, an actress in Nazi-occupied Poland was a brave woman, an actress whom everyone admired, and we all know that the charm of a woman can be a powerful tool. The funny thing is in the film, no one can \"break\" other than her husband. Although, it is in this case quite helpless. Jack Benny as Joseph Tura, an actor and Maria's husband. He is \"the first line\" of ridicule. Uncertain is in itself and turns a fool several times. But in the end he shows to us his \"great acting\". Robert Stack as Lt. Stanislav Sobinski, a Polish airman in love with Maria is a handsome soldier and lover required in the script. Felix Bressart as Greenberg and Sig Ruman Col. Ehrhardt are hilarious. One wants a role because it is only created for her and the other for their mistakes \"that can not be counted\" always blame his servant.\n\nTo be or not to be is fun movie. It has a hilarious story, great dialogue, acting and good scenery. I am aware of the other side, which may have the opposite impression. I think the aesthetic and spiritual this movie does not offend anyone who passed all the horrors of the Second World War."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "evanston_dad",
        "review_rating": "8",
        "review_title": "Strange But Delightful",
        "review_detailed_main": "It's hard to recognize how utterly daring this film probably was at the time of its release. Charles Chaplin was put on a death list by Hitler for lampooning him in \"The Great Dictator\" in 1940, and while Ernst Lubitsch's film isn't quite as scathing as Chaplin's, I still have to think that so openly mocking the Gestapo while the war was still raging took a lot of guts for everyone involved.\n\nThis isn't necessarily a laugh out loud comedy; there are no really big laughs to be had. But it's never once less than delightful to watch, and all of the performances are terrific. Of course, the most praise must go to Jack Benny, who seems so utterly comfortable on screen, but Carole Lombard is as sexy and engaging as ever, even if she has quite a bit less to do.\n\nVery funny, very entertaining, and probably a must see from the period of war-time cinema.\n\nGrade: A"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "FilmCriticLalitRao",
        "review_rating": "8",
        "review_title": "Lubitsch takes his revenge against Nazi Germany",
        "review_detailed_main": "All that can be said about \"To be or not to be\" is that it was purely an aesthetic vehicle for Ernst Lubitsch to settle scores with Adolf Hitler and his Nazi Germany.Everyone knows well how many talented Jewish artists had to leave Germany when Adolf Hitler came to power. Lubitsch made Nazis bite the dust in a pacifist manner by showing them as ridiculous souls.Although the film is comic in nature there is no denial of its serious tone.There are various serious themes like World War II, relationship between a husband and a wife,behavior of actors,horrors of war which merit viewers' attention.It is true that this film suffers from a complete lack of \"Lubitsch\" touch but comic elements make for its absence.If you happen to be one of those viewers interested in theater especially Shakespeare and his famous plays, it would be tough for you to tolerate those people who walk out during performances based on this famous bard's plays.The hidden highlight of the film is arrogant behavior of certain actors who find it hard to believe that some people might not have heard of them. It is better to tell them that in life as in plays everything is possible."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jht176",
        "review_rating": "9",
        "review_title": "U S Not in World War II When Lubitsch Classic Conceived and Filmed",
        "review_detailed_main": "So many of the comments about To Be and Not To Be dwell on Lubitsch and everyone else's poor taste in making a comedy about war during World War II. However, this movie was conceived and shooting -- but perhaps not editing -- probably already finished by Sunday, December 7, 1941, when the surprise attack on Pearl Harbor followed by Nazi Germany's declaration of war against the United States brought the USA into a global war.\n\nYes, many did think it was inevitable that America enter World War II as a combatant to assist the Western Democracies, but few probably thought that time would come as early as the late Fall of 1941 and as a result of a Japanese attack on Pearl Harbor.\n\nThis Lubitsch masterpiece does have some loose ends; but all in all, it is a superb comedy. Comedy, in my not so humble opinion, is not necessarily a vehicle that promotes side-splitting guffaws which To Be or Not To Be does not except in a few places --\"Concentration Camp Ehrhardt\" with its repeated repetitions by the real and fake Professor Siletskys as well as the fake and real Col. Ehrhardts.\n\nJack Benny's timing is superb. Carole Lombard, to quote Louella Parsons's oft-written and quoted comment about Marion Davies, \"never looked lovelier.\" Lombard, one of the queens of 1930's madcap comedies, of which To Be or Not To Be is definitely not, underplays her role with a consistency that is magnificent -- had she matured so much as an actress since The Twentieth Century and Nothing Sacred or is this a testament to Lubitsch's magic as a director?\n\nOne needs to remember when this film was actually made not when it was released to put it into true perspective. It is a sad thing that it has taken so many years for the Ernst Lubitsch production of To Be or Not To Be to be recognized for the magnificent comedy it actually is instead of being panned for being politically incorrect in light of what occurred or was made known of after it was made.\n\nThis movie does hold up with repeated viewings. So, do not watch it just once and go onto the latest Tom Cruise release on DVD, watch To Be or Not To Be again and again."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "SimonJack",
        "review_rating": "10",
        "review_title": "A classic war-time spoof of Nazi Germany",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "highclark",
        "review_rating": "9",
        "review_title": "'39 Forever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "helpless_dancer",
        "review_rating": "7",
        "review_title": "What would the Bard think?",
        "review_detailed_main": "Good, but the Mel Brooks re-make outshone this old bird front to back. It was funny to hear Robert Stack's 40's voice compared to the more natural style he used later in his career. As always Benny is a riot as were a couple of the stupid Nazi officers. Worth seeing."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "pyrocitor",
        "review_rating": "9",
        "review_title": "'Tis nobler in the mind to suffer the slings and arrows of outrageous comedy, while paying respectful homage to a sea of troubles",
        "review_detailed_main": "If you're one of the many who sneer that contemporary comedies play too much on offensive shock value, try this on for size: an American comedy, released only months after the country had shipped troops over to join the war, with the image of Adolf Hitler casually strolling down the street, only moments after his moustached grimace would have graced the screen in the newsreels. Indeed, between the film's brazenly audacious topicality and the horribly tragic pre-release death of its leading lady, it almost boggles the mind to imagine any audiences chancing a viewing of Ernst Lubitsch's To Be or Not To Be, let alone laughing at it. Thankfully, the benefit of hindsight reveals a true classic waiting in the wings. Taking its place alongside Chaplin's The Great Dictator as one of the bravest (and, by proxy, funniest) films of the era, To Be or Not To Be is a savage satire and comedy of errors, wordplay, and mistaken identities worthy of Shakespeare himself, in addition to being a palpably tense and engrossing war film in its own right.\n\nIf the notion of making an irreverent wartime satire while at once being sincerely deferential to the fears and hardships of the war might seem contradictory, it's a paradox that Lubitsch embraces full steam ahead. The genius of To Be or Not To Be is its being equal parts comedy and war film, vindicating the struggles of overseas troops while employing laughs as cathartic levity from the fear and uncertainty surrounding them. Appropriately, Lubitsch plays the claustrophobic, paralyzing outrage of the encroaching invasion of Poland and the nailbiting suspense of spying within the Nazi ranks to the hilt, while simultaneously lampoons the blustering bureaucratic ineptitude of a Nazi force fumbling to uphold their own doctrines, often side-by-side within the same scene. The film's screenplay is deftly intricate, with enjoyable meta-Shakespearian plays on disguises and mistaken identities seamlessly blending the strains of espionage and comedy. Still, Lubitsch is the master of the 'verbal repetition as punchline' gag, with several slow-burning bits (ranging from initially innocuous lines of dialogue to Benny's hysterically cringeworthy rendition of the titular soliloquy) building from chuckle-worthy to uproariously hilarious in tandem with the film's steadily mounting tension.\n\nAnd, amidst the beats of irreverence and reverence (and moments of shocking, jarring darkness), Lubitsch leaves room for heart. Although the film's 'secret love' subplot between Lombard and Robert Stack's heartthrob pilot plays as a tad histrionic, the clarion sentiment Lubitsch invests into the film's overall agenda is far more resonant. Above all else, the film serves as a galvanizing wartime call to action: a bold parable to the propensity of every citizen to combat oppression, regardless of profession (or even competence). Here, the goofy dysfunctional troupe of actors are held as equally worth of heroic valourization as Stack's matinee idol pilot by being willing to lay down their lives to combat the Nazi uprising. It's an empowering testament to the human spirit that rings true without the artifice of propaganda, and, while lacking the infectiously rousing power of Casablanca's 'La Marseillaise,' Lubitsch's film is equally uplifting, albeit in a quiet and fundamentally sillier way.\n\nCarol Lombard's tragically untimely swan song performance is truly one for the ages. Commanding the screen with effortlessly affable ease, she infuses the film's tenser sequences with palpable stakes and tension, while weaving in the reprieve of a mischievous twinkle in her eye to break the ice and invite laughter back into the frame. Jack Benny is similarly magnificent as \"that great, great actor, Joseph Tura,\" being as reliable a repository of laughs in his subtly scathing facial expressions as his perfectly rapid-fire banter and quipping. Stanley Ridges is perfectly smooth riddled with menace as a suave Nazi spy, while the wonderful Sig Ruman blusters and sputters to jubilant perfection as a perennially outwitted Nazi officer.\n\nMinor quibbles of pace and tonal balance aside, To Be or Not To Be is a remarkable juggling act, and as enjoyable as it is a triumphant feat of irreverent wartime defiance. Ticking dual boxes of being one of the most resonant and memorable comedies or war films of the Classical era, Lubitsch's film is an eminently revisable time capsule of the best gallows humour of the WWII era. Ah, what the hell - let's do one for the road: \"SCHUUUULLLTZ!!!\"\n\n-9/10"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "moritzherz",
        "review_rating": "5",
        "review_title": "Best Nazi-parodie ever made!",
        "review_detailed_main": "From the first scene on this movie satirises the nazi regime in such a funny way that you might forget how cruelsome they really were.\n\nThroughout the 1h and 30 minutes you will repete laughing and be inpressed about the movies greatness. In a way the story is also entertaining so it's not only comedy but its main focus lies on getting the audience laughing. I think when the movie released (during war), it was not as popular showing the nazis as harmless and silly but today it works really good.\n\nThe whole shakespeare touch was also great and I think it fit. (especially the hamlet scenes).\n\nI can recommend you this movie if you want to laugh about Hitler and the nazis. (Be honest, who does not want that?)"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Liedzeit",
        "review_rating": "10",
        "review_title": "A laugh is nothing to be sneezed at",
        "review_detailed_main": "Robert Stack as Lt. Sobinski is colorless. There is a disgusting scene at the end when the two Germans jump out of the plane, following the order of the Fuhrer. What a poor, cheap joke. And even that is topped two minutes later, when for no other reason then to get another cheap laugh, Bronski has to parachute out of the plane, so that one poor peasant can say \"First Hess, now him\".\n\nHaving said that you can get a rough idea how brilliant this film must be when I tell you that it is easily the best film ever made! Not only best comedy, but best period. Beating in my personal list GWTW, Thief of Bagdad, Taxi Driver. Lets dive into it. First of all there is this daring concept of having a Polish theater group in the middle of the Great War outwitting their oppressors. We have a great tight story that is much more than just a vehicle to transport jokes or funny scenes. You could make a very suspenseful spy thriller out of the plot. Then there is this terrific cast, Jack Benny who needed only this one film to achieve immortality, beautiful Carol Lombard who had the task of playing the faithful wife to the great actor Joseph Tura and at the same time being just believably enough attracted to this guy who is able to drop a couple of tons of bombs. Stack of course, must be colorless, since what we do not need in this story is any serious lover's triangle. Bressart is great, Sig Ruman is just unable of being not hilariously funny and here he can give us the performance of his life. Even the tiniest role is played by an acting genius. Lional Atwill as Rawich is perhaps the one that deserves in this cast of giants a special mentioning, because the way he portrays the actor who just cannot stop overacting is alone worth watching the film half a dozen times. But most of all To be or Not to Be is funny. There are a number of running gags that have never been topped in the history of film comedy. The Schultz thing, the joke on the Hitler ending up as a cheese joke and of course the Hamlet gag. But best of all: Concentration Camp Erhardt. So far I could always resist (or I chickened out) but one of these days I will sit in row two of a Hamlet performance and I will leave at the start of the monologue. The highlight of the film is the scene when Benny/Tura is confronted with dead Professor Siletzky the guy he is just impersonating. Even after having seen this film at least 30 times it still makes me marvel how they could come up with that. My favorite scene though is right at the beginning, when Tura tells his wife that for the next play he has thought that her name should appear above his own.\n\nAnd she says \"Oh, darling, that is so sweet of you. But of course, I do not care\". He says \"That is what we thought. So we won't do it\". And she says \"Oh\". Not more. But this little scene is enough to set the mood for the entire film and it tells us all we need to know about their marriage. By the way, this scene is even funnier in the German version. Maybe it is just that I only recently had the chance of watching the Original (thanks DVD makers) but I really think the German adds something to it. Especially the off-voice at the beginning \"Lubinski, Kubinski...\" is more relaxed than the original and fits the mood of the film much better. And there is a great alliteration in German \"Welcher widrige Wind...\" I could ramble on forever. But now is the time to just sit back and enjoy the film once again."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "robsta23",
        "review_rating": "9",
        "review_title": "A Hilarious Comedy that is Overlooked",
        "review_detailed_main": "It is surprising how funny To Be or Not to Be actually is. It does not make a mockery of ALL Nazis seeing that the main villain is smart and cunning, but it does make buffoons out of the high command or enlisted Germans who follow orders blindly without questioning the logic behind the orders. The Germans who are fooled are fooled by nothing other than an acting troupe with Jack Benny at the helm, showing the Germans as buffoons who take in information at face value.\n\nAs the movie begins, the audience laughs at the ridiculousness of the acting troupe performing as the high command under Hitler's third Reich. This comedy is interrupted by a soldier becoming infatuated with Tura's (Jack Benny) wife to the point where he thinks they will have a future together. This relationship finishes setting up the first act, and the audience regains the gift of comic relief when it is the acting troupe who must save Tura's wife and bring down Hitler's high command as their identity is nearly compromised.\n\nThe humor in the film has a wide range. At times it consists of Jack Benny complaining, but mostly the humor deals with the dramatic irony that the German command is unaware of the acting troupe's true identity. The troupe moves along with its plans with great ease as most Germans take them as fellow Germans and do not see past the costumes. Making the Germans puzzled is almost as wacky as watching a Marx Brothers movie, but it is not exactly the same type of humor since the Marx Brothers deal with rapid-fire jokes and physical comedy such as matching action to make characters believe they are looking into a mirror. In the case of To Be or Not to Be, the actors lead the Germans to believe they are dealing with officials, creating a similar illusion to the \"mirror\" antics of the Marx Brothers.\n\nAn interesting notion of this film is that it was made at the time of the war, but does not induce fear of the enemy (Nazis) at any time during the film. Showing that the enemy can be imitated, and that, in fact, Hitler is \"just a man with a little moustache,\" it illustrates how little people had to worry about the enemy at that point in time by portraying the enemy as buffoons, not unlike Chaplin's The Great Dictator.\n\nTo Be or Not to Be is a great, overlooked World War II comedy, and while it may not be up to part with The Great Dictator, it deserves more attention.\n\n3.5/4.0"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "mandy-174",
        "review_rating": "10",
        "review_title": "To Be or Not To Be is a satire on Hitler and the Nazis.",
        "review_detailed_main": "To Be or Not To Be is revelatory insofar as Jack Benny's acting skills. He is consistently hilarious and it is amusing to see the beginnings of techniques, facial expressions and comic timing used to such great effect later in his career on television. The movie is laugh-out-loud funny, while still carrying some important social and political messages. While the film might have been thought tasteless at the time, it certainly is hilarious today.\n\nI didn't understand the Hitler/cheese joke. Can anyone explain it to me? Or is it just supposed to be nonsensical, with no particular meaning attached? M"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "I_Ailurophile",
        "review_rating": "9",
        "review_title": "Smart, superb, funny classic",
        "review_detailed_main": "There are only two things to do with fascists, and though the alternative is more assuredly permanent, mocking them into oblivion is a fine choice. Gratifyingly, the latter is the path chosen in 'To be or not to be,' as Nazis are turned into a laughing stock with a stupendous screenplay, and with Ernst Lubitsch's dependably impeccable direction. The dialogue is outstandingly sharp and clever, and characters vivid and lively. Scene writing and the overall narrative alike are as carefully penned as they are brilliantly realized, entertaining and engaging through and through. And the cast is most excellent from top to bottom, bringing their roles to life with wonderful personality, range, and nuance - yet bent all the while toward the picture's slick amalgamation of wartime spying and provocative comedy. At one turn or another the picture may emphasize dire violence and destruction, espionage thrills, or robust humor - or sometimes a combination thereof - yet it's all rolled together so well that the result feels extraordinarily balanced as a whole, and fabulously enjoyable.\n\nJack Benny and Carole Lombard are masters of their craft, deftly adapting to every requisite shift in their characters as scenes demand. That they were cast in the lead roles is no mistake, yet they are hardly alone in their terrific vigor. Given slightly less prominent parts, the likes of Sig Ruman, Henry Victor, Lionel Atwill, and Stanley Ridges round out the picture with portrayals of marvelous spirit and intelligence. Still, for whatever practiced abilities the assembled actors bring to the feature, Lubitsch's guiding hand as director is not to be counted out. The tremendous skills the filmmaker developed during the silent era, orchestrating hearty and potent scenes to capture the imagination without any sound, are employed here to get the most out of every little detail. And there's surely much of it to go around here, with attentive costume design, set design and decoration, and hair and makeup, and swell filming locations, all quite suitably complementing the nuances in the acting and the flourishes in the writing.\n\nAs great as this is, I don't think it's entirely perfect. I can't entirely put my finger on it, but there's part of me that just feels like 'To be or not to be' should be more actively absorbing than it is, and still more funny. Maybe the equilibrium between the varied elements of the screenplay is a little off? Maybe it's just a little too tricky to make the worst people in the world into this much of a farce? Admittedly, I may be nitpicking: for whatever subjective deficiencies one may perceive, this is roundly solid, a farce that sagely restrains itself just enough to refrain from joining the absurdist ranks of the Marx Brothers, Monty Python, and the like. All involved put so much great care into their contributions to lampoon all too real villainy, and provide healthy laughs and strong entertainment when it was needed the most. Acknowledging Mel Brooks' remake that followed 41 years later, I think Lubitsch's 'To be or not to be' remains such a soundly splendid romp that it remains well worth seeking out even 80 years hence. The best of cinema endures no matter the time, and this is definitely one such instance. Highly recommended!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "writers_reign",
        "review_rating": "8",
        "review_title": "A Fellow Of Infinite Jest ...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "alc01",
        "review_rating": "10",
        "review_title": "The best one - -",
        "review_detailed_main": "Most people have seen Mel Brooks remake of this movie, so it is like watching Jack Benny doing Mel Brooks. It was clearly the best movie or performance Jack ever gave - all of his radio, television and movie works combined - HE IS GREAT! Of the two movies, Jack beats Mel hands down, but had it not been for the remake most people would never have know about this one. The death of Lombarde right after this movie caused it to almost become totally lost - a shame as she is great here as well. This is a must see for many reasons - Jack, Carol, the laughs and the tears."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bobsgrock",
        "review_rating": "7",
        "review_title": "A very dark and somewhat non-comical comedy.",
        "review_detailed_main": "By no means is this movie not funny at all, but it is by all accounts perhaps the most serious movie Ernst Lubitsch ever made. Taking place in Poland during the \"Blitzkreig\" of 1939 that jump-started World War II, there is much more satire than screwball in this story, and I have to admit I didn't laugh nearly as much as in Ninotchka or even Trouble in Paradise. Of course, it could be possible Lubitsch wasn't going for the witty laughs. Rather, it seems he was trying to make a serious film about a serious time all the while poking fun at the enemy at the same time.\n\nThe cast is very good with the beautiful Carole Lombard leading the way in her final role before tragically dying in a plane crash. Jack Benny is rather obnoxious in his role as a hapless Shakespearean actor married to Lombard, but doesn't realize she is having an affair with a soldier he needs to help defeat the Nazis. The story takes many turns that are far too unbelievable especially in scenes about the Nazis and the ending. Still, for fans of Lubitsch, it is possible to see his beautiful touch on this story even if it is murky with so much war dribble."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jellopuke",
        "review_rating": "10",
        "review_title": "All-time classic!",
        "review_detailed_main": "Very funny, bitingly satirical, suspenseful and well written. Still holds up today and must have been mind blowing in 1942!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "agonist",
        "review_rating": "8",
        "review_title": "A Bold Movie-- and Wonderfully Funny",
        "review_detailed_main": "To make a comedy in 1941 about Nazis in Poland--complete with references to concentration camps--during the midst of the most violent war the world had ever seen strikes me as being an exceptionally daring adventure to have undertaken.\n\nThis could easily have been a disaster but sharp writing and the hilarious performances of Jack Benny as a hammy/Hamlety actor, Sig Ruman as the quintessential bumbling Nazi officer, and Carole Lombard as the leading lady stuck in the middle elevate it to the sublime.\n\nThis is a movie for anyone who appreciates smart, funny movie making from the era of classic cinema."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "SmileysWorld",
        "review_rating": "8",
        "review_title": "Great timely satire.",
        "review_detailed_main": "We needed laughs in 1942.What better thing to laugh at than the thing that was causing us the most tension at the time,World War II? The production of this film came at a very contentious time,and it paid off.The finished product is one to behold if you like to laugh.While the content being satirized may be dated,the humor is timeless.The only downer,I suppose,at the time was the loss of the film's star,Carole Lombard in a plane crash in January of 1942,well before the film's release.This no doubt put a damper on the film's humor for the audiences of the time,so it had to recover from this setback over time.That it has,and it is a must see comedy classic."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "muray",
        "review_rating": "10",
        "review_title": "The greatest scene stealer",
        "review_detailed_main": "\"To Be Or Not To Be\" was one of the greatest films made during World War II. Jack Benny and Carole Lombard were perfectly cast, however my vote goes to the greatest scene stealer of them all, Sig Rumann, in the role of \"Zo They call me Concentration Camp Erhardt?\""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "richard-1787",
        "review_rating": "10",
        "review_title": "A remarkable movie",
        "review_detailed_main": "Actors and actresses are remembered for their performances of the great classics, in anglophone culture usually Shakespeare. And yet, as many an actor has said, the only thing harder to do than great tragedy is great comedy.\n\nAnd the only thing harder than that is a convincing mixture of both.\n\nAnd that is what this movie is.\n\nThere are a lot of Lubitsch comedies that I can watch over and over, especially those he did with Jeannette MacDonald and Maurice Chevalier. It mixes the most serious tragedy with the cleverest comedy, taking you from one to the other flawlessly.\n\nThere is nothing funny about Felix Bressart's delivery of Shylock's speech; his character has every reason to believe he may be killed by the gestapo. It is deeply moving.\n\nYet there is nothing funnier than when a young man walks out on Joseph Tura's/Jack Benny's \"To be or not to be\" soliloquy.\n\nI've seen this movie several times. I marvel at it every time. It is by turns deeply moving and wonderfully funny. It is, indeed, one wonderful movie."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "wes-connors",
        "review_rating": "9",
        "review_title": "Fascism Is a Farce",
        "review_detailed_main": "It's August 1939 in Warsaw, Poland. A theatre group led by popular stage actress Carole Lombard (as Maria Tura) and her hammy husband Jack Benny (as Joseph Tura) rehearse their funny Nazi play \"Gestapo\" – eventually, they're ordered to cancel the comedy due to the risk of offending Adolph Hitler, the German dictator then invading countries and disposing of their Jewish citizens in concentration camps. However, they are allowed to continue performing Shakespeare's \"Hamlet\". During the performance, Ms. Lombard agrees to meet handsome young fan Robert Stack (as Stanislav Sobinski), when Mr. Benny begins his soliloquy \"To Be or Not to Be\u0085\" A bomber for the RAF, Mr. Stack fancies himself in love with Lombard. She enjoys the attention, but warns Stack she is a married woman. When Hitler invades Poland, Stack returns to Britain. There, he discovers a plot to exterminate the Warsaw resistance. Stack parachutes to Poland and involves Lombard, Benny and their theatre company in an effort stop the Nazis...\n\nDeftly directed by Ernst Lubitsch, \"To Be or Not to Be\" was unusual in that it treated the Nazis in a farcical manner. Funny Nazis during World War II did not amuse everyone. Echoing this film's repeated \"Heil Hitler!\" salute, the popular TV series \"Hogan's Heroes\" was criticized for finding humor in the subject – three decades later. Also a downer, Lombard tragically died in a plane crash before this, her last film, was released. Her performance is marvelous. Standout co-star Benny and everyone involved can count \"To Be or Not to Be\" as a career peak. In 1983, the film received a high profile re-male by Mel Brooks' company. While not superior to this version, Mr. Brooks' film was quite enjoyable. It did correct a minor flaw in this version – plot transitions aren't always smooth. For example, Stack appears in Lombard's bed after a long run around Warsaw; without a clue about what is happening, we see her take over his mission. By all means, see both versions – but start with this one. Laughter is still the best medicine.\n\n********* To Be or Not to Be (2/15/42) Ernst Lubitsch ~ Carole Lombard, Jack Benny, Robert Stack, Sig Ruman"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "mike48128",
        "review_rating": "10",
        "review_title": "A True Classic in Every Respect. Yes, Jack Benny Can Act!",
        "review_detailed_main": "I ran into this little film on TCM and spent a good hour finding a reasonably-priced copy on the Internet (WB-2005 slightly used). The Mel Brooks 1983 remake is not as good as the Lubitch 1942 original. A poor Jewish thespian troupe in Poland struggles to continue it's meager livelihood by producing plays, but The Nazis take over Poland and blow up the entire neighborhood. A brilliant mixture of comedy, satire, and melodrama which includes a love triangle between \"ham\" actor Josef Tura (Jack Benny) his actress wife Maria Tura (Carole Lombard) and a Polish RAF flier (Robert Stack). The classic line: \"Tura is doing on stage what Hitler is doing to Poland\". Throw in a fanatically-crazy Nazi spy, stupid, bumbling Germans and a bit of cloak-and-dagger action and you have quite a unique production. Probably the inspiration for \"Hogan's Heroes\" decades later. While the real Hitler is waiting for the play to begin, the fake Hitler causes a riot, and the entire madcap cast hijacks the \"Fuhrer's\" car and airplane and escapes to Scotland. It's both a screwball comedy and a serious comment on the Nazi menace, as it was filmed in 1941, during the war. For the full (and complicated) plot synopsis, go to TCM.com and \"Google\" the title. Jack Benny plays his finest movie role of all time and it is Carole Lombard's last film, as she died tragically two months later in an airplane crash near Las Vegas. The running gag: Every time Tura (Jack Benny) recites Hamlet's famous \"To Be or Not To Be\" soliloquy, somebody in the audience gets up and leaves."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "kenjha",
        "review_rating": "9",
        "review_title": "Lombard's Curtain Call",
        "review_detailed_main": "An acting troupe joins the resistance movement in Nazi-occupied Poland. This is a scathing farce masterfully directed by the incomparable Lubitsch, one of the earliest anti-Nazi films. It's hard to watch this without thinking about Lombard's tragic death soon after filming was completed. She shows for the final time why she was one of the premier comediennes of the silver screen, delivering laughs with her uncanny timing and delivery. Benny has the role of his career as the hammy actor whose love for Lombard is exceeded only by his love for himself. Lubitch not only provides sparkling comedy but also adeptly executes the action scenes."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "diya-dutta",
        "review_rating": "9",
        "review_title": "Hamlet in Holocaust !",
        "review_detailed_main": "This is perhaps one of the greatest Satire movie I've ever seen on this war genre. Jack Benny was hilarious and superb in this movie, and not to mention about the great work of the director who succeeded in kept you anticipating through out the movie without any chance of taking eyes off. The only sad parts I came to know that the Star couple of this movie as played Mr & Mrs Taura expired even before the Premiere of this movie.\n\nThis one is a very old classic but wont appear to be slow or boring at any point of time during the play.\n\nI highly recommend viewers with a taste for World War or Holocaust to go for a change and enjoy this Satire which you wont regret ever."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Quinoa1984",
        "review_rating": "10",
        "review_title": "the dark and light of the Nazis and theater, with Carol Lombard!",
        "review_detailed_main": "To Be or Not to Be is a film that carries the real horror and dread of Europe facing the threats and devastation of Hitler and the Nazis, and never forgets that, but is also a light, screwball comedy about the art of performance and the enjoyment we all get knowing someone is getting something over on another guy. Lubtisch's filmmaking and comic timing moves like a precise slab of butter (if that's a weird analogy), smooth and on point all the time.\n\nIt follows a Polish theater company that see a the Germans invading, bombing their town, and the two stars of the company played by Jack Benny and Carole Lumbard, embroiled in a plot with a Nazi-leaning professor and even going up to Hitler himself. Nevermind they don't have Polish (or even most German) accents, they don't bother pretending on that front ironically considering the trickery on hand. This is meant to be a piece of world war two theatricality that can and does endure because it deals with showmanship, actor ego (from Benny with his Hamlet to the side characters trying to get Shylock just right) and playing a character as it's main focus (if there's any modern film that owes It's debt to Lubitsch and how people put on ruses in such high stakes it's Inglouious Basterds, down to a climax in a theater full of Nazis).\n\nAnd as funny as Jack Benny is, especially when his character reacts to that dear of a bomber pilot who has the hots for Carole Lombard, I think Lombard really makes this even better than expected. She's exquisite, ferocious, precocious, sexy, and yet terribly serious about her craft and the people she loves, plus the theater itself. You see just charm and grace radiating off her, and yet she completely gets how to make Mary always reacting and figuring things out. Benny is the big wonderful goof of the movie, while Lombard is the star.\n\nIts sublime entertainment and I only regret not seeing it sooner; Mel Brooks made a remake in the 80s which is good but nowhere near the impact of this picture. Just the scene with the Germans marching into town and Lubitsch's cut aways to the citizens looking on in shocked-but-passive disbelief makes it a must see alone."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "amplexuslotus",
        "review_rating": "10",
        "review_title": "Deft Delightful & Dangerously Hilarious Nazi Satire",
        "review_detailed_main": "No one else but Ernst Lubitsch could have made To Be or Not to Be. That it's superb and sublime and witty and ingeniously funny cannot be emphasized enough. The film has a great script, direction and cinematography (Rudolph Maté).\n\nWhile the entire cast shines, Lombard and Benny are absolutely stellar. It's a shame that Benny did not get matched with similarly genius director post-TBONTB is a real shame because with the right director and script he could have gone on to be a film star. Perhaps the fact that much of the story takes place in a theatre and then on the many theatre troupe's \"stages\" as they foil the Nazis throughout the story, nurtured Benny's own natural unique comedic talent in a way that his other films could not.\n\nAnd then there's Lombard. Carole Lombard was and still is imho, the best comedic actor other than Chaplin-Lloyd-Keaton-Dressler-Stanwyck. I don't find that the comedians of today can even come close to the previously mentioned comedians. Lombard and Benny play the most perfectly narcissistic clever power-couple seen anywhere in film or real life. That this was Lomabrd's final film before her tragic death (plane crash during a war bond tour) is sad for all of us. Her seduction of the dashing young Robert Stack's Lt. Sobinski and the evil double-agent, Professor Siletski (Stanley Ridges)is wonderful to watch. The petty banter between the egomaniacal husband and wife acting team, the Turas (Lombard and Benny) is equally delightful. Also worth mentioning is Lombard's maid, Anna (Maude Eburne) who has some great lines like, \"What a husband doesn't know won't hurt his wife.\"\n\nWhile audiences in 1941/42 may not have been able to appreciate this satire,it's worth noting that Roberto Benigni's film Life Is Beautiful (which has a higher IMDb rating) was also criticized for mixing humor in a story about the holocaust when screened at Cannes in 1997. Some people were outraged that Benigni would include comedy in the concentration camp scenes. But the film went on to win several top awards.\n\nAnother film which comes to mind mixing war/genocide with comedy in a very skillful way is Arthur Penn's, Little Big Man (1970-based on a novel of the same name by Thomas Berger). I don't know if there were any criticisms of comedy being used in a movie about the genocide of Native Americans but in my opinion, Little Big Man, although a different style than TBONTB, is a superior comedy about a very serious and tragic time in America's history.\n\nI believe these knee jerk reactions to films which show or allude to barbaric shameful historic events are without merit. For it's art which brings light to not only these man-made horrors but illuminates the beauty and power of the human spirit.\n\nLubitsch's To Be or Not to Be should not be over-looked. It's one of the finest examples of comedy from any era. Plus you get to watch Lombard and Benny at their most sublime."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Tender-Flesh",
        "review_rating": "10",
        "review_title": "Heil Myself!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "gavin6942",
        "review_rating": "8",
        "review_title": "Powerful Timing",
        "review_detailed_main": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.\n\nErnst Lubitsch writes, produces and directs this satire of Nazi Germany. Putting it alongside Charles Chaplin's \"The Dictator\", this is a very powerful film because of its timing. Released in 1942, at the height of World War II, when anyone could have won... very brave to make a film of this sort.\n\nLubitsch, a man who inspired the likes of Billy Wilder and Mel Brooks, never had his equal. Perhaps not the most well-known creator, he ought to be. With films like this, he was a true treasure."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "claudja777",
        "review_rating": "10",
        "review_title": "Impossible not to love it",
        "review_detailed_main": "If you still think someone could not be invested by the modernity of this captivating gem from Lubitsch and his famous touch I have the Final proof.I showed this movie last week to my mother who came at my place without anyone inviting (eheh..I'm kidding..as well as she pays..she can come!!:P),she is reportedly ignorant about movies (especially GOOD movies) but she completely fell in love with this one.She stole my DVD and she told me she's gonna show it to all her friends,and I'm so angry that I'm not gonna see this scene cause I bet it's gonna be awfully funny.\"high-bourgeoisie housewives\" vs Lubitsch,oh men,I wanna be there...:)))If they're gonna like it too,This movie could be definitely considered as a miracle:))))"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "chasser65",
        "review_rating": "10",
        "review_title": "hilarious",
        "review_detailed_main": "hilarious!!! what a film, satire at its very very best, laughed almost from start to finish, brilliant scene where Joseph Tura is impersonating Dr Siletsky and walks into the living room of the Nazi officer to find the body of the real Siletsky lying dead in the chair!!! so cleverly done, shame they don't make them like that any more!!!! how this is not in the top 250 films is beyond me, i would advise everyone to get hold of this film and see it as soon as possible. tragically Carole Lombard died before this film was released and for me this is one of her best, so everyone who agrees with me get online and get this timeless classic back into the top 250!!!"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "shuichik-91691",
        "review_rating": "10",
        "review_title": "I had a deep emotion to meet the movie.",
        "review_detailed_main": "I watched the movie at the age of 20. The story of movie is elegant, humorous and precious. But I noticed some important. It was the things that the movie had the satire. When i had watched the movie, i was surprised the satire. This movie had love, drama and dispute. I really love the movie !"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "dimplet",
        "review_rating": "10",
        "review_title": "Age becomes this little gem shot in 1941",
        "review_detailed_main": "With topical movies, timing can be everything.\n\nWith \"To Be Or Not To Be,\" there was good news and bad news. The good news was that it was written and produced in 1941, before America entered the war following the Japanese sneak attack on Pearl Harbor on December 7 (but after the Sept. 1, 1939 invasion of Poland -- which, unlike some European countries, put up a brave fight). The bad news was it was released shortly after, in early 1942, when Americans, now facing the barrel of German weapons, did not find the Nazi menace so amusing.\n\nThe New York Times movie review by Bosley Crowther (who usually was on the mark) found the humor of questionable taste, saying there was too much Jack Benny in the role:\n\n\"But it is hard to imagine how any one can take, without batting an eye, a shattering air raid upon Warsaw right after a sequence of farce or the spectacle of Mr. Benny playing a comedy scene with a Gestapo corpse. Mr. Lubitsch had an odd sense of humor—and a tangled script—when he made this film.\"\n\nBut without Benny it would have been a different movie, and, frankly, too somber and sad to be bearable, at least today. If it had been released before Pearl Harbor, the reviewer might have found Benny perfect for the role. And if the movie had been released in 1943 or 44, it might have been viewed as a brave defiance of Nazi might, and just the thing to lift spirits and boost morale.\n\nTo watch old movies is to be faced by a quandary. Back before television resale rights or DVD revenue, it was make or break based on ticket sales, so an average director's first priority was to contemporary audiences. To appreciate an old film, it helps to understand the times of the contemporary audience, in this case, the outbreak of WWII.\n\nBut a great director like Ernst Lubitsch probably was not just thinking about \"today\" when he made the film; presumably, he was thinking about the audiences of tomorrow, when the war was long over, won or lost. \"To Be\" is also a message in a bottle to the future.\n\nHere is what director Peter Bogdanovich had to say:\n\n\"For Lu­bitsch, the Nazis' most damning sin was their bad manners, and To Be or Not To Be survives not only as satire but as a glorification of man's indomitable good spirits in the face of disaster – survives in a way that many more serious and high‑toned works about the war do not.\"\n\n(Lubitsch's influence extends far beyond Mel Brooks, according to Bogdanovich's essay, to Hitchcock, Billy Wilder, and essentially all of modern Hollywood. To understand this film is to see why.)\n\nToday, the movie seems to have the right balance of humor and pathos, and to work on many different levels. Today, we can laugh at \"Mr. Benny playing a comedy scene with a Gestapo corpse.\" But it works best if you understand the times, The War. What most people today know about World War II they learned from watching movies. And so they see \"To Be\" within the memory matrix of other movies.\n\nWhat you need to do is study the history of World War II, watch some of the fine documentaries, read about it, in books or online. We have all heard about \"concentration camps.\" In 1941 concentration camps like Auschwitz were not yet used to implement the Holocaust, but to punish German political prisoners and for victims of countries invaded by Germany, like Poland. My grandparents were not picked up by French authorities and sent to Auschwitz until 1943. It is sad that some people in Europe are so ignorant of their own history. **\n\nFrom the Wikipedia article on Auschwitz:\n\n\"The inmate population grew quickly, as the camp absorbed Poland's intelligentsia and dissidents, including the Polish underground resistance. By March 1941, 10,900 were imprisoned there, most of them Poles.\"\n\nIf you understand history you will understand the deep sadness hidden by a smile in \"To Be.\"\n\nFootnote: About 25 minutes before the end, the camera shows a list from the appointment book of Col. Ehrhardt. 10:30 reads: Maria Tura. 10:45 reads: Schindler.\n\n\n\n** I wish to extend my sympathy to any student foolish enough to take Dr. Jacques Coulardeau's classes (which I certainly hope are not in history or geography or film) at the Sorbonne, or wherever he actually teaches.\n\nDr. Coulardeau, in his review, asks a truly bizarre question: Why, if the Allies knew about the concentration camps, didn't they stop the \"massacre\"? Dr. C.: Maybe it had something to do with the concentration camps being inside Germany and occupied Poland, and Germany wasn't issuing tourist visas to American soldiers.\n\nI would like Dr. Coulardeau to explain why French officials collaborated with the Nazis in sending French citizens, including my family, to their deaths in concentration camps? America didn't start WWII, but it was American troops, not French, that ended the Holocaust."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jboothmillard",
        "review_rating": "8",
        "review_title": "To Be or Not to Be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "preppy-3",
        "review_rating": "10",
        "review_title": "Excellent comedy",
        "review_detailed_main": "1939: the Nazis invade Poland. Joseph Tura (Jack Benny) and his theatrical troupe fight them. That's the bare bones--there's a lot more but see the movie to find out. A very intricate, funny script and excellent performances keep this going. Benny is funny in the lead, but Carole Lombard is letter-perfect as his wife. Also it's fun to see Robert Stack so young and handsome with gleaming white teeth as a lieutenant helping them. Some may find it hard to laugh at considering the subject matter (the film was a bomb in 1942), but it works."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Petey-10",
        "review_rating": "10",
        "review_title": "Jack Benny, Carole Lombard and one giant headache",
        "review_detailed_main": "Varsaw 1939.Second Worldwar is on its way-and so is Hitler.Jack Benny and Carole Lombard play actors Joseph and Maria Tura-and yes, they're married.Joseph has got also another problem that has nothing to do with the Nazies.He thinks his wife is cheating on him.Maria has told the young Lt. Stanislav Sobinski (Robert Stack) to come to her after her husband starts the monologue of Hamlet.Ernst Lubitsch is the director of To Be or Not to Be from 1942.It's awfully funny in many parts.When the magnificent, and Jewish comedian Jack Benny does a Nazi, it's just hilarious.Sure it has got some drama too, because of the war topic.This was the last movie of the glorious Carole Lombard before she died in an airplane crash.She was too young to go.It's been 65 years since this picture was made and a lot has happened in that time.There is no Adolf Hitler anymore and the world lives in peace.Do we? Sadly there will probably always be wars.But luckily there are those fine comedians to make it all better.The darkest matters can be turned into something funny.Another fine comedian Mel Brooks starred a new version of this movie in 1983.That was also hilarious in many parts.Thank you for making us laugh, comedians."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ackstasis",
        "review_rating": "8",
        "review_title": "\"What he did to Shakespeare, we are doing now to Poland\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "doorholder",
        "review_rating": "8",
        "review_title": "that is the preoccupation",
        "review_detailed_main": "I wasn't familiar with Jack Benny going into this movie, other than his rep that said he couldn't cross over into film. I don't really see why, I thought he was quite capable and had a command of guises and disguises that weren't dissimilar from someone like Sacha Guitry. There can also be a connection made to Preston Sturges, with all the madcappery going on that still feels just as vital today. Some of the jokes could very well be inserted into an episode of The Simpsons and viewers wouldn't bat an eyelash. I loved seeing Robert Stack show up as a dippy flingy paramour. I think what impresses me most with To Be Or Not To Be is the sense of play throughout, and not just onstage. There are matters of love, life and death that are treated most often as debonair or romantic whimsy. A farce about humanity's greatest threat. IN YOUR FACE, Hitler"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "zzhhhqing",
        "review_rating": "8",
        "review_title": "is this era progressing or regressing?",
        "review_detailed_main": "Despite the fact that the plot is full of holes, it does reach the peak of traditional comedy in many details. What is particularly enviable is that Liu Bieqian, a German, was able to mock the Nazis on the screen at that time without worrying that he, his family and friends were being pursued and persecuted by the Nazis around the world. So is this era progressing or regressing?"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "cafescott",
        "review_rating": "8",
        "review_title": "Carole Lombard and Other Points of Interest",
        "review_detailed_main": "***User reviewer theowinthrop (\"Swan Song in Warsaw\", theowinthrop from United States, 12 November 2005) has an interesting review that covers most of the bases which follow here.***\n\n\"To Be Or Not To Be (1942, Ernst Lubitsch)\", a comedy about the Nazi invasion of Poland, is worthwhile escapism. It is a product of the time it was made. Completed in 1941, the producers withheld it from release until the US was at war with Germany. When it was being made, the US was still neutral regarding the conflicts raging in Europe. So the Nazi subject matter (e.g., many digs at Adolf Hitler, the references to concentration camps, the Gestapo, etc.), was fairly new to Western audiences. There is a strong propaganda element throughout, and the leading actors are handicapped by the need to kiss up to the Allies while demonizing the Axis powers.\n\nThis film may have inspired \"Hogan's Heroes\" which arrives 25 years later. For both, the Germans are easily defeated. \"Hogan's Heroes\" also has a Colonel Schultz who is particularly dim-witted.\n\nEven though the Saturday crowd was laughing out loud, many of the gags seem pretty antiquated today. What makes \"To Be Or Not to Be\" enjoyable is the performance by the three principal leads. Also, the Edwin Justic screenplay is energetic.\n\nIn the tradition of 1930s screwball comedies, Robert Stack as Lieutenant Stanislav Sobinski is a very handsome young man in pursuit of love but inexperienced at it. He is more than a capable bombardier and soldier, but love is a more difficult battle altogether.\n\nJack Benny's Joseph Tura, a pompous actor obsessed with his wife's presumed infidelities, is quite brilliant. Even though Tura repeats himself frequently, Benny has the skill to keep it interesting. Benny might have become a clown to rival Bob Hope if he had made more films. However, for many reasons Carole Lombard (as Maria Tura) is obviously the main attraction here.\n\nLombard did not live to see this film released. She was killed at age 33 while flying to a war bond rally. Her departure was a terrible loss for world cinema. Not only is Carole Lombard breathtakingly beautiful, she is vastly talented. She excelled in comedic repartee. Her Maria Tura thinks very fast on her feet while captivating throughout. Carole Lombard was an elite performer during the fabled Golden Era of Hollywood.\n\nCinephiles will enjoy \"To Be or Not to Be.\" Just don't board an aircraft with an unpressurized cabin getting to the revival theater showing this."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ricatheater",
        "review_rating": "10",
        "review_title": "An Incredible Achievement",
        "review_detailed_main": "One must wonder what kind of an idiot Bosley Crowder must have been to critique this film in the way he does - you can read his review in Metascore section - This film is an absolute classic and pleasure. It wonderfully conceived and performed. This what they meant by \"The Lubitsch Touch!\""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "ssssgelojun",
        "review_rating": "8",
        "review_title": "To be or not to be",
        "review_detailed_main": "The movie looks lighthearted, but it doesn't feel frivolous. On the contrary, the play is rather heavy. The director USES a lot of black and white footage of what happened after the Nazis bombed Warsaw: rubble and destruction everywhere. The city, built in 300 years, was destroyed in three weeks. Jews were forced to sew discriminatory pentameters on their clothes, while homosexuals were sewn with pink triangles. Ironically, Anne's makeup artist used the sign to identify other gay people and spent the night on dates, an act of Nazi discrimination that came at an unexpected convenience."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "arieliondotcom",
        "review_rating": "9",
        "review_title": "To Be Treasured and Not To Be Missed!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "nomoons11",
        "review_rating": "8",
        "review_title": "Have you seen The Great Dictator or The Producers? Watch this and you'll see where they got the idea",
        "review_detailed_main": "This one is just one funny farce all the way through. Doeesn't hurt Jack Benny is as good as he's ever been on film. To me this was his film. Lombard is in this a lot but she's not near as good as Jack Benny.\n\nThis film is about 90% comedy and 10% serious. The opening scene comes up and immediately you start to see where Charlie Chaplin and Mel brooks got their inspiration. They got it from a fictitious Polish acting troop trying to put on a farcical play about Hitler (of course Mr. Brooks remade this but it's not in the same league).\n\nNot a lot has to be said about this, you just have to watch it and see. An all around funny film. I can see why it has high user ratings in here. Really good stuff."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "fntstcplnt",
        "review_rating": "8",
        "review_title": "To Be or Not to Be (1942)",
        "review_detailed_main": "Directed by Ernst Lubitsch. Starring Jack Benny, Carole Lombard, Robert Stack, Stanley Ridges, Sig Ruman, Lionel Atwill, Felix Bressart, Tom Dugan, Henry Victor, Charles Halton, Maude Eburne.\n\nFirst-rate farce, augmented by astute satirical and black comedy elements, was a dangerous proposition at the time of its release when the world was at war, tensions were high, and funny bones were invulnerable to elbow nudges. \"Great, great Polish actor\" Benny, his even more famous actress wife Lombard, and the rest of their theatre troupe get involved in a spy masquerade in Nazi-occupied Warsaw. Stack is the Polish aviator sweet on Lombard, Ruman the bumbling colonel, Dugan as the führer (but not really) in one of the movie's better gags. Has hardly aged a day, and even though some of the set-ups are overextended, there are no shortage of laughs. Mockery of ideology is a potent weapon, indeed. Final film for Lombard, who died in a plane crash shortly before the film was released.\n\n82/100"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "martinpersson97",
        "review_rating": "10",
        "review_title": "Masterful war, drama, comedy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "TheFearmakers",
        "review_rating": "10",
        "review_title": "Hilarious, Subtle & Suspenseful",
        "review_detailed_main": "Ernst Lubitsch takes a complicated plot and with an easygoing acting style of the performers under tightly-wound direction, headed by Jack Benny and Carole Lombard, it flows from beginning to end as the ups and downs, curves, twists and turns provide both subtle humor and edgy suspense, centering on a group of stage actors in Poland before and during the Nazi takeover on the boot-heels of World War II...\n\nThey must trick their antagonists into thinking Benny... who plays a hammy actor (exactly the opposite of himself)... is a scientist who's a traitor to the good guys and... well it really doesn't matter because TO BE OR NOT TO BE has to be seen and concentrated on for the plot to make clear and interesting (as well as intriguing) sense...\n\nMore or less a con artist caper movie, and unlike the Mel Brooks remake, the Germans, while not brilliant, are genuinely imposing to instill enough danger for all the verbal laps to matter beyond hitting punchlines at the right moment...\n\nAlthough everything does rely on the actors-within-the-movie hitting their own marks for the ruse to work, hence the title taken after a pivotal line from William Shakespeare's Hamlet that, if spoken by a novice stage performer, can hinder the entire show...\n\nThe fun's watching Benny trying to outdo his character's own lack of talent (scenes with German actor Sig Ruman work splendidly, as with Tom Dugan, who plays a fictional Hitler) while Lombard is the real trickster, weaving in and out of both the bad guys and a handsome young lieutenant Robert Stack (whose role is played by Tim Matheson in the Brooks remake, and both starred in another WWII comedy involving romance in a bomber plane, Steven Spielberg''s 1941)...\n\nIf anyone on board has the most work, it's Lombard... in what's sadly, tragically, her last picture."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "lasttimeisaw",
        "review_rating": "8",
        "review_title": "A double bill review with Mel Brooks' remake",
        "review_detailed_main": "An enthralling and ebullient double bill of two versions of TO BE OR NOT TO BE, Lubitsch's Black & White masterpiece, also famous for being Carole Lombard's swan song before a plane crash brought her away from this world at the prime age of 33, and Mel Brooks' (almost) faithful color remade (although the director title falls on the head of his longtime collaborator Alan Johnson) starring him and his wife Ms. Bancroft.\n\nIt is the same story being transcribed under two different palettes, the remake owes its tongue-in-cheek drollness greatly to the screenwriter Edwin Justus Mayer of the 1942 version since many one-liners are copied verbatim, both versions are abounding with witty caricatures of Hitler and his Nazi regime, embellishes a tall order in the wartime Warsaw with conspicuous burlesque, a Polish acting troupe's collective endeavour to hunt down a German spy and a subsequent flee from war zone to England, during which a crucial tool is that our hero, the ham actor Joseph Tura (Benny) / Frederick Bronski (Brooks), has to playact different characters, from the spy professor, a Nazi colonel and even Hitler himself (in the remake), to bluff his way out; meanwhile he is also vexed by the budding romance between his actor wife Maria (Lombard) / Anna (Bancroft) and a young aviator Lt. Sobieski (Stack) / Lt. Sobinski (Matheson).\n\nBut there are also apparent differences which can bear out why Lubitsch's original is a much better piece of work, taking the opening sequences for example, Lubitsch starts with a voice-over narrating an unusual happening in Warsaw before WWII, Adolf Hitler is spotted on the street, then a following revelation reveals that it is after all an act, Hitler is played by a character actor who tries to test his resemblance by walking among the mass, what a pleasant surprise! But in the remake, Mel Brooks doesn't adopt this route, instead, he opens with a vaudeville number SWEET GEORGIA BROWN with Bancroft, a fairly impressive stunt but fails to match Lubitsch's ingenious gambit, later audience will discover, one main reason behind this alteration is that there is no role of the character actor who resembles Hitler in this version, as Brooks himself will disguise as Hitler in the final escape scam, so probably it is a sacrifice to fulfil Brooks' own ego to enlarge his part as the star.\n\nFor most part, the silver-screen magnetism of the original is beguilingly outstrips the remake's more mundane touch, and being a well-intended fairytale, the mundane touch is unfortunately an impediment particularly in the elongated escape plan, the entire operation feels preposterous with the all the chase (don't let me start on the doggie Mutki's eleventh- hour jump) and what happens to the real Hitler in the theatre, he doesn't feel absurd when clearly no actors are on the stage to perform? In the original, this passage is fast-paced with a whimsical take of the fake Hitler ordering two pilots to jump off the plane without parachutes, to mock Nazi's blind obedience.\n\nWith all my respect to Brooks and Bancroft, but in the remake, they are just too old for their roles, egregiously jarring is Brooks as young Hamlet in his ridicule titular monologue, seriously? I don't consider myself as an ageist, but this is more than a farce to swallow. Bancroft is two-and-a-half decades past her prime as a seductress in THE GRADUATE (1967, 8/10), her comedic bent can never pass beyond the slinky postures. OK. we get it, it is a family business, let the profit kept within one's own turf. However, a big thumb-up for the remake to introduce an openly gay character Sasha (Haake), Anna's dresser, into the plot, in order to carry through the side-splitting wisecrack \"how can a theatre survive without Jews, gays and gypsies?\". Also Charles Durning usurps an Oscar-nomination for the remake as Col. Erhardt, but having watched the original first, his farcical rendition feels a shade forced compared with Sig Ruman's effortless spontaneity.\n\nIn the original, the Lombard-and-Benny pair forms a more organic liaison thanks a lot to the retro flair, she is a classic lady with glamour and dignity, he is somewhat childlike but self- consciously over-proud of his acting, their bickering is crammed with spark and tease, even Robert Stack's handsome pilot is dreamier in the vintage silhouette.\n\nAll in all, it might be unfair for the remake to be viewed immediately after the original, but also the double-bill viewing is a telling corroboration of why vintage classics can obtain their timeless appeal, nostalgia aside, they are absolutely one-of-a-kind in their visual tactility, their characters' mannerism and the streamlined narrative tactics, if you are into it, you cannot get enough of it, as for the remake, maybe it is just not vintage enough, nothing we can do about that, as least for now."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Boba_Fett1138",
        "review_rating": "9",
        "review_title": "Hamlet against Hitler.",
        "review_detailed_main": "This is one fine and also rather effective WW II comedy, that mocks the Nazi's and their direct leaders.\n\nThe movie got actually made during WW II and therefore this movie, just like Chaplin's \"The Great Dictator\" can be seen as a relevant one for its time and propaganda for the good cause. Lots of the cast and crew involved with this movie 'fought' for the good cause during WW II and supported the troops abroad and rallied for cash bonds. For instance also Carole Lombard, who got killed before this movie got released, when the plane with her aboard crashed, when she returned from a tour selling war bonds.\n\nIt's a movie that hits the mark with its comedy and spoofing elements, without ever getting a tiresome or overdone movie with its comedy and anti-Nazi themes. It's a more subtle done movie, thanks to its very fine written script.\n\nTo me it really was the movie its script that pushed to movie to great heights. It's a movie that is always going and never stops for anything. It constantly puts its characters in some odd and also often dangerous situations. Just when you think its over they are rolling right into another- even bigger problem, which of course also is all the more hilarious as well. Because of this the movie basically gets better by the minute. It already all begins really well but it ends even better. You'll laugh more and more as the movie heads toward its ending.\n\nIt also has a real original concept of a group of Polish actors fighting the Nazi invaders with the help of their acting abilities. So its Hamlet against Hitler in this movie! It makes this an original and really pleasant movie to watch. Even though it of course is about serious subjects, especially considering that the movie got made during WW II itself and has some deeper political meanings to it, it never becomes a heavy movie to watch. It's like laughing at WW II during WW II itself. It shows that the world was not entirely dark and sober during WW II. Somewhere people were still laughing and that's always a great remedy in dark, hard and uncertain times.\n\nBecause the movie is so well written, also the movie its comedy mostly comes directly from its situations and dialog. One thing that often is great about '40's and also '30's comedies is its written dialog. It provides the movie with plenty of laughs and makes you wonder why writers like this are not involved with comedy-writing now days. Probably because the genre has got less prestige now days, when compared to the '40's especially, when basically each year a movie like this got nominated for plenty of Oscar's. Strangely enough this movie received only one nomination though, for its music. Perhaps this was due to the movie its bad release date, not too long after Pearl Harbor and of course also Carole Lombard's early death.\n\nThe movie has a solid '40's cast with talented actors such as Carole Lombard, Jack Benny, Robert Stack and Lionel Atwill involved. Basically everyone got well cast and each and everyone of them portrays some great and likable simple comedy characters.\n\nHeil Hamlet!\n\n9/10\n\nhttp://bobafett1138.blogspot.com/"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "LeonLouisRicci",
        "review_rating": "8",
        "review_title": "Dynamite",
        "review_detailed_main": "It Could be Argued that this is Not Near as Good as The Great Dictator (1940), Charlie Chaplin's Nazi Comedy, this is Still Quite a Polished Piece of Cinema. Never Relying on Slapstick, it is All Done with Wit and Timing, Along with a Complicated Narrative Intertwining a Theatre Troupe Dressing Up and Posing as Nazi's with Real Nazi's. It has a Sophistication About it that Cannot be Denied.\n\nWhat Was Denied in the Initial Wartime Release was a Complete Affection for the Satire and Some People and Critics were Taken Aback to Say the Least. It was Mostly Ignored or Shunned and if it was Talked About at All it was Generally Agreed it was in Bad Taste.\n\nBut it is a Well Pieced Together Plot Wavering Between Intrigue and Scripted One-Liners that Pepper the Picture and is the Glue that Holds it Together. Not All of the Jokes Work, but that is Typical of Most Comedies...Hitler as Cheese...for Example. But when they do they are Terrific...Robert Stack Bragging about His Manhood...\"I can drop two tons of dynamite in two seconds\".\n\nOverall, Jack Benny is Surprisingly Good and Carole Lombard is Masterful with Perfect Timing and a See Through Dress. What You Think of the Film will Largely be a Reflection of Your Mindset and if You Can Laugh at Concentration Camp Jokes. But Any Personal Protests Cannot Obscure the Films Artistry, This is One Sleek and Slick Production."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "edwagreen",
        "review_rating": "9",
        "review_title": "To Be is To Be- To Be or Not to Be ***1/2",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "krational66",
        "review_rating": "8",
        "review_title": "From passive to active",
        "review_detailed_main": "In the early era of silent film, due to technical limitations, the sound and the picture in the movie could not be synchronized. It is for this reason that silent film entered another path of completely narrative dominated by the picture without the participation of sound. Therefore, At that time, many directors and theorists thought that the film was a pure visual art. Although the film will show off-the-shelf music for the film when it is shown in the cinema, and even later it will create music specifically for the film, but at the beginning of the sound film, it was met with opposition and resistance from countless directors and theorists. The 1926 film \"Tang Juan\" already has a sound, but this sound is limited to some music. Only in October 1927 did the emergence of \"The King of Jazz\" mark the birth of the first true sound film in the history of cinema. The dialogue of the characters in the movie caused the audience to be captivated at that time. The \"Light of New York\" filmed later was a full dialogue. Although the plot was vulgar, it still achieved great success. By the end of 1929, almost all American urban and rural cinemas had sound installations. For a time, the number of audiences in movie theaters increased significantly. Although audio films bring a series of more real and accurate movie watching experience to the audience, the directors also worry that the appearance of sound will bring a terrible problem, that is, many movies are adapted from literary or dramatic works , Which may allow literature and drama to invade the film and replace montage performance with dialogue. Therefore, Eisenstein, Pudovkin, and Aleksandrov put forward \"sound-painting montage\" in a statement The concept of sound, that is, sound is a factor of montage, is an inevitable and effective way to express and solve complex problems. Liu Bieqian's famous comedy \"to be or not to be\" was produced in 1942. At this time, the use of sound in the film has been quite mature. The sound is no longer used as the decoration of the film, but has become an active participant in the film, revealing the characters Inner emotion, an important expression tool to enrich the expressiveness of the work. In addition to the compact and splendid plot, this movie should be largely credited for its success in its lines and excellent use of music and sound. First, let's analyze the character dialogue in the movie. In the early silent films, due to the lack of sound, subtitles must be used to explain the plot in some last resort. Even so, the plot of the movie should not be overly complicated, otherwise it will affect the audience's understanding, and although the subtitles can solve part of it Problem, but it takes up the time of the film, interrupting the rhythm of the picture and affecting the narrative. Therefore, the appearance of dialogue in the play is the first to solve the problem of storytelling. In addition, the expression, timbre, and tone of the actors in the dialogue are all important tools to show the character, psychology and emotions of the characters. For example, in the film, Joseph Dura often calls himself \"the greatest Polish actor\" and asks if anyone has heard of his name. What he shows here is that he is extremely confident in his performance; for example, the real one in the film Colonel Aihart, he always imposes all his mistakes on his subordinates, and uses \"who can I still believe\" to relieve responsibility, every time he sees him yelling at his subordinate's name plus his beard glaring , The audience knew what he was doing. Therefore, his personality traits are credit for letting himself lead, and fault for the subordinates. Finally, the most important role of the film in dialogue is its potentially rich content. The most classic in the film is the line in \"Hamlet\": \"to be or not to be\", which is the name of the entire movie, and in the play is the line that actor Joseph Dura often reads, This line has a black humorous technique. For example, when Joseph read this line in the theater for the first time, he saw a person stand up and leave. At that time, he showed surprise and incomprehension. He had some pauses trying to attract the attention of the person who left, and his eyes followed the figure of the person. Since then, this line has become a symbol with a special meaning, symbolizing his wife and Sobinsky The lieutenant's meeting secret code is for him a hint that others are not interested in his performance. There are also some impressive lines, such as Bronsky who played Hitler said: \"Long live myself\" This is a mockery, and it is a mockery in the play, this is the line they used to film, but it is also Liu Bieqian The mockery of Hitler. Also, when Bronsky was on the streets of Warsaw, when the little girl said to him, \"Can I sign a name? Bronsky\", it created a comedic effect because he was recognized at a glance . For another example, Ehat said to Joseph who pretended to be Silitsky: \"What he did to Shakespeare is what we are going to do to Poland now.\" What Joseph was most proud of was his performance in Shakespeare's drama, but it was evaluated as his destruction of Shakespeare's drama. His sudden stiff expression made the audience unbearable. This whole movie wins with lines. Many humorous jokes are expressed in lines. Imagine if this is a silent film, then it is estimated that the audience does not understand much in many places, let alone laugh. From the silent film, it requires the audience to speculate the plot itself to later use dialogue to promote the development of plot characters, and the position of sound in the film is gradually increasing. Secondly, the narration of this film. For example, the narration at the beginning of this film, the narration here is an objective narration. The opening was a third party's narrative of the picture's performance, describing the streets, scenes, facial expressions, movements and psychology of the audience. The audience did not understand it very well, but as the story evolved, the scene that appeared at the beginning was explained again. The role of this narration is mainly in narrative, just like others are telling a story, there is a little suspense. First of all, after the story, the reason why the opening scene will appear when you turn around, use the narration to flashback one Things, arouse the interest of the audience. The original live commentary in the movie theater was optional, but the current narration has already taken on important narrative and other aspects, and the development of voice status is evident. In this film, the use of music is also a highlight. The first thing to mention is that after Warsaw was occupied by the German Nazis, a series of notices were posted on the screen. Along with the notice appeared a serious and cruel music, accompanied by the content of the death penalty and other notices, and under the wind The rainy weather shows that the people of Warsaw under Nazi occupation are being slaughtered and ravaged. Similarly, when Greenberg was holding a shovel in the snow while chanting Sherlock's lines, it was accompanied by miserable music. The lines were already desolate, and with the music hitting people's hearts, it also showed the depth of the Warsaw people. The Polish Air Force sang together. This is the use of sound source music in the film. The high-pitched singing reflects the young soldiers' passion for defending the country and maintaining a humorous state under war. During the parachute jump of Lieutenant Sobinsky, the music was tense and rhythmic. Sobinsky was fleeing and the Nazis were chasing. When the two sides were about to meet, the music was tense immediately. It tends to be gentle again, as if it is the kind of instantaneous relaxation and comfort that a person exhibits when he can finally breathe after a long suffocation. The most striking thing about the whole music should be the scene where Joseph found Sobinsky sleeping in his bed. The sound of music began to recall when Joseph discovered the man 's pants on the stool. At first, the music revealed a trace of doubt. Then, Joseph walked to the bed. The music revealed that he was cautious and searching, knowing to turn on the light and see the man lying on the bed. , The sound of music became shocked, Joseph quickly put his head close to the man on the bed and straightened up, and the music was changing with his movements in a high and low manner, matching Joseph 's search and suspicion to the person in front of him until he Recognizing that Sobinsky was the one who left halfway through his performance twice, the music stopped abruptly. The entire music is carried out in accordance with Joseph's psychological changes. The music is as if Joseph's externalized emotions are directly exposed to the audience. And the music used by the actors when they searched for Silitsky in the theater also created a tense atmosphere. Finally, the use of sound in this film. Hitler, who was fake, was leaving the theater, leading a group of real Nazi officers out, in a uniform pace, following a rhythmic footstep, and following on. This is a serious and neat army, but the leader is a fake leader. The sound of clanging footsteps is ridiculous, because their closely protected object is actually a counterfeit. The officers do not know it, but the audience will look like It's funny and ironic. Another place was at Joseph 's house, when Colonel Ai Hart was about to invade Mrs. Dura, the fake Hitler rushed in again, and Mrs. Dura left with him, the door closed, we heard a gunshot, Ai I committed suicide. The gunshot just clarified this point, but it also contained other meanings. For example, Ai Hart was very afraid of Hitler. Therefore, when he learned that he had offended the head, he chose to self-discipline. This gunshot is actually both a narrative and a metaphorical meaning, ach"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "bladefd",
        "review_rating": "8",
        "review_title": "Classic satire that never feels over the top",
        "review_detailed_main": "'To Be or Not To Be' is a classic Hollywood satire that weaves comedy into a masterful suspense story mocking Hitler and the Nazis. It's only fitting, considering that the film was made during the war. The film's plot begins in 1939 in Poland, around the days when Germany invaded Poland. A fictional married couple, Joseph Tura and Maria Tura, are actors who met on the theater stage, and a Polish Air Force pilot, Sobinski, falls for Maria. Before the two could figure out their next steps, Nazi Germany marches into Poland with an undeclared war, drawing Sobinski off to war. Nazi Germany's invasion of Poland destroyed the country's Air Force within days, causing Sobinski to go to England and serve under the British Royal Air Force's Polish unit. There, he runs into a sinister professor, who seems to be a double agent for the Gestapo returning to Poland. The story unveils as RAF parachutes Sobinski into Poland to find out the Professor's intentions. A lot more happens than just that, but it's easy to follow along because of exceptional narration.\n\nOverall, the premise of the film is fascinating and enjoyable. The acting, directing, witty script, pacing, and comedy are well done and stand the test of time in 2024. Director Lubitsch was German-born and resistant to the Nazi movement, which inspired his political take here. The thing that makes satire funny is that it reflects on the truth of the insanity behind the Nazi movement and fascism to ridicule it. The mockery of Hitler was especially hilarious. Hitler famously raged at Charlie Chaplin, who did excellent in his satire 'The Great Dictator', but I don't know his take concerning this film. I didn't know the cast outside of the star Carole Lombard, but they were amazing together. Speaking of Carole Lombard, she died in a plane crash at 33 in her acting prime while raising bond money for the war effort. The film was still in post-production. By the late 1930s and early 1940s, the public considered her a brilliant actress and loved her for her talent, grace, and beautiful looks. Who knows what she could have become through what many consider the Golden Age of Hollywood? After her death, star actor Clark Gable, who was her husband at the time, enlisted with the US Air Force.\n\nWould I recommend this? Yes, but not a must-watch. As far as satires go, this has to be up there as one of the funnier movies to come out of Hollywood. It never feels over-the-top, and the pacing keeps you interested."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "dkncd",
        "review_rating": "9",
        "review_title": "\"So they call me \"Concentration Camp\" Ehrhardt?\"",
        "review_detailed_main": "\"To Be or Not to Be\" is about a troupe of Polish actors who become entangled in a plot involving a Nazi spy during the German occupation of Poland. The film's title is a reference to the fact that the troupe frequently performs \"Hamlet\".\n\nThe egocentric ham actor and leader of the troupe, Joseph Tura, is played by that great, great comedic actor, Jack Benny. Benny plays is oft-played role of a man who overrates his own abilities with relish. Carole Lombard is also excellent as Joseph's smooth wife Maria and the rest of the cast is solid.\n\nThis film features sharp humor that parodies the Nazis and criticizes them. The film is funny all-around, but especially so during the second half. My favorite scene is the one where Joseph Tura is told improvise in order to keep a professor working for the Nazis in his office, but he can't improvise effectively despite being an actor. The way Benny botches the improvisation by repeating the \"Concentration Camp\" Ehrhardt line and following it with strained laughter is perfect. \"To Be or Not to Be\" is another excellent comedy film from director Ernst Lubitsch."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "aj_sff4949",
        "review_rating": "10",
        "review_title": "Brilliantly written piece set during WW2",
        "review_detailed_main": "The humor in this film is so sharp, the dialog is so smart & the delivery so snappy, you really lose yourself in the details as the story unfolds. The performances are brilliant, the leading actress is gorgeous and her signature dress is deliciously decadent, it's exactly what you'd expect from the Golden Age of Hollywood.\n\nThe set pieces really give you that sense of \"they really don't make 'em like this anymore\". Building a period piece set is the only way we can achieve a similar look from this period and the crew staging everything for modern day gives it such great authenticity. You're totally bought into the story and feel like it really happened. The drama, especially when they're in transit from station to station is intense. The ingenuity of the characters is something to see.\n\nI haven't watched an extraordinary amount of films pre-1962 to consider myself an expert of that b&w era or anything, but I can tell you with certainty that I know this is one of the great ones."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "h-28658",
        "review_rating": "8",
        "review_title": "Great satire in 1942.",
        "review_detailed_main": "I felt uncomfortable at the beginning of the movie but it quickly develops into a Nazi blooper reel. Lombard (in her final roll) is gorgeous and brilliant and Benny is even very good. Supporting cast Bressart and Rumin are wonderful. Easy to see why Mel Brooks remade it."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "kirk781",
        "review_rating": "10",
        "review_title": "If you prick us, don't we bleed",
        "review_detailed_main": "Making a film based on some event in hindsight is relatively easy. Making it whilst the event is still going on is very tough, especially in context of large wars. This Lubistch film might be the director's masterpiece (atleast, in my humble opinion; it is), made in the midst of second world war. Carefully piecing hilarious comedy sections whilst still standing the test of time in the modern era is no easy task.\n\nI can't help but compare this film with Chaplin's The Great Dictator which was made when US hadn't officially even entered the war and Chaplin had difficulty finding resources to fund such an ideological film. However, whilst that film ends with a resonant message for peace and idealism, this one sticks more to proper comedy. It was remade in 1983 but the original is way better.\n\nThe acting is pitch perfect from all the cast members (something that was missing from the remake of this film)."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "davidmvining",
        "review_rating": "8",
        "review_title": "Comic thriller with the Lubitsch Touch",
        "review_detailed_main": "It's interesting to contrast Ernst Lubitsch's effort at directly dealing with Nazism against Fritz Lang's. Lubitsch had the advantage of leaving Germany in the early 20s, well before the rise of Hitler while Lang left in 1933 right as they claimed power over the legislature and Hitler's rise to the chancellorship. Lubitsch had a certain distance to what had been going on in his home country, and he was able to thrive in his fantasy versions of Central and Western Europe for more than a decade. However with the actual involvement in the war by his adopted country, and with the rise in popularity of war pictures, Lubitsch found a way to make his own war movie. Where Lang made earnest thrillers begging America to get involved like Man Hunt, Lubitsch made a comic-thriller that poked fun at actors and Nazism in equal measure. It's just about the most Lubitsch war film he could come up with.\n\nIn Warsaw before the Nazi invasion, a troupe of actors is practicing their new play Gestapo, a serious play about the dangers of Nazism. The problem is that the troupe is filled with hams from the biggest roles to the smallest, like Bronski (Tom Dugan), playing Hitler and heiling himself as he enters a room. The lead is Joseph Tura (Jack Benny) who is married to Maria (Carole Lombard), also an actress in the troupe. When the Polish government forbids the presentation of Gestapo, the troupe falls back on performing Hamlet with Joseph in the titular role. During the famous soliloquy, a young airman, Lieutenant Sobinski (Robert Stack) leaves the audience and goes backstage to meet with Maria with whom he has a schoolboy crush. The Nazi invasion occurs, and life in Warsaw completely changes after the bombing and with the presence of the gestapo looking over the lives of the occupied population.\n\nWhat's interesting about this film, especially in comparison to Mel Brooks' later remake, is the sense of danger. Brooks were for a fairly broad sense of humor, undercutting a lot of the tension to make a purer comedy, but Lubitsch, making a film about Nazis in the middle of WWII, couldn't just make them complete jokes. There are joke Nazi characters, like Colonel Ehrhardt (Sig Ruman), but the actual danger of the situation is always palpable, and that comes into the clearest focus when the actual plot of the film gets introduced. In England, as part of the Royal Air Force's Polish division, Sobinski and his fellow flyers give information on their relatives in Warsaw to Professor Siletsky (Stanley Ridges) who ends up being a Nazi spy who will use the information to destroy the resistance in Poland and all of Eastern Europe. British intelligence sends Sobinski back into Poland, and the trip in is surprisingly taut. It's dangerous with an air jump, flack, and a chase through the countryside into Warsaw.\n\nI'm not sure if this is a plus, a minus, or neither, but there's a certain clipped nature to some of the movement of the plot. When Sobinski lands in Poland, he has a specific mission to go to a bookshop and deliver a picture of Siletsky to the underground. He gets close, runs away, and we cut to the same streetcorner later where Maria shows up and delivers the picture. This happens a few time in the film with people walking into scenes without prior explanation, but it's never random. We're just denied the scenes that explain it before hand while we get explanations afterwards. I think it might be Lubitsch's efforts at creating tension, essentially being dropped into scenes that we only know part of the truth of, putting the audience on their back foot as they try to navigate the suddenly unfamiliar situation within the plot. Does it work? I'm not sure. I'm also not sure it doesn't work either, though.\n\nAnyway, the characters, led by Joseph who has no idea what he's walking into to solid comic effect, work to trap Selitsky, claim his information, and then kill him so he never gets the intelligence to the gestapo. Things go awry when Joseph can't operate without a script while playing Colonel Ehrhardt, constantly repeating himself while trying to play for time. It also gets a wrinkle when Selitsky falls for Maria and keeps her at gestapo headquarters, requiring Joseph to find a way in, complete with Selitsky disguise, to get in and rescue her as well as find the backup copies of the intelligence. Things get even more complicated when the real Colonel Ehrhardt brings Joseph dressed as Selitsky to the read gestapo headquarters, an event where Joseph manages to actually play well, having had practice on the other end of the conversation just hours before. It's purely light farce with its emphasis on mistaken and hidden identities, and Lubitsch, like always, happily lets the comedy play without large emphasis, letting the jokes land without needing to highlight them. The broadest the comedy gets is in the portrayal of Ehrhardt with Ruman going as big as he can as the bumbling and inept Nazi that gets tricked easily. The rest, though, is surprisingly light, especially when my main exposure to this story is the Brooks version that more fully embraces broad comedy.\n\nThe resolution of the film involves a surprise visit from Hitler to watch a performance that the troupe take advantage of in order to orchestrate their escape from Poland. This is where the film's more serious attempt at tackling the thriller side of things begins to work against it. The lighter comedic tone of Brooks' remake lends itself better to the scene where Bronski comes out, face to face with all of Hitler's personal guards, and manages to successfully convince them that he's Hitler, allowing them to leave. In Lubitsch's tale, the danger feels more real, so having all of the SS right there with an imposter and not recognizing him (especially after the opening where Bronski goes onto the streets of Warsaw dressed as Hitler and gets asked for the actor's autograph, not Hitler's from a little girl) ends up feeling off. Maybe part of it could be addressed through some editing choices that more clearly favored Greenberg (Felix Bressart) and his recitation of Shylock's speech from The Merchant of Venice, it might be more easily eluded. However, with Bronski and Joseph fully in frame for a very large chunk of the scene, I just kept wondering why no one wondered why Hitler looked a bit different and some strange officer with a Polish accent was telling them what to do.\n\nStill, the actual focus is on the lighter comic stylings, and the film ends with some very funny moments like Bronski telling two Nazi pilots to jump out of the plane.\n\nThe cast is all game, and Benny carries the film surprisingly well. He was apparently extremely nervous throughout filming because he saw himself as unworthy of the project and working under Lubitsch at all. He perfectly plays Joseph, almost always in over his head by the situation. He's paired really well with Lombard who is sexy, funny, and a fun combination of aloof and earnest. Miriam Hopkins was due to star in the role of Maria, and I think she would have done a great job, but Lombard is really good as it is. The supporting cast is wonderful as well, providing a lot of the comedic fodder on the edges of the frame that helps the film coast along nicely.\n\nMy only real problems with the film are around the thriller elements, mostly creating a certain clash in the third act that undermine the thriller elements more than anything else. Lubitsch's natural tendencies obviously more aligned with the comic than the thrilling, but he manages the thriller elements well enough for most of the film. The comic parts are the best, though, and Lubitsch's light touch is nicely on display throughout.\n\nI don't think To Be or Not to Be quite reaches the highest ranks of Lubitsch's body of work, but it's still really good and entertaining. It's just that Lubitsch's highs are so high."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "springfieldrental",
        "review_rating": "10",
        "review_title": "One of Best War Satires in Cinema",
        "review_detailed_main": "Hollywood movies dealing with the war in Europe which were filmed just before Pearl Harbor but released soon after the attack make for an interesting study. Starring Jack Benny and Carole Lombard, February 1942 \"To Be or Not To Be\" was harshly critiqued when it premiered soon after the Hawaiian bombing. The movie, a satire on the German invasion of Poland in 1939, sparking World War Two, made American viewers uneasy, knowing their children, husbands and boyfriends could be fighting overseas at a moment's notice.\n\nAdding to the somber mood surrounding \"To Be or Not To Be's\" nationwide release was Lombard's death in a plane crash outside of Las Vegas just a month before. Yet as the years have passed the Ernst Lubitsch-directed picture has been ranked as one of the great parodies on war, on par with Stanley Kubrick's 1964 \"Dr. Strangelove\" and Mel Brooks' 1967 \"The Producers,\" along with those who rank it as Lubitsch's best. Film critic Ed Gonzalez supports that contention, going so far as saying it \"is considered one of the greatest comedies in the history of cinema.\" Lombard, one of Hollywood's most popular stars, always wanted to be in a Lubitsch movie. She got her chance when Miriam Hopkins, the director's first choice to play actress Maria, wife of ham stage actor Joseph Tura (Benny), loathed the script and refused to be in the same movie as Jack. Benny, famous more for his popular radio show than for his movie career, was always Lubitsch's pick to play the lead. The comedian recommended his friend Lombard, who eagerly accepted what was largely a straight role. Lombard later told friends the production was the happiest experience she ever had making a film. She came home every night giddy from the studio, raising suspicions from her husband Clark Gable, who felt the script was silly, that she was having an affair with Lubitsch.\n\nUpon Lombard's death, \"To Be or Not To Be's\" producers, led by Alexander Korda, considered mothballing the picture until much later. The actress was returning to California from a successful War Bond drive in her home state of Indiana in mid-January 1942 when the plane she was flying in crashed on the side of a mountain near Las Vegas, killing everyone on board. She earlier won a coin flip with her mother to decide who would take the last empty seat on the plane filled mostly with military personnel instead of a slower train. Benny, receiving word of her death on a Sunday while driving to his radio show, was so affected he canceled the show. He was also too emotional to see the preview of \"To Be or Not To Be\" a week after the crash. During that preview, the audience gave out an audible gasp seeing Lombard's name on the opening credits, and applauded every time the actress entered the scene. The editors left most of her clips in, with the exception when she questioned \"What can happen in a plane?\" which was cut. It's ironic the final scene in the movie has her flying in a military plane escaping from Poland.\n\nJack Benny considered \"To Be and Not To Be\" his greatest film. When the movie was in the scripting phase, the comedian was surprised when Lubitsch approached him, and told Benny the screenplay was based on his personality. Lubitsch, in his broken English, told Benny, \"A comedian - he is a performer what is saying funny things. But you, Jack, you are an actor, you are an actor playing the part of a comedian and this you are doing very well. But do not worry, I keep your secret to myself.\" While filming, Benny was unsure about his acting. Robert Stack, playing the Polish pilot Sobinski and an admirer of Maria (Lombard), remembers, \"He'd always ask me, 'Is this funny?', and I'd say, 'Don't ask me.' 'But you're an actor,' he'd say. Basically he was scared to death.\" The young actor added Benny held Lubitsch in the highest regard, confessing to Stack he was \"about the only director who ever really directed me. The trouble was that I knew lots about radio comedy, a little about stage comedy, and nothing about movies,\" even though Benny's performance the previous year in \"Charley's Aunt\" had been critically-acclaimed.\n\nBenny's Jewish father Meyer was outraged about his son's performance after viewing \"To Be or Not To Be\" in a Nazi uniform. He stormed out of the theater before it was finished, spitting in anger. Jack had to convince him the picture was a satire, and persuaded him to return to his seat. Meyer's opinion changed when he stayed to the end, enjoying the comedy so much he had been known to have seen it 45 times. Lubitsch also took heat for portraying Polish actors posing as German soldiers. The director wrote in his defense, \"What I have satirized in this picture are the Nazis and their ridiculous ideology. I have also satirized the attitude of actors who always remain actors regardless how dangerous the situation might be, which I believe is a true observation.\" The premise behind \"To Be or Not To Be,\" has Joseph Tura (Benny) the lead actor in a Warsaw theater company just before war breaks out. He suspects his wife Maria has a lover when he spots Polish airman Lt. Stanislav Sobinski (Robert Stack) in the second row leaving his seat in successive evenings when he says the line in 'Hamlet' \"to be or not to be.\" As war erupts, Sobinski and his fellow pilots leave for England while Tura and his acting colleagues become connected with the Polish resistance. A professor-turned-Nazi spy, Alexander Siletsky (Stanley Ridges), returns to Poland from England pretending he's a member of the resistance. This causes Tura's actors to take the guise of German soldiers in an attempt to intercede between the spy and his Nazi contacts.\n\nBecause of the new wartime conditions America found itself in, critics ripped into the satire. Bosley Crowther of The New York Times was most vocal, writing, \"Mr. Lubitsch had an odd sense of humor-and a tangled script-when he made this film.\" Through the passage of time, however, Lubitsch's film has emerged as a classic. \"Time has been kind to this magnificent film,\" said film critic Leonard Maltin. \"The film isn't so much about Nazis overtaking Poland as a troupe of Polish actors invading the world of Nazidom; therein lies its brilliance as a topical satire.\" The Academy members, like most at the time, failed to appreciate \"To Be or Not To Be,\" voting it for just one award, Best Music by Werner Heymann. The American Film Institute ranks it as the 49th Funniest Movie Ever Made while nominating it as one of the All-Time Best Movies. It's also included as '1001 Movies You Must See Before You Die.' Mel Brooks was such a big fan of the Lubitsch film, he remade it with his wife Ann Bancroft in the Lombard role in his 1983 comedy \"To Be or Not To Be.\""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "blanche-2",
        "review_rating": "10",
        "review_title": "A Lubitsch comedy masterpiece",
        "review_detailed_main": "Just the thought of Jack Benny walking onto a stage as Hamlet is enough to send anyone into spasms of laughter. That he does - and a lot more -in \"To Be or Not to Be,\" a 1942 film about the Lunt and Fontanne (Benny and Carole Lombard) of Poland, Josef and Maria Tura, as they go up against the Nazis. Circumstances make it necessary for the acting troupe to pose as Nazi guards and officers and for Maria to pretend to romance one of Hitler's main men in order to head off a Nazi spy (Stanley Ridges).\n\nThis film is absolutely hilarious, with several running bits, including Maria telling a young soldier (Robert Stack) that he can visit her dressing room when Josef starts his big speech. When Josef says, \"To be or not to be,\" the soldier stands up and leaves the theater, making Josef believe the man is simply walking out on his performance. This goes on throughout the film. Robert Stack is so young he's virtually unrecognizable.\n\nThe supporting cast is excellent, doubling beautifully as actors - one of whom longs to play Shylock (Felix Bressart) but carries a sword instead and one who wants a chance to play Hitler (Tom Dugan) - and as Nazis. Sig Ruman plays the buffoonish Col. Ehrhardt.\n\nHowever funny \"To Be or Not to Be\" is, and it's wonderfully funny, Lubitsch manages to make his point that war is scary and tragic when the audience is shown the Warsaw stores closed and the streets nothing but rubble. There was nothing remotely amusing about the Nazi occupation of Poland, but 1942 audiences, while being reminded of this, were allowed to laugh and forget their troubles for a little while. The laughter doesn't last long, especially since Carole Lombard died in a plane crash so shortly after the film's release. That marred the legacy of \"To Be or Not to Be,\" but today, we should see it for the classic that it is."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "tomsview",
        "review_rating": "9",
        "review_title": "It's all in the timing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "mark.waltz",
        "review_rating": "9",
        "review_title": "A very serious comedy is a real laughing matter.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "guswhovian",
        "review_rating": "8",
        "review_title": "\"That great, great Polish actor, Joseph Tura\"",
        "review_detailed_main": "Joseph Tura (Jack Benny) and his wife Maria (Carole Lombard) are actors in Poland. When World War II breaks out, they find themselves embroiled in a plot to stop the Nazis from destroying the Polish resistance.\n\nPerhaps Lubitsch's most famous film, To Be or Not to Be is a delightful dark comedy. Jack Benny is perfect, as is Carole Lombard. The supporting cast is great as well, particularly Sig Ruman as a Nazi officer.\n\nFirst time viewing. 4/5"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "krational",
        "review_rating": "8",
        "review_title": "to be or not to be",
        "review_detailed_main": "The relationship in the age inevitably has some flaws. The relationship between the husband and wife runs through the whole. The most classic first is that the husband enters the door and finds that a strange man is amused to death in the bed. Death, the films of that era should never set an inherent impression on the protagonist, and you will be surprised later! An actress's well-known stalk, a fake beard in the play, and the bureaucratic system's pedantic, play very slippery. But Liu Bieqian touch seems to have little expression in this part."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "fugazzi49",
        "review_rating": "9",
        "review_title": "Lubitsch. Benny and Lombard score a triumph.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "DKosty123",
        "review_rating": "8",
        "review_title": "Interesting Piece of History & Well Made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "corfuisland",
        "review_rating": "8",
        "review_title": "A masterpiece of classic Hollywood and a great anti-war satire",
        "review_detailed_main": "It takes guts and endless talent to make an anti-war satire in the middle of World War IIand Ernst Lubitsch possessed both. His film, which was considered in bad taste when it was released but is now recognized as a pure masterpiece, takes place in Nazi-occupied Warsaw, where a troupe finds itself embroiled in a mission to track down a German spy. Lubitsch's handling of the balance is astonishing, with the director lending an unseen narrative fluidity to the style of the film, which begins as a witty comedy, evolves into a tense thriller, and ends as a dark comedy that mocks the absurdity of war. All this without missing the intelligent sarcasm about the actors' jealousies and their dreamy temperament, which finally manages to save them from the horror."
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Dr_Coulardeau",
        "review_rating": "8",
        "review_title": "Age does not become that film very well",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "szarlotka_cjm",
        "review_rating": "8",
        "review_title": "Lubitsch gave me a pleasant surprise",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "Bored_Dragon",
        "review_rating": "8",
        "review_title": "\"What he did to Shakespeare we are now doing to Poland\"",
        "review_detailed_main": "Just before the occupation of Poland, the censors forbade the theater in Warsaw to hold the premiere of a satirical play about the Third Reich. However, the theater troupe was soon given the opportunity to apply their costumes and acting skills in reality, in order to save the resistance movement from the Gestapo.\n\nCarol Lombard's last film, before her untimely death, was released in the midst of World War II, in 1942. This mockery of Nazi Germany shows a very tense story, which can be characterized as a spy thriller, through a combination of slapstick, screwball, romantic and black comedy. Marital jealousy, identity swaps, well-written and very witty dialogues, and a few really hilarious scenes will hold your undivided attention, and the title of the film, which alludes to both the theater and the reality of the heroes of this story, and which runs through some of the strongest scenes, make this movie even more striking.\n\n8,5/10"
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "chenxiaomao",
        "review_rating": "",
        "review_title": "Lin Chen-To Be or Not to Be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jimjo1216",
        "review_rating": "",
        "review_title": "Ridiculing the Nazi regime while it was in power",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "jarrodmcdonald-1",
        "review_rating": "",
        "review_title": "Life is a Lubitsch and then you die",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "CinemaClown",
        "review_rating": "",
        "review_title": "As Smart A Comedy As It Is Stinging As A Satire",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "carvalheiro",
        "review_rating": "",
        "review_title": "Any partner resembles him",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "didi-5",
        "review_rating": "",
        "review_title": "wartime curio",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0035446",
        "movie_name": "To Be or Not to Be",
        "movie_rating": "8.1",
        "review_username": "aepurnell",
        "review_rating": "",
        "review_title": "A delightful comedy that, unfortunately, adheres to 40s Hollywood norms.",
        "review_detailed_main": ""
    }
]