[
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "umarabeer",
        "review_rating": "5",
        "review_title": "Crappy script - Serious Disappointment",
        "review_detailed_main": "Sequel of Welcome, which was quite an enjoyable film. This films stars all the A-listers, which was the reason it got droves of people to watch it in the first place. Honestly, the film is a disappointed. With the likes of Nana Patekar and Paresh Rawal. Their presence makes it livelier but the weak story line seriously undermines the whole experience.\n\nThe film show casts Dubai shorelines, which look amazing on the big screen. However, the direction was choppy. One particular sequence was just down right stupid when skydivers are above Palm one moments and appear next to their target the next in the sandy dunes of remote UAE.\n\nThe A-listers are gold and their on-screen performance was what kept things going but the new cast, Shruti Hassan and Dimple's Daughter (in the film) did a pretty shoddy job.\n\nFilm to let go by in the cinema and probably catch up on a Saturday afternoon in front of Tele."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "Abby_qadir",
        "review_rating": "4",
        "review_title": "Don't Welcome this family...",
        "review_detailed_main": "Welcome Back (2015)\n\nA sequel to the 2007 comic caper Welcome starring Anil kapoor, Nana Patekar, John Abraham, Paresh Rawal and Shruti Hasaan in the lead. Directed by Anees Bazmi.\n\nThe movie fails miserably in the sequel. The first part was a laughter riot but it does not create the same magic again. I didn't had any expectation from the movie still I convinced myself to watch this.\n\nThe only thing I enjoyed in the movie was watching Majnu and Uday Shetty, rest all failed to entertain me. John Abraham is not at all suitable for comedy roles. His expressions are worst. He can only do films like Madras Cafe (He is best in that type of roles). Shruti Hasaan has to learn a lot in terms of acting and comic timing. You will surely miss Akki (Akshay Kumar) in the sequel.\n\nThe first half of the movie is too boring, you can have some laughs in the post interval part. I had never experienced such bad songs and their lyrics in recent movies. Anees Bazmi is known for directing good comedy movies but this time He had made a very illogical and a totally senseless movie.\n\nWatch this movie at your own risk and please leave your brain at home if you convinced yourself for watching Welcome Back.\n\n1.5/5 or 4/10"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "ishankaith",
        "review_rating": "5",
        "review_title": "Brainless yet fun",
        "review_detailed_main": "I wasn't expecting much from the film from the beginning however unexpectedly it did provided some fun time though the film had weak direction and weak story. The first thing I must say is that there is not much difference to see in this film from the predecessor,similar situations and very similar plot (though the first part was way much better). Let's start with the pros first Anil Kapoor and Nana Patekar did a fine job in portraying the characters of Majnu and Udai just like before. The film is pretty funny in second half and few dialogs are pretty cleverly written and have many amazing and beautiful locations. However still they were not able to fill in for the cons which include bad songs and some very unfunny jokes along with bad visual effects which by the way felt unnecessary. I was pretty disappointed with performance of Shruti Hasan as she did not stood out much and also with Paresh Rawal not getting more screen time and John Abraham's performance which yet again did not left a mark. The film doesn't make much sense and has pretty brainless plot I won't recommend this film if if you want something which makes sense however you can watch if you leave brain at home."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "mukhopadhyay-arka01",
        "review_rating": "1",
        "review_title": "Don't waste valuable time of your life watching this",
        "review_detailed_main": "music--awful script--one of the worst, even stalwarts like naseruddin shah or paresh rawal looked idiotic due to scripts\n\naction sequence--these kind of action sequences were shown in 90s\n\nacting--out of the 1000 one liners in the movie, maybe 2-3 can really make you giggle\n\nAnees Bazmee creates below average films -thats true, but this one is definitely one of his worst!\n\nIt's hard to believe these kind of movies are coming out in 2015!!\n\nDon't waste your time\n\nwatch welcome instead!"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "rahimnagori",
        "review_rating": "1",
        "review_title": "Not as good as expected. Welcome was too good.",
        "review_detailed_main": "This movie is a crap. South Indian movies are now moving towards Hollywood and our so called Bollywood is degrading itself by making movie like this. I watched it for Brahmanandam but he is not in the movie for a heavy role. Plot was not as good as expected. The maker tried to make a spicy movie but failed and produced a KHICHDI. These type of movies are such a shame of Indian Bollywood. I wasted my 2.30 hrs watching this crap. Naseeruddin shah was not enough good as RDX. Mark my word John Abraham can never be an actor he is good at modelling so go back John this is not your cup of tea. Shruti should stay in South industry as its a very bad movie for her career. Picturisation is not good. Director used sports car for the Shareef Businessman where is your mind director?"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "virgo_aries",
        "review_rating": "1",
        "review_title": "Biggest disaster of 2015",
        "review_detailed_main": "Nowadays, film producers are hiring marketing and advertising agencies not only to promote their movies, but also to improve IMDb ratings. They post fake reviews and rate films greatly to fetch more people to the theaters. About the movie: This movie is completely baseless and crap. Dialogues are good as the dialogue writer is a stickler in writing comedy. Direction is fine, but the most important aspect \"the script\" is baseless. The movie will nettle you after the interval and you might feel annoyed by it. Go and watch this movie if you want to waste your hard earned money.\n\nP.S this is my first review on IMDb"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "sanket394-925-922364",
        "review_rating": "1",
        "review_title": "Welcome Back!!!!",
        "review_detailed_main": "When was the last that you watched a movie and after two and a half hours all you wanted was refund? Well it happened to me this evening when I watched Welcome Back. There are bad movies (Humshakals), there are worse movies (Himmatwala) then there is fifty feet of crap and then there is Welcome Back. The movie begins with the Majnu(Anil Kapoor) and Uday(Nana Patekar) living an honest life but still not entirely happy as they haven't been able to find a suitable bride for themselves. Then enter Maharani and her daughter(Ddimple Kapadia and Ankita Shrivastava respectively) and both the Bhais fall for the same girl (again). Only they don't know that these women are not what they say, in reality they are here to con Majnu and Uday. One girl creates the divide between Majnu and Uday and when things are just about to get thick enters Shankar Shetty, Uday's father played by Nana Patekar. He drops him with the news about his third marriage and the daughter he has with that marriage- Ranjahana(Shruti Hasan). And now it's uday's responsibility to find a suitable groom for her. In the meantime Dr. Ghongroo (Paresh Rawal) discovers that her wife too had a son outside her marriage which he was never told about. This son of Ghongroo is a local goon in Mumbai, Ajju Bhai(Jhon Abraham). Uday and Majnu want Ghongroo to marry their sister with his son as they don't know that he is not what they think he is but little do they know that their sister already is in love with the same guy. After getting to know the truth about Ajju they decide to take help from the underworld don Wanted Bhai(Nasseruddin Shah), but again are unknown of the fact that his son Honey(Shiny Ahuja) is in love with their sister too. All this lead to a series of confusion and that's how we have our movie. The story of the movie has nothing new to offer as it is a complete rip off of welcome with slight changes here and there and two new characters of maharani and his daughter (which still doesn't change a thing). The script written by Anes Bazmi himself is filled with dialogues which are trying too hard to be funny but ends up being more than just lame (except few dialogues by Nana Patekar). Welcome didn't have great music but still the songs had a unique quality about them. But in welcome back music is as bad as it can get. The soundtracks for welcome back was composed by seven artists- Meet bros, Mika Singh, Honey Singh, Milind Gaba, Abhishek Ray, Sidhant Madhvan and Anu Malik but not even one of them couldn't make a single soundtrack that one can take back with them. The lyrics of these songs make it even worse. The background score which was the high point of welcome's music department too fails miserably as it is nothing but the remixed version of the background score of welcome. The ensemble cast of welcome back too fails to deliver unlike it happened with welcome. Apart from Nana Patekar and Nasseruddin Shah none of the actors have managed to put up a decent show. John Abraham has always been a little short when it came to comedy but here he is completely out of space and for once Akshay kumar is missed. Paresh Rawal has sleep walked through his role of Dr. Ghongroo as he had nothing to offer in this movie. So did Ankita Shrivastava and Dimple Kapadia who was completely out of space and showed a complete lack of comic timing. Anil Kapoor was a star in the previous one but here he is totally forgettable in his Majnu avtar with too much tilted shoulder (which in no way is funny). Nana Patekar is one actor to watch out in this movie. He has an excellent comic timing and has flawless expressions. With Nasseruddin Shah, he is the only actor who makes you laugh sometimes here and there. If someone said that Katrina Kaif was just an eye candy in welcome and had nothing much to do then they should definitely look at Shruti Hasan in this one who just can't act, and more she tries more bad it looks. She had the most forgettable performance in this ensemble cast. If bad acting, music and story want enough, direction by Anes Bazmi is the final nail in the coffin. He is not just bad, he is pathetic. He not only doomed the movie with bad story or script or dialogue but also his direction. There was no direction in the movie as there wasn't a story. All he had to do was shoot the same scenes that were there in welcome with a different set. Welcome was a complete disaster in every department. It is simply one of the worst movies to come out not only this year but in few years. This sequel to the 2007 hit comedy is nothing but your worst nightmare coming true. Apart from Nana Patekar there is nothing in this movie to watch, literally nothing."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "zzubairrr",
        "review_rating": "1",
        "review_title": "Full waste of Time and Money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Despite weak script and poor direction – Welcome Back is watchable only because of three aces – Anil Kapoor, Nana Patekar and Paresh Rawal",
        "review_detailed_main": "Films like DON, Dhoom, Murder, Bhoothnath, Golmaal series and Tanu Weds Manu has generated enough curiosity among movie mongers to spawn their eagerly awaited sequels. Follow-up to the smash-hit Welcome (2007), Welcome Back was right there with high dose of entertainment value but looses the steam due to the fiddling climax, wafer-thin plot and tuneless music.\n\nUday and Majnu wants to marry off his sister to someone from a good family background if he wants to get married to Chandni. Story gets further complicated when Ranjana(Uday's sister) falls in love with Mumbai goon ( John Abraham) who is completely opposite to what Uday and Majnu expected.\n\nAnees Bazmee has mastered of making no-sense and yet entertaining films ( No Entry, Welcome, Singh Is King, Ready) . With Welcome Back, Bazmee has gone one step-further. He has created a mish-mash plot and sub-plots that will make you pull your hair. You do not bargain for logic here as anything can happen from anywhere and at anytime. The good news is despite all the foolishness, the films work thanks to the quick-witted tapori humour, funny scenes and threesome- Anil Kapoor, Nana Patekar and Paresh Rawal who are sure to bring down the house with their rib-tickling act. The climax plays a spoil-sport and you wish director could have made it more smart, crispy and shorter version. The dialogues, especially, by Raaj Shaandilyaa is noteworthy and will remain with you after the film. Lets be frank- there is nothing called \"screenplay\" in the film. Editing is terribly loose. The budget is pretty high (estimated to be Rs 100 crores) which makes sense considering high production values and shooting locations in Dubai. Cinematography sometimes rolls out to make film look like 90's potboiler entertainer but nevertheless is magnus. Music is a big letdown. The hopeless film stands on the shoulders of 3 supremely talented actors – Anil Kapoor, Nana Patekar and Paresh Rawal. The chemistry between them is sparkling and convincing that you will love every moment of them in the film. Anil Kapoor is simply mindblowing. Nana Patekar is equally outstanding. Watch for the scene when they play antakshri in the graveyard. Paresh Rawal is splendid. He gets to deliver witty-one-liners and does it with ease. John Abraham is decent with his tapori looks. Shruti Hassan should start thinking of some other profession. Naseeruddin Shah does not making any impact replacing the role of legendary Feroze Khan. as Wanted Bhai. Dimple Kapadia surprises with astounding performance. She gets to deliver some good lines as well.\n\nDespite weak script and poor direction – Welcome Back is watchable only because of three aces – Anil Kapoor, Nana Patekar and Paresh Rawal\n\nDecent – 2.75/5"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "crookedone",
        "review_rating": "2",
        "review_title": "Barely watchable",
        "review_detailed_main": "The sequel fails to entertain in the slightest bit. It is boring to watch even with a bunch of friends.\n\nLines were weak, dance numbers didn't do anything to entertain the audience and the overall theme is the exact same as the previous movie.\n\nThe acting itself was substandard, leaving much to be desired. Some parts of the movie were amusing but not enough to make it worth watching.\n\nThe script seemed randomly thrown in with poor screenplay, mediocre directing and annoying cut-scenes.\n\nWelcome Back fails to live up to expectations set by the original."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "sanorita",
        "review_rating": "9",
        "review_title": "Welcome Back's script is bad, but the comedy,dialogue and acting make up for it!",
        "review_detailed_main": "Positives- Anil,Nana and Paresh's acting,The dialogues,the very funny comedy and the shiny look of the film,the single-liners,the unlimited laughter.\n\nNegatives- The script,the climax.\n\nRating-9/10\n\nRecommended or not? Yes, it's the movie of this weekend and a good family entertainer.\n\nFinal Verdict-Climax is like raita but the comedy,dialogues,acting etc more than make up for it.\n\nStory-Majnu Bhai(Anil Kapoor) and Uday Shetty(Nana Patekar) are back but this time not as gangsters,but big businessman.They fall in love with the same women named Chandini.But her sister says that they should first get their sister Ranjana(Shruti Hasan) married and then one of them can get married to Chandini.Now a search for the perfect groom for Ranjana starts."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "jmoneyjohal",
        "review_rating": "6",
        "review_title": "Over the top, illogical, but just leave your brain at home and enjoy Welcome Back. The 90s are back!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "random165",
        "review_rating": "1",
        "review_title": "Doesn't even deserve 1/10 stars",
        "review_detailed_main": "Don't waste your time on this boring movie, it is better to watch welcome 1000 times than watching this movie for once"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "Welcome back....aargggg",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "nairtejas",
        "review_rating": "2",
        "review_title": "Go Back! ♦ Grade F",
        "review_detailed_main": "If Welcome (2007) was like spreading lots of peanut butter on a brown bread slice using a butter spreader, its sequel is like sprinkling white bread crumbs on a bowl of stale peanuts that belongs in a dustbin. The latter does not even make sense.\n\nThe Shetty brothers (Patekar & Kapoor) have left the underworld and are now in the real estate business. Their sister's in-laws Ghungroo (Rawal) and his wife are leading a peaceful life. But out of nowhere, both the parties find that they have a sister (Hasan) and an illegitimate son (Abraham), respectively, to euphemistically dispose of. As bizarre as it may sound, this sister and this son meet and fall in love and engage in tonsil hockey all in a matter of hours. But since the Shetty brothers have shed their criminal threads, they do not want Ghungroo's wife's illegitimate son to marry their Donald Duck of a sister because he is a local Mumbai don. As you see, the tables have turned and all that we have on the table are stale peanuts.\n\nThere seems to be a competition among the actors to come up with the worst performance. I was excited to see disgraced actor Shiny Ahuja's name pop up on the beginning credits, but unfortunately he wins the competition, followed by beasty Abraham (god damn Baazigar over here) as the runner up. The remaining take home consolation prizes, with the exception of Patekar, who is the only reason the film does not totally slip into nothingness.\n\nNumerous songs stuffed inside the poor screenplay that play in tandem produces the right amount of boredom in its audience who by the end of the 150-minute film are sure to consult their therapists. The film gasps for a story, which looks repetitive if you have enjoyed the prequel, and the small amount of humor that it does have is mindless slapstick that induce nothing more than a titter. As a result, the screenplay tries to entertain itself by allowing its characters to play antakshari in a graveyard with two fake bodies doing rounds around them.\n\nIf you're still inclined to spend money on the film, all you have to do is visualize and consider this sequence: the illegitimate son hops from one camel's hump to another to another and so on to save an underworld don from a sandstorm that's breezing in. Poor camels.\n\nBOTTOM LINE: Anees Bazmee's Welcome Back is sure a mindless comedy with frequent doses of action and songs that may appeal to some, but the real question is, is this a sign of Bollywood's tread into darkness?\n\nGRADE: F.\n\nCan be watched with a typical Indian family? YES"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "simplymailshah",
        "review_rating": "5",
        "review_title": "Well, Come Back.",
        "review_detailed_main": "The worst treatment of a script. I might say this. The prequel ' Welcome' was a good watch, a time pass movie with some extremely good comedy scenes. Akshay Kumar did a great job in the comic role. and Anil Kapoor and Nana Patekar were the highlights of the film.\n\nIn the second installment. Welcome back, everything fails except nana and Anil. Thanks to Anil and Nana for their effortless performance in the movie. Anil Kapoor should these kind of roles more often. paresh Rawal had nothing to do more, so is with Dimple kapadia and Naseeruddin Shah. John was seen hard working to get the right expressions, but was strictly average. I felt like he is copying Salman Khan's tapori role. The dialogues, body language etc resembles to Salman Khan.\n\nThe lead actors were like fashion models on ramp. Shruti Hassan and Anjana Srivastava's cleavage had better expressions than her face.\n\nThe script had the potential to bring more laugh, but Director ruined this in timing of twists. Some unnecessary scenes like ' cemetery scene' , was the most boring one in the movie.\n\nIT was very sad to see actors Naseeruddin and Dimple being wasted in this movie, which actually offers some good laugh. This is example of how a good script can be turned into a bad movie.\n\nNana and Anil were the only saving faces in this movie.\n\nThumbs down.. Well, come back."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "Vikram19867",
        "review_rating": "1",
        "review_title": "The most awful bollywood movie released in 2015",
        "review_detailed_main": "I am an avid cinema goer and reviewer and have seen a lot of movies in my life. Some good, some that don't make any sense, some extraordinary.\n\nBut then there are some that make you doubt the existence of commercial cinema. Is it just to cash in money by fooling it's audience, or is it supposed to be a good appreciable body of work. Unfortunately, this is the former.\n\nThis is hands down the worst commercial Indian movie I have seen to date. Incredibly loud, nonsensical cinema. This movie was a nightmare to sit through, just plain awful.\n\nIt deserves 1 star for Anil Kapoor's and Nana Patekar's performances, which are the only saving grace in this unwatchable piece of Hindi cinema.\n\nWatch it if you please, and carry some earplugs. Thereafter, You'll agree with all of the above, I guarantee you."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "yashjoshi-89880",
        "review_rating": "4",
        "review_title": "movie is not good...",
        "review_detailed_main": "As compared to it's first part this sequel is a cr*p. The directors wanted to revive the popularity of it's first movie and came out with a fail.Except the acting of the three actors Nana Patekar,Paresh Rawal,Anil Kapoor there is nothing to watch in this movie.The story is not up to the mark.why on earth they took John Abraham and Shruti Hassan in the lead role!the acting of both of them is quite disappointing and they are'nt good as couple as well. Music is also used previously in some other movie. Please don't watch the movie if you don't want to fade away the memories of the movie Welcome.overall i would give 4 out of 10."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "6",
        "review_title": "Too much predictable and childish yet entertaining",
        "review_detailed_main": "WELCOME BACK REVIEW- When Welcome released i was 17 years old and that time i never used to watch movies in theater. But watched it on TV and felt very very bad that why i did not watch it in theater. Felt like i missed the gem of comedy cinema. Seen it almost 50+times and i am big fan of Welcome movie. Since then i am waiting for it sequel like anything but when watched 1st trailer of Welcome Back i didn't find it impressive then 2nd trailer came and it was better than 1st trailer. But movie generated enough buzz for me because of those 2 trailers but i wasn't expecting a gem of comedy like its prequel. My expectations were neither low nor high. And after watching it today in theater,i say it was a good movie really. Obviously, you cant expect better movie than Welcome if you are sensible comedy lover so this one has comedy but not sensible at all. Even i thought this one will be a crap movie but movie proved me wrong. First half entertains you lot with punches and some crispy dialogues by setting plot of the movie. Story is exactly opposite to its prequel's story i don't wanna expose it now cause it will kill all fun of watching it for movie lovers. But second half drags its not as good as first half. It has no sense at all, too many childish and vfx scenes are there which looks really crap. And movie ends at unsatisfying note which really hurts audience. Now lets move on to actors, the first name comes in mind is Nana Patekar. The leader of this movie army, has a best role in the movie. Shines like a Prime Star, steals the show on his dialogue delivery and accent. Then second star is Anil Kapoor who had second best role. These two are enough to entertain you but you get extra bonus here in the form of Paresh Rawal. Another fine performance by fine actor. John's accent was too loud and too tapori. Sometimes it feels irritating, not appreciable at all. Shruti Hasan looks good but her dialogues and accent remains same as she does in every movie. Nasiruddin Shah did whatever director told him but i didn't find it impressive. Other supporting star cast were good as it was in Welcome. Music is a big disappointment here. Its prequel had chart buster music but Welcome Back doesn't even got a single hit song. Really music composer definitely deserves some bad words from everybody. Screenplay was smartly written but not completely it has some minuses at some scenes it was too predictable. Production is high scale shot the film on gorgeous locations. Director Anees Bazmi tried to give his best but failed to make a successful gem like Welcome. Still he gave some mind blowing scenes and dialogues to be remembered for long time. Overall a good family entertainer for all ages and all kind of audiences. Classes wont like film that much as masses would but both will find it A Paisa Vasool Entertainer. Go and watch Welcome Back enjoy your time but don't expect much and do not compare it with Welcome. 6 * stars by me."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "mayanklouteriya",
        "review_rating": "3",
        "review_title": "Just to time pass... - itsbymayank",
        "review_detailed_main": "Me and my brother was hoping for a great fun But we get nothing.. After sometime director #Aneez will regret for movie and Now I get why #Akshaykumar said no for this movie. Bad script.. #John does good work. And and and uday and majnu are the characters or I'll say very interesting characters but because of the bad script they were also nothing. #Nasuruddin As wanted.. He did nothing.. I was missing #RDX. #Ferozkhan.. only 3 characters are worth to watch.. #John #Nanapatekar #Anilkapoor.. And All were just Fillintheblanks.. I only laughed very hard on graveyard scene. Only. Because this 3 was there.. Overall movie is OK .. Not worthy.. Watch it for few funny scenes.. If you are big/very big fan of John Nana Anil then Go.. Songs are skippable even movie's some parts are too.."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "rhautm",
        "review_rating": "8",
        "review_title": "entertaining comedy movie, under-rated by critics",
        "review_detailed_main": "it is a full paisa vasool movie, everybody was laughing in cinema hall,\n\nwe enjoyed the movie a lot. the punches are very good. dialogs and acting all is very good.\n\nAnd the hotels of Dubai where most of the movie has been shot are luxurious and beautiful.\n\nthe ghost sequence was very good.\n\nthe weakest point is the actress who played role of princess of najabgarh, seriously I missed mallika sherawat, she was brilliant.\n\njohn Abraham is OK. Anil Kapoor, nana patekar and paresh rawal are very good."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "mukherjeesubham93",
        "review_rating": "6",
        "review_title": "Dumb, stupid, but......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "bobbysing",
        "review_rating": "3",
        "review_title": "A dialogue from the film sums it up the best as \"Mazaaq Tha Bhai Mazaaq\".",
        "review_detailed_main": "The latest trend of making sequels and getting a huge advantage of the brand-value created by its original film has clearly given a new life to some directors, evidently seen in the past few years. And riding on the success achieved by WELCOME in 2007, here comes its sequel WELCOME BACK that desperately tries to repeat the same box office results with an overstuffed, bad script that marginally gets supported by some good dialogues and key performances generating only a few enjoyable moments coming at long intervals.\n\nAssuming the viewers, ready to accept a comedy just because of its big star-cast, lavish foreign locations and a well-designed publicity campaign, WELCOME BACK clearly follows the typical Bollywood pattern of churning out mindless comedies and denies trying anything novel in terms of narration, characterization or storytelling whatsoever. Moreover following the same old clichéd approach, the silliest feature of the film remains the amazing fact that they have actually made a sequel on almost the same storyline with a few added sub-plots just for the sake of addition. And thus offer 'everything seen before' in terms of content (plot) despite having all highly entertaining characters led by Majnu Bhai.\n\nThe film begins with a quite energy-less title music and then the same calmly continues in the entire first half with three songs including an item number with absurd lyrics as,\"Main Babli Hui Tu Bunty Hua, Band Kamrey Mein Twenty Twenty Hua\". Still one doesn't mind watching it all expecting a much compensating second half, only to find it even worse than the first to be precise. In other words, after the senseless crows declare the intermission (competing with the pigeons of the prequel) the film simply offers nothing except a fairly enjoyable sequence at the graveyard in its second half and then has a highly childish and illogically conceived climax truly forcing you to wonder that\"How on earth did anybody find the guts to spend 100 big crores on this insane mess?\"\n\nIn the technical department, the DOP successfully manages to give it a grand look but the background score constantly keeps pulling it backwards with a quite lifeless arrangement. Music has nothing great to write about in spite of the famous catchy phrase of its title track, whereas the well written dialogues keep trying hard to deliver the expected entertainment at intervals generating the much awaited laughs.\n\nComing to the performances WELCOME BACK becomes barely watchable because of Anil Kapoor alone who probably has forgotten to grow old since many years. The 'Jhakaas man' is just perfect playing the entertaining Majnu bhai but both Nana Patekar and Paresh Rawal are only there to provide the much needed continuity in a sequel. Besides the two major replacements as John Abraham in place of Akshay Kumar and Naseeruddin Shah instead of the charismatic Feroz Khan, turn out to be quite poor choices made falling flat right from the word go unarguably. Plus it was quite sad to see Dimple Kapadia and Shiny Ahuja playing two stupid characters along with the unimpressive Shruti Hassan and Ankita Shrivastava only there to fulfill the glamour requirement\n\nIn all, if only a few enjoyable scenes here and there in a 150 minutes (tediously) long film, shot lavishly in Dubai, with a completely lackluster background score as well as poor soundtrack, supported by only one enjoyable act from Majnu Bhai, ending with some surprisingly amateurish computer graphics excites you well, then the choice is all yours, otherwise just wait till you get to see it on a leading TV channel after a couple of months."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "zaildarkaka",
        "review_rating": "5",
        "review_title": "crap",
        "review_detailed_main": "5 stars are strictly for Anil Kapoor and Nana Patekar. The is worse rather i would say movie has no story Punches of different movies are combined .The only saving grace in the movie are two people and their chemistry with each other, Anil Kapoor and Nana Patekar. Their hilarious camaraderie manages to keep the movie afloat. John Abraham has done his best, could not really expect more from him. Naseeruddin Shah tries his best to justice to the blind don role, but even a classic guy can do only so much to save a film, Shruti Haasan is there but not exactly there in the movie, meaning her role is quite small amidst all the commotion in the movie. Direction: Co-writer and director Anees Bazmee and done a major blunder in this movie. Had he tried a little more, he could have really out forward an entertaining comedy film but he prefers to stick with a boring screenplay and well that's about it. There is nothing new in the movie, just a few gag scenes which tickle your funny bone! 5 stars are strictly for Anil Kapoor and Nana Patekar"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "winak",
        "review_rating": "3",
        "review_title": "Welcome Headache, goodbye entertainment",
        "review_detailed_main": "Comedy is not John Abraham's forte, for a good reason. He must steer clear of any comedy movies as he does not have any comic timing nor the expression to pull it off. Naseerudin who takes pride in his acting skills seems to be out of sorts. It looks like money was the deciding factor in accepting this garbage role. Shiney Ahuja was ridiculous in his stupid role. Nana Patekar and Anil Kapoor weren't as funny as in the first edition. Dimple went unnoticed in this nondescript role. Shruti Hasan just added to the miscast. The new actress Ankita overacted to irritating levels. There was no mirth in the dialogues, so calling this a comedic movie would be a shame. This seems to be a hurriedly made movie without much thought only to encash on the popularity of the first edition \"Welcome\". This movie shows how to kill a promising series."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "nkd-15796",
        "review_rating": "3",
        "review_title": "A serious disappointment in terms of everything",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "Shanmeinhoonna",
        "review_rating": "3",
        "review_title": "Disappointment - Flop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "asad_tanvir_18",
        "review_rating": "2",
        "review_title": "Not a Single Laugh... in more then 2 hours",
        "review_detailed_main": "I think John Abraham is only for flop remakes, like this and shot out at wadala. This movies is a total disaster, even Anil Kapoor, Nana and Paresh Rawal couldn't save the movie. Naseer Uddin Shah is not for movie like this. Don't ever watch this movie."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "anupapu8",
        "review_rating": "6",
        "review_title": "Even Mindless script can be better Then This..Thanks to Nana and Anil who made it a time pass",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "rpuyasi-945-677914",
        "review_rating": "1",
        "review_title": "Worst movie of 2015",
        "review_detailed_main": "Yes. This film is nothing but a very large piece of garbage. I have never guessed that Mr.Anil Kapoor could be seen in such a pathetic movie. There is nothing good about this film. But what make me most sad is that this film is full of talented people such as Anil Kapoor, Nana Patekar and John Ebraham. I liked almost all of their films. So when I first heard about this film I though that this could me an awesome movie. But I had to work hard even to watch the full film. This film simply does not have a story. If there is that should be the weakest plot that ever created in the Bollywood film industry. I strongly advice these super stars to at least read there scripts carefully before agreeing to take a film. Unless they would break their fans hearts so bad."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "cricketfanshenvi",
        "review_rating": "9",
        "review_title": "152 Minutes Of Unlimited Laughter",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "maulin5",
        "review_rating": "6",
        "review_title": "Predictable, but Entertainer! Bhais are rocking!",
        "review_detailed_main": "A sequel of a 2007 blockbuster, Welcome! Welcome became a huge hit, and after that, Aneez Bazmee didn't get any success through his films, so he decided to make a sequel and be successful once more. In the sequel, Akshay Kumar is missing. While, Anil Kapoor as Majnubhai and Nana Patekar as Uday Shetty are remain as it is to entertain the audience through their antic styles and behavior. Paresh Rawal is little bit dull as Dr.Ghungharu as compare to Welcome. RDX has been replaced by Wantedbhai, and Naseeruddin Shah plays it nicely, and entertains too. John Abraham is in the lead, he tries new styles and body language, but fails to impress. Shruti Hasan is as usual okay. Dimple Kapadiya has nothing to do. Shine Ahuja is back, but fails to mark his presence among this bigger casts. New heroine is very poor in acting. Special mansion for Rajpal Yadav, who had only two scenes, but audience is enjoying his presence in the hall. Plus points : The name itself, Welcome. Then Uday-Majnu's chemistry, Graveyard scene, funniest one liners even better than Welcome. Mostly enjoyable parts except the climax. Minus points : Poor music and poor lyrics, unnecessary songs, boring fight scenes, and the most importantly, stupid climax sequence, in which John is running on camels or bomb type helicopters or you can say the whole climax. It is a very very dumb attempt, if they don't have much money than why the hell they planned it to shoot and that also in poor vfx. This is showing the poor thing of Bollywood. No need to do an outdoor shoot if you can't afford it or you don't have the knowledge of how to shoot! So, audience are going to the theater and movie is earning a bigger amount. It's up to you to watch or not. It will also going to be hit on TV. So, if you skip this in theater, no worry, the TV channels will be telecast this probably every weekend!"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "Abdulxoxo",
        "review_rating": "4",
        "review_title": "Lame movie",
        "review_detailed_main": "This is a lame movie. I wasn't aware this is a sequel to an original movie until after watching this one. Either way it doesn't matter now, all I know I'm never gonna waste my time on any movie associated with this one. This film's premise is ridiculous to begin with. It doesn't makes sense. The plot (if there's an any) is thin and dragged on forever. It heavily relies on a stupid kinda love triangle between two old guys and a young macho guy and a young addict guy. Gags were ove-the-top silly and cringey. Music is trash. Fight and dance choreography were nothing to write home about. One positive thing I could say though, it that the movie is good to look at - lavish costumes, stylish production design, exotic locations etc were what save the film and the good casts (but were utterly wasted).\n\nThis poorly written, hopelessly directed, cheap vfx, mediocre film shouldn't be even made on the excuse that it's a silly comedy or masala entertainment, even the genre deserves better. Overall, a big waste of time of the talented casts as well as the viewers."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "rihaans",
        "review_rating": "7",
        "review_title": "Welcome Back review",
        "review_detailed_main": "Story 4/10: the story for welcome back is just about the same as welcome just with a few minor changes. The first half movie is a treat to watch. It does get messy for 20 minutes after the interval but catches its grip back but the climax just spoils a well made movie and comes as a huge disappointment.\n\nSetting 10/10: the setting of Dubai is probably the best you can get in any movie\n\nActing 7/10: john Abraham in this act is passable and i think we did miss Akshay Kumar although i don't think Akshay could have done a Goonda Mavali type act. Shruti Hassan needs to change her profession. She doesn't have the right voice and neither expressions. Dimple is passable too as you see her once in a while. Now coming to the heroes of the film Nana Patekar, Anil Kapoor who really drive this film all along and also Paresh Rawal who i had wished to see more of, did do well in his little cameo.\n\nComedy 10/10: it was like a laughter riot. It kept our smiles till the end. The cemetery part was probably the funniest. But as i said only the 3 versatile actors, Nana, Anil and Paresh deliver the jokes with great timing.\n\nWatch/not: its worth your money and if you leave your brains home, you will enjoy the comedy."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "si-manoj29",
        "review_rating": "10",
        "review_title": "Best Comedy Film... Laugh-out-loud movie...make you laugh at every dialogues",
        "review_detailed_main": "Full Comedy movie, Enjoyed a lot. worth watching... Very Funny. Just cant stop laughing loudly throughout the movie. Best Comedy Film after long time.\n\nDialogues are laughing crackers...make you laugh at every dialogues\n\nInshort, Having said good bye to their underworld activities, Uday Shetty and his brother Manju have set up their own business in Dubai. They are in search of a suitable bride for their sister Ranjana (Shruti Haasan), but she falls in love with a gangster Ajju Bhai (John Abraham). The film revolves around the lives of these gangsters and their sister's blooming romance with Ajju which promises to be a crazy ride full of entertainment and laughter."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "namashi_1",
        "review_rating": "7",
        "review_title": "Truly Funny!",
        "review_detailed_main": "A sequel to the 2007 smash hit Welcome, Anees Bazmee's 'Welcome Back' is a joyride, that delivers some truly laugh-out-loud moments. It doesn't make sense nor is it particularly sharp, but overall, the flow of laughs are on the higher side. I enjoyed myself!\n\n'Welcome Back' Synopsis: Uday Shetty and Majnu Bhai have left the underworld, they are now big businessmen & have also managed to fall in love. But, one day, they realize they have another sister, who later falls in love with a thug. Chaos Follows...\n\n'Welcome Back' has a fairly catchy plot, that certainly stretches itself a bit too much. However, the gags & the consistently funny one-liners will leave you splits. The Bromance between Uday & Manju (played by Nana Patekar & Anil Kapoor, both in top-form) is the highpoint of the enterprise. Not only do they get the best of roles, but also the best of dialogue & sequences. I'd like to single out that one sequence in the second-hour, which takes place in a graveyard, its simply hilarious!\n\nBut, the climax is such a letdown. Agreed, we aren't even looking for logic remotely till we reach this point, but the culmination is a mess. Its not funny & also too long. Also, the second-hour, in totality, isn't as much fun as the first-hour, thats because the sub-plot involving Wanted Bhai (played by Naseeruddin Shah), doesn't really work!\n\nBazmee's Screenplay is fun. His Writing surrenders to non-sense, but most of the bits, work. A Special Mention for Raj Shandaliya's hilarious dialogue, that tickle your funny-bone almost throughout. Kabir Lal's Cinematography is lavish, capturing the exotic locales of Dubai, most accurately. Editing is good, but could've been sharper. Music by Various Artists is energetic. Action-Sequences are over-the-top.\n\nPerformance-Wise: Nana Patekar & Anil Kapoor are the life & soul of 'Welcome Back'. The legendary actors share an infectious chemistry on-screen & deliver the highest amount of laughs all through the film. Supporting them is Paresh Rawal, who despite limited screen-time, is simply fantastic as Dr. Ghunghroo. John Abraham is okay, although he makes a sincere effort to portray the part. Shruti Hassan is motionless. Dimple Kapadia is first-rate. Ankita Shrivastava is passable. Naseeruddin Shah & Shiny Ahuja are wasted. Rajpal Yadav, Adi Irani & others lend great support.\n\nOn the whole, 'Welcome Back' is an entertainer, that is even better than its prequel. Go, have a good laugh!"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "rmanjuesh",
        "review_rating": "7",
        "review_title": "Enjoyment from first to last",
        "review_detailed_main": "Welcome back is enjoyment from first to last. It is a whole family entertainment. There are double jokes, location are all good, non remembering songs. The dons (Shetty and Majnu) of yesterday Welcome, who have now turned respectful are still searching for their brides and bride groom for Shetty sister\n\nIt remains to be seen whether they end up with brides for them an bridegroom for their sister from a respectful family.\n\nOr they will have to leave their respectful life and turn to old DON life to meet their needs\n\nAll the characters have given their best performance."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "hebaqureshi",
        "review_rating": "10",
        "review_title": "Best Comedy Movie of 2015",
        "review_detailed_main": "This movie was hands down good. Anil Kapoor did amazing acting not only him almost every one did. Even John Abraham was great. This is an hilarious movie and worth to watch. I don't think that you should just go on one persons review and decide whether to watch the movie or not. But as for me in my opinion it was hands down the best comedy movie I've seen this whole year. I think people who enjoy these type of hilarious and romantic movies will really enjoy this. I was told by one of my family member who watched this movie that it was stupid but ever since I saw the trailer I was dying to watch the movie and my aunt wasn't going to stop me from watching it. And after all watching it was the best thing ever so I would suggest you watch it and Anil Kapoor, Nana Patekar, John Abraham, Paresh Rawal, Shruti Hasan. These are all amazing actors and my favorite so I would have watched it no matter what."
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "altaf42049",
        "review_rating": "6",
        "review_title": "Comic, Hilarious and Entertaining",
        "review_detailed_main": "The sequel to 2007 Welcome is finally out in the theaters and it delivered as per the expectations. A minor variation has been done in the cast for lead roles but they fitted nicely in the whole plot. The story line is similar to the previous one yet it is entertaining, fresh and smooth. Udday Shetty (NANA PATEKAR) and Majnu Bhai (ANIL KAPOOR) has left the under world and has become respected businessmen in Dubai. They unfortunately fall in love for the same girl but can not marry her till the time their sister Ranjhana (Shruti Hassan) is not married. To find a suitable groom for her, they once again approach their Samdhee Dr Ghungroo (Paresh Rawal) who tells them about his step son (John Abraham) Ajju Bhai from Mumbai. Ajju who has already met Ranjhana in Mumbai and decided to get married subject to Ranjhana's brother Udday's approval. Ajju and Ranjhana goes to Dubai to meet Udday. From here on the story develops twists, turns and U-turns. Here enters wanted bhai (Naseeruddin Shah) in the story whose son (Shiny Ahuja) is also interested in Ranjhana but udday and Majnu are not approving it. How the story reaches its climax is interesting to watch. The highlight of the movie is its dialogues and comic timing. All the characters fit in very nicely. Cinematography, background score, editing and casting is well knitted and craftly directed. Fans of Paresh Rawal, Anil Kapoor and Nana Patekar would surely love their performance and comedy. John Abraham has improved his acting dancing and dialogue delivery in a great way and comes out very fresh and inspiring. However, there are few grey areas in the whole plot which makes movie boring especially in the second half. Also the climax has been unnecessarily exaggerated and prolonged. Moreover the music of the movie is not as great as the part one delivered. But all and all, a good movie to be watched on the weekends for reasons of smile, happiness and comedy. A thumbs up for Mr Anees Bazmi for delivering yet again another good comic movie and a kiss for Nana Patekar, Anil Kapoor and Paresh Rawal!!!"
    },
    {
        "movie_id": "tt3159708",
        "movie_name": "Welcome Back",
        "movie_rating": "4.3",
        "review_username": "Raja79",
        "review_rating": "10",
        "review_title": "What An Entertaining Movie!",
        "review_detailed_main": "I don't understand why the rating of this movie is so low because this movie is just so fricking entertaining.\n\nThe performance of John Abraham was great in this movie and the ending of this movie in the desert island was just THE BEST and most entertaining.\n\nEven the songs are amazing! I love this movie!"
    }
]