[
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "nsvkfacebook",
        "review_rating": "3",
        "review_title": "Inane and Pedestrian!",
        "review_detailed_main": "TEES MAAR KHAN Bollywood is replete with examples of fetishes of film makers who closely associate these fetishes with the success of their films. The earliest example is that of film maker J Omprakash who always wanted his movie titles to begin with A; and in recent times we have the example of Karan Johar, who has a similar fetish with the letter K. Farah Khan, who began her career as a choreographer and quickly moved into the shoes of another Khan choreographer (Saroj Khan) quickly won a lot of acclaim for her work and then decided to expand her role to include film direction. Having got the box-office ringing with her first two ventures, MAIN HOON NA and OM SHANTI OM (both of which had Shah Rukh Khan playing the lead), she perhaps concluded that since both the films had three words, three is a lucky number for her. So soon after the success of the first two movies, she gave birth to triplets and her husband, an electronics engineer, Shirish Kunder and she floated a production house called Three's Company! She also perhaps knew that the presence of Shah Rukh Khan in the first two movies was a big factor for the success of those movies, but because she was not having him in her next movie (I will not go into the reasons for that here), she felt that the word KHAN appearing in the title would help. When she was finding it difficult to combine the word KHAN with her fetish for \"TEEN\" to get the title of her new movie, I presume a well-wisher perhaps told her that using a multiplication factor of ten would triple the chances of the movie's success; thus the word \"TEES\" came into the title. The choice of the third word was relatively easy, since the phrase TEES MAAR KHAN connoted a braggart and which was in tune with the character of the script itself. The next exercise was to find an inspiration for this tale and happily for her, that was also a three worded Peter Sellers starrer: AFTER THE FOX. Also, perhaps other well wishers suggested to her that she must have as many Ks as was possible in the film crew and therefore had her husband Kunder work for the background music, write(?) the story, co-produce and write some of the lyrics. The star cast also had a number of Ks: AKshay Kumar, AKshaye Khanna, Katrina Kaif, Sachin KhedeKar and special artistes like Salman Khan and Anil Kapoor! Now about the movie itself. Claiming to be a parody, it turns out to be a rather inane effort. Several scenes of the movie looked utterly pedestrian both in conception and execution and the only saving grace is the performance of Akshaye Khanna in the role of an Oscar hungry actor. Of course, the review will not be complete without the mention of the much touted Sheela Ki Jawaani number by Katrina Kaif; but Katrina with her innocent looks doesn't ooze with oomph despite the raunchy lyrics and the dance movements. I would rate Munni Badnaam from Dabangg (also choreographed by Farah) as a better song although the joke which I heard when I was coming out from the theatre was: Agar Sheela Ki Jawaani Pehle Aati, to Munni Badnaam Na Hoti!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "zainlalani",
        "review_rating": "2",
        "review_title": "Absolute rubbish",
        "review_detailed_main": "What kind of a film is this? There is no story whatsoever, not one joke is funny and everyone screams, screams, screams and screams in the film till you want to kill yourself in frustration.\n\nAll the jokes in the film are in poor taste and just about everyone is made fun of. This is the kind of film that makes you wonder whether the writers of the film have any common sense or rather, does this film have any writer in the first place.\n\nThe only saving grace is Akshaye Khanna who is in form and performs well as the Oscar-hungry actor.\n\nIt seems as if Akshay Kumar wants to end his film career by choosing to do films such as this and his string of pathetic films in the past 2 years.\n\nDirector Farah Khan has shown a lot of promise in her first 2 films and must write scripts herself instead of entrusting this responsibility to others.\n\nShiela Ki Jawani has been superbly choreographed and the end credits are in trademark Farah Khan style.\n\nBut are you ready to endure two hours of torture for 10 minutes of fun? Trust me, it's not worth it.\n\nA nonsensical, idiotic, lame and senseless film. Avoid it at all costs."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sumanthkg-1",
        "review_rating": "3",
        "review_title": "Underwhelming experience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "Saayer",
        "review_rating": "1",
        "review_title": "I Feel Cheated",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "preetanshamilani",
        "review_rating": "1",
        "review_title": "TMK \"I need my money back or I should get rewarded to handle this jigsaw kind of torture\"",
        "review_detailed_main": "Just watch \"After the Fox (aka Caccia alla volpe released in 1966 US n UK)\" it's totally copied from that and therefore no need to say about the movie, more frankly; script needs a super computer to understand and then let others understand that what was happening in it, I live in Mumbai and I admire Akshay Kumar a lot, n believe me this TMK \"Sucks\"; only stars can't make good movie u need a \"script\" and here it's all messy, farah should love her husband but don't pamper him by making a bogus movie on his stupid script, this movie is worthless 4 those who have brain and completely made for zombies (brainless), katrina is beautiful but she failed here so as farah's nonsense direction, so don't misguide people because it's their hard earned money and should not be get fooled.... have a great life cya...... advice to farah plz don't direct movies u r making us (indians) look like a fool in front of the international cinema, akshay plz read script b4 u sign anything, katrina u need serious acting lessons don't b a dumb, and to writers plz get a life and stop copying movies from Hollywood, don't ruin Indian cinema... TMK is just awful and a great shame in terms of cinema"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "tareque-laskar",
        "review_rating": "1",
        "review_title": "What the FK is going on?",
        "review_detailed_main": "Farah Khan (FK) seems to have lost her bearings with this one. Being fun loving and irreverent is one thing, but making a movie full of PJs is really pushing it! Akshay Kumar's brand of comedy seems completely out of sync with Farah's brand of humor and the result is a disaster only made tolerable if you are salivating over Katrina Kaif grooving to 'Sheila Ki Jawani' or seeing Akshay and Salman dance together. The script is pretty nonsensical and a stretch even by outrageous plot standards (a conman making a fake movie and convincing a big Bollywood star that it will win an Oscar? Seriously, give me a break!!) and the jokes are pretty weak all through. Tees Maar Khan, for lack of a worser word, is utter trash!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "shehzada0",
        "review_rating": "",
        "review_title": "One of the most irritating movie of all time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "goldie-moon1990",
        "review_rating": "1",
        "review_title": "Not a movie!!!!!!!!",
        "review_detailed_main": "This wasn't a movie it was \"the change\" in passive sense.it was a bloody slap on the face of Indian cinema entertainment.nothing was of sense ,cant be categorized under any category.was it done just for money making by taking big stars and releasing on Christmas. May god Save the Indian cinema from the bad effects of upcoming nonsense movies Like this. Never watch this movie .... Few stupid things to be noticed: -- -poor jokes, poorly executed action sequences –dialogues full of overacting. –good actors were not able to show their talents due to bad direction and poor script. –promotion was done as if a blockbuster movie was going to be released.\n\nA strict law should be made to check the movie's quality before its release, because its just like robbing viewers pocket in a gentle way .."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "monazagillani",
        "review_rating": "1",
        "review_title": "Extremely Awful",
        "review_detailed_main": "Watching Tees Maar Khan was an underwhelming experience. I went in to this movie with mixed expectations. I had high expectations based on Farah Khan's previous efforts - \"Main Hoon Naa\" and \"Om Shanti Om\". At the same time I was not fascinated with Shirish Kunder's \"Jaan-E-Mann\" but this movie is even worse.\n\nI was so stupid that i thought this Comedy would be better than the other comedies that were out this year, but i was so wrong once again. Bollywood movies are so much disappointing me, like never before. what is happening. i am so stupid i expected a good movie from the great Farah Khan. the music already wasn't much impressive, considering Vishal Shekar's other 3 movies.\n\nStory was very much weak and completely annoying. screenplay was weak. nothing great about this movie anything. disappointing. silly bad movie."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "mayankgates",
        "review_rating": "1",
        "review_title": "Worst Movie of 2010",
        "review_detailed_main": "TMK is the worst movie of 2010. The story is awful and direction of Farah Khan is even more awful. I wish Farah had put more effort in script rather than songs. Apart from Akshay Kumar nothing is this movie is good. Some of his cheeky dialogues will make you laugh but again its not worth to watch the movie.\n\nMovie has copied several scenes from various movies and Farah has tried to put all Masala in the movie for which she is famous for. But unfortunately story don't have the weight to carry this movie. Senseless jokes are not going to make a movie entertaining.\n\nDon't watch the movie. That's my verdict. Forget about previous movies of Farah Khan, they were good because of SRK and the direction tips she were getting from Karan Johar. This movie seems good only during the songs.\n\nWorst movie of 2010."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "dubey-saurav",
        "review_rating": "1",
        "review_title": "New scams on rise!!!",
        "review_detailed_main": "I tried to see this movie last night with my wife in a multiplex called PVR Cinemas.\n\nI divested Rs. 540/- as ticket charges on the movie. One by one i was getting signals from nature not to see the movie. Like first i did not get enough time to get my favorite sub at Subway, but i thought i'll buy nachos inside PVR. Even inside i didn't get nachos, on top of that i also did not get the sandwich inside PVR. I ignored all these bad signs and went ahead to see this AWFUL, CREEPY, MINDLESS movie.\n\nAkshay kumar once knew acting, he may know it now also but the great director Farah Khan is utilizing all her resources to bring the man (Akshay) down by using cheapest of cheapest PJ's in the movie. I wonder who write these, moreover who approves these... Once upon a time she also made a movie known as \"Main Hoon Na\" which i liked to some extent as it is a light hearted movie, but TMK is not something i expected.\n\nI still like akshay as a hero/actor, he has done so many good movies.I beg him not to do movie like these, plz plz plz.\n\nBelieve me friends you can laugh at least 100000000000 times more by just watching 1 performance of any character in Comedy Circus.( i don't know how many zeor's i added here because of frustration) Please avoid this movie to save yourself from heart attack.\n\nLast night i have vowed not to see any forthcoming Farah khan's movie unless and until i get at least 100 out of 100 good reviews.\n\nI think this is a scam by which Hindi film industry is trying to make films which ppl will leave before ending (like i got 15 minutes after the interval) and they still have to pay money for the full movie."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "aishahussain-33050",
        "review_rating": "10",
        "review_title": "I have to give it 10 stars because the humor was just out of this world",
        "review_detailed_main": "I do understand people's frustration, BUT, that being said, this film was amazing. I loved it so much because the story and songs and dialogues were so unique and new. I don't know why at the time when it came out 13 years ago so many people hated it, but I've watched it dozens of times and it was just so refreshing each time. I don't understand why everyone always refers to this film when discussing flops. I loved this film because the humor was just so good and watching it each time brings back the nostalgia. It's just really funny and iconic, especially all of the songs were iconic and the story was also really unique and different."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "dhirenjb",
        "review_rating": "7",
        "review_title": "Why does everyone hate this movie so much?",
        "review_detailed_main": "I thought this movie was incredibly hilarious. The makers tried to introduce a different type of humor thats more commonly found in western films. Maybe the Indian audience is not able to relate to it, and thats ok.\n\nIf you like movies such Zoolander, Ace Ventura, sausage party, give this one a shot and you might like this as I did too!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "NolanFan7",
        "review_rating": "1",
        "review_title": "want to take revenge from your enemy? just tell him to watch this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "pbarthur",
        "review_rating": "1",
        "review_title": "Would never suggest this movie to my foes",
        "review_detailed_main": "Don't worry I don't intend to dish out spoilers, giving away the synopsis or plot or even a hint on the story line. The movie opens with Sanjay Dutt narrating the hind sight into the protagonist's current state of affairs. I was wondering why Sanjay Dutt's voice was chosen, my roommate was kind enough to educate me on this choice. To start with Sanjay Dutt's voice is kind of synonymous with the comical negative character (read gangster, thief ...), attributed to the fame of Munna of Munna Bhai M.B.B.S. The start to the movie though does not leave a bad taste in the mouth, is not what a comedy flick should begin with.\n\nThe movie lacks a theme or story line that would inherently support the intended comedy. For most part of the movie it seemed that the actors are trying in desperation to make the audience laugh. For example, a meeting of top cops of Mumbai chaired by the commissioner discusses the possibility (or a lack) of ancient treasures getting stolen. Gibberish is introduced in the form of a participant interrupting the speaker every few seconds. These puns cry for a few laughs at best, and in time become annoying.\n\nAkshay Kumar seems to have made a resolve to sink deeper with every new comedy flick; TMK adds value to that resolve. With such frivolous plot, the burden of carrying the movie rested solely on the shoulders of the actors, and they have done a fine job of letting that slip. Katrina Kaif with little or no role in the plot was intentionally brought in for her dancing prowess. I would suggest she take more dance classes before venturing this path again. Moving on to Akshaye Kanna, I'm not sure as to the link between his role and comical intent of the movie. His claim of donning a guest role in this movie is weak, he is present on screen through most of second half. This movie probably will do more damage to his acting career than fix it. The background scores and the songs are definitely not worth mentioning, half the numbers are remixes thus taking away the need for remix artists and DJs. None of the songs are worth humming, even the sticky \"Sheila ki Jawani\" with its bad hinglish lyrics. The movie sports an occasional burst of a kid shouting \"Tees Maar Khan\", ruining the few laughs for your money.\n\nTMK is bad rip from a 1966 movie \"After the fox\", which was a fun movie with character. TMK's story line is like evoking laughter by beating below the belt. The script fails to build the lead actor's character and hence does not muster any sort of harmony from the audience; it fails to evoke any kind of sympathy for the lead role as the story line jumps from comical to scary and to serious. The transitions, being abrupt keep the audience guessing the genre of the movie through its length.\n\nHalf way through the movie the story line, actors, guest actors completely lose direction and wander in different direction. Some sequences either have no bearing on the movie or lack the chaining required in storytelling. The director seems to have lost the purpose when it crosses the half way mark. Many of the obvious realities have been over looked or abandoned to make room for mindless comedy which by the ways fails to make people laugh.\n\nA few takeaways from the movie, There are many ways to make the audience laugh; this probably is the worst way. Now that the benchmark for the worst, other would only need to just do incrementally better. This movie is a must watch to expand your scales for rating movies. I have expended time and money in watching this movie, I urge you to watch this movie to make me look less gullible."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "v_manglani",
        "review_rating": "1",
        "review_title": "Unbearable Nonsense",
        "review_detailed_main": "I didn't expect much from the movie, but was hoping to have a few good laughs as I was going to watch a movie in a theater after a long time. I was disappointed. Total nonsense from start to finish. Colorful sets/clothing and item numbers are not enough for a 2+ hour movie. Not sure what the writer and director where thinking, but I guess they tried to mix and match or spoof movies like Austin Powers and Sholay to name a few. Storyline was non existent and they never even bothered to tie the loose ends.\n\nIn any case, the end result is a useless movie with not much to talk about(IMDb forced me to write 10 lines)"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ravi_seattle",
        "review_rating": "1",
        "review_title": "Stay away as if it is plague",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "rkmonga",
        "review_rating": "1",
        "review_title": "Utter Nonsense",
        "review_detailed_main": "I have said it all in the summary. Farah Khan has no brains and seems quite proud of that. Either that or she thinks the audience has none and looks down upon them through the film. I need to write 10 lines for a review but the film isn't even worth that many lines of criticism. Akshay Kumar seems to have gone mad or desperate being part of such lame stuff. First with her brother in Houseful and now this. Comedy isn't about obnoxiously overdone loud gestures. To make an audience laugh one needs to think. Shirish Kunder deserves a slap on the face for his effort in the 'thought' department. 'Sheila ki Jawani' is all that the movie has to offer but that can be seen at home on the television."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "harshkrg",
        "review_rating": "1",
        "review_title": "Money n Time Waster",
        "review_detailed_main": "Farah Khan in first place is a choreographer and does not know how to make a movie. She does not fit in a place of director. This movie can be considered like a lay man making a movie for the first time in life and jumbles it all up.\n\nTMK is a total disaster in Indian Cinema. This movie combines all Indian Movie scenes copied in one film which makes it a total mixture or call it Mix Bhel. This movie has a bit of good acting from Akshay Kumar rest of the cast does over acting in the film. The story line is nowhere seen in the whole script and it makes your head feel terrible when you exit the cinema hall. For the part songs 'Sheela Ki Jawani' & the title track are at least audible but the rest are more annoying. Overall I think i cant even rate this movie but for sake of a rating I would give it a 1 out of 10. So watch it at your risk."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "miglani76",
        "review_rating": "3",
        "review_title": "Boring, Insufferable, Avoidable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "pankaj-kalwani-1",
        "review_rating": "2",
        "review_title": "Crap",
        "review_detailed_main": "What a pathetic attempt at movie making?\n\nI knew before hand what to expect of a Farah Khan product. But this one surpasses my expectation. And not in a good way.\n\nNothing about the movie is funny or sensible. The spoofs and the humor do not click. This movie is just plain pathetic low budget flick.\n\nThe good part about this movie being low budget is that the marketing and song attraction will definitely generate enough footfalls to recover the distributor's , producer's and investor's money\n\nThe problem with this pathetic movie is that it gets way to predictable and boring. You are never excited to know what's in the next frame or next scene. In fact, you cannot wait for the movie to get over with.\n\nI believe that's the worst failure of any movie. If you're neither excited about the 'What's next' nor are you 'enjoying the moment' - that's when the movie fails.\n\nThe songs are good - but again - what a waste!\n\nThe only thing that is worth watching are: a) Sheela ki lachakti kamar b) Akshaye Khanna is sort of funny c) The first fake shoot scene of a bank robbery with a Vitiligo man pretending to be a Gora\n\nI wish these directors would stop dumping such non-nonsensical farce on the Indian audience. But in order for that to happen we should stop visiting the cinema halls and stop patronizing movies from these non-sense production houses."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "thdwrds",
        "review_rating": "9",
        "review_title": "Should've been supportive of original comedic experimental films",
        "review_detailed_main": "Its a nice popcorn movie, with a lot of feel good moments. People just want reasons to be offended now a days. Yes, there are a lot of gay moment but none offensive imo. Everyone has fun, everyone gets trolled. But more representation than \"woke\" movies.\n\nThis movie will stay my all time favourite. And I do not like how this movie is trash talked, like yeah Khan experimented, and it wasn't well received. But it really killed and demotivated creators from experimenting. And now we have tasteless remakes.\n\nBack to Tees Maar Khan, with great non offensive comedy, it's a film that doesn't pretend to be overly smart. And just wants everyone to have a good time. Wholesome af."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "anikb-87099",
        "review_rating": "7",
        "review_title": "Unpopular opinion! Its actually a TROLL film",
        "review_detailed_main": "I personally find this film quite enjoyable especially on a lazy sunday afternoon when it airs on star gold. I can agree this is not a film you would have liked to spend your money on to watch it in theatres when it released 11 years ago but still i find it quite hilarious.\n\nYes there is no logic sense anything. In fact, this film feels more like a troll movie , kind of short videos you see nowadays youtubers make regarding trolling someone, so i feel Farah Khan intended to take a dig at oscar films. In fact, many got offended by this film solely because it shows indian villagers as mere fools. Those days the concept of troll was not well known amongst Indians and hence they took such films seriously and got offended.\n\nIf you can keep aside your critical viewing eyes like I do everytime i watch it and treat the film as a mere troll film, you will enjoy it quite a lot from moments like --> 1. Confusing Danny Boyle for Danny Danzongpa 2. Akshaye Khanna and Akshay Kumar's interactions were hilarious especially his constant assurance that he will get an Oscar and literally the Jai Ho tune starts to play 3. That milk like white guy who is told to chew a gum making him look like he is speaking constantly cracks me up.\n\nOverall, this is my personal veiw, not affected by anyone's negative review or anything. I can still watch this film a 1000 times as it is much funnier than the crap hamming like comedies that come out these days."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ankybaveja",
        "review_rating": "1",
        "review_title": "The worst movie ever?",
        "review_detailed_main": "I read a review somewhere warning people not to watch TMK even if they got free tickets and as I would realize later, the review was spot on.\n\nI saw about an hour of the movie and then walked out as it was intolerable. The so called gags are not funny at all. There is oodles of overacting by all actors and full use of clichés. Having seen Main Hoon Na and OMO, I know that Farah Khan likes to make brainless masala movies, but TMK is beyond brainless. The entourage of Burger etc. that follow Akshay Kumar, the stuck to each other brothers who speak at the same time, the gay CBI officers - it is NOT funny.\n\nWhat does one want from TMK - slapstick comedy - None ; humor - NONE ; great acting - NONE. I don't think Akshae Khanna will take much time to pull out his newly weaved hair when he sees this movie in a multiplex.\n\nWatch this movie only for 2 reasons: 1. You want to compare it with the worst movie you have ever seen 2. To watch Shiela ki Jawani on a big screen"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "knightofbombay",
        "review_rating": "1",
        "review_title": "Horrible Movie!",
        "review_detailed_main": "The movie is so bad that I had a terrible headache for hours after watching it! It's a disgrace to modern Bollywood cinema! Bad acting, really bad story, and super-bad dialogue(s)! I'm so disappointed and angry that I wasted my time and money to see this flop show!\n\nThe storyline has way too many gaps. The constant nagging chorus of screaming the movie name over and over is super annoying! The film locations are cheesy at best. I can't believe Farah Khan will deliver such a dud, after entertaining movies like 'Om Shanti Om' and 'Main Hoon Na'.\n\nI guess what people have been saying is right.. Farah cannot deliver a movie without Shah Rukh Khan. It's a relief to see that SRK is not part of this movie!! Thank you, SRK!\n\nWatch it at your own risk!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "minhas9",
        "review_rating": "1",
        "review_title": "Don't WATCH IT !!",
        "review_detailed_main": "I rarely review here at IMDb but i needed to review this particular film.\n\nThe story is weak screenplay is weak the direction is LAME.The jokes in movie are all old and lame i say AGAIN ALL.I did'nt laughed on one joke,so senseless movie it was\n\nOnly good thing about movies is its title song which is good and its item number 'Sheila ki jawani' rest all film is utter piece of crap i would suggest you to rather watch these two songs on youtube than to watch it in cineplex and waste your money and more importantly your TIME\n\nI would suggest dear readers that please for god sake don't watch this boring movie."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "manis-roy",
        "review_rating": "1",
        "review_title": "worthless movie",
        "review_detailed_main": "I have great expectation form Aksay kumar and Farah khan, but this the worthless movie in bollywood history.\n\nThis movie have no story line as well as comedy, nothing. Farah Khan has no idea about script. All actors are coming and dancing and joking like a fool. Aksay is a great thief all over the world but he has stolen only a Maa-ka Mobile and Chanki Pandey's Dress ( please don't ask me for what purpose because FK has no answer ). Akshy Khanna who have great Skill of acting made a bulls!!@#%. Only Katrina has a great item no but Shella ki jawani is not a movie. only one thing you can notice in this movie that is the name of the movie Khan-o me Khan Tees Maar Khan."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sanirthikana",
        "review_rating": "2",
        "review_title": "Do not bother to see this movie",
        "review_detailed_main": "Catch a repeat of another Farha Khan movie instead. The director has let herself down big time with this one. The plot is utter nonsense (if ever was one), gags are outdated and overdone. Dialogues are no better than a B-grade movie. In fact you sometime get better trash from the b-graders. There are couple of ads stashed in too. The whole thing is quite fast paced, a blurry hazy 2.15 hr run of absurdity. Production quality low. It is very evident that the makers did not spend much money on the movie or time on the script - so save yours. The 2 stars I gave, one for Katrina, for her 'jawani'. Another for Salman - for his 60sec Dabang cameo inside a song."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "thinkswapnil",
        "review_rating": "2",
        "review_title": "a movie disaster called TMK",
        "review_detailed_main": "I don't understand what the hell was there in the mind of Farah Khan and Akki when they gave a thought for making TMK. It's a total wastage of time and if you really want to enjoy the movie, you must keep your brain at home and should not think WTF is going on the screen. I believe Akki must understand now that the monotonous style of comedy has been common and audience has shown the feedback on the movies 'Khatta Meetha' and 'Action Replayy'. Undoubtedly Akki is one of the most talented actors and he must not do the foolish activities. As far as Katrina is concerned, She was there in the movie for no reason but only to show the \"Jawani\" of \"Sheela\". I give this movie a poor 2 out of 10."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "mharisyasin",
        "review_rating": "1",
        "review_title": "Please save your precious 2 hrs by avoiding TMK.",
        "review_detailed_main": "I registered at IMDb just to tell you people how disgusting the movie is.After the first 20mins you'll realize that this movie isn't gonna give you anything but a severe headache.I couldn't believe I wasted my 400 bucks watching this utter piece of crap.Akshay Kumar is such a pain in the a**.There are absolutely no duologue's for Katrina in the picture.Movie is full of dumb jokes and PJ's.Each n every person in the film is overacting.I just can't expect such a dull direction even the thought of directing such movie by Farah Khan.This movie will be the 1st commercial flop for FK.Absolutely worst movie of the year 2010.I reckon don't waste your precious time and money watching TMK. PLEASE AVOID AT ALL COSTS."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "jcferns_kwt",
        "review_rating": "1",
        "review_title": "What a bad movie she made this time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ehrar",
        "review_rating": "10",
        "review_title": "One of the funniest movies I have watched.",
        "review_detailed_main": "Best acting and best performance. It is just as it was supposed to be, Awesome.\n\nAkshay Kumar's movies are always great and this movie is one of them.\n\nApart from being funny this movies is also family friendly. You can watch whole movie with the family without hesitation."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "yuva79",
        "review_rating": "",
        "review_title": "The worst movie ever... even the dumb ppl might find this movie dumb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "s_c_a_r_l_e_t_t_a",
        "review_rating": "7",
        "review_title": "Remake but funny",
        "review_detailed_main": "This movie is just a remake for the Hollywood comedy movie 1966 after the fox, but still funny with Indian taste."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "megha-933-260362",
        "review_rating": "1",
        "review_title": "A waste of Rs.150 and three hours",
        "review_detailed_main": "The movie not only disappoints but makes you want to leave the theater in less than 5 minutes. Bad acting by almost everyone, no story plot gives one a headache. A waste of Rs.150 and three hours. Totally avoidable. Farah Khan has done a terrible job at directing, dialogs and choreography. Waste of acting prowess of Akshay- Kumar & Khanna. Although the only role that is well cast is for Katrina- that of an amateur actresses and she plays that well, since she cannot act to save her life. Bad Choreography. Bad Acting. Bad story. Bad Dialogs. Bad Screenplay. The movie leaves nothing to look forward to after the first 5 minutes."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "venkatthefreak",
        "review_rating": "1",
        "review_title": "It truly deserves more than 'Tees Maar'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "TechPek",
        "review_rating": "1",
        "review_title": "Pathetic, Horrible",
        "review_detailed_main": "An awful piece of utterly stupid so called jokes, pathetic acting, horrible script, overtly over enacted scenes. I don't remember seeing a movie as bad as this in a long time! One may feel that this movie is so called non-sensical comedy and I may not be the one who likes these but just to clarify on this, I have enjoyed Welcome, Jodi No. 1, etc! Even No Problem is a one time watch but this one is just too bad! The only good thing about this movie is its music. I don't understand how actors like Akshay Kumar end up doing such movies. A movie that just does well enough to spoil the festive mood. I got headache, I was super annoyed, I lost time, I lost money when I saw Tees Maar Khan!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "s-atarid",
        "review_rating": "1",
        "review_title": "horrific",
        "review_detailed_main": "awful movie, bad generic comedy and poor cinematography.... from my perspective its to worst movie of 2010 also i would like to ask farah khan that why did she sign katrina kaif for this film. Surely someone like rani or kajol would of fitted perfectly for such a role and akshay khannas dialogue delivery was out of sync. Furthermore it had some funny moments awful movie, bad generic comedy and poor cinematography.... from my perspective its to worst movie of 2010 also i would like to ask farah khan that why did she sign katrina kaif for this film. Surely someone like rani or kajol would of fitted perfectly for such a role and akshay khannas dialogue delivery was out of sync. Furthermore it had some funny moments"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "kunalkhandwala",
        "review_rating": "4",
        "review_title": "Incoherent, garbage bag of hamming entertainment",
        "review_detailed_main": "TEES MAAR KHAN\n\nEntertainment is a tricky affair. On one hand, film makers present their conviction in an idea or story that can be moving or heart warming whereas some choose the shorter path to success by giving the audience a mindless mess of comedy that can only be short-lived. Careers have been established with the former ideology but disaster has struck when in the name of entertainment, what was served to audiences was a garbage truck full of forced humour, mindless plots, overacting and trashy dialogues. That has happened far too often lately. In retrospect, 'Main Hoon Na' was at least sincere with its story and performances. The actors, music and comedy combined to produce a refreshing entertainer. 'Om Shanti Om', at least the first half, was funny, musical and refreshing as well. However, while riding on the success and fame of two somewhat convincing successes, one does not gain the right to take the audience on a ride. Farah Khan has done just that and brought the audience down to her own level with 'Tees Maar Khan'.\n\nA supposed con-artist named 'Tees Maar Khan', along with his aides – Dollar, Soda & Burger is out to execute their greatest job so far: Looting the royal treasure from a running train with the help of villagers who have been beguiled into believing that it's all part of a movie being filmed. Get the point? Right from the beginning, nothing seems convincing at all. Akshay Kumar lauding his character with a multitude of dialogues indicating that 'capturing him is pointless' has no effect. DON says something similar but with lasting effect. It's because of something called 'direction' which is missing from this movie. The greatest Con- artist who fools Indian Police and the Interpol is so unconvincing that one would wish he would take up another job. Akshay Kumar overacts his way through a character that has no life, background or foreground. Numerous flops in the last 2 years still has him playing the repetitive roles in brainless flicks. Hopefully, 'Patiala House' can change things for him. Akshaye Khanna. What can one say for him. The Oscar hungry character of Atish Kapoor is funny at first but when he hams through every incoherent scene, it becomes an overkill of the once wonderful actor from 'Dil Chahta Hai' who was unforgettable as Sid. Some of the supporting cast that includes Arya Babbar, Sachin Khedekar, Murali Sharma and Apara Mehta have done better justice to their roles than even the lead actors. The only reason why people will knowingly spend money on this movie is because they were lured by Sheila Ki Jawani. That song is worthy of its hype. Rather, Katrina Kaif is worthy of her position in Bollywood right now. Her moves, classy attitude and to-die-for looks in the 'item number' will thoroughly entertain and Farah Khan has done her primary job of choreography quite well. We only wish for Katrina's versatility to be challenged as she was in 'Raajneeti'.\n\nVishal & Shekhar will only ride on the success of Sheila and nothing else. Compared to Farah's previous two, this film's score is a dud. Even Salman Khan's cameo cannot save the mediocrity of Wallah re Wallah.\n\nThe editor in the film must surely be the security guy outside Dhuliya bank since he was asleep all the time. The dialogue writer churned out only a handful of witty one liners before they too were lost in between the hamming, overacting, repetition and senseless situations. The key to successful comedies of late, has been in dialogues as one cannot really create funny scenes without a screenplay in existence. Cinematography was very average and this film lacks the big budget feel if at all it had one. In case it did, UTV will have to rethink Farah Khan's calibre as a director they can invest in.\n\nFarah Khan literally showcases her stupidity on multiple occasions. Take the airplane scene for instance where it all seems so over-the-top. The prolonging of the train's arrival in Dhuliya prepares you for the worst. The headless horse rider sequence was among the most incoherent of all, while the in-film director Tees Maar Khan's clueless behavior on the film's set must be an enactment of Farah Khan in reality. Finally when the train is stopped and the heist ensues, it all seems tragic as there was nothing funny, glorious or memorable about the basic premise of the 3 hour ordeal. The actors too, look weary of the proceedings in the end and one cannot help but dread Farah's intention of making a sequel to this time-wasting garbage of nonsense.\n\n5.23 on a scale of 1-10."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "Pratik112",
        "review_rating": "1",
        "review_title": "Farah Khan Has Lost It.",
        "review_detailed_main": "Having heard over the past two years that this film was \"on\" and then \"off\" and then \"on\" and then \"off\" and then finally \"on\" again, it made me feel like that someone was switching the lights on and off countless times. Then I heard that SRK and Farah Khan had fallen out with each other and that Akshay Kumar was in along with Katrina Keif.\n\nWritten by Farah Khan's husband, Shirish Kunder, the theme of the movie is based on an old Peter Sellers movie, \"After the Fox.\" A thief gets his chance to plan to rob a train and he does this by hiring a actor and a movie shoot in a village nearby.\n\nStarring Akshay Kumar, Katrina Keif, Anil Kapoor, Akshaye Khanna and Arya Babbar, the movie is directed by Farah Khan, written and Produced by Shrish Kunder and Ronnie Screwala. Vishal Shekhar provide the music score.\n\nFarah Khan has had a previous \"flop\" on her hands - \"Janemaan,\" though it was not directed by her but by Shirish Kunder. That movie did not star Shah Rukh Khan either but the other two, \"Mein Hoon Na\" and \"Om Shanti Om\" did and proved to be successful for her, though the latter did have some problems.\n\nKatrina Keif, though has lost a lot of weight and ensured that her style of dancing could be compared that of Malaika Arora Khan in \"Sheila Ki Jawani\" compared to \"Munni Badnaam Hui.\" Serious roles, such as the one in \"New York,\" suit her better then the one she plays in this one.\n\nAkshay Kumar, perhaps needs to consider doing serious roles than this. Certain types of comic roles do suit him and he does execute them very well. But unfortunately, this cannot be said here.\n\nThe music! Well the only thing that can be said is that at least one song - \"Sheila Ki Jawani\" is a memorable number, though it has come under a lot of criticism since the release of the movie. One other member of the industry that Farah Khan had always had but didn't this time was the music director, Anu Malik.\n\nThe plot fails to lift off, the comic lines and the dialogues could have been written well and its with this that I conclude that this was a movie that was riddled with disaster from the moment it was announced."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ghosh-rajarshi41",
        "review_rating": "1",
        "review_title": "Please carry pain-killer with you",
        "review_detailed_main": "Really don't know how to break this. But, please avoid going to cinema hall to watch TMK.\n\nFarah's comedies are typically brainless. So, I hadn't had much expectations. But this time, I really believe, that the opening credits should have contained one fair warning, 'Hazardous to health'.\n\nComedy cinemas deserve appreciation, as it involves a lot of hard work from the actors. But, a mindless comedy such as TMK needs to be thrown out to garbage boxes. As a cine-goer I prefer a cinema, which has a soul. A bunch of badly packed adult jokes and a lot of overacting, mixed together can not be classified as a cinema, forget comedy. Sorry Farah, sorry Akshay, a thumbs down from me.\n\nP.S. I was thinking to rate the cinema with 0 stars. But found out, that was not possible in this site."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "Agent-L",
        "review_rating": "1",
        "review_title": "Worst movies of this century",
        "review_detailed_main": "I can't rate this less than 1 or else I would have rated it -1000000/10. People please don't waste your money in this c**p, I walked out after 15 minutes as my brain couldn't take the stupidity any more. Acting = fail, script = fail, directing = fail. I think a monkey could have written and directed a better movie than this. DO NOT WASTE YOUR MONEY (don't even bother downloading it).\n\nI mean I don't even want to write 10 lines (as I am forced by IMDb) regarding this stupid movie. This is why people don't respect bollywood movies. Katrina Kaif acted like a cheap prostitute from Amsterdam (if you know what I mean!), definitely not family friendly. I want to donate someone money to farha khan, so that she can learn how to write and direct properly. I am ashamed of liking her previous work. It felt like she went to toilet break when the acting was taking place. WORST MOVIE EVER."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "vnblues",
        "review_rating": "10",
        "review_title": "Such a riot!",
        "review_detailed_main": "I'm surprised at some of the harsh reviews here. I am not a Bollywood fan, I probably watch one Bollywood movie every 2 years.. and I just loved this one because it made me laugh.\n\nIt makes fun of some of the embarrassing truths about Bollywood. Take Slumdog Millionaire and the obsession about getting an Oscar. By making a spoof out of it, the movie finally made me believe there are at least some sane people in Bollywood who have some self-respect. Why should we care about the Oscars when we have awards of our own? The Oscar isn't even that great an award.\n\nYou need to watch this movie with family or a bunch of friends who have some exposure to Bollywood movies. Everything is exaggerated and that's what makes it fun. Looks like both the Akshays really enjoyed their role. Loved them both here. The dialogue is purposely done in a filmi style. They are making fun of the industry. Come on people! Have a sense of humour about it.\n\nI'm giving it a 10 to offset some of the poor reviews here. Come on folks!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "LaFeeChartreuse",
        "review_rating": "7",
        "review_title": "Fun as long as you don't take it at all seriously",
        "review_detailed_main": "I'm kind of astonished by all the harsh reviews of this one... I found it pretty entertaining, albeit in a very silly way.\n\nI think the only way to approach a movie like this one is to realize right from the beginning that ordinary rules of logic are not going to apply, and stop expecting things to be remotely realistic or plausible, because they're not going to be. It's a deliberately ridiculous, over-the-top, screwball comedy, and if you expect any sort of realism or logic from it, then yes, you're going to be disappointed. It seems like some of the other reviewers were expecting something a little more serious and sensible, and I could certainly see how this film could be jarring if that's what you're after.\n\nBut if you're just looking for something campy and fun, and are prepared to completely suspend disbelief, then it's definitely worth watching!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "writetokrish",
        "review_rating": "2",
        "review_title": "Bad Days of Akki continues",
        "review_detailed_main": "Here comes the worst film of the year. I am not finding any words to criticize this movie as there is nothing to write about. Here is some reasons why I did not liked the movie...\n\nAksay Kumar: exhibition of unbearable over-acting. I am fond of his acting but do not know what happened to him after Singh is King.\n\nKatrina: nothing she has in the film except one song. This is not her fault; she had nothing to do in the movie.\n\nAksay/Katrina: The film maker did not use their chemistry. They hardly had any romantic-scene. As said earlier Katrina had nothing to do in the movie even where Aksay is there.\n\nDirection: Well, let's not think about it at all. I do not know how she can make such movie. From her two earlier movies it seems she at least know what most people like. At lease I liked Om Shanti Om not because of SRK but for the making of the film.\n\nAkshay Khanna: tried his best Story: Nothing Dialogues and Punches: Golmaal-3 also did not have any story but it had a good number of gigs and punches which make that movie such hit. But this movie does not have anything like that. The only interesting dialogues you can get which you already got from the trailers.\n\nMusic: Not so good.\n\nChoreography: Not so good.\n\nThose who are thinking of watching the movie be warned. It is better to spend the money anywhere else."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "fastnfurious_17",
        "review_rating": "1",
        "review_title": "Totally Ridiculous !.. Don't Ruin your Christmas.",
        "review_detailed_main": "This movie is a HEADACHE, 2 hours of head-banging. Seriously how can Farah Khan comes up with sucha senseless movie. Well I am not that disappointed cuz I never expected much, but I know there are lot of fans who were thinking of spending a fun filled 2 hours in a holiday season with friends or family. For those, the movie is a huge letdown. Sorry guys !\n\nMay be farah was considering audience first and critics later but she lost both of'em. Audience are as disappointed as the critics. All the hypes created around 'Sheila Ki Jawani' could not safeguard the movie.\n\nAnd for Katrina, Wow! she has luks, she has moves, she has everything excepting the most important of all - ACTING. :(. The only thing that was still fine was the akshay khanna's role . Otherwise the movie was full of overacting, stupidity and dumb jokes. And the last thing, I m a big fan of Raghu (Roadies) but farah made him look like a joker in the movie. Please please give him some serious villain role and he'll do awesome, I know. :)"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sameshar",
        "review_rating": "1",
        "review_title": "Worst Movie EVER !!!",
        "review_detailed_main": "I cannot believe a movie like this exists. The only appeal in the movie is Akshay Kumar (lead actor) who is known for his excellent comic skills and brilliant dialogue delivery to make even a dead body laugh... BUT he fails with a Rock Bottom. Movie is not only loose but have extremely bad jokes. Even a 5 year old can come up with better jokes. Heres an Example: Mohan Night Samalan (also know as M Night Samalan), the director of Sixth Sense... His middle name is night because he was born at night... also, explains why he is dark in color (because he was born at night). Farah Khan as a director has slapped bollywood across the face and made all Indians around the world humiliate. Took my Mexican friends (who are big fans of bollywood movies) and kept laugh all through the movie... NOT because it was funny but because it was so bad. The end credit shows all the film crew (like director, producer, story and screenplay writers, costume designers,etc) accepting Oscar Awards. I think they expect this movie to win awards. Here it is... WORST MOVIE OF ALL TIMES !!!\n\nPlease don't get me wrong. I am not giving a bad review because i hate the movie but because its a very bad movie. Though i wanna say one good thing before i end this review. The only worth watching few minutes of the movie are during the song SHEILA KI JAWANI. Song is Awesome and Katrina Kaif is Gorgeous. Unfortunately, the song is at the beginning of the movie and from their movie is a landslide to hell.\n\nI wish i could give those $10 to Charity so some kid could buy his/her books and pencils."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "allypk2000",
        "review_rating": "1",
        "review_title": "She is Farah and She is awful.",
        "review_detailed_main": "well the title tells it all. the movie is awful and does not deserve any plus review. farah with this movie has been trying to make \"DABANGG\" out of it but it was useless. the movie from any angle is nothing but a worst piece of 3 hours wastage of your precious time and money. IN OTHER WORDS THE MOVIE IS NOT WORTH YOUR MONEY. INSTEAD GO FOR ANY PRIYADARSHAN MOVIE OR EVEN \"NO PROBLEM\" WILL ALSO DO. \"MUNNI SET BADNAAM HOGAYI\" BUT \"SHIELA KI JAWANI NA BADNAM HUII AUR NA MUNNI KO TAKKAR MARII\" AS I MIGHT ADD AGAIN: \" TEES MAAR KHAN NA DABANNG HAI AUR HAR PROBLEM KA SHIKAAR HAI\". Simply Awful. Instead there should have been some Sanjay Dutt movie or i must say watch TNA wrestling as you will find attitude there instead of WWE as they are now moving to Disney Kids channel."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "jigz-28",
        "review_rating": "1",
        "review_title": "Worse even than Chinese Torture",
        "review_detailed_main": "Firstly i would like to mention why i gave two stars to this movie. One star is to the song SHEILA KI JAWANI(although it is awesome to watch but sadly it lasts for only 4 minutes or so) and the another star to Akshaye Khanna and Akshaye Kumar(yes, both deserve half-a-star).\n\nIt revolves around one con artist (Akshaye Kumar) who can never be kept in prison and whatever the circumstances he manages to escape every time. He gets a contract to commit a heist of Indian antiques by two brothers who are connected physically(Raghu and Rajiv)and he accomplishes it with the help of residents of a village and an actor aspiring to get an Oscar(Akshaye Khanna) in the most ridiculous manner. Then TMK is double-crossed by his bosses and he overcomes it to a HAPPY ENDING.\n\nThis movie revolves around a heist which is supposed to take place from an unstoppable train. But the biggest irony is that the train stops in just 10 seconds and the robbery thing is just plain rubbish. Akshaye Kumar has just stuck to the same expressions and behavior since last year or so and it is not funny anymore. Akshaye Khanna as an Oscar-crazy actor is over-the-top but induces laughter in some scenes. And now, Katrina Kaif. The only reason i suppose she did this movie is to show her toned body. The song Sheila arrives quite early in the movie, and after that all Katrina Kaif does is show some skin and tries to act like a bimbo. And oh yes, she also does a Marilyn Monroe.\n\nThere are so many more absurdities that it is impossible to point out why i disliked it. Please try to avoid this one or you are going to regret watching this nonsense."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sendmailtojk",
        "review_rating": "1",
        "review_title": "True colors",
        "review_detailed_main": "This was a perfect fit for Katrina. She is supposed to act a role of an aspiring film artist who does not have any skill. What a great fit. Wow.\n\nAs usual Akshay overacts.\n\nThe original Peter Sellers movie AFTER THE FOX has a well deserved 6.5. The Indians- hating Sellers must be laughing in his grave on is movie.\n\nHow difficult was it for Farah Khan to copy the original without deviating the storyline?\n\nAnd lastly what is wrong with the Indian moviegoers....this movie made tons of money...."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ari_bimal",
        "review_rating": "2",
        "review_title": "tees maar khan sucks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "mayankngwc",
        "review_rating": "5",
        "review_title": "If it's not clear to people that everything here is on purpose than it's no surprise bollywood comedies have become trash.",
        "review_detailed_main": "This movie is self aware. It's not like writing terrible dialogue, and overacting is something the makers and actors in this Movie are known for. It mocks everything and people have learned to accept terrible, offensive dialogue and overacting so much that they can't see that all this movie does is dial it up to 10 to make fun of it. Yes some scenes are actually bad even for a movie calling out tropes. Yes it could have been better easily but the harsh reviews that the movie has received don't point out the more controversial dialogue of the film but simply critisize it for the acting and stupid story which shows that they didn't get what they were going for.\n\nNow I'm not claiming to know better but if you can believe that a director known for making ok drama movies before this would go soo wrong at making a comedy than you either consider bollywood comedies great or had even lower expectations from Bollywood."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "amitmardi-02904",
        "review_rating": "10",
        "review_title": "Well I Love this movie.",
        "review_detailed_main": "I don't care about other reviews.But this one was a decent comedy movie."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "hotpinkscrubs",
        "review_rating": "7",
        "review_title": "Silly, time-pass entertainment!",
        "review_detailed_main": "I rated this movie relatively high to bring up the score. If you are looking for an intellectually stimulating movie, did you really think this would be it? If you are looking for fun, time-pass entertainment than you will certainly enjoy Tees Maar Khan!\n\nThis movie is SUPPOSED to be dumb. That is what makes it brilliant. The silly puns and obvious jokes... they're supposed to make you roll your eyes and laugh while thinking 'Oh my God, did they just really say that?' Each character is larger than life, from the \"blonde\" bimbo Anya (Katrina Kaif) to the suave, catch-phrase using, wanna-be \"Don\" Tabrez Mirza Khan (Akshay Kumar). The plot is your average story of a conman attempting the heist of his life. The clichés are what make this movie great... I guess some people just don't get that. Those people need to stop taking themselves so seriously.\n\nAm I perhaps giving Farah Khan too much credit for creating a brilliant satire when really it is just a poorly made comedy? Maybe. But even if that is true you will find moments where you can laugh, even if you're doing it while thinking WTF?\n\nI do agree that Akshay's brand of humor and Farah Khan's style do not mix too well. I think both are fantastic at what they do, but in this movie their skills clash and are ultimately compromised. It was painfully obvious at points that this movie was made for Shahrukh Khan in a sort of slapstick version of his \"Don\" flick. If only he had not gotten into a fight with the director...\n\nThe best performance by far was that of Akshaye Khanna as the Oscar-obsessed superstar trying to give his ultimate performance. The exaggerated intensity and self-importance with which he performs every scene is hilarious. Even the long, flowing \"hero\" looking hairdo was spot on.\n\nNo, it's probably not the kind of movie you would watch again unless it came on TV, but if you need some Bollywood over the holidays just go see it. Don't think about it too much. In fact, think of it as a mental break. If nothing at all, go and enjoy the songs! Vishal and Shehkar do it again with \"Sheila Ki Jawani\" and \"Wallah Re Wallah.\" The beats are awesome and Katrina Kaif is sizzling."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "umangsagar",
        "review_rating": "1",
        "review_title": "Is it the worst ever made?",
        "review_detailed_main": "I am extremely sorry if you even started reading this review, because to read anything related to this movie would be such a waste of time, but i wanted to warn others who have been spared to watch this trash before they even think of riding the adventure. There is NOTHING to be written about the story, as there EXISTS NONE. Every actor seems to be competing with each other in the race of who is the WORST actor (cant blame them as there is nothing in the script to act)\n\nYou may think i will be biased, but watch it to decide if i actually am!!!\n\nA movie of this level of rubbish stuff could only have been made by Farah or his husband who made \"joker\" later...it would be a good debate which one is worse :P\n\nSave your day and watching just about ANYTHING ELSE."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "csnanjappa",
        "review_rating": "3",
        "review_title": "Why does Farah Khan try directing ..horrible",
        "review_detailed_main": "Not sure why Farah khan directs movie , its just better for her to choreograph . the movie does not have a script and story is baseless. you just cant sit for the second half and jokes are pretty ...dumb ...except for the song ....the movie is no good . u can just come out of the movie after the song, not sure how couple of people were laughing for some junk jokes ...acting ...Akhsay is great as usual but he cant do anything ..Kat is body shopping ....not sure what age group people would like this movie ....would not suggest anyone to watch. went for Hindi movie after long time excepting the Hindi movie industry to improved or matured , but we still find these kind of movies coming again and again , not even worth watching in TV."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "namashi_1",
        "review_rating": "5",
        "review_title": "Half-Baked!",
        "review_detailed_main": "Farah Khan's much awaited film 'Tees Maar Khan' finally reaches to it's audience. Sadly, 'Tees Maar Khan' is a letdown. The writing defies logic in each sentence, and comes out unconvincingly.\n\n'Tees Maar Khan' is the tale of a con-artist, who plans to do a heist, which might be the biggest con witnessed in history. His journey from the moment go, is an insult to the word 'logic'.\n\nShirish Kunder and Ashmith Kunder's Screenplay is full of loopholes. Sure, the film begins ably and the first hour somehow manages to hold your attention. But, the second hour goes for a complete toss. The jokes fall flat, and the culmination also doesn't leave any sort of an impact.\n\nFarah Khan's previous films, 'Main Hoon Na' and 'Om Shanti Om', were genuinely entertaining films, but 'Tees Maar Khan' isn't half of the entertainer one expects it to be. Her direction is hen-picked, due to the weak screenplay.\n\nThe soundtrack, as well as the background, both are good. Acting wise, Akshay Kumar as 'Tees Maar Khan' is effective. Katrina Kaif doesn't get much scope, but she still manages to make her presence felt. Akshaye Khanna, however, is the real surprise packet. He is truly outstanding as an Oscar-Hungry Film Star. Sudhir Pandey is superb! Arya Babbar registers an impact. Salman Khan, Chunkey Pandey and Anil Kapoor appear in brief cameos.\n\nOn the whole, A Half-Baked Entertainer, that fails to live up to it's gargantuan expectations. Watch it, but only if you must!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "Herag",
        "review_rating": "1",
        "review_title": "Senseless Piece of Trash--an Eye Sore.",
        "review_detailed_main": "Senseless, meaningless, stupid film that denotes the slow death of Indian Movie Industry. This Industry will never recover after dirt films like \"Three Idiots\" and \"Dabaang\". This film is pure waste of celluloid that could have been used for a documentary on child hunger or other social causes. This Director Farah Khan is a brain dead lunatic who is fit to be put it to an asylum along with Akshay Kumar who is churning out films like rotti's since there is no acting or any talent required. This movie is a disgrace to the Film Industry and yes, it will do well since the majority of the population has a field day with this kind of lunacy. This will be a box-office success since good films have no chance of break even and good producers and directors have given up any hope. This idiots and imbecile Khans should be kicked out the industry and kicked out to where ever these lowclass lowlifes came from. Who are the morons been given money to them make movies. They should be selling kabobs on the roadside. They are producing filth in the name of films."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "pravat_65",
        "review_rating": "1",
        "review_title": "Tees baar Maaro Khan ko",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "PlatinumShah",
        "review_rating": "1",
        "review_title": "it was Ohh ...so bad!!!!!!",
        "review_detailed_main": "After waiting eagerly for this movie, I sat in the theater and then was extremely eager for it to End because this movie was atrocious and that's putting it politely. There is nothing good about this movie and I can bet I've seen better plots and characters with more depth in blue movies. Right from the plot to the visuals, the acting, the directing it was simply contrite, clichéd and awful. There was absolutely no dramatic scene at all and the visual effects were just creepy and over the top.\n\nFarah Khan once said that she doesn't care a damn for what the critics opine! Well you got to believe the critics this time because the only good thing I can say about Tees Mar Khan is Katrina's performance in 'sheela ki jawani' but the question is, are you that desperate for an eye-candy?\n\nFarah Khan please for the love and beauty of a Bollywood movie never make a movie like this ever again."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "agasi999",
        "review_rating": "3",
        "review_title": "Tees Maar 'Farah' Khan",
        "review_detailed_main": "In her third outing as a director, Farah Khan seems to have lost her midas touch. TMK,a screwball farce revolving about a conman conning pretty much everyone around him is neither funny nor clever. Akshay Kumar plays his usual comic self we now associate him to from his earlier films with great elan,while Katrina looks hot but lacks any sense of comic timing. The only surprise is Akshay Khanna who manages to make the best of the very little that is offered to him. He is definitely one of the most underrated talents in Bollywood.\n\nTMK offers a few giggles here and there and thankfully Farah keeps the running time short and we are spared from not having to waste anymore of our precious time. By the end you feel the director herself had conned us the viewers by making a movie which is a complete farce from beginning to end and sadly doesn't rise to deliver anything exciting.\n\nYou know things are not looking well,when the guy sitting in front of you at the cinema is busy playing 'Angry Birds' on his Ipod.\n\nBring back the colorful dramatic musicals Farah,we love them!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "gei-16231",
        "review_rating": "1",
        "review_title": "Another flop bakwas of Akshoy Komor",
        "review_detailed_main": "Why does Akshoy Komor does such cheap movies? He should be careful in selecting the director and the script. His acting was as bad as his other movies. Ghatiya bakwas."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "a-kumar-04845",
        "review_rating": "8",
        "review_title": "One of best no brainer",
        "review_detailed_main": "Don't expect \"reality\" in this movie.\n\nIt's full time non sense.\n\nBut damn it's stupid, rubbish and funny.\n\nOne of top actors together making this story, I imagine nothing but them having fun during shooting."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "gaurav-kurvey",
        "review_rating": "7",
        "review_title": "really what a FK ....guys this is the worst movie of decade",
        "review_detailed_main": "what a real waste of time energy and money. a complete crap nonsense and idiotic.guys please avoid this senseless and stupid freak show. Really has Katrina Kaif gone insane?what the hell is she doing (apart from wearing little clothes in Shiela....) Akshay kumar is good but what can he do when the director has lost her bearings. No sense of humor,just plain BAKWAAAAAAS. What a whimiscal plot...a conman making a dumb movie with a top actor in it and that winning an Oscar. it is a stupid take on poverty,villages,Oscar and underworld the music is bad apart from the only song.... well,the only positive thing about the movie is that it lasts just three hours and then you feel like a free bird out of a boring,crap and junk cage. farah khan should stick to her formulas only,she must not try anything new."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "2",
        "review_title": "The film that parodied itself",
        "review_detailed_main": "It's no secret that Farah Khan has watched a lot of 70's and 80's cinema. With her debut venture Om Shanti Om, it was dead clear that she was inspired by old films. While watching it, I had a strong feeling that it's a parody of some kind. But the hard hardest part of making a parody is preventing it from becoming what they are paroding. Tees Maar Khan is a victim of it. It's far worse than any of the old comedies.\n\nWithout insulting any actor particularly, I would say all of them were poorly written. They were caricatures, they were overly dramatic, they were very unlikable and acting was over the top.\n\nBut does it deserve to be in the bottom. I don't know but I have seen movies far worse than this. Humshakals, Race 2 ,Judwaa 2 to name a few. Infact, most of the Punjabi comedy films are worse than this. Also, RGV ki aag, Himmatwala, Humshakals have ratings well below 2.0 but still not part of this list (they used to be, earlier) .\n\nDefinitely not the worst I have watched. Also, that overrated Main Hoon Na is just as bad. It's not even Farah Khan's worst. As for Akshay Kumar, he has Joker, Mr. and Mrs. Khiladi, Sabse bada khiladi in his kitty. These films deserve to be in bottom 100, 250 or whatever, before Tees Maar Khan."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "planktonrules",
        "review_rating": "1",
        "review_title": "It's every bit as bad as you'd expect it to be!",
        "review_detailed_main": "The Indian film industry is bigger than Hollywood...producing about 800 movies a year. Yet, despite this, IMDB's infamous Bottom 100 List only has two Indian films which earned this terrible distinction. \"Tees Maar Khan\" is the lowest rated of the two....coming in at #34. So why would I choose to see it? Well, I have been trying to see all 100 of the Bottom 100...and this film makes it my 91st such picture. But is it really THAT bad? Is it bad enough to deserve inclusion on this list of big budget crappy films? You betcha!\n\nInstead of recounting the plot of this film all about the master thief, Tees Maar Khan, I'll point out why I eventually turned off the film before it was so incredibly annoying. The acting was among the worst, if not the worst, I've ever seen...and I've reviewed nearly 22,000 films on IMDB. Almost all the actors seemed amateurish and childish....with lots of caricatures instead of folks who were believable. Heck, the folks in \"Airplane!\" seemed much more real and well acted compared to \"Tees Maar Khan\". Add to that the most hellishly annoying theme song in history, a horrible opening which included a terribly rendered CGI baby and the character 'Jagtap' and you have a recipe for career suicide....and I can only assume director Farah Khan was tired of making films and he made this one to permanently derail his career! A chimp would have done a much better job than Farah...and the acting could only have been more subtle had they gotten the chimp!! It's a pretty looking film...but one that constantly annoys the viewer and makes you wonder WHY...why make a film that deliberately provokes the audience to turn off the film and find something better to do...and ANYTHING would be better!! Sticking toothpicks in your eyes would be better than having to watch \"Tees Maar Khan\" and shoving flaming spears into my ears would be better than having to hear that godawful theme song one more time! Avoid this film like it's the Bubonic Plague!!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "mayurdeepz",
        "review_rating": "4",
        "review_title": "Being mindless is tough unless You are Farah Khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "enigmaticmaniac",
        "review_rating": "1",
        "review_title": "piece of trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "Sherazade",
        "review_rating": "1",
        "review_title": "It was not meant to be taken seriously....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "chirag-shah86",
        "review_rating": "",
        "review_title": "Brilliant movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ankuragrawal1988",
        "review_rating": "1",
        "review_title": "Its Christmas... I would say no more..",
        "review_detailed_main": "Well the movie is more of a slapstick comedy, which revolves entirely around Aksha Kumar, who is playing a con man in the movie. The chemistry between Katrina and him is clearly evident in the songs, and his character along with his side-kicks do manage to entertain in pieces. Intelligent one liners , few of them, and in first half primarily... Better go with your better half !!! The story is not very strong, but the screenplay comes alive with our beloved Akki's delivery and his body communications. Raghu and Rajiv add a bit of a flavor to it, but then even that wears off after some time. Definitely not the best works of Farah, good surprising guest appearances and a lot of intended spoof of almost entire bollywood helps you curve your lips every now and then. All in all, the movie definitely could have been better, Katrina does rock you early on with her 'Jawaani'. I, particularly enjoyed her performances in all the songs(seemed as if that was her entire camera exposure in the movie) One time watch probably..."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "arvindia73",
        "review_rating": "1",
        "review_title": "One of the most awful movies..",
        "review_detailed_main": "I really cant fathom what's gone into Farah Khan... She has a talent of making extremely bad movies...\n\nThis movie was so childish and jokes were so flat that could put you to sleep in no time... Except for Sheila ki Jawani, there's barely anything thats mentionable. All in all, the movie was written, acted in a way that it felt that director had no part to do.. Everyone did, what they wanted, in the worst way that too..\n\nIm sorry Akki, I swear you have lost all respect.. giving greatest worst movies - Blue, Tasveer, this and what not... Time to act like a seasoned actor.."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ssvikas",
        "review_rating": "2",
        "review_title": "Worthless flick that reeks of Overconfidence! Keep Out!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sidkhurana-99739",
        "review_rating": "10",
        "review_title": "A great Bollywood comedy!",
        "review_detailed_main": "A great movie to pass time. Very funny, with a great performance from Akshay Kumar. A little bit cheesy at times, but has many quotable and memorable scenes."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "mksandhu52",
        "review_rating": "7",
        "review_title": "A Really Funny movie!!!",
        "review_detailed_main": "This movie already looked very good from the trailers and promos...\n\nWhen i went to watch this movie at the cinema, i was hoping for a lot and i was happy at the end! Really funny!!! It was just so funny, i could not stop laughing... Akshay Kumar was out-of-the-world... his character was so wow... his acting in this movie was super!!! I really liked Akshay Kumar's dancing in this movie... super-super!!!\n\nOther thing which i really liked was the costumes which Akshay Kumar was wearing in the movie... each of his costumes had a 1st Class look and feel!!! I love it!!!\n\nOverall, a worth watching movie!!!\n\nMy rating: 7/10"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "kvingle",
        "review_rating": "1",
        "review_title": "One among 'top 5 worst movies ever made' in Bollywood with top rated actors.",
        "review_detailed_main": "There is a huge list of things which are wrong at so many levels with this film.\n\nTo begin with this obvious and ridiculous plot it seems director has taken viewers for granted. In what seems to be make a laugh a riot movie it has become so-bad-that-its-good kind of film. This movie is benchmark of what not to do with top rated star cast and money producer has vested in movie.\n\nThe only thing that goes in favor of this movie is iconic \"Sheela Ki jawani\" item song that would be remembered for ages for Katina Kaif.\n\nIts waste of talent that Akshay kumar has. It seems he has stopped reading scripts and rather started accepting movies for money only."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "punit_manik",
        "review_rating": "1",
        "review_title": "Worst Movie Ever",
        "review_detailed_main": "This movie is probably the worst movie of all time in the history of Cinema. I wonder when they are filming such a pathetic movie they cannot realize what kind of filth they are creating.\n\nI am very disappointed with Farah Khan, after making two good films she directed this piece of garbage. The story in this movie can not be understood by humans.\n\nAll actors are wasted in this movie, I cannot think of any reason why Akshay and Katrina Kaif agreed to star in this movie, they paid a huge price for there friendship with Farah Khan.\n\nIf you have still not seen this movie you should thank the lord almighty as God has saved you from such mental anguish and trauma. Don't spend money on watching this movie instead help the poor and needy."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "amcclend12",
        "review_rating": "1",
        "review_title": "Why always COPY!",
        "review_detailed_main": "Just by watching the previews I had an inclination of what movie they copied this Indian Movie on - I don't know if many people remember An old Peter Sellers Movie called \"After the FOX\". Well people here you go! Indian version. Far worse and sad! The thing is it can be so much better as they did take a really funny movie to do an Indian version of. However they add the dumb unneeded comedy and kill the movie.\n\nWhat is the matter with Akshay? Why can't he do movies as he was doing. I think the last good movie I saw of him was Singh is Kinngh! After that it just went downhill! Dude! You are so much better than this nonsense!! I am your biggest fan and I am disappointed in calling you my favorite star now."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "psarjun",
        "review_rating": "1",
        "review_title": "MyReviews: Teez maar Khan is a Logic-less Entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "meghal",
        "review_rating": "1",
        "review_title": "Bollywood of 2010 and beyond",
        "review_detailed_main": "After having read negative reviews about this movie and seeing it in the bottom 100 list on IMDb, I decided to try out this movie. Obviously, it wasn't worth spending even a single cent on a movie that has Akshay Kumar as the main lead and is trashed universally. I was lucky enough to be able to borrow this movie from the public library.\n\nThe movie sets its low standards right from the opening credits - a dancing foetus in scenes that are just a rip-off from opening credits of Bond movies. The movie just keeps trying to fathom the abyss of movie making and never tries to redeem itself. Reminds me of what late Roger Ebert wrote about \"Freddy Got Fingered\" - \"This movie doesn't scrape the bottom of the barrel. This movie isn't the bottom of the barrel. This movie isn't below the bottom of the barrel. This movie doesn't deserve to be mentioned in the same sentence with barrels.\" There is nothing in this movie that is worth mentioning - because this movie lacks anything that has semblance to the art of movie making - acting / story / direction / dialogues. This movie does not even fall in the category \"so bad it is good\". The movie is just based on the recent Bollywood premise that if you hire popular actors, spend money on promotion and promote it as a \"brainless entertainer\", there is a certain demographic that will flock to theatre to spend their (or their parent's) hard earned money. It is just like flipping a coin - some movies end as winners, some end being losers. Equally disappointing is the fact that movies that were released after \"Tees Maar Khan\" have followed this formula and have earned big bucks.\n\nI do not have any admiration for Akshay Kumar's acting skills since I saw \"Deedar\" in theatres 20 years ago. And after 20 years, his wooden face and expressions haven't changed a bit. To expect any acting from Katrina would be akin to expect that mortal can create miracles and cure human beings. But what is painful is to see talented actors like Anjan Shrivastav, Sudhir Pandey or Apara Mehta in roles that are an insult to their acting talents. And somehwere along the lines I have a suspicion that this movie, although credits Farah Khan as director, is ghost directed by her hubby, Shirish Kunder (who has four or five other credits to his name in this movie). Farah has done a decent job in \"Om Shanti Om\".\n\nI have given one star only because a)IMDb does not allow negative star ranking b) you can see Farah's choreography skills in the \"Sheela\" song."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ori-96118",
        "review_rating": "1",
        "review_title": "The worst movie of all time.",
        "review_detailed_main": "Akshoy Komor has been delivering bakwas movies all his life. He should retire."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sheilakaursheila",
        "review_rating": "5",
        "review_title": "Funny if a bit slapstick",
        "review_detailed_main": "I liked the lead song a lot, I would give that song a 9/10 as, it sounded to me like it was standing up for women's choices in life and could be interpreted to mean standing up against violence against women."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "amitshetty73",
        "review_rating": "1",
        "review_title": "One of worst movies of Bollywood",
        "review_detailed_main": "Tees Maar Khan is one of worst movies in history of Bollywood. The movie has plunged Bollywood to all time low. Makers of this movie think they can get away with anything with help of superstar hero and big heroine flashing skin in item song.\n\nDirection By Farah Khan is beyond imagination. It is horrible to say least. Story was copied from Peter Sellers movie After the Fox but i think there is nothing called story in it. it is joke of a movie.\n\nPerformances - Akshay Kumar doesn't live up to expectations. He did average job and was too much loud in some scenes. Katrina Kaif is horrible. Akshaye Khanna did well considering his job was to play a loud hero here. Rest were nothing great.\n\nIn other words, Tees Maar Khan is super crap movie and deserved to be flopped."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "nisarskhan-55604",
        "review_rating": "10",
        "review_title": "A Movie that released well ahead of its time!",
        "review_detailed_main": "\"Tees Maar Khan\" is a film that, upon its release in 2010, might have seemed like an over-the-top spectacle, but today, it stands as a cult classic that was truly ahead of its time. Farah Khan's direction, combined with Akshay Kumar's magnetic performance as the notorious conman, Tabrez Mirza Khan, crafted an experience that resonates more deeply with today's audience.\n\nThe film's humor, vibrant songs, and audacious plot twists have aged like fine wine, and what once felt excessive now feels refreshingly bold. Katrina Kaif's iconic \"Sheila Ki Jawani\" and Akshaye Khanna's hilarious portrayal of the self-obsessed Bollywood star, Lord Aatish Kapoor, who dreams of winning an Oscar, are performances that have only grown more endearing with time.\n\nThe over-the-top performances add a layer of hilarity that elevates the film, making every scene a laugh riot. The silliness of the jokes and the absurdity of the situations create a comedic goldmine that keeps delivering laughs no matter how many times you watch it. \"Tees Maar Khan\" was misunderstood in its era but has since carved out a special place in the hearts of many, proving that sometimes, it takes a few years for a masterpiece to be truly appreciated.\n\nP. S. - Farah you are a genius, I genuinely live watching this movie atleast once every 6 months. Please ask Netflix to add it back to their library 🙏"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "Geeta352",
        "review_rating": "4",
        "review_title": "Slapstick Comedy",
        "review_detailed_main": "Everyone seems to hate this comedy, but I've seen worst Hindi comedies. To say it is really stupid is an understatement. It's insaneness is shocking but ultimately adds to the zaniness of the non-storyline. Only Akshay Kumar has the courage to act in such shocking trash. Despite this, there were scenes that were laugh out loud funny. In light of the darkness engulfing our planet this might be just what the doctor ordered to make us momentarily forget our troubles. Good for one watch!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "kanakpradip-508-445030",
        "review_rating": "1",
        "review_title": "Copy of \"After the Fox\"",
        "review_detailed_main": "What stops Hindi film producers from acknowledging their sources? This one rips off Vittorio de Sica's hugely entertaining film with Peter Sellers, \"After the Fox\". The entire story line is copied, even scenes! It is a telling commentary on the inability of Indian directors to evoke humor. Their concept of it is exaggerating into caricatures. Such splendid artistes as Anjan Srivastav are reduced to jokers of Asrani at his worst (Patal Bhairavi). Akshay Kumar isn't a patch on Victor Mature's excellent performance in which he mercilessly pokes fun at himself. The less said about Katrina the better, except that she is worse than Brit Ekland in the original."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "anjonlimbu85",
        "review_rating": "1",
        "review_title": "Epic Fail",
        "review_detailed_main": "They tried to be funny but they failed in every way possible. Honestly one of the worst movies i have ever watched. I wasn't expecting much from it but i also wasn't expecting that less. This movie gives Bollywood a bad name. For a comedy movie all i could feel was disappointment and not a single laugh. The action scene didn't help either. The Story was so boring i almost fell asleep half way through. It made no sense. And the acting was just too much. I can't believe actors like Katrina & Akshay Kumar agreed to work in this movie. A big fat flop for Director Farah Khan who actually directed some good films like Main Hoon Na, Om Shanti Om."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "abhimanyussharma",
        "review_rating": "4",
        "review_title": "Dull and Spectacularly Unimpressive but for A.Khanna",
        "review_detailed_main": "This movie helped me confirm my long standing faith in the acting talents owned or acquired by Akshay Khanna . Leaving aside his magnificence the entire team of this movie should perform Harakiri sans any honor. The people who didn't catch the warning signals from the lame and lousy promos discovered to their misery the almost farcical treatment of comedy in this movie. The funniest part is that the movie fails to tickle in all those areas where it was supposed to. All scenes featuring Akshay Kumar alone are unbearably boring. His timing and use of subtle symbolic devices to create humour was conspicuously absent . The story wasn't written, it was scribbled on a discarded Platform Ticket by an uninterested imbecile. The screenplay is a disaster. Even the potentially funny situations were converted into dreadfully un-funny scenes .\n\nThe movie however redeems itself through the herculean comic effort by Akhshay Khanna, a man virtually ignored if not boycotted during the movie's promotion. His performance is quite good and adds life to the dead script. He delivers the payload when required. His gestures, actions, diction is immaculate. The only character who actually plays the character he he was assigned with intensity and conviction. Cameos by Raghu Ram (ok they are two individuals) also help the viewers to stop looking at the price tags on their tickets. A movie which may tickle when viewed again in parts, but which surely shouldn't have been made with any star cast."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ganeshkss97",
        "review_rating": "1",
        "review_title": "Sheila also can't save the movie",
        "review_detailed_main": "Did Farah Khan direct this movie? Is it the same person who mad hits such as Main Hoon Na and Om Shanti Om? Several questions come up like these after watching Tees Maar Khan.The screenplay written by the Kunder brothers is just not watertight.Its loose in several places.Farah tries hard to make it an entertaining fare but there are hardly few laughs which are far and between.Music by Vishal-Shekhar is just about okay barring \"Tees Maar Khan\" and Sheila Ki Jawani. Performance wise,Akshaye tops as Aatish Kapoor.While Akshay Kumar as Tees Maar Khan is simple.Katrina is just beautiful.That's it.Sudhir Pandey is truly fantastic as Bunty Baweja.The villagers only shout and ham throughout the movie.The henchmen of TMK are just about okay.Aman Varma,Murli Sharma,Vijay Patkar and Sachin are gap fillers. On the whole,A Major Disappointment."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "1",
        "review_title": "Complete torture",
        "review_detailed_main": "Remembering this pile of crap from 2010 I remember been proper bored to death of this watching it at home. I'm sure it was a outright torture for all most everyone who watch it specially in cinemas"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "abhishek-612",
        "review_rating": "1",
        "review_title": "Torture mat maar Farah Khan",
        "review_detailed_main": "The botomline is that Farah Khan should stop directing and stick to choreography, which she is good at. The movie is not even a mindless spoof. With empty cinema hall seats, adding more to the horror of watching such a terrible movie one ought to think twice before continuing after the intermission. Coming back to the movie, the direction was immature, pathetic screenplay, bad appearances for actors like Anil Kapoor, Akshaye Khanna and Katrina Kaif. One of the worst seen in my life. The movie might have been a \"box office\" hit if Shahrukh Khan had featured in place of Akshay Kumar. I plead to everyone not to encourage anyone to watch this movie as i was misleaded by my friend to watch it."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "t_brown555",
        "review_rating": "3",
        "review_title": "Don't Waste Your Time...",
        "review_detailed_main": "The best way to judge a comedy is by how many people laugh out loud at the jokes...and our theatre was silent throughout this film, generating a couple of quiet giggles in one or two scenes. People were actually grateful for the intermission! The story was too far-fetched and unbelievable, the actors was intentionally over-acting, to an extra-ordinary level. Even the serious scenes were spoilt. Too many unnecessary guest appearances just for the sake of it, without adding anything to the story. The script was terrible. You can see why Akshay Kumar's career is going down-hill - Singh is King was the last good movie he made. The only good thing about this movie was Katrina Kaif - she looked HOT!!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "divysingh-77794",
        "review_rating": "9",
        "review_title": "So much underrated",
        "review_detailed_main": "Don't what's the problem with people It's very funny movie Amazing sense of humour."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "arvindchosen1",
        "review_rating": "1",
        "review_title": "Would win Oscar for the worst movie of the year",
        "review_detailed_main": "Well this is one of the few movies I have watched and have started hating the actors in it for what the hell they were trying to enact !! It really does not make any sense. The story , the plot , the humor is all so idiotic. Akki's over-acting skills really don't surprise me these days. Thats all that seems to be left in him after these long years of stardom.\n\nHow can a normal sane person believe such incredulity of a conman being hailed as the Robin Hood and then he goes on to create a movie .. Worse still it wins an Oscar !! Oh my God . I had the worst time watching the whole length of the worst-comedy and blunt acting skills on the part of everyone present. Apart from the yummy item number the movie is a strict no-no. So I would happily award it the worst movie and recommend it for Oscars if Farah is so keen to win it the other way round !!"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "fackid-04615",
        "review_rating": "1",
        "review_title": "It's not a film it's a a torture",
        "review_detailed_main": "It's not a film it's a a torture shame on bollywood"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "superindrajit",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "lanabhat",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "No story, Nothing to gain from this movie. Farah Khan could be given a worst director award for this movie."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "MovieInspector",
        "review_rating": "1",
        "review_title": "Nah, this isn't worth watching.",
        "review_detailed_main": "The film is about a conman played by Akshay Kumar and a difficult task he is assigned. One thing really annoys me. Akshay Kumar is a very talented actor, but he doesn't seem to do himself justice these days and wastes his talent doing movies like this. The less said about Katrina's performance,the better. Actors in supporting roles do their bit fine. Granted, this film had the third biggest opening weekend after Dabangg and 3 Idiots, but that was because of all the hype. Trust me, it doesn't live up to it at all. The music is, I suppose, OK.\n\nVerdict: it is acceptable to watch it only if you have free time in abundance. I give it 3/10"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "unbornpaniwala",
        "review_rating": "1",
        "review_title": "The jokes on us!",
        "review_detailed_main": "Almost all of us are ruing about the fact that we had gone to watch TMK with a lot of expectations after all the hype and anticipation surrounding Farah Khan's latest third movie. The problem is that Farah Khan took it for granted that what most viewer's look for in a movie is a great star cast, nicely choreographed songs and a comic like story. All of these were also widely used to great success in her earlier movies which was done sensibly around a visible story. But the problem with TMK is that it does not tell anything that the viewer can relate to and like other Farah Khan movies she adds an artificial humor to it only excessively this time. Her earlier movie characters had some true to life feel although there were unusual things happening to them but their reactions seemed real. Like SRK's emotions in Om Shanti Om when he enacts receiving an award or when he first meets his dream girl. Here Akshay Kumar plays the role of a big-time crook or con-man but his con jobs seem completely unreal and so does the way his character acts through it. There's absolutely no sense in watching someone with a brain of a monkey do feats of a rocket scientist. It's as if there was already a movie with the same concept that was made with a serious tone and Farah is trying to make a spoof out of it. The viewers don't have a clue as to what she intends to make fun of as the spoof is on an original movie that doesn't exist or no one watched.\n\nWhile no one expects real acting in a spoof, the role of an actor of Akshay Kumar's caliber is required to have some substance to it. It would have been perhaps better suited to cast some unknown or small time comedian in this completely silly role than to waste Akshay Kumar's skills and star image. Also instead of dressing up this mess with senseless scenes and songs Farah Khan should have made an effort to make the characters look real and get some sensible acting out of her cast particularly Katrina who will only be noticed for the item song. The viewer's watch comic movies to forget their worries but they're not stupid. So Farah Khan should sit down with those who write the story before deciding how to make a comedy scene than the other way round. Also the gay concept is getting kind of old but she seems to still live in the last decade. This is certainly not a good way to end a decade in Bollywood!!\n\nIts the viewers who pay the price of a ticket and they are the ones who decide if a movie is really worthy of appreciation. Patting oneself on the back and creating fake hype is just a way to cheat and insult the earnest viewers who unknowingly fall in the trap of watching these duds. A over hyped movie like this is nothing but a bad elaborate joke on the intelligence of those who spent their money on buying the tickets. But right now no one is laughing."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "nitishv65",
        "review_rating": "1",
        "review_title": "torturous!",
        "review_detailed_main": "Big stars(especially Akshay Kumar) ,extreme promotion,showpiece Katrina Kaif , add to it the most stupid director Farah Khan, makes a perfect recipe for one of the most stupid film of Indian film history.But not to worry, Bollywood is the most resilient creature in the world, and I' am damn sure that they will continue to make such debacle.Now lets be specific, actually the script was written by a Noida based rikshawala Satyender Sattoo!OK jokes apart,don't dare to watch this movie,that's it. I have other things to do and I can't give even my faltu time to review this title.After reading all this if you are still interested then may the god save you,best of luck."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "1",
        "review_title": "Nonsense comedy at it's worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "nishesquire09",
        "review_rating": "8",
        "review_title": "Not your typical Bollywood comedy, TMK is truly hilarious!",
        "review_detailed_main": "I watched the movie while vacationing in India with 5 others between the ages of 21-28 (three men, two women, and I was the only NRI). Each of us thoroughly enjoyed the movie, laughing from beginning to end. We were joking about the movie days after watching it. On our recommendation, our uncles and aunts watched TMK, and they returned with the complete opposite view -- like many of the reviewers on this site, they hated it. Immediately it occurred to me that this might be a result of a generation gap, or an open-mindedness gap.\n\nThis movie shares many similarities with Austin Powers or Anchorman or any other \"absurdly\" funny movie you're familiar with (note: I hate most Bollywood \"comedies,\" so I bring up Western titles. I loved 3 Idiots but it's a different type of comedy.) Yes, the storyline is unrealistic, but that enhances the comedic value of the movie -- it's not supposed to be serious. Yes, Akshay Kumar \"overacts,\" but that's his character and he plays that role exceedingly well. Yes, the jokes sometimes lack depth, but the movie is replete with memorable one-liners.\n\nI'm dumbfounded as to why people hated the movie so much. At the risk of sounding insulting to others, my only explanation is that many of the reviewers were simply not ready for such a film. It does feature several homosexual characters, but most younger generation Indians, I'm guessing, can roll with that. Maybe it takes a certain level of experience with absurdity or sarcasm that maybe the younger folks are more experienced with (I apologize about the \"maybes\" but I'm trying my best to provide possible explanations as to why so many people disliked this movie).\n\nI urge you not to write this movie off. Watch the trailer on this site -- if you find yourself chuckling at some of these scenes, then I guarantee you will find yourself cracking up at the movies. Like myself, you may even buy the DVD and put it in your comedy collection (next to your Friday and Big Lebowski)."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sarmadbashir",
        "review_rating": "5",
        "review_title": "Not too bad of a movie",
        "review_detailed_main": "This movie was one of the funniest I had seen in a long time. The story was OK but there could have been more to it. The acting was meh. A lot of scenes were plain boring. There were some unnecessary parts in the movie that had me face palming all over the place. The comedy is where this movie shines. The last few bits had me in tears from laughing so hard. While some may not agree, The funny parts of the movie made up for most of the horrible and unnecessary parts. The acting did not seem to bother me too much. The songs were not too bad and the actor choice was pretty good. Over all this movie was not too bad like most people say. Taking all the positives and negatives from the movie, It deserves a 5. Honestly, I don't understand why there is so much hate for this movie though it was a decent release."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "ajay-92672",
        "review_rating": "2",
        "review_title": "Complete torture",
        "review_detailed_main": "Farah khan has just proved that why she should just stop making movies because this is not a movie,this is epic garbage in fact farah khan should give money to all the people who have watched this movie either in home or in theatres,everything is pathetic in this movie from hero to heroine to supporting actors,the only reason i gave it 2 stars because of Sheila ki jawaani otherwise i would have given it 0 stars"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "viktordash",
        "review_rating": "1",
        "review_title": "TMK utterly sucks,from beginning to end ,its nothing more than a waste of money and time.",
        "review_detailed_main": "First of all all the hype created around TMK is nothing other than a waste of time and money. Tees Maar Khan doesn't live up to the high expectation of the people . Rather it falls flat . As the promos and the preview suggest , th story is about Tabrez Mirza Khan aka Tees Maar Khan. A con artist ,a thief who is capable enough to open any lock , in any place of the world, let that be on a flying plane or a running train. the story revolves around how he undertakes a job to rob a running train containing 10,000 kilograms , worth antiques.\n\nwell , routed to be as one of the biggest hits of 2010, TMK turns out to be one of the biggest flops of the year joining Ravaan and Kites.With silly one liners and awful con tricks TMk is one of the worst con movies i have ever seen till date. With a little or no use of the acting skills of Katrina Kaif and Akshaye Khanna , Farah Khan wastes them totally.the only interesting part of the movie is the song Sheila Ki Jawani that might drag the audiences to the theaters but if you take my opinion friends don't go for it if you have no intentions of wasting your money and time on one of the awfully scripted,directed movies of all time.i would rather call it as FARAH KHAN KI AAG rather than Tees Maar Khan it worst than Ram Gopal Verma Ki Aag."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "est2019",
        "review_rating": "1",
        "review_title": "Utter Garbage",
        "review_detailed_main": "How the hell was this movie greenlit? This is honestly one of the worst movies I have ever seen. Between the shoddy acting, annoying songs that come at the worst times (save for Sheila Ki Jawani), and lack of a narrative, Farah Khan truly disappoints in a way that no other director can.\n\nThe songs are absolutely terrible in this movie. The main characters will be tricking an entire village full of idiotic dimwits and buffoons, and cut to a song.\n\nIf you haven't heard the title song, you cannot say you know what the word \"annoying\" means. As for the ever so hyped Sheila (which is done within the first twenty minutes of the movie), we get introduced to Katrina Kaif's character and never see her again except for a few ditsy lines here and there.\n\nDon't get me started on the so called humour. The worst screenwriter of the year goes to Shirish Kunder. Housefull (2010) is intelligent compared to this garbage crap.\n\nAs for the two male leads - the less said the better. Akshaye Khanna's career has reached an all time low (we're talking lower than the Marianna's Trench). As for Akshay Kumar, this movie really took a toll on his career.\n\nFinally, the worst director of the decade award goes to none other than Farah Khan. The same director who brought you the excellent \"Om Shanti Om\" is now duping innocent moviegoers into wasting their money and time."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "waqassaleem-85201",
        "review_rating": "5",
        "review_title": "Average",
        "review_detailed_main": "An average mindless film. Akshay Kumar was good in his role and had good comic timing. Katrina Kaif was just there for the glamour. Missable."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "musicmansurana",
        "review_rating": "1",
        "review_title": "This Movie is amongst the worst films I've ever seen...........",
        "review_detailed_main": "With a combination of Akshay Kumar & Farah Khan for the first time on the big screen I had huge expectations from this film...And more-so, when Sheila Ki Jawani turned out to be a highly appreciated item number.... But honestly speaking, I seriously have no words as to how bad this movie actually is.... After having heard the remarks from my friends I never went to the theaters to see it.... I got to see it on DVD at home & after the first 10 minutes or so I had actually shut it down.....later on I tried watching the movie when A friend of my challenged me a 100 bucks to watch it....But, I could only complete watching the movie in 5 installments...... This movie was a complete disaster!!!!! If IMDb had the option of negative rating would definitely give it a ~~~10!!!!!!! :D"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "saad_khi",
        "review_rating": "2",
        "review_title": "pretty funny!",
        "review_detailed_main": "i didn't like 'mhn' n 'oso' n after reading most reviews panning 'tmk' thought of skipping it including the fact it's a copy of sorts of the peter sellers' 'after the fox'. me thinks: the trailer and promos never invoked laughter! on top of that Akshay Kumar desperate to act young! anyways, took a chance n saw it 1st day 1st show! Farah and bro and directors like them may appear to be all filmi and for bollywood, but in reality are out to make a quick buck with the opening weekend collection. and nothing for the art of film making nor creating an impression for others to be inspired from. quite repetitive in places! how long will she in particular pay homage to Indian (commercial) cinema in one way or the other? lady, come up with your own style to be acknowledged as 'Farah maar khan'. \"never the less 'tmk' is funny n crazy! made me lol! and this one reminded me to be as fantastic as 'Mr Natwarlal'. the 2nd half was equally hilarious! Aryan and Akshay Khanna are good. Kumar is not over but doesn't look young as those 2. would have given it 3 stars if it had been 'original.\""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "silvan-desouza",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sagheero",
        "review_rating": "8",
        "review_title": "Mercilessly being written off! Not so bad...",
        "review_detailed_main": "The genre of movies to which TMK belongs to is generally Spoof or typical Bollywood Masala movies. Reminds you of the yesteryear's Govinda fare. Leave your brains behind for this one! One thing is for sure, it was crisply edited. The movie did not bore me. I do love my share of refined movies like Guzaarish, Johny Gaddar, My Name is Khan to name a few, but this movie has its own space! Farah Khan entertains us and how! I loved Akshay's rendition of Tabrez Mirza Khan aka Tees Maar Khan's character. In fact, even Kat was lovable in her dumb belle avatar. Sheela Ki Jawani impressed and so did the song with Sallu in it. You could see the chemistry between Sallu n Kat in the song. I even liked Akshay Khanna in it! And I am not a big fan of either Akshay Khanna and Kumar, but still, loved the movie. All in all, the story seems predictable, the plot line thin, but the characters will entertain. Typical popcorn timepass movie."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "sural-sayantan",
        "review_rating": "1",
        "review_title": "the most stupid film of this century",
        "review_detailed_main": "don't dare to watch this movie,let me suggest u a way of letting others watch it for u,if u are enemy with someone gift him/her this crap.I am sure like hell whoever gonna watch the whole movie is gonna be freaked out.and they won't be able to speak or hear anything in hours.I don't honesty understand whats wrong with Bollywood,its like you have money and you need a way to spend it,so this is what farah khan did. seriously Bollywood grow up.I thought while checking the movie if I ever had a bazooka I would surely point it to farah khan.because this is not movie making this is bloody crime.i hope the viewers are not as screwed up as the director herself.and another thing is this movie is semi hit in India(i don't know how come) Katrina sucks in acting big time and akshay(no comments) i think he has escaped from a mental hospital.those who makes this kind of script ,movie should b arrested in 24 hours on a non bailable warrant. I am utterly sick of Bollywood. when will u grow up?"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "andydgr8",
        "review_rating": "1",
        "review_title": "One of the best C-grade films of Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "gamangues",
        "review_rating": "2",
        "review_title": "Sheila Ki Jawani fails to make it even watchable.",
        "review_detailed_main": "What to expect from the movie: 2.5 hours of complete waste of time. Basically challenging your brain to believe that you are actually watching some thing so messed up.\n\nReasons to watch it: 1. Nice Songs 2. Salman Khan Cameo 3. Sheila Ki Jawani: The item number (song pictured on Katrina Kaif) 4. Farah Khan film.\n\nReasons not to watch it: 1. It is a great possibility that movie was shot without a script. 2. Overdose of performances by every actor. Special mention to Akshay Kumar, and the roadies duo Raghu and Rajiv (they humiliated themselves). Film making. Akshay Kumar, tries too hard to act in this one but fails. 4. Tees Maar Khan's assistants are unbearable. 5. Before the story settles down, something stupid always stops it.\n\nFarah Khan gets full score for choreography but none for direction."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "dhayadek",
        "review_rating": "1",
        "review_title": "Bad,Rediculous movie with story.",
        "review_detailed_main": "Tees mar Khan is world's biggest disgusting,rediculos movie ever made, this film is directed by Farah Khan.Akshay Kumar's acting is bad in this film.don't watch this film."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "afterbuddha",
        "review_rating": "1",
        "review_title": "shame for Indian film industry",
        "review_detailed_main": "I can understand why most of the people have rated AWFUL for this movie. i guess Farah Khan has totally lost it. She is better at choreographing shila ki jawani or other songs. All the stupid jokes were disgusting. Akshay Kumar needs to take a break and look for some better roles. and what can i say about Katrina Kaif? I heard once that you were looking for roles like the one in 'no one killed jessica'!! How will you get such a movie if you keep on doing roles like the one you have done in Tees Maar Khan! The only dialogue that Katrina says is, \"I will apply more make up on the face\". I hope none of my friends watch this movie as its a disgrace to the Indian Film Industry."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "nagmamagic",
        "review_rating": "1",
        "review_title": "Someone shoot me please.",
        "review_detailed_main": "Okay, seriously either this movie was complete genius and was poking fun at its audience, or it was the worst movie I have ever seen in my life. That was a waste of my money, time and brain. I definitely lost some brain cells over this movie.\n\nThe jokes are useless, the acting is .. I can't even comment on it, the whole movie is a big fat idiotic joke. Sheela ki Jawani was the only thing in the movie even worth listening to, and it definitely isn't the best song you've ever heard. You could just as easily utilize youtube for your music video watching needs and thats good enough. The rest of the movie is useless and ... i'm rambling.\n\nJust do your brain a favour and don't watch it."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "annie_dissac",
        "review_rating": "8",
        "review_title": "Strangely Charismatic",
        "review_detailed_main": "I disagree with people who found this movie awful. I must admit, initially, I found that the actors were over-acting and the storyline seemed ridiculous, but THAT was the beauty of this movie.\n\nTees Maar Khan is a full-blown comedic Movie. Its very ingeniously disguised as overacting and pointless. IF you think about it, a con-artist getting a group of villagers along with a big-shot-Actor to be a part of his grand scheme of things pretty much sounds like all BOLLYWOOD movies. I think its about time Bollywood comes out with movies like this.\n\nA Bollywood Movie usually drags on a simple storyline through hurdles and hurdles of endless disappointments just to get to the obvious ending. I can't sit through a full Bollywood Movie at any given time without being bored out of my mind. But Tees Maar Khan occupied every single minute of my time and I honestly thought the movie was only an hour and a half.\n\nIt was the overacting that made this movie simply beautiful. Its like a \"Scary Movie\" version of all Bollywood movies mushed up together.\n\nI found this movie very strangely charismatic with the cast and storyline. It was out and out entertaining! It was honestly worth watching, but keep an open mind. Movies that doesn't revolve around love and its hurdles are just overdone and boring."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "aashayraut",
        "review_rating": "8",
        "review_title": "So bad it's so good",
        "review_detailed_main": "When you watch this movie just watch it for what it is, it's a parody / fun just laugh kind a movie it's so awesome. The jokes which are kinda meta / reference and the the music fits it all obviously initially it was like a bad movie but down a beer or 2 with your friends this is a feel good / fun drunk movie where you don't have to think pretty much at all my god more like this please.....the songs are really good and when the score plays it's kinda fitting, the Oscar \"millionaire\" reference is so fitting in what hollywood actually think of us this thought was one of the drunk thought which occurs while watching this movies 😅🤣🤣. This is the kind of underrated films we need more of ....."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "hackerhamza-01168",
        "review_rating": "10",
        "review_title": "Good of All Movies",
        "review_detailed_main": "Akshy was good man and his movies are very like in Pakistan .I wish Akshy visit Pakistan and make a movie.."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Tees Maar Khan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "singhskhalsa",
        "review_rating": "8",
        "review_title": "it would have truly been a Tees Maar Entertainer",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "s_viren",
        "review_rating": "10",
        "review_title": "best movie ever",
        "review_detailed_main": "this is the best movie ever it's a well-made remake of after the fox - 1966 starring peter sellers. The action & acting of each actors is amazingly done the music is excellent except the song \"Happy Ending\" is not that good but the rest is amazing my favorite choices are: \"Wallah Re Wallah\", \"Sheila Ki Jawani\" & \"Badey Dilwala\". My recommendation is go out watch this movie in the theaters forget about stress and pressure of school/work, trust me you will have an amazing time. Akshay Kumar & Katrina Kaif couple is yet successful again after the successful hits: \"Namastey London\" & \"Welcome\".\n\nMusic Rating: 8/10 Movie Rating: 10/10 Acting Rating: 10/10"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "clanbell-97919",
        "review_rating": "9",
        "review_title": "This is a great movie!",
        "review_detailed_main": "Western watcher here and no nothing of Indian cinema. Typical musical comedy. Great songs and choreography mixed with silly gags and running jokes held together with a paper thin plot. Very traditional in a hollywood 40s-50s POV. Lots of fun. Watched several times. Sad no longer available. The girl is very easy on the eyes, the action hero lead is done with a great comedic touch. Two closeted gay cops are pretty funny as well. Worst part is the beginning where they try to set up a backstory that is pretty weak. But it gives us an escape to start with and the chase is on from there. If it ever comes back into distribution will definitely give it another go."
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "shubhamtaneja-67143",
        "review_rating": "8",
        "review_title": "eeeeffddfdf",
        "review_detailed_main": "FfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvchFfdfdfdfdfdfdfdfdfdfddfdfdffdfdfdfdfdefeddhsdhshhsgshgdhbdjhvwehjevfhvhsvnsvch"
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "bobbysing",
        "review_rating": "",
        "review_title": "With no declaration of being an official remake anywhere in its titles, I would take it as a shameless COPY of Peter Sellers AFTER THE FOX and that too way below the mark.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Tees Maar Khan,an awful movie!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1572311",
        "movie_name": "Tees Maar Khan",
        "movie_rating": "2.8",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "\"Over-the-top\" on just about everything",
        "review_detailed_main": ""
    }
]