[
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "PoisonKeyblade",
        "review_rating": "2",
        "review_title": "God-awful Family Film with Little to Offer",
        "review_detailed_main": "After sitting through the entirety of Daddy Day Camp, I have to wonder what was going through everyone's minds who were involved in the making. The most likely reason was probably them thinking, \"Is it really possible to make a movie this year that is worse than Evan Almighty and Delta Farce? Let's go for it!\" Fortunately, Daddy Day Camp is nowhere near as horrible as those other two films, but lord know that it does come very close. This abomination of a movie somehow manages to feature a great actor, Cuba Gooding, Jr., in by far his worst role yet.\n\nAnyone even slightly familiar with the first film will know the deal here. Low on money, Charlie Hinton decides to open up a camp similar to the day care service he ran in the first movie. Along the way, he must resolve problems with his father and show his son that he really loves him.\n\nYes, I know the plot sucks. While the first movie wasn't anything to write home about, Daddy Day Camp is about a thousand times worse. In the few scenes where there is supposed to be something meaningful occurring, everything just comes off in the wrong way. It might be because everything about this careless sequel is just ridiculous. Was it really necessary to make a sequel? The first film is almost entirely disregarded and almost every role is recast (although I haven't seen the first one in quite some time so there might not be any of the original cast members returning.) When Eddie Murphy turned down the movie, they should have just dropped it and forgotten about it. He was part of what made the first movie work, to some sort of level. His manic energy, his great comedic timing, his general appeal\u0085 Cuba Gooding Jr. is a great actor, but this role was just altogether wrong for him. It just didn't work as well as it should have. That being said, however, he was certainly the best aspect about this utterly atrocious film.\n\nDaddy Day Camp is missing much of the magic that made the first movie watchable. None of the scene meld together very well (some of the younger characters go from heartfelt moments, to being rude to other kids for no reason to be rude and increasingly annoying) and the writing and dialogue are as unbelievable as they come. The villain is just pathetic, and the lesson that is supposed to be learned by the end of the film is a very weak one. Since none of the younger characters follow this lesson throughout the movie or seem to have learned anything by the film's end, it all feels just so useless. There are also, of course, those same old gross-out gags that you find in any boring family comedy. Here, however, they are not done as tastefully as in Underdog or as effectively as in the Cheaper By the Dozen films. In Daddy Day Camp, just like with the first film, it is pretty much lame gag after lame gag, watching flashy boring moments thrown onto the screen in the hopes that something will stick and not come off as completely and totally immature. In the first film, more often than not, most of the gags worked to a certain extent. In this film, there are very few redeeming factors, though. Barely any of those gags work. In fact, I didn't even crack a smile throughout the whole movie, and I am incredibly easy to please.\n\nAnother huge problem of the film was that most of the child actors were not only annoying, but their acting was so bad that I wanted to kill myself. Each person had their moments, but the kids mostly came off as incredibly inexperienced. Movies as bad as Daddy Day Camp could at least have the common decency to provide us with a semi-likable cast of children that won't annoy us to death throughout the movie. The people who cast this predictable shame of a movie should have learned a lesson from the talents of the kids in the feature film adaption of How to Eat Fried Worms. All of those kids were incredibly likable, and I loved every minute spent with them and their childhood lives. That film is much more interesting and complex than this simplistic bore-fest that cannot even credit a single laugh to its name. With Evan Almighty, I did at least laugh quite a few times. In Daddy Day Camp, I cannot even give it that compliment. The only reason that it ended up better than Evan Almighty was because of the story between Charlie and his father. Surprisingly enough, it actually worked at times, and it worked very well I must say. And not all of the kids were completely terrible.\n\nSo all in all, Daddy Day Camp was a pretty crappy movie filled with wasted talent and some of the worst child actors I've seen on screen. It is really obvious from the get-go that very little effort was put into this boring sequel. I just hope that nobody goes into this movie expecting even a relatively good movie, because it disappoints with even the lowest of expectations. 2.5/10"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "benangelus57",
        "review_rating": "2",
        "review_title": "Most Pointless Sequel Ever?",
        "review_detailed_main": "OK first off i was put off this movie by the fact that Eddie Murphy didn't want to be in it, which looking at the films he pumps out now is saying something (i have Norbit in mind) i only saw this movie as a friend had it so it didn't cost me anything, and i was sorely disappointed.\n\nI had always liked Cuba Gooding Jr. since i saw him in rat race, but this has ruined my opinion of him.\n\nI found this movie unfunny and as it develops it becomes a poor mans cheaper by the dozen 2 (which was no masterpiece itself) truly a film to avoid"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "mvd102000",
        "review_rating": "3",
        "review_title": "All in all, it's still terrible...",
        "review_detailed_main": "Really, I'm only commenting because the original \"most useful\" comment was idiotic, and praised the movie. Upon seeing the case for the movie, I realized that Eddie Murphy was not in the movie. I turned the case around, and discovered that the same character was being played by another actor; an actor who shouldn't be in terrible sequels, playing an already well-known actors character, only a few years after the original had come out. The film itself delivers a lack-luster storyline and secondhand laughs. The acting isn't so great and the believability of the entire thing is low, much unlike most of the first movie. I'm going to have to say, for Oscar-winning Cuba Gooding Jr. to take a role such as this, he may have risked his entire career's great overview. The original itself wasn't exactly sequel prone, but at least it was watchable."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "lvalyani",
        "review_rating": "1",
        "review_title": "I don't like this",
        "review_detailed_main": "I guess the only reason you should watch this family movie with your family is if you hate both your family and yourself."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "toh-3",
        "review_rating": "5",
        "review_title": "Average movie..definitely NOT worst in the history!",
        "review_detailed_main": "This is my first comment on IMDb, because i am not very good in English. But seeing that this movie was so underrated, i cant resist to write review. This is good kid-movie! It kinda remind me my childhood. Kid's acting was not annoying, and directing - not boring. Storyline - simple, but not crazy unbelievable. Jokes makes me smile, but not laugh of course, i am probably too old for this humor :) But kids may like it very much. And most important, movie is not stupid and has some moral thoughts.\n\nIt is definitely NOT 2nd worst movie in history! I see A LOT of movies every day and to half of them i am not paying attention too much or just turn off after few boring minutes. Daddy day camp i watched till the end (and with some pleasure). 5/10\n\np.s. but if this movie had 3/10 i am probably never would watch it :) \"Worst in the history\" take my attention."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "criticlh-1",
        "review_rating": "1",
        "review_title": "Send Fred Savage to Movie-making Day Camp",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "MLDinTN",
        "review_rating": "1",
        "review_title": "simply a horrible idea",
        "review_detailed_main": "This movie was just awful. The plot is 2 guys who run a day care decide to take over a day camp. One of the guys, Charlie, is at odds with the guy who runs the other more fancy camp. Charlie doesn't want that guy to take over the older camp. Some of the \"funny\" parts were the cleaning up of the camp. It's always so funny to see someone fall through a roof while hammering or cleaning up a nasty bathroom. It will have you rolling in the floor, NOT!! So, the ending is the predictable competition between the 2 camps and the other camp cheats to win some of the games. But, Charlie's kid saves the day by winning.\n\nWhy would Cuba Gooding be in this. He must have been desperate for a check.\n\nFINAL VERDICT: You will hate yourself if you waste 90 minutes on this. Don't do it."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "thatFNAFFan",
        "review_rating": "2",
        "review_title": "WHAT HAPPENED TO EDDY MURPHY??!!!",
        "review_detailed_main": "This movies is terrible Eddy Murphy isn't in it and his role from the first movie fits perfectly. But, they replace Eddy Murphy with Cuba Gooding Jr. and Cuba doesn't fit into his role. They even replace all of the other actors, as well.\n\nThe only jokes in this movie is fart and poop jokes and only 5 year olds will laugh at those kind of jokes.\n\nThis movie is really hard to watch and I will easily forget this movie even existed."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "Wizard-8",
        "review_rating": "",
        "review_title": "You'll know what you'll get even before you watch it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "Not quite craptastic enough to be in the Bottom 100....but this isn't exactly high praise.",
        "review_detailed_main": "Wow. I can only assume that either Cuba Gooding Jr.'s agent is crazy. How else can an actor go from an Oscar-winning performance in \"Jerry McGuire\" to making crap like \"Daddy Day Camp\" in a decade? As the expression goes....\"my how the mighty have fallen\"! Here, you know you are in for trouble when this film is meant as a DVD sequel, of sorts, to an Eddie Murphy comedy--a man whose taste in film projects in recent years has also been baffling to say the least! Both men play the same character, Charlie Hinton, and I guess we are to assume he's been through a major accident and massive plastic surgery between films--only this would explain how much Charlie has changed!\n\nSo why would I choose to watch a film that from all appearances will be crap? After all, in addition to the down and out Gooding, the film also has the distinction of being on IMDb's Bottom 100 list--the 100 lowest rated films with at least 1500 ratings. Well, by this point, I've done over 8000 reviews and I've gotten bored. After watching a lot of foreign, art and independent films, I have recently decided to try watching the very worst there is to offer as a change of pace! I've already seen 41 of the 50 worst films from the Harry Medved book (\"The Fifty Worst Films of All Time\") and since the other 9 just don't seem to be available, I'm now working on IMDb's list. This particular film is about the 55th film from this list I have seen. Wow, am I a glutton for punishment!! But also, I like laughing at the ineptness of many of these films--they often really are unintentionally funny. Of course, occasionally they are just horrible...period.\n\nThe film begins with a Black actor and a White actor (just like in \"Daddy Day Care\"--just with different actors). They are trying to find the perfect summer day camp experience for their kids. They hit upon the lame idea of re-opening the camp that they'd gone to as kids--as it's bankrupt and COULD be run successfully if they use their \"Daddy Day Care\" method they used in the last film.\n\nAs for the camp, the kids and their parents are all kooky characters (or is it 'caricatures'?. Of course, things soon completely fall apart at first and things look dire for the future of the camp--especially when the folks at Camp Canola (who bear a lot of similarity to the folks at Cobra Kai) try to put them out of business and buy their land. But, given that this is a Hollywood film, you can safely assume that against all odds, everything will magically work out by the end of the movie. So what is their secret for making it all work? Charlie brings in his drill sergeant-like father, the Colonel, to help run things--since he is an organized man of action. And, of course, there is the obligatory sports competition between the nice camp and the evil one.\n\nOverall, the film isn't quite as bad as you might think, though it's all formulaic and predictable and has every cliché this sort of film could possibly have. Now I am not saying it's good--but it's also pretty harmless entertainment for kids. However, I can't imagine teens or parents watching this poorly written fluff and actually enjoying it because the writing is amazingly broad and the humor awfully dim."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "videogamer3960",
        "review_rating": "2",
        "review_title": "I liked the first one, this one was horrible though.",
        "review_detailed_main": "I saw this movie when they forced us to see it in summer camp. It was a lot worse than i expected. Most of the movie is 'pee' jokes and shallow kid humor. It doesn't help that the acting is terrible, and even though the movie is short, it feels as if you have been tourtered for days. If you even want to think of getting this movie for your kids, put it down and get the billionth season of spongebob. So if you want a horribly made summer movie that should have won the razzie award for best picture, go ahead and see this movie. If you want a good movie go see juno or ratatouille for the kiddies. Well i've hope i got my point across, do not see this movie. Bye."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "johnny-w",
        "review_rating": "10",
        "review_title": "Best Film of 2007",
        "review_detailed_main": "What is with all of the negative reviews? Sometimes I think the reviewers here on IMDb are just messing around with our heads. Bottom 250? Really, IMDb?! I'm fairly certain that in a few years, when people start seriously looking back on the Greatest Films of the 2000s (I call them the \"aughts\"), Daddy Day Camp will be at the top of most peoples' lists.\n\nThis film stars Cuba Gooding, Jr., who never really impressed me in his earlier roles in Boyz n the Hood and Jerry Maguire. I forgot everything I previously knew about Gooding once I saw this movie. In Daddy Day Camp, he is in charge of running a day camp with Paul Rae (Daddy Day Camp) where they find themselves in some knee-slapping crazy situations.\n\nThe film gets some magic touches from director Fred Savage (The Wizard). I think Savage should have been put in charge of directing the original Daddy Day Care movie; he might have saved it from flopping so horribly! Give this one a shot, folks. It's a family-friendly movie (and a hit with teenagers). Looks like all of the other Negative Nancies reviewing this film woke up on the wrong side of the tent!"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "imdb1",
        "review_rating": "6",
        "review_title": "Family movie",
        "review_detailed_main": "The movie starts off a bit like a slapstick, with humor more aimed at (very) young kids (although it didn't bother me that much; I'm still a child at heart). The second half of the movie is just good, when the plot picks up, evolving around a rivalry between two summer camps, intertwined with \"lessons\" about the father-son relationship. Despite that this movie is currently rated on average 1.7, I don't think that any child will be disappointed by it; they just don't vote on IMDb that young. If you want to hire a movie for your kid between 5 and 10 years old, don't be afraid to hire this one and I assure they'll have lots of fun and really feel good afterwards."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "snoozejonc",
        "review_rating": "4",
        "review_title": "It has some positives",
        "review_detailed_main": "Charlie expands his daycare service to the summer camp business.\n\nThis is a mostly weak film, but rather than join in with all the abuse it gets from reviewers I will focus on the positives.\n\nFirstly, it is clearly aimed at a young audience and for me it works as a solid children's movie. I watched it with my 7 year old daughter and she enjoyed it. I can see why, because at her age I would likely have done so too.\n\nIn relation to the above, it has some good moral themes that shine through certain lead characters. Charlie's relationship with his father and the way in which certain family problems are overcome positively sets a good the example to the children. I also like the focus on motivating the children to grow up to be a nice people rather than ingrain a \"winning is everything\" mentality.\n\nI think the lead adult actors do good work with the material they have. To be fair the script is not good, but the likes of Cuba Gooding Jr and Richard Grant do remarkably well to make certain dialogue sound like it's coming from real human beings. There is an exchange between the characters on a train station that had the potential to be awful, but they rescued it.\n\nThe production values are clearly very limited, but the filmmakers do a decent practical job of telling the story visually and putting across the humour as well as they possibly can.\n\nAs for the reasons the movie is considered poor, I agree with a lot of what is being said, except when the child actors are being slated, as I believe it is poor form by reviewers to throw negativity at children who are clearly doing their best. For me it's the writing and humour that does not work, unless you REALLY love repetitive gags about toilet habits, flatulence, vomiting and general bad smells. Plus Lochlyn Munroe's character is so annoying he is virtually unwatchable in every scene and he appears a lot.\n\nComedy is in the eye of the beholder so others may enjoy it more."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "zaralynch-35103",
        "review_rating": "1",
        "review_title": "Truly Awful",
        "review_detailed_main": "I recently watched this video it's my kids after it was added to Netflix and my god it was the longest movie I've ever watched and it's only an hour and a half. There was really no need to make this after Daddy Day Care. The acting is so bad it's cringeworthy. I don't know what the point was in making the second one with absolutely none of the actors from the first one but the same character names. Cuba Golding Jr is excruciatingly bad in it, like EXCRUCIATING. It has all the typical American terrible film stereotypes too. When it was added to Netflix I thought it was a new movie but it was released in 2007, but now I know why I've never heard of it."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "CandidlyCandid",
        "review_rating": "",
        "review_title": "Hard and boring to watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "matowakita",
        "review_rating": "5",
        "review_title": "Better than most reviewers say",
        "review_detailed_main": "This film does depend too heavily on various \"stink\" jokes, but the performances are generally strong.\n\nThe father-son relationship is well portrayed, especially by Cuba's father (Richard Gant). It could use more convincing development of the motivation for the \"loss\" that haunts Cuba's character so many years later. However, Lance (L. Munro) is a good, bad-guy.\n\nPaul Rae, who plays Cuba's sidekick is impressive. I've seen him called a John Goodman clone, but other than in general appearance, that isn't true. Rae gives a subtle performance that goes far beyond the usual fat-guy role.\n\nFred Savage does a good job with the kids. All of the are realistically cute, without being over-the-top. Tyger Rawlings is good as the \"bully\", but I worked several days on this shoot and Tyger is a natural comedian. He could carry a leading comedy role with ease.\n\nA bit of trivia -- it was very cold and raining or snowing most of the days the competition scenes were shot. If you watch the trees, you'll see increasing numbers of leaves that have turned yellow or red from the frost. The scenes shot on a few days had to have low angles to keep the snow from showing."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "TheLittleSongbird",
        "review_rating": "2",
        "review_title": "Poor",
        "review_detailed_main": "Daddy Day Care was flawed, but actually pretty watchable. Daddy Day Camp however is a poor film. The production values are pretty good, but for me nothing else works.\n\nThe story is very predictable with one too many clichéd and unfunny situations, while the script is weak. The direction is lacking, the pacing is rushed and the characters are never believable. The acting is nothing special, Cuba Gooding Jnr tries hard to make something out of his character and replacing Eddie Murphy, but instead comes across as bland and annoying. Same with Paul Rae, and how Richard Grant got dragged into this I shall never know.\n\nOverall, a poor comedy and family film with little to offer, old or new. 2/10 Bethany Cox"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "TheUnknownReviewer",
        "review_rating": "1",
        "review_title": "WHY??!?!",
        "review_detailed_main": "First of all, Why did they replace the already good actors! Eddie Murphy did so good in the first movie why just why did they have to replace them and they replaced everybody from the 1st movie!"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "msims1",
        "review_rating": "5",
        "review_title": "Fair Family Fare without overly perverse antics",
        "review_detailed_main": "Saw this at a sneak preview Saturday (August 4) with mostly families who were excited about being with their family members AND seeing a free movie. Cuba Gooding, Jr., is not as wildly off the wall as Eddie Murphy, nor as funny. Still, the conflict between his character and his character's father is something that many fathers and sons encounter and can relate to. The interplay between Cuba and his on screen wife is also something to which many husbands and wives can relate.\n\nMost of the laughs are for wacky, wildly inappropriate adventures, and the conflicts between Camp Driftwood and the exclusive rival camp brings up many noteworthy topics for family members to discuss long after the movie is over. This is a silly, pleasant movie, that is probably just as good on cable or DVD as it is in the movie theater. However, that being said, with so many non-family friendly movies in the theater this summer of 2007, this might be one of the better movies for the family to see before school is back in session."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "isaackamp",
        "review_rating": "2",
        "review_title": "Don't Bother",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "hedin_88",
        "review_rating": "4",
        "review_title": "a bad sequel",
        "review_detailed_main": "i saw the first part in the cinema and the second ant home, not expecting much. I was right, the movie was boring and not much funny at all, the first thing was that Eddie Murphy was missing, he did an great job in the first part and gave a lot to the humorous part of the movie. This second part had a more serious lead actor that does bot seem to be funny enough. The idea was also a bit boring and one-sided. Predictable and lacking reality. The kinds also had no idea about acting and that had its on contribution to the boringness of the movie. What else to say than the characters were not developed enough... one by one, the puzzle shows to be boring, predictable and plain humor. But hey, the movie is made for those younger folks and if they don't give a damn about the acting and the story, still like it. The first one is a great family movie but the second is just too childish...."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "rdhigg1",
        "review_rating": "6",
        "review_title": "Not as bad as everyone says it is",
        "review_detailed_main": "This was not bad at all. Be honest, most of the negative reaction came before anyone even saw this movie (due to Eddie Murphy's absence). Everyone is stuck on \"Cuba won an Oscar and now he's making this?\". I thought it was a good idea not to have Cuba Gooding Jr act like Eddie. Cuba doing an \"Eddie\" impression for 90 min would have been a mistake. He's his normal neurotic/slightly geeky self. Director Fred Savage did a capable job. Hopefully, he gets another shot at a major studio release. Yes, the first one is better, but this is not a bad sequel. Maybe it could have saved itself some abuse by being released direct to video."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "e_barker",
        "review_rating": "1",
        "review_title": "The director must have been high",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "roccomannott",
        "review_rating": "1",
        "review_title": "Kevin Arnold made a film.........",
        "review_detailed_main": "I really liked Daddy Day Care but this was just atrocious! Daddy Day Camp should be called Fred Savage goes to film camp because he needs it!"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "timothygartin",
        "review_rating": "3",
        "review_title": "Disappointing Sequel Without a Heart",
        "review_detailed_main": "I liked Daddy Day Care. We bought this movie by accident trying to get the original. I hoped it would be good but it is more of a shadow of the first one.\n\nIt feels like a focus group watched the first one and identified the best parts. Then, the writers took those parts and made a movie around them. Unfortunately, this movie does not work.\n\nThe lead character is just sad. He is painful to watch. His past isn't funny and the pressure he puts himself and everyone around him under isn't funny either. The enemy are stereotypes and one-dimensional.\n\nI didn't laugh and I cringed way too much for a comedy."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "georgedarwell",
        "review_rating": "",
        "review_title": "Pathetic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "benjaminweber",
        "review_rating": "3",
        "review_title": "Creatively bankrupt",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "Edvis-1997",
        "review_rating": "4",
        "review_title": "4",
        "review_detailed_main": "I would say it was below average like 4. It wasn't the worst but still \"Thank you,next\"."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "studioAT",
        "review_rating": "3",
        "review_title": "Daddy Day Camp",
        "review_detailed_main": "Always beware a sequel where none of the original cast return, it rarely indicates a hit.\n\nSo here we have 'Daddy Day Camp', the sequel to 'Daddy Day Care' that I don't think anyone was really chomping at the bit for.\n\nIt makes the cardinal sin (for me) of having Cuba Gooding Jr step in and say he's playing the same role as original star Eddie Murphy did, with no real overlap in portrayal to back it up.\n\nThis film isn't bad, the original was hardly masterpiece comedy to start with, but the material is certainly weaker this time around, and even the presence of former 'Wonder Years' star Fred Savage, who has directed many a successful sitcom, can't lift it."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "sddavis63",
        "review_rating": "1",
        "review_title": "It's Not One Of The Worst 100 - But It Is Bad!",
        "review_detailed_main": "OK - it's a bad movie. No argument about that. The story had some potential mind you - the guys from \"Daddy Day Care\" branching out into running a day camp - but it was poorly put together, had absolutely no flow (especially for the first half hour or so) and featured a type of humour that might be best described as juvenile (except that might be insulting to juveniles, so let's call it pre-juvenile) with jokes that revolved largely around burping and farting and various and sundry other bodily functions. It also featured a lame competition between Camp Driftwood (the Daddy Camp) and a rival camp run by an obnoxious (so obnoxious in fact as to be totally unbelievable) director, played rather pathetically by Lochlyn Munro. I knew this would be slagged pretty hard because of virtually all the main characters from \"Daddy Day Care\" being recast, but - not having seen the original - I'm in a position to look at Cuba Gooding Jr.'s performance without the face of Eddie Murphy looking over my shoulder. In all fairness, Gooding wasn't bad as Charlie Hinton - he just got suckered into starring in a really bad movie. Having said all that, this movie doesn't really deserve to be ranked in the worst 100 films OF ALL TIME. There are a lot of movies worse than this (one scene actually made me smile, and I've sat through a lot of \"comedies\" that didn't even get that much response.) So, it's not one of the worst 100, but it is pretty bad. 1/10"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "stormhawk2021",
        "review_rating": "2",
        "review_title": "Awful...period.",
        "review_detailed_main": "The first film, despite not being a marvel of the seventh art, still managed to convince the viewer and make him spend a very entertaining time with a story that incited simple humor on the part of the youth under ten years. The film was original because it was about a father who was setting up a nursery. Quite predictable, but it deserved the one approved by me and by the youth audience like me. But in view of the success of the first, the producer decides to win money to the beast making a sequel very dispensable of this already saga.\n\nThe second is about Cuba Gooding trying to keep afloat a camp he went to when he was young. To keep him afloat brings the children of his nursery, of course, all mischievous. Otherwise, the camp is ramshackle and they decide to fix it with more than one fall in between. But it turns out that next to it there is a new camp the director of who was old opponent of Cuba (Lochlyn Munro), whose children soon become opponents. To all this we added the tournament between camps.\n\nMost likely you have had a Déjà Vu. Calm down, it's just a very exploited story. I went to see her with a seven-year-old who kept laughing at the falls. Obviously, what are you going to say to a seven-year-old? If it is your gender, you can not tell a father not to love his son, because the same.\n\nRecommended to fans of easy laughter or to children without criterion."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "kairingler",
        "review_rating": "6",
        "review_title": "summer camp",
        "review_detailed_main": "this movie isn't near as bad as most of the reviewers on here claim it to be,, I don't honestly know what their expectations were, but they must have been pretty darn high,, they must have been expecting it to be as good as the first one,,, wrong,, course it's inferior to the first one I figured it would be. Cuba Gooding Jr. however will have you rolling on the floor with laughter,, which is exactly what I was looking for when I bought this movie,, lot's of mayhem and practical jokes about in this movie. sure it's not gonna win any awards,, but then again it doesn't stink up the joint either,, good comedic relief if you ask me."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Daddy Day Camp",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "ericstevenson",
        "review_rating": "1",
        "review_title": "I don't care what happens to these characters",
        "review_detailed_main": "This is one of the dumbest movies I've ever had the misfortune to rent at my local library. The plot features these two guys who buy a camp and try to save it from being shut down. It's a sequel to a movie starring Eddie Murphy called \"Daddy Day Care\" which I heard was bad to begin with and I'm not even going to waste my time with that movie. I remember watching the first ten minutes and thinking that it wasn't that bad. I thought that at least it didn't have farts and poop. Guess what they feature ten minutes in?\n\nThe characters and especially the villains are especially so annoying. Everything is so amazingly clichéd. There's this one boy who has a crush on a girl. I couldn't care less about what happens to anybody in this scenario. There's no setup, there's no reason at all to be interested in what's going on at all. There's two scenes where a kid throws up. I thought to myself that at least they didn't do it a third time where they actually show the vomit.\n\nI was just waiting them to show that and of course they did. I thought that at least there wasn't a kick to the crotch and guess what happened eventually? I'm reminded of a song in \"Team America: World Police\" where it mentions that Cuba Gooding Jr. was a better actor than Ben Affleck. Now he certainly isn't and this film cements that status. I was even able to predict that a kid would use plants as toilet paper. This is an absolutely horrible film and please don't even consider renting it. 1/2*"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "bbfheatfan",
        "review_rating": "1",
        "review_title": "Waste O' Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "mohan_i",
        "review_rating": "1",
        "review_title": "brainless, mind numbing crap & only succeeds in infuriating the hell out of well meaning viewers...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "freakfire-1",
        "review_rating": "1",
        "review_title": "Worse than \"Ace of Hearts\"",
        "review_detailed_main": "You have go to be kidding me. This movie actually got the budget and the go ahead to be made? Were the people at the studio so cheap that they wouldn't even afford the original main actors? I am shocked this sequel to \"Daddy Day Care\" was given to Cuba Gooding Jr. Besides the latest Land Before Time sequel, what else has he done? And why did they get people that only sound and maybe slightly look like original cast members? If they were going to use sub-par actors, Richard Karn needed some work. I sure he and Cuba would work out fine together.\n\nThe cheesy sequel revolves around a camp that is about to be destroyed, which sounds like \"Ernest Goes to Camp\" in my opinion. But have no fear, Cuba is here! He somehow, through movie magic, saves the day. I don't need to go into details because it has been done one-hundred times before with a better cast and acting.\n\nThis movie is deserving of its Razzie Award. I am disappointed it didn't win more of them. \"F\""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "SPZMaxinema",
        "review_rating": "6",
        "review_title": "A funny movie...for kids.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "knagisa-14352",
        "review_rating": "4",
        "review_title": "not worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "jeffreyflagenstien",
        "review_rating": "5",
        "review_title": "A day in the life of a kid in daddy day camp",
        "review_detailed_main": "I was really excited for kamp today, they told me it was for the best, and i believed them. There we were, at the large iron gate to daddy day camp. My brother, Hertzel, was immediately taken from the line to be put with the other larger men for hard labor. i myself was subject to the much crueler treatment of being tortured for the knowledge of the wherebouts of others like me. The fat man who replaced Jeff Garlin from the original movie starred down at me during snack time, his hungry eyes giving off an intensity that would send shivers down my spine. after we were allowed to return to out shacks, he pulled me aside and forced me into his home. he then proceeded to rape me at gunpoint. I can still remember him yelling \"imma put some extra mayo on this kosher jew-burger\". He then began to beat me about the head, and i blacked out. Then my mom came to pick me up and we had muffins. Then i went home to my doggie sparky and we played catch. it was the best day ever."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "EJ021302",
        "review_rating": "4",
        "review_title": "An unnecessary but kinda funny sequel",
        "review_detailed_main": "Should they have made a sequel? Probably not, because I was happily satisfied with the original 2003 movie and I have it on DVD. Daddy Day Camp or Daddy Day Care 2 doesn't have anybody from the original cast, but luckily I am quite a fan of Cuba Gooding Jr. And that is why I rated this movie 4 stars. Cuba has had a successful career in the 90s after Boyz N the Hood, his best performance by far. Some people criticized this movie for bad acting and unfunny jokes, or jokes that were copied and pasted from the original movie like that scene where the kid pukes in the tent, it was supposed to resemble the toilet scene from Daddy Day Care. I did laugh and chuckle at this movie so I don't really have anything against it. But I can honestly say that I have seen better acting from Cuba Gooding Jr."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "sufyaanrashid95",
        "review_rating": "5",
        "review_title": "A Lackluster Sequel That Fails to Recapture the Comedy of Its Predecessor",
        "review_detailed_main": "\"Daddy Day Camp\" attempts to continue the spirit of its predecessor, \"Daddy Day Care\" (2003), but falls short of the comedic brilliance that made the original film a success. Directed by Fred Savage, this sequel struggles to deliver the same level of humor and entertainment.\n\nThe film's biggest setback is its inability to match the comedic genius of Eddie Murphy, whose absence is keenly felt. Cuba Gooding Jr. Steps into the lead role, but his performance lacks the comedic timing and charm of Murphy. The chemistry among the cast members also feels lacking, resulting in a less engaging and funny experience.\n\nThe humor in \"Daddy Day Camp\" often feels forced and predictable. The jokes lack the cleverness and wit that made the first film so enjoyable. Many of the gags fall flat, relying on recycled slapstick and uninspired comedic situations that fail to elicit genuine laughter.\n\nThe storyline, while attempting to bring a fresh twist by focusing on a summer camp setting, lacks depth and originality. The plot feels formulaic, following a predictable trajectory without offering any standout moments or surprises. The characters, including the children at the camp, are underdeveloped, further diminishing the comedic and emotional impact.\n\nWhile the film retains some heartwarming messages about family, friendship, and the importance of perseverance, these positive aspects are overshadowed by the overall lackluster execution.\n\nIn conclusion, \"Daddy Day Camp\" is a lackluster sequel that fails to recapture the comedic brilliance and charm of its predecessor. The absence of Eddie Murphy's comedic talent, coupled with uninspired humor and a formulaic storyline, results in a film that falls short of its comedic potential. If you loved \"Daddy Day Care,\" it's best to approach this sequel with tempered expectations, as it lacks the same level of laughter and entertainment."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "inkblot11",
        "review_rating": "7",
        "review_title": "May seem like Deja Vu all over again, but if it inspires laughter, no one cares!",
        "review_detailed_main": "Charlie (Cuba Gooding, Jr.) and Phil (Paul Rae) have been running their successful Daddy DayCare for several years now. However, summer vacation starts and the kid care guys are ready for a break. Not so fast! Charlie's wife thinks it would be good for their now elementary ages son to go to day CAMP. This horrifies Charlie, who hates bugs, snakes and competitive sports. But, when he finally agrees, there is no other camp choice but the one he, Charlie, went to, Driftwood. Driving out to the woods, though, with his son and Phil, they are astonished by a couple of things. First, there is a flashy day camp just next to Driftwood, run by an medal-winning and obnoxious Olympic athlete (Lochlyn Munro). Secondly, Driftwood is about to go under from the competition and is extremely rundown. Guess who steps in to turn it around, Charlie and Phil, that's who. Good at promotion, they snag a bus load of kids for their first week. But, after exposing the kids to poison ivy, wet boots, getting lost among the trees, etc., they lose a good deal of the children to the nearby \"super\" camp. Not wanting to be defeated, Charlie calls on his retired Marine-father colonel, Buck (Richard Gant). to help save the day, even though they have crossed horns many times. Eventually, the wangle more kids AND a day of competition with their foes next door. Who will win? Viewers may think they are traveling down Deja Vu lane, which is true, but the movie still hits the funnybone. The cast is one big reason, for Gooding, Jr., Paul, Munroe, Gant and the rest enthusiastically play out the slapstick script. All other film aspects, that is, costumes, sets, script and direction are worthy as well. Think this is one to skip? Not so, its fun!"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "matikalyere",
        "review_rating": "7",
        "review_title": "good family entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "moviemaniac008",
        "review_rating": "7",
        "review_title": "Stop bashing this!",
        "review_detailed_main": "Okay, I was just wondering why the hell do horrible movies like the Truman Show and other crap like that gets nominated (and possibly wins) for Oscars while we absolutely need to send these kind of movies straight to the Razzies. I mean let's face it: like most sequels, Daddy Day Camp is not better than the first but still enjoyable. Of the actors, Cuba Gooding Jr. and the the other camp monitors (which I forget their names) were excellent. Some of the kids like Cuba's son in the movie could easily start a career, while some others (which I will not name) should be sent down to the Razzies. Besides Cuba's son, Billy the bully is within the good actors, and Grandpa Buck is hilarious.\n\nThe emplacements were beautiful, and I just wish for people like major critics to stop saying negative stuff on this movie, because it's a lot better than what you're expected to watch."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "vincentlynch-moonoi",
        "review_rating": "7",
        "review_title": "Decent family film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "davispittman",
        "review_rating": "6",
        "review_title": "Not as bad as many might suggest",
        "review_detailed_main": "Daddy Day Camp is just simple family friendly entertainment. Cuba Gooding Jr. actually did pretty well despite what some critics might say about his performance. The plot was pretty basic, nothing too deep or articulate, but the plot didn't need to be, it's supposed to be simple and fun. I watched this film one night with my grandparents, and we all liked it OK, it wasn't great, but it certainly wasn't terrible. It did have some gross out moments that I didn't care for, but there were also some nice heart warming moments to enjoy as well. Cuba's dad in this movie was my favorite part of the whole film, that was a really good character, and he had some good scenes. Bottom line is that this is a movie that is safe for all families to sit and watch on family movie night, it might not win any Oscars, but it's enjoyable enough. 6/10."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "masterman-65833",
        "review_rating": "7",
        "review_title": "Great movie Cuba Gooding nailed it!",
        "review_detailed_main": "First time posting a review, i just had to because i got sick and tired of everyone saying this is a bad movie, they have no since of humor. Even though Eddie who is my all time favourite actor didn't star in this movie, i kind of like it more then Daddy day care even Big up for this review!"
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "tlyqmyl",
        "review_rating": "6",
        "review_title": "Oh I enjoyed this one WAY much to hate it.",
        "review_detailed_main": "Sure it's \"campy\" (Get it?) But hey, I at least enjoyed in some of the jokes and I had an ironic enjoyment on this."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "joecarong",
        "review_rating": "7",
        "review_title": "Harmless family movie with some good laughs",
        "review_detailed_main": "Not the worst movie out there but not the best! They tried too hard to make it like the first one without Eddie Murphy with Cuba Gooding Jr. Doing an adequate job as his replacement."
    },
    {
        "movie_id": "tt0462244",
        "movie_name": "Daddy Day Camp",
        "movie_rating": "3.2",
        "review_username": "felicia-lawyer",
        "review_rating": "7",
        "review_title": "Light and enjoyable.",
        "review_detailed_main": "I don't see why this movie is receiving such horrible reviews. I have sat through 2 hours of movies that were considered comedies and not even chuckled. I missed the beginning and laughed out loud 3 times within the first 15 minutes of watching. That attack on the rival camp is hilarious. Gave me a much needed moment to not be so serious at a very serious times in our lives. Was going to watch something else but realize this is what my heart needs right now. Love the actors and acting.It's a silly movie and just what I need right now."
    }
]