[
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "BrandtSponseller",
        "review_rating": "7",
        "review_title": "It has problems, but this is a fairly enjoyable, if silly, film",
        "review_detailed_main": "As long as you're in the mood for a lighthearted, somewhat goofy and self-consciously modern Bollywood romantic comedy, Mujhse Shaadi Karogi can fit the bill. It's often funny, and in many ways it is technically impressive. However, partially due to the necessity of stretching out the film's running time to standard Bollywood length, it becomes quite taxing during the second half. Most viewers' ratings are likely to go down during this period, but director David Dhawan redeems his film in the climax. My final verdict was a 7 out of 10, or a \"C\".\n\nMujhse Shaadi Karogi is the story of Sameer (Salman Khan). It was clear since Sameer was a baby that he was headed for trouble. The priest who named him suggested \"Sameer\" because it means something like \"calm breeze\"--he predicted that Sameer would frequently have problems with his temper, and in a very funny opening sequence, we see the truth of this as we quickly follow Sameer as he grows up. At one point, he even smacks his high school principle. Of course, Sameer always thinks his actions are justified, that he's just sticking up for people who have been wronged. Unfortunately, people in power, such as judges, tend to disagree with him. And even the woman he loves says she's afraid of him. She marries someone else instead. Sameer decides that it's best for him to leave town and try to start afresh. He acquires a job as a lifeguard in Goa. Once there, he sees and falls in love with Rani Singh (Priyanka Chopra), his neighbor. Unfortunately, as soon as he meets her, he unwittingly assaults her father for a minor transgression. To make things worse, Sameer ends up with an obnoxious, competitive roommate, Sunny Khurana (Akshay Kumar). Sunny is a womanizer who falls for Rani, too, and he continually turns the tables on Sameer to ruin his chances with Rani.\n\nThe majority of supporting characters are very funny. Once in Goa, Sameer hooks up with a younger astrologer named Raj Purohit (Rajpal Yadav). I've seen Yadav in a few films now, including Dil Bechara Pyaar Ka Maara (2004) and the excellent Main Madhuri Dixit Banna Chahti Hoon (2003). He's had a comic edge in all of them and he's impressed me with his range. Sameer's landlord in Goa, Mr. Duggal (Kader Khan), suffered a head injury that results in him alternately being blind, deaf and dumb on different days. A sign outside of his office lets people know which problem he has at the moment.\n\nOf course, some of this is a bit ridiculous. Ridiculousness is a big theme, actually, and imbues everything from characterization to the music. There is a lot of almost corny hip-hop music and attitude in the film, including a recurring low soul-brother voice that keeps telling us how \"wicked\" Sunny is in a sing-songy fashion. Such touches are prominent in a lot of modern Indian films. The aim is to draw in a youth crowd. In many cases, such as Lakeer \u0096 Forbidden Lines (2004), there isn't a firm enough commitment to this MTV-ish positioning to make it work for the film overall. Here, director David Dhawan keeps up the ridiculous material more consistently, and as this remains a comedy for most of its length, the corny/campy stuff often works. It may be a bit \"stupid funny\", like a Bollywood hip-hop \"Green Acres\" (1965), but that's still funny.\n\nPart of the ridiculousness is realized through references (or less charitably derivativeness) to other films. In the opening sequence, Sameer is fighting with a couple basketball players via Matrix (1999)-like wire stunts, and there's even a bit of \"bullet-time\" camera-work. Later, there is another Matrix reference, this time to The Matrix Reloaded (2003), as a drunken Sameer fights multiple Mr. Smith-like copies of Sunny in the street. There are also hints of, and even an entire lifted scene from, Meet the Parents (2000). At one point it seems like the plot is going to turn into an uncredited remake of that film, as Rani's father has military background and a Robert De Niro as Jack Byrnes-ish disposition. He even has a less than attractive dog that he's obsessed with, but who doesn't like Sameer very much. However, the Meet the Parents material turns out to not be so important, and Mujhse Shaadi Karogi has a more standard Bollywood love triangle/confused identity plot.\n\nThe main problem I had with the film, which brought my score down a couple points, was that it's difficult to not become aggravated with Sameer in the later stages of the film. Actually, it's more of an aggravation with the scriptwriting, because the scenarios, and Sameer's odd muteness while he's in the midst of situations that are constantly recontextualized so that they're not in his favor, become overly contrived. At the same time, the character of Sunny becomes annoyingly obnoxious, and the \"twist\" between the two characters isn't exactly believable.\n\nPart of this is due to the attempt to stretch out the running time to a typical length for a Bollywood film--it clocks in at 2 hours and 40-something minutes. It should have been cut down by an hour. We get a deus ex machina plot device to solve the dilemma in the middle of the film, but it is all for naught, and even given the film's running time, the resolution of the dilemma ends up seeming rushed at the end. The attempt to stretch out the tension was just a bit too over-ambitious.\n\nOn the technical side, there is some very nice cinematography, set designs, locations, costumes and such. The film won the Screen Weekly Award for Art Direction, and was nominated for many more.\n\nYou shouldn't bother with Mujhse Shaadi Karogi unless you've a strong taste for silliness/corniness/campiness, but if you do, you'll find enough to keep you entertained if you can make it through the frustrating section before the climax."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "GypsiB",
        "review_rating": "8",
        "review_title": "Fun Movie",
        "review_detailed_main": "Sameer (Salman Khan) moves to Goa and falls in love with Rani (Priyanka Chopra). Unfortunately, he keeps unintentionally injuring her father (Amrish Puri), thus ruining his chances of a romance with her. Then, Sunny (Akshay Kumar) moves to the same house as Sameer, and also falls in love with Rani. Sunny finds way after way of discrediting Sameer with Rani, and seems to be succeeding in making her fall for him.\n\nThis is a cute romantic comedy, with such bright colors throughout the entire movie, in both costumes and setting. The music is okay, and some of the dance numbers are lovely. The plot seems predictable, but has a unexpected ending. Kumar plays his role so well that I genuinely disliked him. Khan is charming and innocent as Sameer, but Chopra's acting seems stilted. Overall, though, it's a fun movie to watch, just not exceptional."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "sauravjoshi85",
        "review_rating": "7",
        "review_title": "Despite of many flaws, the film entertains!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "Dingataca",
        "review_rating": "",
        "review_title": "A nice comedy treat...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "AishFan",
        "review_rating": "6",
        "review_title": "Doesn't live up to the hype but still a good comedy",
        "review_detailed_main": "I was expecting a lot from this movie being a David Dhawan film with a totally awesome starcast, catchy tunes, and a lot of hype. Kader Khan, I thought, was the funniest part of them all. I thought the humor attempted by Akshay Kumar on Salman Khan seemed a bit harsh and not all that funny. The trio of Salman, Priyanka, and Akshay gave a good performance. \"Jeene Ke Hai 4 Din\" and \"Lal Dupatta\" were good songs. The others were average. The climax was nice and improved the movie quite a bit as it was going quite downhill towards the end. Akshay Kumar's star power seems to be gradually increasing day-by-day as his movies seem to be doing quite well. This movie is not bad; it's a good timepass."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Mujhse Shaadi Karoge Meets MEET THE PARENTS",
        "review_detailed_main": "David Dhawan films have no proper stories, no logic.etc so this is one of his films, but luckily it does make you laugh at places\n\nDD was running through a bad phase with flops like YEH HAI JALWA.etc but this film brought him back to the top for sometime\n\nThe story is similar to ANGER MANAGEMENT and MEET THE PARENTS and countless more The film starts off okay, if you can forgive Salman's over the top entry The scene where Salman slaps Amrish Puri and in the house are funny\n\nWhen AKKI enters the frame, the film gets funnier and the scenes between Akshay and Salman are damn funny\n\nAll encounters involving Amrish Puri too are funny Even the Akshay- Salman fight to get Rani though in the end it turns out to be nothing we thought and confusing yet those scenes are funny\n\nBut there are many cheesy scenes like the Kader Khan track and also Priyanka always dancing front of the mirror gets to the nerves\n\nThe film gets too lengthy in second half and boredom sets at times The ending is funny though\n\nThe countless Akshays fighting with Sallu is good too\n\nDD directs the film well at times, at times bad too but overall a decent film Music is good, most songs are nice\n\nAmongst actors Salman carries off the role well and his romantic scenes and whenever Akshay puts him in trouble are the best part though at times he comes across as putting too much effort Akshay Kumar steals the show, with his funny antics and performance From this film after KHAKEE people recognized his comic flair Priyanka comes in, dances and does all her fake antics like smiling or talking in a fake tone and irritates at times\n\nRajpal Yadav gets lot of scope in a DD film unlike PARTNER and MPKK for once and he excels, actually his comic timing is simply awesome and makes you laugh more then Salman, in his other role he is okay\n\nKader Khan looks too old and does okay Amrish Puri is awesome, the veteran was such a delight to watch in deadpan humor,\n\nthe rest are okay"
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "husnain_05",
        "review_rating": "9",
        "review_title": "A love triangle that is so funny.",
        "review_detailed_main": "This film is great. The casting could not have been much better because Salman Khan,Akshay Kumar and Priyanka Chopra were great.Kader Khan,Rajpal Yadav and Amrish Puri were hilarious. Rajpal Yadav is hilarious in all of his films like Kal ho na ho and waqt. Salamn Khan and Akshay Kumar are childhood friends but when they grow up Salman Khan forgets Akshay Kumar. Salman Khan likes Priyanka Chopra but everything goes wrong for him when he is the goodie type and everything goes right for Akshay Kumar who is the naughty type. Who is Priyanka Chopra going to go for the naughty one or the good one? If you want to know watch Mujse shaadi karoge."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "praveenravi-51193",
        "review_rating": "6",
        "review_title": "Nice Movie",
        "review_detailed_main": "This movie gives comical elements from beginning to end at the same time we feel pity towards the hero Sameer (Salman Khan) who gets negative impression from Rani( Priyanka Chopra) and their parents. The song \"Laal Thupata\" towards the end of the movie gives a pleasing effect. Altogether the movie is entertaining and good to watch."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "BiswajitSince2005",
        "review_rating": "8",
        "review_title": "Who will marry ?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "kalyanisriram",
        "review_rating": "7",
        "review_title": "A fun filled comedy",
        "review_detailed_main": "It is not the cult comedy but I just loved the tussle between the main leads Akshay and Salman. Priyanka proved her mettle in this movie. A family romcom, I simply liked the movie.\n\nLoved the songs too!"
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "Akira-29",
        "review_rating": "1",
        "review_title": "What a crock of succulent BS this \"film\" is.",
        "review_detailed_main": "Being an Indian, I am always baffled by the ignorance of Bollywood film makers about the globalization of cinema. I really really want to like these films and have refrained from commenting negatively on ANY of them just out of respect... but this one was the the straw that broke the camel's back. I apologize in advance for the scathing and sarcastic nature of this commentary and the sure-to-follow tirade about Bollywood film makers.\n\nRe: The filmmakers. Do they really think Indians don't watch American films? (You reading this Mr. Mahesh Bhatt?) Do they really think that we can't tell when scenes are plain STOLEN from American films? There are at least three scenes in \"Mujhse Shaadi Karogi\" that borrow liberally from \"Anger Management\" starring Jack Nicholson and Adam Sandler. The film also samples scenes from \"Meet the Parents\" starring Ben Stiller and Robert De Niro. Their two roles are portrayed in this film by Mr. Salman \"Do I take my shirt off yet\" Khan and Mr. Amrish \"Yet another film where I play a retired Punjabi Army General/Colonel who disapproves of my daughter's choice of spouse\" Puri.\n\nWhile the story is not an exact duplicate of either \"Parents\" or \"Management\", the characters in this film are so derivative, formulaic and clichéd that you could have thrown them in any Hindi romantic comedy. I wonder if the producers throw darts at a list of character attributes for \"HERO ROLE\" and \"HEROINE ROLE\" when coming up with plots. This film even has the overacting sidekick thrown in for comic relief... although I guess Johnny Lever had a scheduling conflict. Instead, they cast some other guy in a clever \"double\" role as twin brothers - An astrologer and his \"twin\"... uh... well... a thuggish motorcycle gang leader. (Yes, you read that correctly.)\n\nNothing \"new\" in this film - the usual sacharine acting which keeps the glycerine stock high in Mumbai... Those pathetic song-dance numbers which make one thankful for the existence of the Fast Forward button... and your garden variety soulless love-triangle storyline. I think the script would have had better use if they printed it on toilet paper. I can't believe some of these lines were said with a straight face by the actors.\n\nHere's a question for you educated viewers: Is it any more irritating when a film soundtrack has to cue you how to feel? Every time Akshay Kumar does something slimy we are treated to the whispers of \"Wicked Sunny!!\" over and over (with another horrible attempt at \"copying\" 50-Cent's music from his hit \"At the Club\"). It made my teeth itch!!\n\nI wish more films like the novel \"Dil Chahta Hai\" were made. At least the predictability factor is a little subdued in that film! Bollywood is the most prolific film producing industry - but it is evident that quantity is DEFINITELY not indicative of quality. And please, my Bollywood friends... stop copying formulaic American films and scenes. I think M. Night Shyamalan and Gurinder Chadha have demonstrated that Indians can be creative without \"borrowing\". This applies to film plots as well as soundtracks! I wonder if Roy Orbison is getting royalties for \"Pretty Woman\" from the \"Kal Ho Naa Ho\" songwriters.\n\nTo summarize, I would rather drink a quart of paint thinner than see this film again. It's disgusting, devoid of any true emotion and worst of all - it's \"humor\" is just artificial and derivative. I wanted to throw things at the screen and didn't laugh once. (I groaned plenty though).\n\nYes, perhaps I take some if this too seriously... I know the movie is just supposed to be \"fun\". It tries hard to be that... I know it's just a romantic comedy but I am beginning to loathe the complacence and mediocrity turned out by the Bollywood film industry which consistently underestimates the intelligence of its audience. I just had to write this. I refuse to hold Indian films to a different standard simply because they are Indian.\n\nI'm really cheering for all of you in Bollywood to get it together and make something worthy of international notice. They should be making American versions of OUR films, not the other way around! Turn off MTV for new ideas and realize that the lead actress' navel is not a crucial plot device. Adapt some novels to the screen... scan our history and tell some of the truly endearing human stories."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "telisirajmd",
        "review_rating": "10",
        "review_title": "\"A Timeless Comedy with Stellar Performances, Romance, and Memorable Music!\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "chintan-2",
        "review_rating": "1",
        "review_title": "Avoidable... Thoroughly Avoidable",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "ram-008",
        "review_rating": "",
        "review_title": "MSKaa",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "vjnambu",
        "review_rating": "10",
        "review_title": "David dhawan's best",
        "review_detailed_main": "Sameer(Salman Khan) is a very short tempered guy, who gets into fights for various reasons due to which his love life is also affected. For a change, sameer leaves to Goa for a job and there he falls in love with rani(priyanka chopra), but gets into trouble as he often unintentionally hurts her father amrish puri. Enters sunny(akshay kumar), as the new tenant who sets his eye on rani and smartly woos everyone including rani. He provokes sameer a lot, but sameer controls his anger for rani. Rest of the movie is who will marry rani- sameer or sunny?\n\nEven though salman is the lead, its an akki show all the way. Akshay was having a blast playing this wicked sunny. Also another highlight is its beautiful locations of goa. Sajid wajid music is also brilliant.\n\nThere is a very sweet twist in the climax which would leave a smile on your face.\n\nOn the whole mujhse shaadi karogi is the best film of david dhawan."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "mdaamir-56013",
        "review_rating": "9",
        "review_title": "Salman Khan Era",
        "review_detailed_main": "Salman Khan ka Toliye wala dance to bawaal hai. Gazab Ki Acting aur Kadar Sir to acche hai.\n\nEra era. Salman Khan ka Toliye wala dance to bawaal hai. Gazab Ki Acting aur Kadar Sir to acche hai."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "jaij1975",
        "review_rating": "4",
        "review_title": "Mixture of Kollywood and Hollywood",
        "review_detailed_main": "Mix a Tamil Film (Kabaddi Kabaddi) with 2 or more Hollywood Films (Meet the parents, Anger Management) and the end product is MSK. I am not sure how 2 people (Anees Bazmee and Rumy jaffery) take credit for a stolen story. My guess is they would have paid some paltry amount to the original producer to obtain the rights and change the screenplay by copying few scenes from Hollywood movies. The only saving grace for this movie is Akshay Kumar and few foot-tapping numbers. The movie was a surprise hit of 2004. It gave David Dhawan a much needed hit!! Aneez Bazmee remade another tamil movie as \"No-Entry\" in 2005 to resurrect his career."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "jab396",
        "review_rating": "8",
        "review_title": "Beautiful and funny Romantic Comedy - Love it!!",
        "review_detailed_main": "This is only my second review. It is my first review of a Bollywood film. I had so much fun watching this movie. The dancing scenes make up for all the foolishness that abound in this movie. Mujhse Shaadi Karogi represents what I love so much about Bollywood films. Great dance numbers with beautiful singing. The love triangle is such a wonderful way to make this a great comedy film. I don't really watch these movies for the technical aspects but the scenery/setting is very delightful. I enjoy falling into the story line and having a fun time. I highly recommend it if you love musicals and comedies as I do."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "Angelus2",
        "review_rating": "3",
        "review_title": "The songs and Akshay's walk is the only good thing...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "asif_el_huq",
        "review_rating": "",
        "review_title": "Entertaining comedy for the whole family",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "bollywoodplusplus",
        "review_rating": "4",
        "review_title": "Not worth your precious time...",
        "review_detailed_main": "I tried, real hard, somehow sat through the first half. But after watching half, couldn't sit anymore. Says it all! Although, David Dhawan has delivered much better material in the past, in MSK, it falls flat.. In fact, you can even go find some old DDhawan-Govinda movies (..No.1 series), and that will be a better way to pass time (even though you have seen it multiple times). This doesn't even fall into time-pass category, set apart comedy.\n\nCan someone teach Salman Khan acting? Everything he does, seems so artificial.... I have seen actors improve over time, Saif, Devgan ... After such a long (and supposedly successful) Bollywood career, one would expect him to improve in the acting dept!"
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "mikham",
        "review_rating": "2",
        "review_title": "Why did this even see the light of day?",
        "review_detailed_main": "Even by David Dhawan standards, this was far-fetched, uninspired, unoriginal and just plain bad. Whether it was the acting, the writing, the directing or just the film itself, it starts badly and continues rolling downhill.\n\nThe only jokes that are remotely funny are the ones they copied from Meet the Parents, and that too only when you close your eyes and imagine Meet the Parents in place of this film.\n\nThe characters are spineless, inconsistent and completely undeveloped. The plot twist at the end is very, very predictable. The climax is also stupid and illogical.\n\nThe actors were bad. Salman Khan was his usual self, and Priyanka Chopra was wooden. Akshay Kumar was over the top. The less said about Kader Khan the better. Rajpal Yadav was also pretty much below his normal standard.\n\nThe only saving grace was a couple of the songs, and some good choreography.\n\nAnother thing was poor costume design and ordinary art direction.\n\nAll in all, if you want an example of how NOT to make a film, this will probably work as a good template.\n\nIf I'm being generous, 2/10."
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "talkkkkkk",
        "review_rating": "",
        "review_title": "Good Comedy - Family watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "nitinsheenu",
        "review_rating": "2",
        "review_title": "One of the worst comedy movies",
        "review_detailed_main": "Same sequence repeating throughout the movie!! Couldn't believe that the director was one of my favourites!"
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "Vegita-6",
        "review_rating": "",
        "review_title": "One of the Best Bollywood Movies in 2004",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "kalindikrishna",
        "review_rating": "",
        "review_title": "LUV Priyanka!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "Can89",
        "review_rating": "",
        "review_title": "Awful!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0418362",
        "movie_name": "Mujhse Shaadi Karogi",
        "movie_rating": "6.7",
        "review_username": "Herag",
        "review_rating": "",
        "review_title": "Mindless&Stupid.",
        "review_detailed_main": ""
    }
]