[
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "devdenim",
        "review_rating": "5",
        "review_title": "Huge Dissapointment...key Historical incidents are not shown",
        "review_detailed_main": "Intentions were good but outcome is Huge Dissapointing. I remember the 40-50 pgs of Amar Chitra Katha of Samrat Prithviraj that I read decades back in 80s was much much better and entertaining than this movie.\n\nKey Historical incidents are not shown. Read at the end of this review those 12-13 incidents of Samrat Prithviraj.\n\nThey have altered some key incidents like Swaymwar and last dwell scene.. huge let down Akshay should have done some look test. He was not looking like a king. His last climax look he should have kept in whole movie.\n\nDirector and bad Actor choices are to blame here. There is a huge responsibility while choosing to make a historic movie. If you can't commit, dont do it.\n\nHats off to SLB. He really nailed it and have set the standards high."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bonnyjaitly",
        "review_rating": "5",
        "review_title": "5 stars for effort - minus 5 for a disaster",
        "review_detailed_main": "How do U spend 20 years on research and change history ? Prithviraj was injured in the battle and 'CHETAK\" his horse took him to safety and then on he was given his kingdom back but was beheaded for treason trying to take on Ghori again. Not the heroics they show and try to emulate Russel crowes Gladitor ...... Akshay doesn't exude the persona needed - sunny Deol - who was originally planned would have been perfect had 20 years of rubbish research not taken place.\n\nMusic is not up to YRF and neither is the eye for detail that Sanjay Leela Bhansali shows.\n\nAll in u appreciate the effort but realize that's about it cos they muddle everything else up."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "SAMTHEBESTEST",
        "review_rating": "5",
        "review_title": "A voluminous tale of Samrat Prithviraj that deserves to be seen on the big screen is hurt by Chandraprakash Dwivedi's TV-driven storytelling.",
        "review_detailed_main": "Samrat Prithviraj (2022) : Movie Review -\n\nHistorical grandeur in Bollywood is always recognised by Mughal-E-Azam, and deservingly so. K Asif's historical epic isn't just the biggest historical drama ever made in India, but also the best one. Tamil and Telugu cinema got their best with \"Maya Bazaar\" (1957), and Malayalam cinema got their best with \"Oru Vadakkan Veeragatha\" (1989). Hollywood began too early with Biblicals, but then William Wyler's \"Ben-Hur\" (1959) put an end to imagination with its unthinkable grandeur. Interestingly, these three grandeur came in the same period, and the bar was set forever. All they left for others was to match half of their legacy or somewhat more, but never to come close. Sanjay Leela Bhansali has been making historical films on a grand scale, but is unable to find an answer. Recently, Om Raut came up with \"Tanhaji\" and showed the power of cinematic vision just like what SS Rajamouli did with the fictional tales of Bahubali. But aren't we going somewhere with this? Or are we finding anything legendary? The answer is no. Perhaps it's hard for today's filmmakers to put so much effort into the project and have an extraordinary vision like DW Griffith, William Wyler, Cecile De Mille, K Asif, Mehboob Khan and KV Reddy. All they could do is present a good, watchable film with the help of technical and VFX brilliance. Dr. Chandraprakash Dwivedi, who gave us the hard-hitting Chanakya, has come up with a Hindu Samrat Prithviraj Chauhan's story, but the writer in him has fared better than the director. Samrat Prithviraj has an excellent story that can pump you up any day. It's even better than Bahubali, but just the writing isn't enough. You need to showcase the great writing in great storytelling. Then only will it fit the bill. Samrat Prithviraj has failed to find that template to fit into. The glorious tale of Samrat Prithviraj has got the grandeur, thanks to YRF's production value, but hasn't fared well with storytelling.\n\nThe film is based on the life of Hindu King Prithviraj Chauhan (Akshay Kumar), his life, love story with Sanyogita (Manushi Chhillar), his kingdom, and his valour. He has a friend, Chand Bardai (Sonu Sood), who can see the future and is always by his side. His uncle, Kaka Kanha (Sanjay Dutt), is one of his most loyal commanders out of his hundreds of brave samants. As we know from history, Muhammad Ghori (Manav Vij) lost the Battle of Tarain (1191) and then tried to regain the lost glory in 1192. Based on Chand Bardai's \"Prithviraj Raso\", the writing of Samrat Prithviraj is truly fantastic. There are so many scenes that would make you feel proud, teach you about respecting women, and about undying patriotism. The screenplay too has some great scenes involved, but it isn't flawless. There are literally glitches that you notice with just one eye, while the dramatic errors take away all the fun of filmy elements.\n\nTalking about acting, Akshay Kumar has done a decent job in the lead role of Samrat Prithviraj Chauhan. His voice doesn't come out as he or the director wanted in some scenes, but the rest of the time his dialogue delivery and expressions seem fine. Manushi Chillar looks promising in her debut, but the big impact is missing. Her dancing skills, expressions, and beauty are commendable and can be explored in better ways in the future. One of the most impactful performances in the film comes from Sonu Sood. He is very good as Chand Bardai, be it looks, accent, expressions, or confident body language. Then comes Sanjay Dutt to spoil things in his immaturely loud and irritating role of Kaka Kanha. He has such a bad dialogue delivery. In the supporting roles, Manav Vij, Ashutosh Rana, Sakshi Tanwar, Lalit Tiwari and Ajay Chakraborty are average to decent.\n\nThe music by Shankar-Ehsaan-Loy will take you back to the 12th Century. The tones are such, but is it timely for 2022's viewing? Theoretically, it is right because the film is set in a certain period, but cinematically it loses its novelty to outdated compositions. Aarif Sheikh's editing lacks the crisp factor, and the VFX are terrible in a few scenes. However, the action scenes are well shot and the visual effects in those scenes are very good. The background score is massy, jingoistic, and lovable; it's just the editing that fails to analyse the right places for it. The biggest letdown in Samrat Prithviraj is director Dr. Chandraprakash Dwivedi. It seems that he hasn't come out of his TV serial vision. The film seems so episodic, repetitive and scattered into pieces that you feel like you are watching an 80s drama in 2022. I had the same complaint when I saw his Pinjar (2003) - such a great story but so stretched like a daily soap. His writing skills are unquestionable, but his direction skills are definitely questionable. Mohalla Assi was so dragged. So is Samrat Prithviraj. The masses may not catch the cinematic mistakes while they are busy enjoying the grandeur and glory of Prithviraj, but on repeat viewing they will find out the loops for sure.\n\nSamrat Prithviraj Chauhan's story is so big, so massive, but Dwivedi failed to understand the potential of his own writing when he was in that director's chair. This story could have been taken to such a level that even Bahubali would feel humiliated, but all it offers is strictly an average viewing experience. As a whole, team Samrat Prithviraj puts a lot of effort into filmmaking, but unfortunately at the wrong place. Watch it only to know the glorious story of Hindu Samrat Prithviraj Chauhan, not for the cinematic experience.\n\nRATING - 5/10*"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "trendy-yeah",
        "review_rating": "1",
        "review_title": "Dont Go for the Name",
        "review_detailed_main": "Please dont get fooled by getting patriotic with the great samrat's name.\n\nThe movie, music, dialogues, action sequences, thrills, acting, aura, grandeur everything is very below average. The makers have just spoiled the samrat. Bad movie making overall. I suggest to watch on TV or OTT rather."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "monulovesu",
        "review_rating": "4",
        "review_title": "Disgusting.......",
        "review_detailed_main": "The way Rajputana's history has been and the events that have happened, I did not feel anything at all that it should be the story of Emperor Prithviraj Chauhan. You are showing the story of a warrior with empty twists, you are very disappointing....."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mksiwie",
        "review_rating": "",
        "review_title": "Movie is not based on true history of KHATRYA RAJPUT PRITHVI RAJ CHAUHAN",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mukuksahd",
        "review_rating": "9",
        "review_title": "Best movie",
        "review_detailed_main": "The background score is just phenomenal and has been crafted beautifully... I personally like this movie and highly recommend you to watch this movie... This is amazing.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Carolyn_Channing",
        "review_rating": "1",
        "review_title": "Worst historical movie ever",
        "review_detailed_main": "A movie like this needed atleast 8-10 months shooting but the fact that Akshay Kumar completed this movie in 40 days tell you that he is just a money-hungry person, no wonder he is so eager to jump on other movies after finishing one.\n\nAlso he is the worst casting ever, he looks like Bala from Houseful movies, not Prithviraj Chauhan. Throughout the whole movie, he had hilarious expressions on his face which I found really strange cause it wasn't supposed to be a comedy movie, yet it seemed like one. Disaster."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "salian-00689",
        "review_rating": "9",
        "review_title": "Prithviraj was a full 5 star movie",
        "review_detailed_main": "Prithviraj was a full 5 star movie with all power packed characters and amazing dialogues and I liked the one fact the most that they stayed true to the story. As a rajput, I have learnt about the history of Prithviraj and I think that all characters like Chand Vardai, Kaka Kanha, Sanyogita, Mohammad Gori - each and every role was played perfectly. Loved it!!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "7",
        "review_title": "Pretty good",
        "review_detailed_main": "Good performance by akshay kumar I'd say he runs the show pretty much and for me this a one time watch. I watched this movie in a complete empty hall It's a shame people are not giving it much of a chance.\n\nSanjay dutt was really good in his role but I found him a bit annoying in the second half.\n\nSome people are saying the second half is boring. The second half is a bit slow but the ending is as epic as the beginning of the film. I'd say its fair to say, the film opens on a high and ends on a high to."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "devangpandya-07675",
        "review_rating": "1",
        "review_title": "Bakwas",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jraam",
        "review_rating": "10",
        "review_title": "Mind blowing.",
        "review_detailed_main": "Sonu Sood's portrayal of Chand Barai . Amazing work by him. This movie really gives great inspiration to everyone I am feeling very happy after watching this Samrat Prithviraj movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Biswas_",
        "review_rating": "6",
        "review_title": "Strictly okayish !",
        "review_detailed_main": "Simply giving 1 star doesnt justify the film. Those who do that havent even watched the film and are basically haters. It's basically a 5 or 6 star film. Why? Read on.\n\n1. WAR SEQUENCES - weakest point in the film. The first war SEQUENCE was just okayish with some good moments but the second one inside the fort is terribly shot. The third one is just shown in montages like seriously why?? War sequences went from bad to worst. There is no build up at all to any war sequence. Its just like \"ok i declare war\" and war begins. The director could have made a bigger film by investing more time in the war sequences but instead he chose to move ahead with the story and give little importance to the war.\n\n2. SET PIECES - Grand scale! Here, the film scores brownie points. Atleast the makers did a good job in getting good set pieces.\n\n3. VFX - the lions shown in the Ring sequence at the start do look authentic and if you still call that looking fake, then i would say RRR's tigers looked even faker. Other than that the VFX used at other places are strictly average.\n\n4. RING SEQUENCES - one at the start and the final one at the climax. Again, this is the highlight point of the film. It is well shot especially the climax was pretty good. Further points here.\n\n5. LOVE ANGLE - there is no chemistry between Akshay and Manushi solely because one is of uncle age and other is of his daughters age. Theres even one awkward sequence during the song Makhmali when from the marriage sequence the scene abruptly shifts to a desert where Akshay and Manushi are romancing and why it looks awkward because it reminds you of a typical romantic film sequence where suddenly for a song the sequence and actors would transition from some place to some place. Also the romance tends to slow down the film.\n\n6. PERFORMANCE- Akshay is just Akshay with no change in voice or looks. He doesn't even have a real moustache. Look at Ranveer man how he transformed himself into Bajirao but Akshay could not. Performance wise he's decent but not extraordinary like a Ranveer Singh from Bajirao. Sanjay Dutt has a pretty good and slight comical role regarding his blind fold. Sonu Sood is just too preachy in this film . Manushi is very average. Manav Vij carries this one stern expression throughout the film where makers may have done that to try making him look menacing but boy! He fails. If you talk about a menacing role, see Ranveer as Alauddin Khilji.\n\n7. DIRECTION - Dr. Chandra does a very average job. He had a terrific story in hand but failed to execute it properly without maintaining a balance between the romance and war sequence. This film should have been made by Mr. Bhansali and it would have been an outstanding film.\n\n8. SONGS - not one to remember.\n\nOverall, strictly average film with 5.5 rating. Don't watch it with expectations as high as some Bajirao or Padmaavat else it would dissapoint you. Here's a small thing - Panipat had a much better war sequence plus build up than thus film."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abirmondal0001",
        "review_rating": "1",
        "review_title": "An expensive garbage",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "arjuncshekartheofficial",
        "review_rating": "1",
        "review_title": "This movie is absolutely a disgrace, Akshay Kumar is completely misfit for this role.",
        "review_detailed_main": "Instead of this buffoon Akshay Kumar if Vidyut Jamwal played the role of samrat prithviraj, then surely I'd have been given the ratings of 10 stars. This guy Akshay Kumar is absolutely commitmentless and won't even dedicate for the work he offered, and this movie proves his real mettle I E absolutely 0. There was no emotion/ Ruler like expression in his face, TBH Rowan Atkinson does have better facial expression than this Nalayak Akshay Kumar."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nrhkgsqp",
        "review_rating": "1",
        "review_title": "Ban akki from Bollywood",
        "review_detailed_main": "Such a cheap CGI , Stone Age era costumes and same monotonous acting of Akshay Kumar ... the worst thing was manipulated history with no research work done on story .. seems like Right wing Twitter troll wrote this .. pathetic movie , full money time wastage."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "iltumishghazi",
        "review_rating": "",
        "review_title": "No more historical movies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gamertgf",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "This guy constantly attempts to do some thing new and additional everyday and make his target target market sense excited . Hats off to the skills of Akshay Kumar."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "manjuachar-99252",
        "review_rating": "1",
        "review_title": "Utter time waste and money waste",
        "review_detailed_main": "Akshay does not suit the role and utterly bad direction, This was more of a love story than promoting the samrat. Even the herone suit the role.\n\nBollywood is already crumbling, Akshay shouls start taking up supporting roles. His era is over,"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nojirulsk",
        "review_rating": "10",
        "review_title": "This movie is very nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rajishingh",
        "review_rating": "7",
        "review_title": "Nice movie",
        "review_detailed_main": "Samrat Prithviraj Chauhan is a total visual treat filled with grandeur. Paisa vasool cinematic experience. YRF take a bow 👌..You have created an epic masterpiece on screen. Its VFX and special effects just raises the bar higher with grandeur...Must watch this epic masterpiece 👌👌 - Blockbuster written all over it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tackytacky",
        "review_rating": "1",
        "review_title": "Adharheen etihaas",
        "review_detailed_main": "Ghatiya movie with subpar performances. Never expected something like this from someone who had created epic television show like Chanakya. Bollywood has taken a gigantic project to mess with nationalistic movies before any sensible person take these projects. Bollywood going down the drain. Best of luck."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "janvisaha",
        "review_rating": "10",
        "review_title": "Mind blowing movie",
        "review_detailed_main": "Excellent screenplay, Authentic in every scene, A strong movie is built on the strong foundation of a stellar script. Samrat Prithviraj is one such movie. Not just a movie - a magnum opus."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pankajiiim",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "In real life Samrat Prihviraj character is large than life..but in movie Director try it but to showcase the entire life of him in between 2 hours 15 minutes not possible...Overall paisa vasool."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "livoentertainment",
        "review_rating": "2",
        "review_title": "Awful and Obnoxious",
        "review_detailed_main": "It's been a while since I had been so frustrated and mindblown on how bad a film was, and to say I felt that level of disappointment with this \"period biopic\" is an understatement. Filled with awful writing, piss poor performances, and cartoonish action sequences, \"Samrat Prithviraj\" has nothing to offer. Neither does the film be accurate historically, nor does it make it a lot more entertaining. The background score is bland, Obnoxious and overpresent, and actively takes away from the enjoyment of the film. Yeah it's a period piece, where Prithviraj totally kills someone who actually was alive after even Prithvi' own death!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "devendranathsingh",
        "review_rating": "1",
        "review_title": "Why to watch? Recommendation 0/0",
        "review_detailed_main": "You'll get idea why we first get reviews before wasting own precious time. In the name of Prithviraj they are serving worst acting+casting+cinema, it's better to watch MAJOR movie (real biopic) or Vikram 2022 (for action thriller) don't take this movie seriously many facts not shown how anyone can believe without getting authentic facts this movie as a historical movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Abdul_karim007",
        "review_rating": "1",
        "review_title": "Movie does serious injustice to a great king who sacrificed his life.",
        "review_detailed_main": "No character research.. waste of time and money... same acting from akshay sir in every movie ... Akshay Kumar misfit in this role, He isn't look like warrior and goodluck for in near future."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dipankarqwe",
        "review_rating": "9",
        "review_title": "Awesome story",
        "review_detailed_main": "Sonu Sood has been the idol personality... He just looks terrific with the he has played... Amazing experience with the movie... Plz go and watch the movie with your friends and family members.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ingalegaurav89",
        "review_rating": "1",
        "review_title": "Supremely Boring",
        "review_detailed_main": "Dialogue delivery was so bad, I wasn't able to understand m i watching Prithviraj or Bala from Housefull.\n\nThe fighting scenes were below average it feels they didn't spend any money on VFX & CGI.\n\nLeft halfway from theatre that boring movie it is."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rohmannahid",
        "review_rating": "10",
        "review_title": "It's really good movie",
        "review_detailed_main": "With this film, Chandraprakash Dwivedi has set a new standard. He has delivered in a significant way.........mm this movie is very amazing and so beautiful movie and very very nice movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tkmce2008",
        "review_rating": "6",
        "review_title": "Well made but the titular role has been poorly cast",
        "review_detailed_main": "I feel historic biopics should be left to Sanjay Leela Bhansali. He is the only filmmaker (today), who can pull it off across all departments. Gowariker started out well but Mohenjo Daro & Panipat were bad. Prithviraj has apparently been made after 18 years of research (which is believable) but everything else just doesn't have the intended impact.\n\nSamrat Prithviraj is the story of Prithviraj Chauhan from the time he defeats Muhammad Ghori until his death.\n\nThe core issue with Prithviraj is the casting. I felt the same when the trailer came out; Akshay Kumar is not apt for the role. The only scenes from the film that I liked were the ones in which he is being held captive. Manushi Chhillar is pretty decent as Prithviraj's wife; Sanyogita. Manav Vij is soulless as Muhammad Ghori. He looks bored for most part. Sonu Sood & Sanjay Dutt don't have much to do and are wasted. Ashutosh Rana does a good job though.\n\nIf Prithviraj had released 10 years ago (reduced the research by 8 years), it would have been something to marvel upon. But after watching films like Bajirao & Padmaavat, most historic films fall flat.\n\nI appreciate the effort gone into making this film; but it is 10 years too late. A better solution would have been to hand Bhansali these historic projects."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "arvishprasad",
        "review_rating": "1",
        "review_title": "Wait a min..",
        "review_detailed_main": "Please Akshay Kumar..please retire gracefully...period.\n\nWe need new generation of movies..not same old ding dong.please stop.\n\nStop ..stop.. And please stop manipulation of public..by way promoting ..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hoyransekh",
        "review_rating": "10",
        "review_title": "Great concept",
        "review_detailed_main": "Perfect actor chosen for perfect idol.i really prefer.outstanding movie.i like this enjoy ful movie.my sister and cousin are excited .We are waiting for good movie.i like movie hero akshay kumar."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dy38493",
        "review_rating": "7",
        "review_title": "Very good movie on history",
        "review_detailed_main": "Good movie to watch for especially the power packed characters performance and the new comer to bollywood manushi chillar has also done fine acting the movie is based on the battle between prithviraj and mohammed ghouri."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "SindbadOfSkies",
        "review_rating": "1",
        "review_title": "Flop show",
        "review_detailed_main": "Other reviewers have already pointed out many blatant historical inaccuracies. This movie is one of many recent Indian movies that claims to be based on historical events but is based on folklore. The formula is a simple fake narrative: muslims were good for nothing and only won through treachery (for over 600 years lol), hindus were chivalrous but kept losing because of high morals (for over 600 years lollol) , all text book history is biased (just cause it doesn't suit them), and none should question imagined 'facts' because falsifying is for the greater nationalistic good (movie is tax free in some Indian states).\n\nWhat is even more bizarre is how some reviewers are dissatisfied with 7/10 level of falsification and are demanding for 10/10 max pro level fake. Lying to themselves, making a mockery and eroding the trust of their own people."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "akkid97",
        "review_rating": "2",
        "review_title": "Disappointed movie",
        "review_detailed_main": "First is wrong casting,they should cast young and energetic actor like Vicky kaushal. Akshay Kumar is old and you can see that white hairy chest who is representing 26 years young king isn't it funny also he is the actor who make 4 movie in one year,so he didn't work hard for this role, I mean by just wearing king clothes and fake moustache and doing the same rowry Rathore acting and expecting people to watch their movie by doing some emotional religious drama to promote the movie is shameful. When you watch movie there were so many flaws in movie. Story and directions could have been better and they haven't justified the real glory,you can feel that lack of dedications. Actrees is new so no expression on her face while acting and how can we expect chemistry between 25 year young actress with 55 years old actor."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ashish-84988",
        "review_rating": "1",
        "review_title": "Lost Respect for Prithviraj Chauhan",
        "review_detailed_main": "Watching the Movie, I kind of Lost Respect for Prithviraj Chauhan himself. Even 'Bala' version of Akshay Kumar was Better. Rated 1 as its the Lowest Selectable otherwise would have rated 0. Don't know why it was made Tax Free."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "basakkhogen",
        "review_rating": "9",
        "review_title": "Great concept",
        "review_detailed_main": "Akshay Kumar has exceeded all the expectations this time around, he has raised the bar so high.. This is a very good and wonderful movie.. Plz watch the movie.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shahidroy-62204",
        "review_rating": "1",
        "review_title": "Movie pe kam kiya hota .jaise fake nationalism pe kar rha h",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ahujap-47094",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "We should support the real heroes of our country Aka samrat Prithviraj.... Really love this movie so much guys you should also watch this entertaining movie highly appreciated."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ayusht-05021",
        "review_rating": "6",
        "review_title": "Dish was tasty, but fed in very less quantity",
        "review_detailed_main": "What is needed to make a movie on the greatest hindu emperor of india was length, but unfortunately this movie lacks badly in that. If you are planning to make a movie on the life and incidences of the Great SAMRAT PRITHVIRAJ, you have to show it in details. First of all neither any background stories of any of the characters, nor the chapters of history was shown in the movie. It was more like a crammed version of prithviraj's life. While watching the movie, i was feeling like i am doing a quick last minute revision of prithviraj chauhan's chapter before giving my history exam. And the sad part was you wanted to connect yourself with the characters, but the very moment scene use to end. Same situation was with the war scenes, shots were amazing but the length was small. So unfortunately movie is a hit and miss, not leaving any impact in the end."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sv-33594",
        "review_rating": "1",
        "review_title": "The rating is created by bots",
        "review_detailed_main": "Look at the comments,do not believe on the rating .It's so fake. Dadhi aur mooch Color krwane se koe jawan nahi ho jata hai Akshay Paaji. A very bad movie. Worst part is the lead actor. Do not do not watch this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dhirendrasharma-21248",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "My younger daughter started crying after seeing the sacrifices of our historic warriors . Hum to kr rha h to use the form of a one of my friends mom is for your time in the best of luck in your."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "souvikshurjo",
        "review_rating": "6",
        "review_title": "Not perfect",
        "review_detailed_main": "Akshay Kumar didn't suit the character of a young extremely physically strong warrior. Not done!\n\nThings could be much more better.\n\nThe shooting was done within very few days with so many flaws!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "harshadjaju",
        "review_rating": "1",
        "review_title": "A big joke in name of Samraat Prithviraj",
        "review_detailed_main": "What worse could we expect from this Canadaian clown who came up with another joke on Samraat Prithviraj- which is a joke on our history. Shame on Chandra Prakash Dwivedi ji to make this film. Alshay kumar joking dancing with miss India in desert what a shame on name of Hindu Hriday Samraat Prithviraj Chauhaan."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ankitaic",
        "review_rating": "1",
        "review_title": "Not good at all",
        "review_detailed_main": "Did not like it. Akshay has lost his charm by giving flops. He is giving same expressions. Now he should come in side roles and give chance to new comers young actors."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ayushsxena",
        "review_rating": "1",
        "review_title": "Worst movie ever of 2022",
        "review_detailed_main": "This movie is based on samrat prithviraj chauhan .\n\nAkshay Kumar misfit in this role, He isn't look like warrior.\n\nWould have been better if Ranveer Singh would have acted. So much of amount got wasted in casting Akshay Kumar only which he doesn't deserve at all."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hrdc-46452",
        "review_rating": "10",
        "review_title": "Very much like the movie",
        "review_detailed_main": "Sanjay Dutt impresses once again in a war epic, there's no stoping him on the big stage. Once again he does a great work again. It is a best ever performance of him..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rajiivbrar",
        "review_rating": "1",
        "review_title": "Slow Boring, Cringe Acting",
        "review_detailed_main": "The movie base on samrat prithviraj chauhan .\n\nAkshay Kumar misfit in this role, He isn't look like warrior.\n\nRanveer Singh,Ajay Devgan Hine Chahiye The Prithviraj Chouhan Ki Role Main."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "seburain",
        "review_rating": "10",
        "review_title": "Fantastic story",
        "review_detailed_main": "This movie took years to came . Though it's been late , but its dignified.very good and interesting Prithviraj movie very nice and watchful movie.i like a great film for warriors movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "moviesfunhd",
        "review_rating": "6",
        "review_title": "Disappointed & bored",
        "review_detailed_main": "Akshay kumar is a great actor but he is misfit in this role, this movie has a massive budget but they not able to utilise it properly, fight sequence is very boring, so many cringe moments. Sets are beautiful, good vfx but Akshay kumar not at all look like samrat prithviraj & acting is worse. Movie is very short but still feels like very long & boring. I'm totally dissappointed, its an insane injustice to a character like samrat prithviraj."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tahseenmohammed",
        "review_rating": "1",
        "review_title": "Fake history",
        "review_detailed_main": "Apart from pathetic acting by Akshay Kumar, this a misleading movie and twisted history. As usual bollywood grandpa actors will do anything to be a hero."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "priyankasinghpks",
        "review_rating": "10",
        "review_title": "Mind blowing picture.",
        "review_detailed_main": "Awesome historical movie i have watched in 2022. The acting, action, songs, dance and all scenes are spectacular. My personal favourite film. Outstanding album."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sandykhan-22643",
        "review_rating": "6",
        "review_title": "Something is missing",
        "review_detailed_main": "I am a huge fan of akki but this time there was so many flaws and minus point of this movie there something in TV series apart from movie. I don't know why bollywood taking such risk to releasing a movie like that there's was a time we all respect the movie from bollywood whatever it is whoever the star is we all gonna watch. This was okaish movie that make fiction about the great king Prithviraj bollywood \"time to grow up\" before it's too late."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sameeraly-07570",
        "review_rating": "1",
        "review_title": "Wrost Movie i had Ever watch",
        "review_detailed_main": "This is the results when you complete a movie just in 42 days Wrost actor and wrost Acting Wrost storyline according to history or Wikipedia the information in movie was totally wrong A big thumbs down 👎 Warning: Don't waste your money."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "movie_goer82",
        "review_rating": "2",
        "review_title": "Fiction in the name of History",
        "review_detailed_main": "It has become a trend in India to make movies in the name of History to milk money and create an alternate version of the history.\n\nThis movie is no different.\n\nProduction wise it looks ok. Cinematography is upto the mark. But, Canadian actor Akshay Kumar does not do the justice with the role of such a great warrior. Akshay looks like a comedian and should stick to the comedy movies only.\n\n2 stars Out of 10 just for the Sake of Samrat Prithviraj."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "artisinghnyc-50544",
        "review_rating": "1",
        "review_title": "Cringe worthy",
        "review_detailed_main": "First off, Akshay cannot play a 20 year old. He is almost 60. He looks monotone, same dialogue delivery, same acting. Hex shot this in 90 days and put hardly any effort. It shows.\n\nMovie does serious injustice to a great king who sacrificed his life.\n\nAkshay needs to stop over feeding us himself. Complete crap and I feel angry."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "swatisharma-47207",
        "review_rating": "10",
        "review_title": "Amazing film.",
        "review_detailed_main": "My God, the end scene is so damn good. Akshay has put soul in each n every frame of the film, This movie is really good. It is seen with the family. It can tell about how true love can break all obstacles of war, hatred, misunderstanding of religion, etc. There is no reason to kill someone whom you have won. After watching this you will feel charming and comfortable."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jonstark-79344",
        "review_rating": "1",
        "review_title": "Boring over acting like tv serial.. Akshay kumar flop not suited to such roles, he is old",
        "review_detailed_main": "Akshay kumar flop not suited to such roles, he is old.. and very poor acting.. A lot of boring dialogue and slow pace.. lots of over dramatic over acting.. it all feels fake... only sanjay dutt is a little ok..\n\nbad direction, bad script.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "akhirulislam-71742",
        "review_rating": "10",
        "review_title": "Very nice movie",
        "review_detailed_main": "Akshay Kumar is always trying to do something fresh and out of the usual, and he keeps his fans enthusiastic for each new experience....... this movie is very amazing and so beautiful movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sameshtejas",
        "review_rating": "7",
        "review_title": "Fantastic",
        "review_detailed_main": "Samrat Prithviraj - Wow what a film guys. I am overwhelmed. What a performance by Akshay Kumar. This is definitely a masterpiece by Chandraprakash Dwivedi. Superb dialogues and awesome screenplay. Har Har Mahadev."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "manilkumar73",
        "review_rating": "1",
        "review_title": "Good movie",
        "review_detailed_main": "The movie is not made to show actual events that happened... you will still find unnecessary urdu words where it was not required.... what can you expect from Bollywoid.\n\nI will not recommend anyone including my family members..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bhatnagarmanya",
        "review_rating": "10",
        "review_title": "Excited",
        "review_detailed_main": "We should support such historic movies.\n\nAnyone cannot afford to miss this movie . Please watch it as Bollywood is back on the track .A story within the story , fairytale of Samyukta and Prithviraj In my opinion , schools should take students for such movies."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ravishbharti",
        "review_rating": "6",
        "review_title": "Lost opportunity!",
        "review_detailed_main": "Before watching the movie I had read mixed reviews and decided to watch with an open mind.\n\nSo many things gone wrong with movie, it is surprising to see Dr. Chandraprakash Dwivedi saying he can't understand why did movie fail.\n\nAlthough AK was not a good choice for the role but most responsible people for the failure is Director and Producers. Below are the issues I could observe in the movie. Might contain spoilers!!\n\n1. Except for the costumes and few sets, the said 300cr. Cost hardly visible. Looks like lion share of the budget went to AK and VFX 2. Quality of VFX is somewhat okay, while VFX for landscape looked stale and tacky. VFX for animals looks okay.\n\n3. Director completely ignored the character development completely, viewers may not be able to connect with the characters before movie finishes.\n\n4. Everyone looks in a hurry to wrap-up the movie, probably covid-19 impacted the movie even-though they don't admit this.\n\n5. War scenes looked just okay but too small, in the second half there is hardly and scene which thrills.\n\n6. Crappy screenplay, since story is already known to people it was expected that screenplay should have been able to keep the viewer engaged. Also, mixed use of Urdu and Hindi words didn't sound natural with a period drama. At times Kaka (Sanjay Dutt) and other Samants keep joking with each other but you still feel like stupid wondering what is happening.\n\n7. Cinematography is okay but editing lacks ornamentation, poor cinematic experience made me feel like I am watching some TV serial from 90's. Clearly Director lacks the understanding of modern filming techniques.\n\n8. Short in length. A lot could have been shown and said, but last war scene ends abruptly and I felt like a fool asking for more and more especially after movies like Bahubali, viewer would certainly higher expectation. You don't need to show over the top slow motion action sequences but still people have already tasted the blood after watching GOT, Troy, Bahubali etc.\n\n9. Acting is okay, nothing phenomenal.\n\n10. To me it seems, by looking at the capabilities of the director and combining the effect of Covid, at later stage YRF tried to cut budget and kept things in small scale. All in all, you can feel their efforts were half hearted."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "junaidrafiqi",
        "review_rating": "3",
        "review_title": "Bad Acting. Poor Screenplay. Historically inaccurate.",
        "review_detailed_main": "Pretty much summed up in the title.\n\nIt's a movie made to cash in on the hyper nationalism wave. And to do that there are many historical inaccuracies in the film which are aimed at demonising and vilifying a community."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bhabanipb",
        "review_rating": "1",
        "review_title": "Only come for money collection",
        "review_detailed_main": "Love story love story love story... Samrat like Prithviraj not exist only with love story.. If they r only doing this in their entire life, they didn't get the tag of great samrat at all.. But directors thought every time love story will work.. but now time is changed.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "man_utd-81303",
        "review_rating": "4",
        "review_title": "Yash Raj Films - Why? Painful to sit through the movie.",
        "review_detailed_main": "It's the second Yash Raj movie within a month and both lacking content. This movie has done zero justice to the character and amount of history it carries along.\n\nI didn't learn much about Prithviraj or Sanyukta or Ghouri after watching this movie. Utter lack of content and it was painful to sit through the movie. Music is below average and is not worth watching in cinema. Even the battles were lackluster.\n\nI have lost another 2 hours of my life. Thank you."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tfhfsk",
        "review_rating": "8",
        "review_title": "Akki as Prithvi",
        "review_detailed_main": "Looks epic and majestic; I've seen it once and want to see it again.this is a great day application I am very much for your support the most important thing I am so I am very much."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "imfarhanalvi",
        "review_rating": "1",
        "review_title": "Successfully done the mother sister of History",
        "review_detailed_main": "This is what writer and director of this movie has done with this movie. Changed the history, fabricated several things, just to revive the history of prithviraj.. Acting was so so... direction was awful, story telling was below par.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vaanirai-08636",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "Very good movie......... Portraying any such person takes a whole lot of energy and effort. Hats off Akshay sir....... The trailer and then the movie great job by the team of Prithviraj."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "CULT_CRITIC_REVIEW_AGGREGATOR",
        "review_rating": "7",
        "review_title": "Nt bad",
        "review_detailed_main": "The acting is a mixed bag. Manav Vij disappoints big time as Sultan Ghori. He appears wooden in most scenes. Sanjay Dutt as Kaka Kanha, is strictly okey dokey. Sonu Sood does better as the Raso author and Prithviraj's right hand man Chand Vardai. Ashutosh Rana is woefully wasted. As for Akshay Kumar, he is neither too great nor too awful in the titular role."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shahid-s-khan0071",
        "review_rating": "1",
        "review_title": "Wrong historical events shows",
        "review_detailed_main": "Ghori was killed by an assassin not by prithiviraj chauhan and ghori took him to ajmer to make him rule again ,where he saw something he shouldnt hv a killed him."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "cd-64554",
        "review_rating": "8",
        "review_title": "Akki as PrithviGreat Direction Love the VFX",
        "review_detailed_main": "With the release of Prithviraj Chauhan, bollywood is back. Akki as Prithvi Great Direction Love the VFX I really like this movie is a great movie is..... love this."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shekharsharma-13666",
        "review_rating": "6",
        "review_title": "Just avoid",
        "review_detailed_main": "This movie dosent belong to Akshay Kumar , the story need to be handle by a much more versitle story teller like Rajamouli only they can justify the story in a glory form , Akshay is not at all a king material , he should have avoid it by himself , he makes it more funnier then it is . Style of sitting , walking , speaking , nothing looks grand or superior . They just make it a fools movie ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jilanikagdi",
        "review_rating": "3",
        "review_title": "Not much interesting",
        "review_detailed_main": "It was fun to watch but It did not impress that much I think i waste my money popcorn time pizza burgers everything.\n\nAkshay should make only comedy movies these King type movies suits on king like personality of actors Total waste."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "reviewthemovies",
        "review_rating": "2",
        "review_title": "It's not a historical movie",
        "review_detailed_main": "A weak movie with pathetic acting. Akshay has become intolerable.\n\nIt is not a historical drama. The movie has just twisted facts & lies.\n\nAvoid, but if you wish to see then see it just as a drama and not as a historical movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "matrimonyid",
        "review_rating": "1",
        "review_title": "DIsgrace",
        "review_detailed_main": "Saw the movie on OTT. Totally underwhelming performance by Canada Kumar. After 30 years if he still cant act then WTF. Its like he is on auto pilot mode and speaking dialogues. Dint look like a king in even 1 scene. Only in few scenes Sonu Sood could create some emotions\n\nand what twisted story and lies shown in this movie which was not from RASO poem which made it a fiction\n\nAnd why queen will dance before Johar???\n\nGutka king Akshay Kumar is a disgrace to great Prithvi Raj Chauhan. He is worst human being in bullywood.\n\n."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sanchithakur",
        "review_rating": "10",
        "review_title": "Mind Blowing",
        "review_detailed_main": "It is the most opulent account of the Samrat's lifestyles ........ Great Acting done by All Actors....... Sonu Sood's portrayal of Chand Barai . Amazing work by him."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dandyy11",
        "review_rating": "1",
        "review_title": "What was it ?",
        "review_detailed_main": "I mean seriously, is this actually a movie or a collection of some irrelevant, tedious acting youtube shorts. Massively disappointed to be honest. Lets give a chance to new and upcoming gen of actors instead of old grandpas. I mean KGF stood out by all means and the best Indian movie in my opinion recently."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "chanudas",
        "review_rating": "8",
        "review_title": "Story of a Great King Akshay rocks",
        "review_detailed_main": "The film looks fantastic; yrf productions did an excellent job. Story of a Great King Akshay rock's this movie is a very good movie and l love this..... good."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ptwtpbc",
        "review_rating": "6",
        "review_title": "Poorly executed epic saga",
        "review_detailed_main": "When you think of historical movies you think of movies like bahubali or padmavat or even bajirao mastani or jodha akbar. But this was very far from those epic movies. Pathetic direction and screenplay ruined a story that needs to be celebrated on even a bigger scale. The movie felt really rushed, lacked moments of highs and the background music was below par. In a movie that should provide you a gush of adrenaline ends up really dull. Very disappointed on how bollywood treated our great kings story. Any average director from the south would have made it 10 times better!!!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rshekhar-58959",
        "review_rating": "1",
        "review_title": "What a waste of time, money and story",
        "review_detailed_main": "Another C grade movie from the most overrated actor in Bollywood. Unnecessary cliches with extreme masala is not even the main problem with this movie, it's the ridiculous acting by overAkshay actingKumar! It feels like a middle schooler performing his first role in a school play. His horrible dialogue delivery along with absence of any acting skills makes the movie feel like a torture to sit through. Don't waste your time and money!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anayakhan-76544",
        "review_rating": "10",
        "review_title": "Heart touching",
        "review_detailed_main": "The potrayal of akshay kumar is visible in trailer have made me keen to look at this movie. This is very amazing movie I have ever watched thank you for making such good movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "viralstatus-22786",
        "review_rating": "",
        "review_title": "Samrat Prithviraj Victorious!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shahedshanto",
        "review_rating": "7",
        "review_title": "Only One Time Watchable Movie",
        "review_detailed_main": "The story and screenplay of the movie is good. There is no such thing as a boring scene. The movie goes nicely and ends. There are two to three scenes inside the movie which make the movie more beautiful. Specially climax scene. If it weren't for these three scenes, the movie would be a complete flop. Akshay Kumar's performance is very good. Even though he didn't look like a king, his performance was good. Heroin's performance is very bad. The acting and reaction of the heroine is very horrible. The performance of the others who performed is quite good. Specially Sonu Sood. Overall a must watch movie. Entertaining movie. Family movie. Movie action shows a war battle scene."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kanhaiyakumark",
        "review_rating": "1",
        "review_title": "Honestly one more worse movie I have watched from last week",
        "review_detailed_main": "I haven't write the review for bhool bhulaiya 2 that was just ok movie.. but this movie totally worse .. why we are loving south Indian movie cos they know how to make good movie but our bollywood forgot to make good movie.. tomorrow will go for vikram I heard that os good movie.. please stop make nonsense type of movie ..😡😡😡😡"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hemadas-80734",
        "review_rating": "1",
        "review_title": "Dont waste your money. Not recomended.",
        "review_detailed_main": "Kindly replace AK pan masala Ghuttka kumar & Sanjay Dutt, doesnt fit into the role, rest Actors ve done good job as per their character. Not worth watching."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bhatias-01138",
        "review_rating": "2",
        "review_title": "Terrible, shows got scrapped, nobody to watch",
        "review_detailed_main": "This has to be one of the most terrible movies ever.\n\nI don't see any reason why it would not have been made better. Seeing that the actors involved have done much better job in many of their previous movies.\n\nPrithviraj Chauhan is such a well know and popular story from Indian History. Even if they had taken the script from Amar Chitra Katha comics they would have done a better job.\n\nIn an attempt to rewrite history to suit politically popular narrative, they have messed up the movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rakibhusain",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "A warrior wife of a real warrior .Very nice and fantastic movie. I like it really best Prithviraj movie and the greatest actions guided for warriors. Thank for chandra prakash drivedi is the best story writer's."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sabir_alpha10",
        "review_rating": "1",
        "review_title": "Headache",
        "review_detailed_main": "Akshay or Bhatia, whatever his name is, is really looking like a joker in this epic movie. I don't know who is fool here, we the audience or the hero who is a clown saying that he is Prithviraj. Manushi chillar? Well, no acting, board face with no expression. She has a body and that's she won miss world. That's it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "advparitoshtrivedi",
        "review_rating": "10",
        "review_title": "YOU HAVE TO EXPERIENCE THIS IN THEATERS",
        "review_detailed_main": "The scale of the movie is enormous and action is fabulous. The movie is not absolutely flawless but it's powerpacked entertainer. The acting could have been better but direction fills the gap created by it . The costumes, the sets, the war sequences, everything seems so amazing and intresting that you will definitely enjoy it. And you can only enjoy it in the theatres . So go watch it with family and friends."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tripurari_rai",
        "review_rating": "6",
        "review_title": "Wish there were no songs and better background score",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "aliakbarhasmirofsanjani",
        "review_rating": "2",
        "review_title": "Weakest Period Drama Film",
        "review_detailed_main": ".#SamratPrithviraj is one of the WEAKEST period dramas I've seen. Emotional climax, everything else is mediocre as far as the screenplay is concerned. VFX, BGM, sets & other technical things are average. Akshay kumar totally misfit for this role. Waste of money."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vaibhavrain-28952",
        "review_rating": "10",
        "review_title": "Good jobs",
        "review_detailed_main": "I so wish like the trailer says ''may the reign of Prithviraj be everlasting'' was everlasting.very funny and warrior movie wonderful watch online best Prithviraj movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "aishwaryarajsingh-23850",
        "review_rating": "7",
        "review_title": "Thoda history aache Se paad lete YRF😂",
        "review_detailed_main": "If you want to watch just for entertainment then it's fine because in history something else is written and they have shown their own Prithvi raj Chauhan story hahahhahhahahahah."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "skh-shahbaz",
        "review_rating": "2",
        "review_title": "Worst movie for 2022 Samrat Priviraj is debacle",
        "review_detailed_main": "One line review .... ITS BIGGEST DISASTER 2022.\n\nAkshay shor this movie in 41days miss fit for the role which needs atleast 6 months of preparation\n\nManushi is flat face\n\nDirection is like TV serial\n\n300cr budget is wasted."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anishbhattar",
        "review_rating": "1",
        "review_title": "True Review",
        "review_detailed_main": "The whole concept of the movie was to disrespect the truth ... Movie is only the creativity of writer not based on the reality... The history is not what they are showing... The movie made by #yrf are the disastrous one."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jassiharry",
        "review_rating": "1",
        "review_title": "Not worth it",
        "review_detailed_main": "I watched this movie last night, I wish I wouldn't have watched it. It's not even close to any historic event. Primary reason is akshay kumar's moustache. It was so fake, he could have grown his own for couple of months. Rest all is too expensive and fake👎🏻"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shubhamkumar-03612",
        "review_rating": "10",
        "review_title": "Good job",
        "review_detailed_main": "It is the most magnificent account of the Samrat's life in my opinion bhut hi sandar movie hai samrat prithviraj movie i really like this ..........................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lets-07490",
        "review_rating": "1",
        "review_title": "Disappointing!",
        "review_detailed_main": "In 12th century in India, main language was sanskrit, hindi other languages such as marwari...,In this movie a lot of Urdu farsi, & Arabic words like - gustakhi, badzuban, hukam ishq, etc. In Rajput's era no Queen or Princess didn't the dance. Salam by prithviraj to mahammad ghori is not acceptable. Sanyogita look Bar bala more like a princess.\n\nThe valour, courage, war strategy of Rajput's were missing. Akshay kumar as prithviraj doesn't suit.. Kaka kanna, chavund were fabulous. Totally not to a good movie for historic purposes.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ksoumen-87135",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "Akshay Kumar never fails to entertain us .Awsome movie.actor actress are very nice.i am really full enjoyed.i prefer super.sister brother are waiting for This beautiful movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gunjangupta80",
        "review_rating": "7",
        "review_title": "Movie is fine. Could have been much better ...",
        "review_detailed_main": "Ignore all the negative comments. Movie is just about fine as a decent entertainer. Though given the personality and importance of prithvi raj chauhan, the movie does not do enough justice and a much better work is expected.\n\nBut as an entertainer the movie is not bad. It's a good family entertainer."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pratapdigvijay",
        "review_rating": "1",
        "review_title": "Wrong casting",
        "review_detailed_main": "Akshay Kumar sir dose not justified his role. I think the great king samrat prithiviraj role was given to Ranveer Singh. He will be better than Akshay Kumar sir for Samrat Prithviraj role. Sonu Sood sir was good as always, best of luck for debutant manushi chhillar. Overall wrong casting so I give one star."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rohitsingh-40367",
        "review_rating": "10",
        "review_title": "Outstanding.",
        "review_detailed_main": "A story within the story , fairytale of Samyukta and Prithviraj. Very very wonderful and very very outstanding movie. This movie really very amazing and awesome movie. Osm movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "SoumikBanerjee1996",
        "review_rating": "6",
        "review_title": "Not as bad as many people had suggested",
        "review_detailed_main": "I had no prior intentions whatsoever to take my time out and watch Samrat Prithviraj; cause, as a viewer, I do not fancy period dramas. Yet, my curiosity arose because of all the pessimistic stances surrounding the film. Discerning the barrage of unfavorable feedbacks, I began to wonder, \"what might have gone wrong here?\".\n\nThus, I decided to witness it for myself, and I must say I'm quite surprised. Yes, it's neither perfect nor a extraordinary presentation but it's certainly not dreadful either! I have seen much worse portrayals before. Compare to those abominations, it undoubtedly qualifies to be deemed as a serviceable affair at the very least.\n\nIt's got marvelous set designs, a great score, some considerable conversations; in no shape or form this could come off as a despicable affair. Now, some viewers may argue whether the casting of Akshay Kumar in the lead role was a misjudgment! Well, I agree there were much better options (bearing in mind the fact that Akshay Kumar is way too old to play the role of such a young emperor); but he did not do as terrible as some section of the audience and a handful of reviewers otherwise suggest.\n\nAs far as the verifying and validating all the historical preciseness is concerned; I humbly refrain myself from passing any statement. The sole reason being my clear lack of knowledge and expertise on the subject, hence, it would only seem fair If I keep my mouth shut in this specific aspect."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sonianish-05416",
        "review_rating": "1",
        "review_title": "Very slow and boring movie",
        "review_detailed_main": "Starting with akshay he look very tired and same acting like BALA..boring music and background sound..slow movie with boring screenplay.. Don't waste your time and money.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "debmalya-dgp",
        "review_rating": "1",
        "review_title": "BOYCOTT SAMRAT PRITHVIRAJ MOVIE",
        "review_detailed_main": "When you put entire BJP IT Cell for the promotion of your movie, you have realized that it's going to a super disaster. Probably Canadian Kumar didn't understand the difference between Kashmir Files and Prithviraj movie. He failed in applying the formula for his latest disaster because one formula doesn't work for every movie. And by the way the casting itself is the worst so nothing more to say."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sameerlodaya",
        "review_rating": "4",
        "review_title": "Missing Samrat's power",
        "review_detailed_main": "Sameer lodaya\n\nThe biggest problem with the movie is the powerful thump of the SAMRAT which was totally missing\n\nWhen it come to historic or war fiction movies we have seen big canvas like jodha Akbar padmavat Bahubali and many more so our exceptions becomes very high and it is very difficult to make a film above all this cults\n\nAkshay failed to deliver an extra ordinary performance and aggression of SAMRAT miss chhillar was not promising..Sonu Sood came out very well with his softness..the movie started with a powerful fight scene but then gradually became dull..technically there was no problem but prosthetics were pathetic specially Akshay with hurted eyes..not a single scene gave the effect or feel of SAMRAT..songs were totally boring and sad..till the end I was waiting for a power punch action or scene but i couldn't find it\n\nthe director is of old school daily soaps where betting on him for such a great venture was yashrajs biggest mistake\n\nBut of course it is not that bad in compare to box office results."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lalishataneja",
        "review_rating": "10",
        "review_title": "Interesting",
        "review_detailed_main": "So far in our testimonies Hindus have not were given there due this movie is our tribute to the exceptional Hindu Samrat Prithviraj Chauhan. This is very amazing and interesting movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "factscountdownofficial",
        "review_rating": "1",
        "review_title": "Distorted History",
        "review_detailed_main": "In the movie prithviraj killed Mohd Gori but in reality Md Gori killed Prithviraj in their second battle so the movie is filled with distorted facts and poor performance by all the star cast."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "cd-57711",
        "review_rating": "8",
        "review_title": "Great Direction Love the VFX Sher Aya Sher",
        "review_detailed_main": "Absolutely fantastic film and viewing experience. Har har Mahadev.exceeded all expectations by raising the bar so high...... love this movie.is a good movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "darshray-07630",
        "review_rating": "6",
        "review_title": "Hit one",
        "review_detailed_main": "This film is well directed and presented. The background score is amazing and energetic. Akshay Kumar, Sonu Sood, Sanjay Dutt, Manushi Chillar are the soul and whole of this film who has done par justice to their roles."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bilalkhanbk-14159",
        "review_rating": "2",
        "review_title": "Pathetic",
        "review_detailed_main": "No story, no acting, just a typical indian boring film with no intrest captured of audience.\n\nJust akshay kumar things. Who want to make money by doing these kinds of films for his political friends."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dibakarbasak-90968",
        "review_rating": "10",
        "review_title": "Superhit movie",
        "review_detailed_main": "Manav Vij is exceptional in the movie. You just can't take your eyes off him for a second, he is just so good......................................................................................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gulabchandro",
        "review_rating": "6",
        "review_title": "Good one",
        "review_detailed_main": "I can't stop watching scenes from this movie over and over again. The soundtrack is also absolutely stunning. It's definitely worth watching. Brilliant art by the director."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "chitralekhathakur-89269",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "Acting: 0/10 (Actors have just sleepwalked through)\n\nCinematography: 5/10\n\nEditing: 2/10 (Feels more like a daily soap than a period epic)\n\nSound Design: 4/10\n\nMusic: 1/10 (Very forgettable, hari har was good)\n\nStory/Narrative: 2/10 (This is by far the worst part, the movie feels long and boring at the same time the characters feel Underdeveloped and artificial)"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vineetbudhwar8",
        "review_rating": "1",
        "review_title": "I don't know that what the real movie",
        "review_detailed_main": "But I have seen Akshay Kumar showing the to bjp netas that's not good. Why is that is that way to sell the movie????? Making the uproach to Hinduism Thats not not not good man."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bhatmohsin-26849",
        "review_rating": "1",
        "review_title": "Fake History and Fraud",
        "review_detailed_main": "In reality Samrat Prithviraj died before Muhammad Ghori.. But in the movie Prithviraj kills Ghori..\n\nThese people are earning money by playing with Hindu's religious sentiments and beliefs.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "debdutgiri",
        "review_rating": "10",
        "review_title": "Fantastic story",
        "review_detailed_main": "The songs will be great. Great and superb movie . Acting are really superb. I fully happy. I am waiting for this nice movie. Superb acting.duperb and nice movie . I like it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anubhavrana-57945",
        "review_rating": "1",
        "review_title": "History has been distorted",
        "review_detailed_main": "This a misleading movie and twisted history..not truly based on prithviraj raso mahakavya ..twisted history...Rajput samrat prithviraj chauhan killed mohmmad ghori sitting on high throne...not on the horse riding ..twisted history by bollywood...disappointing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ashutoshsuri",
        "review_rating": "10",
        "review_title": "Har Har Mahadev",
        "review_detailed_main": "Jai Mahakal. Samrat Prithviraj Chauhan ji's character in movie is very well played by Akshay Kumar. The effects and itihas are perfectly blended. Har Har Mahadev!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mbilimoria-81437",
        "review_rating": "6",
        "review_title": "Good overall movie but lacks Character Building",
        "review_detailed_main": "Indian historical movies which are made recently is a great direction to truly educate people of India as history of India specially written history was destroyed by many invaders in 755 years. While making historical movies it's important to show depth of character and life story. I personally felt it lacked historical aspect on how he became Prithviraj and too much time was spent on love story.\n\nSamrat Prithviraj had very small life span, but during that life span he made great strides to be king of Delhi.\n\nFuture directors, advice to do in-depth research on your character and drive story by keeping character in center. Adding songs a lot of time takes away intensity of situations and characters."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rupyaaco",
        "review_rating": "1",
        "review_title": "An Insult for great leader",
        "review_detailed_main": "It is indeed an insult for Samrat Prithviraj by portraying Akshay Kumar as Great Prithviraj. This cheap actor is not at all suitable for this role. He spoilt everything in this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sunderkoirala",
        "review_rating": "10",
        "review_title": "Blockbuster on the way",
        "review_detailed_main": "Dr.chandu direction was great.# samratprithviraj .Akshay character. Watching 'Samrat Prithviraj' is an opportunity for Indians to celebrate the valour and experience the glorious retelling of the last Hindu King, Samrat Prithviraj Chauhan's life and daredevilry. Akshay Kumar plays the legendary warrior Prithviraj, who fought valiantly to protect India's freedom from Muhammad of Ghor..well made."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pmukhawala",
        "review_rating": "6",
        "review_title": "Love story is different than showed in serial. Somewhat historically incorrect",
        "review_detailed_main": "I had watched show \"Dharti ka veer yodha Prithviraj Chauhan\". In that serial prithvi and sanyogita were met at Koteshwar temple near Abu and they had a long love story.\n\nBut in this movie it is shown that Sanyogita never saw prithviraj before marriage.\n\nPrithviraj's childhood, education, finding treasures, love story nothing is shown. Only fight with Ghori is shown.\n\nMoreover, this movie is full of unnecessary songs which could have been replaced with Prithviraj's life history.\n\nSome points.\n\n1. As I had heard, Muhammad Ghori had begged to prithviraj for sparing his life and prithviraj had forgiven him, but instead in this movie it is shown that Muhammad ghori wanted death. This is completely wrong.\n\n2. As per my knowledge, Chandbardai did not have any power for seeing future events in advance. That is shown completely wrong.\n\n3. First war of Tarrain was done after Prithviraj's coronation on Delhi, but in movie it is shown that when First war with Ghori took place, prithviraj was king of only Ajmer state.\n\nSo historically speaking, I was expecting movie to be more historically correct."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "skib-18277",
        "review_rating": "1",
        "review_title": "Boring and you can spot fake acting",
        "review_detailed_main": "0% effort by akshay kumar. Look super fake, fake costume fake mustache. Story is super slow, maybe writer add some fake masala. Akshay kumar shame on you 0% effort just trying to make fast money."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "yuktacapricorn",
        "review_rating": "1",
        "review_title": "Terrible direction and acting",
        "review_detailed_main": "When the director says he doesn't know why the movie flopped, I wonder what he's missing. The movie was a terrible spoof of the history. Dialogues were written as if Samrath Prithvi Raj is a millenial. Both Akshay Kumar and Ms. Chillar were at their worst acting skills. Akshay Kumar seems to be confused if this was Housefull 4 or Samrath Prithvi Raj. Akshay Kumar continued with his \"Bala-ho-Bala\" personality.\n\nSo much fictionalization of history. This movie should have been banned. The entire team should apologise to India and the world for making this mockery of something so prestigious to us."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "AJ_5883",
        "review_rating": "1",
        "review_title": "Please, just one accurate..like one accurate historical movie please",
        "review_detailed_main": "This movie is an eye sore..right from the random songs to hitting every note from Hindutva to women's rights. What happened to good historical Indian movies? Shatranj ke Khiladi, Junoon..and so many others..why must we taint Indian history like this? This movie is absolutely terrible. Watch it if you must, but this is a Bollywood fest in the 11th century."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hsk-43216",
        "review_rating": "8",
        "review_title": "The Royal History of",
        "review_detailed_main": "Sonu Sood has played an exceptional part in the movie, his performance is very poised.this is a great day application I am very much for your support the most important."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anykingofisrael",
        "review_rating": "1",
        "review_title": "this film flops because of Akshay Kumar",
        "review_detailed_main": "I am not a fan of Prithviraj, but I think that giving Akshay Kumar the role of Prithviraj has become the cause of the destruction of the film. Had this role been given to Prabhas, Ranbir Singh or Shahid Kapoor, the film would have left a different impression and the role of Mohammad Ghori is also rubbish."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hironbasak",
        "review_rating": "9",
        "review_title": "Great",
        "review_detailed_main": "Damn, the Choreograohy and Cinematography has been absolutely brilliant. I personally like the movie and highly recommend you to watch it...go with your friends and family members.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhinavtmk",
        "review_rating": "7",
        "review_title": "STORY GOOD SCREENPLAY AVERAGE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "devangpandya-07675",
        "review_rating": "1",
        "review_title": "Akshay can't act",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "basupriyanka-58666",
        "review_rating": "10",
        "review_title": "Good job",
        "review_detailed_main": "Surely Priyhviraj wil be a block buster.i really like it. Great and superb movie. Actors are really acting nice. My parents are also waiting for this beautiful movie. Nice."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "aryandubey-21850",
        "review_rating": "6",
        "review_title": "True History 🔥🔥🔥",
        "review_detailed_main": "Akshay Kumar's performance was not that good but visuals direction screenplay and performance by other supporting characters were awesome. A true depiction of history. A must watch movie if you are a true hindu."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "deepak-33572",
        "review_rating": "1",
        "review_title": "When you make movies in 42 days",
        "review_detailed_main": "Worst expression as an actor portraying historical character. History in this movie is completely messed up just to please the Hindu audience. Funny action sequences , pathetic expression. Direction , screenplay are worse. Don't waste time and money. The ratings system is clearly manipulated by akshay kumar PR agents. I didn't get the option to mark 0/10 . Hence giving 1/10."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mywayisgr",
        "review_rating": "2",
        "review_title": "Stupid acting",
        "review_detailed_main": "Its so pathetic that a movie on a veer warrior was made with only single expression of Akshay kumar. No doubt how he completed shooting in 41 days this movie. He's dialogue delivery the way he look is just obnoxious,he didn't even look like him at all. Stupid movie. Just want to capitalise political ideology of India right now."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nimitarora-27059",
        "review_rating": "2",
        "review_title": "Bad casting",
        "review_detailed_main": "Akshay Kumar wasn't the right choice for the lead character. YRF should've cast some serious actor in his place. The CGI is below average. If you still haven't seen Bhool Bhulaiya 2, go for it instead of this one. Disappointed."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shkulasamaye",
        "review_rating": "10",
        "review_title": "Most beautiful songs",
        "review_detailed_main": "This movie has the best most beautiful soundtrack ever i've never liked every single song in an album/movie before. I literally get chills every time I listen to Hari Har and Makhmali song. This is The Best Historical Movie of Indian Cinema. Legendary performance by Akshay Kumar."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kalerdharminder",
        "review_rating": "1",
        "review_title": "Misleading and injustice to history.",
        "review_detailed_main": "This is nothing but a too much Bollywood movie, History is totally wrong and a total historical injustice to a such great person. Now I think Akshay Kumar is a just a politician no longer a actor."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bhumikapoor-55087",
        "review_rating": "10",
        "review_title": "Good job",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "honeydukkat",
        "review_rating": "6",
        "review_title": "warrior PrithvirajChauhan.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "keyyy-63578",
        "review_rating": "4",
        "review_title": "Waste of time",
        "review_detailed_main": "Don't watch this movie... Direction is very poor 1/5 Actress 0/5 poor acting with poor story line Akki is like okok 2-3/5 Don't go for this moive You can save your time by watching that clip on youtube which shows of prithviraj killing mughlss.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dhillorahul-41424",
        "review_rating": "10",
        "review_title": "What a story",
        "review_detailed_main": "You cannot afford to miss this movie . Please watch it as Bollywood is back on the track . I love this prithviraj movie. This movie have a great inspiration story."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "devigeeta-06630",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "muhammadshabbir-71875",
        "review_rating": "1",
        "review_title": "False history shown",
        "review_detailed_main": "I can't expect bollywood industry to depict imaginary history in the movie. Even though it is an epic, actors don't fit the characters. Plus writer has done a RSS kind of job in the movie. Seems biased with hindu rulers."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anieruddha-47558",
        "review_rating": "1",
        "review_title": "Need better movie with better research",
        "review_detailed_main": "I watch first 30-45 minutes & cant watch thereafter. Waiting hour for bus is less painful than watching this. This movie suppose to base on 12-18 years research. But when you watch, it feels someone search on internet for few minutes. Casting is horrible."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rakesh-aug",
        "review_rating": "1",
        "review_title": "Fiction not history",
        "review_detailed_main": "Pathetic performances including Sonu Sood. Totally fictional narrative not at all historically accurate.\n\nWhatever happened.\n\nNow watching #SamratPrithviraj. We are total 9 people in the hall. 3 are couples at corner seats. Hope the film turns out to be much better and next shows get better occupancy.\n\nNow watching #SamratPrithviraj. We are total 9 people in the hall. 3 are couples at corner seats. Hope the film turns out to be much better and next shows get better occupancy."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "loveyouji",
        "review_rating": "10",
        "review_title": "Emotional",
        "review_detailed_main": "A movie once in a lifetime nice movie good experience bhut hi fantastic movie hai wonderful amazing super great is the best i like samart Prithiviraj movie i love Appreciate osm wow i like."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bajaj-sahil",
        "review_rating": "1",
        "review_title": "Nothing new",
        "review_detailed_main": "It is no where near the grandeur that is displayed in Padmavat. From a historical account perspective it depicts more of the fictional and legendary account around Prithviraj rather than accepted history.\n\nPoorly researched on the depiction of warfare.\n\nLastly extremely poor on entertainment quotient as well. Pathetic dialogues, some were cheaper than a B grade film. Looks like someone had to make a movie else the budget would have lapsed and therefore they created this pathetic thing in rush."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nofoodnofarmer",
        "review_rating": "10",
        "review_title": "Inspiring",
        "review_detailed_main": "A movie with humour and emotionsThe historical genre in Hindi film industry has always been about romance with a bit of action and drama, except for Tanhaji: The Unsung Warri or, which was more of an action thriller."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "madanmarwah",
        "review_rating": "6",
        "review_title": "Sincere adaptation of portion of Indian history",
        "review_detailed_main": "Samrat Prithviraj was one of the most revered historical figures of Indian history and making a movie on the subject is no doubt a difficult task. Unfortunately in movie parlance the movie which has a successful run and which brings in profits is considered a good film. Conversely, as per this skewed logic, a commercial failure or a disaster is not considered a good film because it has been rejected by the audience. ( This movie reportedly had some cancelled shows due to no audience). Hence a poor quality movie having loads of masala entertainment gets the branding of a good film and vice versa. This is the background available in public domain against which this movie is getting reviewed by me. As I viewed the movie, I tried to find out the likely reasons for the audience rejecting the movie. One, the genre of the movie made it difficult for the director to make it a masala film. Two, given his present image, Akshay Kumar may not have been the best choice for the lead character. Three, the heroine Manushi Chhillar was new and her best may not have been good enough. Four, the dialogue and songs were naturally in chaste Hindi, and though they were excellent they may not have appealed to the average audiences who are used to escapist entertainment like RRR, KGF, Bhool Bulayya 2. In fact the last named movie which was running concurrently was the main competitor and was reported to have taken all the audiences away.\n\nDirector Chandra Prakash Dwivedi has not been able to give the narrative a smart pace though the movie itself was well made, had passable performances, the action was matching the storyline and technical qualities were reasonably good. However despite having similar characters and storyline, it definitely lacked the captivating atmosphere, enchanting music, exquisite choreography and forceful performances of a Sanjay Bhansali movie like Bajirao Mastani or Padmavat. Akshay Kumar, Sonu Sood and Sanjay Dutt just could not put up impactful performances needed. Sonu Sood was comparatively better."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ifanbhuiyan",
        "review_rating": "1",
        "review_title": "Too bad",
        "review_detailed_main": "After watching Akshay kumar's overacting and that fake mustache, I wasn't sure if I am watching rowdy rathor, laxmii or housefull 4 I mean aka Bala. Even on a serious moment I was laughing by looking at him. You can't act same in every movie.\n\nI have no idea why they choose Akshay Kumar in the first place.\n\nHorrible."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anadhasda",
        "review_rating": "8",
        "review_title": "India FABULOUS story",
        "review_detailed_main": "Akki is back to break and totally shatter all box office records.yrf productions did an excellent job.i this movie is a good side.i love this movie is a good."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rharshita-60096",
        "review_rating": "6",
        "review_title": "Good content",
        "review_detailed_main": "I strongly recommend this movie. Huge thumbs up for all the actors, director Dr. Chandraprakash Dwivedi. This movie gave me an insight in to Indian history, religion, customs, and tradition."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "yogeshmane-13080",
        "review_rating": "1",
        "review_title": "Why fail movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shounak9325",
        "review_rating": "3",
        "review_title": "Intolerably Bad",
        "review_detailed_main": "A queen dancing before jumping into fire, A King dancing while his men fights out the enemy, A royal poet singing while his king arrives in the arena of captivity. I dont know whether its historically authentic or not. But it's crap writing that's for sure."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "alanalapat",
        "review_rating": "2",
        "review_title": "Waste of time",
        "review_detailed_main": "Akshay is getting bad to worse acting...Sanjay same expression that is no expression like always...unnecessary songs ..same stereo type movie ..some time I felt like laughing seeing akshay acting seriously..he is pursuing same style acting in every role no change..Salam Sanjay all same acting from first movie to now.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "orionteam",
        "review_rating": "10",
        "review_title": "Very good film",
        "review_detailed_main": "I didn't know such a masterpiece can be made in such a short duration of time, the director really. Mast amazing film that will be perfect for everyone....."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "amkomr",
        "review_rating": "1",
        "review_title": "Tatti",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jj-90276",
        "review_rating": "10",
        "review_title": "Emotional.",
        "review_detailed_main": "In my opinion , schools should take students for such movies. This movie really lovable movie. Outstanding movie. Osm movie. This movie is cool. Best movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "MxS7HGS",
        "review_rating": "6",
        "review_title": "I didn't like it.",
        "review_detailed_main": "Samrat Prithviraj is an underwhelming, dreary historical drama that can only be compared to a substandard Sanjay Leela Bhansali production. The insipid grandeur, along with the insubstantial plot that it presents to peddle a convenient narrative about India's past, results in an extremely tedious experience. Despite the political overtones, Samrat Prithviraj comes across as a tepid and unremarkable period piece that fails to do justice to its source material or theme.\n\nThe filmmaker has spent 18 years researching and creating this documentary, but the passion for the subject is not visible on the screen. The events are depicted in such a monotonous manner that it's impossible to become emotionally invested in the story. Furthermore, not a single performance in the film is compelling enough to captivate the audience. The film simply rushes from one scene to the next, as if it's in a hurry to reach the conclusion.\n\nAkshay Kumar fails to impress in the major part. Despite his attempts to tone down his body language and Punjabi accent, he lacks the necessary gravity to portray the legendary emperor. His growls lack the bite of a lion, and he hardly resembles the youngster who became a Samrat in his twenties despite the airbrushing. The presence of seasoned supporting performers like Rajendra Gupta, Manoj Joshi, Lalit Tiwari, and Ashutosh Rana only highlights his inadequacies.\n\nThe film, to put it bluntly, never aims for anything close to the truth. It takes what works for its epic plot, distorts it to fit its requirements, and swerves around it until it's no longer required before moving on to the next piece of history it thinks is ripe for tampering with. While Samrat Prithviraj has a clearly stated goal, it's a film that deserves to be judged on its technical achievements.\n\nSamrat Prithviraj is a let-down when it comes to writing and characterizations. The screenplay is full of meaningless bombast, and the historical figures that inhabit it are cardboard cutouts who move and talk but have little impact. Manav Vij and Sonu Sood are the only performers who create a lasting impression, but they, too, are crippled by the film's empty shell."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "khanrock-85217",
        "review_rating": "1",
        "review_title": "Flop show",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "suryadevkumar-19735",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "A true rajput . Prithvi Raj Chauhan. It is not a movie but It is a story of great worrier of hindustan. In this movie has emotional , Avenger and action. Love and war. All of quality in one Move . Such a great movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gulshansonu-17197",
        "review_rating": "6",
        "review_title": "Average But Compulsory to Watch",
        "review_detailed_main": "The movie was average in every aspect. It is hard to digest that it's directed and written by Dr. Chandraprakash Sir, who have done serial like Chanakya and Ganga Upnishad.\n\nSamrat Prithviraj Chauhan is name which electrify our blood, but in movie we never had goosebumps in BGM, Dialogues. In whole movie it feels like they glorifying the role of Mohammad Gazni. The movie was set in the era, when we didn't had any Urdu touch in our language but the whole movie is full of urdu words from the mouth of Bharatiya.\n\nIn 1100-1200 year, womens was not suppressed as shown in movie, some thime it feels like they are trying to insult our culture.\n\nEven the facts which is available on Google as well is not told in movie. They had good cast but it feels like they are not doing justice with their role. Akshay Kumar is not even 0.1% in his role. Directed and producers failed to justify with story of Samrat Prithviraj Chauhan.\n\nIn the end, I would say that these types of movies should be made but with dedication."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sirrana",
        "review_rating": "2",
        "review_title": "Great",
        "review_detailed_main": "This is such a nice one and making me too happy about this one and the people are very excited and inspiring by this one and so exited one lovely one."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "yshinde",
        "review_rating": "2",
        "review_title": "Disgraceful",
        "review_detailed_main": "Full of Manipulation. False narrative and twisted history. Rajputs must be furious after watching this pathetic representation of their glorious history and their past kings and queens."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "zoyakhutheja",
        "review_rating": "1",
        "review_title": "Disaster",
        "review_detailed_main": "Omg i was so excited about this one,becoz I always like historical movies like padmavati, bajiroa mastani but ,first half startd with decent note,but screenplay of second half is totally ruined, and akki and manushi acting is just waste manushi tries hard but she in every expression looks avg also akki s dialog delivery is avg and not expression change on his face and he looks so bad not a samrat overall an avg movie with avg acting, I will give 1 out of 5,u can only watch one time."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "swarupdas-13797",
        "review_rating": "10",
        "review_title": "Loved it.",
        "review_detailed_main": "I have watched the trailer a hundred times , eagerly waiting for 3rd June. Really super and nice movie. Great emotional movie Really appreciate it. Nice movie, i am waiting for this movir."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mahirchalbaaz",
        "review_rating": "1",
        "review_title": "Bakwas Movie",
        "review_detailed_main": "Bala 2.0. Akshay Is Not Suiting in this role Creepy Slow Below Average Movie Spoilling The Image Of Prithviraj Chauhan Music is not good too Direction is average Story is also fictional."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anmoldepp",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Why can't we have such movies on regular basis . Amazing super great is the movie i like it most popular appreciate good movie samart Prithiviraj is the most popular in India movie awesome."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rs-91942",
        "review_rating": "6",
        "review_title": "Good",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "patanhi-49296",
        "review_rating": "1",
        "review_title": "Wrong History",
        "review_detailed_main": "Prithviraj Died in 1192 and Mohammad Ghori died in 15 March 1205.. The. How it's possible.in movie how can Akshay kill to ghori. Fake story Akshay spreading fake rumours. Acting was so dumb."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sajensaha",
        "review_rating": "9",
        "review_title": "Amazing concept",
        "review_detailed_main": "Akshay sir has done a terrific job, no one match his attitude and body language that he has portrayed as Samrat Prithviraj Chauhan. I enjoyed a lot the movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ry-85588",
        "review_rating": "6",
        "review_title": "Osm",
        "review_detailed_main": "Woooo! One of my fav movie of all time. Can't take my eyes off from Akshay Kumar playing Samrat Prithviraj. The movie is worth seeing. It is so heartwarming and brings tears to one's eyes. All songs are masterpriece."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "damnitkejru",
        "review_rating": "3",
        "review_title": "I know many people hate it for inaccurate history but ...",
        "review_detailed_main": "It also had poor performances by some terrible side actors including the lead actress. It feels like very less effort was put into the making of this film.\n\nI am a fan of Akshay kumar movies but this one was terrible. I had to stop watching it in the middle as it was getting on my nerves."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sekhsajahan-23980",
        "review_rating": "1",
        "review_title": "Waste of money 😞",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rajkamalvishal-31831",
        "review_rating": "1",
        "review_title": "Disappointing",
        "review_detailed_main": "A huge potential wasted. Haphazard screenplay. Characters not established at all. Samrat Prithviraj's aura is not shown at all. No childhood flashback establishing their background.\n\nAkshay Kumar was more in charachter during climax shots ONLY, rest he looked AK.\n\nMusic could have been much better.\n\nFight scenes were not executed well.\n\nPoor VFX... very poor VFX... we could identify 'pasted' faces during horse riding shots for AK and Sanjay Dutta.\n\nHoping to see grand story of SAMRAT PRITHVIRAJ... but left disappointed!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ganindita",
        "review_rating": "10",
        "review_title": "What a job",
        "review_detailed_main": "Akshay potrays really well when it comes to historic movies.i really appreciate this beautiful movie. Superb and nice movie. Great thriller movie. Eagerly waiting."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "harshvardhansep",
        "review_rating": "1",
        "review_title": "Seriously? Is this from yrf?",
        "review_detailed_main": "Akshay, manushi and sanjay have ruined the movie. This was the worst and poor casting have been done by director and producer. Boring screenplay and lazy writing makes you leave the movie after first 20 minutes."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bm-14450",
        "review_rating": "10",
        "review_title": "Interesting",
        "review_detailed_main": "Wonderful movie very nice A movie that has brought tears to my eyes .I really love it so much very fantastic and interesting Prithviraj movie. Watch it really amazing movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "stayawesum",
        "review_rating": "6",
        "review_title": "Typical Average Bollywood movie",
        "review_detailed_main": "Spoilers free, i want to talk about small things which people will not talk about and is not specific to this film\n\nWhenever there is a movie set in historic period or specific local areas, they should to hire local singers and lyricist, because the singer's voice has been cultured in that specific language or dialect, same goes with the lyricist's skill. Also im so disappointed that only few singers gets all the attention in our industry with very safe level and familiar kind of singing so sad, there need more new voices and very very good level of singing standards if not highest, one example aakhein Teri kitni haseen.\n\nAnd if our films can't do hardwork and create quality, interesting and original (on some good level) of dance and singing sequences, they should just skip them. Wheather it's those which doesn't add nothing to the story or those which does."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vinitajan",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Hopeless acting by Akshay , heroine no grandeur at all ... very poorest version of padmavaat ...nothing of Rajputs or of Prithvi raj the great king could be portrayed ..ashutosh and sakshi were good ..even the costumes were not upto the Mark..no emotions, wastage of time and money ..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nakhan-65515",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Nothing can beat the feeling of seeing Akshay Kumar on the big screen in a war epic, that is what the movie was, an epic. You can enjoy with your family and friends..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "agnihotrisanjay",
        "review_rating": "7",
        "review_title": "Good but few clarification required",
        "review_detailed_main": "Prithviraj Chauhan was blinded by Muhammad Shihabuddin Ghori in 1192 and then taken to Ghazni as a prisoner of war. He remained as a prisoner of war under the custady of Muhammad Shihabuddin Ghori's elder brother Muhammad Ghiyasuddin Ghori till his death in 1202.\n\nThe Ghori killed by Prithviraj Chauhan was this elder brother Muhammad Ghiyasuddin Ghori in 1202.\n\nThen the younger brother Muhammad Shihabuddeen Ghauri got declared as King and he (Muhammad Shihabuddeen Ghauri) died in 1206(from the book \"Akela Angrez\" page no 75). For more details reed the book \"Akela Angrez\". You can get it on amazon by searching the name \"Akela Angrez\"\n\nSanjay Agnihotri Novelist."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shekharrajputubs",
        "review_rating": "3",
        "review_title": "DULL ATTEMPT",
        "review_detailed_main": "The Movie is sub standard. Fails to ignite any emotion. Should have been titled \"Sultan of Afghan\". Works Md. Ghori's tale of winning his enemies, instead Samrat Prithviraj's epic saga. Lead actor unimpressive, writing and direction extremely poor. Also absolutely third rate war scenes. 3 stars - 1 director of photography, 1 for Sonu Sood and 1 for the horses. Blunder movie of the year."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hussainmerchant",
        "review_rating": "1",
        "review_title": "Flop movie",
        "review_detailed_main": "Akshay is doing all stupid roles and movies. He is just behind money and making big mistakes....downfall is not far....the more he jumps the harder he will fall. Flop actor."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "arjun-tkalathil",
        "review_rating": "3",
        "review_title": "Not upto the mark",
        "review_detailed_main": "Lagging movie, songs are also not up to the level. No interesting scenes too. A mix of many historical movies. Simply known as \"Copy Paste\"!!! Not reccommended. Very dissapointing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bauridilruba",
        "review_rating": "10",
        "review_title": "Fantastic story",
        "review_detailed_main": "Upto the mark trailer and movie.we watch this movie with my parents.they were very happy and emotional .Really more and more interesting movies.nice nice amazing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kulkeshkumar",
        "review_rating": "4",
        "review_title": "Ruined the legendry story of Samrat Prithviraj",
        "review_detailed_main": "Poor hero, poor director, they have spoiled legendry story of our hero. These directors should not be allowed to touch the story if they cannot do justice."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "patelkuamr",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Huge fan of Akshay Sir, but Manav Vij deserves a special mention for the type of performance that he has delivered..........................................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ajay0616-446-644641",
        "review_rating": "7",
        "review_title": "Please get out of Hinduism and politics.",
        "review_detailed_main": "The movie, characters and the acting was good. But the sentiment is false, Mr. Akshay Kumar, How is history changed? By depicting itself/being a puppet? Or long education for the same thing. Try and answer yourself, I am putting stress on this, but dear history will never change. It's good that you are making movies on social cause, but with history?, That also every scene with religion. Haath Jude hain bhai, \"Kuch to sharam kar\"!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ankitchauhan205",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "I even don't want to give this movie a single star if I have that option. The worst movie I have ever seen. Bhai ek baar biography to padh lete prithvi raj chauhan ki movie bnane se pehle,kuch bhi bna liya..Na hi story real h ..movie m har ek ki acting ghatiya..kisi b role tak nhi jam rha..faltu k gaane...gandi si acting..galat story ..i suggest you all not to waste your 3 hours for this disgusting movie.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "chirag-63173",
        "review_rating": "10",
        "review_title": "Great",
        "review_detailed_main": "Kudos to the entire team of Samrat Prithviraj. This is one of the best movie. I like this osmand awesome movie. Best movie. I love this wonderful movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sharmaabhishek58",
        "review_rating": "7",
        "review_title": "Need to make more movies like this",
        "review_detailed_main": "The problem with peoples is that they are addicted to watch Bravery of Mughals only . It's will take time to digest movies like Prithvi raj , hero's of there own land . Shame on you peoples . I read comments they are giving 1 star . I am giving 7/ 10 . Good direction and writing . Why ruling party are coming in front of peoples to watch these kind of movies because gundas of Bollywood trying to flop movies like this ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rana0172",
        "review_rating": "1",
        "review_title": "What???????",
        "review_detailed_main": "What is happening with Bollywood??? This was unwatchable. Actress is bad looking and cannot act. Over usage of cgi. Facts are out of the water. Oh dear god."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "majedjasim",
        "review_rating": "1",
        "review_title": "What a shame",
        "review_detailed_main": "First of all they should read the history has said they have researched for 18 years seriously what a waste of time and effort akshay kumar doesn't seems to be interested at all he got his money whereas other actors did the work okk but overall boring and waste of time better to watch on OTT."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Dhaval_Forever",
        "review_rating": "1",
        "review_title": "Samrat Prithviraj",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vivek-09434",
        "review_rating": "10",
        "review_title": "Inspiring.",
        "review_detailed_main": "Booked my tickets for Saturday again , can't get rid of Akshay's acting . This movie really gives us great inspiration. I like this prithviraj movie. Best acting in this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Feel-the-truth",
        "review_rating": "1",
        "review_title": "SAMRAT?????",
        "review_detailed_main": "Another propaganda movie paid for by the Indian state. On the actual politicians came out during its promotion, never seen politicians do this ever.\n\nOne word sums up the movie..RUBBISH."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pwvvfdsm",
        "review_rating": "10",
        "review_title": "Great movie!!",
        "review_detailed_main": "Great movie, well-made film, unnecessary hate toward the film. If this film was made in the south, people would have declared this film epic and masterpiece. Audiences in India usually Don't watch a good movie then complains that Bollywood doesn't make a good film."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kritiakansha",
        "review_rating": "6",
        "review_title": "Movie too good",
        "review_detailed_main": "I am speechless and my mind is blown by the sheer amount of hard work and pure art, shown in each and every frame of the movie. 'EXCELLENT' work by all cast and crew, in each and every department, whether it's direction, story, screenplay, dialogues, acting, bgm, songs, costumes, or cinematography. A must watch for once."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gourank",
        "review_rating": "1",
        "review_title": "worst movie",
        "review_detailed_main": "Even after 12 year prepration finnaly diractor fond the \"mehman-khana\".\n\nWar was not justified.\n\nThere is a long debate about how smarat prithviraj died but yet they presented Bollywood story around it.\n\nFact- \"S. Prithviraj was 12-13 year old when he became the ruler. Died around 25-26. Who played role AK about 55 year old.\""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "babusimgh",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Yashraj film.never fail to entertain us. And very good and very nice movie Akshay acting is really great i loved this movie. And also the role of the prithvi raj chauhan ws great guys you all should see this film."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "prabhatranjan-37225",
        "review_rating": "6",
        "review_title": "Far away from periodic movies",
        "review_detailed_main": "This movie cleared the first war of tarain in few moments as if Ghori was nothing. No proper war has been seen in the movie. No effects coming out. Proper picturisation is absent , .\n\nStill the acting is good specially akashay looked good . Best is sonu sood, amazing. The film will keep you entertaining."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rkpraz",
        "review_rating": "1",
        "review_title": "Superb boring",
        "review_detailed_main": "Superb boring, stupid music, sanjay dutta singing so irritating. Could been better, direction is too boring type. Look at bahubali, cant even blink the eye. But this one, my eyes keeps wana shut. And the acting .omg, look like they are reading script, no feeling when saying the words. And the actress she needs to work a lot. Only thing good is the quality of the camera , and some vfx."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lokishortscreations",
        "review_rating": "1",
        "review_title": "Only over acting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shaikhaaves",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "If u don't wanna die by watching miserable acting... Then stay away from this movie.\n\nInstead of this watch pogo on tv.\n\nOr sit at home.. Don't waste ur hard earned movie on bootlicker."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rajibdippal",
        "review_rating": "8",
        "review_title": "Mindblowing Characters Played Story of a Great King",
        "review_detailed_main": "Sonu Sood's acting is just excellent, his dialogue delivery gives goosbumps, Real actor and real hero. Mindblowing Characters Played Story of a Great. Love this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dabasonline",
        "review_rating": "1",
        "review_title": "Rating is ZERO, plz allow",
        "review_detailed_main": "Such an epic story wasted, dialogue department brought down the big ship slowly slowly to OTT platform. Seems like they wanted to make it a comedy movie in many dialogue deliveries. Actress dialogue before turning to satti sounded more like she will lead the ladies unit to battle rather than a tradition of those days, really bad treatment of such a great story."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sdnbafb",
        "review_rating": "8",
        "review_title": "Great love story The Royal History of India",
        "review_detailed_main": "Samrat Prithviraj is filled with dialogues that wake up the hidden patriotic in you. One such dialogue is where Akshay asks his soldiers what do they want, (."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rkrrkr",
        "review_rating": "1",
        "review_title": "Historically inaccurate",
        "review_detailed_main": "Historically inaccurate. As expected from Indians . Created their own history by changing the history. 18 years research. Lol . Wasted my valuable time by watching it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rp-55287",
        "review_rating": "8",
        "review_title": "Great love story The Royal History of India",
        "review_detailed_main": "And there is this scene where he asks Sanyogita what Samrat Prithviraj Chauhan means to her, after which she delivers these beautiful lines that stuck to me. Hats off to the dialogue writer of the film."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tprateek-39399",
        "review_rating": "7",
        "review_title": "One time watch with few good, few bad scenes",
        "review_detailed_main": "Movie started well, one of those who have 'the openeing sequences' but I felt lost & uninterested in later half of the movie due to poor direction. Few very good scenes and few very bad, lion sequences & 1st war scenes were exceptionally good. Apart from Akshay, Sanjay (and 1-2 more) rest of the cast felt disconnected. Overall good attempt for historical movie, could have been better though. Good to watch once with family."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "makewithskyhigh",
        "review_rating": "1",
        "review_title": "Jhoothi Kahani",
        "review_detailed_main": "Prathviraj Chauhan died in 1192 And Md Gori died in 1206 But in Akshay Kumar movie Prathviraj Chauhan killed Gori.\n\nHow . . .\n\nPrathviraj Chauhan died in 1192 And Md Gori died in 1206 But in Akshay Kumar movie Prathviraj Chauhan killed Gori.\n\nHow . . ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "farhanzaid",
        "review_rating": "1",
        "review_title": "I wish I can give a 0 rating for this film",
        "review_detailed_main": "It's a insult to our great Samrat prithviraj ji. Totally unfit for the role akki looks like joker. Who does comedy roles better, we can't see a joker as prithviraj Maharaj... Totally disappointed for wasting money and time."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "happyswiss-96947",
        "review_rating": "1",
        "review_title": "utter garbage",
        "review_detailed_main": "Like the main actor, the whole movie is utter garbage. No need to waste your time and money.\n\nThe whole historic data is wrong. We have never learned such fake history in the school. It's an insult for all Indian history."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "msk-92057",
        "review_rating": "8",
        "review_title": "Great Direction",
        "review_detailed_main": "Yet to witness a masterclass on the same level as Prithviraj, just makes you hyped and buzzing overall.this is a great day application I am very much for your support the most important thing is."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ravijain-01185",
        "review_rating": "4",
        "review_title": "Only Partial history",
        "review_detailed_main": "Was it only the battle with Mohammed Gauri that Samrat Prithviraj Chauhan had fought? Is there no other glory of Samrat Prithviraj Chauhan?\n\nFilmmaker has missed a lot to be shown... Not done their homework properly... Akshay is not suitable for this role... Sanjay Dutt and Sonu Sood did justice to their roles.. Direction is ok, but Script lags behind a lot.... There could be many more in the movie from the Glorious life of Samrat Prithviraj Chauhan..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "varun-01214",
        "review_rating": "10",
        "review_title": "Thrilling",
        "review_detailed_main": "Akshay Kumar , Sanjay Dutt , Sonu Sood , Manav Vij lovely work done by all of them. This movie is really great inspiration to everyone. I like this wonderful movie very very much."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "prakharjssmech",
        "review_rating": "7",
        "review_title": "Grand, bold and honest attempt of a brilliant, proven director",
        "review_detailed_main": "The movie is a very bold attempt by Dr. Chandraprakash Dwivedi & Yashraj Films. I admit that the choice of Akshay Kumar as the great Prithviraj Chauhan might have been out of necessity.\n\nBut the remaining cast, background music, grand sets, screenplay & direction, amazing war sequences are the highlights of the movie. Even Akshay has done better than his average movies, for which I think the credit goes to Dr. Dwivedi again. The director has ensured the best comes out of an experienced actor in a periodic & historical drama, whose forte is otherwise majorly action and comedy. Sanjay Dutt, Ashutosh Rana, Sonu Sood, Manav Vij, and other supporting actors shine in their roles, as usual. They are all talent powerhouses, proven time and again, & do justice to their roles. The debutant Manushi has actually surprised me, I was not expecting a mature performance from a newcomer to the industry. The supporting cast has done great as well.\n\nThe dialogues,, again from the director, are lovely.\n\nThe only area of improvement was the songs: everything from the lyrics, to music and the length of songs hampers the pace of the movie.\n\nShankar, Ehsaan and Loy surprisingly disappointed with the music department this time.\n\nLyrics are sub-standard. Varun Grover is not a seasoned lyricist. He has had success only on a few occasions and needs to do much, kuch better.\n\nThe music, songs and lyrics could have been immensely impactful, but fail to deliver.\n\nThe only standout song is the title song, and truly sets the tone of the movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "fayub-63511",
        "review_rating": "1",
        "review_title": "Wastage of Time",
        "review_detailed_main": "Why producer and Writer change the History and show the wrong Picture. I just feel wastage of Time after washing the movie in Cenima. Please remove this movie from Bollywood History."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ssibu-92147",
        "review_rating": "10",
        "review_title": "Great concept",
        "review_detailed_main": "It is the most opulent account of the Samrat's lifestyles . Samrat movie have great concept I am really happy by watching this movie you should also watch this wonderful and amazing movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dhurvisharma",
        "review_rating": "6",
        "review_title": "Good one",
        "review_detailed_main": "Performance by the cast is sure to blow your mind. Few minor flaws you can overlook for a movie like this. The Climax is sure to give you goosebumps and make you proud."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rk-56867",
        "review_rating": "1",
        "review_title": "Fake history",
        "review_detailed_main": "Samrat prithiviraj died before mohammad ghori.. In India to defame Muslims everything is possible.. It's distortion of history definitely.\n\nI recommend you not to watch the movie.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mdumair-94731",
        "review_rating": "1",
        "review_title": "Fake contant",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "akasharma-02257",
        "review_rating": "1",
        "review_title": "He put his all the effort in mandir and masjid not in movie",
        "review_detailed_main": "He this the good time to play mandir masjid card and can make his flop movie hit.\n\nLots of respect for worrier but aksah kumar is not right person for this role.\n\nHe should be in politics and play hindu Muslims card.\n\nVery bad movie, don't waste your time and money."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tekamakshay",
        "review_rating": "10",
        "review_title": "Absolutely masterpiece",
        "review_detailed_main": "What a wonderful film this is I must say. From art design to casting everything is on point. Runtime is also not very lengthy and that's good thing. This gives hope to bollywood cinema to jump back again and show it's calibre. Akshay's performance is best till date."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "fslrxa",
        "review_rating": "1",
        "review_title": "What a joke!",
        "review_detailed_main": "First and foremost, the plot is untrue. They claim to have spent 18 years researching for this film. Bull***t! They believe a poem written by a mad courtier of a ruler, despite the fact that renowned historians disagree with the account.\n\nSecond, Akshay Kumar as Prithviraj is a shame. When you're playing a ruler with a storied past, you have to be able to play that critical role, and our Khiladi Kumar falls flat on his face."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rinku-11703",
        "review_rating": "10",
        "review_title": "Loved it.",
        "review_detailed_main": "Akshay Kumar superb acting skills, he nailed it. I really like this movie. One of the best movie. You should also watch this best movie. Amazing and awesome movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "karanluthra-64462",
        "review_rating": "6",
        "review_title": "Amazing movie",
        "review_detailed_main": "Climax of movie is very powerful, too emotional and will be worth every penny you spent to watch it in theatre. So friends don't miss it and do watch it in cinemas near you."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "amitgidh",
        "review_rating": "1",
        "review_title": "One of the worst historical fiction ever!!!",
        "review_detailed_main": "This movie shows Akshay Kumar in his most 'stoned' form. Apart from that this movie is a work of fiction and not 'history'. Extremely disappointed to see such third rated work from a genius like Dr Chandraprakash Dwivedi. Please avoid watching this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "paurbadas",
        "review_rating": "8",
        "review_title": "Great Direction Love the VFX",
        "review_detailed_main": "This movie has it all. Samrat Prithviraj - 100% When I first watched the Prithviraj trailerm I was blown away, but I was sceptical.i love this movie is a great."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "raihanakib-65674",
        "review_rating": "1",
        "review_title": "Flop",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "faizalkemail",
        "review_rating": "1",
        "review_title": "This movie might satisfy some hardcore HINDUS",
        "review_detailed_main": "If you are a hardcore Hindu, This movie might satisfy you; but if you are not don't waste your time or money.\n\nThis movie is made for hardcore kattar Hindus.. this is the place they wage war with the medieval Muslims and win the wars but in reality they lost the war."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dalbirbeniwal",
        "review_rating": "1",
        "review_title": "Directionless movie",
        "review_detailed_main": "This movie is totally directionless movie Akshay kumar is only actor who can complete movie in 40 day other wise this movie is masterpiece if this directed by ss rajmauli sir Actor should be from south not from Bollywood bollywood actors always trying to overacting ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "oo-38891",
        "review_rating": "10",
        "review_title": "Excited",
        "review_detailed_main": "We should support such historic movies. I give 10 star this movie because it is able to get 10 star. I am very happy after watching this movie. Amazing and awesome movie prithviraj."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jkg-25225",
        "review_rating": "1",
        "review_title": "Laughable acting by Akshay Kumar",
        "review_detailed_main": "The guy has 31 years of experience in the industry and still has not learner the ABCD of acting. Keep boring the audience with same expressions and same style year after year. Sanghis are giving fake rating to the movie. It's far worse than ever an average historical movie. Akshay is acting like Akshay Kumar not Prithviraj Chauhan."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "andysandylau",
        "review_rating": "9",
        "review_title": "Samrat Prithviraj very impressive.",
        "review_detailed_main": "Very nice!!!! Hats off!!!! The storyline is very persuasive to the Indian audience. Dr Chandraprakash Dwivedi really knew the right stars to cast in his films. Akshay's performance is absolutely mindblowing. I have never seen him act the way he has acted in this film, he's very impressive."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "virajraaj",
        "review_rating": "6",
        "review_title": "Superb",
        "review_detailed_main": "This movie is truly based on history. What a tremendous movie. For me this is the best movie. The great samrat Prithviraj Chauhan. Background music and all songs are the best. Akshay has gain proved that he can do different roles. Can't believe it is Manushi first movie. She looks amazing. Great direction by Dr. Chandraprakash Dwivedi."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "amarahuja-73573",
        "review_rating": "1",
        "review_title": "couldn't give half a star",
        "review_detailed_main": "Waste of your time and money and worst casting too.songs and music is bad too direction is bad music bad casting bad.\n\nCant find more words to describe and yes writing this while in a movie theatre but lost any interest to watch it any longer.\n\nHence spending time here giving review for the first time ever."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "prabhatbauri",
        "review_rating": "8",
        "review_title": "Love theAkki as Prithvi Great Direction Love the",
        "review_detailed_main": "What a big screen spectacle, Akshay Kumar's performance and the set design are the drawing factors for audiences towards the film. Will have to wait and see how well it does at the box office!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "thegamegkht",
        "review_rating": "6",
        "review_title": "Deserved Much Better!!",
        "review_detailed_main": "I found the film not up to the mark while comparing with other historical movies.\n\nCinematography is top notch and production wise everything is grand.\n\nBut despite having power packed performance from the cast, the movie tanked at box office?\n\nI don't know about the historical inaccuracy because historians themselves are not sure prithviraj killed ghori after taken as prisoner of war or after 2nd battle of tarain prithviraj was executed by ghori!!\n\nPlot was really good but screenplay is rather dull in comparison because you are showing the same scene twice in movie!!\n\nAkshay kumar's expression during war scenes are hilarious and he should have grown a real moustache!!\n\nBut as far as the direction goes,there is no doubt chandraprakash dwivedi is a nuanced filmmaker but he should have done some more work on the development of the characters and wrote the script after taking into account the actual history,not just by reading the poem written by chand bardai as the poem might have been altered over the course of time."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ahsanjamal-67787",
        "review_rating": "1",
        "review_title": "Poor Acting.... wrong casting.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "cyberwebcomputer",
        "review_rating": "1",
        "review_title": "Very boring",
        "review_detailed_main": "Historical Movie completed only in 42 days. What can u expect 42 days historical movie. Akki face like comedy face no emotions no look like any king. Rubbish movie . Only poltics can be hit this movie. Otherwise no any reason to watch. Completely boring."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hd-26906",
        "review_rating": "1",
        "review_title": "Bad acting ans Casting. It's like watching Houseful 4 again.",
        "review_detailed_main": "You cannot cast a comedy movie star to do serious movie role off course it will ruin the movie. All the good reviews is here are fake so don't waste your money to watch this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sd-90339",
        "review_rating": "8",
        "review_title": "Great Direction Love the VFX Sher Aya Sher",
        "review_detailed_main": "Hats off to the entire team of Prithviraj. The scale looks great and the movie is amazing..... Great Direction Love the VFX Sher Aya Sher.i love this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "habbansayyed",
        "review_rating": "1",
        "review_title": "Jealousy movie 😂😂",
        "review_detailed_main": "In this movie, Muslim has been described as a cheater. Wrong history has been told about him please don't watch this movie Because of this movie people will start hating each other."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bnandita-08354",
        "review_rating": "10",
        "review_title": "Wonderful movie",
        "review_detailed_main": "Sonu Sood just keeps getting better and better with every film and with this one he has raised the bar so high.................................................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "msahu-15750",
        "review_rating": "1",
        "review_title": "So bad",
        "review_detailed_main": "Akshay kumar is not suited in this movie, story bad, screenplay bad, songs bad, everything sucks.... Boring movie. Do not watch please,i just holding hands please do not watch.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "maghkfsnuf",
        "review_rating": "8",
        "review_title": "Amazing movie Great movie The Royal King Epic story of",
        "review_detailed_main": "What I loved most about Samrat Prithviraj was that the songs that were released by YRF as mere teasers before the film release - I could see them in all their glory.\n\nThere are several memorable scenes in Samrat Prithviraj."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "karanjain-33374",
        "review_rating": "3",
        "review_title": "HIGHLY DISAPPOINTED",
        "review_detailed_main": "3 stars rating just for someone tried to make a movie on The Great Samrat Pruthviraj (but failed miserably) Starting with storyline - incidents were changed according to director's and his team choice Dialogues - not even for a second i felt that I was watching a movie on person from Rajasthan.. Marwari is not all about \"KHAMMA GANNI\" Costumes - Rajasthan represents Royalty and Land of colors, both were missing.. in the first the female lead didn't even looked like she was someone from Rajasthan 1st part mistake - For marriage he and Chand had disguised themselves and later they take Raanisa with them and in the way while returning jaichand attacked them and many brave main fighters lost their life to protect Pruthvirajji but what did showed us?\n\nClimax - the most disappointing part, the whole had happened in Gauri's Darbar and not in arena and during that part Chand was right beside Samrat with dagger to kill each other and to not die by the hands of Mughals and other prisoners were killed by Mughals and their bodies never returned India\n\nBOLLYWOOD just know to glorify Mughals who destroyed our land but will brainwash the youth will fake stories of real heroes.\n\nBOLLYWOOD should just make movies like Student of the year, heropanti, golmaal 69 and so on.. they should be banned from making biopics on real legends, the real gems of India.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "zeeshanu-26187",
        "review_rating": "1",
        "review_title": "Big flop",
        "review_detailed_main": "Worse movie ever made in Indian history of cinema, all the hype with 10 stars, are by the BJP IT cell. Rest assured all the 1 stars are the genuine ratings."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tusha-38007",
        "review_rating": "2",
        "review_title": "Best Movie",
        "review_detailed_main": "Prithiviraj is the best movie, As we compare this movie with other bollywood movies love drama and romatic movies which makes our youth carrer in danger .But with movies likes prithviraj helps people to know more about our past ,also shows them how's our people and get to know about about our brave and powerfull rulers . We have to support movies like these .❤"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "apuswain",
        "review_rating": "10",
        "review_title": "Awesome movie Akshay acting is out standing",
        "review_detailed_main": "Awesome movie Akshay acting is out standing 🔥🔥🔥 . Sonu Sood is rocking Sanjay dutt is 🔥 BGM is awesome , Screen play good Last seen gomsboom Awesome movie must watch our youth."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "voodoodex-19167",
        "review_rating": "2",
        "review_title": "A rather lame attempy to make Historic figure into a mythical hero.",
        "review_detailed_main": "The character gets dull when only positives of a figure is captured, tells a lot about lazy writing. A human character given Oracle like power, A monarch with no grey area of thought, grandeur dance-song sequence, its the same formula based movie making. Overall this was a great opportunity wasted by a non-Indian actor."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "asheeshdausa",
        "review_rating": "10",
        "review_title": "Behatreen film",
        "review_detailed_main": "You will watch this movie 100 times superb acting and screenplay ...but muslims and seculars won't like this movie they will give bad reviews . So guys before giving review must watch movie first.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nitinkumar-89257",
        "review_rating": "1",
        "review_title": "Pathetic acting",
        "review_detailed_main": "Akshay kumars acting was pathetic . He was totally wrong choice for this role . It was boring . Only good was Manushi chill at. I wish they had taken ranveer Singh for this as he has already shown that he can deliver in such periodic movies .."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sarkarbx",
        "review_rating": "10",
        "review_title": "An outstanding epic movie",
        "review_detailed_main": "Loved every part of it. An outstanding Epic movie. Best historical movie of the Indian cinema. Akshay Kumar has nailed it. I really like enjoyed this movie so much. Very interesting movie in this year... So I highly recommend recommend to all. Very excellent history of Samrat Prithviraj Chauhan. This is an of the very fantastic and so nice movie in Bollywood.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rohsharma-67351",
        "review_rating": "1",
        "review_title": "Dont play with indian history",
        "review_detailed_main": "Dear bollywood Dont play with indian history Weak direction Weak dialouge Weak costume Prithviraj chauhan was greatest yodha of india But in this movie you will watch only dulhe raja."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tecmanyt",
        "review_rating": "1",
        "review_title": "Pathetic",
        "review_detailed_main": "I'm giving 1 star cause there's no option of 0 star. Dear akshay kumar stop fooling in the name of patriotism cause we all know you only work for money. And btw this movie was pathetic."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "saiyedshoeb",
        "review_rating": "1",
        "review_title": "Its not historical movie just fictional movie",
        "review_detailed_main": "Its not historical movie just fictional movie With worst acting of all time.\n\nIts not historical movie just fictional movie With worst acting of all time.\n\nIts not historical movie just fictional movie With worst acting of all time."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vpashish",
        "review_rating": "9",
        "review_title": "Beautifully crafted historical epic",
        "review_detailed_main": "One of the best movie offered by Bollywood in past few years. The casting, direction, music, war scenes, cinematography, dialogues, acting, historical sets etc all components just feel amazingly perfect. Theatre experience further uplifts the overall weight of the movie to spine chilling dimensions. Akshay Kumar and manushi chillar have given splended performances, especially Akshay Kumar. He really feels like real prithviraj chauhan. One of the most asthetically pleasing Bollywood creation. The grip in the first half is amazing. It slightly looses the momentum in the second half but eventually regains that during the climax. Worth your time for sure !!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pccspiyush",
        "review_rating": "1",
        "review_title": "Worst movie which showing fake history",
        "review_detailed_main": "Absolutely garbage. Nothing like history just a movie which showing false history.\n\nPrithviraj died in 1192 and mohd gauri died in 1206. Even mohd gauri fought one more war after 1192 . And it's chandawar war against jaichand in 1194."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sokorali",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "The trailer shows many stages of a man's life, and when it comes to the final Hindu ruler, Samrat Prithviraj, it'll be a must-see........... .............................mmm............."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "krishmanwani",
        "review_rating": "1",
        "review_title": "Worst historical movie",
        "review_detailed_main": "Worst acting by Akshay. Better to read book about Samrat Prithvi raj rather than watching this piece of s.... 55 years old man playing the role of king, biggest joke ever."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pj-65297",
        "review_rating": "10",
        "review_title": "Such a amazing movie",
        "review_detailed_main": "The film is well directed and presented , specially the end is too strong and gets the film win all over, Samrat Prithviraj. The lead cast took my breath away. The fact that Samrat Prithviraj Chauhan was the last Hindu ruler was fascinating since it is not a well known fact."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dinkr",
        "review_rating": "1",
        "review_title": "Bakwaas",
        "review_detailed_main": "Eak dum bakwaas movie there is no sense in the movie acting is too poor.akshay acting is not upto the mark.. stroy behind the movie is not genuine..............."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lordofolympus",
        "review_rating": "1",
        "review_title": "Based On fake story.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shahbulbulalamakash",
        "review_rating": "1",
        "review_title": "False History is Trending.",
        "review_detailed_main": "Films distorting history are currently being made in India. Akshay Kumar is the only hero of all these films. Mr. Canadian. History is being destroyed through Bollywood movies. The graphics of the movie are not good at all. There is no breath in the story. Bad acting and bad editing. But those who make Hindu militant organizations will like to see it. BJP is destroying Bollywood by bringing politics in movies. BJP is fooling entire India through movies. In a word, the movie is a horrible movie.\n\nI hope India and Bollywood will produce more beautiful movies in the future. Prithviraj died two years before Muhammad Ghuri's death. But here Akshay and BJP are laughing at what they have shown. Ha ha."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "johnking-75469",
        "review_rating": "10",
        "review_title": "Very nice movie",
        "review_detailed_main": "The visual effects are just legendary; they are so outstanding that you are completely engrossed in the experience....... it's really very amazing and so beautiful movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "prabhasraj-78396",
        "review_rating": "2",
        "review_title": "Great",
        "review_detailed_main": "This is to be a such a nice one and making to be such a great to all and making the people to great and having a such a nice one and to be a great one."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gjavjlgfbm",
        "review_rating": "8",
        "review_title": "Mindblowing Characters Played",
        "review_detailed_main": "One if them that I found unforgettable was the one about Sanyogita garlanding Prithviraj's statue - an act that not only signified the princess asserting her rights,"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "saifiazmi-81635",
        "review_rating": "1",
        "review_title": "False story..r.i.p Bollywood",
        "review_detailed_main": "Fake story and it will mis guided.. Waste of money. So boring film and there is no connection ,poor screen play, poor graphics, Bollywood need to learn from south Indian movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hdk-34688",
        "review_rating": "10",
        "review_title": "This movie is so beautiful",
        "review_detailed_main": "No one can stop our Samrat Prithviraj Chauhan from conquering and shattering all box office records now that it has blockbuster written all over it........ it's really very amazing and so beautiful movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sardartej",
        "review_rating": "1",
        "review_title": "Very bad movie",
        "review_detailed_main": "Movie has no new concept no story line and I really equipment to all of you just don't watch it because it's not worth it as I realise after watching this one..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "OnjiMooteDaMarle",
        "review_rating": "1",
        "review_title": "Akshay, the Writing & the music makes this film a painful experience",
        "review_detailed_main": "The film has good art, costumes & locations. Apart from that it's a dud. It doesn't say much about Prthviraj. It has just 3 things: Prthvi vs Ghazni, Prthvi marries Sanyogita, Prthvi vs Ghazni again. That's all. That makes nothing of the history of Prthviraj. The screenplay, the music, the acting all lack any interest. Akshay is so unworthy in his role. His acting was like that in 'Baby' or 'Airlift'. He lacked any aggression or facial expressions. I am so disappointed by Dr. Chandra Prakash Dwivedi. I am still in awe of Chanakya (the TV serial) but this is unforgiveable. He did better in that Housefull bald headed role as Bala (or something). I did love the weightage given to mantras all around the film but nothing else works here. Manav Vij as Mohd Ghazni & Ashutosh rana were quite ok. But they are not the ones who carry this film. I couldn't decide if I should laugh or cry at Manushi's climax scene. It was pathetic & over dramatic. Dwivedi apart from reading history should have (re)watched 'Jodha Akbar', 'Bajirao Mastani' & 'Padmavat' as a film. Look at the Afghans in Padmavat. Brilliant. Here Afghans are speaking hindi & Prthviraj uses urdu words. Shameful. This half baked story & a half hearted film doesn't deserve to be remembered let alone rated."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ergagan-89650",
        "review_rating": "1",
        "review_title": "Fake Facts",
        "review_detailed_main": "Canadian Kumar Destroying Indian History. Dnt know from where read these facts. O yea he got failed 3 times during his schooling may be because of that.... Pathetic Direction."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "wowaseo",
        "review_rating": "8",
        "review_title": "Sher Aya Sher",
        "review_detailed_main": "Sanjay Dutt and Sonu Sood really have done a fantastic job in their respective roles, they stand out.this is a great day application I am very much for your support the most."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tomartarun",
        "review_rating": "1",
        "review_title": "Biggest Blunder Completely waste of time to watch.",
        "review_detailed_main": "Serious movie name and COMIC ACTORS...have no knowledge how to act and perform. \"VIMAL kha ke BALA aya\". If you dont know how to make movie on such serious topic. BOLLYWOOD is best for copy paste and remake. At least they have all dialogues and screenplays to perform and make. Thats why they can make any movie in just 2 3 months."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nolasknsk",
        "review_rating": "8",
        "review_title": "Love the VFX",
        "review_detailed_main": "Nothing can beat the feeling of seeing Akshay Kumar on the big screen in a war epic, that is what the movie.this is a great day application I am very much for your support the most important."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bhambhuchetan",
        "review_rating": "3",
        "review_title": "Average Movie",
        "review_detailed_main": "The movie is found to be Hypothetical made without logic in Actions scene. The movie was Interesting in start of the movie but after some time it is found that the scenes does not match with the Reality and has dented the ambition and not upto the mark."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "agarwalmadam",
        "review_rating": "2",
        "review_title": "Lovely",
        "review_detailed_main": "This is to be a very very great and lovely one makes the people too happy about this and having such a great about the all and making a too great to see."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gauravu-226-744672",
        "review_rating": "1",
        "review_title": "Poor casting, poor acting and a bad movie",
        "review_detailed_main": "I will keep it short.\n\nAt times it felt as if I am watching a TV serial or a comedy movie. The movie doesn't feel grand when compared with Jodha Akbar, Padmavat or Bajirao Mastani.\n\nAkshay kumar turns out to be a really bad choice. Sonu and Manushi were good though. Sanjay dutt was decent enough."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rahulgoel-36543",
        "review_rating": "1",
        "review_title": "Typical Karachiwood aka Bollywood's product.",
        "review_detailed_main": "The movie has put down the genuine prestige of Maharaj Prithvi Raj Chauhan. Dialogues are delivered in typical Urdu film industry's (read Karachiwood aka Bollywood) native language i.e. Urdu, instead of pure Hindi. Akshay Kumar doesn't look like Maharaj Prithvi Raj Chauhan ji, from any angle. Screenplay is boring and completely downplayed the real epic. I hope someone recreate the saga to it's true and purest form in the future with a solid main lead who can come closer to Maharaj Prithvi Raj Chauhan's personality."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mobiplab",
        "review_rating": "10",
        "review_title": "Symbol of bravery and courage",
        "review_detailed_main": "Akshay's performance in this movie will be remembered for years to come.. He lived his character and makes us fall in love with it... Hats off.very happy good movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "imi_777",
        "review_rating": "5",
        "review_title": "Distorted history",
        "review_detailed_main": "Poor movie , akshay is romancing a 30 years young heroine . Most of the facts are also distorted . Pritvi raj died at age 25-26 where as it played by a close to 60 actor . Better to watch on tv with fast forward option handy !"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vasudevprajapati-15559",
        "review_rating": "5",
        "review_title": "Good but misleading",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "digitalanmol",
        "review_rating": "10",
        "review_title": "Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mavericktonystark",
        "review_rating": "1",
        "review_title": "Akshay spoiled yet another Hindu Warrior",
        "review_detailed_main": "This film has been made with so much HINDHUPHOBIA that you will feel why it has been made in the first place. Akshay never appears to be in the shoes of Samrat Prithviraj!!! Comes across as a novice, looks like there was no preparation for the transformation at all. Film tries to become a placeholder for feminism instead of showing Brave Hindu warriors protecting Bharat from Radical Islamic Invasion. Almost revers a Bloody Invader Ghazni. No chemistry between Sanyogita and Prithviraj, leaves no impact at all...Music is tasteless. An opportunity wasted, appears to be a sabotage."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nidhsshukla",
        "review_rating": "1",
        "review_title": "Worst movie of the year",
        "review_detailed_main": "First of all Akshay Kumar is a wrong choice for this role, he can't even speak pure Hindi properly, he is not at all justifying the role, worst acting of him till date. Not a person made for a historic role.\n\nManusi chillar being a fresher did quite well..👏👏👏👏..I must say much better performance then Akshay Kumar in this movie. Nice dancer indeed.\n\nSonu Sood was awesome as ever.\n\nDirection is weak.\n\nSongs are ok..I can just listen to them only while watching movie and surely not going to watch it again..no matter wherever it comes.\n\nBoring ...truly boring movie\n\nWaste of time."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "singhrajbeer-30257",
        "review_rating": "1",
        "review_title": "Ghatia movie",
        "review_detailed_main": "Akshay looks like a sucked up king. He does not even look real. Sanju wud have been better as a king. Akshay needs to know every movie is not a social cause movie. For such movies u need to be in a different character ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mrigenojha",
        "review_rating": "10",
        "review_title": "Hindustan ka sher",
        "review_detailed_main": "Goosebumps, Emotional, Heart-Touching.....you will be filled with emotions as you leave the theatre.. Amazing movie portraying our history in the right manner with full honour.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dhruviagrawal-08683",
        "review_rating": "1",
        "review_title": "Extremely poor story line and direction by Yash Raj banner on such an important historical Aspect",
        "review_detailed_main": "The movie's story line and direction has been built very poorly and was not able to at all met the valour of such a Great Historical King: Prithvi Raj Chauhan\n\nDespite of poor rating we still went with some hope and today I had to login and create a new account to give review to the topic. Request to please do the a justice to a very strong motivational historical figure of Prithvi Raj Chauhan."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "saddamsk-77977",
        "review_rating": "8",
        "review_title": "Akki as Prithvi",
        "review_detailed_main": "Sanjay Dutt impresses once again in a war epic, there's no stoping him on the big stage.this is a great day application I am very much for your support the most important."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shashankj-53380",
        "review_rating": "1",
        "review_title": "Poor Writing, Casting, Performance",
        "review_detailed_main": "Subject should sum it up. Amusingly weak in delivery, as in writing, the movie fails to do even a tiny bit of justice to the concept. Not in iota of cynematic excellence. Fails in every field.\n\nOST just too mediocre.\n\nBollywood should stop fooling the audience around."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ur-77823",
        "review_rating": "10",
        "review_title": "Amazing music composition.",
        "review_detailed_main": "Amazing music composition. Makhmali and Hari Har songs are my favourite. A must watch. I will give 4 stars Mesmerised by every scene, dialogues, music. Climax Gurantees Goosebumps 4 Star. A must watch and a proud film to watch out for in the cinemas Excellent screenplay, Authentic in every scene."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pandeadarsh",
        "review_rating": "1",
        "review_title": "Headache movie",
        "review_detailed_main": "Don't know when I slept and woke up in the theater slow screenplay bad fight scenes wan to make Akshay young we can go on ... don't watch it.\n\nAkshay worst movie I guess Heroine dance during the sathi time don't know what the director was thinking.\n\n."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nadkarnisumeet",
        "review_rating": "5",
        "review_title": "Historically inaccurate but still a watchable fare!",
        "review_detailed_main": "Samrat Prithviraj review :\n\nThis was one film I was looking forward to catch in theatre but unfortunately, had to stay home in Covid quarantine and by the time I recovered, the movie had already exited cinemas after bombing badly. Anyway, Samrat Prithviraj premiered online last weekend on Amazon Prime and I caught up quickly on what I missed...\n\nA review stating it is good or bad may appear futile now as the paying audience has already taken that call. I will try to delve more on what went wrong for Prithviraj the movie considering it was the much touted magnum opus after 83 (2021) which Bollywood was heavily banking upon..\n\nBased on Chand Vardai's epic poem Prithviraj Raso, the film showcases the heroic and righteous Samrat Prithviraj (Akshay Kumar) who wins over the heart of his close relative but sworn rival Raja Jaichand's daughter Sanyogita (beauty queen Manushi Chillar). Enraged, the wily Jaichand (Ashutosh Rana) seeks the help of Sultan of Ghazni, Mohammed Ghori (Manav Vij) to attack Prithviraj's kingdom. Prior to this, Prithviraj had captured Ghori in a battle but let him free as Rajputs never killed unarmed enemy as a principle!!\n\nDr. Chandraprakash Dwivedi's direction style belongs to the '90s. He concentrates more on Prithviraj's love story rather than on the then prevailing political situation which lead to him getting crowned the emperor of Delhi over the senior Jaichand. Secondly, the screenplay is laden with historical inaccuracies. Sultan Ghori is shown asking Prithviraj to only bow down to him after his capture whereas it is well known that the order was for much sinister religious conversion which the defeated but self respecting Samrat flatly refused. Raso talks of 'Jauhar' (self immolation) committed by Queen Sanyogita whereas there are multiple contradictions in other history books of her embracing 'Sati' later or of getting killed by Sultan after suffering immense humiliation. Similarly, whether the blind Prithviraj killed Ghori or the Sultan died a natural death ten years later is another matter of debate. These conflicting theories loom large in mind of the viewers making them doubt as to how much of this movie is actually true!!\n\nThe acting is again a mixed bag. Manav Vij disappoints big time as Sultan Ghori. He appears wooden in most scenes. Sanjay Dutt as Kaka Kanha, is strictly okey dokey. Sonu Sood does better as the Raso author and Prithviraj's right hand man Chand Vardai. Ashutosh Rana is woefully wasted. As for Akshay Kumar, he is neither too great nor too awful in the titular role. The ever busy star seems to have completed the movie hurriedly as just another quickie project... trust me, he was far better in Kesari (2019). His demeanor and mannerisms here appear too casual to befit the great emperor he is portraying on screen. The surprise good act comes from debutant Miss World Manushi Chillar who not only looks wow but also leaves a mighty impression in the dance sequences and the sad finale her character goes through...\n\nTo sum up, Samrat Prithviraj is not a bad film at all. Under a Rajamouli or an Ashutosh Gowariker, this could have been a masterpiece. Nevertheless, it certainly qualifies for a wholesome family watch on OTT. Make it one!\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hgurnani",
        "review_rating": "1",
        "review_title": "Concocted history & poor acting by lead actor.",
        "review_detailed_main": "A complete concocted history, poor acting by Akshay. He never looked like Prithiviraj Chauhan in the whole movie not even a single dialog. The whole movie was more of a fiction rather than the real history. I wasn't expecting this from a writer like Chandraprakash Diwedi who I have watched playing Chanakya. Bollywood should refrain from making movies on historical characters."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gthefar",
        "review_rating": "8",
        "review_title": "Epic story of a Bravest",
        "review_detailed_main": "Manav Vij deserves a special mention for playing such a pivotal role with effortless ease.this is a great day application I am very much for your support."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "monikaagarwal-62740",
        "review_rating": "3",
        "review_title": "Incomplete story",
        "review_detailed_main": "They should complete the story with real end like ..the complete doha of chandbardai which is the indication how to kill Mohammad gauri ... Drama and fictions are not as much real , they must show the war between both of them .\n\nAkshay is not a suitable character for the role .\n\nNow we would love to prefer to watch the same movie from south film industry . We are waiting I like manikarnika (kangna ranaut) more then this."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "koinforo",
        "review_rating": "8",
        "review_title": "Great love story India",
        "review_detailed_main": "I had no idea such a masterpiece could be created in such a short period of time; the director deserves special recognition.this is a great day application I am very much for your support."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "winak",
        "review_rating": "4",
        "review_title": "Another disappointment from YRF !!!",
        "review_detailed_main": "It's not the story but how a story is told that holds the audience. Many key moments in the movie which would get audiences emotionally involved were not aptly treated, so the movie just meandered on for 2 hours. Right casting is important to portray a story, the director got it wrong here too. Akshay Kumar looked out of place as Prithviraj, he seems to be just going through the motions. Even by looks Akshay resembled more like Bala from Houseful 4. Ghouri was found lacking and Samyukta didn't impress much. Historically many facts shown were incorrect. In short, I wouldn't watch it even it is telecast on TV out of respect for my time and sensibility."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "viratdhf",
        "review_rating": "2",
        "review_title": "Lovely",
        "review_detailed_main": "This is a such a nice movie and making all to be a very great and good and this is such a nice one and making to be great about this all and having a great to see."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "manishirtc",
        "review_rating": "1",
        "review_title": "I'm surprised by the IT cell reviews!",
        "review_detailed_main": "How this movie got 7/10 rating from 50k users? I'm surprised after watching the movie in Prime because I expected this would be a flop! Complete nonsense movie!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gauravambala",
        "review_rating": "5",
        "review_title": "Couldn't justify the glory of Great Prithviraj Chauhan",
        "review_detailed_main": "Apart from VFX this movie has failed to glorify the tale of great Prithvi Raj chauhan. Akshay kumar has failed to deliver in this role.. Be this be his looks, dialogue delivery or lean face.. He looked very impressive while battling with lions and having long hair...and kings do have long hair.. Sonu sood looked promising.. His expressions were on the spot.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ronayepal",
        "review_rating": "8",
        "review_title": "Mindblowing Characters Played Story of a Great",
        "review_detailed_main": "For example the pen with which Sanyogita writes or what she uses to put the teeka on her head- they are all true to the era the film is set in. Love this movie is a good."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tpsafdar",
        "review_rating": "1",
        "review_title": "Twisted story",
        "review_detailed_main": "The story is twisted and turned in to something to please eyes typical Bollywood drama.just radicalism and The more one sees the main characters, the less appealing they become. For the most part, things simply jump out and go 'boo.not worth the time you spend. The picture is very exciting to anyone who gets excited about how things are done in the movies."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ts-99304",
        "review_rating": "8",
        "review_title": "Great movie",
        "review_detailed_main": "It's an excellent family film with fantastic photography and great situational the most important thing is a great day application I am very much for your support the most important."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vinaybharti-32149",
        "review_rating": "3",
        "review_title": "Akshay Kumar is not proper fit in samrat prithviraj character",
        "review_detailed_main": "Akshay Kumar is not proper fit in samrat prithviraj character. But sonu sud and Sanjay dutt sir are really amazing acting in movie.\n\n. .\n\n. . . . . ......................"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "metresrikant",
        "review_rating": "10",
        "review_title": "Magnificent",
        "review_detailed_main": "If someone can do justice to the role of samrat prithviraj is Akshay kumar himself Neglect these negative comments and negative reviews and so called bikaau trade analysts The movie is really good Go to theatres and watch it with your family."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vinaygangwar-ers",
        "review_rating": "1",
        "review_title": "Ghatiya acting and direction",
        "review_detailed_main": "Overacting Worst direction Misfit cast Hypothetical facts Boring Overall a time waste movie. Akshay Kumar is good only for Bollywood masala movies. Actresses has no sense of acting."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "miralihbk",
        "review_rating": "1",
        "review_title": "Historical Nightmare movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pitambarasahay",
        "review_rating": "1",
        "review_title": "Very wrong choice to cast Akshay kumar",
        "review_detailed_main": "The man ruined the whole movie. May be Ranveer Singh, Randeep Hooda or someone else who put dedication, time and efforts for the role of samrat prithiviraj will be better choice."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kirshanad",
        "review_rating": "8",
        "review_title": "Love theAkki as Prithvi Great Direction Love then",
        "review_detailed_main": "Samrat Prithviraj merits a second watch and I am definitely going to watch the tale of the last Hindu Samrat once again. Love theAkki as Prithvi Great Direction Love then."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sibasissinha",
        "review_rating": "1",
        "review_title": "Worst Acting",
        "review_detailed_main": "Akshay kumar is doing movie just to earn more and more money to save for retirement. With growing age, he has started forgetting acting. Because of money, he spoiled the legend historical character. Nonsense acting, completely wastage of time."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhi-pandey-597-493198",
        "review_rating": "1",
        "review_title": "What a waste of Time and Money",
        "review_detailed_main": "Director claims that it took 14 years to write and direct the movie. But everything in this movie was off the track, speak about Acting of Mr. Akshay Kumar who neither looked like an emperor now sounded like one, fight scenes were bogus , and same with Dialogues and music of this movie. Every thing was off the track, it was a torture to watch this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "subhendupatra-96293",
        "review_rating": "10",
        "review_title": "Entertainment",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "njagtap",
        "review_rating": "1",
        "review_title": "Poor Acting",
        "review_detailed_main": "Akshay you should try comedy poor acting. They might have selected someone else for this role story was nice but acting failed here.\n\nSonu did a good job. In theatre only 2 people were there to watch the movie, akshay should focus on raju kind of roles."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dev-26406",
        "review_rating": "3",
        "review_title": "Lost the realism due to commercialization....So i think it was just a fiction movie not at all based on Rajput Samrat Prithviraj Chauhan ....",
        "review_detailed_main": "Thought it to be the biopic of Rajput Samrat Prithviraj Chauhan but Chandraprakash Dwedi has created his own fictional charater named as Samrat prithviraj in this movie.... Prithviraj Chauhan is known for his valour and bravery not for his love life but to commercialize the movie his lovelife was given too much portion in the movie and the romantic songs added insult to the injury...Prithviraj ji was much more than a lover and he had fought so many battles in accordance with his 'Digvijay policy' which was not even mentioned and would have made the movie more real and relevant... How can the writer even think of writing a scene where Samrat prthviraj is dancing and a scene where princess sanyogita is dancing like a regular bollywood dancer, where the hell is ghoomar.... Prithviraj chauhan was undoubtedly of Rajput clan but not even once the word rajput is uttered in whole movie because the producer where in a hell of greed and were aware of the matter that the Gujjars who claim Prithviraj chauhan to be a Gurjjar king will boycott the movie.... What a disrespected of the Hindu Warrier of rajput Clan... The scene where Rani Sanyogita Performs Agni Johar was made completely unrealistic as before doing so she danced with other ladies which spoiled the whole thrill and goosebumpness of that brave act.... \"Char baans chaubis gaj angul ashth praman...\" the epic lines which chandrabardai chanted to guide prithviraj when prithviraj killed ghori with an arrow were not there .... Its unbelievable... How can they dare to claim this movie to be based on prithviraj raso... So i think it was just a fictional movie which is no where near to called as biopic of Rajput Samrat Prithviraj Chauhan ...."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "barmantx-70292",
        "review_rating": "10",
        "review_title": "Samrat Prithviraj Chauhan is the great warrior",
        "review_detailed_main": "What a movie !!! Hats of to Dr. Chandraprakash Dwivedi ji for such epic representation of history. This movie is really so nice and very fantastic. So I like this movie so much."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "souras",
        "review_rating": "1",
        "review_title": "Based on Multiverse",
        "review_detailed_main": "Historical facts has been distorted and thus supporting the Doctor's Strange Multiverse logic. Anyways that's how movie has been promoted when the makers too had doubts on the content. The two star is for Sonu Sood, else one start was perfect..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "deva-95201",
        "review_rating": "9",
        "review_title": "Awesome",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhisingh02",
        "review_rating": "1",
        "review_title": "This movie is nothing but a DISGRACE on SAMRAT's Name",
        "review_detailed_main": "I just wanted to say sorry to SAMRAT PRITHVIRAJ for this disgrace depiction of his life story. I mean I just can't believe how can they scr*wed this up.\n\nSanjay Leela Bhansali already give them platform to make such historical movies still if you r fu*king then it's your fault.\n\nBeing a RAJPUT, I am disgusted and my head is down and makers of this movie is responsible."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mousarkar-66139",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Chandraprakash Dwivedi has delivered big time in this film, what fantastic direction and overall experience he has given to the public.............................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "princerahman-69392",
        "review_rating": "1",
        "review_title": "Waste of my precious 2 hour",
        "review_detailed_main": "From beginning to end, there's no sequel. All they are doing just fighting & dying or simply suicide. It's a movie where everyone's only motive is to die."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rish2006",
        "review_rating": "2",
        "review_title": "Just ignore it",
        "review_detailed_main": "Giving 2 stars for decent cinematography or else it's a complete waste of time.\n\nWrong cast\nFake history\nweak Screenplay, where the story gets boring.\n\n\nSome review people are right - Bollywood seriously need to invest on writers and how long will they copy stories from South Indian films."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "suriyakrishh",
        "review_rating": "1",
        "review_title": "Akshay's immature screen presence and poor taking",
        "review_detailed_main": "See rrr inspite of being loosely based movie still very great presentation, but this movie sucks right from the beginning. The movie is unable to make connection with the audience in any aspect.\n\nAudience kept hovering around the snacks counter throughout without any interest in the movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ashuy-11074",
        "review_rating": "9",
        "review_title": "power of SamratPrithviraj",
        "review_detailed_main": "The essence and valour of Samrat Prithviraj is perfectly captured in this movie. The overall feel and vibe of this movie is just spectacular and the overall details are just terrific."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "archnaiitr",
        "review_rating": "1",
        "review_title": "Ghori died in 1206. movie ends in 1192 with prithviraj I suppose",
        "review_detailed_main": "Ghori died in 1206. Movie ends in 1192 with prithviraj I suppose. Can you do some homework and check when Prithviraj died please. Sorry dudes. Akshay Kumar can't even grow a moustache and you blame on the director."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "karanmani-48820",
        "review_rating": "9",
        "review_title": "the glorious journey",
        "review_detailed_main": "Best movie ever made, Akshay totally does justice to the role of Samrat Prithviraj. The essence and valour of Samrat Prithviraj is perfectly captured in this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "johnxiangtani",
        "review_rating": "1",
        "review_title": "MY TRUST ON HISTORICAL MOVIES OF BOLLYWOOD IS GONE",
        "review_detailed_main": "Let me put it simple: Its totally understandable that when you make a movie, it not necessarily be exactly what it had been, I mean little fiction can be added. But it doesnt mean that you would distort the history.\n\nWho the hell told you Prithviraj killed Ghori? Please do not do that, you are just messing with history, and movies does a lot of impact to our young generation, please do not distort history.\n\nDuring 11th 12th century, India was not a unified country, it was a landmass of Kingdoms, hence there was nothing like today's Nationalism, but Akhsay tried to show it buy saying \"Hindustan\" again and again, whereas in reality Prithviraj belonged to Chahmana dynasty and he had nothig to do with other kingdoms, during this , every kingdoms wanted to assert their power over another, there was rivalries. Chauhan belongs to Rajput clan , nad one of the Rajput kingdoms .\n\nHe won against Ghori in 1911 but got badly defeated during secon battle of Tarain. His kingdom was badly usurped. The movie did no justice to the reality.\n\nTotally disgraceful."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sonpal-00449",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "Awesome history everyone should watching this movie to know our great brave kings and his patriotism to our bharat mata thanks to making this movie we want also maharana pratap history these were some brave kings which felt us real indians and braveness hats off guys who parts of this movie ... Must watch movie everyone ... Acting overall good , but the history classic."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shwetanil",
        "review_rating": "2",
        "review_title": "Disappointed",
        "review_detailed_main": "Manushi Chillar is not bad, but doesn't have the charisma that the role demands.\n\nAkshay Kumar disappoints in the lead role. He worked on his body before doing this film as history revaled for Prithviraj. In order to tone down his body language and Punjabi accent, Kumar has lost much of his trademark energy and could not develop the gravitas required to play the celebrated ruler. He growls like a lion who has lost his bite and despite all the air-brushing, doesn't look like the boy who became a Samrat in his 20s. Must be Much Worked on it\n\nThere are no references to 22 battles Prithviraj with Mohammad Ghori because Bollywood has promote secularism and pseudo secularism. History is meddling as bollywood did.\n\nBut sonu sud , ashutosh rana n sakshi tanwar did well.\n\nOverall disappointed by the movie. Don't waste your money on it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shahi_prashant",
        "review_rating": "3",
        "review_title": "Kilo Calori Crime!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tulanpatel",
        "review_rating": "1",
        "review_title": "Akki made the movie for money only",
        "review_detailed_main": "What a waste of a story and sacrifice of great king... Dada trying to play a young king.. he did this movie and many more coming just for money like Ajay devgan, SRK , etc since they know their time has come to end with the public now understanding their Chu****giri ..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "arpita-paul1984",
        "review_rating": "9",
        "review_title": "Excellent movie",
        "review_detailed_main": "Samrat Prithviraj is a thoroughly researched, lavishly shot, brilliantly acted & perfectly made film! @akshaykumar has lived the character of Prithviraj Chauhan. Take a bow Chandraprakash Dwivedi."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Babayaga-42713",
        "review_rating": "1",
        "review_title": "Fake movie",
        "review_detailed_main": "Historically inaccurate. Full of Hatred towards a single community. This movie is made to impress the Emperor of India nothing else. Please do not waste your money watching this instead watch a South Indian movie. You will have some entertainment atleast."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kanchanarani",
        "review_rating": "9",
        "review_title": "witness the Chauhan",
        "review_detailed_main": "The overall feel and vibe of this movie is just spectacular and the overall details are just terrific. The scenes just make you go spellbound and makes you applaud."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "hXz0r3",
        "review_rating": "1",
        "review_title": "One of the worst movies so far this year.",
        "review_detailed_main": "Horribly wrong movie.. Akshay shouldnt take some roles which does not suits him, same style of dailogue delivery.\n\nWasted 2 hours completely.\n\nIts soo bad to find history facts changed in this movie, not sure what writer/directors want to make the same from non-fiction to fiction ?"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jagadeeshthokala-46306",
        "review_rating": "10",
        "review_title": "Too good",
        "review_detailed_main": "This is such a great one and making all are too happy about this all and very very lovely one and making me to happy about this all and very very great one and lovely one."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shumiakhtar",
        "review_rating": "1",
        "review_title": "Movie not beautiful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gautam-09050",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "Haven't seen movie with such worst acting, worst direction and third rated dialogues. Actual story is so inspiring and could have been presented in much better way. Had it been produced by some South Indian production/director it would have done phenomenal job."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vivekawasthiin",
        "review_rating": "5",
        "review_title": "Disappointing and altered historical climax",
        "review_detailed_main": "Mohammad Ghori was killed sitting on his throne, Prithvi Raj Chauhan slaughtered him with a spear, by listening Chandar Bardai's these lines: \"CHAR HATH CHAUBEES GAJ, ANGUL ASHTH PRAMAN, TAA UPAR SULTAN HAI, MAT CHUKO CHAUHAN\" Unfortunately director Dr. Chandraprakash Dwivedi, missed it and altered our glorious history.\n\nExtremely disappointing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lakanrashl",
        "review_rating": "9",
        "review_title": "story of King Prithviraj",
        "review_detailed_main": "Sanjay Dutt is the light of the movie, the man just keeps getting better and betterChandraprakash Dwivedi has done a terrific job in creating this masterpiece of a movie. Hats off to him and his team."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "buntypanwar",
        "review_rating": "1",
        "review_title": "False facts",
        "review_detailed_main": "Really frustrating to watch a movie made on one of the most popular emperor of India. Poor acting, bad screenplay and Yashraj films try their fullest to defame our king."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "harihari-58800",
        "review_rating": "9",
        "review_title": "glorious Chauhan",
        "review_detailed_main": "Excitement at its peak, after watching this masterpiece of a movie. Best movie ever made, Akshay totally does justice to the role of Samrat Prithviraj."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "arsadmalik-60952",
        "review_rating": "1",
        "review_title": "Worst historical movie.",
        "review_detailed_main": "This movie totally a waste of time movie because it is worst historical movie. The characters shown in this movie are from above the violence of Hindu Muslim. Muslims have been critiqued inside this movie, which was not the case in reality. The story shown in this movie is fictional, nothing like this happened in reality. This movie has been made only to promote Hindu talk, insult of Muslims has been shown. The name of the historical movie is a blot."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tusharp-65454",
        "review_rating": "9",
        "review_title": "It's good. Worth going cinema.",
        "review_detailed_main": "Don't go by reviews, decide yourself. It's a good movie. A true story told well if not brilliantly.\n\nThere many goods. First is woman power issue; it showed how old is this issue and how fight continues from the times of Krishna. This nuances of the fight of gender in our history is captured beautifully. Second, the architecture and settings are best and looked 'Bhaaratiya' and of course Dwivediji is known for this. Thank god he didn't made them extravagant like Bhansali. Yes, somehow it missed to create the mood of that time and era as he had done in Upanishad Ganga.\n\nAll the characters are good and have made it worth watching. We can see a glimpse of pressure of lead role in Akki. His character was treated with too much caution and so agreeably ended up stiff.\n\nIf you are going to compare this with Hollywood finishing and making then it's your mistake. Even Bahuballi and RRR were not perfect, in fact they have have stretched every scene towards a laughable perfect..\n\nIf you see good you will get good."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "globalcitizen-55620",
        "review_rating": "1",
        "review_title": "Worst movie i have ever seen",
        "review_detailed_main": "Don't know how it is getting a 7.1 on imdb at the moment. No story. Bad music. Nothing that makes it worth watching.\n\nThe parts that were supposed to portray something historical seem to to be more fairy tale like with no realistic interpretation possible."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mustafaanas-90969",
        "review_rating": "1",
        "review_title": "Insult of great king Chauhan",
        "review_detailed_main": "This is really insulting to watch such a great king and his legacy in such a bad way... this director is probably the worst ever director in entire world and off course Akshay Kumar overacting is icing on this horrible story...they should be ashamed of making such a movie and defaming prithviraj chauhan seriously!!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jameel27",
        "review_rating": "1",
        "review_title": "Hugely disappointed with the movie",
        "review_detailed_main": "Do not waste your time. Akshay kumar doesn't fit the role at all. Nothing worth writing about the movie. The story is not well written. The star casts are totally misfit."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "aditya-39831",
        "review_rating": "10",
        "review_title": "Historical movie",
        "review_detailed_main": "India would have been in safe hand . If prithivi raj would have killed Mohammed gori. If first war of tarayin . It move show , prithvi raj has great heat for enemy . It is amazing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pathak-ravi",
        "review_rating": "1",
        "review_title": "Poorly made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhishekshatry",
        "review_rating": "9",
        "review_title": "Proud Movie",
        "review_detailed_main": "#OneWordReview... #SamratPrithviraj: ENTHRALLING.\n\nCaptivating film that has scale, conflict, drama, romance, battle sequences and SOUL... Director Dr #ChandraprakashDwivedi narrates an epic tale with flourish... DON'T UNDERESTIMATE THIS FILM. #SamratPrithvirajReview."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kalsi-884-476262",
        "review_rating": "3",
        "review_title": "Disappointing movie bad direction weak story and Akshay Kumar needs to change",
        "review_detailed_main": "I'm so tired of these rinse repeat Bollywood movies Make it overly patriotic with bad songs AK looks same every movie He delivers dialogue same every movie Acts same every movie\n\nSo boring."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dassagar-25247",
        "review_rating": "8",
        "review_title": "Amazing movie King Great love story",
        "review_detailed_main": "Samrat Prithviraj is a spellbinding movie. It is amazing what a brilliant script, years of intense research and stellar direction can do to a film. Killer!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "yuvu-85843",
        "review_rating": "1",
        "review_title": "Average movie",
        "review_detailed_main": "Average movie. Nothing special in this movie. Normally action scenes with lots of feku script. And he made movie only these types or Raja's movie and never made many more Raja's movie and many freedom fighters and who made Indian constitution and many more."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nealofear",
        "review_rating": "2",
        "review_title": "Bad Casting, Bad Acting, Bad Cinematography, Political Agenda, Historically Inaccurate",
        "review_detailed_main": "Rubbish acting, with a third class casting. Bad cinematography, movie is on a politocal agenda. Complete fraud historical data. Low grade songs and scene timing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shafaqatkhan",
        "review_rating": "1",
        "review_title": "3rd class movie",
        "review_detailed_main": "Movies based on fake history. Sultan Mohammed ghori died after prithviraj but it shows fake story prithviraj raso was a fictional story not trus ones bakwaas dialogues used by script writer."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rohanpandeyfacebook",
        "review_rating": "10",
        "review_title": "Stay away from Negative Reviews",
        "review_detailed_main": "Just go and watch the film. You won't regret it I promise. Amazing portrayal of Samrat Prithviraj. Very well played by all the characters. The music is what will keep you attached."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "King-Boral-007",
        "review_rating": "5",
        "review_title": "Don't see from historical point of view.",
        "review_detailed_main": "It's a typical hindi commercial film with great dialogues from protagonist, good soulful music.\n\nThis movies have some good sides like:- a. Good acting from Sonu Sood, Sanjay Dutt, Manav Vij, Manushi Chhillar b. Good music from Shankar-Ehsan-Loy c. Some good dialog delivery,action scenes from AK\n\nThe cons are more in number:- a. Akshay Kumar doesn't fit in the role of Prithviraj. He looks old for the role. He looks expressionless in some part.\n\nB. Childhood of prithviraj could have been shown little more.\n\nC. More effort on production,vfx could have been there."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ajaymaurya-03356",
        "review_rating": "10",
        "review_title": "great writing",
        "review_detailed_main": "Trailer was totally different from the movie.they kept it secret and the movie was proved its worth. Ekdum jhakaas movie hai. Mind blowing. Well acted. Good vfx, great writing."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rahman_moshiur_bd",
        "review_rating": "3",
        "review_title": "Great Comedy Movie",
        "review_detailed_main": "So people are complaining that Akshay reminds them of Bala and also that this movie seems like a comedy film. Well when the entire history has been changed for the sake of making a movie favouring a certain religion then why care about acting and direction ??? .... it's a shame how these people are twisting history in ever film."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mahjffhjdcb",
        "review_rating": "8",
        "review_title": "Akki as PrithviGreat Direction",
        "review_detailed_main": "A proud ruler. A love story. A strong headed woman. A relentless villain. A melange of all these is Samrat Prithviraj.watching it in full glory on the big screen just had a."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ts-97390",
        "review_rating": "2",
        "review_title": "Poorly written dialogue",
        "review_detailed_main": "Why Can't you make Good movies on Rajput Bad delivered dailogue bad written movie And director was going to take sunny deol .Even thinking about him for this role was bad.\n\nMust have taken actor in 20-30 as was age of Prithviraj Chauhan or some good prepared actor who must have given justice to both Prithviraj or Sanyogita role too Next time please select prepared actors."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sparsh-23016",
        "review_rating": "4",
        "review_title": "It's quite boring & not created that vibe.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "manish67",
        "review_rating": "1",
        "review_title": "Bakwaas",
        "review_detailed_main": "Absolutely scrap. Neither Akshay Kumar nor Manushi Chillar could do justice to their roles. Weak direction and weak dialogue delivery. Probably the film aims to play with the sentiments of a particular class."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "malp-22195",
        "review_rating": "8",
        "review_title": "Akki as PrithviGreat Direction Love the",
        "review_detailed_main": "The sets are massive and absolutely true to the era they are representing. Samrat Prithviraj is realistic while being stunning. There are no unnecessary embellishments."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "younsie",
        "review_rating": "1",
        "review_title": "Why does Bollywood Keep Altering the History?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "skumarjha153",
        "review_rating": "10",
        "review_title": "Don't judge book by it's cover",
        "review_detailed_main": "People, media dismissed this movie after the release of trailer. But Akshay Kumar Smashed it out by his performance. Also mention to Dr Chandraprakash Diwedi who wrote and directed this movie to be called Best."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ferozshah-62377",
        "review_rating": "1",
        "review_title": "Fake alternate narrative",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ganguligita",
        "review_rating": "10",
        "review_title": "Interesting",
        "review_detailed_main": "A movie close to my heart being a Rajput.really most enjoy ful.we watch this movie with my parents.they were very happy and emotional .Really more and more interesting movies."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shaikabdulus",
        "review_rating": "1",
        "review_title": "Worst historical movie",
        "review_detailed_main": "Utter flop movie. It's worst movie on historical period. Poor performance. Boycott Akshay kumar.waste of time. Not realistic movie. Padmavat is far better than this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sanjoybrahmachari",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": "A A total waste.total waste. A total waste.total waste. A A total waste.total waste. A total waste.total waste. Waste.total waste. A total waste.total waste. Waste. A total waste.total waste."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "chandrapol",
        "review_rating": "1",
        "review_title": "Worst movie",
        "review_detailed_main": "Use political propoganda for hit the movie is not success. In this movie direction is not good, story is wrong, acting is not good. It is like stage drama. Worst movie. I wish this movie was made by SLB."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rinagupta-99578",
        "review_rating": "10",
        "review_title": "Thrilling",
        "review_detailed_main": "The cast is great , have a gut feeling it'll be a great movie. Great movie ,i have ever seen in my life. Really awesome movie. I eagerly awaiting . All my members are very very happy."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "fai_ali02",
        "review_rating": "1",
        "review_title": "What waste of time , worst moives ever",
        "review_detailed_main": "Story was bullshit , look like watching ramayan part two . Plus talking about woman rights back then Hindu never believe in woman right .plus story it is not entertaining moives . It was more like watch news . Indeed they are much better historical moives ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kalpanadas-33060",
        "review_rating": "8",
        "review_title": "Story of a Great King Akshay rocks",
        "review_detailed_main": "No one can equal the attitude and body language that Akshay sir has conveyed as Samrat Prithviraj Chauhan. Story of a Great King Akshay rock's this movie is a good."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sulaimanlalani",
        "review_rating": "2",
        "review_title": "Presented as factual, which it isn't",
        "review_detailed_main": "Historical accounts obviously do not match. Chauhan has been deliberately and overly glorified! Also dance sequences have been added in unrealistic places."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "duttakiran-55640",
        "review_rating": "9",
        "review_title": "What a story!",
        "review_detailed_main": "This is absolutely awesome movie.. I just liked this soo much... Amazing experience with this movie.. I am highly recommend you to watch this movie with your friends and family member.."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rfrefat",
        "review_rating": "1",
        "review_title": "Totally disgusting movie",
        "review_detailed_main": "This movie roasted the history. Samrat prithviraj died 1192 and Muhammad of Ghor died 1206. So that is a totally disgusting movie and roasted the history."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "digvijayrajput-34604",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Yet another high budget bollywood Trash movie.\n\nDon't even call it historic movie, it's shameful.\n\nDialogues, acting, screenplay everything is terrible let alone the historic accuracy. Akshay kumar is as usual just acting casually. Please stop making such terrible movies Bollywood!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shubhenduojhaojha",
        "review_rating": "1",
        "review_title": "Faking the history",
        "review_detailed_main": "It's very disheartening to see a brave soldier history getting spoiled just for some popularity and fame.\n\nFrom our childhood, we have learned about the friendship of Prithviraj and Chand var dai from the below lines. Before watching the movie, I was waiting for this line to come up :\n\nCHAR HATH CHAUBEES GAJ, ANGUL ASHTH PRAMAN, TAA UPAR SULTAN HAI, MAT CHUKO CHAUHAN."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lr-34217",
        "review_rating": "10",
        "review_title": "Amazing story",
        "review_detailed_main": "No age bar for this movie. Can watch it with youngester and parents. This is very good movie with great storyline thanku for making such good movie. Very awesome and entertaining."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhishek-26196",
        "review_rating": "1",
        "review_title": "Shame on Akshay Kumar , he didn't justified as king but he look like BALA from housefull",
        "review_detailed_main": "Poor Acting by Akshay Kumar,he didn't even try to fit into the emotions of the story instead a greedy person who dont care about acting bit the money.\n\nAnother flop by AK."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "drishtia-71303",
        "review_rating": "10",
        "review_title": "Wonderful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhamishra-66948",
        "review_rating": "4",
        "review_title": "Ok ok movie",
        "review_detailed_main": "Don't waste your time and money on this movie .\n\nIt like old school story telling in singing style.\n\nFight scene was ok .VFX ok. They wasted the villain..in story ... Wait OTT ....."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "jamalkhan-23258",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "I wish some other rulers of Hindustan were like Prithviraj , I can guarantee no one would have dared to invade then............ ..................................... ........................"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lingayat-58670",
        "review_rating": "3",
        "review_title": "Worse movie... Character doesn't suit",
        "review_detailed_main": "Its just an Bollywood love thing story'... Not much about his bravery thing typically Bollywood make movie ... Its just an time pass movie .. wait for ott release."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rahulrajindian",
        "review_rating": "4",
        "review_title": "Misleading our hindus about prithivi raj chauhan",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kumartusharsingh",
        "review_rating": "2",
        "review_title": "Energetic Acting could have been done better",
        "review_detailed_main": "I will give it 2 star.\n\nNot as expected Ajay devgan would be the good choice for lead instead of akshay.\n\nLegendary samrat prithviraj energy is not being matched up by akshay kumar."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "das-21470",
        "review_rating": "8",
        "review_title": "FABULOUS story Mindblowing Characters Played",
        "review_detailed_main": "The background score is fantastic and has been expertly constructed. FABULOUS story Mindblowing Characters Player MP4 video I love this movie is a great."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "riteishsantra-68927",
        "review_rating": "1",
        "review_title": "Another Super Dupur Blockbuster FLOP Form Bollywoo",
        "review_detailed_main": "First Of All Wrong Casting For Lead Role. He Is Not Correct Person For \"Samrat Prithviraj\".\n\nIt's Time To Chance New Face In Lead Role, And That Will Help Bollywood Film Industry From Sinking Ship To Rising Ship.\n\nAshutosh Rana, Sonu Sood, Sanjay Dutt Are Acting Better In This Film Than \"Mr. Lady Version Of Kangana Ranawat.\" This Is One Time Watch, Actually Not Even One Time Watch Category Film.\n\nWaist Of Money, Time And Also After Watching The Film, You Fill Like, What Did I Just Saw.\n\n# Bollywood Flop Film Continues..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dipalydas",
        "review_rating": "8",
        "review_title": "Great love story The Royal History of India",
        "review_detailed_main": "But also paved way for the events that unfold in the film. Loved the movie and this scene definitely was my favourite Ashutosh Rana plays Sanyogita's father."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gurujirajat",
        "review_rating": "1",
        "review_title": "Why Akshay why?",
        "review_detailed_main": "Akshay you just disappointed us in Every manner. When you can't play the role of such legend. You shouldn't say yes to such movies.\n\nCompletely disappointed."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nhasdfgtrew",
        "review_rating": "8",
        "review_title": "Epic story of a Bravest King Great love story The Royal History of",
        "review_detailed_main": "Akshay Kumar as samrat prithviraj is nailing the act and how! Mazza aagaya, bollywood's dry spell will be over...This movie is all set to break records."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "smsngh",
        "review_rating": "1",
        "review_title": "Funny movie",
        "review_detailed_main": "Not even a one time watch. Acting not upto the mark and more than being a serious movie, I think it is a funny movie.... Can watch it if you have enough time to waste."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nabz658",
        "review_rating": "1",
        "review_title": "Just another historic pic made of lies",
        "review_detailed_main": "In these crucial and very sensitive times, such kind of movies not only provoke hate but also question to the reality. If you do the research Chauhan reign lasted till 1192 AD A and Mughals came in 1526 AD Dont know where is the connection. Mughals were also Kings by the way and not just invaders. There is always 2 sides of the story and only 1 side is shown as always. Im truly sad to see cinematic being used as the means to benefit one sided thoughts, instead of the real story.\n\nAnother LIE LIE LIE AND LIES Just like Padmavat.\n\nDont beleive me, just do your own research and not from the known and already famous sources. Go deep and then you will find it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "slyshoaib",
        "review_rating": "2",
        "review_title": "A very mediocre affair with bad script.",
        "review_detailed_main": "Happened to watch this movie this day in UAE, its below average story and a very average performance by the main lead akshay kumar and sanjay dutt the new actress is very good looking and acted well, the person who played the ghori (villain) is just superb the fierce in his eyes is amazing. The background score is messed up. Songs are below average. Should have worked on the script and screenplay which lacks. A one time watch movie to be strictly watched on some OTT platform."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rprathameshsingh",
        "review_rating": "10",
        "review_title": "RAJPUT SAMRAT PRITHVIRAJ CHAUHAN",
        "review_detailed_main": "This is the best unparalleled movie.\n\nEveryone must watch this movie.... #SamratPrithiviraj.\n\n#AkshayKumar #ManshiChillar #SanjayDutt #SonuSood.\n\n\"Char Bas Chobis Gj Angul Asht Praman Ta Upr Sultan Hai Mt Chuke Chauhan\""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shariq_ahmed17",
        "review_rating": "1",
        "review_title": "Complete disaster and hatemonger",
        "review_detailed_main": "This is a clear proofs of how cinema is used to spread hatred against muslims in India... its a complete suck with only being made with the mind frame to defame Muslims and appease RSS BJP ideology... shame."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rashisinde-44228",
        "review_rating": "10",
        "review_title": "Best storyline",
        "review_detailed_main": "A lion hearted ruler .wonderful amazing movie watch everyone online very fantastic and interesting Prithviraj movie and best entertainment movies very awesome and action movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "lvaanilgoswami",
        "review_rating": "1",
        "review_title": "bakwaas",
        "review_detailed_main": "Totally nonsense acting Forced action, Forced nationalism, Trying to fool and mobilize the public in the name of Nation and Hindu Gods and Goddesses..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "biswamishra",
        "review_rating": "10",
        "review_title": "Must Watch With Family.",
        "review_detailed_main": "After watching this movie, i must say that it worths every penny. This is really a great visual experience and have great story telling. Akshay Kumar as Samrat Prithviraj Chauhan has done justice to the character. Sonu Sood, Sanjay dutt are very good support to Akshay Kumar. DR.chandra Prakash ji as a director needs full credit. Don't want to reveal the story. You should go and watch with entire family. More of this type of movie need to be made in India.\n\nFinal Word: Glorious Samrat Prithviraj Chauhan 🙏🙏🙏"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "karveerjandu",
        "review_rating": "2",
        "review_title": "Worst better to watch cartoon",
        "review_detailed_main": "Dialogue was very bad... Acting also very poor... 2 Star giving bcz of our hero prithviraj ji... Plzzzzsssszzss watch on TV don't waste hard earned money 🤑 !!!!¡!!!!!!!!!!!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ariijitgh",
        "review_rating": "2",
        "review_title": "Rubbish movie based on fake news",
        "review_detailed_main": "Rubbish movie based on one of the most idiotic Indian rulers who after defeating a very dangerous enemy kept himself busy in merriment ,marriage , luxury etc rather than atleast keeping a watch on the enemy if not finishing him completely."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "aseesinstitute",
        "review_rating": "1",
        "review_title": "Akshay only work for himself",
        "review_detailed_main": "Akshay is a disaster for movies . No research work not efforts there is nothing good in this movie . Why even one star dont even deserve one . Akshay is not working for movies . He is working for himself . Giving back to back flops . Such a arrogant man . You can see his body language and over smartness at kapil shows ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mollyvi",
        "review_rating": "8",
        "review_title": "Epic story of a Bravest King Great love story The Royal History of",
        "review_detailed_main": "Loved each and everything about this film, the larger than life performances, the perfect portrayal by each character, everything was on point.one of the best movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "afsaba",
        "review_rating": "1",
        "review_title": "Fake idea of repersantation about great Emperor",
        "review_detailed_main": "The movei is highly deniable. The movie dont reflect a great Emperor image. If you triy to represent an emprror throuh a jackal the movies see the same fate. Director and actor should have watch bahubali movie before the movie made. And also akki can never build an emage of great emperors. Akki best fit in a comedy movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "gahhffbkbcdg",
        "review_rating": "8",
        "review_title": "Akki as Prithvi Great Direction Love theAkki as Prithvi Great Direction Love the",
        "review_detailed_main": "Samrat Prithviraj was not scared of battle but respected his enemies. His character in the movie is true to the actual Samrat's and the attention given to make sure that happens is commendable."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rashmidurgesh",
        "review_rating": "4",
        "review_title": "An average movie only",
        "review_detailed_main": "U may see film for the respect of prithviraj but only at just once.\n\nBut Film weakest link is akshy. Only initial and climax is good.film is below average."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bjdssykb",
        "review_rating": "8",
        "review_title": "Epic story of a Bravest King Great love story The Royal History of",
        "review_detailed_main": "This is one of the most ambitious film i have seen in a while, the grandness, the scale, the set design everything is managed to perfection, it's defintely a theatrical watch."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "toolsadviser",
        "review_rating": "1",
        "review_title": "Bollywood Spoil History",
        "review_detailed_main": "Actually Prithviraj Chauhan died in 1192 and Mohammad Gori died in 1206, but in film Prithviraj Chauha kill Gori in war.. but How it Possible?\n\nIn terms of Historical film, Bollywood try to soil or change or dishonor the respected history."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "huntagentiger",
        "review_rating": "1",
        "review_title": "Comedy",
        "review_detailed_main": "Yesterday I was watching some comedy videos of Akshay kumar how brilliant he was please come back to original not fake He was not fit for this role.\n\nU should try ur luck again in comedy u r outclass in it u will be back with a bang leave these deshbhakti movies a side."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "salmanshaikh-28718",
        "review_rating": "3",
        "review_title": "MENTAL TORCHER",
        "review_detailed_main": "1. BORING SCREENPLAY 2. POOR STORY 3. BAD ACTING These points are enough to describe the movie, Please don't waste your time on this movie.\n\nWhile watching the movie, i was just waiting for the movie to end, Akshay Kumar is the main Element why this movie feels stupid, he is acting same as he acted in hera pheri, housefull and all of his stupid movies PLEASE DON'T WATCH."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "amitkumar-50458",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "A biopic I was eagerly waiting for #SamratPrithviraj movie best movie I am so happy i really like this movie amazing......................................"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "huzaifahaj",
        "review_rating": "1",
        "review_title": "Never ever watch it disgusting",
        "review_detailed_main": "Poor acting performance character is shown very poorly and what can you expect from this mr vimal man.and most shocking to see the history they changed everything about mohammad ghori and Prithvi Raj everything looks disgrace there are no true events discribed in the movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ashutoshg-17105",
        "review_rating": "10",
        "review_title": "Jai Prithviraj Maharaj",
        "review_detailed_main": "Just want to say... What an experience.. Jai Prithviraj Maharaj.. In this time where Bollywood only shows cringe movies, this movie is like an light in darkness.. Proud to be an Indian... We are proud that Emperors like Prithviraj Chauhan were born here.. Har Har Mahadev."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "wwwvikrammanhas",
        "review_rating": "3",
        "review_title": "Fake story shown by writer director",
        "review_detailed_main": "This is not a reality.. they show great emperor as a aashiq.. he defeat md gauri 17 time. They shown 1 time only. Its totally vise versa of really and actual personality of great rajput prithviraj chauhan."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "anubhavarora-91813",
        "review_rating": "10",
        "review_title": "Awesome movie and much better than the reviews I read!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sidjoshi04",
        "review_rating": "1",
        "review_title": "Dont fall for the good reviews",
        "review_detailed_main": "Akshay never acted like a true king. A dull performance. Nothing exciting about the movie.\n\nNo one acted good. Total time waste.\n\nDont understand Why they chose Akshay in the first place."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nis-18393",
        "review_rating": "2",
        "review_title": "Typical Bollywood",
        "review_detailed_main": "It was just a typical Bollywood movie. Songs in every 10-15 mins, unnecessary long dialogue etc....\n\nNothing new. Manipulation of history. Boring movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "asquareforu",
        "review_rating": "1",
        "review_title": "Extremely boring movie",
        "review_detailed_main": "Utter waste of time and movie looses the audience interest in first 10 mints of the movie itself.\n\nAkshay kumar acting is very poor, graphics are decent but story plot misses connection for anyone to understand."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kumarankit-28533",
        "review_rating": "10",
        "review_title": "Superb movie.",
        "review_detailed_main": "This is really one of the must watch movie for this year in which you realise and see the real Ora is the greatest Samrat Prithviraj Chouhan Played by Akshay Kumar and we'll played... Must watch with your family."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhimanyuisqwerty",
        "review_rating": "1",
        "review_title": "Great comedy movie",
        "review_detailed_main": "I am giving it 1 star because below this nothing exists.\n\nThe screen play , story and choice of charachters were disasterous.\n\nNeither true history was shown nor prithviraj raso was screenplayed."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "akramrn",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "Really very nice and wonderful warriors movie watch online very fantastic and interesting movie A brave son Hindustan Samrat Prithviraj.very action movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vgautam-64580",
        "review_rating": "1",
        "review_title": "Not happy...really...",
        "review_detailed_main": "Going to be average grosser... Nothing new so that I can recommend you all... dialogue is not going to make it hit... Something unique must be there... I mean storyline.. totally wasted my money... 😭"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mahlotraaakash",
        "review_rating": "10",
        "review_title": "Nice movie hai",
        "review_detailed_main": "Sonu Sood fits himselffor all the roles no matter what. Amazing and awesome moblie. I like very much movie...............goood. Very great. Best movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dsaachi",
        "review_rating": "1",
        "review_title": "Terrrrrrible Trash.....",
        "review_detailed_main": "Akshay Kumar should stop acting in films. He's horrible in period drama with irritating moustache. VFX can't save this movie. It's better to read history of Prithviraj than spending valuable time behind this epic disaster.\n\nIMDB should provide option for '0' rating too!\n\nWaste you time if you really wants to waste it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kalyanpandey-32805",
        "review_rating": "1",
        "review_title": "One of the biggest Disaster movies of this year",
        "review_detailed_main": "One of the most pathetic period movies. Akshay hadn't done justice for thi role, he is totally unfit for this role looking like a cartoon. Dialogue screenplay cast was below average."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "thecharan-48280",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "The movie was very good and you can only feel all the tast of movie on big screen only so just go and watch. And watch a movie as a audience not as a reviewer or any leftist or rightists and enjoy the movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "aashiqsuresh",
        "review_rating": "1",
        "review_title": "He is not fit to this role",
        "review_detailed_main": "And they are manipulated the history to nowadays politics. History is history no one can rewrite it. And akshay is not fit to this role he doesn't have that much image or bodyshape to this kind of films. But the screeplay fx fight scene is good to see nicely directed."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "maheshkumar-92214",
        "review_rating": "10",
        "review_title": "Crime story",
        "review_detailed_main": "I have read historic books and poetries but the movie is something my kids can watch too.\n\nI really liked this movie awesome and good................................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "singhofkorba-44098",
        "review_rating": "3",
        "review_title": "Not a very well direction",
        "review_detailed_main": "Prithiviraj was not famous because was romancing or singing or won just one battle against gori. The actual life and pride of the samrat was missing. Because of the direction it will look like shortcut glimpse of the kings life in Bollywood's view. Mansi wasnt fit for the role of a princess. Akshay and sanjay did a good job but overall pretty boring movie. With so much songs and more romance they made it worse. It could have been alot better if Bhansali would have done it. One time watch that too when it comes of ott platform. Do not waste money on buying ticket for this one."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "myp-04130",
        "review_rating": "8",
        "review_title": "FABULOUS story",
        "review_detailed_main": "In total awe with the direction of Dr Chandraprakash Dwivedi, he has absolutely nailed.this is a great day application I am very much for your support the most important."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vishalsuperx-27325",
        "review_rating": "1",
        "review_title": "FAKE INDIAN HISTORY",
        "review_detailed_main": "1. The film is not show True history just like NCRT book\n\n2. Akshay Kumar very bed performance\n\n3.this filme show mahemude Gori good person He is not terrerist\n\n4. The film focus on Love story not Indian history and culture woriaras."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ghosh-mallar",
        "review_rating": "1",
        "review_title": "Historically inaccurate trying to glorify the invader Muhammad Ghori",
        "review_detailed_main": "Promoting its agenda of false history of glorification of Islamic invaders. Also distortion of history all through out.\n\nDo not watch spend your money on feeding some beggar. In fact this nice idea was given by Akshey the protagonist himself. Where in an interview he actually advised Hindus not to do pilgrimage of our Holy temples rather spend the money to feed the poor. So we should apply his idea on his movies first.\n\nNote: At all our Holy sites we feed the poor in massive numbers."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rajrohit-32225",
        "review_rating": "2",
        "review_title": "In book story is good but in movie Akshay sakal is looking cartoon",
        "review_detailed_main": "Prithvi raj Chauhan story virta is excellent but in movie performing role of prithvi raj Akshay skl is dumb.so it is good to read book rather than this cartoon movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "chandrakantsharma-47165",
        "review_rating": "10",
        "review_title": "GOLDEN AGE OF HINDI CINEMA IS BACK 🔥",
        "review_detailed_main": "CLASSIC HINDI CINEMA IS BACK 😍\n\nwhat an authenticity it was missing in Bollywood since decades 🔥🔥\n\nPowerful dialogues and screenplay 👏🏻💥💥 Take a Bow #DrChandraprakashDwivedi 🙌🏻🙌🏻\n\nCan't hold back my tears. 🚩 Akshay kumar 👏🏻👏🏻👏🏻👏🏻\n\nAkshay Kumar was born to play the role of the great Samrat Prithviraj Chauhan and a great Background score 🔥 gives you goosebumps in every scene.\n\nAll period films released before(Bhansali films) looks so fake and plastic in front of this CLASSIC PIECE OF ART.\n\nI can watch it all day. 🔥🔥🔥🔥\n\nKudos to makers for bringing back The Pride of Hindi cinema 🇮🇳\n\nCan't wait to watch it Again 🎉🎉🎉"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "amarankit-69293",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": "Last night went to theatre and utterly DISAPPOINTED by the movie Samrat Prithviraj... Chandraprakash dwivedi what a blunder have you done in the movie... Akshay's Samrat Prithviraj is less Chauhan and more kumaar...Can Akshay Kumar, who only gives 40-50 days to a movie do justice to this role? Definitely not,sir... he as prithviraj doesn't suit.the cast of the movie didn't express the courage that the rajputs possess since the ages...the valour, courage,war strategy of rajputs were missing...In 12th century in India, main language was sanskrit, hindi and marwadi,In this movie a lot of farsi & Arabic words were used by samrat and queen... In Rajputana's era Queen or Princess didn't dance. Salaam and hugs by prithviraj to mahammad ghori is not acceptable,WTF...he was samrat not a regular guy...History has been distorted badly... Jauhar and unnecessary songs have been added... main content and story hasn't been focused on... Everyone is aware of how great CHAUHAN'S were but the movie failed to justify his greatness. Samrat Prithviraj is worshipped as our God and this picture has disrupted his valour and sacrifice.\n\nGreat life of Samrat Prithviraj Chauhan needed a screenplay that celebrated his journey, pride and valour, but this movie failed in every department... The brave Indian warrior deserved a better film... Jai bhawani."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "moniedas",
        "review_rating": "8",
        "review_title": "Great King Akshay rocks Akki as Prithvi",
        "review_detailed_main": "Sometimes, we watch a movie for its cast, Or its sets. Or its songs. Or sometimes for the action. Well then, viewers are in for a treat because.love this movie is a great movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "speedhandwork",
        "review_rating": "1",
        "review_title": "Very boring",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "umarfarook-21689",
        "review_rating": "10",
        "review_title": "Adventure",
        "review_detailed_main": "Son of India , a true warrior.wonderful Prithviraj movie very action and very fantastic drama movie i like the best dhamakedar warriors movie ever seen online free."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "maheshvk-30454",
        "review_rating": "1",
        "review_title": "Read this",
        "review_detailed_main": "Ab Bolo Juba Keshari. This character is not as great look as actual Prithviraj Chauhan. Akshay Kumar looks more of Bala from Housefull than Samrat. Disappointed by casting. Shahid Kapoor was much better in Padmavat compared to Khiladi Kumar.\n\nKumar failed to portray the legendary character."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pruthvirajh",
        "review_rating": "3",
        "review_title": "Nothing in this movie",
        "review_detailed_main": "They didn't show anything in the movie, no proper war scenes or bravery of samrat prithviraj nor they the love... I didnt no that what the director actually want to show about prithviraj when he didnt show anything."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rahulkoyalkar-24188",
        "review_rating": "1",
        "review_title": "Fake story glorified ghori",
        "review_detailed_main": "Director is like pgo tv Director screenplay waste 300 crores wasted.akki pogo tv catoon even better than akki if u want real talent of hindu king watch sher shivray n pawakhid movie u can understand wat is the glory of."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "nakshsinha",
        "review_rating": "10",
        "review_title": "Heart touching",
        "review_detailed_main": "Prithviraj a true legend....... Proud second for all of the Hindus that there courageous Samrat Prithviraj film has been made and released... Thankyou team YRF."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Jimmyraajkumarjaiswal",
        "review_rating": "2",
        "review_title": "Ordinary period film",
        "review_detailed_main": "Highly ordinary period film i have watched in all aspects such as dialogues, screenplay , background score.there have been period drma i have watched in television which looks much larger than."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kgdvngrgv",
        "review_rating": "8",
        "review_title": "FABULOUS story Mindblowing Characters",
        "review_detailed_main": "The opening and closing scenes of the movie, and everything in between simply keeps the viewers glued to the screen The dialogues of Samrat Prithviraj are strong, delivered by Akshay Kumar in a way only few others can. I would watch it again only for those punchlines."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "syedmeheruddin",
        "review_rating": "1",
        "review_title": "Non sense - Manipulated history",
        "review_detailed_main": "Boarding movie. Manipulated history. Performances are good but the story lacks authenticity. Could have done a better homework. Comparing to the other movies released in the recent past, this one falls far behind them technically."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pummykhn",
        "review_rating": "10",
        "review_title": "Awesome story",
        "review_detailed_main": "The trailer has glimpses of the phases of a man's life and when it is about the last Hindu ruler Samrat Prithviraj ,a definitely must watched Prithviraj full entertainment movie wonderful fantastic movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "makhindustani",
        "review_rating": "1",
        "review_title": "Akshay Kumar the great comedian, King prithvi raj is great warrior is",
        "review_detailed_main": "Comedian can't justify character of a great warrior king. Remember king bala.\n\nAjay devgan would have been better. And story is little modified for money."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "zabikh",
        "review_rating": "1",
        "review_title": "History can be change easily and this is prime example",
        "review_detailed_main": "I didnt watch this movie till now still i rate it 1 star becouse the trailer was trash in akshay kumar role and this movie rumors are there that this doesnt tell history its totally fictional movie its just like fictional historical tv serials like many fictional history serials dont watch this movie for curiosity to see akshay kumar in prithviraj roll."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "convitoshanu",
        "review_rating": "1",
        "review_title": "Meaningless waste of money",
        "review_detailed_main": "I wonder why the hell they wasted 300 crores to create such mess in terms of script, acting, direction. Background score is needlessly overdramatic & pointless dance number will make you laugh with same old constipated expressions by actors and dull dialogue delivery.\n\nThe dance by Sanyukta (Yoddha ban gyi main) before commiting Jaharbrata will give you serious cringe & perplex you to a point that how committing suicide makes you a soldier.\n\nI find it really hard to understand what this film really is. But I grasped that what this film is really not. Not recommended at all, give it a skip and save your money and time. 🙏 #successfullywastedtime."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rahulpanari41",
        "review_rating": "10",
        "review_title": "Beautiful.. Best Periodic Drama ever made in history of Indian Cinema",
        "review_detailed_main": "Beautiful.. Best Periodic Drama ever made in history of Indian Cinema.... Akshay kumar at its best.. Blockbuster Movie... Must Must Watch for every Indian."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "manojswami-31278",
        "review_rating": "1",
        "review_title": "Worst film",
        "review_detailed_main": "Downloaded this movie and watched it in mobile, Akshay Kumar acting is not good. He looks like a jocker. I don't recommend this movie to watch in theater."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "tp-87575",
        "review_rating": "10",
        "review_title": "Different , must watch movie",
        "review_detailed_main": "This movie is for all Indians , for all who loves his motherland . Beautifully depicted , rich storyline , acting are really good .\n\nI love watching it. Do watch for you . For the goodself within you ."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "soumitromanmalviya",
        "review_rating": "1",
        "review_title": "Misleading and Not at all true to the history",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ravikantmdh",
        "review_rating": "10",
        "review_title": "absolutely amazing",
        "review_detailed_main": "Akshay rocks again ...with a boom Prithviraj was a full 5 star movie with all power packed characters and amazing dialogues and I liked the one fact the most that they stayed true to the story. As a rajput, I have learnt about the history of Prithviraj and I think that all characters like Chand Vardai, Kaka Kanha, Sanyogita, Mohammad Gori - each and every role was played perfectly. Loved it!!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "skykaushal",
        "review_rating": "4",
        "review_title": "Rushed, overacting, unjustified , wasn't required to make it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "iemkamran",
        "review_rating": "1",
        "review_title": "False History, Boring movie.",
        "review_detailed_main": "They try to twist the story with misleading Prithviraj chauhan as he died in 1192 & mohammad ghori died in 1206 but in movie chudan killed muhammad ghori 😂😂. Pathetic..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shubhamhell90",
        "review_rating": "1",
        "review_title": "Historically inaccurate",
        "review_detailed_main": "It is a historically inaccurate movie. Utterly disappointed by Chandraprakash Dwivedi.\n\nJai Chand did invite Ghori. It is historically inaccurate.\n\n\nPrithviiraj was brutally murdered because he refuses to convert not because he refuses to bend\n\n\nI can go on and on. All and all, it is an utter disappointment but expected. You can't expect anything good from Bollywood especially when it comes to historical dramas."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "satyanshtrivedi",
        "review_rating": "10",
        "review_title": "MAKE SURE TO WATCH IT IN THEATERS",
        "review_detailed_main": "The scale of the movie is so big that you should definitely enjoy it in theaters. The war sequences, the costumes, the set, everything is so well portrayed. I'm not saying that movie is flawless, but it is definitely worth yor money."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ashikmokami",
        "review_rating": "5",
        "review_title": "Gladiator Remake in the name of History",
        "review_detailed_main": "The film often suggest you that something will happen but you will feel loss and disappointed. Songs are not good, they made the actress dressup to war only to commit pointless suicide. Basically it the remake of gladiator. Everything is fiction and no real history is in this film."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "yahsuu882",
        "review_rating": "9",
        "review_title": "Fantastic movie",
        "review_detailed_main": "4 STARS FOR 4 POINTS ABOUT SAMRAT PRITHVIIRAJ. 1) Akshay Kumar's acting is top notch and keeps you captivated through the movie 2) Cinematography of the film was looking awesome.\n\n3) Sonu Sood and Sanjay Dutt as supporting characters have done a great job 4) The story has been shown perfectly. Important details have been covered. Won't let you get bored for even a second."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shubhamnicin",
        "review_rating": "4",
        "review_title": "MISLEADING",
        "review_detailed_main": "Misleading and twisted history... Base storyline is correct ... rest is bollywood masala which fakes everything... every actors acting was nice except alshay kumar..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "Bai7628",
        "review_rating": "9",
        "review_title": "Amazing cinematography",
        "review_detailed_main": "If I had one word to explain this film, it would be MASTERPIECE. Full power battle scenes, action on point, even the villain looked so good, totally believable.. Manushi looked like a true princess. Sanjay and Sonu are ace actors and they prove it with every single performance. Amazing cinematography, music by SEL, great costumes - I have literally no complaints for this Bollywood movie. Loved it!!"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "viqarahmed53",
        "review_rating": "1",
        "review_title": "Filled with lies",
        "review_detailed_main": "Ghori died in 1206 but Chauhan died in 1192. The whole movie is a lie. Poor dialogue delivery, truly defames Prithviraj Chauhan in every way due to the lies..."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "khanboy-85034",
        "review_rating": "1",
        "review_title": "waste of money",
        "review_detailed_main": "Totally waste of time and money.akshay never fit for this role and direction is very bad.padmawat is thousand times better than this..fake fictional story."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ammuchaudary",
        "review_rating": "1",
        "review_title": "Lies, historical inappropriateness, cringe",
        "review_detailed_main": "Amar Chitra Katha has more facts. Many factual errors. If you want to learn some history by watching this movie, don't.\n\nAkshay Kumar didn't do any justice to the role of a powerful warrior king, especially his voice didn't suit the dialogues. The scene writing and dialogues are cringeworthy. Waste of $$"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bd-46130",
        "review_rating": "8",
        "review_title": "Great Direction Love the VFX",
        "review_detailed_main": "The choreography and cinematography are just stunning. Dwivedi for making this great grand movie on our warrior the great prithviraj chauhan.love this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhipodar",
        "review_rating": "1",
        "review_title": "No depth in movie",
        "review_detailed_main": "This movie was made in 42 days. This reflects in acting and script. No seriousness in acting. Script is very weak. Songs appear out of nowhere. Actress is bogus. Mohammad Ghori is doing absurd acting and dialogue delivery is rubbish. Requesting Akshay Kumar to stay in Canada and stop torturing audience."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "bantegirish",
        "review_rating": "10",
        "review_title": "Our brave history...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "yourz_sanju",
        "review_rating": "5",
        "review_title": "Didn't live upto the expectations",
        "review_detailed_main": "When the first teaser came out, The movie created a huge hype. When the first trailer came out it's sort of felt bad though. When I watched it, Didn't live up to my expectation.\n\nI'm not good with history so I'm not gonna dig out anything and say that this from distorted any kind of historical events. I'm gonna consider this movie a motion picture based on historical facts. It seems like the film lack of proper writing which caused the overall crafting of the film to be bad as well. Majority of the artist involved in the film have done really good in terms of their part. But the film does not keep you engaged even after you see a good stunning visuals. Background score of the film it's not emotionally strong. There's only a couple of songs that you may like or might want to listen but the rest are OK.\n\nI watched this phone on Amazon prime and I can say that it's not even worth wasting time to see it on there."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "vvishnusharma",
        "review_rating": "10",
        "review_title": "Best movie based on history...ever",
        "review_detailed_main": "Best movie, proud on our heroes. All in the movie have done good performance specifically sonu sood. Akki is always good. Last is so good you eye will be full of tears at last. Everyone should watch the movie in theaters, This movie deserves this."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "avinashsn-47642",
        "review_rating": "1",
        "review_title": "Pathetic Movie",
        "review_detailed_main": "Please don't watch this Mis-informed mess of a movie. I don't know what 18 years research the director did. Maybe he did, and producer/ protagonist might have influenced to mess the whole thing up. Please don't watch this, else you will not only waste your hard earned money, but you will leave the cinema hall disappointed badly.\n\n1/10 rating."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "turyalzte",
        "review_rating": "1",
        "review_title": "Trash Movie - Copied Scenes",
        "review_detailed_main": "Scenes from the movies Troy, Gladiator, and brave heart are copied and shows a false history against the Muslim leader. Not worth of watching................................................................................................................................................................................................................................................................................................................................................................................................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "waseema-71334",
        "review_rating": "1",
        "review_title": "WhatsApp University movie",
        "review_detailed_main": "All the storyline and scenes are taken from WhatsApp University. There is no truth in that. Akshay kumar has now become the flop kumar and Lie kumar. Dont watch his movies."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "noniedas",
        "review_rating": "8",
        "review_title": "Mindblowing Characters Played Story of a Great",
        "review_detailed_main": "Samrat Prithviraj songs are captivating, and HOW! Each and every song has a distinct feel to it which translates into the visuals too. The stunning visuals in this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rohitelevate",
        "review_rating": "1",
        "review_title": "Akshay Kumar is a total Misfit",
        "review_detailed_main": "It has to be a flip, Akshay Kumar was a total misfit for the role, Manushi Chillar did better than Akshay Kumar.\n\nAll others Actors tried there best but Khiladi Kumar didn't try to put any efforts as his focus is to finish the film in 30 days no matter how he performs.\n\nTotal disappointment. I wish I could get my money back."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ngosh-39244",
        "review_rating": "8",
        "review_title": "Great Direction Love the VFX Sher Aya Sher",
        "review_detailed_main": "A historic movie that the makers take risks to make deserves an applause, and a standing one at that. This movie made me feel proud to be an Indian.l this movie."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "pradeepsemwal-23303",
        "review_rating": "2",
        "review_title": "Low level Comedy movie",
        "review_detailed_main": "What a comedy movie.... Bala... Not like that which I expected before going to watch it....mostly akshayakumar role... Much suited like bala in his previous movie...."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "susjj-26581",
        "review_rating": "9",
        "review_title": "Enjoyed it to the most. Great job",
        "review_detailed_main": "According to me this movie has a Climax that will bring you to the edge of your seats. The film overall is all things Gripping & Power Packed. Each and every character has played their parts in the best way possible. I wanted it to be longer honestly because i was not satisfied with just 2 hours and 30 mins. I really thought it to go on for a little longer. Kudos to the entire team for making such a crazy film for us movie lovers. Enjoyed it to the most. Great job."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "govindsaini-55480",
        "review_rating": "1",
        "review_title": "0/10",
        "review_detailed_main": "Everyone was in a hurry. Could've better acting and cast. Even Sonu Sood could be better prithvi than Akshay. Playing with the history and prithviraj's heroics. Manipulated a lot."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "WorldMovie99",
        "review_rating": "3",
        "review_title": "Average Historical film !",
        "review_detailed_main": "Akshay Kumar is bad as Prithiviraj , the Delhi-pati. He is expressionless , displays the similar facial features to represent different moods. The mood of stability , leadership , anger , respect, romance, bravery to name a few. The role of Kannauj Pati is bad too , developed immaturedly in the form of a father , as a husband , as a king , as an worthy enemy and so on. The lead actress is well chosen but didn't have the gripping flavour. And the song ? No No dear , Our hindu king doesn't do all the masala things in the desert. Lastly the Indian heritage issue didn't touch the intention ie the national sentiment.\n\nThe set design is impressive , have spent a good amount of money in designing the architecture , costume. Also the film explicitly shows the weakness of Indian rulers despite strong traditional roots. But the movie misses the character development highly , which makes it bore. Nowadays Bollywood needs a master flavour in history re-telling esp the characters , in order to connect to the people. It deserves an average rating of 5/10 but rating it 3/10 to balance the total rating. A 53/100."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "parmeshwarshaw",
        "review_rating": "1",
        "review_title": "Head pain",
        "review_detailed_main": "This is not a prithviraj movie... This is a housefull 5🤣😆 Canadian kumar really in this movie Look like nalla bala singh samrat... This movie is waste of time & money...🤢👎"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "trishsuraj",
        "review_rating": "9",
        "review_title": "Masterpiece",
        "review_detailed_main": "What a movie it is. One of the best movie of Akshay Kumar till date. A movie which shows the real value and Culture of Hinduism. Great Hindu king Prithviraj Chauhan, what a legend he was."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "apupaul",
        "review_rating": "1",
        "review_title": "He look more like Bala",
        "review_detailed_main": "He did not suit in this role at all. Akshay should have more prepared for this role. Dialogue delivery is poor, talafuz was more mugal instead of Hindustani. Better come in your commedy avatar only,"
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "shankerravikumar",
        "review_rating": "10",
        "review_title": "Great movie",
        "review_detailed_main": "Our youngster these days are in veneration of superheroes of west. Instead here are our superheroes. It is best Bollywood movie of 2022 casting by my fav hero akshya kumar."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "dhirendrasinghchanpawat",
        "review_rating": "1",
        "review_title": "Totally destroy the characterstics and bravery of Prithviraj Chauhan.",
        "review_detailed_main": "Destroy history by making such movie it is bollywood character to show us Faminisinsm . It totally destroy glorification and the bravery, royalty of Shri Prithviraj Chauhan.\n\nIt is manipulation, and prank with ours."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "kamalshrma-01559",
        "review_rating": "10",
        "review_title": "Great concept",
        "review_detailed_main": "One who advocated for women in the 12th century Samrat Prithviraj bed seen samrat prithviraj movie i am happy superb and good.............................."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "rohanbaby-65954",
        "review_rating": "5",
        "review_title": "One time watchable but not really entertaining.",
        "review_detailed_main": "First things first, Akshay kumar doesn't fit into the role of king in this movie. First half of the movie hardly gives you thrill, it barely survived because of dialogues. Second part there are many places where you literally feel sleepy. And last fighting scene is the only best part of the movie. If you are looking for thrill and entertainment then this movie is not for you."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "abhisheksingh-06496",
        "review_rating": "1",
        "review_title": "Samrat prithviraj",
        "review_detailed_main": "Akshay Sir did justice to the role... Loved the way the story has been presented. Its has all the elements in the story. I must say its a must watch...Dont miss to watch this epic movie. Really loved it."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "mahim-10968",
        "review_rating": "1",
        "review_title": "Akshay need to perform better in his next movies",
        "review_detailed_main": "He is not involved in his character.\n\nThey took better cast bust the doctor can't use them properly Any how i didn't get much movie experience in theatres."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "krushcopra",
        "review_rating": "10",
        "review_title": "Fantastic movie",
        "review_detailed_main": "A min trailer says it all. Wonderful movie I really love this movie so much I recommend this to all of you this movie is worth to watch this is one of the best movie of 2022."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "suhas-61779",
        "review_rating": "1",
        "review_title": "Waste of time and money",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "ganiraju-09053",
        "review_rating": "10",
        "review_title": "Adventure",
        "review_detailed_main": "I really highly recommend for everyone very nice movie watch online very fantastic and interesting Prithviraj Chauhan , one took care of a women's dignity in 12th century , a real hero."
    },
    {
        "movie_id": "tt9637132",
        "movie_name": "Samrat Prithviraj",
        "movie_rating": "5.6",
        "review_username": "sohailfj",
        "review_rating": "1",
        "review_title": "Akshay sir please time in every movie 🙏🙏",
        "review_detailed_main": "This movie is totally illogical first of all prithviraj chauhan died in 1192 and mohammad ghori in 1206 but in akshay kumar movie prithviraj chauhan killed mohammad ghori how's that possible they digging hindi cinema into scrap why they making people so fool and why they waste audience money also they spreading wrong information about history they misleading people and creating controversy on religion this is the actual reason bollywood getting worst they distracting people's for name of history they literally begging and promoting wrongfully about their movie and asking politicians to promote for film now audience knows who's right and who's wrong this is why bollywood falling and south cinema rising and bollywood going to be disappear soon because of these types script and direction and lot of over acting they fighting on twitter and other social media platforms to fool audience afterall this movie is scrap waste of money and time don't waste your precious time on these types of movie maybe director was drunk while when he was shooting the film and writer was taking drugs and all actors we're taking advantage, before you watch the film read all reviews you might know well about the film."
    }
]