[
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "manishupamman",
        "review_rating": "9",
        "review_title": "Love the God!! God is our friend and stays in humans not in stones!! Superb subject",
        "review_detailed_main": "We have always been taught that God is our father always fear God. But this movie say God is our best friend so love the Almighty. Excellent movie with hilarious content.\n\nMovie is story of small Gujarati businessman Kanji Bhai superbly played by Paresh who doesn't believe in God. His life take a big turn when he lost everything in earth quake, Insurance company refuses to claim saying this is act of God and can't be claimed.Thus he decided to take big decision and movie is all about that decision.\n\nAkshay played role of modern God. If you are thinking that why God is modern go watch a movie you will find a meaningful reason behind it. Akshay is excellent too.\n\nMovie criticizes the big business that is based on selling God or we can say playing with emotion of people.\n\nGod is not in stones or temples. God is in emotions,humans. Do not donate big amount to temples just help the poor and God will be happy. Don't waste your time searching god here and there instead search in humanity. Be fearless and love the God.\n\nMust watch"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "nisakki9",
        "review_rating": "8",
        "review_title": "OMG - Oh My God!... Must Watch For All Ages.",
        "review_detailed_main": "OMG Oh My God! Is a wonderful film with an amazing message that everyone should apply in their lives!\n\nParesh Rawal delivers an outstanding performance, one of his best till date.\n\nAkshay Kumar is top notch you can't think of anyone to do his role in the movie.\n\nMithun Chakraborty is fabulous as a fraud preacher.\n\nOm Puri, Govind Namdeo, Mahesh Manjrekar and rest have played their roles perfectly.\n\nThere are some glitches in the movie like abrupt camera work but it has nothing to do with the story or screenplay.\n\nGrip makes a movie perfect; That's what happens here, you'll get glued to your seats start to end!\n\nI don't know how the play was, but I simply loved the movie.\n\nAfter Watching OMG! My religion is OMG! Oh My God!\n\nI'll rate it 8/10 Unmissable especially for \"so called\" religious people wasting time, money, milk and oil at temples."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "aj_akash",
        "review_rating": "9",
        "review_title": "What a wonderful movie",
        "review_detailed_main": "First time i thought its a copy of Bruce almighty or something, but no, its a whole different concept. I think everyone should watch this movie once.\n\nThis movie tells a lot of reality which we never know or never wanted to know.\n\nBut I think Umesh has done a very good job. Even Paresh Rawal has done a great job.\n\nThis movie is worth watch in theaters. Teaches lots of stuff, depends on you what to take or not.\n\nGuys don't think anything, just go and watch.\n\nI ll suggest tell your parents to watch this movie as well.\n\nI don't want to criticize other movies which copies the directions or screens from Hollywood, but this i feel, everything is original.\n\nYes some of the time you will feel, \"aisa real life me kabhi nahi hota\". but guys this is movie, and you can learn and take what you want."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "SouravChakraborty_P1",
        "review_rating": "10",
        "review_title": "Even God will say Oh My God What A Movie",
        "review_detailed_main": "OH MY GOD Its the best movie of the year along with Barfi Story screenplay acting everything is perfect. Paresh Rawal and Akshay together created magic as always. Songs are awesome. This movie is the perfect example of how a movie can be good without heroines and item numbers, or action and romance. Paresh Rawal should get national award for this movie,he gave his best. Akshay had a short role but he was best, he was perfect for the role of Krishna. I thought it will be a comedy movie, but after watching i will say the movie got everything, comedy, emotions, love, humanity. This movie is a delight for movie lovers, only few biased haters can dislike this movie. Entry of Akshay Kumar was awesome. Mithun was awesome, loved his character, but Paresh stole the show along with Akshay. Even God will watch this movie and say OH MY GOD what a movie"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "jmoneyjohal",
        "review_rating": "10",
        "review_title": "One of the most path breaking bollywood films ever!!!!",
        "review_detailed_main": "WOW, what a film, I was pretty much speechless after i exited the theater. The message this film gives is that god is in every human being, then why do we go looking for him in mandhirs, churches, mosaics, gurdwaras, etc Why has god and religion become a business, why do we spends millions and billions of dollars at religious places as people when we can take that same money and help the poor, won't god be more happy then. This and many more messages are conveyed in this movie through characters, like Kanji Bhai, Krishna, etc Another really plus point about the film is that it is told in a light hearted way, in a comedy, the film isn't very preachy and still conveys its beautiful and real message. For me when it comes to performances Paresh Rawal has just done such an amazing job, he deserves all the applauds, accolades, awards, in the world for his portrayal as Kanji bhai. Akshay Kumar as always is very good in a small but important role, his and Paresh's chemistry is just too good. Other notable performances Mithun, was really good as the sadhu, and so was Govind Namdev. Music was good and suited the film very well. All tech aspects were just perfect. Umesh Shukla the director is the heart of the film and he has done an incredible job, he deserves, a national award for his efforts, he was just that good. A special mention for the amazing dialogues very smart and well written,\n\nSo all in all this is must watch film for not just the people in India, but for everyone in the world. A masterpiece film, this should be India's official entry to the Oscars. its that good and beyond one of the best movies ever made in bollywood. 10 out 10 rating"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "parthearthdave",
        "review_rating": "10",
        "review_title": "An intelligent comedy",
        "review_detailed_main": "Oh My God is based on successful gujarati play Kanji Viruddh Kanji. Oh My God is a story of Kanjibhai who does not believe in god. One day Kanjibhai's shop gets destroyed in earthquake. Then Kanjibhai complains about God in court.\n\nParesh Rawal is absolutely splendid as a Kanjibhai and his arguments about reality of religion will make you think for a while. Akshay also plays the role of lord Krishna superbly. Surprise package of the film is Mithun Chakraborty. His comic timing is bang on.\n\nFirst half of the film is filled with some good comedy sequences and second half will make you amazed with some heart touching and heart shaking scenes. Main USP of the film is its unique concept. The film ends with a noble message. Story is perfectly directed by Umesh Shukla and he deserve a big cheer.\n\nOh My God is a must watch film for everyone because intelligent Kanjibhai and modern lord Krishna cant be missed."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "shankhayan-1996",
        "review_rating": "10",
        "review_title": "The Best movie so far",
        "review_detailed_main": "Oh My God!!!! yes this is what i have to say after watching this movie. Its just superb,it had everything,comedy,stunt,action,fiction,a serious message and a deep emotional connect. This kind of film is a rarity in modern world. This film not only entertains but also enlightens people mind.You are bound to ask certain questions to yourself after watching the film. It thought provoking and your mindset may change after watching the movie. Everything is said in such a gentle and comic manner that the film does not bore a bit. As per acting is concerned well,u can say nothing to the performances by all the character but to applaud and appreciate. Paresh Rawal in the protagonist''s role has been out of the world,superstar Akshay Kumar portrayed the role of Sri Krishna outstandingly,Mithun,Chakravarty,Govind Ramdeo were just fantastic and all other supportive characters lend tremendous support. The main plus point of the film is its novelty in the story,its acting,its direction and the plot.. You are surely getting amazed after seeing such brilliant film and if u miss this then surely you are missing the best Indian film ever. I can and i think no one can give anything less than 10 to this film."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "amritchhetri06",
        "review_rating": "10",
        "review_title": "oh my god",
        "review_detailed_main": "its is the best movie in the resent time with descent story. everyone is gonna love this movie. it really impress me,,,\n\nThis movie is the perfect example of how a movie can be good without heroines and item numbers, or action and romance. Paresh Rawal should get national award for this movie,he gave his best. Akshay had a short role but he was best, he was perfect for the role of Krishna. I thought it will be a comedy movie, but after watching i will say the movie got everything,comedy, emotions, love, humanity.\n\nEntry of Akshay Kumar was awesome. Mithun was awesome, loved his character, but Paresh stole the show along with Akshay. Even God will watch this movie and say OH MY GOD what a movie"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "yogi1989",
        "review_rating": "8",
        "review_title": "OMG! Oh My God --- Must See",
        "review_detailed_main": "Movie is based on a person who is an antique shopkeeper name Kanji sells the idol in Chor Bazaar and main thing he doesn't believe in god one day what happens his child was made an Krishna in Dhai Handi what we say an Govinda function was going on. this was the point where picture take twist, he saw his child on TV and go to that place then how to stop that function and make his child to go home as his exam was to be happen next day that an instant he got clicked and he announces that Siddeshwar Baba the character in movie that the Baba wants to be get eaten Curd, Milk etc buy the people so all rush instead of watching Dhai Handi goes to feed the Baba and like that he take his child to home and that instant that Baba curses him that he would be punished by the lord and next day an earthquake takes place at Chor Bazzar and the tragedy part that only the Kanji's store got demolished ..........See Movie to know what happens!\n\nThere a lots of fun and emotions during the whole Movie and one major thing You wont get bored at all at the End ...\n\nThis Movie actually pass the message that person should believe in helping other poor person rather than feeding a lord Murti by donation ....!!!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "rangdetumpy",
        "review_rating": "",
        "review_title": "A rightful War against Blind Faith,superstition & rituals",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "bobbysing",
        "review_rating": "7",
        "review_title": "Though not a good adaptation but still it is fresh and has a valuable lesson to teach, so do watch it!",
        "review_detailed_main": "First clearing the air about its inspired status, the team clearly accepts its sources in a detailed caption in the titles, making it all official this time which needs to be appreciated. The caption said that the film is based on a Gujarati play, 'Kanji Virrudh Kanji' or 'Krishan Vs Kanhaiya', which was adapted from the original film \"The Man Who Sued God\" (2001) and then there were two more lines written below it which I couldn't read as it stayed for only less than 2 seconds on the screen. Still it was good to see that the right kind of credits were given to the original creator of the idea as it should be.\n\nAs an Adaptation of the original film \"The Man Who Sued God\" (2001) The film is actually developed from the basic idea introduced in this lesser known Australian venture featuring Billy Connolly in the lead. And if one has seen the same then he is sure going to give a mixed response to OMG as it somehow reduces the impact generated by the original. Reason being, that in the English film the proceedings just keep moving in and out of the court and that's it. There are no separate tracks of various God-men and there is no Real GOD coming into Billy Connolly's home to make it filmy.\n\nIn the original we only have a case filed by Billy against the God (involving the Church) catching the phrase \"Damages caused by the ACTS OF GOD\" in the Insurance Company's papers and then its all about the court and arguments given for or against the claim filed the applicant. In short, the film has everything focused on the logical points brought forward by the lawyers along with a beautiful insertion of \"A Sign from the GOD himself\" coming into the court-room towards the end, which serves as a pleasant surprise for the viewers.\n\nPlus the original had a brilliant culmination wherein Billy takes his case back, sighting a drastic conclusion for the society whether he wins or loses, which is sadly not there in this Hindi adaptation. Yet OMG scores decently on its own merit with its Indianised version of the concept which remains highly recommended even if you have watched the original flick or play.\n\nAs an individual film making a new breakthrough in Hindi Cinema. Looking upon OMG as an individual film for viewers who haven't seen the original English film or the Gujarat play, it is no doubt an appreciable attempt by the makers giving us something fresh and new which we have been loudly craving for. Moreover it can also be called a daring attempt by the team, considering our society's conservative state of mind which always gets active when it comes to RELIGION. So in that terms the film successfully manages to make us aware of the so called \"Religious Markets\" strongly functioning around us like big super-malls with different names and titles.\n\nDirector Umesh Shukla and his writing team adds many good entertaining punches which are able to make you think and laugh at the same time. Hence as it progresses, the viewer largely feels entertained as well as tickled regarding his individual religious beliefs, which I personally consider nothing short of an achievement by the entire team. But at the same time the film has its flaws too. It takes too much time to come to the point and then tries to add too many elements into the narration which were not required.\n\nFurther, its main publicized theme talking about the GOD himself coming on the earth, seems to be of no use in its basic storyline. So it thankfully remains far away from the Sanjeev Kumar classic YEHI HAI ZINDAGI (1977). In other words, Askhay posing as KRISHNA (and that too on a modified bike like BATMAN) does nothing substantial in the film and is just added to give an extra edge to the project commercially. OMG also loses its grip towards the climax with some overstretched references of Paresh reaching the hospital and then THE GOD giving him the healing touch, which in turn seems to be added just to satisfy the religious sentiments of the viewers emotionally.\n\nPerformance wise OMG is one of those few films which has its script as the biggest performer in its more than 2 hours of duration. However regarding the cast, Paresh Rawal is as always first rate carrying the entire film on his experienced shoulders, well supported by his entire cast namely Om Puri, Mahesh Manjrekar & Govind Namdeo. Akshay Kumar making his entry just before the intermission looks cute but the scene stealer in the second half remains Mithun Chakraborty as a Spiritual Leader (like never seen before). In reality the few Spiritual Icons shown in the film are based on some highly famous Guru's presently active in the country which you can easily judge without taking any names. Musically OMG doesn't have much scope but even then the producers have added an item song \"Go Govinda Go\" to en-cash the festival season featuring Prabhu Deva and Sonakshi Sinha dancing to the beat energetically. Cinematography and Background Score just serve the purpose well making a decent impact along with the minimal special effects used to showcase The GOD.\n\nIn the last century, New Age Indian Spiritual Masters like J. KRISHNAMURTHY and OSHO kept saying this for many years throughout their life but very few heard them resulting in the present chaos in the country and world over. So here is OH MY GOD giving the same message to the people once again but deep inside I also know that the situation is never going to change for the very reason that,\n\n\"We all are taught to be GOD FEARING and not GOD LOVING people by our so called Religious Teachers!\""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "smartrajas",
        "review_rating": "9",
        "review_title": "A Brave Attempt!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "7",
        "review_title": "It has got 'theory of god' wrong.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "marc5477",
        "review_rating": "4",
        "review_title": "Takes itself too seriously.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "aakaraug1989",
        "review_rating": "10",
        "review_title": "A Reformist and a revolutionist movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "gauravkainth",
        "review_rating": "10",
        "review_title": "Movie that enables you to be a better man",
        "review_detailed_main": "Just watched OMG ! Making a movie like this in India is extremely difficult but the director of this movie had everything written so well. This movie not only makes you laugh but its makes you think about the reality. JOB WELL DONE ! I would not like to ruin you movie by giving spoilers. It does not matter what country, religion or caste you are from this movie is a must watch it brings us closer to the reality of being better human. It enables you to be a better person. As mentioned in Geeta its all about karma. Rather then spending time and bribing god you should do good to make him happy. I come from a Hindu sikh family and this movie did not hurt any of my sentiments or my views. It was very well written and director knew that Paresh rawal would be the best person to start with. Akshay kumar was perfect actor to play the modern Krishna he conveyed the message very well. I have written very few reviews on IMDb, because a very few movies makes go that far. Everything I learned from this movie would stay with me."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "nitinmay-489-840600",
        "review_rating": "10",
        "review_title": "Best Movie of the Year",
        "review_detailed_main": "Best movie of the year. It's a ride within a soul! A treat which will force you to think what's actually happening in the name of God! Also One of movie which you can watch with your family.\n\nAll the actors were just too good. Paresh carried the full movie and must be the best person to play Kanji Bhai. Akshay was also a treat to watch did full justice to role he played. Akshay-Paresh are the lethal combination. They are best. Direction was also good. Some people might feel it offended but there is Special Disclaimer for those guys. Watch it with open heart and you will see it will leave a high impression on your life.\n\nHighly Recommended! Watch it or regret!!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ssaha_1234",
        "review_rating": "8",
        "review_title": "A brilliant concept: Not perfect but Excellent!",
        "review_detailed_main": "I have been hearing about this movie from my friends for a few days and at last decided to watch the movie last night. It was a wonderful experience I can tell you that. The strong content of the movie, acting skills of Paresh Rawal,Mithun Chakravarty,Om puri and others have made the movie a tremendous success despite some needless commercialization-tricks and a few weak dialogues. Yes, it is true that the concept of the story is not what we call \"original\" but the importance to point out our narrow perspective as to religious customs was necessary and the movie is successful in that sense. Although the character depicting \"GOD\" was unnecessary and probably was there to make a balance. But the movie has genuinely picked the \"villains\" as these religion-traders are everywhere twisting the original education of religion at their own will, for their own benefit. I would recommend this movie if you too hold humanity above religious fundamentalism."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ndesign84",
        "review_rating": "10",
        "review_title": "An honest take on life and religion",
        "review_detailed_main": "It takes guts to create a movie like this one.\n\nThis film has used humor in an extremely smart manner to deal with a with a very serious subject of Religion.\n\nI praise Bhavesh Mandalia & Umesh Shukla for their creativity with the story writing and the manner in which they kept the flow of the film very gripping.\n\nAnd of course one cant say enough about Paresh Rawal, he immerses himself into every character he plays and again in this film he acted his character beautifully.\n\nI highlight recommend this film to be watched by everyone, it will leave you loving your religion (regardless of who you believe in) even more."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "asharani-87118",
        "review_rating": "10",
        "review_title": "Best movie",
        "review_detailed_main": "This movie is on top of my favorite movies. First let me tell you just go and watch this movie. It will help you understand the basics of religion and everything which goes around you.\n\nI have watched this movie i think on third day after its release. I still regret why i didn't go for first day first show. Start of the movie is really good and in mid it becomes interesting and in the end you will understand what is religion.\n\nFew people may find it difficult to watch this movie but trust me watch it till end. I don't want to mention anything related to its story as it will spoil everything.\n\nParesh Rawal, Mithun Chakraborty, Akshay Kumar, three top actors of bollywood did a amazing job in acting. Awesome movie."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "GaneshKSalian",
        "review_rating": "",
        "review_title": "Oh My God:A Masterpiece!One of the best Bollywood movies of 2012!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "asmiarwen",
        "review_rating": "7",
        "review_title": "Something deep in everybody's heart has been put in this Movie!",
        "review_detailed_main": "If you know that Paresh & Akashay are in a movie it's gonna be a comedy. but this movie is far more different than comedy. Paresh is at his best. His logic's impress equally to everyone. on one side poor people are dieing of hunger & we are wasting our commodities of mare blind faith. Money making of the contractors of religion is ripped open first time in a movie. Everything is good. but a bit lack of direction is missing. Some things needed a proper artistic presentation. Like God's stunts would have been more creative. In the end the whole Talking could be staged in dream or something. But overall it is a must watch for a different reason other than entertainment."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "vineeththedominator-345-506184",
        "review_rating": "10",
        "review_title": "Lets awake and Break into the Future..!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "HarshButTrue",
        "review_rating": "7",
        "review_title": "My two cents: OMG! Oh My God has its heart firmly in the right place",
        "review_detailed_main": "If I'm honest with you people, I struggled to imagine how this adaptation would turn out as a feature film. Thus, I felt it would be most appropriate to go in with strictly moderate expectations. In the end, I'm pleased to report I came away very satisfied.\n\nThe film itself, directed by Umesh Shukla, is an adaptation of an Indian play, which itself was an adaptation of 'The Man Who Sued God'. The plot however has incorporated various Indian elements, and the film on the whole has a very desi feel, and doesn't at all resort to insulting religion. It was wise investment by actor turned producer Akshay Kumar.\n\nParesh Rawal plays Kanji Bhai, an atheist who is also a moderately respected shop owner who goes about his business in the typical middle-class way, until disaster strikes that is. Kanji, after being rejected by the Insurance company decides to start a court case in order to try and prove that his shop was in fact destroyed by divine intervention, but no lawyer is willing to take his case. On top of that, his family strongly disapproves of his decision. Om Puri now enters, followed by Akshay Kumar. Things get very interesting This film belongs to Paresh Rawal, who so effortlessly carries the film for more than 2 hours. His comic timing is to his usually high standards. Akshay Kumar and him make the on screen goings on memorable and entertaining, once again post the Hera Pheri films\n\nOf the supporting cast, Mithun Chakraborty impresses the most. The character of a swami (holy man) comes so naturally to him. Meanwhile, Mahesh Manjrekar also leaves his mark as the opposing lawyer, as does Om Puri.\n\nThe main highlight for me is how the courtroom scenes are dealt with. You get engaged in the drama, and the inclusion of humor makes them even more enjoyable.\n\nA problem is that the screenplay builds the picture very slowly for the first 15 minutes or so. You might get a tad restless here, but be patient. The remainder of the film will more than compensate, I'm sure.\n\nI'm unsure of the purpose of the song 'Go Govinda', which takes up a good few minutes. It looks out of place. The choreography is top notch, however, and the Prabhudeva-Sonakshi duo light up the screen to keep you entertained.\n\nThe cinematography is both good and consistent with the purpose of the film - it wants people like you and me to be able to relate to it easily.\n\nI should tell you that, as a theist, I didn't at all feel offended by the premise of the film. A small point, but important nonetheless.\n\nOverall this is an entertainer that urges you to think, and is quite right in its message.\n\n7/10"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "kruthi-63158",
        "review_rating": "1",
        "review_title": "Wrong message passed. Wish there was 0 rating",
        "review_detailed_main": "This movie just tries to demean the idol worship without truly knowing its value and tried to mimic some of the great spiritual leaders showing that all spiritual leaders in a wrong light. In Bollywood, people wearing tilak are always shown as villans, why? The makers of movie did not do their research did not deeply understand the concept of guru and the god. They should atleast spend an year or two with these enlightened masters and then make their judgements. Just showing what appears from the outside and influencing young minds is not right\n\nAnd coming to the movie stars, how are they earning money? Most of them are addicted to drugs. They are so miserable and havent understood any concept of god, gurus or the universe and earn money by showing our own culture in a wrong light. Please deeply understand why one should do idol worship before making such movies and influencing people in a wrong way especially youngsters."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mohitsamant",
        "review_rating": "10",
        "review_title": "For God's sake don't miss it!",
        "review_detailed_main": "This is clearly the most path breaking and thought provoking movie I've seen in recent times. India is a place where most people believe in visiting temples, donating money (and/or hair!) and performing rituals to please the Gods. The movie not only questions these practices but also leaves you questioning your own faith.\n\nThe movie is not anti-religion or atheistic. On the contrary, it presents a strong opinion about the existence of God. It is probably Paresh Rawal's finest performance since Hera Pheri (2000).\n\nThe premise is unique - A shopkeeper sues \"God\" when an insurance company denies his claim for his broken shop during an earthquake because earthquake is classified as an \"Act of God\" and hence not covered in the policy. The court then summons religious powerhouses from across the country as the case is accepted and argued in court.\n\nMithun Chakraborty is outstanding as the evil/sissy God man. Mahesh Manjrekar is brilliant as the shyster. Akshay Kumar as \"Krishna\" is likable for a change. It's definitely a must see for all age groups. Go get entertained and enlightened!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "gragtajar",
        "review_rating": "8",
        "review_title": "Better than PK",
        "review_detailed_main": "I think this movie is better than PK(2014). So it should be in the IMDb's Top 250 and not PK which is (during the writing of this review) at 246th position. I think such because both movies have same plot, more or less. But OMG depicted this kind of plot before the PK, hence it is better. Plus, OMG had Paresh Rawal, who is senior than Aamir Khan in every way. PK got the attention of people because of only Aamir Khan. But this should not be the thing that a viewer should look for in a movie. She/he should look for the content in the movie which PK derived from the Oh My God and basically, PK is the combination of Koi Mil Gaya and Oh My God, more or less."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "iyer-venkatesh2",
        "review_rating": "10",
        "review_title": "Get Enlightened , Get Entertained",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sabiyalsaghir10",
        "review_rating": "10",
        "review_title": "Muslims should watch this",
        "review_detailed_main": "As a Muslim myself I was a bit skeptical to watch this movie,as I thought it would be all about Hindu Gods and stuff.But I read the reviews and the immense likes so I gave it a try and I wasn't disappointed.I always thought too that it's one GOD,of the same religions,this movie shows the truth how people are blindly worshiping idols and Hindu Saints are getting money out of all that. It's a hilarious flick which addresses the present problems,and I think everyone should watch this no matter what religion. Everyone gave brilliant performances and the movie doesn't lag at all.It's a mind opener for all. Bottomline:Watch it!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mailmanish1203",
        "review_rating": "10",
        "review_title": "A movie very relevant in todays India.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "rhl-sachan",
        "review_rating": "10",
        "review_title": "Nice concept, beautiful portrayal of GOD.",
        "review_detailed_main": "One of the best movies to portray the true concept of GOD. All characters have done their parts so well that you won't be able to find the best. Paresh Rawal is at his best and Akshay looks very calm (portrays God very well). Mithun has done a very good portrayal of a spiritual guru or swami.\n\nBest thing is the light way of representing very important issue. After watching the movie, your view about God will surely change a bit. Some of the dialogue are perfect. Towards the end of movie Mithun says, \"They are not God loving people, they are God fearing people.\" Just watch the movie and you feel some senses changed."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "codename1707",
        "review_rating": "",
        "review_title": "Entertainment.. with a message.........",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "DrERH",
        "review_rating": "6",
        "review_title": "Critique of organized religion, not of belief",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "jay-techie2007",
        "review_rating": "10",
        "review_title": "Watch it for the Story, the Message and Paresh Rawal's Brilliance",
        "review_detailed_main": "The three best things you will take away from this movie when you walk out of the hall would be story, message and brilliant acting by Paresh Rawal. The movie is adapted from a famous Gujarati play Kanji vs. Kanji, which also had Paresh Rawal in the lead role.\n\nThe story flow is gripping and you wouldn't want to miss even a single second of movie. With a unique case of a human suing GOD, the direction has been brilliant to keep the story in context and make sense at the same time. While words won't be able to describe Paresh Rawal's acting brilliance, the movie also witnessed impressive performances from Mithun Chakraborty, Govind Namdev and Akshay Kumar. Om Puri, as always, was impeccable even in a brief role.\n\nHowever, the major highlight of the movie is its war against commercialization of religion in the country. The extent of monetary and non-monetary waste to please GOD, not out of love but out of FEAR, has been depicted at various points of time in the movie. It is this fear, that dharma-gurus take advantage of and make billions out of it. And as long as this fear is there to stay, the blind beliefs are also there to stay. While Kanji is an atheist, he is well aware of this and also takes advantage of it in his own way to run his business of God idols. However, he questions this foolishness in the society and the searches the answers as well.\n\nIn the nutshell, the movie offers a food for thought at the end and, of course, a brilliant movie experience as well."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sahuvivekanand",
        "review_rating": "7",
        "review_title": "touching the complex issues in a lighthearted manner.... must watch for anyone who likes deep message with entertainment..",
        "review_detailed_main": "if you are a regular bollywood movie watcher than you will understand the value of good movies especially these days when bunch of crap is being served to us in the name of movies....\n\nOh My God is not like your regular movies. it is witful,smart,thought provoking movie. it is based on a gujrati play named \"Kanji Virrudh Kanji\". i don't know how the play was but one thing I'm sure of that the movie is well executed. OMG has hit the bullseye on the matter that how the business of religion is growing in India and people are made fool all over the country...the movie has a deep message. deep message which will shake you to the core if you will watch the movie carefully.It has shown that how gullible people are these days when it comes to religion. its not just about Hindu the movie has shown that its in every religion. The so called baba and peer fakir etc how they make people fool that is what trying to showed.\n\nacting in the movie is dominated by Paresh Rawal. the man has executed the pain of a common man really well. he had played the role of an atheist who has a very skeptic view towards religion and god.he is really good in this movie too as always. there is Akshay Kumar too in the movie but I'm sorry to say I'm not impressed with his performance of god. lots of small characters too played by Mithun Chakraborty,om puri,Govind Namdeo, they acted really well.\n\ni will not make this review long. i can speak more about the movie as i liked the idea of suing god :D in the end i will highly suggest you to watch this movie if you are sick and tired of other Indian movies you will feel this movie refreshing. the most important thing i feel about this movie that it is a movie which can be watched with whole family; yes,with whole family.I'm really happy to say that because I'm not able to say that about most of the movies these days. to my friends who are from outside India i can say that you guys will also like this movie but maybe not get the message. In the end i will say after finishing the movie just think for 10 minutes what you have seen and i bet u will be a different person after watching this. have a nice day and enjoy the movie.\n\np.s. its my first review at IMDb. please support me I'm sorry for any kind of mistakes. -vivek"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ratan006",
        "review_rating": "5",
        "review_title": "It's a shameless copy of Aussie film",
        "review_detailed_main": "While the makers are saying that the film is based on a Gujarati play, the fact they are not revealing is that this film Oh My God is a shameless copy of an Australian film, \"The Man Who Sued God\", directed by Mark Joffe. So much for originality! Paresh Rawal is the only redeemable factor. Akshay Kumar hams as usual and supporting actors like Mithun and Govind Namdeo give a very distasteful take on known Hindu religious figures.\n\nHaving said that, it does have some moments and plot-wise is definitely better than the formulaic masala flicks of the likes of Shahrukh and Salman Khan that we have been subjected to of late."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ma-b-tech08",
        "review_rating": "10",
        "review_title": "A must watch good movie for every Indian.",
        "review_detailed_main": "The movie just tells that do not have blind faith in God and waste time and money. Believe in your work and do good deeds. Believe in the existence of God and do good deeds. Excellent work by Paresh Rawal as 'Kanji'. Good supporting role by Akshay Kumar as 'Lord Krishna'. Mithun has also shown a great act. This movie also shows how the people so called themselves as \"Workers of God\" dis-guide the common man and their business activities on the name of God. Corruption and religion are related very well. Comedy is equally added to concentrate on a serious topic of corruption. Dialogues are superbly written and presented very effectively. The Movie has potential to grab the audience through out the movie. All over its a great movie for such a Country like India where people are more superstitious than their belief in work. In the end movie gives a very good message."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ajaysamge",
        "review_rating": "10",
        "review_title": "Very nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "abhattacharjee98-409-61821",
        "review_rating": "10",
        "review_title": "OMG is really an OMG movie",
        "review_detailed_main": "The movie with its down to earth reality is bound to strike at the heart of our blind superstitions.The movie,throughout its tenure mixes truth with sharp-witted comedy.Initially,the movie starts with depiction of Kanji bhai's atheism & ends with a message to understand almighty in a different perspective altogether. Besides,how the masses neglect truth in the name of appeasing God & blindly rely on priests for same is clearly depicted.It is indeed a hilarious comedy movie which clarifies the unholy nexus between priests & politicians to loot the masses in the name of God.The movie can leave u with a completely different understanding of Almighty. A sharp witted,well directed movie. Akshay Kumar as modern day Krishna,Paresh Rawal as Kanjibhai & Mithun Chakraborty as the leader of business minded priests have done their roles with sheer perfection.Best movie of 2012 along with Barfi.My rating:10/10."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "rjrenju",
        "review_rating": "10",
        "review_title": "Oh My God.. What a Movie..",
        "review_detailed_main": "Seriously I don't have words to express, this movie is such a masterpiece. It touched my heart like Taare zammeen par or Munnabhai, i was deeply involved in the movie throughout.\n\nFirst of all, I am also somewhat a typical guy like parwesh rawal, may be because of this I loved this movie more. I also never donate to churches more, and I have never failed to help the poor. I believe that If a person is doing good things in life, good things will happen to him also. Also, if God exists, he is not in the statues, he is there in humans.. Good concept..\n\nAbout acting, Parwesh Rawal was simply superb, he stealed the show. The producers tried to sell the movie with Akshay's starcast in the previews and all, but Parwesh was the real star. Akshay kumar was also brilliant as God.\n\nFirst when I heard about the story about the lead character going to court against God, and Akshay kumar coming as God and all, I thought the film will be another loser. But, after reading some of the reviews, I went to watch this and believe me, its Awesome awesome awesome. So friends, Don't miss this, This is a must watch film.. WATCH IT AND FOLLOW THIS.. Don't SPEND TIME AND MONEY ON STATUES AND ALL.. HELP THE POOR WITH THAT..\n\nI also seen one reviewer saying that its copy of \"Man who sued the God\".. Ya, they are showing this in the starting of OMG also. So, don't tell like a cheap copy.. Now all are doing the remakes, but the directors of the OMG presented this well to suit the Indian audience. All are bored of watching same stories of love triangle or love failure. This is something different, like Vicky donor.. Love this move, full marks.."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "shuchisaxena06",
        "review_rating": "10",
        "review_title": "Only one sentence: Every one who has any access to movies must not skip this one.",
        "review_detailed_main": "Loved the movie. If you are a youngster (3yrs-30yrs); you have to watch this one. As you are going to shape the ideology of our future world. Do it with right concepts. No matter you believe in God or not. Doesn't matter which religion you follow. A great watch if you are a logical person; and a must required watch; if it is otherwise. Very well thought of. In a country like India, it was courageous of the makers to come up with such a powerful idea. The presentation is so simple and apt that you connect instantly. Do watch it with all your family by any means you find comfortable. And if i may advise, see it in one go without being stubborn about your spiritual concepts."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "zim-nemesis",
        "review_rating": "10",
        "review_title": "Truth revealed about faith!",
        "review_detailed_main": "I don't care if this movie is a copy or not, but the concept, acting and message conveyed are just awesome. I think this movie was required in India, as it reveals the true faces of priests who think offering money, food and clothes to the temple will fulfill one's wishes and also the people who get into all this and waste resources! I never believed in such an act! I'm glad that this message is conveyed- You can reach God through the work you do, through the people you help and by believing in yourself!\n\nThis is a movie you can watch with your family and maybe change their views too! Don't get offended and face the reality! This movie has just made that entertaining! It's faaaaarrrr better than Barfi! even if the genres are completely different!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Chrysanthepop",
        "review_rating": "",
        "review_title": "The Indian Man Who Sued God In India",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Vivekmaru45",
        "review_rating": "7",
        "review_title": "Well Done Mr. Paresh Rawal!!!",
        "review_detailed_main": "This film is the final word on the debate that whether GOD is to blame on all the calamities that befall all human beings.\n\nThough we humans have never proved the \"scientific\" existence of a higher being capable of manipulating and creating life, we still spend money on religious institutions, pilgrimages, holy relics etc., etc.\n\nThe film deals with a low-frequency earthquake that demolishes the shop belonging to Mr. Kanji Lalji Mehta (Paresh Rawal) who is Gujrati descent and also most importantly and atheist.\n\nNext day at the insurance office, Kanji and his neighbor Mahadev learn that the disaster claim does not cover any damage caused by natural calamities classified under \"Act of God\". Running out of options, Kanji decides to file a lawsuit against God.\n\nWhat happens next is hilarious. Hanif Qureshi (Om Puri), a poor Muslim lawyer. Qureshi, a disabled man, helps filing the case as Kanji decides to fight on his own. Legal notices are sent to the insurance company, as well as to religious priests, Siddheshwar Maharaj (Govind Namdeo), Gopi Maiyya (Poonam Jhawer) and their group's founder, Leeladhar Swamy (Mithun Chakraborthy) summoning them to the court as representatives of God on earth.\n\nFinally we see Kanji who ends up in front of a group of fundamentalists who try to kill him but he is saved by Krishna Vasudev Yadav (Akshay Kumar) who plays the role of GOD in this film.\n\nEventually we see Krishna Vasudev Yadav giving advice to Kanji in that all of mankind's problems have a solution. That solution is the Bhagwat Gita, The Holy Bible and the Holy Qur'an. Krishna insists Kanji go over these books.\n\nFind out what happens next when you watch this film with family, friends or by yourself. If you have hi-speed internet you can watch it Online. Or rent the DVD or go to the Cinema when the price is just about right for you.\n\nThere is a topic raised by Mr. P. Rawal in that a lot of milk, oil and food is wasted on Hindu ceremonies, which could have been used to feed the poor. I STRONGLY AGREE WITH MR. RAWAL.\n\nI also have a slight problem as to the casting of Akshaye Bhatia(or Akshaye Kumar) as the divine Lord Krishna. Hritik Roshan would have better suited in the role.\n\nGovind Namdeo is AWESOME as well as my 80's action hero Mithun Chakraborty.\n\nThere is a good song \"Go Govinda\" starring Prabhu Deva, a dancer whom I respect.\n\nIf you feel like buying the film, do so. It would be wise to wait a year because as you know new films are coming out at such a rate that the old ones will be sold at half-price and that's when you buy them."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sharengon",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "This has been the great movie produced by Bollywood in a long time. It is funny but with a social message, which is very difficult to do without being offensive or boring, but OMG has achieved this. This movie may be a remake, but it has been perfectly changed to fit the Indian audience and India's religious culture. Paresh Rawal's acting is very good and fits the main character well. Akshay Kumar plays the same personality he always does, which does not fit the god character, but it was not horrible. Some of the dialogues are very simple yet powerful and make us rethink how we blindly follow religious in our culture, and what the true meaning of religion is. I suggest everyone should watch this film."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "lethalweapon",
        "review_rating": "7",
        "review_title": "Funny, entertaining, well acted. Superb movie",
        "review_detailed_main": "Middle Class businessman Kanji Lalji Mehta is an atheist who, ironically, runs a shop of Hindu idols and antiques in Mumbai. He openly mocks religious practices and traditions, and ostensibly as a result, suffers from his shop being demolished in an Earthquake.\n\nThankfully, he is fully insured, and tries to approach his insurer. But not-so-thankfully, his claim is denied as the damage is considered an 'Act of God', for which the insurance company is not liable.\n\nFrustrated and angry, Kanji decides to sue God. He files such a claim using cleverly laid logic. If it is indeed an act of God, then God is responsible for the act, and should be held liable through his many agents (Hindu priests, Christian pastor, etc). Either they accept responsibility and settle his claim OR they dispute the act of God clause, which should get the insurance companies to pay up.\n\nBut Kanji's lawsuit triggers political reactions and crowd anger. Kanji is chased by angry mobs when he is saved by the sudden appearance of Krishna Vasudev Yadav, who is a modern incarnation of the Hindu God Krishna. In this universe, God exists, but is also mad at the charlatans who misguide people in the name of religion, and therefore supports Kanji's efforts.\n\nThe movie is well scripted, well acted, and has a very funny, at the same time social aspect to it. It ends up being a pro-theistic, but anti-religion film, and I'm very pleasantly surprised that it did well in India. It's supposed to be based on a Gujrati play, but seems to be a remake of the 2001 Australian movie 'The Man who sued God\"; a funnier, more entertaining, theistic version of it.\n\nOverall, a superb movie."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "randhir-0274",
        "review_rating": "3",
        "review_title": "Ridiculous and confusing",
        "review_detailed_main": "A person does not believe in the existence of God. He however cheats the believers by selling an idol at exorbitant price exploiting his faith. He also sells running tap water  in the name of 'Gangajal'. But he has problem with others if they do so, making money in the name of the religion. When this man is chased by hooligans, the God himself descends down to save this potential sincere follower. No one has, however, ever heard of this miracle happening when innocent people are butchered during any communal riot. This person gives some sermon and the a wave of awareness is created amongst people and they start praising him. On a cursory study he grasp three holy texts and starts citing quotes from them. It's a ridiculous movie. Grow up Indian film makers."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "uditsharma420",
        "review_rating": "10",
        "review_title": "par excellence",
        "review_detailed_main": "OMG - Oh My God this is the best of 2012!!! ranbir kapoor latest was great but when i watched this, i would admit THIS IS IT!!! this movie is the real Oscar material, with no flaws at all... paresh stole the show for sure with great support cast by akshay kumar in the role of god!!! dialogue were just out of the world , you wont stop laughing as they were satire over this era!!! it was ad-hoc on account of this movie to motivate us to the path of fact n reality!! it was done with complete sense n with truly commendable performances!!! narrow thinking will be enlarged n the person will start to think at a broader level, for me being an ATHEIST this is one of the best movie i watched in my life!!! 10 stars for sure!!!!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "shuaibindia007",
        "review_rating": "10",
        "review_title": "oh my god",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "arup070888",
        "review_rating": "10",
        "review_title": "oh my god.......an incredible movie",
        "review_detailed_main": "A must watch movie for all Generation of people. All characters were perfect in their role. This movie not only just give us few hours of entertainment but it also give us a serious take home message about religion and way of living. All situations are perfectly represented. The story line is just superb. It depicts the true picture or reality of our Indian society. It illustrated all type of practical aspects of superstitions in India with powerful dialogues. Watch this revolutionary movie for changing your perception about God. This movie deserves more than just ratings. In my opinion, this type of movie should also be promoted worldwide."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mz-perfect110",
        "review_rating": "10",
        "review_title": "Beautiful. Just Beautiful.",
        "review_detailed_main": "This is honestly the most beautiful movie i have ever seen. I mean, everything about it was touching. The right emotions, the right acting, the right timing. Hats off to Paresh Rawal and Akshay Kumar :) they really portrayed their roles well. I could not have been more awed! Akshay has always been a splendid actor but this was a role of a lifetime and he proved to me that the character really does live in the heart. He touched my heart with his perfect dialogues. Paresh Rawal is just amazing. There really is no word to sum him up. Everything about him was perfect! My perspective on religion has started to look different, although i still believe in the power of God. He is right: be fearless people; Most people are not god-loving people, they are god-fearing people. I am really proud of actually watching this film. Its a great piece of artwork and i recommend this film to everyone. It really is worth a watch!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mit_banks",
        "review_rating": "10",
        "review_title": "Strong enough to put a message on people's mind",
        "review_detailed_main": "OH MY GOD ... is really OMG ..\n\nits a story which we cant ever expect on the cinemas .. Story base line is perfect .. as far as acting point of view .. it is 20/10 believe me ... Paresh took the audience from akki .. he is marvelous ..akshay latest god .. you will go in love with kanaiya .. he s dashing pure .. polite like kanaiya .. mithunda a superb actor with comic timings ..\n\nIts humble request not to see this movie to just entertainment .. make your move after watching this movie .. it will change ur life.. it will change our life... try to understand and pen the blind fold over our eyes.. LOVE THIS MOVIE as well as 3IDIOTS .. best actor .. best story best music .. win everyone's heart.. I m damn sure ..\n\nGO with whole family .."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "emilielovo",
        "review_rating": "10",
        "review_title": "absolutely amazing",
        "review_detailed_main": "Let me start this off by saying, i'm not a big fan of bollywood movies. not because i dislike them, they're just not my thing and i haven't seen a lot (although i'm planning to do so in the future). but this movie blew me away. it's been a long time since a movie left THIS much of an impact on me, especially on a religious level.\n\ni saw it maaybe half a year ago, and i still remember being absolutely stunned by the court scenes. it's such a wonderful movie concept, and while i wouldnt call this one of my favorite movies (due to it being the kind of movie i cant imagine rewatching a lot), it is definitly one of the best movies i have ever seen. period."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "silvan-desouza",
        "review_rating": "7",
        "review_title": "Superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "akshatsingh87",
        "review_rating": "10",
        "review_title": "Inspiring, to say the least.",
        "review_detailed_main": "@Ratan006, please watch the first 5 minutes of the movie, where they have clearly stated that the movie was based on a play, that was inspired from the Aussie film. They've even mentioned the crew of that film (Director, Writer, Producers.)\n\nThe movie is based on mythology, and meant to make us understand the real values and morals. It's a movie that's made to open you eyes, and your minds towards the truth. When Akshay and Paresh team up, you can always expect good.\n\nI would suggest this movie to anyone and everyone. We've had every genre of movies of late (Akshay himself, is following this with a \"Khiladi\" flick). This is a more thought-provoking one. If you know someone who is not too happy with oneself/The Almighty, take him/her to the movie and you will be thanked.\n\n(The movie is meant to convey a message, and like most moral stories, do not go in, expecting to see a very realistic film. Just cherish the wisdom.)"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "alifchowdhury-08116",
        "review_rating": "7",
        "review_title": "Good Film",
        "review_detailed_main": "Oh My God is an amazing film. It has made my time worthy. Omg's concept is amazing and everyone of this film have been brought up the beautiful concept successfully. It has a great social message. Everyone should watch it. But may be some people wouldn't like this film because of some anti religious things. But it is totally a different kind of film. The cast of this film was totally perfect. Everyone done their job properly. People should watch this film. This film has a great value. This film also has an emotional sight, drama, comedy and many more. It is a family friendly movie. Everyone should watch this film."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "tushargupta-27286",
        "review_rating": "1",
        "review_title": "Worst",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "IRateShittyMoviesBadly",
        "review_rating": "10",
        "review_title": "A heart touching movie",
        "review_detailed_main": "wow...what a heart touching movie..simply brilliant :-)wonderful performances by its leading cast...akshay paresh mithun mahesh everyone's acting was top-notch...the message that the god is present everywhere is told in a very light hearted manner...the movies never has a dull moment nor it bores u at nytime...the comic timing of akki n paresh is impeccable as usual...its adopted from a gujrati play and the adapttion is just brilliant...the director told the story in a very simple but amusing way...i am again going to watch this movie...n do recommend every1 to not to miss such a gem. Its different from ur regular bollywood movies..its a movie with a very religious message.."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ushar-gupta",
        "review_rating": "10",
        "review_title": "\"Oh my god \"could have gone to Oscar ..Movie of the decade",
        "review_detailed_main": "Bollywood is evolving and coming up with sensible cinema and hard hitting cinema. To name a few \"kahaani\" , Vicky doo nor , gangs of wasseypur , and barfi are few of 2012 movie which i loved and should be seen by everyone . Another movie which i saw today which can be placed at the top of this list is \"oh my god\". Firstly hats of to akshay and paresh for making such a bold film. Most of the time people don't try to attempt this kind of cinema as they think people's sentiments will be hurt . BUT OMG IS MADE in such a way that it not only entertains you but give you the real inside of religious faiths people have in India and what actually happens on the name of religion, without hurting anyone's feeling.\n\nPerformance wise.... Brilliant Acting by paresh raw al , he portrays the role of a shopkeeper with ease and his court room scenes r just brilliant . Akshay kumar has little to do in the movie but he does justice to his role . I cannot imagine lord Krishna being played by someone else oder than akshay.. But the real surprise is Mithun chakraborty he makes u laugh just with his expressions :-) . On the whole omg is a movie which cannot be missed , it is a movie with a message that makes you think even after the movie is over. Hardly Bollywood makes sensible movies so don't miss this one.... 10/10"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "popsensation-39006",
        "review_rating": "10",
        "review_title": "Omg",
        "review_detailed_main": "Firstly, I'd like to thank all those who didn't get offended by the skepticism showed in this movie because with people, you don't know what happens. Especially, in a country like India where people are so sensitive toward everything.\n\nSecondly, this movie is the pinnacle of sensibility. It shows how exactly people are manipulated in the name of God and how much they fear Him instead of loving Him. A middle class businessman and his battle against all those who have manipulated religion and its traditions and cultures according to their own will and above all God.\n\nThe casting is perfect. Paresh Rawal proved it once again that there's no role in this entire world that cannot be played by him. Akshay Kumar looks perfect as Lord Krishna. I don't think anybody else could've played Krishna better. His personality, dialog firstly, I'd like to thank all those who didn't get offended by the skepticism showed in this movie because with people, you don't know what happens. Especially, in a country like India where people are so sensitive toward everything. Secondly, this movie is the pinnacle of sensibility. It shows how exactly people are manipulated in the name of God and how much they fear Him instead of loving Him. A middle class businessman and his battle against all those who have manipulated religion and its traditions and cultures according to their own will and above all God. The casting is perfect. Paresh Rawal proved it once again that there's no role in this entire world that cannot be played by him. Akshay Kumar looks perfect as Lord Krishna. I don't think anybody else could've played Krishna better. His personality, dialog delivery and the aura that he creates is commendable. Mithun Chakravarty couldn't be better. His portrayal of a fraud 'saadhu' is spot on. In conclusion, Bollywood needs more movies like OMG instead of the crap that we see these days. delivery and the aura that he creates is commendable. Mithun Chakravarty couldn't be better. His portrayal of a fraud 'saadhu' is spot on.\n\nIn conclusion, Bollywood needs more movies like OMG instead of the crap that we see these days."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "MuviFan73",
        "review_rating": "9",
        "review_title": "Creating pleasant atmosphere in every aspect only matters.",
        "review_detailed_main": "Oh my God is a story about a person (Kanji Lalji Mehta) who loses his shop in an earthquake. The shop is located an area in Mumbai, known as chor bazaar. Kanji is a person, who even does not fear God and even puts God on ill usage, for his benefit. After disaster, Kanji lodges complaint against God as he does not get benefit of insurance due to act of God. The notice is sent to all bigger baba's. He first goes through a lot of resistance, but eventually people turn out in his favour. People from other religions also join him. Thus notice is sent to every religious head.\n\nCinematography was awesome. Paresh as Kanji acted well. The build up of the movie and the execution was superb.\n\nIt's a matter of great controversy that, whatever things people do like doing abhishek, lighting candles, chaddars, etc. Do they come out to be beneficial? The answer to this lies in the quest to understand what turns out to create a pleasant atmosphere in bigger picture. I mean no poverty, equal status to lives, peace of mind, respecting life, creating a better world. This can be achieved by investment of wealth in proper direction i.e for poor.\n\nVarious religious heads need to understand the method that creates pleasant atmosphere from micro level to major only matters. If we put something in front of God, it should not go waste. Every bit of thing we keep in front of God should be utilized for good in some or other way. Eatables should be utilized for animals if not humans. There should not be any harm done to any form of life. Example Lead in kumkum has been killing animal life in water, which challenges the concept of respecting life. Things of this sort, should not happen.\n\nA movie highly recommended.\n\nI do kept pace with kanjilal at the ending scene, one of the instances that made me feel special.\n\nRating: 9.5/10"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "nirzak",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "Just nothing to say.When I am about to write a review on this there is already plenty of review out there.So you already know that this is one of the greatest pathbreaking movie of bollywood ever made and a good inspiration for the movie PK.I just want to tell you go and watch it you'll never dissapointed."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ankitsinghal6493",
        "review_rating": "10",
        "review_title": "A must watch for everybody.........!!!!! OMG Rocks ... !!!",
        "review_detailed_main": "No great casting in the movie. Still the movie is a blockbuster only because of the great script. Hats off to Paresh Rawal for his award winning acting as Kanji and Akshay Kumar as Lord Krishna.\n\nAkshay bags yet another super hit in his account. The way Akshay Kumar enters in the movie was awesome and his stunts with Harley Davidson bike was also mind blowing as per Hindi Movie standards. Very few Hindi movies have such strong script and OH MY GOD is one of them.\n\nThe film direction is also good. Sonakshi and Prabhu Deva stuns with their amazing dancing skills in the item number. The movie is not that long and pace of the movie is also very good.\n\nYou should go and watch the movie with your family. OMG Rocks!!!!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "nirajrathod",
        "review_rating": "10",
        "review_title": "What a ride",
        "review_detailed_main": "All time greats Paresh Rawal undoubtedly best performance ever and kudos to director and story teller who are able to pull off this mind-blowing play simply amazing must watch for stupid people who blindly follows what not to follow"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mysteryboy-89267",
        "review_rating": "1",
        "review_title": "Wastage of time !!",
        "review_detailed_main": "Movie and story literally sucks. Boycott it !! Completely wastage of time. Looks like they are trying to promote an agenda of hatred towards Hinduism using this movie !!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "GrandMasterrrr",
        "review_rating": "10",
        "review_title": "10 out of 10",
        "review_detailed_main": "A good and must-see film. It was was thought provoking with brilliant light humor and doses of drama. The movie is a satire that deals with corrupted method's used by religious swami's in India to rip-off the vulnerable people, by creating religious myths that are not in the scriptures. The movie has a powerful message and only hope the vulnerable people get a wake-up call after seeing this movie in the theater.\n\nperformance wise Paresh Rawal delivers perhaps his best-ever in a leading role, he deserves all the applauds, accolades, awards, in the world for his portrayal as Kanji bhai. Akshay Kumar in title role always is very good in a supporting role, his and Paresh's chemistry is just too good. Mithun da, was really good as the sadhu.\n\n10 out 10 rating"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "venkatb83",
        "review_rating": "10",
        "review_title": "oh my god-2012 Hindi-must watch movie",
        "review_detailed_main": "its based on a north India play ....and very well adopted to film..\n\nhighlights of movie is superb acting by Hindi filmdom real super star pare sh raw Val ...\n\nhis acting is so natural. other competes for best acting is religious head actor (as religious head he reminds us recent scam hit religious heads)..\n\n.... the movie is based on a very tricky issue and very emotional issue,but handled very well..no controversies at all..!\n\nfrom starting it make us bore but bit over we hook to it... after some time we never leave our seat...! its a refreshing movie of the year and scene changer of Hindi cinema.,...\n\nam glad to say its the one i was waiting for.. south dance king n a bang lady too there to dance u...\n\nif u not yet seen,see it... there are some faults but minor..i wont mind that.. its a must watch movie...\n\ni give 10/10 marks for it..."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "supriyaraodsi",
        "review_rating": "10",
        "review_title": "Absolute eye opener, rare, must watch, gutsy movie...",
        "review_detailed_main": "It takes guts and wisdom to make a movie like this in a country like India. Fabulous story, great acting by Paresh Rawal (Probably his best).The movie appeals to all age group and is a family entertainer. This movie can touch you like no other. Fantastic. Please do watch it if you have missed it. Akshay Kumar impresses in his short but powerful role. Mithun Chakravarthy is a stunner, there is probably no role or character this man cannot convincingly portray. It may not be a big budget film, it does not even have big stars but will satisfy you more than any blockbuster movie with the biggest superstars ever can. It's money, time and intelligence well spent. Do not miss. Watch it with the entire family"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sunny-jindl2",
        "review_rating": "10",
        "review_title": "Excellent movie on a very pertinent subject",
        "review_detailed_main": "This movie takes straight on the issue that is supposedly above discussion, Religion. Despite having a powerful messages, the movie is hilarious with its sarcasm of superstition and blind faith. Also, it brings out a lot of oddity in Indian religious practices, flourishing spiritual Gurus and new deities every decade. Paresh Rawal portrays the role of an atheist in a distraught situation to perfection. Also the movie is balanced with only targeting odd religious practices. One of the guru and God is shown to be on protagonist's side (the assumed good side).\n\nIt is good to see the Indian cinema has developed guts to make such a movie, a country where Da Vinci Code was banned, a must watch."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "asadharanasone",
        "review_rating": "10",
        "review_title": "Preach the Power- Not the Picture",
        "review_detailed_main": "An ensemble cast of Paresh Rawal, Akshay kumar, Mithun Chakraborty will win your hearts with their superb acting skills and with a strong message this time. Mithun Chakraborty played a negative role. While Akshay as Lord Krishna"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "shiv_narr",
        "review_rating": "10",
        "review_title": "Very nice movie",
        "review_detailed_main": "A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is.A must watch movie for everyone in this world. This movie is not about harming anyone's religion but it's what we and our mankind's truth is."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "tasf-aff",
        "review_rating": "9",
        "review_title": "One of the Best Movies",
        "review_detailed_main": "You can hate this movie you can love this movie but you cannot be indifferent. One of the master pieces of Paresh Rawal but hats off to the writer the Australian one! Its a unique take on faith and how people deal with it but majority of the credit should be give to the people who thought of it. Yet there is some credit to the writers adapting it to Indian audience. I watched the Australian version after this one!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mraj-73329",
        "review_rating": "1",
        "review_title": "Anti-Hindu propaganda",
        "review_detailed_main": "This is the worst movie i have ever seen this movie is full with Anti-Hindu propaganda. Hate Bollywood"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sekharsubhransu20",
        "review_rating": "10",
        "review_title": "humanistic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "whytryharder",
        "review_rating": "9",
        "review_title": "An explosive content handled masterfully",
        "review_detailed_main": "A man sues God because he thinks God is responsible for his loss. A gripping comic drama about the battle of a loner atheist for whom God is futile simply because according to him the way we happen to perceive God is ludicrous and especially because of the institutions, ashrams who swindle money in the very name of God.\n\nThis movie, in a way, keh-ke-leti's of all those babas, sadhus, saints, institutions that munch money from the innocent public unwavering with their faith, in name of god and questions the notion of donation, lavish physical gifts to temples, churchs, mosques. It very much appealed to me because I have always been the same kind of devotee who believes. OMG, also mocks the mass phenomena that takes the community by storm once an airy larger than life notion is shown about a particular person.\n\nNot for once, this movie slows down, it is always a joy ride from start till end. Umesh Shukla deserves applaud for binding this movie so well given the explosive content he has carried out masterfully and the best dialogues, screenplay I have seen in Bollywood since a long time.\n\nIt's not often you get to see a movie that challenges your opinion, defies your perception and literally shakes your age-old, orthodoxian beliefs from the core.\n\nOn the acting part, let me admit, I was a bit sceptic because there was logic defying combination of Paresh-Akshay again.\n\nBut, Paresh Rawal is phenomenal in his portrayal as a Gujju businessman he single 'handily' carries the whole movie on his shoulders with ease. Easily the best role he'd done amongst his last ten movies. Akshay Kumar great to see him back with sense, though I thought he overdone his role a bit at few places. Govind Namdeo is terrific with his role as Siddheshwar baba.\n\nWell, yes there are flaws in movie, like Paresh Rawal questions the unscrupulous ways of babas, swamis and in start he makes money by selling statues with fake proposition about their origin. But that's explicable given that God gets even with him ;)\n\nOverall, a wonderful movie with a special memo to masses, God isn't anywhere\u0085God is everywhere. 9/10"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "vishnoi-rju",
        "review_rating": "10",
        "review_title": "A though provoking cinematic experience like once in a blue moon",
        "review_detailed_main": "An excellent and out n out social satire drama based on life of kanji bhai mehta is a solid punch packed with finest performances by paresh rawal and akshay kumar...film has unusual story with loads of epic moments..its like watching a movie with laugh on face,tears in eyes and hole in heart..solid content...brave effort...awesome logics and a great message..not just a drama and not just a social message..its a great entertainer too..watch this with family and believe me it will be the only time you will be happy even seeing your parents and other family members crying in theater with tears of joy. Akshay kumar and paresh rawal were show stealer but its mithun da for whom you should be amazed after. a brilliant screenplay and well directed film takes you on a laugh ride and also make you think at the same time. akshay's screen presence is less but very effective. none other than him can carry the mod god persona.hats off. 10/10"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "anex-stormrider",
        "review_rating": "10",
        "review_title": "masterclass !!",
        "review_detailed_main": "OMG! Oh My God..an intellectually stimulating comedy.. at the centre of which lies a storm of revolutionary ideas dabbling in a sea of beautiful thought. An incredible tale that rightly seeks to redefine the the concept of God in the context of modern-day reality.. that carefully distinguishes between Gods and god men.. frees God from the shackles imposed by the numerous religions and unites him back with humanity..not with blasphemous talk but with powerful logic.The story and the scenes raise the right questions and demand the audience to rethink their stance on God and religion. More than being an entertainer, it is an act of revolution..It is..an \"act of God\".. \"Majhab insaano ke liye banaya gaya tha..Insaan majhab ke liye nahi\" (Religion was made for man..but man was not made for religion) Kanji Bhai !!.Salute !!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ravishinde",
        "review_rating": "10",
        "review_title": "Intelligent Script with a superlative portrayal by Paresh Rawal",
        "review_detailed_main": "OMG is a thought provoking and hard hitting take on the enigma that is God.\n\nThe performances are top notch, led by Paresh Rawal as Kanji. His caliber is well known anyway. Mithun Chakraborty as the effeminate Godman must be a really plucky actor to pull this role off with ease. He doesn't overdo his reactions and his antics bring a chuckle for sure. Akshay Kumar has a very likable cameo as Lord Krishna. The way he bonds with Kanji in his house is beautiful. The bike which he uses is a killer though his intro stunts on the bike are poorly executed but we can live with that.\n\nSo overall the movie is a Good Watch and Highly Recommended.\n\nMy Ratings -\n\n10/10"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "rishanstrikes13",
        "review_rating": "10",
        "review_title": "Brilliant! A movie with a Religious Moral \\m/",
        "review_detailed_main": "If you are a person who gives a damn about the 'n' raised to infinity number of shitty rituals but has a strong belief in God, this movie is for you. Total justice by everyone when it comes to acting & a very strong religious moral which I personally believe and also wish everyone believes.\n\nInitially, I had no expectations from this movie, since it's not a chick flick :P Thought it would be boring to watch such movies. I usually like movies which have lotta graphics, macho kick ass guys, babes n stuff :P But in the end, I was like WOW! This turned out to be a one hell of a great movie. I would recommend this movie not just to all our youngsters but especially for our mommie daddie uncle aunty dadi dada etc who drive you nuts everyday with their so annoying superstitious beliefs in god.\n\nIf this movie brings a change in even 10% of our population, it's a big success! GO FOR IT EVERYONE! YOU WONT BE DISAPPOINTED even a bit! \\m/"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ripplejb",
        "review_rating": "10",
        "review_title": "A movie that give us hope",
        "review_detailed_main": "For me, this movie is a hope. I think, making these kinds of comedies will serve purpose of cure for disease called \"Religion\". While growing up, I always had my doubts about religions. This movie did put right questions in front of our sick society. It make people think. A must watch for every one. For atheists in India, it is time to come out of closet. We do have a hope. Watching Paresh Rawal was pleasant. No trace of overacting and all the dialog were written intelligently. Some part were copied from \"Man who sued the God\". However, director tried hard not to hurt religious sentiments and did a good job. Because point is not to hurt someone but spreading knowledge."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "forestlawtekken",
        "review_rating": "1",
        "review_title": "One of the worst movies I have ever seen",
        "review_detailed_main": "Crap movie with too much overacting and a lot of things didn't make any sense Why god came into this world as a human being? Is it to solve the humanity? Lol, a car mechanic doesn't need to become a car to fix the problem. Similarly god doesn't need to become human being in order to solve the problems of the world. He himself can solve the problems of the world without becoming human being.\n\nFurthermore, Lord Krishna came down to this world shows that they made this movie in favour of Hindu religion which I find insulting to other religions.\n\nThat is the reason why I find PK as a much better movie than this one because PK movie didn't try to show that one religion is more true or more superior than another religion."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Swapnilagarwal",
        "review_rating": "9",
        "review_title": "OMG! Watta movie! :)",
        "review_detailed_main": "OMG...what an year it is turning out to be for Bollywood!! 2 extreme cinemas, both ruling the same roost bole to 1 myan me 2 talvarein! One belongs to the likes of masses, masala entertainers (Rowdy Rathore, Ek tha Tiger) while others that matter the grey matter (a full list of them that begun with PST and Kahani and now unstopped at OMG!! Coming to OMG now..rather than writing a full review, i will mention its gist just like the acronym it is:\n\n1. Another non-chocolaty main protagonist - Paresh Kanjilal Rawal. He is known for putting life in whatever character he dones and this one is no different.\n\n2. \"Religion is the opium of masses\" and more so in a diverse nation like ours where the opium comes in different flavours. Making an eye- opener on such a sensitive topic is not as easy as it seems to be. It might appear preachy in patches but nevertheless its like a lecture we get from our parents after we err; and one leaves the cinema-hall with the same guilt. The movie tends to redefine 'God' and 'Religion'.\n\n3. Akshay as God might not sound like a believable bet but as the film progresses and by the time it ends one starts looking beyond AK to feel the real Krishna.\n\n4. Mithunda (doning looks and mannerisms of Sri Sri) is the surprise package of the movie. His performance as the diplomatic yet feminish religious guru was seriously - kya baat..kya baat...kya baat!!! Govind Namdev tickled through his loudness.\n\n5. Other supporting cast seems to be an ensemble of deja-vu characters from TV ads, nevertheless, endearing and non-starry.\n\n6. Music is well woven in the movie. Though some people find Go Govinda out of place, I feel, it does add some pace and rhythm to the story. A couple of others like \"Main to nahin\" and \"Hare Rama\" move intertwined with the movie.\n\nIn all, OMG is a brave attempt from Hindi Film Industry targeting to make people understand real meaning of God, making a call to shun all material and ritual practices and try to find God out of statues. GO FOR IT GUYS!!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "dineshprakash",
        "review_rating": "9",
        "review_title": "A brilliant film. Healthy message with healthy entertainment.",
        "review_detailed_main": "The idea and justification is perfect. Director Mr Umesh Shukla has done a memorable job. Screenplay by Umesh Shukla and Bhavesh Mandalia is very convincing. Dialogues are very logical as well as humorous. The item no by Mr.Prabhu Deva and Sonakshi Sinha adds spice to the film. Idea is very simple but making it convincing was a very tough job but they succeeded. Performance wise Paresh Rawal is ultimate and perfect at the level that you start believing him as Kanjibhai. Akshay Kumar is good. Mithun Da has done a very surprising character. He adds very minute mannerism to enhance the character. Music by Himesh Reshammia suits the mood of film. Simply it is the best example of Powerful message with the glossy wrapping of entertainment. Overall a must watch with family and children."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "karan_dx",
        "review_rating": "9",
        "review_title": "An absolute delight",
        "review_detailed_main": "A heart warming light comedy having its own flavour of satire. Except for the camera work being abrupt at times, an entertaining movie without even a boring minute.\n\nOf the regular fare that has been dished out in the past 4 months, I would rate this movie right at the top. Absolutely delightful performances from Gobind Namdeo and Mithunda.\n\nThe 2nd best I would consider Akshay, in the role of Krishna - though a marginally longer screen time and a few more antics would be welcome. Of course, this effort washes away the ill will and the mental torture endured while watching JOKER.\n\nAnd of course, the cherry on the icing was Paresh Rawal in the role of Kanjibhai. Its been quite a while he has had a chance to top up Baburao Ganpatrao Aapte's character from Hera Pheri. Hats off to him!!\n\nGo enjoy this movie on the weekend with family and kids (I know my kids loved the movie)."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "jsjchandra",
        "review_rating": "9",
        "review_title": "OH MY GOD - A superb message oriented satirical comedy film",
        "review_detailed_main": "Through the movie - Oh My God, its director (also the writer) Umesh Shukla has conveyed a beautiful message that we should believe in God but not in blind superstitions The exploitation of innocent people by persons who claim themselves to be God-men is depicted in a beautiful way. The highlight of the film is that there is a perfect mix of comedy and philosophy and it completely involves each and every one in the movie till the end.\n\nThe story revolves around a middle class atheist shopkeeper - Kanji Lalji Mehta (played by Paresh Rawal) who loses his shop owing to an earthquake. Kanji then goes to claim his insurance but the insurance agents reject his claim saying that his shop was destroyed in an earthquake which is supposed to be 'Act of God' and hence he can't claim the insurance. Being deprived of his income and running out of options, Kanji finally files a lawsuit against God and demands the religious heads who acquire money in the name of God to bear his insurance loss. Legal notices are sent to the insurance company as well as the religious heads and the trio of persons who claim themselves to be God men - Siddheswar Maharaj (played by Govind Namadeo), Gopi Maiyya (played by Poonam Jhawer) and Leeladhar Swamy (played by Mithun Chakraborty) get involved in the story and this lawsuit of God becomes an issue of national interest. The religious heads try to kill Kanji and thats where Lord Krishna(played by Akshay Kumar) comes to his rescue and the remaining movie is a depiction of how He helps Kanji in his legal fight with the religious heads and the message He wants to convey the entire world through Kanji. Totally, the movie re-emphasizes the old proverb - 'GOD HELPS THOSE WHO HELP THEMSELVES' through a plot filled with humour and sarcasm.\n\nComing to the performance of the actors, it was an outstanding performance from Paresh Rawal in the lead role and Mithun Chakraborty was also equally good in the negative role. As usual, Akshay Kumar was impressive with his role as a modern God. Other aspects such as dialogues, screenplay and background music were also good and I definitely say that it is a must watch movie for each and everyone. Finally, I would say that in this era where nine out of ten films are purely commercial, it is our duty to encourage these kind of movies which would boost the confidence of directors like Umesh Shukla and help them to come up with more innovative movies in the future which would be a blessing for Bollywood."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "kumarakshay175",
        "review_rating": "10",
        "review_title": "Deserves an Oscar!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "pankiltaranekar",
        "review_rating": "10",
        "review_title": "OMG",
        "review_detailed_main": "OMG! Quite a grear film. It has a brilliant message in the end. The writing was really good, and the performance of Paresh Rawal and Akshay Kumar is outstanding. Mithun as the Priest was just another level of acting. Always a watch when it is on TV. Worth a watch who haven't watched this movie yet."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "manojdv10",
        "review_rating": "10",
        "review_title": "awesome!!!!!!!",
        "review_detailed_main": "i was thinking this movie will be full of comedy before going in theater but i was wrong. this movie gave very significant moral along with comedy..... and after watching it i became very happy.... presh rawal is best!!!!!!! presh did his best along with akshay kumar.i think this is one of the best movie of this year..... this movie also shos without any actress how a movie can be superhit....... this is also a best movie of akshay after long time and i saw a best movie after barfii in this year. presh did his best in the role of kanji bhai and akshay in the role of krishna.both of them did well to make a good movie for every Indian. i think this movie will also help to a man who afraid from god..\n\nall of Indian go and must watch this movie.... i think u will be happy..."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "JakeBrinkman",
        "review_rating": "2",
        "review_title": "Decent message, poor delivery",
        "review_detailed_main": "American religious films usually have a respectable message, though they are usually lacking in at least one of the major cinema categories that define a masterpiece, including acting, plot, screenwriting, and cinematography. This lack of quality leads to the majority of American religious films to be called \"bad\" even if the viewers widely agree with the films' messages.\n\nUntil watching OMG, I had never considered that other countries might have their own bad religious films, so I appreciate the movie opening my eyes to that. So the message is certainly a good one (to an extent), and the movie is certainly a bad one. The plot was decent if not predictable, and the acting served its purpose even though it was never particularly convincing. The only part that was truly awful was the screenplay. The writers had clearly never been in any sort of courtroom before, nearly all of the main character's points used flawed logic arguments, and none of his interrogators could come up with even the simplest counterpoints. I don't necessarily blame the writers because the heart of the message can eventually be argued as truth (again, to an extent), but truly convincing the viewers would require a debate lasting far longer than any movie's runtime. However, the producer is definitely to blame for attempting to tackle such a massive concept in such a short film."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "maxxximus786",
        "review_rating": "8",
        "review_title": "Well Intended!! plagiarism :)",
        "review_detailed_main": "This movie borrows its plot from the movie \"The man who sued god\",,But it hardly matters because its one of that bolly movies which was well intended social satire. In a country where superstition is rampant, this kind of cinema is rather necessary that is why it worked also.To be honest this movie is technically weak whether its editing,cinematography and even direction but its still a thorough fun because of its protagonist \"Paresh\" and some intriguing blasphemy even though it was occasionally loud but bearable. This movie won't receive any award at any function but still its a kind of cinema that should be made once in a while which you can watch along with your family members of every age group.\n\nIt is very rare that a movie comes with social message and at the same time with a high quotient of Entertainment,, Don't miss it!!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "husain_aryanonfire",
        "review_rating": "10",
        "review_title": "please guys watch this movie at least one time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "backlash7887",
        "review_rating": "10",
        "review_title": "A complete good movie",
        "review_detailed_main": "A must watch movie for all of human beings.\n\nThe acting was very good.The thought was superb. Item number was also magnificent. This is a movie not only entertain you but also teach you. This movie clearly shows the corruptions and politics done in name of god.\n\nThis was one of the best Hindi movie of my knowledge in this year. Hope all us will get lessons from this movie. This movie is a symbol of process for Bollywood.\n\nAfter all I will definitely call it a complete movie. You can find comedy, tragedy , love , hatred, revenge all in it. After seeing this you will just say \"Oh My God !\""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "raviranjanwap",
        "review_rating": "10",
        "review_title": "must watch",
        "review_detailed_main": "Must watch movie for all who believe in god blindly.."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "isoumalyakhan",
        "review_rating": "10",
        "review_title": "excellent",
        "review_detailed_main": "this film really changed my concept of God. OMG is an honest film with a strong message which should be encouraged and seen especially for the brilliance of its script and the delightful acting by Paresh Rawal. it shows some facts that are somehow unbearable for some people. Please do believe in God but don't be superstitious."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "benjaminbarabenja",
        "review_rating": "9",
        "review_title": "God Is Not a business",
        "review_detailed_main": "I have seen this movie many time, what a film, I was pretty much speechless after i exited the theater. The message this film gives is that god is in every human being, then why do we go looking for him in mandhirs, churches, mosaics, gurdwaras, etc Why has god and religion become a business, why do we spends millions and billions of dollars at religious places as people when we can take that same money and help the poor, won't god be more happy then.This Film give us a beautiful massage."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Arjun93",
        "review_rating": "10",
        "review_title": "A movie Bollywood can be proud of",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "blandhani",
        "review_rating": "1",
        "review_title": "Kabi Doosre Dharm per Movie banaya karo",
        "review_detailed_main": "Intihaye Gatiya Movie hai, aur Dosare Dharm per kiyu nahi Movies banate hu? Kiya aap ko Dar lagta hai, aap ki aur aap ki family k sar tan se juda ker diya jaye ga. Is lai tum log un k khilaf movies nahi banate hu. Shame On You & Ur Team."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "pcinpocket",
        "review_rating": "9",
        "review_title": "wow movie.....!!!!",
        "review_detailed_main": "Just saw this movie. and i am shocked, after watching the whole movie i realize that there is no actress in movie. And believe my it is not required. The cinema in India is changing. We should accept it with open heart and arms.\n\nStory is awesome. Paresh rawal, he gives the life to the movie. A businessman who never believes in god, blames god for his lose. And drag the GOD in the court. The argument in the court is truth. The bitter truth of religion and the marketing of god. Paresh rawal reveals everything about business of religion. Our society should accept this type of movies. Cause this type of movies can improve the society of India.\n\nPlease people go for this movie. Change your mind, change your taste. This movie deserves 10 star. And really, at least, public attention."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "akshayfan-83284",
        "review_rating": "10",
        "review_title": "Most Logical movie ever made in Bollywood",
        "review_detailed_main": "Must watch. Serious problem with comedy. Strongly recommended."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "rangil-03",
        "review_rating": "10",
        "review_title": "must must must watch..intelligent cinema",
        "review_detailed_main": "**** first time writing a review ,so sorry for naiveness.. was just getting bore at home and thought of watching this movie..\n\nand oh boy..what a movie..superb,..awesome acting..especially paresh rawal..show stealer and superb part by akki....\n\nand roles played by mithun da and govind namdeo and others as false god men are just awesome...\n\nredefine your faith by watching this masterpiece...screen play is awesome and so witty that never does it offend in any way and make whole movie a fun ride from start to end...\n\nDialogues are amazing and contain social elements and one liners used by paresh rawal are very very good and impacting... don't miss it faults and of course nice cameo song by prabudeva and sonakshi...\n\ncelebrate this cinema..kudos..."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "benjaminbarabenja",
        "review_rating": "9",
        "review_title": "God not a business",
        "review_detailed_main": "I have seen this movie many time. what a film, I was pretty much speechless after i exited the theater. The message this film gives is that god is in every human being, then why do we go looking for him in mandhirs, churches, mosaics, gurdwaras, etc Why has god and religion become a business, why do we spends millions and billions of dollars at religious places as people when we can take that same money and help the poor, won't god be more happy then. This and many more messages are conveyed in this movie through characters, like Kanji Bhai, Krishna, etc Another really plus point about the film is that it is told in a light hearted way, in a comedy, the film isn't very preachy and still conveys its beautiful and real message."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "despiera",
        "review_rating": "10",
        "review_title": "Stupendous!",
        "review_detailed_main": "This is everything PK wishes it was! Unlike most \"sickular\" films that don't have the balls to show the hypocrisy shown by other religions' zealots, OMG is unflinching in in it's depictions as it satirizes religious extremists of ALL of the world's 3 major religions (AKA hinduism, christianity and wait for it...even ISLAM *le gasp*). Splendid and remarkable! More than an sickular movie could ever aspire to be."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "kishorkure",
        "review_rating": "9",
        "review_title": "If God Exists",
        "review_detailed_main": "This movie draws our attention towards the hypocrisy of Indian Sadhus and the invisible existing God."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Umeshsonii",
        "review_rating": "10",
        "review_title": "Oh My God",
        "review_detailed_main": "Just awesome movie, must watch ;-) This movie is for the people who blindly believe on fake babas and sadhu"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "rakeshvnsgu",
        "review_rating": "1",
        "review_title": "Insult Sanatan Dharma Feelings",
        "review_detailed_main": "This movie insult Hindu's felling about Hindu's God, this movie don't show other side darkness. Bollywood see bad things only in Hindu's dharma, they don't dare show other side. So don't watch this movie"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "kamyrocks17",
        "review_rating": "10",
        "review_title": "Best movie ever made in India",
        "review_detailed_main": "Its the best movie ever made in India..just look at the simplicity and powerful dialogs...watch this movie for lots of teachings and to know about the reality of GOD and religion along with entertainment. Akshay Kumar and Paresh Rawal are as always at their best and sincere roles-no useless jokes this time-Its really a good movie that you must watch with your family-a movie for both kind of people-who believe in GOD extremely and one who don't believe in GOD anyway. This movie tells a lot of reality which we never know or never wanted to know. Paresh Rawal has done a great job.\n\nThis movie is worth watch in theaters. Teaches lots of stuff, depends on you what to take or not.\n\nGuys don't think anything, just go and watch.\n\nI ll suggest tell your parents to watch this movie as well.\n\nI don't want to criticize other movies which copies the directions or screens from Hollywood, but this i feel, everything is original.\n\nYes some of the time you will feel, \"aisa real life me kabhi nahi hota\". but guys this is movie, and you can learn and take what you want."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "tanmoy999",
        "review_rating": "10",
        "review_title": "Must Watch for Everyone",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "wildlife-ptech",
        "review_rating": "8",
        "review_title": "Entertaining film with a deeper message",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "faisalfaves",
        "review_rating": "9",
        "review_title": "Awesome movie",
        "review_detailed_main": "I just love these types of movies. As an Atheist I am always against these religious fools and their behaviors. There is No God, Not at all. Religion is the biggest tool and business for this world's most businessmen and governments. Just Research on your own. These types of movies will change our societies thinking, transform peoples attitude from extremists into Human.\n\nA Must Watch Recommended Movie. Watch and Let others know!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "akumbhar",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "Simple story but Big message this film Really omg deserve top film Indian cinema Paresh ravaal ⭐⭐⭐⭐⭐ Akshay ⭐⭐⭐⭐⭐"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ketgup83",
        "review_rating": "8",
        "review_title": "A daring attempt which should be lauded and appreciated for its wonderful message",
        "review_detailed_main": "OMG turned out to be a surprise message-oriented fun-loving cinema with mind-blowing performance by Paresh Rawal.\n\nWith his shop destroyed by mother nature , Kanjibhai files a case against god to seek answer to his downfall\n\nDirected by Umesh Shukhla , OMG was a full-fledged entertainment mocking at the fraudulent religious believers and hypocrites who fool people in the name of God . One such scene where people flock into the temples to offer prasad to Krishna Idol indicates how much people can have blind- faith in religious activity. Hats off to the director to give a film which no one has ever attempted. Based on the popular play , OMG throws surprise with every scene and is sure to be lauded for its daring story. Screenplay is tight along with crispy dialogues. Paresh Rawal is the soul of the film. He carries the role of Kanjibhai as if it has been tailor-made for him. Akshaye Kumar does decent job in special appearance.\n\nOverall . OMG is a daring attempt which should be lauded and appreciated for its wonderful message"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ashokmhan",
        "review_rating": "10",
        "review_title": "Good movie. This type of movie we need now",
        "review_detailed_main": "I request everyone to just see this movie. Bhagvan hota hai but aise nahi jaise log hame jhuth bolte hai.\n\nA lot of loot goes on in the name of God, he is scared. It is told very well in this movie. We should respect God and I also believe that God is there but God is in everyone's heart, there is no need for any middleman to meet him. Similarly there is also pk movie. I do not say that filth is in Hinduism only. Wherever wrong deeds are being done in the name of God, it is not right."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "vitthalmisal",
        "review_rating": "1",
        "review_title": "Propaganda",
        "review_detailed_main": "The movie shows cults only in ine targeted religion and also defames it. Agenda of the director."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Jini-B",
        "review_rating": "9",
        "review_title": "A Fantastic Film",
        "review_detailed_main": "I have been hearing a lot about this film, especially after watching PK. There are parallels with that film, in wanting to understand the faith in God, and how faith can be manipulated in the worst ways. This movie was done so well. The story, the acting, everything was top-notch.\n\nThere are some very intelligent and witty dialog and moments in the movie. The acting- Paresh Rawal, Akshay Kumar, Mithun Chakraborty, were all good. I especially liked Paresh Rawal's endearing and angry turn as an atheist who sues God. The story was quite interesting and kept me glued till the end. It made me laugh, made me cry, and made me question a lot of things. This was wonderful!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ritz0512",
        "review_rating": "10",
        "review_title": "One of the best movie and so many things to learn and implement in our lives.",
        "review_detailed_main": "This movie tries to show the real God and the fake image created by the society. I hope people learn from this movie. Bollywood should produce such kind of movies. God is within us and has no image. We should stop wasting resources in religious places and should use them for the betterment of the society."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sonumewada",
        "review_rating": "9",
        "review_title": "MASTERPIECE",
        "review_detailed_main": "This movie was ahead of its time.... Beautiful performances by star cast brilliant direction and story make this movie masterpiece..."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "yunusitboss",
        "review_rating": "8",
        "review_title": "OMG Oh my god(U)---------my Rating: 4/5 DIVINE HIT",
        "review_detailed_main": "for more movie Review like this page:::::\n\nhttps://www.facebook.com/MovieReviewByYunusIrshad.\n\nOMG Oh my god(U)---------my Rating: 4/5 DIVINE HIT\n\nIt is a clean devotional movie which will open Ur eyes.....\n\nVERY GOOD:- *Story - which is new and will be objected by many of them *Performance - superb by paresh and by the GOD akshay *Dialogues - are solid punch *Costumes *Direction - which will make u believe\n\nAVERAGE:- *Songs - \"go go govinda\" was super hit rest all OK *Screenplay\n\nVERY BAD:- *Background score\n\nFINAL VERDICT:- It is a superb movie which will make u a bit boring at the beginning and then it will rock u..... a must watch movie for all castes ....\n\nKanji Bhai (Paresh Rawal), a middle-class Hindu atheist runs a shop in Chor Bazaar, Mumbai, sells Hindu idols and statues along with his friend and neighbour, Mahadev. Married to a very devout wife, Susheela, and a father of two (a boy and a girl), a low frequency earthquake hits Mumbai, but there are no damages at all to property or life - except for Kanji Bhai's shop, which is destroyed completely. Kanji goes to his destroyed shop & produces it's insurance papers."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "vshlmr",
        "review_rating": "8",
        "review_title": "Path Breaking Movie",
        "review_detailed_main": "This movie has changed the mindset about god for every religion."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "gutlapally-anil",
        "review_rating": "9",
        "review_title": "The Best movie ever from Bollywood..!",
        "review_detailed_main": "Being an atheist, i loved each and every part of the film except that they still portrayed that the god exists. But i understand that otherwise the so called religious people can take it offensive and can make the movie banned with their stupid enough thoughts and influence. obviously, the director might have thought of commercial success of the movie and so he had put his point through simple and non offensive story line for those people who can't take it. - Only reason giving it a 9/10 rather than 10/10.\n\nBut the movie is really awesome. Paresh Rawal was at his best in all those superb dialogues under the supervision of Umesh Shukla, the director who has shown such a courage in taking such a fantastic but on a sensitive topic.\n\nA must watch for everyone."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sattarfreelancer",
        "review_rating": "10",
        "review_title": "One of the best movie in Bollywood",
        "review_detailed_main": "Best screenplay.\n\nBest story.\n\nBest Direction.\n\nBest Comedy.\n\nWhat not.. all in one entertainer."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "barcacatalunia",
        "review_rating": "1",
        "review_title": "Jocking",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "agrawaltanishq-50406",
        "review_rating": "10",
        "review_title": "Omg, what a wonderful movie.",
        "review_detailed_main": "A society friendly film. We need more such films in our country to avoid scams on religious basis. A wonderful and really amazing movie. Hatts off to the director, producer, paresh sir, akshay sir and whole team group."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "zeeschan",
        "review_rating": "10",
        "review_title": "An underrated movie",
        "review_detailed_main": "I think this movie is a good prequel to PK. Paresh acting was really good as always"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "akshaytheboss-23921",
        "review_rating": "10",
        "review_title": "Funny but Bold",
        "review_detailed_main": "OH MY GOD Movie Review: Akshay Kumar's OMG! is Funny & original. One of the best movies if my life."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "gauravmatta-88492",
        "review_rating": "10",
        "review_title": "Great Movie",
        "review_detailed_main": "All I can say is Oh My God teaches how to make a movie on such sensitive topics and enlighten people with message.\n\nPK on other hand teaches how not to make a film on a sensitive topic and just make a mockery out of it."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "madhuriswadia",
        "review_rating": "10",
        "review_title": "Akshay kumar's one of the best film",
        "review_detailed_main": "This movie is a pure entertainer. Its a must watch film."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "jhingalalahmm",
        "review_rating": "10",
        "review_title": "A very funny movie!",
        "review_detailed_main": "This movie reminds you of the 70s Sanjeev Kumar starer 'Yehi Hai Zindagi', though the stories are very different. In both the movies the hero is an atheist and Lord (Bhagwan) Sri Krishna visits him. That's where the similarity ends though. This movie is funny to the core. Trust Paresh Rawal to tickle your funny bone with his very realistic performance of a common 'dukandar' taking on the powers of representatives of God! The script is tight with powerful dialogues. Akshay Kumar is hilarious in the role of God. Mithun Chakraborty once again proves his acting skills this time as a gay God Man! All in all, a real time pass movie with a message. A must watch movie, especially for Paresh Rawal fans!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "shkamath-01355",
        "review_rating": "9",
        "review_title": "Thought-provoking! Eye-opener! Captivating!",
        "review_detailed_main": "Simply put, this movie is one of the best contributions to Indian Cinema & to Indian Society. But sadly, I'm afraid that is all it will ever be. Brilliant acting performances, thoughtful screenplay & direction and overall just a thorough entertainer. This movie has the potential to change narratives, shape behaviours and contribute so much to society. I just wish such movies could disseminate deeper into the Indian conscience. Hopefully, the generation that is most affected & motivated by it would do something when it's their turn. Until then, keep recommending this movie to others!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "atombombz144",
        "review_rating": "1",
        "review_title": "God is not our friend.",
        "review_detailed_main": "It may seem comfortable to some, to think that God is our friend. It has also become okay, to use his name in vain and cover it in our, good intentions. Well, goodness comes from God. Not You. OMG is disrespectful as is so many movies and t.v. shows, that use God as a slang. It is even worse in a nation that claims to revere God, to allow such loose behavior to be accepted as normal. Children admit to using this slang without any thought. Maybe because there is a different god they serve, which promotes this. I sincerely believe it is intentional disrespect..through music, movies and television shows that has extended itself into the minds of children and their common language. (including texting, internet rants, etc.) A bad example is being set by lazy, scared and Godless people in positions which condone this. Personally I don't, and it doesn't matter what the movie reaction is. Im sure it would be a problem if it were all of a sudden to say \"aint that a jew\" to express anything but praise..and jews or any people offended are no where near the goodness of God."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Kuldeep_Tiwari",
        "review_rating": "8",
        "review_title": "just watch it!!",
        "review_detailed_main": "You won't regret every instant is entertaining and at the same time teaches you something"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "himanshug1",
        "review_rating": "8",
        "review_title": "Good God",
        "review_detailed_main": "For several years, I thought that way we Indians, way we practiced religion,the way it is sold, it has been our collective sickness. On the name of faith, logic disappears. This problem was verbalised in a play which I show in Detroilt last year, acted by Paresh Rawal. Although play was raising issues about organised religion in India, it had got lost in its own argument. When same play is transferred into screenplay it has iron out all confusion and presented problem in a systemic way without destroying the fundamental question. This comedy has a serious question and we need to change our behaviour. As film it was entertaining with brilliant performance from Paresh Rawal. He seems a bit tired. Enjoyed Akshay Kumar as God. ."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "deepak1993",
        "review_rating": "8",
        "review_title": "A must watch for everyone",
        "review_detailed_main": "what a film!! every thing which an atheist or i should say a true believer wants to explain to a fool...is all their in the movie..but still there are some very small plot holes in the movie although the movie explains very much what they want. the real hero of the movie was Paresh Rawal, his acting was superb and add another gem stone in his career...while Mithun Mithun Chakraborty proves himself once again as a legendary actor he plays the character very well...and now Akshay Kumar prove himself that he can do these type of movies too...although his acting skill didn't match Paresh Rawal or Mithun Chakraborty...the script was well written. characters well played but there were very small small mistakes which did not take this movie to another height...i wish this movie to be seen by every other person on earth and tell them about what god wants us to do...(sorry for mistakes i made in this review)"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sachinpathak-27536",
        "review_rating": "9",
        "review_title": "Amazing, rational, comic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "eh5963-297-967354",
        "review_rating": "8",
        "review_title": "Delightful yet though provoking",
        "review_detailed_main": "Preachy? Yes. Loud? Yes. Has blemishes? Yes. Despite some minor hiccups, OMG makes some strong points and leaves a huge impact on the viewer and some of their viewpoints.\n\nPlus, the movie talks about possibly the most universal topic out there - God and his existence. However, OMG is not all about God and his existence. In fact, an atheist suing God is merely a backdrop. OMG talks about much more controversial things here. OMG shamelessly discusses the commercialization of religion, especially in India. It may not have done it with full intelligence, however, it's a brave film with a mark.\n\nKanjibhai Mehta is an atheist who runs a shop that sells Hindu idols and \"murti's\". He is an open atheist and believes religion is nothing more than a business. A natural disaster causes only his shop to be destroyed. Kanji is shocked when the insurance company tells him that they cannot recover the losses because the disaster was an \"act of God\". This leads Kanji to sue this \"God\" character. Along his journey, Kanji is supported by a mysterious man named Krishna.\n\nThere are many hard hitting scenes in the movie. The scene with Paresh selling the murti's, the scenes during the yatra. Not to forget Akhay's scenes with Paresh. The court scenes are outrageous.\n\nThere are some problems here and there. The main one being that the film at times gets preachy. Also, Akki's intro is a bit stretched. Also, the last 10 minutes of the movie are also a bit stretched.\n\nOMG does shed some light into the commercialization of religion in the country of India. The film exploits the truth here for sure.\n\nThe music is meaningful and fairly enjoyable. Mere Nishan is my pick of the lot.\n\nThe dialogue is brilliant. Writing is excellent for the most part. Umesh Shukla's direction is extraordinary. Props to him for making such a brave film that too without hurting any sentiments.\n\nPerformances are also complimentary. Akshay Kumar is there in a special appearance and impresses. Especially in the last few minutes. Mithun is good but acts a little weird at times. Govind Namdeo is good. Om Puri is good. Rest of the cast is good.\n\nOMG surely stands on the shoulders of Paresh Rawal. To say he's a fine actor would not live up to the level of talent this man truly has. Rawal sinks his teeth into the role and is nothing short of perfect. Astounding! Overall, it's a film that will make you laugh, make you think and eventually spark a debate. Highly Recommended!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "henalimamania",
        "review_rating": "9",
        "review_title": "Should watch once , You may or may not like it But the movie is a gem",
        "review_detailed_main": "The story has a very strong message which every person especially an Indian must see and understand . Blind faith and real devotion is different . This story may actually prove that majority of people who actually devote to God are not really following the true path of religion . Paresh Rawal gives an amazing performance supported by Akshay Kumar . This story is set in humor and drama will keep you interested till the end and will stay with you forever. It is one of the few good movie made in Bollywood . I recommend people to watch it. There are things in this that some people may have difference of opinion but those people must grow up a bit ."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "david-49535",
        "review_rating": "9",
        "review_title": "Incredible movie; a humorous indictment of religiousity",
        "review_detailed_main": "This film is OUTSTANDING! While it skewers Hindu priests, it takes on all religions for their mistreatment of people. Jesus said, \"If you've done it unto the least of these, you've done it to me.\" True religion is taking care of others and not making the religious organization rich. A must watch.\n\nThe acting is superb and the story line would work so well in the US. I hope someone remakes this in the US. I think it would be a big hit. The character of Krishna is easily seen as representing Jesus. I think the crossover message is easy to see. I won't give away the plot but you will enjoy this movie."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ca-50282",
        "review_rating": "1",
        "review_title": "Paresh Rawal- King Of Bollywood",
        "review_detailed_main": "OH MY GOD just awesome movie. I am writing this in 2021 coz I watched it nearly 10 times and trust me you won't regreat watching it. A story which can related to a middle class person. Paresh Rawal nailed it. Akshay Kumar entry was amazing. He was perfect for the role of Krishna. Mithun character was iconic he did it in a very comic way. He was also funny. This movie is not only comedy but emotions love and the truth of Humanity."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "GypsiB",
        "review_rating": "8",
        "review_title": "Quite Good",
        "review_detailed_main": "The store of outspoken atheist Kanji Lalji Mehta (Paresh Rawal) is destroyed in an earthquake. The insurance declares it an \"Act of God\" and refuses to pay. Kanji decides to sue God, through His earthly spokespersons, to get the money owed. Surprisingly, Lord Krishna (Akshay Kumar) takes human form, and comes Kanji's aid.\n\nThis somewhat controversial comedy-drama provides thought-provoking points about religion. The final two-fold message is positive, though. Firstly, that God is everywhere, and temples and idols are not necessary. Secondly, people should not fear God, but love Him as a friend.\n\nRawal is fantastic in his role, both humorous and serious. Kumar's small but important part is played with gentleness and even godliness. Mithun Chakraborty played a minor character with perfection. The music is mainly incidental and background (with the exception of one item number) and some of it is quite beautiful. Overall, if one is willing to have religion examined in skeptical ways, this is a fine movie."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "sulemanpve",
        "review_rating": "10",
        "review_title": "I great lesson to fool idol worshiper!",
        "review_detailed_main": "I great lesson to fool idol worshiper! Hinduism. Hinduism mostly illogical."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "mirzasuhail-04463",
        "review_rating": "9",
        "review_title": "I prefer it over Pk",
        "review_detailed_main": "This movies is classic. No other movie based on religions will ever beat this one. The dialogues are superb at many places. Love each other. Love all religions. Love you all."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "aaravpanti",
        "review_rating": "8",
        "review_title": "God must be saying, 'good job!'.",
        "review_detailed_main": "OMG! is a full on entertainer with loads of funny moments. The screenplay of the story inspired by a Gujarati play is written by Umesh Shukla is brilliant. The screenplay is fast and direction is good. The dialogs are top-notch.\n\nAkshay Kumar as Lord Krishna is charming and affable. Paresh rawal acts with so ease and confidence. He is the main protagonist and does full justice. Mithun Chakrabothy is really funny and so is Govind Namdeo. Applause to a well deserved cast.\n\nMusic is average. Govinda song of Sonakshi and Prabhudeva is a highlight. The movie is sensible, has a moral and is one of its kind. For me its one of the best movies of 2012 yet and a personal favorite. Undoubtedly a must watch!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "Denatharius",
        "review_rating": "8",
        "review_title": "One of the Most Remarkable and Authentic Indians Films ~ One actually gets to see quite rarely!",
        "review_detailed_main": "With all the cheesy bullshit , crappy items songs with meaningless sung and acted upon by moronic half clothed seductress that appeal the thousands of dimwitted people across India and Pakistan , copied and unoriginal action sequences and extremely poor performances and irrelevantly common continued repetitive love and romance stories looming around the and spread across every Indian and Pakistani cinemas and films. Its the utter decline and breakdown of the film industry which is gradually loosing its credibility and the growing inconsistencies in originality and concept. Actors and actress of the Indian Cinema have lost purpose and actually and quite simply become money grubbing whores and douche bags. It is hard to accept the reality as it grows day by day and good Indian films are in rare numbers and extremely hard to find.\n\nIt is highly unlikely to find any worthy cinemas but when I did a bit of a survey , I actually ended up being suggested a worthy film and that someone was my highly philosophical Grandfather. The Film was nothing short of a Logical , Religious and Philosophical Masterpiece. A truly worthy film back from 2012 . More like an Underrated Great Film. That only reached to a select few through word of mouth. Why was it so unpopular among the people? Because It felt short of bad-ass and amazing baby-face actors, it had felt short of babes and seductresses , perhaps even no admirable guns blazing all out war action sequences that people so deeply crave for. What was it either of them ? No because It had none of them.\n\nA Remarkably, excelsior and praise worthy performance by Veteran actors such as Paresh Rawal, Mithun Chikraborty and Akshay Kumar. A moving , original , purely unique and heart warming emotional concept and screenplay although a remake of the Australlian film \"The Man who sued God (2001)\" but trust me it has been made to perfectionism. An almost flawless film which takes a Middle class man who carries completely no belief in Baghwaan or God who ends loosing up his only idols and antiques shop by an earthquake considered as an Act of God with no-one eager to help him and no option left ; he in an act of defiance and attain what is rightly insured to him , challenges and sues God in court creating havoc and religious chaos throughout the nation and the religious community. All Hell breaks in one of the most remarkable Indian films of all time. The Best Part : The Dialogues are truly moving, worthy, full of potential and enigmatic to the core of its deliverers. Truly an OMG Film of 2012!"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "itxtroy",
        "review_rating": "9",
        "review_title": "One of the most eye opening movies of all time!",
        "review_detailed_main": "You'll get so many knowledge about religion, how it is being used as a fear for sadhu's business in this kali yuga!\n\nAnd please read your Dharma Grantha (Gita, Bible, Quran, etc.)"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "deewanaakkika",
        "review_rating": "10",
        "review_title": "Real OMG",
        "review_detailed_main": "Literally best movie of 2012. Though it was a comedy movie it has great social massage. Akshay Kumar - Paresh Rawal Rocked again. Don't miss it."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "invisibleunicornninja",
        "review_rating": "4",
        "review_title": "???????????",
        "review_detailed_main": "At first this was pretty funny and I was interested but then out of nowhere a musical number started and I stopped understanding what was happening,"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ridi-arahan",
        "review_rating": "8",
        "review_title": "An strong belief, whether for or against anything especially regarding god is a religion belief in itself",
        "review_detailed_main": "What worked:\nit's a good movie with a powerful social message about god, religion and the belief system. It's entertaining, clever and humorous at times, also difficult at times because of the topic. It's a very daring movie, challenging the social system, active tradition. Paresh Rawal was terrific in his portrayal of a character who is in quest for truth and justice.\nWhat did not work:\nsome of the scenes are gloried for dramatic values which was the need of the movie considering it's point but some were difficult to watch. It's a movie against the system but some scenes were more hurtful than others. The stereotypical sanths and gurus, their vested interest is a bit cliche but a need of the narrative.\nFinal verdict: recommended"
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "amitmardi-02904",
        "review_rating": "10",
        "review_title": "Best Movie of Bollywood",
        "review_detailed_main": "One of the best movies of Bollywood ever made.Don't miss it. It's a must watch."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "abphadore",
        "review_rating": "8",
        "review_title": "Unwanted Truth or Known Lie? OH MY GOD!",
        "review_detailed_main": "\"OMG: Oh My God!\" directed by Umesh Shukla, is a thought-provoking satirical comedy that boldly tackles the complex themes of religion, faith, and the commercialization of spirituality. Released in 2012, the film stands out for its unique narrative and compelling performances, particularly by Paresh Rawal and Akshay Kumar.\n\nPlot and Execution:\n\nThe story revolves around Kanji Lalji Mehta (Paresh Rawal), an atheist and a sharp-witted antique shop owner who sells religious artifacts. His life takes a dramatic turn when an earthquake destroys his shop, and the insurance company refuses to cover the damages, labeling it an \"Act of God.\" Enraged and desperate, Kanji decides to sue God, setting off a chain of events that challenge the very foundation of organized religion and blind faith.\n\nEnter Lord Krishna (Akshay Kumar), who appears in human form to guide Kanji through his quest for justice and self-discovery. What follows is a series of witty, insightful, and often humorous exchanges that question religious dogmas and highlight the essence of true faith.\n\nStrengths:\n\nPerformances:\n\nParesh Rawal as Kanji Mehta delivers a stellar performance, seamlessly blending humor, sarcasm, and earnestness. His portrayal of a common man challenging age-old religious practices is both convincing and relatable.\n\nAkshay Kumar as Lord Krishna brings charm and charisma to the role, playing a modern, suave deity who guides Kanji with wisdom and wit. His calm demeanor and subtle humor add a refreshing touch to the film.\n\nMithun Chakraborty as Leeladhar Swamy, a self-styled godman, is memorable for his exaggerated yet impactful performance, representing the hypocritical aspects of organized religion.\n\nDirection and Script:\n\nUmesh Shukla's direction is commendable, maintaining a delicate balance between humor and serious social commentary. The screenplay, co-written by Bhavesh Mandalia and Umesh Shukla, is sharp, witty, and thought-provoking, addressing sensitive issues without being preachy.\n\nThemes and Social Commentary:\n\nThe film courageously addresses the commercialization of religion and blind faith. It encourages viewers to differentiate between genuine spirituality and exploitative religious practices, making a strong case for rational thinking and personal belief.\n\nThe dialogues are a major highlight, filled with clever wordplay and insightful observations that provoke thought and laughter in equal measure.\n\nCinematography and Editing:\n\nSethu Sriram's cinematography captures the essence of Mumbai and the varied locales effectively, enhancing the narrative. The visual representation of the divine intervention scenes is subtle yet impactful.\n\nThe editing by Tushar Shivan ensures a smooth narrative flow, keeping the audience engaged without unnecessary distractions.\n\nMusic and Sound:\n\nHimesh Reshammiya and Meet Bros Anjjan's music complements the film's tone well, with songs like \"Go Go Govinda\" adding a festive and lively touch to the proceedings. The background score supports the narrative effectively without overpowering the dialogues.\n\nWeaknesses:\n\nPredictability:\n\nGiven its satirical nature, the film's resolution can seem predictable to some viewers. The underdog triumphing over established norms is a common trope, but the execution in \"OMG\" keeps it fresh and engaging.\n\nPacing:\n\nAt times, the film's pacing feels uneven, particularly in the second half where some scenes could have been trimmed for a tighter narrative. However, this is a minor flaw in an otherwise well-constructed film.\n\nConclusion:\n\n\"OMG: Oh My God!\" is a rare gem in Hindi cinema that combines humor, drama, and social commentary in a seamless narrative. Paresh Rawal's outstanding performance and Akshay Kumar's charismatic portrayal of Lord Krishna elevate the film, making it a must-watch. The film's bold take on religion and faith, combined with its clever dialogues and thought-provoking themes, make it an enduring and relevant piece of cinema.\n\nFor those seeking an entertaining film that also challenges societal norms and encourages introspection, \"OMG: Oh My God!\" is an excellent choice. It is a film that not only entertains but also enlightens, leaving a lasting impact on its audience."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "deepeshkumar-00417",
        "review_rating": "10",
        "review_title": "Educate yourself with entertainment",
        "review_detailed_main": "Great movie to watch,for everyone who want to get rid from the taboos that were taught throughout the life in India. The movie delivers the message or I would say education in a very creative way as well as it provide a vast variety of entertainment.\n\nI will strongly recommend this to everyone go and watch it as it has to be watched by each and everyone so they can change or correct their own views on the important topics .\n\nThe movie direction was good Akshay's acting was great, his character as a devotee of shiva is amazing to watch you will love it . Pankaj tripathi has done a great job as well and yaami gautam was fabulous as well."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "dhruvbehl24",
        "review_rating": "8",
        "review_title": "omg",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "biraja50",
        "review_rating": "8",
        "review_title": "One of the outstanding Hindi Movie of 2012",
        "review_detailed_main": "When you look at the limited number of good Hindi movies produced in 2012, this one stands out.. a good story line..\n\nVery good acting.. Akshay Kumar was nominated for some awards as a Supporting Actor.. But Paresh Rawal is the main stay of the movie and he has done excellent acting.. There are few in the industry, who could have performed in a more authentic way..He is one of those actors who fits into any character with ease and finesse..\n\nOnly..\n\nthe length of the movie is a bit long\n\nthe movie does not give credit to its inspirational source 2001 English movie \" The Man Who Sued God \" with Billy Connlly and Judy Davis.."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "stylesad",
        "review_rating": "10",
        "review_title": "One of the best movie with best message",
        "review_detailed_main": "If you truly understand the meaning of the movie you will definitely love it. As usual Akshay Kumar's fantastic acting and ofcourse Paresh Rawal too the magic duo gave another gem in the history of Indian cinema. It shows how God is always with us in whatever form and all religions are same and also shows the corruption in religious places and other malpractices on the name of god. Some people thought that they are making fun of god but it's not it's all about the thinking of nastik and astik and God himself. Can't wait for part 2 releasing this year and as per the poster Lord Shiva is the form of god."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ke-82883",
        "review_rating": "2",
        "review_title": "Hate for Hindu religion. So I can't suggest you this movie.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "khasimburugula",
        "review_rating": "10",
        "review_title": "Super",
        "review_detailed_main": "Awesome 👍 Team.. good Movie... Watch it watch it watch it watch it again and again... The story which is played by the direct awesome.. hero and heroin in the movie acted very well .. good entertainment and satisfying movie m. It is never before ever after .. it's been long to see such a beautiful movie after a long gap. Thanks to the whole team in the movie for their hardwork and dedication towards movie. Especially thanks to the director for showcasing each and everyone role in a great way. Definitely it will beat the run for long. Everyone most liking it after watching the movie. Thanks again to the team."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ajaykumar1412",
        "review_rating": "8",
        "review_title": "Awesome movie ever",
        "review_detailed_main": "This movie was the lesson of Truth to the world. We must watch this movie again and again for the self-update mental sysyem."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "vijaysinghchauhan-37527",
        "review_rating": "10",
        "review_title": "Good movie",
        "review_detailed_main": "Oh My God is based on successful gujarati play Kanji Viruddh Kanji. Oh My God is a story of Kanjibhai who does not believe in god. One day Kanjibhai's shop gets destroyed in earthquake. Then Kanjibhai complains about God in court.\n\nParesh Rawal is absolutely splendid as a Kanjibhai and his arguments about reality of religion will make you think for a while. Akshay also plays the role of lord Krishna superbly. Surprise package of the film is Mithun Chakraborty. His comic timing is bang on.\n\nFirst half of the film is filled with some good comedy sequences and second half will make you amazed with some heart touching and heart shaking scenes. Main USP of the film is its unique concept. The film ends with a noble message. Story is perfectly directed by Umesh Shukla and he deserve a big cheer.\n\nOh My God is a must watch film for everyone because intelligent Kanjibhai and modern lord Krishna cant be missed."
    },
    {
        "movie_id": "tt2283748",
        "movie_name": "OMG: Oh My God!",
        "movie_rating": "8.1",
        "review_username": "ix-42595",
        "review_rating": "1",
        "review_title": "Very bad, I don't advise anyone to watch.",
        "review_detailed_main": "Very bad movie, stupid story, I don't know how they worship idols!! Are these people really conscious??? I can't believe what I'm seeing! The stories are over. You are really working on the ridiculous. I wasted my time on something very ridiculous. I hope you make films without your idols and failed beliefs. Leave them behind. Stay away from the films. Focus on the stories, directing, and quality of acting.\n\nYou learn from the Americans in making films. You do not reach the Americans. You are the last people in this field. All of them surpassed you. Korean, Spanish and Turkish cinema has become better than you. Why? Because they focused on the quality of acting and the diversification of film stories. Every work is a new story. There are no similar works. As for you, they are completely opposite."
    }
]