[
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "mehta-nishank",
        "review_rating": "7",
        "review_title": "Good comedy - at last!",
        "review_detailed_main": "After a string of pathetic comedy films in 2006 (Tom,Dick and Harry , Malamaal Weekly, ChupChupke, Pyare-Mohan, etc.), Golmaal comes as a pleasant surprise. Golmaal is essentially a laughter riot, driven by an outrageous but rib-tickling plot. Howver, it is not the storyline that clinches it for the film - it is the amazing chemistry that the four male lead actors (Devgan, Kapoor, Warsi and Sharman Joshi) share that gives the film the requisite 'kick'. The film naturally has its share of flaws - negligible part of heroine, wastage of a stalwart like Paresh Rawal, a damp ending, but all in all, the film is a humorous treat.\n\nAjay Devgan discovers new acting horizons with this role, while Arshad Warsi and Sharman Joshi cement their identities as comedy-specialists. In the end you just hope that the director has showed a better casting acumen by casting someone other than the hapless Tusshar Kapoor (needs to revisit the acting school) , as the mute prankster.\n\nVishal-Shekhar's music is trendy . Watch out for the the black-n-white track featuring Paresh Rawal and his on-screen wife that has a 1940's feel to it."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "eh5963-297-967354",
        "review_rating": "8",
        "review_title": "A Musst Watch Comedy",
        "review_detailed_main": "It's a lazy afternoon and you have nothing to do. There's always a movie you can pick up and watch even though you have seen it over 10 times. Golmaal is one of them. Is there a plot? No. Is there a life-lesson? Hell no! What Golmaal actually offers is a story of 4 good for nothing pranksters who end up conning their way into the mansion of a blind couple. What crazy events occur next? That's Golmaal.\n\nGopal, Madhav, Lakshman and Lucky are four useless youngsters who do nothing but eat, drink and chill. Due to their unpaid loan to Vasulli bhai, they are on the run. They end up at the mansion of a blind couple who think their grandson has shown up from America. Then starts, Golmaal.\n\nThe story really does not offer much. However, I feel that just maybe the strength of the movie. It is a film that has its comical moments do the talking more than anything else.\n\nThere are some classic comedy scenes in the movie. The opening scene defines what the rest of the movie will be. Not to forget other scenes such as when the boys enter the house and have their first meeting with Paresh Rawal.\n\nNot to forget when the principle enters Sharman's room. Arshad and Sharman trying to get at Ajay is hilarious.\n\nThe funniest scenes have to be the valentines day scene when the boys all gift something to Rimi and the Black parody. Just hilarious! Rohit Shetty doesn't have to depend on his directing much. It's the writing that's the strongest point. By writing, I mean the dialogue. The lines are rib tickling.\n\nThe music is a pleasant surprise. Reh ja reh ja is my favorite. The title song is amusing. Kyun aage aage is a treat to watch and a master stroke.\n\nRohit Shetty's direction is first rate. He handles all the scenes with ease.\n\nGolmaal is full of talented actors. All the actors perform to an equal level of competency. Ajay Devgan is a revelation in this one. His comedy is subtle yet extremely funny. Arshad Warsi is a scene stealer, as always. Sharman joshi gives a very good act. Tusharr Kapoor is first rate and he doesn't even speak a word in the film. Rimi Sen does well Paresh Rawal is as always, perfect. Manoj Joshi is brilliant. Ditto for Sanjay Mishra and Mukesh Tiwari.\n\nOverall - A film you can watch anytime, anywhere. Strongly recommended!"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "eternally_screwed89",
        "review_rating": "8",
        "review_title": "Hilarious!",
        "review_detailed_main": "Four ex-college students get kicked from their college(yes they are still in there college for 10 years) and while on the run from a gangster hides in a house of a blind couple.\n\nThe story is good but its not perfect and has its loopholes. But comedies are not meant to be perfect anyway. But it provides the laugh and the fun factor a comedy promises.\n\nPerformance wise, i thought the performance of the underdog Tusshar Kapoor was the best among the four. Sharwan Johsi, Arsad Warsi and Ajay Devgan suited their role and are fantastic in this film. The four have great rapport on screen and their comic timing is fabulous. Paresh Rawal is as always good though he didn't have many comic lines. Rimi Sen didn't have much to do expect look pretty and dance on numbers.\n\nThe music is very good. Especially the title track.\n\nScreenplay is good and moves the story forward at a good pace.\n\nThis film is highly recommended from me. Its hilarious all the way. Its just superb!"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "louisnoronha",
        "review_rating": "10",
        "review_title": "The best comedy film every made ..",
        "review_detailed_main": "Damn I miss those days .. when films used to be so good . Take me back to those days 😍😍"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "DENZEL101",
        "review_rating": "9",
        "review_title": "Best comedy delivered yet.............",
        "review_detailed_main": "I have seen movie this yesterday....blown away by the comedy from every actor in the movie (yep Ajay....... too). I seems to me that bollywood have found the pulse of audience, they want to laugh and this movie certainly delivered.......\n\nStory is very typical four usual young/handsome, doing some con and end up in funny situations all the way.......\n\nSince matrix it most of action now done with multiple cameras and strings (actually in hong Kong movies doing for years.....) a lot of use of green screen, editing was excellent, couple of times felt wires/strings shows when they lift Ajey........\n\nParesh is as usual good/funny, highly recommended for family, couple of \"beeps\" dialog's were original, references from movie black gave a good touch....... songs were awful.......\n\nI have given 9 out of 10 cause of fun and originality........"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "krrish_rocks12",
        "review_rating": "",
        "review_title": "watch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "Internet_User_Forever",
        "review_rating": "7",
        "review_title": "Good movie, could have been better.",
        "review_detailed_main": "Some scenes are a little bit vulgar but still funny. Paresh Rawal, Arshad Warsi and Sharman Joshi's performances were the best. Rimi Sen's character was nonsense and the movie as a whole would have been much better without her. Sanjay Mishra, Vrajesh Hirjee and Mukesh Tiwari are in all 4 of the golmaal films and were okay. If the movie focused on Paresh Rawal instead of Rimi Sen, it would have been 9 stars. Plot is okay, action is okay."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "suleman-t",
        "review_rating": "10",
        "review_title": "The funniest Bollywood film. Ever!",
        "review_detailed_main": "My summary says it all... The funniest Bollywood film. Ever!\n\nThis film has an excessive amount of humour prepared to make just about anyone laugh. Although some critics have said the actors do not suit their roles, i think there could be nobody better for them. Ajay Devgan has delivered a humorous yet brilliantly acted role. Arshad Warsi has once again delivered a 100% laughable act that simply keeps you watching. The surprise package is Tushar Kapoor who delivers a praise-worthy performance too as a vocally-challenged person. Sharman Joshi adds to the brilliance of the film and makes himself a now perfect man for comedy.\n\nThe storyline has both greatly witty and serious scenes. Thus making Golmaal a brilliant film for everyone.\n\n10/10"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "ravi2052",
        "review_rating": "7",
        "review_title": "Something same yet something different",
        "review_detailed_main": "It was about time the Hindi film industry produced a good comedy. There has been a drought in the comic genre of movies since the sensation caused by Munnabhai MBBS, Hera Pheri prior to that and Andaaz Apna Apna if you ponder further down. If you've followed the trend of the comic movies that have been produced in recent times, you would agree me when I say there has been a sudden deluge of movies which convey humor using a unbearable number of innuendos. This has led to the narrowing down of comic movie audiences across India where usage of expletives is not appreciated par innuendo or otherwise. At the very outset Golmal would give you the exact same feeling. The three protagonists dancing among a flock of bikini clad ladies and a start sans any direction for around 30 minutes will give you the same Akshay Kumar comedy feel. Id suggest, don't leave yet because out of no-where an interesting new plot pops up and I assure you its a laugh riot after this point. The rapport between the three jests of the movie is good with Ajay Devgan trying a comic role, Sharman Joshi(RDB guy...Sukhi) playing the innocent scapegoat to perfection and of course Arshad Warsi playing a role in his \"home ground\" . Rimi sen was a disappointment but I guess a movie in which a 'heroine' was absolutely unnecessary one cant except much. Paresh Raawal was wasted in a serious role and not taking anything away from him since he played the role of the blind old man to perfection along with Susmita Mukherjee (u must have seen her in many TV comedies) playing his wife very well.\n\nThere are things that are similar to the previous comedies like the intermittent usage of innuendos but what impressed me the most the refreshing usage of a flashback sequence with a 1950's duet song feel where the hero woes the heroine. This was quite a delectation. Other than that there are a few other good jokes in the movie. As usual the finale and the global plot of the movie was below par and in fact outright rubbish. It was a like a good idea extremely badly executed. You also have the clichéd \"running around in confusion\" fight sequence in the end. The music is trendy with some foot tapping numbers and again the black and white 1950s track is what got me to give the movie a 7/10. All in all if u you are not in total aversion to slapstick comedy you will have a great time and will laugh your stomach off through out the movie. I'd say go watch the movie if you are bored and want something to cheer you up because you will be in splits for most of the movie but if you are looking for a comedy of the caliber of Namakhalaal and Hera Pheri, well you can pass.\n\nRating: Acting: 6/10 Comedy: 8/10 Plot : 5/10 Climax: 0/10 Overall : 7/10"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "shaiprajapati",
        "review_rating": "9",
        "review_title": "Love to watch this movie",
        "review_detailed_main": "Love to watch this movie again and again its fully comedy #AjayDevgan discovers new acting horizons with this role, while Arshad Warsi and Sharman Joshi cement their identities as comedy-specialists. In the end you just hope that the director has showed a better casting acumen by casting someone other than the hapless Tusshar Kapoor (needs to revisit the acting school) , as the mute #prankster.\n\nVishal-Shekhar's music is trendy ."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "cutie_pie-6",
        "review_rating": "6",
        "review_title": "Overall fine",
        "review_detailed_main": "I thought this movie was pretty good but hilarious. The moments in the movie were hectic but I enjoyed them. I watched it with my brother and mom and we all liked it. My brother was laughing like anything and too bad my dad missed this movie. I think this movie should have hit the theaters but too bad. Other then that I think the movie was great overall.\n\nI think even the whole cast was perfect but could have used 1 or 2 more actresses. I mean 4 guys and a girl isn't much fun. Though this movie won't waste your time in anyway. I don't advise but if someone wants to see this movie they should but no ones pushing them."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "nitishnegi",
        "review_rating": "10",
        "review_title": "It was a superb movie",
        "review_detailed_main": "@ Ganesh Salian (salianmoviereview) Don't know from which part of the world have you came from. You must be liking movies like houseful and tees mar khan if you didn't like Golmaal Golmaal is a complete fun, and if you observe each scene it's going to make you laugh more :D The Movie is worth watching a number of times Arshad Warsi, Sharman Joshi and Tushar Kapoor have played the characters perfectly I lol'd a lot watching the movie. Overall, the movie is great! One of the best Indian Comedy Movies Though the sequels were not as funny as the first part It is the best comedy movie i have liked by date after Andaaz Apna Apna Enjoy watching the movie"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "kooleshwar",
        "review_rating": "6",
        "review_title": "A Safe Bet !!! If you play your cards right.",
        "review_detailed_main": "What you can expect from this movie is perfectly visible in the the 1st 5 mins of the movie.\n\nAnother movie that starts with a song, all the titles are in English (spends 2 mins abusing them for that).........sheesh i don't know how Good this movie is going to be............wait what is that is that 10-15 hot scantily clad women i see..........hmmmm i like....but wait Isn't this song totally copied from a bunch of hip-hop songs including The steps..........more hot girls in exotic locales Hmmmm................but wait why is Ajay Devgan dancing like a total Jackass and have coloured hair and look like he has a drinking Problem..... Hey the songs over and Arshad Warsi is dressed hilariously As a college boy haha......\n\nHmmmm................but wait why is Ajay Devgan dancing like a total fool and have coloured hair and look like he has a drinking Problem..... Hey the songs over and Arshad Warsi is dressed hilariously As a college boy haha......\n\nNeedless to say this movie is inspired, copied, plagiarized from at Least a dozen films by the bane of Indian comedy Mr. Neeraj Vora who is Absolutely unoriginal and ....................a complete genius.\n\nHis stories are ripped of everything from Hindi movies (Govinda Especially the theme is directly copied from another Hindi movie can Some one mail me if they know), Hollywood, British industry etc etc, no One is safe as long as he is out there, but his genius lies in the fact That most of the times it guarantees entertainment for all and Especially for the less exposed moviegoer (which is most of India).\n\nThe acting is very very good given the limited premise of the movie, Paresh Rawals talent is wasted in the movie but at least we get to see Him in a different role. He displays his brilliance in the spoof song. Like i have said every time is think Tusshar Kapoor and Sharman Joshi (of rang De Basanti fame) may not be ready for single hero films but Have great futures in multi-starers.\n\nThe soundtrack is very boring, save for the spoof song which is Brilliant but was wasted in the second half because it was met with Mixed reviews when it started.(although halfway through the song Everyone loved it....i see a promising trend where the Indian audience Are rejecting that songs that don't move the plot in the second half).\n\nDirection and cinematography was half baked with way to much focus on Technology and using computer enhanced visuals most of them especially Those used in the song clearly gave away the amateur attempt but the Crew.\n\nAjay devgan looked hideous and danced even worse his dance made the Boring songs even more unbearable, Rimmi Sen was sour eye-candy she Looked ordinary even bad post Dhoom she is yet to look good in any Movie i think its time she shed her clothes again or worked on her Looks hehe.\n\nThe movie is rated UA but has clear references to r@#e and Madar.... Etc and may not be suitable for all audiences.\n\nMost of the jokes were stupid, caricaturish, inspired, slapstick and Totally hilarious, some of the stupidest scenes were the most hilarious Such as the spoof on black, Munna Bhai, the poisoning (again don't look For logic), the 4 seater bike, the invitation scene etc. However it has Been tempered with some really sad jokes that bring the tempo back to Normal.\n\nThe movie moves in such a way that every time you are down and about to Be disgusted, they will give you another inspired but totally hilarious Scene to get you interested................and just when you begin to Love the movie another stupid scene or product commercial will start. This movie is a perfect roller coaster which will leave you satisfied At the end.\n\nBut there is a catch.\n\nYou have to forget that you even had brains if you do that you will not Be guaranteed a masterpiece but great fun nevertheless. Given the Current choice of films. Superman, corporate definitely this is you Best bet lets see how this movie copes with pirates of the Caribbean Though which is being released in a big way in Hindi.\n\nSo given the current choice i would recommend you leave your brains at Home don't expect to much as go have a guaranteed good time.\n\n+s great jokes, acting, and Tusshar and Sharman, one great song\n\n+/-s song in the second half, Rimmi Sen\n\n-s Ajay Devgan (he looks 45+ and is supposed to be 34 max), inspired And unoriginal, absolute detachment required.\n\nTotal 6/10 (on absolute terms this movie is a 4 but i laughed a lot and It would be unfair to give it a lower rating."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "anagpal",
        "review_rating": "5",
        "review_title": "Fun in parts...but missing a plot ?",
        "review_detailed_main": "I enjoyed watching the movie and even laughed out loud in parts. But you would have to pay me something in 6 figures and in £'s to make me see it again.\n\nIts just a lot of gags strung together, without a storyline to really bind them together...\n\nalso, to my distaste, the film-makers (continuing a long-standing bollywood trend) opt to take the easy route to laughs by making fun of people with physical disabilities...(one of the 4 friends is dumb and the couple whose house they run to is blind).\n\nMost of the actors are wasted in the movie...barring Arshad Warsi (usual spontaneous self) and Sharman Joshi (i saw him for the first time and was really impressed)."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "debrajstyles",
        "review_rating": "9",
        "review_title": "Complete Joshing movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "shovonbhattacharjee",
        "review_rating": "8",
        "review_title": "Super comedy film",
        "review_detailed_main": "This is a super comedy film. Acting is also superb and storyline of this comedy film is just amazing."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "vishaal811",
        "review_rating": "6",
        "review_title": "Cheap Laughs over witty humor",
        "review_detailed_main": "Golmaal is not meant to be taken seriously. Its sole purpose is to entertain the masses and I believe it manages to fulfil that expectation.\n\nThere is not a great deal of sophistication in the plot which features four guys who manage to get into the home of a blind couple by pretending to be their grandson. It sounds incredibly unrealistic and it features a number of silly scenes.\n\nThe actors don't have a lot to do but I guess they manage to play their roles well with Paresh Rawal being especially good as a blind guy. Song and Dance sequences burst out of nowhere and it is quite unnecessary as it distracts us from the main plot.\n\nHowever, the cheap laughs, gravity defying direction and a laughable plot makes this movie quite unbearable for someone looking for a sensible story. You must turn off your brain if you want to enjoy this movie."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "dipteshmodak",
        "review_rating": "9",
        "review_title": "One of the best comedy movies ever made in Bollywood.",
        "review_detailed_main": "Pure comedy. Completely original humor. No unnecessary drama or love story as typical Bollywood films usually do. Performance from all the actors are flawless including side charaters. A masterpiece of the decade."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "sauravjoshi85",
        "review_rating": "9",
        "review_title": "One of the best comedy film of Indian Cinema!!!",
        "review_detailed_main": "Golmaal: Fun Unlimited is a comedy film directed by Rohit Shetty. The film stars. It stars Ajay Devgn, Tusshar Kapoor, Arshad Warsi, Sharman Joshi, Rimi Sen, Sushmita Mukherjee and Paresh Rawal.\n\nFour Friends often dupe gullible people out of their money gets caught and become homeless. Hilarity ensues when they target a blind middle-aged couple and simultaneously try wooing their beautiful neighbor.\n\nThis is the first film of the highly successful Golmaal Franchise.\n\nThe film released in 2006 is often termed as one of the best comedy film ever made in Indian cinema. The film was aptly cast. The film was written beautifully by the legend Late Neeraj Vora and was executed in an very hilariously funny manner. These are few of the Indian film which you never wanted to end and wanted to watch the film to go on and on.\n\nActing is top class and this film gives a fitting reply to those people who once said that Ajay Devgn can't do comedy. Arshad Warsi, Sharman Joshi and even Tusshar Kapoor who is often criticized for his acting were impressive. Paresh Rawal and Sushmita Mukherjee were also were impressive in the role of blind couple. Support cast of Manoj Joshi, the legend Sanjay Mishra, Vrajesh Hirjee, Siddharth Jadhav and Mukesh Tiwari who gave one of the most immortal and funny character of Indian cinema \"Vasooli Bhai\" supports the film very beautifully.\n\nScreenplay of the film is very impressive, engaging and hilariously funny. The film will keep a constant smile on your face with big laughter in between.\n\nClimax of the film is probably the strongest point of the film and gives a film a superb closure.\n\nIf you like comedy films then this is a perfect and must watch film for you."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "Satyabrata14",
        "review_rating": "8",
        "review_title": "Wow",
        "review_detailed_main": "One of the best comedy films franchise of bollywood along with Hera pheri Old comedy films are real gem Not like new garbage typically stupid movies.\n\n......>.........<..........."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "prateekfigo-1",
        "review_rating": "5",
        "review_title": "Hilarious but mindless!",
        "review_detailed_main": "I rented Golmaal's DVD just because Ajay Devgan is my favorite actor.But after watching this movie,I was shocked by his choice of signing his movies.He has portrayed quite a number of substantial roles in the past and continues to do so,but I haven't really figured out his judgment in selecting his commitments till now. Anyway,Golmaal is a good slapstick comedy,meant for time-pass only.Arshad Warsi,as usual,stands out in this movie too.The surprise package is Tushar Kapoor who delivers a praise-worthy performance too as a vocally-challenged person.Sharman Joshi leaves a lot to be asked for.His best performance still remains his portrayal of Sukhi in \"Rang De Basanti\".Ajay Devgan is flawless,but these kinds of roles don't really suit him. The movie,as a whole,is well packaged and well cinematographed.The content is weak,and despite the not-so-good reviews by the critics,the movie went on to be a major commercial hit. We know that mindless comedies still do work in the subcontinent.This movie is a perfect example."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "EditorVinodSingh",
        "review_rating": "8",
        "review_title": "golmol and not golmaal",
        "review_detailed_main": "when i heard of this movie i thought the this movie is replica of earlier movie of amol palekar (character) -golmaal . however after seeing the movie i realized that treasures of old movies is not their in new movies and so in new golmal this movie is hilarious and keep you smiling all thru movie my favorite is Paresh Rawal. he is genius ,delivers what is nearly perfect. in the movie he is one character who holds it and keep it alive others specially Tusshar Kapoor and Sharman Joshi are speechless in acting , but circuit arshad varsi is graceful in the movie and has capacity to keep audience happy specially with his tapori kind of role Ajay Devgan -action hero fits into comio role to some extent and keep the movie running the verdict of audience is that this movie is worth watching as good entertainer , please don't look for story\n\nbye"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "biradedeep",
        "review_rating": "10",
        "review_title": "ONE OF THE FUNNIEST BOLLYWOOD MOVIE",
        "review_detailed_main": "Golmaal franchies is the most funniest sequel i have ever seen. Cast wise everybody is perfect in his/her respected role. A must watch movie for everyone who likes to watch comedy movies."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "prachikpr",
        "review_rating": "10",
        "review_title": "My favourite movie",
        "review_detailed_main": "Best Movie Ever 👌🏻👌🏻👌🏻 Extremely funny ... must watch."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "rishabhbaluni-42422",
        "review_rating": "8",
        "review_title": "A Comedic Classic",
        "review_detailed_main": "Ah yes, an awesome comedy. There are a lot of pros that I wanna say about this:\n\nThe plot is really great and the dialogues are very funny. The chemistry between all the male leads were amazing. There are loads of memorable scenes, and I remember a lot of them. Even the side actors that have less screentime manage to be really great. Ajey Devgan did an amazing job. Arshad Warsi's acting is memorable and funny. Sharman Joshi was great whenever he was on screen. Tusshar Kapoor nailed the acting of a mute person. There are countless amount of good acting that this is one of the best comedy movies ever. The only downside with this is the fact that it's not original, plus the female lead barely offered anything. Otherwise, this film is a must watch."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "silvan-desouza",
        "review_rating": "4",
        "review_title": "Thank You Sharman Joshi",
        "review_detailed_main": "Rohti Shetty after action films made a copy GOLMAAL\n\nThe film is typical type of comedy we have seen before\n\nThe start is quite funny and then when they reach Paresh's house it gets funnier and the film keeps you entertained at least for once\n\nThe film is loose though and gets boring and the scenes get repetitive towards the 2nd half and the pr-climax flashback though riveting is too long and the climax is bad\n\nThe film also has spoofs on NEAL N NIKKI which is good\n\nThe comedy isn't too laugh riot type throughout and makes you laugh only in parts The comedy is trite too often too and the Manoj Joshi parts are too loud If you are a Goan you will see how they have manipulated the locations Like the college shown is actually Old GMC building and then they go for a ride on a bike and show us they reach a different location in the first initial scenes and reach the same place\n\nRohit Shetty does an okay job Music is good Camera-work is fab, Goa looks fabulous\n\nAjay Devgan suits for such goon type roles and it comes easy to him but when he attempts to be funny in a slapstick manner he looks uncomfortable Even age is showing Arshad Warsi is good too Sharman is the life of the film, He is superb Watch him in the scene wherein Paresh catches him and Ajay cooks an alibi and Sharman's expressions makes you catch all attention on him without saying one dialog Sharman is natural to the core Tusshar is funny but his slapstick gets irritating at times Rimii Sen is as usual Paresh Rawal is good in his part Sushmita irritates Manoj Joshi gets to the nerves with his shouting The rest are okay"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "exinator",
        "review_rating": "4",
        "review_title": "Torture Unlimited",
        "review_detailed_main": "Oh my god! My head is still aching... I cannot believe my friends recommended this movie to me and \"Wait... the next scene will be a nice one, I'm sure\" is what I kept on thinking throughout the movie until I realized it had ended. Now I am seriously very fond of comedy but I do believe that its not everyone's cup of tea. Rohit Shetty (Zameen, another disastrous flick) was his debut film and the director goes from bad to worse in Golmaal. A movie starring comic actors like Paresh Rawal, Arshad Warsi, Sharman Joshi and Tushhar Kapoor for that sake (Kya Kool Hai Hum), I expected Golmaal to be good if not great but the movie falls flat. The scenes are not funny. Tusshar will get some marks from me for his performance. Arshad Warsi manages to make his presence felt. Vrajesh Hirjee is competent. Other than that rest of the entire cast disappoints. Ajay Devgan is sad and Rimi Sen needs to try out something different than doing movies in which she's the only beauty in the entire world and guys get engaged in a cat-and-mouse game to impress her (Deewane Huey Pagal???), its irritating now.\n\nThe music of Golmaal is decent but it cannot rescue a movie this bad. The title track \"Golmaal\" is pleasing to the ears and the video of \"Aage Peeche\" is funny when viewed individually but in the movie as a whole, it didn't help much. Rohit Shetty tried so hard to make a scene look funny but that's all that this movie is, a wannabe. Even the worst of the comedy genres do have scenes which'll make you laugh but Golmaal is just sad. In Bollywood, what hurts me is that creativity without commercial success is meaningless. Look at Nagesh Kukunoor. After making masterpieces like Hyderabad Blues, Rockford and 3 Deewarein, he got noticed only after Iqbal (another brilliant movie) got big and that was because on the producer's seat sat Mr. Richie Rich Ghai. Golmaal, too no matter how bad was a hit at the Box office and therefore, they've decided to make a sequel of it :(. I just hope they know what they're doing and I wish it fails miserably at the Box Office.\n\n3.5/10 from muviegeek.blogspot.com"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "funkymihir",
        "review_rating": "4",
        "review_title": "a very bad comedy film",
        "review_detailed_main": "not at all happening a very bad comedy film and some very silly jokes are used and the songs are rubbish as ever so don't watch it bcoz u will not like it i just wasted my time watching it in the hall. it was also a wastage of money. after the role of circuit in munnabhai i could not believe that arshad warsi could have been in this film. i feel sorry for arshad warsi to be in this film. tushar kapoor of course never could have been in good films will of course be present here. so my advice to everybody not to watch this film and watch good comedies like malamaal weekly and hera pheri but just don't disappoint yourself by watching this film."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "anu_arsh",
        "review_rating": "1",
        "review_title": "Feel stupid & pay for it too!!!",
        "review_detailed_main": "Making a sequel of golmaal-fun unlimited is like asking for a 'life long migrane' after having just recovered from a bout of severe headache!!! I wish there was a legal provision to ban film makers from daring to make sequels of movies which are nothing more than a 'trash can' of rehashed jokes and juvenile pjs with no depth, no soul and absolutely no recall value! This movie is a disgrace in that the film maker even dared to (ab)use the same title as its cult-classic namesake (old 'golmaal')because he clearly knew that by doing so, he would at least manage to get the audience to the theatres because of the respect and credibility associated with it for over 3 decades now! The producers might have made crores out of this 'third grade' movie, and the director's career might have taken off big time following its success, but the truth is-with an original plot from neeraj vora's gujarati play 'aflaatoon', this movie did have the potential of being a classic, but alas! it fell prey to a bunch of self-indulgent megalomaniacs surrounded by sycophants who thought they had re-written history by making the ultimate comedy of the millennium!!!"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "KADC",
        "review_rating": "3",
        "review_title": "A new take on a old premise that falls short in every way.",
        "review_detailed_main": "Even the most ardent fans of bad puns and slapstick would be hard-pressed to find enough humour in this tedious bumbling-fools-foil-bumbling-thieves story to justify watching this film. I can only assume the high ratings are some kind of collective upvoting-a-bad-movie prank because this is one of the worst movies I've ever seen."
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "salianmoviereview",
        "review_rating": "1",
        "review_title": "Golmaal Bore Unlimited",
        "review_detailed_main": "Golmaal directed by Rohit Shetty is a boring fare.\n\nGod Alone Knows how this became a super hit?I mean the movie is so painful,that I was cursing myself why I wasted my money on this crap.\n\nPromos were amazing and the movie turned out to be amazingly horrible.\n\nThe story is childish.\n\nThe screenplay is a yawn.\n\nThe music is average.\n\nTalking about the comedy,the film has loads of comedy but unfortunately most of jokes are kitsch.\n\nPerformances-Ajay Devgn is average.Tusshar Kapoor irritates.Paresh Rawal is a disappointment.Rimi Sen is bad.Sanjay Mishra,Manoj Joshi and Vrajesh Hirjee ham.Mukesh Tiwari!What can I say about your acting.The only thing that came in my mind when you appear was why is this fool hamming. Arshad Warsi and Sharman Joshi save the show.Arshad Warsi is an excellent comedian.Sharman Joshi does not shout nor even does crack those non-funny jokes!He is superb.\n\nOn the whole,Golmaal is a bore!"
    },
    {
        "movie_id": "tt0495034",
        "movie_name": "Golmaal: Fun Unlimited",
        "movie_rating": "7.5",
        "review_username": "markovd111",
        "review_rating": "5",
        "review_title": "Western unbiased review...",
        "review_detailed_main": "Considered cult classic by it's country of origin, \"Golmaal: Fun Unlimited\" is a tough sell for anyone not from India. A lot of the jokes are in-jokes understandable only to Indian public and there is also a fair bit of word plays present. In that regard movie reminds me of another Indian classic \"Chupke Chupke\" which I also found to be a painful watch (though in \"Golmaal\" there aren't atrocious songs like in \"Chupke Chupke\", though they aren't a lot better with one with grandpa in it being the best). Speaking of grandpa, Paresh Rawal who plays him is criminally underused in the movie. I enjoyed his performance in \"Hera Pheri\" very much, but here he really isn't used to his full potential. The rest of the jokes, which are practical in nature, are constantly bordering on being so silly only a child could laugh and being somewhat funny or rarely hilarious. There is also a lot of overacting from the actors which irritates me, though I know it's normal for Bollywood. The last third of the movie is the most entertaining and it alone warrants a watch. The movie feels OK overall and I wouldn't call it bad, but to a western audience, it's miles and miles away from evergreen comedy Indians make it out to be. Maybe it is for them, but objectively, hardly. If you are brave enough, grab a mate or two and some food and drinks and try to squeeze some fun out of this movie, but keep in mind you won't find usual over the top action scenes (because \"Golmaal\" primarily isn't an action movie), but generally over the top ones will be plentiful, I assure you. 5.5/10!"
    }
]