[
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Peter_Young",
        "review_rating": "8",
        "review_title": "A fast-paced, highly entertaining action-packed romance",
        "review_detailed_main": "Indeed, Gadar is pulp history, and it's not the best picture in its presentation of the warring sides. Set during the 1947 India-Pakistan Partition, the film tells the love story between Tara Singh, a Sikh truck driver, and Sakina, a girl coming from an aristocratic Muslim family. The film presents the atrocities of war during Partition, with particular emphasis on the Punjab riots, where Hindus and Muslims kill each other on each group's migration to their destined country (India/Pakistan). Tara, aiming to kill Muslims, is shocked to find Sakina, whom he used to know years before Partition. He takes her under his protection and gives her shelter in gratitude of her kindness to him before.\n\nGadar is not a historical film, but it's quite a remarkable epic film in its extraordinary entertainment value. The film is thoroughly watchable and interesting, and it keeps the viewers (well it kept me, for sure) on the edge of their seats for its entire duration. The proceedings move at a fast pace, and even more so as the story unfolds. The romantic portions are beautiful and actually quite subtly done (note the scene where Sakeena helps Tara wear his turban, or the scene where she confesses to him - wonderful). The action that follows is excellent, and their escape later on is one of the most thrilling, entertaining and well-shot sequences of its kind.\n\nThe production values in this regard are fantastic. The sets and costumes are excellently chosen to create the desired atmosphere of that era. The film's huge tonal shift from brutal riots to pure romance and marital bliss to action-packed thriller makes the entire experience into quite an exhilarating rollercoaster ride. The traditional music is wonderful, and Uttam Singh can always be counted on to deliver beautiful melodies. Yes, some of the later parts get overblown both emotionally and in terms of the portrayal of the animosity between the two sides which is really a little childish and hard to believe, but it's a movie, and it's all within the context of a mainstream Hindi film.\n\nSunny Deol is tremendous in the lead role. I've liked him ever since his debut back in 1983 with Betaab, and here he gives a passionate, intense performance both in the early portions where he brilliantly plays Tara's innocent shyness and wholesome personality and in the later parts where he turns into the fierce action star he is known to be. His leading lady, Amisha Patel is luminous in a beautiful performance that remains her best work to this day. I wish she made more use of her tremendous potential. Amrish Puri is excellent because he always is although his part veers into caricature, and Lillete Dubey is very good, too. Tu sum it up, Gadar is a true cinematic experience fulfilling exactly what cinema is all about in the end: entertainment. There's plenty of it here."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Mushtaq_Ahmd",
        "review_rating": "8",
        "review_title": "WOW - thats it!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Herag",
        "review_rating": "8",
        "review_title": "One of the Best Indian (Hindi) movies",
        "review_detailed_main": "If there is one movie that I would pick as one of the best movies that the Indian Film Industry has produced, it has to be-\"Gadar-Ek Prem Katha.\" It is very sweeping statement to make, but I make it with conviction. The best movies are either fiction (Shawshank Redemption,) or portrayal of an event that left indelible scars and memories that is left for generations to cope. There were two people who put this masterpiece of a movie together, Anil Sharma and Nitin Keni, not necessarily popular names like Satyajit Ray and Raj Kapoor, but the sheer brilliance of the production, the reconstruction of the authenticity of the period, reminds me of David Lean production. It is difficult to relive part of the history that should be long forgotten, but to recreate this history is the genius of the director, in this case Anil Sharma. Sunny Deol, as (Tara Singh) is a performance of a life time for this actor whose talent has been under estimated and then we have Non Indian and idiot actors like Aamir Khan have been over estimated and put on a pedestal by morons of Mumbai media and these imbeciles for a cup of garam chai will worship anyone like pied pipers. Very few (Hrithik Roshan, Abishek Bachchan) can portray the raw emotions and bring a certain velocity to the character as Sunny Deol does here. He is matched by another thespian Amrish Puri, who is just an \"Volcano\" of talent. A new comer by the name of Amisha Patel, who gives a soulful, sobbing, stellar performance. She has subtlety and depth to her gaze and a femininity of emotion she brings to this character. Over-all, this is a masterpiece, that will be tough to be outdone."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "dhirajsiitk9",
        "review_rating": "10",
        "review_title": "This is THE MOVIE OF THE DECADE, reviewing 2 decades later",
        "review_detailed_main": "No one, I mean no one could have played Tara Singh better than Sunny Deol. He plays an innocent monster. Sunny was born to play this role."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "keval_singh",
        "review_rating": "",
        "review_title": "Unbalanced!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Good movie but overrated",
        "review_detailed_main": "The film is a big blockbuster and was Amisha's 2nd blockbuster after her debut KNPH\n\nThe film depicts the partition period but more on the love story actually and also mixes Sunny standard dishoom dishoom and anti Pakistani dialogues\n\nThe film has several good emotional scenes and also the escape of Sunny- Amisha and the kid is well handled but there are too many loud and OTT scenes and Sunny removing a handpump and bashing 20000 goons at once or making people run away just with a shout The film also takes too many cinematic liberties like many scenes don't look like a period film and too modern In fact one doesn't feel they r watching a period film many times Also the KEY SERA SERA song was actually composed in 1956(the film depicts 1947) The climax is clichéd and too prolonged Direction by Anil Sharma is good Music is good\n\nSunny does his role in his own style but is superb in emotional scenes which he was criticised before Amisha is too good in her part though at times her voice is a problem Amrish Puri does his usual villainy act but leaves a mark Vivek Shauq is decent , Lilette Dubey is good so are the rest"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "truetigerking",
        "review_rating": "10",
        "review_title": "Second biggest blockbuster after 'SHOLAY' till date in the history of Indian Cinema.",
        "review_detailed_main": "Outstanding movie. Sunny Deol is completely unparallel and no other actor can play the role of Tara Singh except sunny.This movie is meant for Sunny and he proves it why he is called Action King of Bolywood.But other than action Gadar has solid plot of India-Pakistan Partition tale and a love story. Brilliant work by rest of the starcast too including Ameesha patel,Vivek Shauq,Lillete Dubey and above all Amrish Puri. And what to say about the massive craze of this movie outside cinema halls all over the India when it was released on 15th june 2001.No dabang or 3 idiots can come even near the shadow of Gadar's poularity.I still remember when i watched movie ,it was a housefull show in PARAS cinema,Kurukshetra even on the 50th day after the release and audience reaction whenever Sunny Deol uttered any dialogue,Absolutely matchless. Gadar is a landmark fim in the history of Indian cinema in terms of gross collection when adjusted to inflation. Yes It is superior to 3 idiots,ETT, Dabang etc.Its has footfalls of more than 4 crores, which is a record till date."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "wildlife-ptech",
        "review_rating": "6",
        "review_title": "Haunting love story marred by over the top action",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Asbohra",
        "review_rating": "10",
        "review_title": "Brilliant!",
        "review_detailed_main": "This is definitely one of Sunny Deol's best action movies ever, as simply gives a complex character the performance of a life-time. Watch this action movie with an open mind, and you will realize the realistic bravery and power that he exudes on the silver screen. Only Sunny Deol could pull this one off with total élan. This is a novel plot (based on the painful partition after independence in the late 40's). It looks so realistic to the point that no other current hero could have aced this role like Sunny Deol did. It is NOT aimed at running down Pakistan because Sunny Deol's Sardarji character is married to a Pakistani girl after he saves her from attacks as he believes in humanity. All he wants to do is keep his family together as one. Sunny Deol brilliantly fights hard to save the day and cow down his in-laws. People should understand that like his dad, Dharmendra, Sunny Deol has that fire, intensity, and command (unlike that overrated SRK)! Anyways, watch this and enjoy it! 12/10!"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "majidbhurgri-1",
        "review_rating": "3",
        "review_title": "An average movie playing with sectarian hatred",
        "review_detailed_main": "A very average movie which has been grossly overrated by the viewers that share the film maker's biased and lopsided views. Those giving it top rating of 10 have done so mainly as a duty to support a political and religious viewpoint. The lacks substance, style and sense of fairness.\n\nIf you for a moment ignore the religious and political overtones, you would find hardly anything likable about the movie let alone rate it as best movie ever made in India. Only a pathetic sense of partisanism and a blind sense of duty to a particular viewpoint can drive anyone to heap such superlative praises for an ordinary movie playing on negative emotions of a particular class of viewers."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "saurabh-ranjalkar93",
        "review_rating": "10",
        "review_title": "Master blaster",
        "review_detailed_main": "This is one movie I would recommend all Bhartiya people to watch & to be reminded of the horrors of partition...well made ... absolutely brilliant story line dialogues character arcs music songs start to end Goosebumps...jai ho Tara Singh."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "devarshi-39387",
        "review_rating": "1",
        "review_title": "Gadar 1 was better than 2",
        "review_detailed_main": "Gadar one was very good and classic.gadar2 is totally fighting with less emotion of son and father.were as Indian and Pakistan story goes on in showing everytime Muslims are enemies I too have friends i feel all Muslim are not enemies.\n\nWere as movie part love story Cook in 10min no chemistry at all.story script writer was very poor.\n\nSon got job as biryani person and many more loss the originality overally.\n\nAmisha Patel looks very old though make up.\n\nLove song dance is like pappu boy no link though song is good We miss amrish puri awesome actor.\n\nLastly overall take up n screen play also not as expected."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "sameert",
        "review_rating": "10",
        "review_title": "A true patriotic Indian movie",
        "review_detailed_main": "Gadar is one of the best movies I have ever seen. Performances by Sunny & Amisha are superb. Sunny has delivered his best ever performance. He is equally matched by Amisha who looks very beautiful in the movie. The music is also superb. Gadar is a true story based on the partition of India.It is one of the biggest hits of bollywood and is a movie every Indian should see. Perhaps the only ones who wouldn't like this movie will be Pakistanis\u0085."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "prabhjot",
        "review_rating": "10",
        "review_title": "Sunny's best in a long time!",
        "review_detailed_main": "The issue the story tries to tackle is essential because from a historical standpoint, this really happened. The acting from Sunny Deol, Amita Patel, and Amrish Puri are awesome. The film deserved an award. The director Anil Sharma did a great job in creating different moods at appropriate times in the movie. I recommend it to everybody."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "allthechampyouneed",
        "review_rating": "10",
        "review_title": "Great film",
        "review_detailed_main": "A warm film and essentially a love story.\n\nGreat music, comedy, acting, classic Sunny D action, cinematography, and an engaging story - what more can you ask for. It's one of the few Hindi movies that isn't ripping off a Hollywood film. Consistently holds up to repeated viewings.\n\nLook for yet another superb performance by the late great Amrish Puri, look for sexy, buxom Amisha Patel, and Punjab's own Sunny Deol. This film really put him on another level, unfortunately films like Jo Bole or Hero are higher budget, but much lesser in content. This film though is one of the greatest films I've ever seen from Hindi cinema."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Li_85",
        "review_rating": "1",
        "review_title": "Disaster...Worst movie of the year",
        "review_detailed_main": "Gadar is an example of one of Bollywood worst overrated movies ever. Directed by Anil Sharma, who prefers making period related movie gives a rubbish movie. The songs were boring and ain't the kind of song you want to listen to in your car, full volume. Sunny Deol is famous for making daft movies, where he beats up a 100 bad guys on his own. He even kicks a metal jail door (Indian) and kicks a moving car far away (Teesri Aankh). I can give another 50 examples of disgraceful action by Sunny Deol. But I'm sure most people know this already. Sunny gives a pathetic performance once again repeating the same type of role. A guy claiming to be fighting for his countries piece, by using violence. Amisha Patel is hands down dead sexy with an amazing body that i would love to bone. But even she couldn't save the film from being a disaster. Instead of wearing sexy clothes like she usually does, in this movie she doesn't. Maybe cos she was playing a Muslim, but she doesn't act like one in the movie. Overall, this is a poor show all the way, I'm sure it will appeal to some people, who love seeing the Bollywood actor beat up 100 guys. Give me a break."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "alokranjanstpauls",
        "review_rating": "10",
        "review_title": "One of the greatest movie ever made in Indian Cinema !",
        "review_detailed_main": "This movie is not just another show, It's an Emotion for we Indians. The greatest movie ever made on the emotions and pain on Partition of India and separation of loved ones. A beautiful love story depicted to the core. A must watch for every movie lover. Sunny Pajji 100/100. Full cast and crew 100/100 !"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "underworld_don007",
        "review_rating": "1",
        "review_title": "bad Movie with lots of Flaws",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "gurdeep-sabarwal",
        "review_rating": "10",
        "review_title": "must watch bollywood movie!",
        "review_detailed_main": "Best action hero of all time,bets dialog delivery. action, drama,comedy all in one.."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "dhananjayjadhav-39578",
        "review_rating": "10",
        "review_title": "Highest grosser of india",
        "review_detailed_main": "There few indian movies which had different record ,there are few different records of gadar are there 1)Gadar is the movie which has theatre shows staring from midnight Only rajnikant has that ability ,sunny has done it very early 2000 2) gadar has a record of selling highest tickets till date after that comes bahubali, sholay, ddlj. 3) from this movie new award category is presented outstanding performance award to sunny"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "tanmay_bhargava",
        "review_rating": "10",
        "review_title": "must watch for all indians",
        "review_detailed_main": "after a very long time we see a period film attempted in India on such a large scale.Sunny Deol had a lot at stake and man did it pay off.Its being declared as the biggest hit of all times.Sunny and Amisha deliver performances of a life time.National award and other awards belong to him..no doubt. If you are an Indian and love your country then there is no way you would'nt like the movie.Its the best and a must watch for all true Indians.DON'T MISS THIS ONE."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "sunnydude234",
        "review_rating": "1",
        "review_title": "Gadar tries to be a historical drama/thriller but fails to deliver",
        "review_detailed_main": "Gadar tries to be a historical drama/thriller but fails to deliver Anil Sharma does it again, tries to create Macbeth but creates blunder instead. As Always Muslim bashing movie, yet you can't say that only one sect was persecuted during the partition, but the wounds of partition were inflicted on all. While the Koreas are talking and trying repartition , works like Gadar always try to rekindle those savage days of 47. Awful Direction. Awful Cast. And as usual Sunny Deol in his trademark shouting Dialogue spree.(which is by the way good only for movies like Border). Ameesha Patel awful. Amreesh Puri: as always classy. Vivek Shaq & Mushtaq Khan as always awesome. Bet the success it enjoyed, because of the song only i.e. Mai Nikla Gaddi Leke. and would someone tell Ms. Lillete Dubey to take some Vicks to cure the cacophony in her throat!"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "rajputshri",
        "review_rating": "10",
        "review_title": "BIGGEST SUPER DUPER HIT BLOCKBUSTER MOVIE EVER IN INDIAN CINEMA",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "anupam-71432",
        "review_rating": "10",
        "review_title": "The most successful movie of Indian cinema ever!",
        "review_detailed_main": "Indian story from late 1940s and early 1950s when the global disease called Islam divided India into three geographical parts and gulped the sanctity of enumerable Indian daughters while creating one of the most horrible majhab induced human tragedies with the watch of those blue eyed white skinned and probably white blooded cowards called English. During such desperate times, a brave sanatani sikh protected the daughter of a muslim traitor who betrayed India and left to Pakistan- once from rioters and second time from her own fanatic father. The film depicts the superiority of values of Sanatana Dharma and is full of emotions: patriotism, romance, bravery, deceit and jihadi fanaticism. A footfall of 4 crore in cinemas for the movie speakes volumes. Very nice action, amazing loyalty between husband and wife.. The dialogues leave a deep impact on both sides of the border. Hindustan Zindabad tha, Zindabad hai, aur Zindabad rahega... Superb direction. Worth watching a thousand times!"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "pushpendrameena-89339",
        "review_rating": "10",
        "review_title": "One of the best",
        "review_detailed_main": "Top 5 movie of all time in bollywood in 100 year's of cinema Every actor, artist gave there best Sunny Deol no other can fit into it"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "ashwinrajan-175-992599",
        "review_rating": "10",
        "review_title": "A masterpiece epic",
        "review_detailed_main": "An epic film portraying the tough times that lasted between India and Pakistan after the partition in 1947 focusing on a romantic relationship spurring between a sikh worker and a muslim royal. The portrayal of the romantic relationship in this picture is very artistic and subtle. With a few over the top acting scenes by Sunny paaji and firm acting by legendary actor Amrish Puri. A classic masterpiece which can be watched multiple times to relive the historic episodes that took place really in the Indo- Pak border. A solid 10 out of 10 film."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "bharatbuilder",
        "review_rating": "10",
        "review_title": "Sunny Paaji the first Indian Avenger in Pakistan",
        "review_detailed_main": "Amazing nostalgic movie. I know the superhuman fights and hypermasculine dialogues and yelling might seem odd in today's time of chocolate boy actors but Bollywood has done nothing better than this till now. Watching this again in adulthood gave me goosebumps about what people might have gone through during the partition. A super commercial movie, well directed with good acting. I wonder what happened to Ameesha Patel, she was good in this movie. Amrish Puri will always be the most celebrated actor in Indian cinema. No one can forget the Handpump scene & Hindustan Zindabad tha, hai, rahega dialogues. Loved watching this once again, an all time classic."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "rishabhdevvasu",
        "review_rating": "10",
        "review_title": "An epic love story",
        "review_detailed_main": "The biggest blockbuster in hindi cinema.\n\nA milestone movie.\n\nIt's a love story on the back drop of 47 partition.\n\nSunny deol gives a performance of life time.\n\nAmersham, vivek Shaun, Amish puri all were at their best."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "himanshuvaishnav-42355",
        "review_rating": "10",
        "review_title": "Iconic movie",
        "review_detailed_main": "What a movie I just say mind blowing movie Blockbuster movie in Indian cinema."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "mav-90908",
        "review_rating": "10",
        "review_title": "Pure patrotic",
        "review_detailed_main": "Must watch movie, watch it for ur country, feel the power of a indian"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "jaspreet41",
        "review_rating": "10",
        "review_title": "saga of love during partition",
        "review_detailed_main": "it was an awesome movie. It's the biggest hit in the history if bollywood. Performances by SUNNY DEOL and amisha patel were excellent. This is the super duper hit of 2001.Everyone should go and see the movie. Over all the movie is excellent."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Ashvini_777",
        "review_rating": "10",
        "review_title": "Outstanding Mind blowing Blockbuster",
        "review_detailed_main": "A milestone movie of Hindi Cinema ... such movies are made once in a life time .. brilliantly directed and superb acting by all the artists... scenes between Sunny Deol and Amrish sir are outstanding.. also brilliant music all songs mind blowing. An all time Blockbuster. A must must watch ."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "coolritik12",
        "review_rating": "10",
        "review_title": "excellent movie ,a anil sharma masterpiece",
        "review_detailed_main": "Gadar is a epic ,action-romantic + patriotic movie and no doubt best performance of sunny deol.Ameesha patel also at his best.Soundtrack is also melodious and great.No other movie can ever surpass this piece of art ever or forever. 1.I don't give any movie above 8 rating easily but for this i gave 10/10."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "priyankarocksghoshal",
        "review_rating": "10",
        "review_title": "Tara Singh stole my heart !",
        "review_detailed_main": "What a movie! I watched this movie years ago but in bits.\n\nI watched it last night and I can't stop praising it since.\n\nIt's such a wonderful story, the actors, the music and the love angle of the movie are all exceptionally beautiful.\n\nThis is certainly one of my favourite Bollywood movies.\n\nThe songs of the movie can be played in a look for days, the love story is exactly what Bollywood is missing these days.\n\nTara Singh's innocence stole my heart!\n\nAnd of course his college performance was another level.\n\nI wish Bollywood made such characters today and I wish Gadar 2 turns out to be equally good!!!"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "vaibsharma-20549",
        "review_rating": "10",
        "review_title": "Best movie on India pakistan separation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "alokakak-71201",
        "review_rating": "10",
        "review_title": "Super Movie..",
        "review_detailed_main": "I love this acting and story.. 👏👌👌👌👌 Sunny Deol action seen in Hindustan jindabad this aswome seen.. l like this movie.. 100 / 100 my rating.. Now this type of movies we can't find in bollywood."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "yadavsourav-08730",
        "review_rating": "9",
        "review_title": "Cult classic till the Indo-pak rivalry remains",
        "review_detailed_main": "One of the Best hindi movies ever made. Special acting of Ameesha Patel & chilling horrors of Indo-Pak partition put on silverscreen altogether. The songs are pretty much of Desi backdrop & a magnum opus for Love Stories behind border lines"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "garimakachhawa",
        "review_rating": "10",
        "review_title": "LEGENDARY FOREVER",
        "review_detailed_main": "BESTEST of the BEST\n\n100 on 100 Gadar ek prem Katha is LOVE forever Especially charanjeet aka Jeetey UTKARSH Sharma is fantastically Amazing\n\nEagerly desperately impatiently waiting for GADAR 2 THE BLOCKBUSTER SEQUEL of INDIAN CINEMAS ERA."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "rahoul-53294",
        "review_rating": "10",
        "review_title": "That's called mass hysteria",
        "review_detailed_main": "I'm 8 year old at that time ...I watched it in theatre and I'm amazed ....told the story everyone in family...a great movie. Love story and action is perfect....no other movie can match it."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "vickyaroranew",
        "review_rating": "10",
        "review_title": "ELECTRIC ENVIRONMENT IN THEATRE",
        "review_detailed_main": "Saw this movie in a single screen theatre back in 2001 when it released. I was just 11 y/o and it was the first time I experienced an electric environment in theatre. Audience was whistling, hooting, dancing, clapping and what not. This movie is a total roller coaster of emotions and tells a beautiful story. It has period elements, historical events, romance, drama, & screen faad action. Beautiful. Saw this again today in a multiplex, sp rerun, to a housefull audience and again, the environment was electric. This film has stood the test of time and is one of the greatest Bollywood film ever produced."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "vasudevprajapati-15559",
        "review_rating": "10",
        "review_title": "Love and struggle",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "rs-77939",
        "review_rating": "10",
        "review_title": "This Movie Is Super Duper Blockbuster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "infotainment-37034",
        "review_rating": "10",
        "review_title": "gadar ek prem kahani superhit",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "shbelive",
        "review_rating": "10",
        "review_title": "Biggest and greatest BLOCKBUSTER of century",
        "review_detailed_main": "Biggest and greatest BLOCKBUSTER of 21ST century this films has emotions Action patriotism great story SUNNY DEOL in full form he roars all the way Amisha Patel looks beautiful and charming Amrish Puri was an unmatchable actor watched again on screen after watching it on single screen in 2001 their is no match for this film no doubt how this film crushed Lagaan during the clash. Vivek Shaq as Darmiyaan and the dialogues that this film has needs a special mention. It's true to the the times but the story will always be evergreen so. Anil Sharma has delivered a corner stone to Bollywood and Indian cinema."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "michaelsapra",
        "review_rating": "9",
        "review_title": "Amazing, cheesy at times",
        "review_detailed_main": "I am a total sucker for movies like these. Absolutely phenomenal, with the right amount of comedy and emotions. The movie not only shows brief history about what exactly occurred, but also has an element of romance and love. Sunny Deoul is one of my favorite actors, and he is pretty good in this movie. One of the reason I watched this movie was because I was very interested about the history behind the separation of Pakistan from India. Although I will need to watch some documentaries to get an accurate picture, this movie showed the brutalities and struggles that occurred. In conclusion, if you like romantic films (as all bollywood movies are), this is a great movie. I would also recommend watching kabhi khushi kabhi gum."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "amit935240",
        "review_rating": "10",
        "review_title": "Superb movie on 1947 partition",
        "review_detailed_main": "Only movie which avoids the bogus secularism concept."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "tushargupta-27286",
        "review_rating": "8",
        "review_title": "Epic",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "aanthonyshughesanthonyshughesg",
        "review_rating": "8",
        "review_title": "NICE",
        "review_detailed_main": "Outstanding movie. Sunny Deol is completely unparallel and no other actor can play the role of Tara Singh except sunny. This movie is meant for Sunny and he proves it why he is called Action King of Bolywood. But other than action Gadar has solid plot of India-Pakistan Partition tale and a love story. Brilliant work by rest of the starcast too including Ameesha patel,Vivek Shauq,Lillete Dubey and above all Amrish Puri. And what to say about the massive craze of this movie outside cinema halls all over the India when it was released on 15th june 2001. No dabang or 3 idiots can come even near the shadow of Gadar's poularity. I still remember when i watched movie ,it was a housefull show in PARAS cinema,Kurukshetra even on the 50th day after the release and audience reaction whenever Sunny Deol."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "gregorymaria-51553",
        "review_rating": "9",
        "review_title": "Minus one star for unbelieavable fighting and Amisha",
        "review_detailed_main": "Brilliant performance by Sonny Deol!\n\nAmrish Puri is great as usual.\n\nBut the fighting scenes, where Sonny throws guys up in the air with are hilarious (does he have superpowers we should know about?) Amisha Patel is IMHO a weak actress, she more irritates than impresses. When she is supposed to show emotions, she stays blank with an open mouth. And crying scenes, especially during the phone conversation with a mom, is overexaggerated, by both a mom and a daughter. Instead of being touching, this weeping is irritating. Just IMHO.\n\nOtherwise, a very good story and interesting movie. 9/10."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "achal-2",
        "review_rating": "10",
        "review_title": "awesomely funny!!!",
        "review_detailed_main": "rarely, there comes a movie, which makes you laugh and laugh and laugh till ur stomach bursts out. this movie is just that.....neone who does not enjoy this movie will be a looser.\n\nof course all of it is unintended which makes it funnier!!!! i gave it 5 because as a movie it is crap but it provides supreme entertainment which will last with you forever.\n\neven after 5 years i still recollect some scenes and cant stop laughing.\n\none of the corniest movies of our times! a good competition would have to be jaani dushman!!"
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "Justin_432",
        "review_rating": "8",
        "review_title": "An Action-Packed Adventure!",
        "review_detailed_main": "An action-packed adventure story of a man trying to rescue his lover across a cross-border country dispute.\n\nHow far would a man go for his family?\n\nGadar is a compelling narrative of love, danger, action, romance, and family.\n\nIt stars Sunny Deol in the heroic role of Tara Singh. A humble truck driver who falls in love with a noble lady, Sakeena Ali played by Ameesha Patel. The story takes place in the context of India's independence.\n\nThe music acts as a harmonious accompaniment of emotions that are being depicted on the screen. Perhaps the most memorable piece of music is the one that Tara played when he first met Sakeena. A timeless classic that is still captivating to this day.\n\nThe story gets all the more intriguing with the involvement of its antagonist, Late Amrish Puri.\n\nThe story gets a new depth with the conflict between Mr. Amrish Puri and Tara Singh.\n\nYou'd wonder to yourself how will that differences be resolved?\n\nMaybe, the greatest test of the human relationship with his fellow man could be resolved with love and kindness.\n\nThe ending had a satisfying conclusion.\n\nAnil Sharma's direction and story by Shaktimaan Talwar work exceptionally well in terms of story structure. The action scenes are spectacular and well-choreographed by Tinnu Verma.\n\nI've had an amazing experience watching this movie!\n\nIt's definitely a wholesome experience!\n\nThe movie was released in 2001 and considering it over two decades old, it is still enjoyable to watch to this day."
    },
    {
        "movie_id": "tt0284137",
        "movie_name": "Gadar: Ek Prem Katha",
        "movie_rating": "7.3",
        "review_username": "devanshu257",
        "review_rating": "8",
        "review_title": "A Timeless love story (7.8/10)",
        "review_detailed_main": "Gadar : Ek Prem Katha, directed by Anil sharma is a love story presented in the backdrop of India-pakistan partition that has been told with beautiful cinematography & amazing background score(including songs too).\n\nThe story starts with heart pounding consequence of war & love story starts & follows the formula of back & forth storytelling, the chemistry of the protagonist with his spouse is a special highlight of this film that will linger on your mind afterwards. Amrish Puri's (antagonist) acting made movie more believable & grounded & the action sequences were more practical than today's VFX.\n\nThis movie beautifully conveys the message of humanity even in the harsh realities of war & how love has no boundaries even if it means to go against the whole country or you can say the \"world\"."
    }
]