[
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Cpt_Acid",
        "review_rating": "2",
        "review_title": "Mystery of this film is Why Was It Made?",
        "review_detailed_main": "500 years of progress and this is what we have to show for it?\n\nIt really feels like nobody wanted to make this movie but someone made them do it. Nobody had anything to say. Anything to add. Nothing we haven't seen a million times before. Screenplay has nothing whatsoever to say or convey and is full of clichés, just like it would be if you never wanted to write it in the first place, but had to. For a grade, or something.\n\nClearly, there was no excess money to burn - almost entire scenography is some kind of paintball course. And some forest. And all the crops are close-ups of people doing stuff, mostly shooting off into something offscreen, presumably into the distance.\n\nThe movie is set in the 26th century, with the space and time bending human species spanning three planets (only indication of this is an introductory text) and the weirdest thing we can see in the galaxy is a girl with semi-yellow hair? Everything else, technology, weapons, fashion, everything looks exactly as today. Alright, excepting a few seconds long filler scenes of spaceships.\n\nI'm writing this because one question baffles me without cease. It's - Why did you have to make this? What was the motivation behind this work? I don't see you making any money, however inadequate the investment was. What's the point? I'd really like to know.\n\nIf this is some kind of student project movie, then its kinda cool. If you go to school with the guys who made this then you should really have a go at it. Otherwise..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "planktonrules",
        "review_rating": "3",
        "review_title": "I think they spent all the budget on Bruce Willis and had nothing left for writing, props, actors and more.",
        "review_detailed_main": "I noticed that \"Cosmic Sin\" recently made it to IMDB's infamous Bottom 100 list and has a pitiful score of only 2.5! So, not only is it on the list...but it is way up the list at #39!\n\nWhen I first started watching this sci-fi film, I could IMMEDIATELY see why the film is so hated. It's a film set in the 26th century and at this time, there is space travel and life on many planets and moons. So, why do you see folks driving pickup trucks that look like they are from 2021? Why are the clothes pretty much what you'd see today and why are most of the weapons not much more effective or different than today's?! It honestly looks like they must have spend all their budget on securing Bruce Willis' talents and had nothing left to make it look like a futuristic story. Now I don't think you need expensive props to make a good film...but this is ridiculous and really takes you out of the story.\n\nThe story begins with some form of life being discovered on some new planet. It seems that up until this time, humans have never made first contact with any intelligent species...even with humans inhabiting many new worlds. As you'd expect, this new form of sentient life is not sweet and friendly....as who would want to see a film like that?! And, it turns out that it is so deadly that in the entire galaxy (numbering many, many, many billions) the only guy that can stop the creatures is a war criminal, James Ford (Willis)!\n\nI have seen much worse films that never made it to the IMDB list...mostly because they are older, cheaper and more obscure. In other words, the Bottom 100 is very heavily skewed to new films...so although the film is bad, it's not the 39th worst film ever made! I think it's just that a lot of folks get Netflix and had a chance to see it...whereas far less folks have seen the films of Ed Wood, Al Adamson, Ray Dennis Steckler and William Grefe...all filmmakers who REALLY knew how to make terrible films...REALLY terrible films!\n\nSo is there anything good about this movie? Some of the CGI space scenes are very nice and would probably look great on the big screen (though I assume this film, when it came out, only went straight to Netflix and Amazon Prime). Otherwise, the story is not especially interesting, the dialog often pretty bad and the acting not especially good. It is not completely awful...just mostly awful. And, unfortunately not so bad that it's fun to watch in order to make fun of the film.\n\nBy the way, nearly all the reviews for this are extremely negative. With this and a score of 2.5, I am amazed to find some folks giving it 10s! A few admit that it's bad but are just trolling or love it because it's so bad. A few, however, are VERY short reviews that talk about how brilliant it is...a sure sign normally of fake reviews done by folks connected with the film...which is pretty shameful."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sumtim3s00n",
        "review_rating": "",
        "review_title": "Bruce, what are you doing....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Calicodreamin",
        "review_rating": "2",
        "review_title": "What was this even about?",
        "review_detailed_main": "A terribly written trash heap that made no sense, the storyline was disjointed to say the least. The effects were okay. But what good there was is overshadowed by poor acting and bad dialogue. Almost laughably bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "siderite",
        "review_rating": "3",
        "review_title": "It was simply awful",
        "review_detailed_main": "Bruce Willis stopped telegraphing his acting for this film. He just didn't act at all. I mean, it looked like he was between high and mentally disabled. I worry about the dude. Then Frank Grillo, happenstance makes that I have seen three of his films this week, I was just saying how I wish he would get a break. Not for this film! Note that he is billed first, above Willis, and his role is at most 15 minutes from the film anyway.\n\nBut what makes this film shine like a black hole is the story. It felt more than devoid of passion, like a spreadsheet that sucks one's soul away in the accounting department on a hot day after the air conditioning died. I mean, if a kid would have written it, it at least would have been fun. If someone was incompetent it would have felt like trying to send some kind of message, however badly. But no, it ... just made no sense, like someone hated writing for this film.\n\nBottom line: it is so bad you can't even enjoy it wasted. It's a non-movie. It's like what's on the other side of the event horizon of TV static."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "deshutch",
        "review_rating": "1",
        "review_title": "Bruce, what have you done?!",
        "review_detailed_main": "I have no words to describe how truly awful this movie is. Best part of the movie is the backing music to the credits."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "paradiddle16",
        "review_rating": "1",
        "review_title": "cosmic disaster",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "imdb-03202",
        "review_rating": "2",
        "review_title": "The Reviews here ain't lying",
        "review_detailed_main": "If you're a scifi fan like me you probably read the premise and be quite interested. Bruce Willis wasn't anything positive or negative for me but I thought it would be a sign of a high quality movie. Well... I watched the first 30 Minutes of this and... it's bad. Like really bad. It's not like this one thing in it is bad like for example the plot is a bit weak. But when you're at the point where even I critique the cinematography and color grading you have to be at a very low point to the degree of college-first-indie-movie-attempts-bad. This is usually stuff I can overlook quite easily because I don't notice.\n\nThis film basically has everything bad a film can have. From every category. Take your pick what you think is the worst."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gabortabi",
        "review_rating": "1",
        "review_title": "It is beyond me, how something like this gets released. Awful.",
        "review_detailed_main": "It is seldom that one comes across a movie with so little to give. There are dozens of shoot'em up games out there with better storylines more engaging dialogue, better graphics and acting. Bruce Willis probably has better commercials out there. Stay away. Keep away. Not worth it even in fast forward."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kaldi_xi",
        "review_rating": "2",
        "review_title": "Very cheaply made and made little sense",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "smaralihalli",
        "review_rating": "10",
        "review_title": "Must Watch",
        "review_detailed_main": "Wow, simply spectacular. One of the best sci fi movies ever made, and probably Bruce willis top performance to date. Makes you watch this movie again, again, and again.\n\nSpoiler Alert: Why should I suffer alone"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bertoli-mauro",
        "review_rating": "6",
        "review_title": "It deserves more than a 2.5",
        "review_detailed_main": "A pretty decent b-movie, ten years ago this was on the same quality level as many blockbuster. I think the score is so low because many had rated the movie for Willis, before knowing these were the last shots (as we found later, he cannot act properly due to sickness).\n\nBack to the movie, we could say it is not innovative in any way, but it contains many of the pattern we usually find in this kind of movies. The guy, the strong woman, the heroe, the bad enemy, the final monster, the good guy some died breaking everyone heart, the guy who had to sacrifice himself, and so on.\n\nBut I think the special effects were pretty decent and with some good ideas (compared to the budget).\n\nSo I wrote my minimum 600 chars to say: give the movie a chance and enjoy the last sparkle of a star."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "alex_antoniu",
        "review_rating": "2",
        "review_title": "Ridiculous from the first 5min",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Mclovin290514",
        "review_rating": "2",
        "review_title": "Cosmic bin.",
        "review_detailed_main": "Really wanted to like this as I love scifi movies especially anything involving aliens, I'm thinking, supposed to be 500 years into the future but the fellas still driving a 4x4, i got to the bar scene, and I thought, this looks like roadhouse, (albeit no where near as good) warning signs of a crappy film start to kick in. 90 percent of the movie was just people talking random s#*t, practically no action whatsoever, and by the time we were down to the last 20 muinites I gave up! Dont know what Bruce Willis has been thinking last couple of movies he's been in, All I'm looking for is a movie that'll rival Independence Day form 1996, it's been nearly 25 years and still nothing! Avoid this if you value your time on this earth, absolute garbage."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "SnoopyStyle",
        "review_rating": "3",
        "review_title": "cinematic sin",
        "review_detailed_main": "Some 500 years in the future, mankind has spread into the cosmos. On a faraway planet, humans have encountered First Contact. An alien presence infects people and turns them into marauding zombies. James Ford (Bruce Willis) is a disgraced military leader arguing for the doomsday Q-bomb. Engineer Fiona Ardene (Adelaide Kane) is called in to prep the device. General Ryle (Frank Grillo) leads the soldiers while Dr. Lea Goss (Perrey Reeves) is awed by the aliens.\n\nFirst thing first, this movie opens with an info-dump in text form. It's a lot of gobbledygook. Someone should try to read it again. Then there is the awkward mix of present-day technology with the future tech. There is no logical reason for it. It's an obviously sign of bad budgeting and unimaginative set design. When that happens, they are better off putting the movie in a smaller space and as much future tech onto the screen. At least, put some effort in giving the characters some future-cars. Its greater sin is that it's boring. I think I must have spaced out. One moment, they're fighting zombies in the warehouse and the next, they're space-diving to another planet. It's a forgettable muddle."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dreamstate123",
        "review_rating": "1",
        "review_title": "Garbage",
        "review_detailed_main": "This was total trash. Don't waste your time. It's not even bad enough to make you laugh. The people who participated in this farce should be jailed for wasting peoples time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "athies",
        "review_rating": "1",
        "review_title": "I think less of myself for having watched this.",
        "review_detailed_main": "The Blood General? That is totally made up by a twelve year old boy.\n\nWhat an idiot firing so many rounds into darkness.\n\n2500 something and people are still driving the same cars?!\n\nThere were two people on the whole planet abs now you have several more than that survivors?! Is counting a lost skill in 2500 something?!\n\nThey weren't tipped off my their face and eyes?!\n\n2500 something has no laser or pulse guns?\n\nThey may be in hibernation.\n\nAliens with hoods is an easy way to cut costs, and disappoint the audience.\n\nWhat the hell was that scene?! It made no science?! Bruce walks into a cage having hallucinations and surrounded by aliens, then the specialist appears and they walk through the woods?! F-n terrible.\n\nThis is another example of what 1.25 speed was made for... maybe 1.5 speed.\n\nThat general sidekick side conversation was pointless... as was his conversation with the little girl. Trying to inject some humanity in a dump truck of garbage.\n\nThey ran out of \"armor\" so they told a guy on set with a flannel shirt to grab a toy gun.\n\nThis can't end quick enough.\n\nAll the kids shots hit the armor... why is he dead?\n\nThis was a complete waste of money.\n\nGrillo got the best deal out of this, he had the least screen time.\n\nThere is not even a single good line in this film.\n\nWhat kind of armor leaves the midsection wide open?\n\nWhy is there a flashing open sign inside!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "thomas-45638",
        "review_rating": "2",
        "review_title": "Bruce takes another B trash dive",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "imdb-30349",
        "review_rating": "2",
        "review_title": "Cosmic Cringe",
        "review_detailed_main": "What an epic disappointment this turned out to be. Dire acting, unconnected plot. As mentioned there is a large percentage of nothing happening in this movie. The aliens were nothing of note. Special effects were lacking. I thought Bruce Willis was going to save the movie but he gave up in the first bar scene. Mankind did not deserve to win in tjis one. Come on writers, stop using the angry young soldier stamping his feet routine as it made me want to stop watching more than the slow pace."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "icantstandthis",
        "review_rating": "",
        "review_title": "Wow lol",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "The_Tech_Son",
        "review_rating": "10",
        "review_title": "This movie is PURE GOLD!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "brendatajik-880-480678",
        "review_rating": "7",
        "review_title": "A Campy Classic?",
        "review_detailed_main": "I watched this film because I'm in the mood for sci-fi, aliens and Bruce Willis. Oh, and because of IMDB's rating of 2.5! I've always avoided the low rated ones but my curiosity got the better of me this time. I'm glad it did, too!\n\nYes, it's obvious the money wasn't used for production value, a great storyline or snazzy dialog. All the critics are right about that. But, I thought the actors did their best with what they had. Especially Bruce Willis! He was laid back and snarky as usual. I love that guy! The aliens really got screwed in wardrobe. That was too bad.\n\nI enjoyed this movie and I bet you will too. Relax, kick back with a drink and your favorite movie snack."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "michaelRokeefe",
        "review_rating": "2",
        "review_title": "Mostly space junk.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Clive_W",
        "review_rating": "1",
        "review_title": "Cosmic Sin Bin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "paul_haakonsen",
        "review_rating": "3",
        "review_title": "What a disappointment this was...",
        "review_detailed_main": "Granted, I have to admit that I was lured in to watching the 2021 movie \"Cosmic Sin\" given the movie's cover/poster and the fact that the movie was starring Bruce Willis, Frank Grillo and Costas Mandylor.\n\nAnd let me just come right out and say that writers Edward Drake and Corey Large failed to deliver a wholesome movie here with \"Cosmic Sin\". While I managed to sit through the entire ordeal, then I must say that all throughout the course of the entire movie I was sitting with an overwhelming sense of pointlessness. I just couldn't find anything worthwhile in the storyline, and everything seemed just bland and without a cause.\n\nIt was so difficult to indulge myself into the storyline because it was so linear and anything but interesting and exciting. So the end result that is \"Cosmic Sin\" from director Edward Drake was just a very forgettable and rather mundane movie. The storyline was just so amazingly generic and linear that you could have left the movie for a longer period of time, and returned only to be right up to speed with the storyline.\n\nNow, I am sure that die-hard fans - pardon the pun - of Bruce Willis or Frank Grillo might actually find some kind of odd enjoyment here in the movie. I, however, didn't. So this movie was a swing and a miss.\n\nI must admit that it felt that Bruce Willis wasn't really committed to this movie project, and his performance felt half-hearted, as if he was running on auto-pilot. And Frank Grillo just wasn't given enough on-screen time to manage to do much of anything to salvage the movie.\n\nThe characters in the movie were every bit as bland and pointless as the storyline. So you don't really connect with any of them, nor do you form any kind of attachments to any of them. So whether they live or die, it hardly matters.\n\nNow, what did work for \"Cosmic Sin\" was the visuals. They had some nice enough suits for the soldiers of the Alliance. And the weapon effects were quite good. The aliens, however, they just felt like something out of a B movie. So that was disappointing to say the least.\n\nAll in all, \"Cosmic Sin\" was exactly what the movie title says; a cosmic sin. This movie came and went without leaving much of any blast mark or memorable impression. My rating of \"Cosmic Sin\" lands on a mere three out of ten stars."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nalwro",
        "review_rating": "1",
        "review_title": "Looks like...",
        "review_detailed_main": "... Bruce Willis is jealous of Nicholas Cage career."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "laszlobarta",
        "review_rating": "1",
        "review_title": "Who let this movie out?",
        "review_detailed_main": "I was waiting for somebody to make a cut and tell that this is just a joke."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tomino007",
        "review_rating": "2",
        "review_title": "Is this for real? :)",
        "review_detailed_main": "Its a low budget C/D title (or was this some kind of a fan film?, not really sure) with Bruce Willis. Do not expect any interesting shoot outs, fight scenes or effects, story is... lets call it \"simple\". Couldnt watch it in one go, found myself escaping the torture every couple of minutes. Acting aligned with the simple cliche story so do not expect anything in that area as well. Very little character back story and universe lore, characters are shallow and aliens are just simple strange looking cannon fodder with high tech appearing randomly, talking some brief non sense here and there and doing silly stuff before they are shot. Sound was okay I guess for a low budget... thats why I gave it 2.\n\nI think anyone can guess how it ends in the first 5 minutes so not even bothering to put a spoiler here. If there was one thing surprising, its that Bruce didnt do 99% of the killing, that came really unexpected."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "deloudelouvain",
        "review_rating": "3",
        "review_title": "Low ratings are in this case completely justified.",
        "review_detailed_main": "Bruce Willis is becoming the new Nicholas Cage. It looks like he's just accepting any role without reading the script, something Nicholas Cage seems to do as well. Not that I think Bruce Willis is a great actor, he just played in some good movies, but he's not a great actor, and lately he's been actually really bad. It's going downhill for Bruce Willis. Cosmic Sin is just bad, with a story that is badly written, special effects that looked from another century, and actors that don't seem to know what they're doing. I wish I could unwatch this piece of garbage."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "farout-45665",
        "review_rating": "1",
        "review_title": "This garbage really is a cosmic sin",
        "review_detailed_main": "Its so excruciatingly bad. Its the most generic cliched garbage you can imagine. Bad acting, bad story, bad casting, bad cgi, bad filming, bad editing... all of it is bad.\n\nIts honestly worth watching the first 30 minutes just to get a sense of how bad a movie can really get."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "davidwallis-34937",
        "review_rating": "",
        "review_title": "Worst Sci Fi I've seen in years and I love Sci Fi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kanciara",
        "review_rating": "10",
        "review_title": "Good for laughs",
        "review_detailed_main": "This movie had made my day! I laughed long and hard ... and I honestly, considered creating a \"go fund me \" page for Bruce, because the guy needs to be in some serious financial hardship since he agreed to stare in this glut. The \" he was going to die anyway\" scene is a ultimate proof that a good movie is not only made by good actors... Spaceballs is like a an Iliad of space movies when compared to this abomination. Hats down for anyone who can make it past 30 min mark.\n\nThis movie is so bad! So bad I dedicated 15 min of my life to create this account and post this review! Unbelievable!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nogodnomasters",
        "review_rating": "6",
        "review_title": "Hostiles on the Base",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cruise01",
        "review_rating": "2",
        "review_title": "Horrible",
        "review_detailed_main": "1 out of 5 stars.\n\nCosmic Sin is a horrible science fiction action film. The cast ensemble performances are horrible and phoned in. Looking for an easy paycheck. The visual effects are terrible. The action is boring. The story is terrible. The script and direction is terribly put together."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nocolus-09929",
        "review_rating": "1",
        "review_title": "So far the worst movie of 2021",
        "review_detailed_main": "I know Covid is out and the actors got hard times to get a job, but this is by faaaaaar the worst movie Bruce Willis ever done.\n\nThis will easy get him an good score at Rotten Tomatoes."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "confidential-67897",
        "review_rating": "1",
        "review_title": "Worse than you can possibly imagine",
        "review_detailed_main": "Can anyone remember when you could give more than 3 out of 10 to a Bruce Willis movie. This movie is just as bad as his last several films but with a budget less than fan fiction YouTube film. It's really that bad, I'm guessing 99% of the budget went on paying its 2 main stars."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tccandler",
        "review_rating": "1",
        "review_title": "This sci-fi has the budget of my last KFC run.",
        "review_detailed_main": "This sci-fi has the budget of my last KFC run. But hey, you can tell it is set 500 years in the future because it has neon lights. Bruce Willis and Frank \"How the Hell Did I get Famous\" Grillo are tantamount to cardboard cutouts in this cheap nothing-burger. I have already forgotten the plot... and I watched it ten minutes ago."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bombersflyup",
        "review_rating": "1",
        "review_title": "Bad.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bzz-52290",
        "review_rating": "1",
        "review_title": "Dont... Just do not....",
        "review_detailed_main": "I see Bruce Willis and I generally think 'action flick, but might be good'... Ohhhh how wrong was I. The only thing good about this movie is the 'idea' behind it. Everything else is just so, so bad! The acting, the dialog, the \"action\", the plastic/paper weapons, the reaction of characters, the story building its all just so bad. I registered my account on IMBD just to write this review, that is how bad this movie was.\n\nPlease do not waste your life. You might have dreams, do not let this thing crush them! Go and live, spend time with your family have some fun, but for the love of everything that is good DO NOT WATCH THIS MOVIE!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "adel-170-154104",
        "review_rating": "2",
        "review_title": "Spare your time",
        "review_detailed_main": "I never wanted a movie to end so quick! I can't believe this movie is from 2021."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gabberlunatic",
        "review_rating": "1",
        "review_title": "300 clowns gave this 10 stars.",
        "review_detailed_main": "All I got to say is don't watch because its a complete waste of your life."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "downhill-dude",
        "review_rating": "",
        "review_title": "Works only as a warning to film students on what NOT to do...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "seshazam",
        "review_rating": "8",
        "review_title": "Loved the movie",
        "review_detailed_main": "I truly wonder if all the negative reviews are from bots? How can someone be so critical of a pretty enjoyable movie that has a lot of very nicely done scenes and characters. The dialogues and characters I felt were genuine and realistic one might even say noble!\n\nBruce Willis steals the show definitely, but more importantly the director didn't make the movie from one character's point of view, it's indeed from a truly narrative point of view. Which I liked very much. Might be in the same league as Battlestar Galactica, but some profound dialogues with a different focus.\n\nVery good movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "elliotjeory",
        "review_rating": "6",
        "review_title": "It's not that bad",
        "review_detailed_main": "It's a low budget sci-fi film but it has an excellent cast and I liked some of the scenes, I think they did well with the low budget and it was a lot better than the other Bruce Willis sci-fi anti-life."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "subxerogravity",
        "review_rating": "3",
        "review_title": "Can't justify anyone seeing this movie.",
        "review_detailed_main": "Bruce Willis does this sometimes, it's one of those cheap flicks in which they spend a lot of money to have Mr. Willis spend 10,mins in the movie so they can put him on the poster and say Bruce Willis is in the movie, so that...Die Hard fans like myself will check it out.\n\nI'm hip to the con and sometimes it leads to a good movie. In this case I at least thought I would get Frank Grillo as the actual star of the movie but as it turns out he's also phoning this one with Willis. Guest he can do that after making that money In the Marvel Cinematic Universe flicks.\n\nThe movie has a complex plot about survival of the fittest on an interstellar level, which was pretty much wrapped up in the trailer of the film and never really goes any further.\n\nI would love to tell you how action packed this film is but that falls short as well. It feels set up to be fluffed with action but its all lame .\n\nThe only thing I truly got a kick out of was the cheap Sci-fi. You could tell they were trying to turn 20 bucks into 200 million, but sometimes those failures can give a movie charm. They had some visual effects scenes that were filmed perfectly and some of the costumes were so stylish i could not keep my eyes off of them (Making it easier to see all their flaws)\n\nIf you want a really good Bruce Willis is just on the poster movie checkout Extraction, it's perfect. I would leave this one alone."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rsauerf",
        "review_rating": "1",
        "review_title": "So bad...",
        "review_detailed_main": "I usually watch this kind of movies for a good laugh, but this one didn't even give me that little pleasure. I almost feel sorry for everyone who participated in this useless endeavor."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cobo-3",
        "review_rating": "2",
        "review_title": "Worst of low budget fodder",
        "review_detailed_main": "I was hoping this movie could deliver an interesting story. The low budget is obvious from the trailer, and the cheesy dialog and bad acting can be seen miles away. But low budget, poorly directed movies can have entertaining and compelling stories, and I like to find those.\n\nThis is not it. If you think there is any redeemable quality for this movie, because Bruce Willis must have seen something to be in it, you'd be wrong. I don't know why he agreed to be in this film, but the script was not.\n\nThe movie is full of cliches, but the worst part is that it doesn't make any sense. All is supposed to happen in less than 24 hours, yet the movie has characters and events that seem to have happened for decades. The mismatch of technological advances is ludicrous, with rifles with ammo alongside lasers, and gas vehicles with wormhole jumps.\n\nAbsurd beyond believe, there is a pocket sized weapon capable of destroying an entire solar system. Unstable, it can't be rattled and can be activated if dropped. The encasing of this technological marvel of 500 years into the future? A glass cylinder. Not even a cardboard box with padding like an iPhone.\n\nThe inconsistencies are so profound and frequent, that I truly started to worry about my own understanding. Am I having a stroke? How can this have passed through a team of people and nobody said anything?\n\nBut it is not me. This movie is really that bad. Like a word salad of low budget sci fy scenes cobbled up together by a defective algorithm.\n\nDon't waste your time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kuarinofu",
        "review_rating": "1",
        "review_title": "Unwatchable",
        "review_detailed_main": "This film is just a mess. I hope that the intention behind this was to make some easy cash. Otherwise, I just can't explain why would anyone get involved in this.\n\nThere are outlines of a story, but not like an actual screenplay. The time setting makes no sense, the WORLD BUILDING that is done through on-screen text doesn't seem to mean anything. The science is messed up beyond even the lowest fiction standards of science fiction. I think I had a general understanding of what was supposed to be going on, but I'm not sure.\n\nAt times it felt almost like a bad parody, and I hope they were just trolling the viewers with just how much they can get away with.\n\nIt looks like a fan film shot on a good camera with good actors but nobody cared one bit.\n\nI can't really bash on the actors, everyone needs some cash, there were a couple of recognizable faces like Frank Grillo (who isn't a pro actor, but he's always likable), Lochlyn Munro, even Costas Mandylor from the Saw series...this is just...bizarre.\n\nWillis delivered his basic nearly-coma performance which he does in most of his fast paycheck-oriented films now, and he made sure that the contract mentioned him in the script as an ultimate badass. His appearance was obviously agreed on only to have his face mentioned in the promotion materials.\n\nI usually endorse low-budget sci-fi when I see a spark of an idea or actual care put into one. This is an absolute waste of time, I strongly recommend everyone to skip this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "danielchr-83357",
        "review_rating": "1",
        "review_title": "Bruce Bruce Bruce",
        "review_detailed_main": "Bruce is the New Nicolas Cage.\n\nThis is a trash movie. Dont waste time on it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Dunkaccino",
        "review_rating": "1",
        "review_title": "A Cosmic Sin",
        "review_detailed_main": "Cosmic Sin is how Steven Speilberg would have directed movie.... if he was a baby. Maybe not. Any baby can make a movie better than this. Because this is a disgusting garbage that should not exist in humanity.\n\nBruce Willis is the star of this. Every scene he is in he looks tired and bored. Poor Bruce. Can't imagine working in a set of this film. Guess he just wants to pay some bills.\n\nThere are also other 'actors' in Cosmic Sin. But none of them knows what is called acting. There are even frequent close-up shots of actors just to show how terrible their performances are.\n\nWords can't describe how boring and boring this movie is. The plot isn't even interesting to begin with. It's amazing how 88 minutes can feel that long.\n\nEverytime you think this movie is ending it gives you more scenes. NO. You will find yourself begging for it to end.\n\nGo grab some snacks to eat instead. I find my self more entertained by eating the bag of chips in my hand than staring at this pathetic motion picture. Or if you want to look your TV for 88 minutes about a movie with nothing watchable, enjoy."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "knightkik",
        "review_rating": "1",
        "review_title": "Skip it or Stream it? the answer is .....",
        "review_detailed_main": "SKIP it!!!!!! dont waste your time and bandwidth... this movie is really bad in terms of acting and plot!! Sooooooo bad that I walked out from my own house!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "chris-h-3",
        "review_rating": "2",
        "review_title": "Does this writer/director team have something on Bruce or is it all some kind of tax write off thing?",
        "review_detailed_main": "Breach was really bad, this is no better and we've got two more pairings of this dynamic team to look forward to later this year I see.\n\nTo be fair some of the effects in this are good and you can see the actors trying their best. But already wearing restrictive paintballing gear and having to pretend that their badly fitting space 'helmets' actually fit something in the 'suit up' sequence really is the height of comedy.\n\nAll the ingredients are here to make a half way decent film but somehow nobody quite managed it. Again."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jackfrebitz",
        "review_rating": "",
        "review_title": "So, In the 25th Century....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "calirachela",
        "review_rating": "10",
        "review_title": "Can't wait for the sequel",
        "review_detailed_main": "I favorite part was the ending and I could go to the bathroom to pee."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "LCDOU",
        "review_rating": "7",
        "review_title": "Bruce Willis is never tired",
        "review_detailed_main": "Bruce Willis is never tired ! I liked this movie as I like his previous.\n\nI don't understand the negative reviews."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "AhmedDaReviewer",
        "review_rating": "1",
        "review_title": "A lot of people say this movie is bad.. Let me tell you why..",
        "review_detailed_main": "Before I start with the review, Let me tell you how I and my brother approached this movie, Critics said this movie is bad, Everybody said this movie is bad, As am I writing this review rn is has a rating of 2.5 outta 10 (yikes).. So basically everyone said this movie is bad and WE KNEW THAT.\n\nMe and my brother love watching bad movies, Sometimes when a movie fails at every aspect of being a decent product It can be super entertaining, Movies like The Room, Troll 2, I will even go as far to say that Suicide Squad is one of my favorite movies because of how hilariously awful it is.. Unfortunately this movie wasn't...\n\nCosmic Bin is one of most boring bad movies I have EVER SEEN!\n\nThe story is the most generic sci fi fantasy gebber gabber, Bruce Wills is a retired space soldier (or something like that) and the space military station want his stuntdoub~ I mean him, To do one last mission..\n\nThe action scenes are too boring and so far in between with unnecessary slow-motion with sound effects we have heard a thousand times before..\n\nCharacters so generic you won't even remember their names after the credits roll, Bruce Wills's character (James Ford, Such a creative name lol) kills one of soldier friends FOR NO APPARENT REASON.. and that's the character that we should love and sympathize with.. Oh yeah and Frank Grillo, The first guy in the credits, He barely appear in the movie (WOW, Such a great passion for movie making)\n\nDon't watch this movie, It's super boring, Full of filler and pointless scenes, Bad acting / custom design, Uninspired music and It's not even funny, Avoid this movie at all costs.."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mcmickymick",
        "review_rating": "1",
        "review_title": "Total Suckfest",
        "review_detailed_main": "I no longer fear death because I have seen Cosmic Sin and what could possibly be worse? The biggest sin is that this steaming pile ever got made. Made my eyes bleed and I kept throwing up in my mouth. Saying it was bad is an insult to bad movies everywhere. I could actually feel brain cells dying as I sat through this abortion. I don't think I'll ever be able to drink enough to erase it from my memory. Best part of the whole movie was when it ended and the pain finally stopped. Shame on you Mr. Willis. Shame on You. If you have someone that you hate. I mean REALLY HATE tell them to watch Cosmic Sin. They will no longer want to live in a world where horrible things like this \"movie\" exists. Gotta go shower now and try to wash the stench of this atrocity off me."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "codylottpg",
        "review_rating": "1",
        "review_title": "How the F is this even rated 2.5?!!",
        "review_detailed_main": "This movie is terrible!!!! Actually I don't think we have made up a word that describes how bad this movie is. I would rather listen to \"this is the song that doesn't end\" over and over for eternity than watch this movie again. I would rather hang out with Barney and Blues Clues. I would rather sandpaper the a$$hole of an alligator in a phone booth. I still don't feel I have expressed myself enough on how much this movie was an utter disappointment. But that's all the energy I have left. I wasted the rest on hoping something would get better in this god awful movie!!!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "enjozsef",
        "review_rating": "1",
        "review_title": "i belive now",
        "review_detailed_main": "I didnt belive for the people who sayd this is the worst movie in the year or era. But now i belive. This is. Dont waste your time. Its realy realy that bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "daiquar",
        "review_rating": "1",
        "review_title": "Worse than you would think",
        "review_detailed_main": "If you have read any of the many lengthy negative reviews you will only have gotten just a small inkling as to how bad this movie really is."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "AfricanBro",
        "review_rating": "2",
        "review_title": "One of those 'Bruce Willis just can't say no' movies",
        "review_detailed_main": "I read that Bruce Willis only took a day of filming for this and the rest of it was stunt doubles, that doesn't bode well. He barely put a full sentence in. It had a cast capable of making something at least decent; Bruce Willis, Frank Grillo, Lochlyn Munro are some of the more known actors that you might have seen before but are usually hit or miss actors and this was a miss. The main problem was the writing though, the script was horrible and unimaginative. The plot and premise were unoriginal but okay, with a good enough script this would have been tolerable, maybe good if you wanna stretch. It's paced all wrong too, with some scenes and pauses going on too long for dramatic effect but it just made me wanna fast forward. The CGI was all bright and neon, quintessential of low budgets sci-fi movies and series to make them seem more futuristic. Also, the whole mysterious alien wormhole gate and a rogue team heading to stop it feels like a farce take on The Expanse. I'm surprised I watched the whole thing, but I think that's owing to heading into it with already low expectations and nothing better to do. Definitely not worth a watch. I've always wondered how directors feel after making a movie and it has a crappy ratings on every review platform."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gnatsong",
        "review_rating": "1",
        "review_title": "OMG",
        "review_detailed_main": "Another atrocious offering from Bruce Willis. Everything about this film is garbage. The acting, the script, the direction. If you wish to spend an hour and a half more productively, rip off your clothing and roll in poison ivy."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Reviews_belarabi",
        "review_rating": "1",
        "review_title": "Is that spacesuit made of colored plastic ?",
        "review_detailed_main": "If I could rate the movie under 0, I would do that"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "alcoholfree-18653",
        "review_rating": "",
        "review_title": "I wonder how much this movie 's budget is?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "zackeryaw",
        "review_rating": "10",
        "review_title": "This movie has everything!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "JayShermanTheCritic",
        "review_rating": "7",
        "review_title": "Not bad at all",
        "review_detailed_main": "I liked it. People are a little to overly critical of scifi. Good flick give it a shot. Glad to see Bruce back in this genre"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "vpablo-89738",
        "review_rating": "1",
        "review_title": "Had to make an account to warn you",
        "review_detailed_main": "This is the worst movie I've ever seen, and I've seen a lot of garbage.\n\nNot only is this film stupid, derivative and criminally badly done but for some reason they tried to make it about a very clumsy but very disturbing apology of genocide.\n\nI watched this wondering all the time what the few dozens of people making this trash were thinking at the time of making it. Is it possible a single person here believed in this? How did anyone even agreed to pay for it?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "classicsoncall",
        "review_rating": "5",
        "review_title": "\"Either way this works out, it's gonna be on the wrong side of history.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jscskdh",
        "review_rating": "1",
        "review_title": "Worst movie in existence! Unable to put in to words!",
        "review_detailed_main": "I've never left a review in my entire life. I mean on/for anything, including restaurants, purchases, FB, Yelp, etc!\n\nFor the first time in my life I felt compelled to leave a review. This WAS THE WORST MOVIE IVE EVER WATCHED, HEARD OF, OR EVEN READ ABOUT. I can't put in to words how bad it was.\n\nI'm not familiar with the movie making business. I can't even phantom how this movie even made it past the first scene. How did the actors continue? How did the director continue? The producer? HOW?!?!?!\n\nThis movie should be banned from all platforms! PERIOD! No excuse, no question!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rynerbyner",
        "review_rating": "1",
        "review_title": "It was painful.",
        "review_detailed_main": "This movie was absolutely horrid from start to finish, Bruce Willis brought absolutely nothing to the movie...In fact he was hardly even in it. The small amount of screen time he did have he was half asleep and really gave the impression he never cared about the role and putting effort into his character, it was like he didn't even want to be on set.\n\nI was extremely close to just turning off the movie half way which takes me a lot to even get to that point. The story line and plot is laughable along with the snooze fest acting. Most of the viewing experience was me and my wife going ''huh?\" \"what?\" \"This makes no sense.\" ''Damn this is bad''.\n\nI wouldn't even recommend this movie to my worst enemy. It was painful to watch. Don't even waste your time, the only thing you will be missing out on is a painful viewing experience."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cpeterson-79113",
        "review_rating": "1",
        "review_title": "I created an account just to leave a review for this movie",
        "review_detailed_main": "The first 10 minutes were cool. I genuinely don't have words as to how bad of a movie this was. Edward Drake deserves to be disowned by his family and cast out of Hollywood and never allowed near a studio ever again. There were so many confusing scenes, uncalled for romantic interest pulled out of thin air, and important pieces of plot seemingly left out. A middle school group project would have been better to watch. Please spare yourselves and do not watch this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "opticuscro",
        "review_rating": "1",
        "review_title": "Warnning clichés attack!",
        "review_detailed_main": "Yikes, this film is a series of bad clichés one after the other, the visual effects are poorly done, the plot is confusing and not interesting, I managed to watch it to the end but barely."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "IonicBreezeMachine",
        "review_rating": "2",
        "review_title": "Were this a no budget film released on YouTube by some students for free I'd recommend it, but as a product by a professional studio with Bruce Willis in the lead it's trash.",
        "review_detailed_main": "In the year 2524 an Earth colony has first contact with a hostile alien race. General Ryle (Frank Grillo) enlists disgraced \"Blood General\" James Ford (Bruce Willis) who was infamous for his use of a Q-Bomb that killed 70 Million people. Ryle enlists Ford to lead an off the books team to eliminate the alien threat before they're aloud to spread through the galaxy.\n\nReteaming with Edward Drake and Corey Large of fellow DtV Willis sci-fi film Breach, Cosmic Sin looks and feels like it's from the same filmmakers to the point they almost feel like entries in their own \"universe\". Instead of aping Alien or The Thing like Breach, Cosmic Sin is more in line with sci-fi action like Aliens or Edge of Tomorrow. In a way I suppose Cosmic Sin is a marginal improvement on Breach, but in other ways with a larger scale story and a similar production budget, it feels noticeably cheaper than Breach as well.\n\nMuch like Breach the movie doesn't feel like it takes place in the future. At least with Breach once they were on the ship they at least had proper uniforms that fit with the situation, but in Cosmic Sin everything feels like it's straight from today save for some CGI establishing shots of spaceships and some \"armor\"(we'll get to that). It's clear the movie's reach far exceeds it's grasp with the \"high tech military facility\" using the same tricks as breach to make it look futuristic with harsh multicolored lighting and poorly integrated hologram effects. But the filmmakers luckily decided to give us some locational variety with their shoot....the woods! All of the colony scenes (save for one scene with a tent) take place in the woods and have the same feeling of rushed and economic one would expect to see in a LARP straight out of Role Models. The armor the characters wear in the second half of the movie makes no sense as the script says it's approved for \"quantum combat\"(whatever that's supposed to be) and with open faced helmets and massive bare patches there's no thought or care as to how these cheap bulky monstrosities function in combat or space.\n\nOutside of the bare bones production values, the movie's script is a hodgepodge of pretty much every other sci-fi film/video game you've seen(and a few you haven't) with the likes of the 2009 Star Trek, Stargate, Edge of Tomorrow, Screamers, Gears of War, Aliens, and even Ghosts of Mars. The movie's script also tries to address \"ethical issues\" in quite possibly the most ill fitting approach since 2005's Stealth tried to analyze the moral issues of unmanned drone warfare. Willis' \"Blood General\" James Ford is so named because he quelled an separatist rebellion by dropping a Q-bomb killing 70 million people. The movie is strangely uncritical about this character with many of the supporting cast spouting things about how Ford got a \"Raw Deal\", \"It's harder to give orders than follow them\", \"you need monsters to beat monsters\", and it's the kind of mindset that many villains use for justification in many films of this ilk that makes the film feel fundamentally confused. Not that the story will draw most people in as it's poorly delivered with bad camera work, poorly staged sequences, and sleepy performances from uninterested actors with Bruce Willis' voice never even breaking an octave.\n\nCosmic Sin continues Bruce Willis' disappointing DtV streak with an embarrassing cheap sci-fi rehash that is put to shame by amateurly made fan productions. With a sloppy production, cut and paste script, and uninterested performances that leave the movie inert and dull the movie will give you the odd laugh or smirk from point out its stolen ideas and concepts, but aside from that it's yet another cheap dud from a once respectable actor."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sam_tota_007",
        "review_rating": "1",
        "review_title": "Cosmic Sin is really a SIN",
        "review_detailed_main": "A few things that i observed during my 1+ hour of struggle: Worst Acting, worst story, worst CGI, And of course, Worst version of Bruce Willis.. Please dont watch it even if you have a lockdown!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "theknownames",
        "review_rating": "8",
        "review_title": "appreciate this, solid 8",
        "review_detailed_main": "This would probably have made a better series for sci fi newbies because it necessitates inference ( had to know what is happening based on lore and my other experiences.) for example at times my roommate had no clue what was happening . But I like how it cuts to the chase , I like the way it looks and the soundtrack. I think this is special and maybe ahead of it's time in the way the story is presented. The concept is solid and the viewer is not coddled in the delivery. With the whole production , costuming , concept , entertainment. I just can't see how anything about this is a 2-maybe Bruce Willis drew a different demographic. He is however perfect in this and for this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "apexadam",
        "review_rating": "6",
        "review_title": "I've seen MUCH worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Armin_W",
        "review_rating": "1",
        "review_title": "Big pile of crap",
        "review_detailed_main": "Everybody who was involved in producing this masterpiece of crap should instantly end his/her career. What a waste of money (but not talent). They should be sentenced to watching this masterpiece of stupidity for 100 days in a row. Actors included. Shame on all of you!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Spectowsky",
        "review_rating": "2",
        "review_title": "A movie that makes you question your own life",
        "review_detailed_main": "When a bad movie with aliens can be so bad, this is a great achievement. So at the end you look to screen with end cridits and think \"Why?\""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kjellronnyjohansen",
        "review_rating": "2",
        "review_title": "What in the world is it with Bruce Willis these days?",
        "review_detailed_main": "First we had Breach, who was so horrible that I had no idea what to make of it, and now this. The movies are so bad that it makes you wonder if he has lost a bet or something to be making these movies."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "muratis",
        "review_rating": "2",
        "review_title": "Wasted valuable lifetime",
        "review_detailed_main": "I think this was the worst movie I ever watched. 1.5 hours erased from my short lifetime, I really regret the time sacrificed for this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jimbo-53-186511",
        "review_rating": "1",
        "review_title": "Far from cosmic; the true sin has been committed by those that produced and worst still green lit this film!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jaimemedina-36288",
        "review_rating": "1",
        "review_title": "Cinematic Sin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "travispowell-75460",
        "review_rating": "1",
        "review_title": "This might be his worst piece of trash to date.",
        "review_detailed_main": "What happened to Bruce Willis? Never again will I click on a random BW Netflix movie. Hey Netflix.... Bruce Campbell belonged in this one."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "surfingthebigwave",
        "review_rating": "1",
        "review_title": "Bruce Just Quit Showbiz",
        "review_detailed_main": "I'm not even going to bother wasting an hour and a half my brain cells watching this because I know just by the pain staking wince inducing trailer that this belongs in a dumpster fire.\n\nBruce Willis retire. Quit. Do something. But just stop with this embarrassing garbage.\n\n0 Stars."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nizarall",
        "review_rating": "",
        "review_title": "Niclase Cage followers",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "neoanderson12",
        "review_rating": "10",
        "review_title": "Actually a good movie compared to recent 2020-2021 sci-fi",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "chrisbrooks-19259",
        "review_rating": "7",
        "review_title": "This is NOT a 2.5 rated movie!",
        "review_detailed_main": "First, I am giving a general rating system below for the idiots who think this is a one. This isn't the best movie ever but if you like SyFy it is a good movie. It is entertaining.\n\nI almost didn't watch due to this being rated a 2.5 overall. I mean that rating would make this a steaming piece of garbage, which it is not! I was curious how possibly bad this could be so I watched the first 10 minutes then watched the whole movie. Yes, the special effects aren't that of a 100 million dollar movie but they aren't too bad.\n\nOverall this is a good SyFy movie, definitely watchable if this is your genre. Aliens, military, action and a good enough plot with dialog. Better than the movies the SyFy channel puts out themselves. Honestly I would have rated a 6 to 6.5 but since everyone rated so low I rated it a 7. Don't rush to watch it but if you like SyFy and Bruce Willis then a good way to kill some time.\n\nI wish you could only rate if there was proof you watched the whole movie or series.\n\nI want to make this clear. Here is how ratings should work! Since we can't give a zero an average movie is 5.5. So a 5 is a little below average and a 6 is a little above average. I just jotted these all down so I am sure they could be tweaked.\n\n1 Is totally unwatchable. Complete waste of time and money! I want my eyes and time back! These are movies Elvira said no to! Burn all of these as they have zero cinematic quality to anyone!\n\n2 - This movie was rejected from the B movie festival. I would not watch again, I would never recommend and I am upset I saw it! The only reason it might do well is people watch these because they are so bad it is funny.\n\n3 - This is a B movie and not a good one at that! I was at someone's house and I could not escape. Good date movie so they might like to do something else. ^ ^ Would not recommend and I am upset I watched.\n\n4 - Ugh, This wasn't very good. I watched too much so I felt obliged to watch the rest. I am not super happy I put it on! I guess B movies fit in here.\n\n5 - Slighty below average. Watchable and okay but would not watch again.\n\n6 - Slightly above average. Watchable and a enjoyed a few parts.\n\n7 - Good movie. Happy I watched it. Some good parts in it.\n\n8 - Amazing movie. I greatly enjoyed this movie! Very happy I watched it!\n\n9 - Wow. Not a blockbuster but really enjoyed this! I would tell anyone to watch this awesome movie. I will watch again! Great job!\n\n10 - One of the best movies! I would love to see this movie again! I would like to own this. Great piece of cinematic art!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "thomaselers-52041",
        "review_rating": "1",
        "review_title": "Contender to the title \"Worst Sci-fi movie ever\".",
        "review_detailed_main": "This is honestly one of the worst movies I've ever watched, it's lame in every department. It seemed they burned of their budget to have Bruce Willis in half the movie, and as a result, the rest of the production cost had to be cut down, the whole movie takes place in a warehouse (made look \"futuristic\" with blue and orange neon lights, because that's the lighting everyone uses in the future(!)) together with a few set pieces in a forest. That's it. Do not, I repeat, DO NOT waste your time (or money) watching this stinking pile of crap. I wonder what made Bruce Willis agree to contribute to this tragedy? (He must have owed someone a huge favour)\n\nIf I could give it zero stars I would, it's a terrible movie, terrible story, terrible acting..... TERRIBLE!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "fredbred",
        "review_rating": "1",
        "review_title": "Better to skip this one",
        "review_detailed_main": "Honestly, don't watch this one. It will only makes you sad.\n\nWell it makes you wonder - is age all it takes for you to drop your expectation and dignity bar low enough to accept a role in a hollow movie?\n\nMake yourself a favor and watch The Fifth Element instead :-)"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cary_howe",
        "review_rating": "1",
        "review_title": "We finally have an answer to an age old question",
        "review_detailed_main": "Apparently there is nothing Bruce Willis won't do for money. They somehow managed to reduce the script to the title. The film itself is just a lot of stolen ideas from everything from Starship Troopers to Stargate to the infected humans were like the things from Ghosts of Mars. They just throw out a couple of ideas to get the ball rolling and then start the effects and gunfire. This seems to be Netflix's answer to Tomorrow War only somehow without anything resembling a story. Bruce, I hope you made some money off this turkey because the next step down is picking up cans along the side of a road......."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sleimanrawa",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "It starts okay, and then 40 minutes in I'm like what the hell is this? I don't get it, I have no idea what's going on. The script is garbage, it's soooooo boring and there's nothing out of this world high teck to make you believe it's the yr 2500. I didn't finish it it's that bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jessetilro",
        "review_rating": "1",
        "review_title": "Absolute worst of the worst",
        "review_detailed_main": "Please do not spend your time and money on this movie. I cannot recall ever being this disappointed by a movie. The production quality is painfully low, acting is terrible, the story is cliché and uninteresting, the pace boringly slow."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "fatherofjohnny",
        "review_rating": "1",
        "review_title": "The making of this movie was a 'Cosmic Sin'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tabuno",
        "review_rating": "3",
        "review_title": "A Faint Potential For A Engaging Sci Fi Movie Falls To Poor Writing and Execution",
        "review_detailed_main": "In Cosmic Sin the 26th Century still using way outdated hand weapons (eventually even a grenade) and pick-up trucks and honking vehicles on a street and parked motorcycles and even cigarettes indistinguishable from the 1960s. The Nostromo from the Alien (1979) had a way much better med unit. Early scenes after the good and bad introductory mystery have of course the requisite robotic servers and hologram (country?) singers and a barfight with a slight difference with again the old-fashioned side arms and the Calvary with an attempt at twinge of an alternative outcome that really is not.\n\nThere are major storyline problems with the quarantine procedures even simple glass windows and even a typical \"gun\" fight, yet there was an initial attempt at fascinating underlying dynamic taking place however with the first contact encounter scenes and subsequent reflective commentary. Then somehow a brief firefight does not flow well, problems with editing arise, a scene very underdeveloped, and supposedly a well-manned defensive team becomes at risk of being actually overrun. Instead of a quickening climatic pace, the energy seems to dissipate and slow down along with almost no high-tech, futuristic surveillance networks to warn of impending attacks becomes more combat scenes from a mediocre World War II movie with elements from Stargate (1994) and worse yet the climatic battle is something that would be more like out of a World War I engagement and lame hand to hand sequences and a limp effort a riveting emotional end. The screenwriters were definitely not up the job and no actor could improve on a thin script that had the promise but not the actual substance to translate into a credible movie. This movie even reverted to absolutely unnecessary cowboy, western era musical harmonics while Bruce Willis strangely just seems to fade almost completely away by the end of the movie.\n\nThe major problem with Cosmic Sin lies with the screenwriters trying too hard to be cute and offer up something substance, different, and try to incorporate too many fancy relational and philosophical ideas. They failed in their execution and omitted too many important backstories to offer audiences a sense of plot flow. Instead the audience is sort of just dropped into this movie without the understanding of what the real motives of what is going on. The audience is forced to play catch up. The writers fall into their own traps with the only way out of empty ideas is to create overly convenient ways to extricate themselves out of various corners (i.e., where a general loses face for backing down on his own orders, the awkward political dynamics of the military decisions being made, past undisclosed relationships).\n\nMaybe the only nice surprise of this movie is the character and what some people might call a cameo performance of Lochlyn Munro. He appears to have finally broken out of his typecast of either simple bad guy or side character in a slew of romantic comedies. Munro had a decent performance here."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ktd7",
        "review_rating": "1",
        "review_title": "Golden Raspberry Winner!",
        "review_detailed_main": "I thought I'd seen the worst streaming movies until I saw this. I could make a list of its many flaws, but it, like the movie, would be pointless. Just go watch Star Trek -any of them- again."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mikemell-40079",
        "review_rating": "",
        "review_title": "I saw it. I can't unsee it.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Jon_Galt",
        "review_rating": "10",
        "review_title": "Ignore the haters - fun wild ride",
        "review_detailed_main": "It seems that the haters who bad mouth this movie are a bunch of whiny babies with short attention spans and no imagination. If you like sci if and Bruce Willis this movie is for you!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "SamWizeGanji",
        "review_rating": "7",
        "review_title": "You don't know what a 3/10 is...",
        "review_detailed_main": "...until you've watched Hick Trek\n\nThis isn't great. It's a decent syfy movie.\n\nI've seen comments about the \"money was spent only on actor's salaries\" (The sets were well done) - \"it's not futuristic\" (There is no promise of plasma weapons in the future) - \"12ft sniper rifles\" (Don't exaggerate reviews) - \"I want my six hundred and sixty six hours of my life back\" (Everyone wants time back) - \"I didn't watch more than the opening credits\".\n\nThis movie doesn't deserve the hate or 2.5/10 rating. The absolute lowest it should be at is 4/10. It's watchable, at least one time.\n\nThese 1/10 reviews are dismissible. I'm giving this a 10/10 strictly because the ratings seem to be made up of people who don't actually rate movies based on what the film offers.\n\nI'd give this a 6/10. It's good enough to make me watch it again.\n\nIf you want to see a move that is less than three stars, go watch the worst of Troma's home video releases.\n\nNo this isn't a masterpiece, I'd argue it's better than The Hudson Hawk, which I can't bring myself to sit through again."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "juliahope-25166",
        "review_rating": "1",
        "review_title": "BRUCE WILLIS WORST FILM EVER",
        "review_detailed_main": "This is a total mess from start to finish. No story and no explanation of what's going on. The acting is atrocious and aliens awful! Rubbish!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kcrateau",
        "review_rating": "1",
        "review_title": "Wish I could unsee this",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "carp-43879",
        "review_rating": "1",
        "review_title": "Utter Garbage",
        "review_detailed_main": "What is wrong with sci-fi these days? Where is the imagination? Asylum movies are pretty bad but watchable and this didn't come remotely up to their standard. Who on earth thought the script had merit when characters struggled to string a few words together. Why do writers think the 'f' word has to be in every other sentence?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bwrbfd",
        "review_rating": "1",
        "review_title": "Astronomically Bad",
        "review_detailed_main": "Whoever green lighted this film should be thrown out of the film industry and never be allowed back in. Who at Netflix was actually dumb enough to paid for this total waste of time. This could actually be the worst film Netflix has ever aired. I can't believe that Bruce Willis was desperate enough to make this. He must be really bored."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nyjwycq",
        "review_rating": "1",
        "review_title": "Unfortunately, they do not have negative rating stars!!",
        "review_detailed_main": "This is the worst film I have watched -- EVER.\n\nThe story line was extremely thin and badly played out.\n\nThe cinematography was absolutely appalling, the director should hang his head in shame.\n\nThe script, well, let just say, my cat (Loki, a very vocal feline) could have created a better script. He only just meows and yips and clicks. Would have been so much better\n\nThe local, land based CGI was diabolical, however, some of the space based cgi was quite good. (the only good part but not a saving grace)\n\nDid they find the alien weapons in a Battlestar Gallactica left over bin?\n\nBruce - what were you thinking, I really thought more of you!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "noawareness",
        "review_rating": "2",
        "review_title": "They paid Bruce Willis in iTunes vouchers",
        "review_detailed_main": "Remember when Bruce Willis was in Quentin Tarantino movies? Remember when you couldn't see how much he hated acting? Remember when he used to care? Yeah, me too."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "donwonton",
        "review_rating": "1",
        "review_title": "Has some real Tommy Wiseau quality to it",
        "review_detailed_main": "I assume Bruce Willis made this because a) he was paid an insane amount of money, b) he was blackmailed into doing it or c) both a) and b)\n\nIf you absolutely have to watch it on Netflix, download it so you watch it 1.5x speed."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "potterjgore",
        "review_rating": "1",
        "review_title": "I wanted to make a witty review title...",
        "review_detailed_main": "But this piece of absolute garbage doesn't deserve it. I actually created an account so I could write this review and try to help warn anyone in the future to avoid this at all costs. The only thing that got me through this \"movie\" to the end credits was complete blind rage. Love yourself and don't do it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "melyssalima",
        "review_rating": "",
        "review_title": "What's this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "czmaarup",
        "review_rating": "10",
        "review_title": "Short & Simple - A Rare Fan.",
        "review_detailed_main": "I think that 2.5 in rating is wrong.\n\n2.5 is actually why this movie caught my attention.\n\nAnd of course because of Mr. Willis!\n\nI know that he has made a few wrong choices when it comes to movies.. But who cares.\n\nSometimes B - Movies are interesting because they ARE B - movies.\n\nI recommend this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "robertomisuraca",
        "review_rating": "6",
        "review_title": "Old style...",
        "review_detailed_main": "Non è male... Ovviamente è un genere che deve piacere e non è per tutti. Azione e fantascienza non mancano."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "j-93237",
        "review_rating": "2",
        "review_title": "complete sin",
        "review_detailed_main": "Awful. just awful. I was hoping this would be good entertainment. complete disappointment."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "schtoidzberg-66586",
        "review_rating": "1",
        "review_title": "Biggest bruh moment in cinematic history.",
        "review_detailed_main": "Pure cancer.\n\nLooking at wall drying is more fun.\n\nDoesn't even work as comedy."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "PyschProfBob",
        "review_rating": "1",
        "review_title": "Cinematic Sin",
        "review_detailed_main": "So bad it's worth watching as an anchor experience, so you know what kind of film rates 1 on a 10 point scale. 1 actually seems a little generous. On the plus side every other film you watch will feel slightly better because you'll have Cosmic Sin as a contrast."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "chalengepark",
        "review_rating": "1",
        "review_title": "Woops",
        "review_detailed_main": "Love the idea of the movie, which why I watched it. Saw Bruce Willie in trailer, \"can't be bad\". Didn't look up reviews, it was bad. I have never written a review until now. I don't know how many movies ive seen. I honestly think that I can write a script/shoot the idea of this movie better, and I suck at most everything in life."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "anthonysdbrown",
        "review_rating": "1",
        "review_title": "Disgrace !!!!!!!!!",
        "review_detailed_main": "What a piece of cosmic Shxt!. Poor visuals, it's like this was created on a $20 budget."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jaimecostech",
        "review_rating": "1",
        "review_title": "Total and utter garbage",
        "review_detailed_main": "Do not waste your time, worst movie I have seen in a very long time"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "imseeg",
        "review_rating": "3",
        "review_title": "I am a huge scifi and Bruce Willis fan. BUT...this scifi movie looks ridiculous and Bruce Willis is only present due to contractual obligations...",
        "review_detailed_main": "I AM (was) A BRUCE WILLIS FAN.\n\nBUT....this movie is a stinker, a fraud. It is simply NOT anything near a scifi movie. It is just another contractual obligation for Bruce Willis, so he can pay his bills for 15 minutes of acting...\n\nThe only one that is gonna be happy is the producer of this movie, because he knows that many, MANY people will watch it, based on the sole appearance of Bruce Willis. Too bad, this movie s8(!ks...\n\nThe \"story\": .....\n\nPfff... a 9 metacritics score, that is a new record low (before it was 12).\n\nIn my quest to see ALL Bruce Willis movies I also watched this one. Let's not forget that some of the movies Bruce Willis is making nowadays is only because of contractual obligations. That's the reason why he is churning out 5 till 10 movies a year upon year. That's a lot. Of course you cant be picky when you are starring in 10 movies a year. He often only stars in each movie for no more than 15 minutes or so. Producers happy, because they sell tickets with Bruce his name on the bill. Bruce Willis happy because he got his paycheck and can pay alimony to his ex-wives. But the audience watching it, might not be so happy, because they are expecting DIE HARD quality filmmaking. And to put it politely, some of these newest Bruce Willis movies are \"a bit\" inferior to DIE HARD.\n\nAt an (excrucially) important sidenote, let us not forget WHY we are watching Bruce Willis movies to begin with. We watch Bruce Willis movies because of DIE HARD (1988). THE ONE AND ONLY BIGGEST ACTION AMERICAN ACTION CLASSIC OF THE CENTURY.\n\nThis classic is still standing strong after more than 30 years. Millions of people still REwatch it during every Christmas holiday. Recently a petition was launched to rename Nakatomi Plaza into DIE HARD plaza.\n\nA life time achievement award for Bruce Willis is in the making.\n\nDIE HARD (1988) NEVER DIES but is still ALIVE AND KICKING IN 2022. Why not simply REwatch the brilliant DIE HARD (1988) again and start the new year with a bang! Happy New Year!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "yehoshua-wittmer",
        "review_rating": "2",
        "review_title": "School project?",
        "review_detailed_main": "If this was a final year cinematic school project, only the casting guy would have passed. Everyone else would have failed. This looks like they had a $ 10,000 budget and only used $ 5000 of it. 2** for the casting guy, 0* for the rest."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "DaveG121",
        "review_rating": "",
        "review_title": "It's a B Movie...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "maxhashish",
        "review_rating": "10",
        "review_title": "Absolutely nonsense and garbage but I loved it",
        "review_detailed_main": "Bruce Willis what even is this???? Literally one of the worst movies I have ever seen, it got so bad to a point that I thought I personally could make a better movie with an old camera I have, the acting is stupid and unbelievable, the year is in the 2500s but there's almost nothing to indicate any progression from today's world?? I thought sci fi movies are supposed to be a bit creative in that sense but this one what just ridiculously stupid, you could see the crew in weird shots sometimes and this whole thing just feels like a money laundering scheme it CANNOT be a seriously made movie, but it's fun to watch cuz they make so many ridiculous mistakes in the storyline too, it feels like a 5 year old wrote it!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lukem-52760",
        "review_rating": "7",
        "review_title": "ANOTHER CHEAP 'N' CHEESY SCI-FI B-MOVIE WITH WILLIS!!!",
        "review_detailed_main": "EDWARD DRAKE who directed this very low-budget t.v series like Sci-fi Thriller also had written it & also had written the other Bruce Willis Sci-fi Cheapy ANTI-LIFE (2021) also & that explains why both films are so similar & i thought that as I watching it, i actually said to my wife that Willis must've gotten Deya Vu making this!!! I actually liked ANTI-LIFE better of the two but to be honest they do make a chilled evening of a Double Bill of Willis Sci-fi Thriller's. Now COSMIC SIN is set like it's other half of the Double bill, in the future but this time the world isn't destroyed but just very futuristic (with what the small budget could do) with flying cars/vehicles as well as normal cars too still & robots for a barman in the bars (Similar to Will Smith's i,Robot 2004) & lots of glowing Neon lights & things & for the most part it looks good!!! Yes it's very low-budget but i gotta admit i was impressed with alot of the look & technology they pulled off with cheap c.g.i & practical effects & the basic story is our planet has finally made contact with Alien creatures but they're hostile & when a team return from another planet that they've been stationed on, they come back possessed just like in it's close brother ANTI-LIFE & start killing everyone in the station base & here we get our team of soon-to-be heroes with the rugged old infamous ex-Commander Bruce Willis known as a warmonger due to his brutal past & it's just nice having the old skool Action legend here in such a low-budget production, even if he's only here for the paycheck!!! Willis plays his part like most these days with a calmness & a Coolness & a bad attitude just like he did in Anti-life & many other of his DTV films but i like him here & just by having him lifts its quality. We also get the great B-movie legend FRANK GRILLO who i have loved since THE PURGE: ANARCHY & his Cool, rugged & no-nonsense toughness is on display again in a leader role but to be honest he doesn't get to do the action i expected & wanted but again it's great to have the veteran side by side with Willis. There's a few other familiar faces but it's these two stars is why i wanted to even watch this.\n\nI will say this though that i would rather watch this flick or Anti-life over any of the ridiculously mega budget TRANSFORMERS films & more so than many of the over-blown budget trash that is put on the Cinema, Cosmic Sin is small scale but crams in a fun little Sci-fi action story with a Cool Willis leading it all even if he's not exactly giving it his all, still miles better than the usual Steven Seagal DTV flick. Small minimalist budget yes but i see alot of creativity went into creating the look & it's futuristic technology & it does look Good for it's budget!!!\n\nAt times i got the feel & vibe of a POWER RANGERS episode or movie, especially when they gear up with body armour suits & when they fight the Alien beings (that seem like possessed humans as you Don't ever see their faces or what they really are) the villains come accross as the type that the Power Rangers would battle but hey it's a Low-budget slice of Sci-fi Thriller cheese so i just took it for that. Our team are power boosted through space & land on another planet that is fine for Humans & the rest of the Cheese fest plays on the forest planet with rebels (like STAR WARS) & the action is fine for a cheap flick with laser guns & possessed warriors that also reminded of John Carpenter's Ghost's of Mars just like ANTI-LIFE did too!!!! Many Sci-fi flicks enfluenced this as did ANTI-LIFE & like i said both written by Edward Drake but only this one was directed by him.\n\nCosmic Sin just like Anti-life is a cheap, trashy & cheesy but fun B-movie that's nothing special or great but an easy watch & does make a nice Double bill with ANTI-LIFE. Entertaining & fun."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Chuy1869",
        "review_rating": "2",
        "review_title": "Great movie to fall asleep to!!",
        "review_detailed_main": "Proves that Hollywood makes movies like these to write-off on taxes! From the first minute in, it was obvious it was gonna be a piece of s**t ."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sjo-72552",
        "review_rating": "1",
        "review_title": "Movie itself is a Sin",
        "review_detailed_main": "Sharknado absolutely destroys this movie in acting and in cgi. You're better off paying an anaesthesiologist to put you to sleep for 2 hours, that way you don't have to feel any pain while you watch it. I should have listened to the reviews but just wanted to see for myself because I'm an old school Bruce Willis fan. I just can't believe this is the same Bruce that was in die hard...."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rickgodwin-88664",
        "review_rating": "1",
        "review_title": "It was a cosmic sin to make this movie",
        "review_detailed_main": "500 years in the future and they are driving cards and shooting regular guns. And that might be the most logical thing about the movie. The acting was atrocious. The writing horrific and the plot made zero sense. Just say no"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Alcaminhante",
        "review_rating": "1",
        "review_title": "I don't get it...",
        "review_detailed_main": "I'm not one of those users who tend to write one star reviews on IMDb. In fact, many of my favorite b-movies or indie movies are movies I discovered on IMDb and tend to have between 1 and 4 stars to which I don't agree because I loved the movies for being low budget in the first place. But now this Cosmic Sin really baffled me. Nothing works, the pacing is clunky, the dialogues are terrible, Bruce Willis seems to stare at the camera and do one liners just because and looks totally bored, the cinematography looks really amateur and cheap, and the special effects are worst than the ones found on amateur Star Trek fan films. Worst of all the story is bland and it looks like it was written by some teen fed on a bad diet of unimaginative comics and boring videogames. The movie locations also don't help and all seems like a useless z movie because in some ways it does not even reach the status of a b movie. I was bored beyond words with this one, couldn't wait for it to be over and simply don't get how this was even made and more baffled to see Bruce Willis in this. Its not even one of those so bad it become great. It simply is not a fun movie at all and one star is the best I can give. One of the most boring, predictable and pointless space adventures I ever saw. And I'm 51, I've seen things ..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "The-Sarkologist",
        "review_rating": "1",
        "review_title": "Really Not Worth the Effort",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lusciousmuffins",
        "review_rating": "1",
        "review_title": "So much cringe",
        "review_detailed_main": "Maybe they were bored and thought, \"Let's see how quickly we can slap a sci-fi movie together...\"?\n\nPainfully bad dialog, crappy set design, dumb costumes, and a storyline that was borderline incoherent, not to mention completely unoriginal.\n\nThey had a few people in this who should have known better, so it's hard to understand how one of them did not step forward and stop this catastrophe. Bruce Willis in particular should be ashamed because you cannot tell me he could not afford to sit this one out.\n\nThe real nail in the coffin is that you can't even laugh at this film because it is humorless.\n\nIf they had gotten even one element of this movie right, I would tell you, but it truly is awful through and through. The big take away from this film for me was that it one you wish they could unmake."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "deangrande",
        "review_rating": "5",
        "review_title": "Wobbly camera",
        "review_detailed_main": "I understand the wobbly camera \"style\" used for action sequences, but why on earth deliberately wobble the camera in close up non action sequences! I could film it better. Makes me feel dizzy."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "takato0524",
        "review_rating": "1",
        "review_title": "Bruce why?",
        "review_detailed_main": "First I saw that movie you did, I think it's called breach? Where you're a space janitor and come under attack by aliens? Now this? If I hadn't been doing something else while this was on, I would've turned it off completely. This was so bad I don't have words. Actually, I do have words, for the actor that was the specialist officer/nephew. Your acting is terrible. Quit. I looked up other things you've been in. Acting isn't your calling!\n\nAlso, normally I complain there aren't any black people in the movie, or only one. But even tho there isn't a single non white person in this movie, I'm glad for once. This was so bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gilcatt",
        "review_rating": "10",
        "review_title": "Hilariously abysmal",
        "review_detailed_main": "Giving a ten for Best Bad Reviews Of The Year. I had to watch it.\n\nI suspect this movie was meant as a comedy. I laughed till the end in disbelief.\n\nThe script is non-descript, on a par with the dialogues. Insanely poor. Random editing spices it up. A special mention goes to Mega Boobs In Armor With Yellow Braids, but overall the promise falls flat.\n\nMy guess is that the little girl popping out of nowhere is actually the illegitimate child Bruce had with the Queen of the aliens, which he meets in a cave, where they both get high. Refusing to pay alimony he decides to nuke 'em all for good measure, in typical BW fashion.\n\nI hope there will be a prequel."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "skyloche",
        "review_rating": "6",
        "review_title": "Its not that bad.",
        "review_detailed_main": "Looks like people are just trolling or someone some people are just trying to bomb the movie. Give it a go. You'll see one it starts its not as bad a they're all saying."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "whistler69",
        "review_rating": "1",
        "review_title": "Bruce Willis is morphing into Nick Cage",
        "review_detailed_main": "Bruce Cage the new super star of the bargain bin.\n\nThis movie is the sort of movie that comes stuck to the inside of a free newspaper."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "larskim_andersen",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "That movie sucks, dont see it. My eyes is still bleeding."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "torimele",
        "review_rating": "2",
        "review_title": "Wtf",
        "review_detailed_main": "Bruce is barely in this movie.. don't blame it on him. I'm not sure if the director is terrible, or the writers here, or both.. probably both. I wouldn't suggest watching this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dmitrykouchnir",
        "review_rating": "1",
        "review_title": "Very Very Very Bad",
        "review_detailed_main": "I don't know what was worse, the storyline or the horrible acting of the wannabe actors. I think I'd do a better job as a director or as any of the actors of this movie with ZERO experience. It is supposed to be a futuristic movie with a military campaign, but having been in the military myself, I'd probably throw everyone in the brig for insubordination."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "iwfcyb",
        "review_rating": "2",
        "review_title": "Bad. As in, bad bad.",
        "review_detailed_main": "Don't even know where to begin. Script, directing, story, logic, acting.... Just everything, bad. I don't know if Bruce Willis owed the director a favor so he agreed to this movie, but this has to be the worst movie I've seen in a long while. And that's coming from a sci fi and Bruce Willis fan.\n\nIt's worse than bad actually as most of it is painful to watch, and even makes me angry to see Bruce Willis being tied to this dumpster fire.\n\nAvoid at all costs"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "stuartgkirkpatrick",
        "review_rating": "1",
        "review_title": "Why? Please , why why why",
        "review_detailed_main": "The end credits are good, the font they used for the credits is ok, the rest of this movie, looks like 2 bored teenagers grabbed a few friends and filmed it during lockdown in a garage. Somehow they got Bruce to appear. I can only think, lockdown got to him, and he thought \"hell yeah, I can get out the house for a few hours\"\n\n0/10"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "helloamstelveen",
        "review_rating": "1",
        "review_title": "The cosmic sin is if you watch this movie",
        "review_detailed_main": "This movie is so bad, it is actually the worst movie I have watched recently and if there were no B. Willis, I would not have even thought of watching it. I could not belive Mr. Willis would be a part of such high school production. If I could give it a zero points I would. It is so predictable, boring, with useless action and fights. Never make another movie like that please.\n\nThe story has potential, special effects are subpar, you can see the suits they are wearing are made of flimsy plastic, the weapons in 25th century are guns with bullets, they use old keyboards and computers that emite weird songs, people drive on the highway in regular pick up trucks and motor bikes that are made in the 21st century and are well over 400 year old. The highlight of the sci-fi is a jubox from the 1960...Really what were they thinking. Start trek from the late 60 had better effects and better equipment than characters in this movie. I really do not know where were the people with imagination when they were writing the script? It is beyond bad. If you want to do yourself a good thing, go for a walk in the rain, go for a run, call your friends or go get your groceries, take out the garbage, vacuume the apartment. Those 88 minutes will be much better spent than by watching this \"masterpiece\". The cosmic sin is if you watch this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ormon-08947",
        "review_rating": "1",
        "review_title": "I can only assume this is some kind of tax write off",
        "review_detailed_main": "It's not even a nonsense plot. It's no plot at all. Terrible acting. Abysmal script. Special effects that look like they were done for a 1990s computer game. Sound mix all over the place so you can't hear half the dialogue (which is a blessing in this case). Music composed by someone who was watching a different movie. Costumes leftover from a Buzz Lightyear cosplay convention. Locations scouted from a 1980s episode of Doctor Who. I bet even the on set catering was dreadful. The only good thing about this movie is that it's fairly short."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "John-Horrorwitz",
        "review_rating": "10",
        "review_title": "Loved Cosmic Sin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "steve-77438",
        "review_rating": "7",
        "review_title": "Don't believe the hate - Good Scifi movie",
        "review_detailed_main": "Seems to be alot of hate for Bruce Willis - as this and last move 'Breach' had bad reviews.\n\nYet both i found good Scifi movies. Story, acting, and sets good to great.\n\nMaybe people expect something original in 2021? Or compare to Bruces older movies. Whatever grab the popcorn and enjoy!!\n\nReally i found this movie made my Friday night - And makes you think what if we're not alone and not friendly?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Ponsle",
        "review_rating": "1",
        "review_title": "The only sin here was making this movie!",
        "review_detailed_main": "Slow, boring, bad script, muddled blah blah, couldn't finish it, had to fast forward to the ending just to see what the point was but I wish I hadn't cause it was as bad as the first 40 minutes!\n\nDon't waste your life!\n\nSorry Bruce..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tateya-67453",
        "review_rating": "1",
        "review_title": "So awful I couldn't even finish it",
        "review_detailed_main": "I am a Sci-Fi buff, and this listed Bruce Willis in the credits. And I thought well there you have it sci-fi and Bruce Willis it's got to be at least watchable. I have to admit that I stopped watching the film 15 minutes before it was over. It was so bad, so poorly acted and poorly written, that I just couldn't punish myself anymore. Even for past lives the punishment is too severe to watch this movie. I recommend that everyone read the other reviews about how poorly done this movie is. They state it far more clearly than I. To say I was disappointed it's an understatement. It was horrific and like a train wreck or a car accident that you can't turn away from to see Bruce Willis in this. He looks like a deer caught in headlights, his eyes are shiny and there is no one home. It is heartbreaking that he has been used the last few films he was forced to do I'm sure. I feel badly for him being burdened with this drivel. Bruce Willis and certainly the. Audience deserve better. Avoid this movie and save yourself some heartbreak and torment."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "margus-929-408559",
        "review_rating": "1",
        "review_title": "How this movie happened?",
        "review_detailed_main": "There were so many people involved.\n\nHow any of them did not ask: \"This does not make any sense?\"\n\n(Had to register an account on IMDB to warn you.)"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "fatmanandbobbin",
        "review_rating": "1",
        "review_title": "Cosmic Trash",
        "review_detailed_main": "Avoid this movie at all costs. I've seen some pretty bad sci-fi movies, but this might be one of the worst. There are numerous plot holes in the story and it continues going downhill scene after scene. I love Bruce Willis, but this movie was pathetically bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pixelator99-205-998197",
        "review_rating": "3",
        "review_title": "Space Zombies",
        "review_detailed_main": "That says it all. So bad it's like watching a train wreck. Can't stop watching it. LOL."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "minaares",
        "review_rating": "1",
        "review_title": "Total Garbage",
        "review_detailed_main": "I really don't know what I just watched. So awful total garbage..couldn't finish watching it past 15 minutes of this crap. I will watch Sharknado over this garbage any day."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ericburch-93375",
        "review_rating": "1",
        "review_title": "What Just Happened?",
        "review_detailed_main": "Brandon Thomas Lee should never work as an actor again. Don't care who his parents are, dude is terrible. I am the guy that is known for watching any movie, no matter how bad it is. This was simply horrible. The writing was almost as bad. These stupid one liners that were supposed to be funny had an absolutely horrific delivery. Frank and Bruce had to habe been coerced into making this. Their kids were being held hostage or something."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tu-83256",
        "review_rating": "1",
        "review_title": "freakishly senseless film",
        "review_detailed_main": "What a waste of time to produce something like this or watch it... nuff said."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dgz-53600",
        "review_rating": "",
        "review_title": "Pass this clunker by",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "vayunth",
        "review_rating": "10",
        "review_title": "One of the best movies ever made",
        "review_detailed_main": "Please don't disrespect it by giving it a 1/10. It's close to -5 in story, editing, acting, but it's a 11 at heart. This is not a bad movie, per say. It's a masterpiece in how awful it is in every department. I don't know a studio can get such a cast, such a CGI crew and fail monumentally in making the film. The acting looks like a workshop rehearsal, although all the CG is top-notch stuff. Watch it if you had a bad day in office, had an argument with spouse, or if your favourite team lost in a sport to your least favourite team. This movie washes away all sorrow in how bad it is. A true idol of this generation. You'll find yourself asking if it's worth being showcased in a museum or give diarrhea to a swamp full of alligators. No one knows for sure. One thing is for certain: it's one of those generational movies that you'll take to your grave."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "daveerrn",
        "review_rating": "7",
        "review_title": "Better than the reviews",
        "review_detailed_main": "This film is.not quite an A, more like a B+, and worth aty least one watch. Nothing about this scifi is \"bad\", it is just never GREAT.\n\nBruce looks tired and bored, but perhaps that is his character. Within the first 20 minutes of the movie, I had him pegged as some kind of highly functional sociopath, then he seems just sad.\n\nEffects are just decent, acting is acceptable, storyline has empty spaces in it, the science is almost believable (most scifi's science is stupid), but it is worth a watch."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Nhumrod",
        "review_rating": "1",
        "review_title": "The lowest rating I've ever given (and I gave Barb Wire 3 stars!!!)",
        "review_detailed_main": "Fell asleep during the first twenty minutes the first two times I tried to watch it. Finally watched right through. The most entertaining thing about this movie is the IMDB and Rotten Tomatoes reviews! Avoid."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "melvis-36860",
        "review_rating": "1",
        "review_title": "Did Bruce Willis lose a bet or something?",
        "review_detailed_main": "This came on as a suggestion after a \"Movies That Made Us\" episode about \"Die Hard\". What a stark difference! This movie is terrible in every conceivable way."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "qdliusiwen",
        "review_rating": "1",
        "review_title": "I am an hour in and I hopped on here because I can't believe this is real",
        "review_detailed_main": "I am so lost. Who am I and what is this???\n\nI am very tolerable of \"bad movies\" because usually there is something to take away from. Costume, acting, dialogue, jokes, concept, action, storyline, a twist, suspension, soundtrack, vibe ... like literally anything can make me think \"oh sure, yeah it was alright\".\n\nThe clunking sound of their armour made me laugh. I am an hour in and I still believe this film is a prank."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Neptune165",
        "review_rating": "1",
        "review_title": "500 years in the future n STILL using modern firearms LMAO!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jimcrighton",
        "review_rating": "1",
        "review_title": "Come on!",
        "review_detailed_main": "How did this guy get any writing or directing gigs? More importantly why is he getting more? Why is Bruce Willis? Had more questions, but that is a better summary, I watched all of Breach, they owe 1 hrs 32 min, now add 37 more minutes because I am not investing anymore time into this sad duo. I thought no matter how brainless the plots at least Willis entertained, not anymore. Retire already if you don't want to work. You couldn't land Moonlighting if you got the shot and the youth somehow.\n\nAn insult to movie paying public!\n\nThe question asked at the end of writing the review is are there any spoilers, I will answer no, but it has spoiled my evening and any future hope of a GOOD Bruce Willis movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "inthemnpines",
        "review_rating": "1",
        "review_title": "Drinking game!",
        "review_detailed_main": "The only way you'll half way enjoy this movie....... 1. Take a drink every time someone says fu#k.\n\n2. Take two for every time someone just has one word to say!\n\nYou're welcome and I'm now completely drunk!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "hmw-25522",
        "review_rating": "2",
        "review_title": "Boring",
        "review_detailed_main": "Rather sad I know but I usually like Bruce Willis films, not this one however, I found it boring and it didn't hold my attention."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "piggulu",
        "review_rating": "1",
        "review_title": "Definitely a sin of cosmic proportions",
        "review_detailed_main": "There's already plenty of reviews to let you know this is the greatest disaster mankind has faced on this world. This is Covid, Ragnarok, and the Sun going supernova all rolled into an aluminum foil-wrapped hot pocket in a microwave. How this ever made it from script to production is a question to which the answer, if there even is one, I can assume is safely tucked inside Pandora's Box, never to be known lest it lead to more abominations like this being made on the regular.\n\nCompletely bland and boring, from the dialogue to the set pieces. Scenes just come and go, offering no substance other than merely padding the time. Anyone giving this high marks because it's \"hilariously bad\" is doing a disservice by inflating the overall score (currently 2.5).\n\nThe only thing that could be considered slightly decent quality is some of the special effects work, which is still outclassed by most tv commercials. Everything else will leave you wishing you could go back in time and stop Bruce from destroying that asteroid so the world wouldn't have to suffer this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "FrankCronin",
        "review_rating": "10",
        "review_title": "Loved it",
        "review_detailed_main": "Thoroughly enjoyed it. Always love me some Bruce Willis. Legend."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pittkerry",
        "review_rating": "6",
        "review_title": "Why do we think everything has a message",
        "review_detailed_main": "I have seen far worse movies with higher ratings. Bruce Willis played exactly the part they wanted and he may have had to fulfill a contract so he made this. If it wasanyone but Willis, it would have a higher score but the prejudice here is obvious. Is it a good movie? No it isn't, but it is not that bad. I think it will do better on Netflix than anywhere else and I like Willis. Critics will take the opportunity to slam him and the movie, but critics mean very little to action movie watchers."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "klm-61119",
        "review_rating": "1",
        "review_title": "Why isn't there a zero rating?",
        "review_detailed_main": "Ooh how the mighty have fallen, Bruce has done great acting in some amazing movies so why did he sign up for this complete flop? Was he just board or broke? The script is almost to Saturday morning cartoons standards. The dialog is so week a grade schooler must of written it. As for the acting,,,,my grand kids can do better.\n\nI really can't understand if this movie was intended to be a comedy or were they purposely going for the razz award?\n\nThis definitely goes in my top 10 worst movies ever made."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bntqzdmbhn",
        "review_rating": "1",
        "review_title": "If I could give zero stars......",
        "review_detailed_main": "I'm happy to watch quite bad films but never seen anything as utterly awful as this. If you read this before watching, take head and watch something else, anything else! Really. I'm not kidding."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "liarichard",
        "review_rating": "1",
        "review_title": "The worst Tim ever",
        "review_detailed_main": "What is Bruce Willis broke to do such bad film ,the worst ever 👎"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ranger_jim-40984",
        "review_rating": "3",
        "review_title": "Hour and a half of my life lost",
        "review_detailed_main": "I love lt SCI FI and though skeptical I figured a Bruce Willis movie can't be that bad. Boy was I wrong. This was one horrible piece of trash movie. Complete waist of time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "vhyzrfy",
        "review_rating": "1",
        "review_title": "Don't Even Watch For Laughs",
        "review_detailed_main": "It's horrible. Worst. Movie. Ever! Worst movie I have seen in ages. The script sucks. The acting sucks. The effects... yeah, they suck too. Whoever wrote and directed this movie probably won't be making movies for much longer, so that's cool."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "SameirAli",
        "review_rating": "3",
        "review_title": "What is this movie about?",
        "review_detailed_main": "A very amateur and boring movie. No idea why stars like Bruce Willis agree to be in these kind of films? Too much of colors makes it irritating and impossible to watch."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pauly506",
        "review_rating": "1",
        "review_title": "Makes no sense what so ever 😕",
        "review_detailed_main": "Has absolutely no substance to it the story doesn't go anywhere, It hasn't come from anywhere its just there to fill 1.29 hours."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "metin-akbil",
        "review_rating": "3",
        "review_title": "Worst sci-fi movie in the past decade",
        "review_detailed_main": "Clearly the writers and producers didn't put much thought into this movie. 500+ years in the future and people are wearing the same clothes and drive the same cars that I do. Seems that the tobacco companies are still selling cigarettes and the decontamination process they use wouldn't even stop covid-19 and there are probably better guns available today than are used in the movie. After the first 20 minutes it was obvious watching this movie would be a waste of time but I persevered :-) 3 stars for the effort."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lbecht",
        "review_rating": "10",
        "review_title": "pretty good",
        "review_detailed_main": "I dont know why so much hate. Its a good movie. Guessing to many people because they saw bruise but just don't like syfi movies which they would give it a negative rating.... Wasn't cheap feeling like a lot of syfi movies out there. Good actors. Good story line. Keep up the good work! Thanks bruise for being in another syfi movie. Element was one of my favorite movies you made :)"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Bip_Boperino",
        "review_rating": "6",
        "review_title": "Is it my imagination???",
        "review_detailed_main": "Or are 90% of the reviewers solely here to trash Bruce Willis?\n\nIt's not that bad. Nor is Bruce Willis."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "wantoncravings",
        "review_rating": "1",
        "review_title": "Film making gone wrong",
        "review_detailed_main": "This movie opens with a 2 people showcasing bad acting, it proceeds to a plot device to engage Bruce Willis. Then adds more people to showcase their terrible acting. A First Contact containment facility that is worse than the capitol building security during 6th Jan 2021. The first 20 minutes make it unbearable for even a person bored to death in a pandemic lockdown to watch."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kwc-22132",
        "review_rating": "1",
        "review_title": "Toe Jam Bum Fart",
        "review_detailed_main": "Terrible. Awful Awful dialogue. I've heard grotty old man farts that sounded better then most lines this movie vomited out. I will always love Brucey, but Cmon, are his bills that bad?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "hateredblast",
        "review_rating": "1",
        "review_title": "Unwatchable non-story",
        "review_detailed_main": "PLOT: The plot was as hastily shown as it was written. No depth, no message, just a sloppily pieced together non-story. 100% predictable. Mediocre. As if the director was just rushing to tell and go home to sleep it off. No effort to make a compelling story.\n\nPROPS: Power-ranger class \"villains\" with some sort of rubber-plastic \"armor\" that looks 100% pointless and silly. Ive seen better costumes in that D&D movie with the purple moron evil magician. The planetary defense cannon looked like a 60s carnival ride.\n\nDIRECTION: The director lacks a basic understanding of how physics works in space or low-gravity. Heck, he doesn't even grasp earth gravity.\n\nPLOTHOLES: Beyond count...\n\nBruce, what the hell are you thinking? That some sort of a sad attempt for one last big job before retirement? That was SAD! That movie made me feel SAD and ANGRY! That was horrible! Awful! You should feel ashamed!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "alexmarr72-650-970540",
        "review_rating": "1",
        "review_title": "Dumpster fire 🔥",
        "review_detailed_main": "I never ever stop to leave a review. This movie was so bad I honestly had to make a review. It shouldn't be cosmic sin but cosmic $@#t. If he made $20 bucks in this movie Bruce was overpaid. I cannot get over how bad this movie is. I swear it was made on one set with some awful CG. I couldn't go negative stars for rating or I would have. Attack of the killer tomatoes was better than this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "daniel_hennig",
        "review_rating": "1",
        "review_title": "Worst film ever! ...DUMP!",
        "review_detailed_main": "I created an account just to write this review so I could warn people not to watch it. It is the worst film I've ever seen (well I got about 45mins in then switched off!).\n\nThe acting is lame, but it's more the plot and directing, it's just an absolute mess. It's like 5 directors that have never directed before and no nothing about directing were brought in as the previous kept dying through the making, then the new director didn't bother finding out what the film was about and where they were up to, and just did their own thing...then died!\n\nAnd the writers were a bunch of school kids, and nit even clever ones, stupid kids that were bottom of the class.\n\nThe only positive is that I ended the film early so I could go to the toilet and have a dump which I desperately needed, and that's what the film was...DUMP!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bounajdk",
        "review_rating": "1",
        "review_title": "Made my day worse",
        "review_detailed_main": "I had a long day at work and decided to watch a movie and rest a bit, it made me feel worse. Pure trash.\n\nI mean I'm not a picky person but oh.my lord this is the worst thing I've seen in my life.\n\nWatching it was even worse than torture it was soo bad i wish I worked extra just so I don't watch it. Skieodpdldjdospsjnekejdksodujdleiejndlaos."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "raejhealey",
        "review_rating": "2",
        "review_title": "Disappointing",
        "review_detailed_main": "I was excited by the premise of this movie and extremely disappointed by the execution. Seemed disjointed, context was lacking, script was so odd at times..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "deanjcooper",
        "review_rating": "2",
        "review_title": "Brandon Thomas Lee stick to The Hills",
        "review_detailed_main": "Wow his acting is as good as his Pamela Anderson Lee on Baywatch. Avoid this film."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "yuankun99",
        "review_rating": "10",
        "review_title": "Amazing movie",
        "review_detailed_main": "I'm just here to say that this movie is amazing. Great actors and acting from everyone on this movie. Brilliant story and excellent visual effects and action scenes combined with funny and also sad moments. Its worth watching."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bchminer",
        "review_rating": "6",
        "review_title": "First half was alright, then second half went nowhere",
        "review_detailed_main": "The first half was watchable, but the second half just really anti-climatic and boring."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "magaffiraf",
        "review_rating": "2",
        "review_title": "What in the actual #@$%",
        "review_detailed_main": "How is there a legend (Willis) and a upcoming star that's on fire (Grillo)... I feel like this should have starrred Nicholas cage And Andrew Garfield... The acting is sub par only to be out done by the science jargon they are obviously making up... This movie belongs on scifi channel in the nineties."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "laakso-22345",
        "review_rating": "2",
        "review_title": "A movie out of greed",
        "review_detailed_main": "It´s horrible to see how Bruce was used as a commodity. Everyone involved in this movie must have noticed hos bad Bruce was doing. I had to watch this one. We have all known for the past year how ill Bruce Willis was in the last movies... And even if this one is from the early stages of the illness, you can see that he is not the same, and that off course affects the whole movie. One expects a story that evolves around Willis, but the whole script is adapted and twisted... So the story flies all over the place, and the insane mish-mash of present and far away future features is not doing it any favours. As a movie, I guess its good for a hang-over morning... Press play, and fall asleep once in a while, and watch with half an eye. Thats how much you should invest in this one, because they clearly did not invest enough to make this script coherent and manageable...\n\nBruce Willis career, and him as a person, deserved a better destiny than this... To be used as a commodity and forced into to movies, where he wore an earpiece just to be able to deliver the lines. The people around him saw him as a cash-cow and used him without regret. I wont remember Willis for this, but I will remember him for the Die Hard´s and The sixth sence."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Freakinoldguy",
        "review_rating": "1",
        "review_title": "WTF",
        "review_detailed_main": "What's wrong with the streaming services paying money to create crap like this. For the money they spent on this dog they could have brought us another season of Marco Polo or Altered Carbon both light years better than this piece of crap.\n\nAfter watching Frank Grillo in numerous low budget dogs and he kept it together but, this one went off the rails from the moment the opening credits started. I'm sorry for the actors in this because it's quite apparent that some of them were hired for their names and not their acting ability. Bruce Willis being one.\n\nI think this should be mandatory viewing for anyone who thinks that making a good sci fi just requires the same tired old concepts and a few big name actors. Because this gong show is proof that you can't make a silk purse out of a sows ear."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "joseph-martinez831",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "The acting was terrible the story was even worse. With actors like Frank grillo and Bruce Willis behind this I had hope but 20 minutes in I was already done I had to force myself to finish the rest."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "BenW1999",
        "review_rating": "4",
        "review_title": "Not good, but better than my low expectations",
        "review_detailed_main": "You see a newer Willis film, you expect it to be terrible. He didn't really act at all in this film, he was just kind of there, repeating his spoon-fed lines. Frank Grillo is hardly even in the film, he has about 4 scenes.\n\nThe supporting cast is terrible and forgettable, and the aliens/villains are just crap, and are very clearly just people in a robe with a hidden face.\n\nWhat I will say is, the CGI is surprisingly actually decent. Biggest surprise from this C movie.\n\nThe plot is simplistic, but the ending is terrible and rushed."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "etnz",
        "review_rating": "1",
        "review_title": "1 star is too high",
        "review_detailed_main": "Wow I cannot begin to imagine how Bruce lost a bet this big!!!!\n\nWorst film ever!\n\nNo story.\n\nNo acting.\n\nNo score."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "prowlergbg",
        "review_rating": "1",
        "review_title": "90 minutes of my life I'll never get back.",
        "review_detailed_main": "I have, sadly, seen Paris Hilton act. I'm sad to say, that was better than any acting in this movie. Even a well versed actor like Bruce Willis have no chance of saving this pile of dung. A plot thinner than paper, a script that a kindergartner could have came up with and acting that is on the very bottom of the scale. At least the effects looked nice."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jbernert",
        "review_rating": "1",
        "review_title": "Why",
        "review_detailed_main": "Why was this made, I have no idea what was going on the entire movie. I tried to like it but holy hell this movie came with a shovel. Every time I thought something couldn't get worse, this movie somehow kept getting under a bar that I thought couldn't get lower.\n\nThere is nothing to gain from watching this... \"Movie\" aside from intense feelings of disappointment and maybe a little anger."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "voussoir-79654",
        "review_rating": "10",
        "review_title": "Great collage of \"terran\" in-between-missions cinematics!",
        "review_detailed_main": "It deeply made me want to replay StarCraft 2.\n\nBruce Willis NAIIIIIILS his Jim Raynor impression.\n\nWhat I most enjoyed is the fact that story has nothing new to offer. That way, I don't have to use my brain to watch the movie. That saved me a lot of headaches, trying to figure stuff out, and keep track of any kind of story.\n\nThe little girl with sunglasses needs to learn to act, though!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "heno-45762",
        "review_rating": "6",
        "review_title": "It's okay",
        "review_detailed_main": "Yes it's B grade but I only watched this film due to the bad reviews, to see how stupid it is.It's actually not that bad. Starts off actually pretty good and yeah there are some stupid things (Like in the future and drive the same cars).Also the acting is a little off.The special effects are not the best, but what do you expect.(Its low budget)."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "worldbender",
        "review_rating": "1",
        "review_title": "Terrible.",
        "review_detailed_main": "Bad writing, bad directing, bad acting. Most of the budget was probably spent on Bruce Willis! No flow to the story and was cringe worthy. Don't bother."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "irunthisworldwide",
        "review_rating": "1",
        "review_title": "This is why tigers occasionally eat their young",
        "review_detailed_main": "Somebody lost a bet, somebody owed someone money, Bruce Willis confused his incredibly lucky career with actual smarts, a toilet flushes and you have Cosmic Sin. Being associated with this film should be a career ending injury. 12 Monkeys and the 5th Element never happened now."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "brian-01436",
        "review_rating": "1",
        "review_title": "What....?",
        "review_detailed_main": "Did they just take lines from other scripts and put them together?\n\nI worked as assistant propmaster on The100 for 4 years. If I were to use camera tape to fix or build a space suit, I would at least clean up the edges.\n\nIt's really bad. And hard to watch."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mofobuss",
        "review_rating": "1",
        "review_title": "I might bave paid attention for 10 minutes",
        "review_detailed_main": "What the hell was that? I just played on my phone the whole time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "terrain-01075",
        "review_rating": "1",
        "review_title": "Spectacular...ly bad",
        "review_detailed_main": "Hopefully I can save some people some time here. Don't bother. Completely disjointed, terribly scripted and there are multiple scenes that go on and on, when they should have been left on the cutting room floor. Feels like Bruce Willis got roped into this as a favor for someone.\n\nTerrible movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "terrydgale",
        "review_rating": "1",
        "review_title": "Save your time watch something else.",
        "review_detailed_main": "I wanted this to even be B movie good... So many plot holes and just horrible dialog. I watched it yo the end but I wish I could have my time back."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rodbone123",
        "review_rating": "2",
        "review_title": "Clichéd and clunky",
        "review_detailed_main": "I turned this movie on with some expectations -Bruce Willis and Frank Grillo, right? Shouldn't be too bad? Unfortunately, ten minutes in and I was already discovering how wrong I was. Some B and C grade actors have been thrown in the mix, I guess the movie makers decided to throw a few unknowns in because they had to fork out a fortune to get Willis and Grillo- but the acting talent definitely ends with the big guys, and so did the budget. This claptrap recycles old Independence Day troupes and doesn't even do a good job of it. Bruce Willis is the same character he plays in every movie- world weary, hard-done-by, ex expert at everything you can name, reluctantly dragged into a catastrophe so he can rescue everyone. You've seen it all before a thousand times."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pemigewasset68",
        "review_rating": "1",
        "review_title": "Dumpster diving with Bruce Willis",
        "review_detailed_main": "Remember the 2000 frames of film Bruce Willis appeared in in the planet terror segment of grind house? Better to watch that 125 feet of film over & over... & over, than to let precious seconds of your life slip away one heartbeat and eyeblink at a time watching this dumpster fire on a train wreck.\n\nI keep telling myself this isn't actually Bruce Willis, this is early prototype deep fake tech. Or somebody near and dear to Bruce was kidnapped and held in a cage over a pool of sharks with a candle burning through the rope to force him to participate.\n\nI can't imagine anybody watching this on purpose twice."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pinko6807",
        "review_rating": "10",
        "review_title": "Boomers fear change",
        "review_detailed_main": "All you boomers hating on Bruce Willis for enjoying what he does need to get over it. The movie was actually really good."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "meggz-97608",
        "review_rating": "7",
        "review_title": "Love Outer Space!",
        "review_detailed_main": "I was focused the whole movie & enjoy hyperthetical scenarios that could develop in our earth's future.\n\nSounds grim though for our future generations, but who knows what's coming.\n\nI noticed a few problems within the development of certain parts of this production....and now I guess I know why.\n\nSorry Mr Willis, I always enjoy your presence in everything you make....but Cosmic Sin's higher point would have to go to Perrey Reeve's character & her incredible voice transformation.\n\nThe musical score by Scott is also amazing!\n\nGood luck & hugs Bruce....x."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cubanpetes",
        "review_rating": "1",
        "review_title": "Ummmmm",
        "review_detailed_main": "So we're rooting for colonisers in this one and not the freedom fighting aliens?\n\nWeird flex."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dad-07177",
        "review_rating": "1",
        "review_title": "Couldn't make it",
        "review_detailed_main": "Every cliche in the book. I think this was written by a 10 year old whose dad is a movie producer that gave him something to do to keep him out of his hair. After watching Kingdom with Frank Grillo as the lead and excellent in the role, I was intrigued. I guess he and Bruce Willis either lost a bet or came up short on child support and needed quick money. Count how many times you hear quantum or tachyon. You might make if further than I did."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nimmy-64086",
        "review_rating": "1",
        "review_title": "What on Earth!!",
        "review_detailed_main": "No comment really, except to say these big names will sell their soul to the devil for a few quid!! The only reason I watched it was because the reviews were so bad that I had to check it for myself! Well, you lot were on the ball with your comments. Hollywood has desperately lost the plot AND it shows big-time with some of the crap that comes out of La La Land nowadays!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ds0037",
        "review_rating": "1",
        "review_title": "1h 28min too long",
        "review_detailed_main": "Wow, the movie is so stupid, that it does not warrant longer review."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "grkngurkan",
        "review_rating": "1",
        "review_title": "Disappointed in Bruce Willis",
        "review_detailed_main": "Production, acting, the \"aliens\", and the plot...pretty much overall was super lame. I'm disappointed in Bruce Willis for being in such a low quality movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "qrjk",
        "review_rating": "1",
        "review_title": "Absolutely terrible.",
        "review_detailed_main": "The only good thing about this movie is that lots of people would have been paid to make it, and the wealthy studio execs who made it lost money. Godawful."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "FeastMode",
        "review_rating": "2",
        "review_title": "Why wasn't this a big budget movie?",
        "review_detailed_main": "I feel like 2 stars is generous because this movie is really bad. Low quality on every level. But I'm a self-proclaimed sci-fi junkie and I enjoyed all of the sci-fi elements and concepts. Everything else is laughable.\n\nThis is the kind of premise that will always get me to watch a movie. I just don't understand why it didn't attract a studio that could have turned this into a big budget blockbuster. In the right hands it could have been an awesome sci-fi action flick, something along the lines of Edge of Tomorrow. But instead we get this direct-to-video garbage. (1 viewing, 1/21/2022)"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "aguynameddrew",
        "review_rating": "1",
        "review_title": "So Bad",
        "review_detailed_main": "It feels like some low budget fan film that is so bad the other fan films don't want anything to do with it.\n\nPlot sucks, directing sucks, writing really really sucks, acting really really really sucks.\n\nWhy Bruce Willis would want to be involved in this pile of poop is beyond me. I'm guessing he lost a bet or was heavily medicated at the time and had no clue what all the cameras around him were for."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pux420",
        "review_rating": "10",
        "review_title": "Best movie of 2021",
        "review_detailed_main": "Bruce Willis is on point! i hope he got payed a bundle for this one because he is worth every penny! didn't phone this one in at all! amazing complex story with believable and well rounded characters"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "derek-a-charette100",
        "review_rating": "6",
        "review_title": "Expect improved ratings in the years to come...",
        "review_detailed_main": "When it comes to this genre (Sci-Fi / Action / Alien Invasion) of movies, the film industry has been spewing out cookie-cutter, worn out garbage for nearly two decades, feeding us one lame cookie-cutter superhero remake after another after another.\n\nThose of us who love this genre of movies have been begging for new movies that surprise us and capture our attention. We want movies that require real thought to understand and use our imagination. The issue is that many people had very high expectations for this movie, due to the casting of Bruce Willis as the main character.\n\nIn contrast, if the movie was cast of main characters that are not well known, people would have no real expectations for a top shelf movie, and would be impressed by the visuals and originality, and would have a rating in the 5.5 to 6.5 range.\n\nThat being said, here we have a movie that gives us what we have been asking for... but how did we respond? With hyper-critical disdain and complaints, and worst of all, a 2.5 rating. Come on now people.. Don't be so hard on this movie. Also, Willis has been in serious mental decline since this movie was made, and he is now in a serious condition, and he is nearing the end of his life.\n\nCheers to Bruce Willis for all the amazing work he has done over the years. What a legend."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "john-lima-1",
        "review_rating": "1",
        "review_title": "Wow. Soooo bad",
        "review_detailed_main": "This is absolute garbage. There really is no need for more review. It's a film, there really are no redeeming qualities. Just garbage."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jayrod-90536",
        "review_rating": "1",
        "review_title": "Don't watch it",
        "review_detailed_main": "Everything. I mean EVERYTHING was bad. The effects were garbage, costumes were cheap, so many \"wtf is going on\" moments. Script was bad. This movie should not have been made."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "wyattwhite3",
        "review_rating": "2",
        "review_title": "It's bad",
        "review_detailed_main": "I've got a pretty high tolerance for schlock(I've seen all 7 Tremors movies, AND the Show. I'm a huge Resident Evil Film Franchise fan. I could go on.) and honestly even I had a hard time getting through this one. I expected Bruce Willis to be sleepwalking his way through, like most films he's done in the last decade, but I didn't expect Frank Grillo to be pulling the same stunt.\n\nThe younger less known set of actors try to put some flavor into it and the script seems to be trying for some sort of \"is war just\" point, but the nebulously defined zombie/fantasy/scifi aliens make any ''''''deep''''' quotes feel haphazard and pretentious.\n\nThe sets are basic, all of the action taking place on either A) a greenscreen, B) cement bunker or C) A rough greenscreen trying to approximate space. In still images, the sort of armor suits the characters wear look cool, however any time an actor moves, it's clear they're just plastic shells hastily velcro'd onto the actor in some sort of wetsuit.\n\nAll that would be entirely excusable if the actual plot, or characters, or world was engaging. It's not. It feels like a lesser Halo plot only with less nuance, less character, and unfortunately a very \"Kill them all\" attitude.\n\nSkip it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "alemoli-70486",
        "review_rating": "3",
        "review_title": "B Movie",
        "review_detailed_main": "I felt watching an 80's B Movie, in a parallel universe where Frank Grillo and Bruce Willis are becoming famous for this movie. Some parts seems taken from the fallout game instead of 500 years in future are 20 years in the past like the bar tender robot. And 500 years in the future there shouldn´t be bold people....come on quantum bombs and nothing to grow the hair !!! 1 point for the main actors 1 point for the story play 1 point because I like space operas"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "FishBibble",
        "review_rating": "1",
        "review_title": "Ok, it is not that we have one bad movie, but 3 or 4... what is going on here?",
        "review_detailed_main": "Please tell me how Edward Drake gets someone like Bruce Willis for not one incredible bad movie, not two incredible bad movies, but 3, and counting..\n\nBreach, Cosmic Sin, Apex, and likely more we don't know about. Someone has money to play with, and Bruce is taking it gladly no matter the hit to his reputation at this point I guess... three incredible bad sci-fi movies. No doubt the cg is decent, but the story and directing is so awful, that you have to think there is more to this picture then meets the eye..\n\nWhat is the thing that is missing from this picture, how much did Bruce make on this little deal...\n\n..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lubike-73375",
        "review_rating": "1",
        "review_title": "C'mon, this was probably the worst 20 minutes of absolute chaos...",
        "review_detailed_main": "I'm usually giving a chance to any movie, but this was just an utter mess, and till now wondering, why Bruce Willis or Frank Grillo, think themselves, yes, this sound really cool, let's do this, but after a flying through asteroids, battle ships, explosions in space just in space suits, I just switch it off. So many things going on in those 20 minutes that you don't really know, what or why, proper mess, so don't bother"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ridsey",
        "review_rating": "1",
        "review_title": "Even some household names couldn't make this good",
        "review_detailed_main": "Some great actors in this aka Bruce Willis & Frank Grillo but oh my this film is terrible. I'm actually surprised they even agreed to be in this to be honest. Very disappointing"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "indesec",
        "review_rating": "1",
        "review_title": "They're just using him now, and he's letting it happen.",
        "review_detailed_main": "From when he was, a Hollywood star, to this. I remember a TV interviewer once saying to Michael Caine \"Your last movie was bad\" to which he replied \"Yes, but the house I bought with the money I was paid was wonderful\", I only hope your house is beautiful Bruce because you've certainly paid for it with your credibility.\n\nThis film and your last film are really bad, there has to be alternatives to this for you."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pablomrtp",
        "review_rating": "10",
        "review_title": "Cosmic delight",
        "review_detailed_main": "I haven't watch a movie so funny since the anchorman 2 this is the best experience in cinemas for a long time.... Wait sorry I was informed that this isn't a comedy ... Sh85."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "punkrawker-42672",
        "review_rating": "7",
        "review_title": "Sorely under-appeciated.",
        "review_detailed_main": "This movie isn't for everyone, clearly. A bit of a shame really, as it's a classic sci-fi adventure that revolves around exploring an interesting premise.\n\nThis movie, if turned into a short-fiction novel, would make for a fun Sunday read, even if a bit geeky in nature.\n\nWhere this movie loses some critics is that it is a low-budget film, with a big-name actor being the only surface-level attraction. If you accept it as a made-for-TV movie rather than a blockbuster, you may be more easily look past its limitations.\n\nThe premise of the movie is how should terrains, spacefaring humans, react to first contact with a suspected aggressive alien race. Some movies with such a premise play out the notion of humans being being dominated by the aliens and enslaved, which is what critics love to see. This movie takes an aggressive opposing stance, even more so than Ender's Game, and argues for swift action over weakness.\n\n\"I was late once and so he broke my nose. I was never late again.\"\n\nGeeky Easter eggs exist in the movie, such as the space battleships you see appear to be StarCraft Terran Battlecruisers. It helps to explain the universe without needing to say much at all; something critics would miss.\n\nLike most of Bruce Willis movies these days, they run counter to modern liberal norms. I'm giving this movie a 7/10, as there were some cheesy fight scenes and some of the props looked a bit silly. The story was a bit abrupt at times, which might cause issues for viewers that need things spelled out for them, but I didn't have that issue myself.\n\nOverall, I enjoyed watching it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Jim_Screechy",
        "review_rating": "2",
        "review_title": "Way worse than you think",
        "review_detailed_main": "Seriously! Terrible screenplay, unrealistic, stilted script, terrible direction... I could go on but its trust me, the whole thing is just appalling.\n\nThe good. Well, the actual performances from Willis, Grillo are pretty good. They've not phoned in their exploits here, but put some effort into good performances. However, in the grand scheme of things it makes little difference. Aside from the aforementioned, Lee, and maybe a couple others, the rest of the cast is really below par and suitably in line with the rest of the already poor production.\n\nThe only thing this film needs is Nick Cage in his current professional guise to finish it off.\n\nI assure you, 2/10 is a very fair score."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "burrmartinmedia",
        "review_rating": "1",
        "review_title": "This movie made me sad",
        "review_detailed_main": "This movie made me sad for several reasons. I feel Bruce Willis will never be the action hero he once was. I feel bad for my friends who have won major cosplay contests, not getting hired over the person who made the laughable armor. I feel bad I don't play Warhammer anymore because the writer clearly just rolled up some characters as enemies. And finally, I feel bad I can't get someone to give me a bunch of money to make movies because someone, somewhere gave this guy money to produce this awful, boring, sluggish movie. Here's hoping the 6th grader who made the SFX at least got paid."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "smittydog66",
        "review_rating": "1",
        "review_title": "Oh my god",
        "review_detailed_main": "I would rather drink my own urine then watch this movie again. My lord was this movie absolutely horrible. Please Bruce stop this ridiculousness."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "johljohns-88814",
        "review_rating": "1",
        "review_title": "Couldn't even finish this.",
        "review_detailed_main": "They didn't have the budget for space ships, so the characters fly through space in space suits... which are just shoulder pads and leg guards on top of street clothes??? Wasn't even laughably bad, just bad. Hope the actors got paid well, as they must need money."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rsob2005",
        "review_rating": "1",
        "review_title": "Goodness",
        "review_detailed_main": "Did Bruce have a stroke..?\n\nWow who signs off on this S H I T E ?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ergs-99736",
        "review_rating": "1",
        "review_title": "Second hand embarrassed",
        "review_detailed_main": "I honestly had no idea what was happening the entire film. Mediocre SciFi CGI which kept me interested. Bruce Willis was typical Bruce. But Frank Grillo. I love that guy. To see his talents reduced to this. The suits were cheap and poorly done. Im not costume artist but I could tell these suits were made foam board. It's like they spent all the budget on CGI and thought 90's props and actors would fill the gap."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jenniferlmontgomery",
        "review_rating": "1",
        "review_title": "Terrible in every way",
        "review_detailed_main": "One of the worst movies I have ever seen. Terrible story, acting, costumes, special effect, sound."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "seanhanton",
        "review_rating": "2",
        "review_title": "Hot Garbage",
        "review_detailed_main": "Bad acting, extreme cliches....just a hot mess. 500 years in the future and they still drive vehicles of today and use guns with bullets?? Over the top with machismo and hubris. Just a bad, bad movie. I gave it 2 stats instead of zero because of Bruce Willis and Lochlyn Munroe....two actors I've always liked."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "MoistMovies",
        "review_rating": "10",
        "review_title": "Bruce how now out caged ' The Cage'",
        "review_detailed_main": "While Nick Cage still puts out some decent films ontop of the dead pile of bodies he also stars in every year. It seems Bruce has taken it upon himself to tear down the cages, sit on a lot of chairs and take the lead from 'The Cage'.\n\nSoon I'll have to send my sister another novelty pillow case, the last was nick cage many years back. Now a new pillow case will rise up and ruin her artsy nice house."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "crazycabbie",
        "review_rating": "6",
        "review_title": "Made for Sci-fy",
        "review_detailed_main": "This STV video reminds me a lot of Battlefield Earth. Falling space suits like Star Trek and deep woods like ALONE.\n\nAliens take over human forms and try to invade earth.\n\n2542 people still driving Dodge Trucks and what not."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Xavier_Stone",
        "review_rating": "1",
        "review_title": "So bad it hurts",
        "review_detailed_main": "This movie has the budget of a high school drama production, and the writers are volunteers. So many errors from the year 2500 time line with nothing more advanced than a few cgi cut away scenes.\n\nThe acting and dialogue are impressively horrible. It's like they were trying to write a Razzie award winner, and they got it. Congrats. Bruce Willis and Frank Grillo should retire already, along with Mel Gibson. These actors have long since passed their prime and not just put out low effort tripe. They have to know how bad the movie is while filming."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sHoGo1981",
        "review_rating": "1",
        "review_title": "Sad in pants",
        "review_detailed_main": "Title says it all. This movie makes me sad in pants."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "martindennoy",
        "review_rating": "1",
        "review_title": "DON'T WATCH",
        "review_detailed_main": "This movie should be taken off the shelves, lowest budget futuristic attempt of a movie I have ever seen. Who goes to war with aliens in 2500 with regular bullets!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "stukerr-41566",
        "review_rating": "1",
        "review_title": "What the?",
        "review_detailed_main": "If it wasn't the horrible acting, the horrible costumes and poor CGI then this may have been okay but then the story was crap too!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tintis",
        "review_rating": "1",
        "review_title": "I ground my teeth for the entire movie, now I need dentures.",
        "review_detailed_main": "This movie was a grueling experience. Bad acting, bad dialog. I watched because of Bruce Willis, but his performance was underwhelming. He was there, just to bring in viewers and nothing else.\n\nFunny how it was supposed to be set in the year 2524, but yet on earth, modern era motorcycles and cars can be seen. Many scenes, it appears that actors were taken of the streets in their original closes, slapped on some plastic armor and started filming. At every turn, there was something noticeable, and made it very difficult to sit through."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "quentinlefranc",
        "review_rating": "1",
        "review_title": "The most intense sequence of errors and unconsistencies ever",
        "review_detailed_main": "One every 10 sec during 84 minutes. That's insane! Everything is wrong! The characters, the logic, the wrong order of events, the dialogues, the guns, the shaking camera, the disastrous military acting... The laser shooting noises in space as bad as they could be 70 years ago. The enemy planet -you can see in the trailer- is told to be 600k light years away from earth despite our galaxy being 100k light years in diameter."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dannyrobbins1986",
        "review_rating": "1",
        "review_title": "Is Bruce Willis broke???",
        "review_detailed_main": "Has Willis lost all his money??? Can't think of any other reason he would agree to be in such a poor film....\n\nDon't waste your time, story line is rubbish, acting is worse...."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kwenchow",
        "review_rating": "1",
        "review_title": "Another worst action film! Full of boring conversation, and annoying overuse scene! Avoid at all cost!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "blackoth",
        "review_rating": "10",
        "review_title": "Refreshingly different.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "metallisktispe595",
        "review_rating": "6",
        "review_title": "It's not Dune, but it's also not Starship Troopers, not awful cmon guys.",
        "review_detailed_main": "Alright I feel like the only reason so many folks gave this bad reviews is because they're super Sci-Fi fans and expected this to be some groundbreaking movie cause Bruce Willis is in it. Granted it caught my eye because of him and the plot but even the best actors can be in subpar movies. It's really not as bad as the 1-4 reviews are saying. It's a campy, shoot em up action Sci-Fi film. Nothing more nothing less. I enjoyed the little banter of it, the action scenes and the plot even more than I thought, no thanks to the reviews. If you like just regular, not over complicated Sci-Fi action movies it's worth a watch, especially if you just have a Netflix subscription anyway. I can't say I'd rewatch it ever but I enjoyed the one time watch for sure and it's not as horrible as some of the more jaded fans are making it out to be."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mjschiller-105-313340",
        "review_rating": "3",
        "review_title": "OMG, what are you thinking Bruce?",
        "review_detailed_main": "This was just awful, once upon a time when you saw Bruce Willis was in a movie you could be quite confident that it would be pretty good. Those days are gone, Bruce has decided to take any role at the cost of destroying his credibility as an actor.\n\nThis movie shouldn't have even been made, it was a low budget heap of dung, bad actors, low budget and poorly written, I almost burst out laughing a few times at how bad it was, give it and Bruce a miss."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jon-donnelly",
        "review_rating": "1",
        "review_title": "End this Movie before it starts.",
        "review_detailed_main": "And go do something, anything else. This movie is bad and Bruce Willis should feel bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "imizrahi2002",
        "review_rating": "1",
        "review_title": "I'm glad this is getting the rating it deserves..",
        "review_detailed_main": "It's hard to pick a place to begin on how bad this movie really is...I don't consider myself the type who just can't wait to trash a film... and I'm pretty sure you'll have to look for yourself, ANYways... It seems to be written by high school students...the dialogue... the discombobulated story, overall... The cliches... How do scripts like this get funded?\n\nPS... many others keep asking how Willis can participate in such trash...a) none of my business. Literally... B)ut... alimony and property taxes... tuition, cars, insurance, clothes for the kids... not sci-fi..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sin-poland",
        "review_rating": "1",
        "review_title": "This movie would be so much better without Bruce W...",
        "review_detailed_main": "... and it would still be absolutetly horrible. Bruce is totally irrelevant actor nowadays. This movie offers absolutetly NOTHING, and 10 out of 10 times I would rather go for a walk than watch this POS."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "The_Melancholic_Alcoholic",
        "review_rating": "1",
        "review_title": "Willis proves over and over that Drumpf lovers are nót hated in Hollywood because of their politics",
        "review_detailed_main": "The special effects are shoddy and cheap. They actually pull that trick of shooting a scifi/futuristic movie in a forest, because hey, forests in the future and in the past always stay the same: loads of trees standing up straight. But then, they also wanna convince us that after four or five centuries in the future, warehouses still look like they did in the 90s?\n\nGoo ole' Brucie, a self confessed Reich!!!Winger, who even openly admitted he voted for the chief Babies-in-Cages-Stuffer #DrinkBleachDonnie is on a losing streak of movies, but he goes even beyond the gutter that Charlie Sheen went.\n\nAnd no, it's not because of his politics. This is just a bad, lousy scripted movie, of which Frank Grillo should be ashamed of. The production values are so low, one thinks about Death Valley. Or the Mariana Trench.\n\nThis is what you get if an actor turns to the Dark Side and supports a teen-girl-groping inject-bleach-adviser like trump: puke worthy crap. It's sad, more than anything. Let's all recommend Samuel L. Jackson for being magnanimous.\n\n1 oth 10 The Melancholic Alcoholic."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "joiningjt",
        "review_rating": "1",
        "review_title": "It's official Bruce Willis is DONE!! the 1 trick pony done out lived his welcome, now GO AWAY!!!!!",
        "review_detailed_main": "This is the perfect example of how it's the DIRECTOR that's makes the difference, bruce Willis CANT act never could he was lucky and worked on movies with great directors and great scripts. Now that hes been trying to live off his name and reputation he gets garbage roles like this that fit his garbage talent!! Every great movie hes been in could have had any actor in that role even nick cage!!! Bruce do the world and yourself a favor. .. GO AWAY!!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ksmcwr",
        "review_rating": "1",
        "review_title": "5 minutes including opening credits",
        "review_detailed_main": "500+ years in the future: internal combustion engine cars, manual lock and load guns, today's clothing. This is when I decided to let this movie run its course, it without me."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "alinjoannahutapea",
        "review_rating": "2",
        "review_title": "Damn, this film is so Bad, that i want to puke",
        "review_detailed_main": "I skip and fast forwarded this film so many times, just to skip the bad acted of the actors. I dont understand, what the hell were the producers think to launch this film, no clear storyline, bad acting, etc... and the worst thing is, bruce took this movie, what a shame. Maybe he was so desperated and has no money, so he acted in this total sh**t film.. Damn."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lazar-vukosavljevic11",
        "review_rating": "9",
        "review_title": "This film is awesome!",
        "review_detailed_main": "I stand by it, this film is asside a few scenes that felt awkward a bit, pure gold. It will be another classic along Space troopers in the genre."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "hayden-andrews",
        "review_rating": "2",
        "review_title": "DO NOT WATCH",
        "review_detailed_main": "This movie makes battlefield earth look inspired and artful.\n\nYea I said it..\n\nThis has no originality at all.\n\nthe acting sucks. the scriping/writing sucks plot is BAD production/effects/props are all horrible. music and sound is forgettable\n\nI dont know why the robot in the bar was so well done for 10s of screen time but yea..\n\nhad high hopes seeing this come up when I saw bruce and frank ( coming off a great sci-fi movie right before this)\n\nbut sadly this is trash.\n\nGO WATCH Boss Level !! if you want sci-fi ( non space)"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Ferassun",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": "Don't waste your time on this trash ..I am a big fan of sci-fiction movies and i slept 4 times while watching this ..very bad acting..very bad story...very very bad scenario and very very very bad direction ..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mrkesu",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "If you want some good fantasy stories, check out some of the 10 star rating reviews here. They are all more inventive than the movie.\n\nHOW COULE ANYONE GIVE THIS 10/10????"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "0w0",
        "review_rating": "3",
        "review_title": "A terrible movie... Bruce should fire his agent",
        "review_detailed_main": "From the first 30seconds of the movie, I already knew this movie was going to be trash, but I didn't realize just HOW trash it was going to be. This is a 3rd-rate movie that hitched their ENTIRE wagon onto Bruce Willis' name... without him nobody would even have bothered streaming this movie, nevermind watching it at the theatres.\n\nThis movie HAS TO have had a budget below $15mil..... it would be an absolute travesty if they spent anything more than that on this terrible movie. And I'm sorry but if you're going to attempt to make a 'sci-fi space epic adventure film' on a budget of $15mil or less then you're just insane. 1 or 2mil probably went to Bruce and that left the rest of the movie with an already shoe-string budget. The CGI is bad. The editing is bad. The majority of the movie takes place in darkness, so they didn't have to spend money on set-pieces. There's an INSANE amount of vignetting, lens flare and vaseline-lens going on as well, which is a huge indicator of a terrible production. Easily 30% of the movie is show with vaseline on the lens, I'm certain of it.\n\nThere's SO MANY things that this movie COULD have done differently to make it seem like it had a bigger budget. Upgrade (2018) is a FANTASTIC example of how to make a sci-fi film with NO budget. I mean Upgrade (2018) had a $3mil budget which is absolutely insane, and if you watched that movie then you'd know that it certainly didn't seem like a shoe-string budgeted movie. Really the fault comes down on the bad director of this movie and just the whole production team as well (since the editing and framing of this movie is terrible too).\n\nThis movie has no real redeemable qualities and I'd HIGHLY recommend that you watch something else instead. This movie is literally a waste of time and the only one who probably benefitted from this experience is Bruce Willis since he can walk away with a cool couple million (although I respect him less as an actor because of this movie now)."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "wcorrigan67",
        "review_rating": "1",
        "review_title": "I watched this so you don't have to... where's my medal.",
        "review_detailed_main": "Oh dear... this is what happens when careers die. Bruce Willis what the hell man. I would rather pull my finger nails off than sit through this mess of a movie. Every actor in this thing did it for the money and nothing else. It's just s#*t plain and simple. Why can't we give 0 scores. I am sci fi fan and could not tell what this is about. It's that much of a mess. Seen better special effects in old Dr Who eps from the 70s. Avoid like the plague."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "snuggybearkids",
        "review_rating": "1",
        "review_title": "3 words... cringe, cringe, cringe...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Bajster",
        "review_rating": "1",
        "review_title": "Bad diplomacy!",
        "review_detailed_main": "Apparently we shouldn't let Bruce Willis make first contact!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pedja-the",
        "review_rating": "2",
        "review_title": "Making of this movie is a sin",
        "review_detailed_main": "The only good thing about this movie is a poster. What a waste of a good acting crew."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lorickignacio",
        "review_rating": "10",
        "review_title": "This is the best movie ever made of Rated R",
        "review_detailed_main": "Also Bruce Willis is an assistant movie that going to amazing since I like this movie. I going to watch it because I like Bruce Willis who makes good movies like Death Wish 2018, Die Hard, Die Hard Sequels except A Good Day to Die Hard. One of the best movies ever made of 2021 next to Raya and the Last Dragon, Silk Road, Chaos Walking, Tom and Jerry 2021, and more."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "fpublishing",
        "review_rating": "2",
        "review_title": "Bruce - why, oh why?",
        "review_detailed_main": "Terrible movie that fails on almost every level. Confused, rambling mess and poor production quality."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "aussieblob",
        "review_rating": "2",
        "review_title": "How old were the children that made this?",
        "review_detailed_main": "I'm sorry, I'm going to give this three seconds of my time as it's wasted 30 minutes of mine before I had to give up on it. All over the place. I know there is a plot. But everything about this movie is, why? why, why!? Why is Bruce Willis in it? Was it his child producing it?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jonathanrex-99974",
        "review_rating": "2",
        "review_title": "Never thought Bruce Willis could participate in a film this bad.",
        "review_detailed_main": "I'm a sci-fi movies fan, and usually I wasn't so cocky about acting. Just a decent one would do. Or a good story, or decent visual effect. But this movie, it has none. No good acting, no good story, no good special effect. Nothing. And \"no good\" here you can literally translate it to very bad.\n\nReally, never thought Bruce Willis could participate in a film this bad. Such a shame."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "andya36",
        "review_rating": "1",
        "review_title": "Rating it a 1 seems to much",
        "review_detailed_main": "Just terrible from start to finish the whole think is put together in a mess"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "isuspgr",
        "review_rating": "1",
        "review_title": "What an absolute joke! Don't bother",
        "review_detailed_main": "I get annoyed when I start to watch a movie and have that feeling I'm wasting my time. In the old days poor directors used darkness to add to the effects. These days it's moving the camera around incessantly to somehow add to the \"realness\". This alleged movie has garbage direction, has-been or no-named \"actors\" and a rubbish story. That's 45 minutes I'm not getting back! Glad I didn't pay for it; I'd be REALLY upset."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "locutas",
        "review_rating": "1",
        "review_title": "how did this garbage hit the big screen!!!",
        "review_detailed_main": "I cant believe there were ads for this pile of confusing oozing poop of a movie across social media, its so far below a B-Movie its astonishing it got funded ...every aspect of this movie is sub par...what the hell happened to Bruce Willis!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "davegfrancis",
        "review_rating": "1",
        "review_title": "Can only have been made for tax relief!",
        "review_detailed_main": "Wow, there are bad movies and then there are those that are abysmal. Incoherent and painfully tedious to watch, Cosmic Sin feels like a first edit of a student film in a rural high school. Not sure what leverage someone had on Bruce Willis and Frank Grillo, but the debt paid isn't worth it at all because this film should not be released and be buried by anyone associated with it. Cheap costumes and sets, hammy dialogue, poor and horrible support cast coupled with a story that is so painfully written and edited that even the z-grade effects and stunts can't save it as being one of those guilty pleasure bad movies. Avoid like the plague or at best watch it during Covid lockdown when you've exhausted all other media options. I'm genuinely hoping this was made purely to get some tax credit in Georgia because it is the worst I've seen for some time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "digdog-785-717538",
        "review_rating": "5",
        "review_title": "it's not *horrible*",
        "review_detailed_main": ".. i mean, it's no masterpiece, but as a popcorn scifi flick, it was decent. What were you expecting.\n\nBruce Willis is a (old looking) future-guy in power armor who shoots aliens, for the government. Lots of co-stars with badly divided screen time, tons of technobabble, mediocre \"modern\" photography, terribad camerawork, \"actually passable\" acting, not-bad-at-all dialogue, the real culprit here is the direction. Oh and the soundtrack is amateurish. The special effects were not terrible either. The power-armor suits were bad, the enemies are just makeup zombies, and the story isn't much, but Cosmic Sin doesn't deserve 2.5/10 - i've seen stuff MUCH worse than this with a far higher rating. And, no midichlorians.\n\nMy rating 6/10 - a vaguely-futuristic soldiers-on-mission B-movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "photoweborama",
        "review_rating": "8",
        "review_title": "Much better than expected",
        "review_detailed_main": "I liked the story line, effects were decent, but not gory without purpose. It was an enjoyable diversion for a bit."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "MiloSuperSpesh",
        "review_rating": "4",
        "review_title": "Awfull even for a b movie i'd rate as a d - film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "danceman-41776",
        "review_rating": "3",
        "review_title": "Whewwwww!",
        "review_detailed_main": "Just no...pure nonsense. I watched this based on the fact that bruce willis and frank grillo was in it. Ill never watch it again. The only way id recommend it is if you have absolutely nothing else to watch"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "electro_nix",
        "review_rating": "4",
        "review_title": "The idea wasn't bad but everything else was.",
        "review_detailed_main": "There should be quality control for movies so this kind of crap won't be allowed release to the public."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "victorxl",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": "A 7 year old couldn't digest this.. It feels like it was made by inexperienced college students on a dollar budget."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "hawkenvictoria",
        "review_rating": "5",
        "review_title": "So very confusing",
        "review_detailed_main": "This show has a few great actor's in it, so I was expecting something reasonable. It's very confusing and the story is disjointed.\n\nIt's boring, slow and really bad.\n\nI absolutely love Brice Wiillis and we are seriously thinking about turning it off 30 min in."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "brett-76260",
        "review_rating": "1",
        "review_title": "Cosmic Turd",
        "review_detailed_main": "Crikey Bruce what are you doing??? Why are you making complete turds like this??? This was painful to watch. It's worse than crapping out a knotted rope... flush."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "MarkAylwyn",
        "review_rating": "1",
        "review_title": "Aptly Named Cosmic Sin",
        "review_detailed_main": "Most definitely a sin to have produced this, and on a scale that's cosmic. I got to about minute 12. Enough said."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "faithless4734",
        "review_rating": "3",
        "review_title": "Theatrical Sin",
        "review_detailed_main": "It took less than 19 minutes to know this was a failure. While not a record it is still impressive. I saw Bruce Willis and SciFi theme and thought \"this should be good\". I was completely wrong."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "baeckw",
        "review_rating": "8",
        "review_title": "What's not to like ?",
        "review_detailed_main": "I was amazed to see this movie gross an average of 2.5 out of 10 from reviewers here, so I braced myself for watching it anyhow. OK, I was not entirely sober, but I enjoyed it greatly.\n\nWhy not ? So I liked the \"shoot first, ask questions later\" mantra that has guided so many action flicks before, so what ? I sat through the obligatory bar fight scene to build character, big deal. I enjoyed the ballistic firefights many centuries hence, while at the same time, species were lobbing black holes at each others, so sue me !\n\nIf you won't let me call it 'cult', then let me call it 'camp'. I fail to see why this movie should score so much lower than its peer \"Space Cowboys\" (2000) at 6.5 ..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "iansputnik",
        "review_rating": "1",
        "review_title": "When old actors prostitute their name for money",
        "review_detailed_main": "This looked like the sort of cheap children's programmes that used to be on at tea time. The camera work looked like it was filmed on a camcorder. Each line was a cliche stolen from other films. The plot, well there wasn't one. The so called aliens wore hooded uniforms and thus no money needed for fancy makeup. Bruce, what has become of your integrity? Did you get a tax bill and have to find money fast, so popped in to film this rubbish. I'm guessing it took about a day and a half to film the entire thing, so a quick buck for you. It was almost awful enough to be funny. Was this film made as a joke? Because just watched it and I don't get the punchline."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Otte1",
        "review_rating": "2",
        "review_title": "The bad reviews are true",
        "review_detailed_main": "I made it about 12 minutes into the film and just said no. There is nothing redeeming in this film. Direction is bad, acting is bad, dialogue is absolutely atrocious. This is an afternoon low budget SyFy film that raised enough money to put Frank Grillo and Bruce Willis in it, which i am pretty sure their scenes were added post production. Yes movie is that bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "anhaveit",
        "review_rating": "2",
        "review_title": "What a brain drain",
        "review_detailed_main": "The only way this cast will get to the Oscars will be to park every ones car for them .Properly bad avoid this one"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gianlucacani",
        "review_rating": "1",
        "review_title": "A sin is watching this.",
        "review_detailed_main": "Briefly, the prologue is the first indicator that the quality of the film is very low. Bruce Willis entrance is pathetic (why Bruce... Why?). Nothing makes really sense in this movie and I could not make it to the end. Sorry, nope, there is so much to watch out there that I am not giving any chance to products like this. Ridiculous."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Filmiarvustus",
        "review_rating": "4",
        "review_title": "The glory days of bad sci-fi movies are upon us.",
        "review_detailed_main": "\"Cosmic Sin\" is set 500 years in the future, where seven rogue soldiers launch a preemptive strike against a newly discovered alien civilization in the hopes of ending an interstellar war before it starts. This movie feels like nobody wanted to do this, but they were forced to do it. There is almost no story, and the low-budget effects have nothing else to add - so why even make this movie? Yes, it has Bruce Willis in it, but he seems to be lost between being high and dementia. Amazingly this film fails at everything, not just acting, sound, music, lighting, and directing, but even with something as basic as an idea - there just isn't any. This truly is a cosmic sin."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "scott-logan-197-874075",
        "review_rating": "2",
        "review_title": "Wow this thing is bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "tmlawrance",
        "review_rating": "1",
        "review_title": "So bad we stopped watching midway",
        "review_detailed_main": "Why is Bruce Willis in this appalling B grade movie?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cam21-660-801606",
        "review_rating": "1",
        "review_title": "Absolute garbage",
        "review_detailed_main": "I'm guessing the budget for this movie was spent on Willis' salary because everything else was obviously done without any money.\n\nDirecting, embarrassing. Acting, amateurish. Costumes, cheap. Design, basic. Music, nails on a blackboard. Script, woeful.\n\nThere was seriously nothing worthy in this crap."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dernestob",
        "review_rating": "1",
        "review_title": "Comedy Sci Fi.",
        "review_detailed_main": "No idea what I just watched. Decided to watch to the end to see if it gets better. It did not."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "leon-geyer",
        "review_rating": "2",
        "review_title": "Starts not good, gets worse.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "atjmj",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "Shame on you Netflix! Terrible! Bruce Willis should be ashamed of myself To need money that bad to make this crap!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "swes87",
        "review_rating": "1",
        "review_title": "Plot Holes Everywhere",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "donewood",
        "review_rating": "1",
        "review_title": "So Bad with no redeeming qualities.",
        "review_detailed_main": "I Thought this may have been written by a bored 12 year old, trying to entertain his 10 year old brother.\n\nSome times dreadful films have a certain charm. This is not one of those times."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "curiousgeorgiapeach",
        "review_rating": "1",
        "review_title": "LoFL. Oh how the mighty have fallen",
        "review_detailed_main": "Bruce, buddy, as a friend... I'm telling you to pull yourself together big guy. You're better than this, you see that don't you? You see that, right? Bruce? BRUUUCCEE!!\n\nOmg it's so bad though/10."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mayaro-25415",
        "review_rating": "1",
        "review_title": "There are a lot of bad movies, but this one...!!!",
        "review_detailed_main": "The word \"Bad\", doesn't even approach to reality when you describe this movie. If I challenge my 4 yrs old nephew and my 6 yrs old niece to write a Scifi script and make a movie using their neighbors as actors I can guarantee that they would make a better movie. This is so bad that there are no words to describe it. Bad acting(Bruce Willis acts like he has just been dragged out of his bed in the middle of the night) , annoying storyline and dialogs and unbelievably bad special effects (I think the 1966 release Star Trek had better special effects). This movie can't even be used as a parody. I wonder who allowed the release of this piece of garbage.??He should be eliminated from his position."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "heals-81619",
        "review_rating": "1",
        "review_title": "Just don't",
        "review_detailed_main": "I am only writing to warn others to avoid this. It's a mess. I just don't know where to start. Set 500 years away and the props seem to be left over from a low budget 80's sci fi tv show. Story line is messy. Characters don't gel and all over the place. Soldiers travel 13,000 light years into battle with a glock??? I could go on but I want to wipe this show from my memory ASAP and just get he message out - just don't."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "newenglishmutt",
        "review_rating": "1",
        "review_title": "Bad... just... bad...",
        "review_detailed_main": "Bad story, bad plot, poor special effects, bad acting, bad character design, cheap costume designs and materials. This movie was as bad as Titan. Worst movie of 2021. I can hardly believe I was able to finish it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "christineballone",
        "review_rating": "1",
        "review_title": "Ditto for everyone else's review",
        "review_detailed_main": "There is no point to add another review but here are my 5 cents worth! I didn't even watch the movie just forwarded it and that can give you a pretty good idea of what's going on! In a sci-fi film you expect action but from what I'm seeing there are little and few scenes with it! Mostly there are human interactions and conversations! My suspicions were confirmed after reading the reviews. So glad I didn't waste time on this!\n\nSorry Bruce Willis but you must really need the money but surrogate and vice both sci-fi flicks were superior to this!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "robbino-65274",
        "review_rating": "2",
        "review_title": "Imbarazzante 😳",
        "review_detailed_main": "For a movie like this one it's a loss of energy also type into another language!\n\nUnconnected dialogs, total absence of a general vision, full of bad words ( useless ), no \"glue\" between characters, film director not present ( or drunk) ?\n\nWe have to thank virus cinema are closes... TV is much more than enough for this movie!\n\nHei Bruce, what hell happened?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nhcrtkwt",
        "review_rating": "1",
        "review_title": "Confused",
        "review_detailed_main": "Terrible writing, terrible plot, terrible acting... just completely awful. Weird long shots on peoples faces. Irrelevant dialogue...how did this even get made into a movie??? I'm confused why I watched the whole thing. Kinda annoyed I paid 5.99 to rent it and wasted 90 mins of my life."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "forpassord",
        "review_rating": "3",
        "review_title": "Simply bad",
        "review_detailed_main": "Thought that this movie had a rating of 4.5. I was wrong: At the present, the rating is only 2.5.\n\nThought that this movie with among others Bruce Willis could not be so bad that it only deserved a rating of 4.5. I was wrong: The actual rating of 2.5 is closer to what it deserves!\n\nThought that since it could not be so bad bad that it only deserved a rating of 4.5, it would at least be worth seeing to spend some time. I was wrong...\n\nThe ONLY positive that I can write about this movie is that the visual effects were OK. They were not bad, they were not good, but at least they were OK.\n\nThe sound quality was OK, but music/sounds were at times badly chosen. For example, the sound on top of a fight scene towards the end was a harmonica playing...\n\nThe acting was between OK and bad. The most of the time it was bad. The manuscript and the directing was mostly really bad! Several scenes were more or less over after a few seconds without any build up before, or any follow up afterwards. Leaving the viewer with no explanation to neither why or how things happened!! Several scenes and lines during the movie was just cringeworthy!\n\nDo not make the same mistakes that I did: This movie IS as bad as the rating of 2.5 indicates that it is, and it is NOT worth the time watching it!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "2Pass_Time",
        "review_rating": "3",
        "review_title": "Sad Film 2 End With: Ho Hum",
        "review_detailed_main": "Will miss Bruce as he faces a terrible disease. Seriously great actor.\n\nThe movie is truly weak but, some moments r great. Mostly disjointed, lacking ANY interest. Why bother."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "decspv",
        "review_rating": "1",
        "review_title": "Cosmic impossible to watch",
        "review_detailed_main": "It is bad. It is really, really bad. I wonder, none of the production team could even bother saying a word of reason? It is so bad that 500 years in the future and all the context looks and sounds like some sort of 1990 idea. My gosh, what an awful movie! Even the aliens fight with axes and swords. Please, don't even waste your time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "comghallanthonymorgan",
        "review_rating": "1",
        "review_title": "1 is too high a score",
        "review_detailed_main": "For movies like this you should be allowed to give a negative score. The only use this movie had was that the production of it paid some peoples wages. Bruce Willis whats happening? Anti-life and now this. Elon Musk do us all a favour and put Bruce on the next test flight if he wants to be in space this much."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "toddxdavis",
        "review_rating": "2",
        "review_title": "Bruce, you owe me 90 minutes of my life back",
        "review_detailed_main": "Future? So we still have concrete block buildings, manual doors, dirty windows, pallets, crates, motorcycles, bad make-up, and . . what the heck, why should I take more time to review this.\n\nDo not watch it. Go observe the growth of a cactus and you will use your time better."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jamesaosborough",
        "review_rating": "1",
        "review_title": "Cinematic Sin",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "geraldconques",
        "review_rating": "1",
        "review_title": "Less than zero.",
        "review_detailed_main": "I gave it a one because it would not let me give a zero. Bruce Willis must really need the money."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jdpark-29254",
        "review_rating": "1",
        "review_title": "I have to delete my brain now",
        "review_detailed_main": "I have to erase this movie from my mind. I have to find some intergalactic cosmic gin. They should warn you to do that before you watch just five minutes of this psychological horror on film. Did Bruce Willis make a pact with the devil and now he has to pay the price by decimating his career? Or why does he hate himself so much?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "John_Wagenvoort",
        "review_rating": "1",
        "review_title": "Wow.",
        "review_detailed_main": "Sorry no spoilers, the cast and crew were responsible for that.\n\nThe year is 2524. We have cars. As in infernal combustion engine driven cars. We have guns. And...\n\nWe still have Bruce. This guy just doesn't know when to quit. What? Another part shot in a day?\n\nThis all just results in someone asking, Really...?\n\nBruce! Retire.......!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mohamadrezaawad",
        "review_rating": "1",
        "review_title": "Stopped watching after 10 minutes",
        "review_detailed_main": "What the heck bruce? You would expect a movie with your face on the cover to be above average, aven if it's a cliché, but now it's BAD in every possible way: screenplay, camera is all over the place, acting is horrendous, .. looks like a low budget tv film. What an absolute shame.."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "grwindsor",
        "review_rating": "2",
        "review_title": "Woah, I really didn't expect a Bruce Willis film to be this portly done",
        "review_detailed_main": "Geez, I'm really surprised how poorly executed this film was. Bruce Willis usually does much better stuff. Some cool big budget CGI though, but doesn't make up for poor scripting, goofs and continuity fails in the first 30 minutes (before I gave up). I love dodgy b-grade sci-fi (even low scoring ones) usually, but this is too bad.\n\nI think the kicker for me was being hundreds of years in the future but the roads being filled with petrol cars and trucks from the 90s. I mean really, someone driving a 300 year old petrol pick-up truck as a daily drive. Nope. It would be in a museum.\n\nI could go on, but no need. I wish I had bothered to look at these IMDb reviews before losing 30 minutes of my life. Lesson learned. Trust IMDb users scores people!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kaylierose",
        "review_rating": "2",
        "review_title": "uhh",
        "review_detailed_main": "Did anyone else have trouble finding any sense\n\nhow was this authorized lol."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Loadedcarp",
        "review_rating": "2",
        "review_title": "Wow, I struggled to watch this",
        "review_detailed_main": "I made it 34 mins before my gag reflex kicked in. It's only an 88min movie and I couldn't find the energy to last.\n\nEverything that the other reviews say is true. Gas cars, 2010-era motorcycles, bullet-firing guns. Etc, etc. The simple fact that humans would still be around in 500 years was laughable at this point.\n\nI started to channel Wesley Snipes: \"Where's all the phasers and s%^&?\" No one has cybernetics, bionic limbs, or nanomachines built into them?\n\nSeriously bad movie. Bruce Willis seems to be on a bad roll lately, with Breach and this disaster."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "idonotexist",
        "review_rating": "1",
        "review_title": "Absolutely abhorrent sin against the movie industry",
        "review_detailed_main": "Word has it that aliens saw this movie and blacklisted our planet for another 40000 years. This is not even a movie, this is more of a group of kid's backyard movie project. The only thing i cannot figure it why is willis in it. There is no way this had the budget to pay him, so i suspect it was a case of a kid asking him to stand in front of their camcorder and ponder upon his resume why he is doing this.\n\nActing is terrible, script is terrible, plot is copy paste, design elements are not even questionable, but downright hilarious. The aliens are apparently wraiths from lord of the rings franchise. Brilliant!\n\nThis is not bad in an entertaining way. This is bad in a bad way. You will have absolutely no value from watching this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gze2112",
        "review_rating": "1",
        "review_title": "You Go In Thinking: There Has To Be Something Worthwhile In Here...",
        "review_detailed_main": "There isn't... One of the worst movies I've ever seen... And I like Sci-Fi, Bruce Willis, and even Frank Grillo... I kept waiting for it to be some sort of self aware joke... But no... Horrible directing, horrible dialogue, cliche upon cliche... Just don't!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "richard-fullalove",
        "review_rating": "2",
        "review_title": "Utter drivel",
        "review_detailed_main": "Mindless plot with woeful acting, hoping to redeem itself with some big screen names. The clothing, American V8 utes, and weapons from the 20th century in the 26th century?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kakumba",
        "review_rating": "1",
        "review_title": "Cosmic Blunder",
        "review_detailed_main": "I haven't written a movie review on here in years, but really needed to for this one. I saw the trailer, read the reviews and thought \"nah, no way Bruce Willis would go down in a fiery crash with his acting career doing below F grade movies.\" Well, I was wrong. So VERY wrong. The reviews here are point on. I wish I could give this a movie a zero. It was the worst crap I've seen all year.\n\nI don't know if Bruce owes someone money or everyone in this film is hurting for cash because of COVID. It sucked BADLY. Seriously save your time and skip this one. It had everything bad that you could think of in a movie.\n\nThe plot was weak and missing any details that would've made this movie somewhat interesting. The actors looked like they didn't care to be there, especially Bruce who seemed drunk or stoned most of the time. Also, the actions of the characters made absolutely no sense \"put your hands up\" to people that are decaying and zombie-looking. What the hell?!\n\nThe editing was nauseating at best. The dialogs, oh god the dialogs were long and boring. Yak yak yak with pointless fillers that only extended the torture of trying to watch this.\n\nThe CGI was mediocre at best. My pre-teen daughter plays with Blender and can do a WAY better job that what they did in this movie for CGI effects. The props were also pretty bad. Someone on here stated their suit of armour looked like plastic. No, it wasn't plastic, more like spray-painted foam with two colored LEDs mounted on each side of their heads. I have a 3D printer and I can make way better props than the ones used in this film. The music kept repeating the same annoying rhythms and drowning out the dialogs at times (may be I should be thankful for that).\n\nI found myself fast forwarding a lot through this movie HOPING for something good, for ANYTHING to redeem this crap that was wasting my precious time, but I was sorely disappointed. I can go on and on about how bad this was but I feel I've ranted enough. Please trust the reviews here, they are right. If not just trust me and avoid this one like the plague."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "thiagolucasthi",
        "review_rating": "1",
        "review_title": "The worst film I ever watched",
        "review_detailed_main": "Seriously? Don't waist your time. The actors are so bad, even Bruce. (What is he doing?). The photography instead of showing a high tech civilization of 2500 show a normal city with some flying cars in the background, really? Nothing in this movie looks futuristic."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gorilla2123",
        "review_rating": "1",
        "review_title": "Seeing that it is a movie advocating for war crimes",
        "review_detailed_main": "I guess the fact that it managed to get EVERYTHING wrong was not such a bad thing after all."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "swainra-180-462732",
        "review_rating": "1",
        "review_title": "What's less than 1 star?",
        "review_detailed_main": "This movie. This movie is less than 1 star. Disjointed. Unwatchable. Stupid. Appalling.\n\nJust some of the words which apply to this mess.\n\nI still don't follow some of the \"storyline\" and I use that term loosely. But I'm not prepared to watch it again to try to understand it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "federada",
        "review_rating": "1",
        "review_title": "I want to put 0 star but I can't",
        "review_detailed_main": "It's literally a Z movie with some money, everything from the CGI to the dialog is horrible, for a minute I have think this was a 2001 film, horrible anyway."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sara_g_is",
        "review_rating": "2",
        "review_title": "Nope",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "frenchmonkeys",
        "review_rating": "1",
        "review_title": "Appalling",
        "review_detailed_main": "So, in 500 years, we'll all still be driving petrol/diesel vehicles that look a lot like models seen on the road today. Despite fossil fuels being phased out now...\n\nGuns - well, a lot like those we have now, and seems somewhat unlikely the technology.of weaponry hasn't improved somewhat in 500 years.\n\nIncandescent light bulbs that are pretty much already phased out, and neon galore.\n\nWithin a few minutes it fails to suspend your disbelief, but I persevered and watched another 20 minutes before I raised the acting, the script, and the entire premise doesn't offer any reprieve from the pit of crap you already found yourself in.\n\nAnd come on, Bruce Willis playing an action role? Still? Because when you run into an aggressive alien species, we're going to need a geriatric has been to save us all...\n\nI watch a lot of sci-fi, and I'm prepared to forgive a low budget production if the idea, the story, and/or the script have some merit. But there's nothing at all here to commend it. Nothing."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "amitdhar-02690",
        "review_rating": "1",
        "review_title": "Very talented director !!!",
        "review_detailed_main": "With the money you spent and the cast you had, it requires special talent to come up with such a scrap. The director and the script writer should share all the credits. Just cant believe what I saw. I thought of giving up midway but then continued just to find out how worse it could be. I have seen plays in school more organized than this. I will recommend everyone to watch this movie and promise no other movie will disappoint you then."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "evanmlopez",
        "review_rating": "3",
        "review_title": "A Cosmic Sin in filming...",
        "review_detailed_main": "Thank god this was free with my Netflix subscription... while I understand early on during the pandemic corners and budgets may have had to been cut to provide a safe work environment but really? I can only hope that this will be the last release effected by those circumstances because any other excuse would be nonsense. The bad acting, poor set design, Xbox 360 worthy special effects, shoddy storyline, and otherwise poor example of a sci-fi thriller casting both Frank Grillo and Bruce Willis make Plan 9 from Outer Space look like James Cameron's Avatar. 1 star for Mr. Grillo, 1 star for Mr. Willis, and 1 star for the effort made by the production team rounds out this more than forgiving 3 star review."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "efxp",
        "review_rating": "1",
        "review_title": "No redeeming quality.",
        "review_detailed_main": "Embarrassing on every level.\n\nGround scenes shot in some boring leafless backlot forest, while using hand weaponry that looks like something you can buy at Walmart next week, not hundreds of years in the future.\n\nThis Tel-Aviv/Hong Kong Saban Films fiasco - more a real estate, Asian film distribution and investment firm than anything else - is 100% cringe-worthy.\n\nAs for Corey Large - normally it appears he's a producer of sorts - and his \"writing\" of this thing, at least he had the junk to also \"act\" in it so convinced was he that it was good on some level. He knows better now.\n\nWrap all this up with the clause Willis seemingly has in his acting contract that he won't go over 100 words of dialogue in a movie.\n\n(Nice to get millions for an amount of words you could easily write on your forearm.)\n\nOddly enough even thespian talents like Wayne Gretzky and Tommy Lees' sons aren't sufficient to save this bowl of curdled cinematic yogurt. Go figure.\n\nApparently Netflix is more than happy to throw in absolutely anything to feed it's huge streaming content grinder."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "natemansur",
        "review_rating": "1",
        "review_title": "Nope",
        "review_detailed_main": "Script, acting, everything was just bad. Not even Bruce Willis could make it better. He must have owed someone money or a huge favor."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "nektarai-94751",
        "review_rating": "1",
        "review_title": "Wears well its name",
        "review_detailed_main": "I've never saw a movie wear its name so well Cause yes, indeed, making this movie was a huge « insert title » Seems Bruce Willis is gonna be all nostalgia for us now."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "SuperSaaj",
        "review_rating": "3",
        "review_title": "A Cosmic Dud featuring a miserable Bruce Willis.",
        "review_detailed_main": "This might be the worst film of 2021....\n\nA non-sensical story, non-existent characters, cheap visual effects, lazy sound editing, inconsistent production designs, badly edited action scenes and a miserable, half-dead Bruce Willis sleepwalking into another pile of cinematic dirt with even less dignity and charisma than Steven Seagal.\n\nThe plot involved something about space colonization and an army fleet of alien parasites from a distant planet that could wipe out humanity (how original), and Bruce Willis plays a retired general who's called back to help stop this threat (how exciting). I barely remember anything else about the plot but it doubt any of it was important. It was so lazily written that it might as well have been auto-generated by an Xbox 360.\n\nI don't know what anyone was doing or even thinking while they were making this lousy attempt of a film. Every single component of the film just seems so lazy and uninspired that its likely everyone involved was half asleep during the production process. From a technical standpoint its almost as bad as Snyder's Army of the Dead (I honestly don't understand the appeal). The film looks ugly in parts. Like AotD a lot of the background is out of focus, but here it appears to be an attempt to block the cheap production designs. The visual effects had the quality of a 10 year old episode of Doctor Who, and the sound editing was flat and lifeless. This is bad even by DTV standards.\n\nAs for Bruce, what the heck has happened to him?! He looked tired and worn out, like a retired has-been who's desperate for money. There's one line of dialogue that summarizes Bruce's current state. When he puts on an exosuit and one of the characters say that it \"belongs in a museum\", he quips: \"They said the same thing about me.\" And he's not wrong.\n\nJust stay retired Bruce, nobody wants to waste 90 minutes of their time for useless fodder like this."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "abhiwa-10942",
        "review_rating": "1",
        "review_title": "Worst movie by Netflix ever",
        "review_detailed_main": "I can't describe how bad this movie is. I mean you won't feel sadness during emotional scene and it is also hard to tell who is true and who isn't."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cpwhitnall",
        "review_rating": "1",
        "review_title": "Unbelievable",
        "review_detailed_main": "I wish I could enjoy how bad it was but it's just too frustrating. I can't remember the last time I turned a movie off without finishing it.\n\nThe year is supposed to be 2524.. Everyone drives 90's cars, the guns are normal, cellphones, clothes.. The \"Q-Bomb\" (worlds most powerful weapon) is a piece of glass with a standard Phillips screw inside. I'm not kidding.\n\nEvery prop, set, costume is incredibly unbelievable and everything looks cheap. It's so so bad.\n\nThe script is atrocious, every scene is painful to watch.\n\nI don't know if Bruce Willis could ever really act, he is not acting in this film.. The story is offensive.\n\nThe first encounter the ailens look unworldy and then they are just regular humans with a head twitch.\n\nNine of them, unarmed and walking like zombies take over a military base, the cast then travel 13 lightyears away through space flying only wearing some plastic on their torsos.\n\nAgain, this is not \"so bad it's good\" it's just bad, it's time you will never get back, time that is better spent elsewhere."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mikaeldonzelli",
        "review_rating": "1",
        "review_title": "What?!!!",
        "review_detailed_main": "The Worst piece of sh..it i ever seen. Bruce Willis is so tired in tjos role its Almis funny,the Actors are the sadest bunch i ever seen,the script is a joke. This can be the Turkey of the year. And yes im a sci-fi fan..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "leecashion",
        "review_rating": "1",
        "review_title": "Nope.",
        "review_detailed_main": "I would rate it lower if I could. The story seems to be one rejected from the worse of adult films. Absolutely confused and disjointed.\n\nI couldn't actually supply a spoiler because that would assume there was a plot to spoil."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bbalmd",
        "review_rating": "2",
        "review_title": "Was this written by a 10 year old?",
        "review_detailed_main": "Seriously wanted to like this, I like Bruce Willis,I like sci-fi, even b-grade stuff ....but this literally feels like someone tried to make a movie from a ten year old's poorly written homemade comic book. Everything is just cobbled together pieces of dead horses that were beaten apart years ago and half the dialogue and concepts seem outright random and senseless. Also they should have called this \"Tachyon Interference\" since it's said so many times; apparently that was the only science term the writers knew?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "leeren89",
        "review_rating": "1",
        "review_title": "Only watched it cos Bruce Willis was in it",
        "review_detailed_main": "A jumbled mess of a film. Worst sci-fi film I've ever seen."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dharmashantilove",
        "review_rating": "1",
        "review_title": "Just bad! Really bad and gets worse!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ameera-41995",
        "review_rating": "1",
        "review_title": "Ewww!!!",
        "review_detailed_main": "I have been watching this movie for alomst a week now. I watch a lil part everyday from how much awful it is. I can just simply pass it, but I am trying to find anything good about it. It is terrible. This is really a cosmic sin, it is a sin to do something this awful. Bruce, stay away from such cheap movies. I am considering that you were not in that movie. That girl specially, Adelaide Kane... What on Earth are you?! Girl you cannot act at all I give you a big Zero and I give the movie -10!!!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "doug_hile",
        "review_rating": "1",
        "review_title": "OMG,,,,,",
        "review_detailed_main": "Getting a little short of cash, Bruce? Cosmic Turkey... BREACH gobbles just as badly. I sincerely hope this wasn't part of a three picture deal. Please,,,, No More.."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "LeParas-1",
        "review_rating": "2",
        "review_title": "Soon Bruce Willis will make Movies with Steven Seagal",
        "review_detailed_main": "Yup, here I said it. Bruce Willis' career or what remains of it is faster and faster circling down the drain to Steven Seagal bad movie levels.\n\nWhat the hell happenend Bruce? It's pretty obvious now that he is not even pretending to care anymore.\n\nIs that man so desperate for a paychek that he even outdoes Steven Seagal and Nicolas Cage in terms of bad One Dollar Bin flicks?\n\nJesus Christ Bruce, what the hell happened?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jamieleepratt",
        "review_rating": "3",
        "review_title": "A convoluted mess",
        "review_detailed_main": "Truly and I mean truly do not waste any money on this dribble."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "john2121fl",
        "review_rating": "1",
        "review_title": "Horrendous writing!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dhaych",
        "review_rating": "1",
        "review_title": "Pitiful",
        "review_detailed_main": "If someone asks you to watch this movie, tell them you're busy cleaning your fridge magnets. The 'Director' should also be charged with some form of terrorism. Truly."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Smudgepot",
        "review_rating": "2",
        "review_title": "So bad it's good, except it's not",
        "review_detailed_main": "This stinker is going to walk The Razzies.\n\nIt looks as if all the worst Sci-fi films ever were cut into 10sec lengths, mixed in a tumble dryer and randomly stuck together.\n\nIncomprehensible plot, costumes rented from the local fancy dress, acting as wooden as the forest that much of it has been filmed in, Bruce sleepwalks through this nightmare on Mogadon.\n\nSurely he does not need the money this bad and even if he does he could do something less humiliating, TV Adverts for feminine hygiene products or pills to help mens' bedroom difficulties perhaps.\n\nIt gets two stars because ,mercifully, it's only 88 minutes long."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "fatednot",
        "review_rating": "2",
        "review_title": "The fall of Bruce Willis",
        "review_detailed_main": "Bruce Willis rose from his slumber just for this terrible film? Which he appears to be in throughout this terrible sci-fi blunder. The fil is set into the future but people still uses technology from 1990's what a terrible sci0fi movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "samipokki",
        "review_rating": "2",
        "review_title": "Yes, it is that bad",
        "review_detailed_main": "I will never get back 90 minutes of my life.\n\nThe base idea could have worked, but.. nah it is bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gianluca-salza",
        "review_rating": "1",
        "review_title": "Terrible.",
        "review_detailed_main": "Simply terrible.\n\nNo story, no sense, nothing.\n\nI lost 1h my life.\n\nI want it back."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "walshdamien5",
        "review_rating": "1",
        "review_title": "Absolutely dreadful",
        "review_detailed_main": "It's been a while since I saw a film so bad. Terrible acting all around. Even the cliches are rubbish. Plot is utter nonsense. Poor music. Avoid at all costs."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "getphysicallyfit",
        "review_rating": "2",
        "review_title": "Cosmic Sin Vs Breach. Why the same movie?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "SLM313",
        "review_rating": "1",
        "review_title": "Waste of potential",
        "review_detailed_main": "The graphics are beautiful but the storyline and conversations of 'Cosmic Sin' are unfitting and out of line, to a point where you're wondering why a specific line is said or a scene is shown because it just does not make any sense. Without Grillo and Willis the whole movie would've been even weaker.\n\nWhy they did it this way? Unknown. All I can think of as an explanation is that someone knew someone or that one of the (B-)actors or others involved in this movie had an idea or a wish and they hastily started filming instead of properly writing a good story with the result being a total waste while there was so much potential. I cannot rate lower than a 1 here on IMDB."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "skifi-36344",
        "review_rating": "1",
        "review_title": "tell me why",
        "review_detailed_main": "If someone can seriously explain to me what was it about, why was there Bruce Willis and how it ended I will raise my rating to 2 stars ... From the first 5 minutes I knew it will be super crap but it was even worse."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kensikcalado",
        "review_rating": "1",
        "review_title": "They just ruined the title...",
        "review_detailed_main": "A precious hour of my life as been successful wasted watching this video."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jasep40",
        "review_rating": "1",
        "review_title": "Bruce Willis truly has committed a Cosmic Sin starring in this rubbish",
        "review_detailed_main": "Bruce Willis hasn't really made a good movie in years and has continued that trend with this rubbish, I guess old habits Die Hard, If only he had a Sixth Sense when it came to movie scripts, I can only think he has signed up to make as many bad movies as possible and breaking that trend would be a Breach of contract, and the studio has him held Hostage, when it comes to his career he seems to have a Death Wish.\n\nHe doesn't even try to put in a good effort into a movie anymore and every performance is a Cop-Out.\n\nHe has committed career Armageddon starring in this rubbish that is for sure."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "moorek",
        "review_rating": "2",
        "review_title": "Bad in most ways with a few good ideas but not enough...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "orngrn",
        "review_rating": "1",
        "review_title": "Swedish subtiles was pretty ok.",
        "review_detailed_main": "I want back 88 minuters of my Life...wait I fel asleep twice for about 10 min.\n\nIs this film just some tax evasion scam ??"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "carlojan",
        "review_rating": "3",
        "review_title": "There is hope for everyone!",
        "review_detailed_main": "Are you jobless? Have you been rejected at the school.performance when you were a teenager? Did you ever dream to be a writer but your were constantly failing at school in literature?\n\nDon't worry you still have a chance! If they did this film and were able to place it, you can do as well.\n\nProbably the producer said \"Alexa write me a script for a science fiction movie\"\n\nI put 3 stars just because the idea of the space travel with the.\"Robo vest\" was funny."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "scottbates-46894",
        "review_rating": "1",
        "review_title": "Cinema threw up and this was the carrot",
        "review_detailed_main": "Truly awful and definately trying to rip off the HALO franchise."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "cippolaus",
        "review_rating": "1",
        "review_title": "Cosmic cr@p",
        "review_detailed_main": "I cant believe mr. Willis has accepted to be in this movie and congrats to the editor😂"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "richiesuarez-71467",
        "review_rating": "1",
        "review_title": "Could have been better.",
        "review_detailed_main": "WTF! You can F'n see what they look like and you still bring them back to our planet?\n\nI'm going to stop watching now 20 minutes in. ARrrrgggghhh.\n\nI was really hoping it would be good with Bruce Willis in it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rrtiverton",
        "review_rating": "1",
        "review_title": "I hope Bruce got paid in cash for this mess...",
        "review_detailed_main": "Wow! What a piece of anachronistic garbage! 500 years in the future and they still drive 2019 Toyota pickup trucks and use conventional guns. Not to mention the Harley. Plot was pointless, dialog horrendous, acting was wretched. Nothing fun or redeeming about this movie. Absolute of time.\n\nIt amazes me to think someone actually green-lit this garbage!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "thejapa",
        "review_rating": "1",
        "review_title": "Worse than Green Lantern",
        "review_detailed_main": "I thought the worst movie ever would be Green Lantern. I was wrong. This is now the worst movie ever. What could possibly make people sign up for a script like this, with such horrible lines. The acting is completely forced, camera angles, nothing makes any sense in this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "serdareker-39531",
        "review_rating": "2",
        "review_title": "Why,Just Why",
        "review_detailed_main": "As someone who loves Sci-Fi movies, i cant get over this one... bad acting, bad writing. Why would you came up with such an idea, and even if i could live with that idea, why would you convert that idea like that in a movie.\n\nSave your time and watch your wall, which might have a better story telling quality."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "christiancarden",
        "review_rating": "3",
        "review_title": "STOPPPP camera SHAKING AND SWAYING",
        "review_detailed_main": "Whoever directed this, and shot this, should be shot. the nausea-inducing photography is just the tip of this pile of space trash. Bruce must have been an absolute pleasure to work with here, he doesn't seem annoyed AT ALL. wanna actually GREAT brand new SCI-FI movie?? try space sweepers! p.s. 400 years in the future aaaaaaaand... a 2016 motorcycle, makes sense. honestly looks like a fan made movie that somehow blackmailed BW into starring, it's 2021.... how does this trash still get made?! looks like there was a sale on blue/pink/red stage lights 😂"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "luca-cabiati",
        "review_rating": "1",
        "review_title": "Throw up",
        "review_detailed_main": "The playbill of the movie is more paced than the movie itself."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kmfazio",
        "review_rating": "1",
        "review_title": "What in the hell....",
        "review_detailed_main": "You see, if most of us screwed up this bad doing what we do to get paid, we'd be out of a job. But the jokers who somehow conned their way in to funding this project and hiring the worst teams of writers, producers, editors and actors (with a couple exceptions) will be allowed to continue working in show business. After that ridiculous decontamination scene, I knew this was movie was a mistake. Stopped watching after 45 minutes. For what this movie cost, it could have paid for a couple episodes of real sci-fi entertainment in the caliber of Dark Matter, The Expanse and Firefly. So in summary, booooooo...you guys suck. Find a different career and stop making movies."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "meowajiah",
        "review_rating": "1",
        "review_title": "Omg,",
        "review_detailed_main": "Reading the reviews where more entertaining than the actual movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "igotthisforcovid",
        "review_rating": "1",
        "review_title": "Pure trash",
        "review_detailed_main": "I made an account just to say this movie is pure utter trash. Whoever green lit this needs to be locked away so they don't allow another abomination like this movie to be made."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Viewer111",
        "review_rating": "1",
        "review_title": "Dreadfully poor movie",
        "review_detailed_main": "There is nothing positive I can say about this movie, Cosmic Sin. Poor acting. Rotten storyline. Overdone special effects. The required Netflix smoking scene. The whole movie sucks."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ppalm-27426",
        "review_rating": "1",
        "review_title": "Is this a movie in 2021?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bsant54",
        "review_rating": "1",
        "review_title": "Shotgun shells?",
        "review_detailed_main": "Near instantaneous space travel.\n\nPick up trucks.\n\nShotgun shells.\n\nParasite waring aliens.\n\nAlien force fields.\n\n1 bomb.\n\nWe win.\n\nThey lose.\n\nEnd of story."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "poltraite",
        "review_rating": "3",
        "review_title": "\"All of our shots are lucky shots....\"",
        "review_detailed_main": "I tried watching this. I really did. That woman doctor at the beginning with the dreadful lines and crap acting set the tone for the rest of the movie. Cool idea poorly executed rubbish script..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Scotslad_007",
        "review_rating": "2",
        "review_title": "Low Caliber, Low Budget, Poorly Executed",
        "review_detailed_main": "The delivery of a LOT of the dialog is difficult to watch most of the time, mostly because it feels like out of context each time. Its like they didn't get any military experts on-set to provide guidance. It's supposed to be 500 hundred years from now and I'm watching kids playing soldier with awfully communication skills. The quick explanation of any of the technology also feels like NO expert was available. Star Trek from the 70's did a better job with First Contact than these guys. Only reason I keep watching is hope of improvement by the end, don't hold your breath. Bruce Willis is another reason I kept watching, if he wasn't in it I would not even take the time to write this review."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mjpwilko",
        "review_rating": "2",
        "review_title": "Bruce - what's going on?",
        "review_detailed_main": "So I watched anti life. Wow that was a turkey. I had convinced myself Bruce wouldn't choose 2 turkeys in a year. But he did. The acting is awful. Bruce is fine in it, but he doesn't really hold the film together. The suits look like they've been made by a Blue Peter presenter and the aliens clearly look like dudes in capes. The special effects are ok I guess."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "heritagenc",
        "review_rating": "1",
        "review_title": "Editing is important",
        "review_detailed_main": "If you ever want to see how the editing of a movie can screw it up, watch this one. It could have been a good movie, but it's chopped to pieces."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "rjcgdbej",
        "review_rating": "1",
        "review_title": "Wtf",
        "review_detailed_main": "You get actors such as Clint Eastwood, al Pacino, Robert deniro etc who have all carried in and chose food films to be in. Bruce Willis why oh why has he jus t fine from bad to worse shame on you taking an easy buck. And a career now that is dead."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "CosmicDooDoo",
        "review_rating": "1",
        "review_title": "Straight to jail.",
        "review_detailed_main": "People should to go to jail for making this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "sharpjohn",
        "review_rating": "1",
        "review_title": "The movie no one wants to be in.",
        "review_detailed_main": "I have the feeling that the producer/directors Were at several partys and got talking to all the people there who were drunk and said do you want to be in a film, and drunkenly went, yep sure why not, to be woken by a call 3 months later to be reminded they said yes."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "korythacher",
        "review_rating": "2",
        "review_title": "Really bad. Among the worst movies I watched in 2021",
        "review_detailed_main": "The idea was pretty cool, but it just came together so poorly I wish I'd turned it off.\n\nTropey in an extremely unfun way\nBoring characters and story\nAwkward music and acting\nDialogue was just awful\n\n\nThe whole thing felt like it was a big joke to everyone in the cast, that we weren't in on. It was 100% a cash grab for the studio and people involved."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "euandavidson-61903",
        "review_rating": "1",
        "review_title": "Utter trash",
        "review_detailed_main": "Seems like Bruce was really needing the cash to do this pointless movie. I thought the first 10 minutes were nearly OK, but then it's like someone else took over directing for the rest of the movie. This has to be one of the worst films that Bruce has ever done.\n\nCan't give it 1/2 a star!"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "galaky-50121",
        "review_rating": "1",
        "review_title": "Another cash-grab by the writers and Bruce",
        "review_detailed_main": "This is just trash made by Edward Drake along with Corey Large for their partner-in-crime Bruce Willis. Edward and Corey have been dumping out piles of garbage for Bruce to act in for the last four years.\n\nI called it too, the \"funny guy\" with a lot of bad dialog was one of the writers, Corey. If you've seen the movie already you know exactly which character I'm talking about. If you haven't seen it yet, you will know who this is immediately. Looking at IMDB, he writes himself into every movie they've done so far.\n\nIf you're looking for a bad movie to watch, this one is nice and painful for those who enjoy well thought-out stories. The visuals are fine. It's the dialog, plot, pacing, and costumes that will make you suffer, truly.\n\nThis movie is not \"so bad that it's good\", it's just bad."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "michael-85954",
        "review_rating": "1",
        "review_title": "Bruce Willis takes money over integrity.",
        "review_detailed_main": "They must have paid Bruce Willis a good amount of money for him to actually agree to do this movie, or maybe he lost a bet. I suppose we will never know.\n\nI've already put in more effort reviewing this movie than the writers, actors, and everyone else did making it, so there you have it."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "douglaswsmith",
        "review_rating": "2",
        "review_title": "Ugh...",
        "review_detailed_main": "If I was to say this was trying to be a Halo ripoff, that would be a compliment."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jenigrant",
        "review_rating": "2",
        "review_title": "Terrible",
        "review_detailed_main": "Go watch paint dry, it'll be more coherent and entertaining than this mess."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "glenn-mckay",
        "review_rating": "1",
        "review_title": "Poor",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "brsztpks",
        "review_rating": "1",
        "review_title": "Wowwwwwww lololol",
        "review_detailed_main": "I don't even know where to begin. We're the actors even in the movie. Did they just sit in 2 rooms and speak lines into a mic as if they were annoyed to be getting a pay check. The amount of poor video quality, props, poor directing because, what you have a-list celebrity telling you \"it looks good to me\". I mean I'm glad this was free on Netflix and I did not see it anywhere I had to waste anything more then time. I feel bad Netflix had to prolly pay money to get this gem for us the stream. To the 50 people that made money on the movie. Congrats, to the millions of us suckers who had to watch it. Chalk it up as a bad meal."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "wonderdez",
        "review_rating": "2",
        "review_title": "When corporate people turn art into product",
        "review_detailed_main": "We all know about EFO and Randall Emett films but omg these Bondit people who keep churning these films out over and over just slapping names on re-tread films is killing the industry. I mean I get it, we want films to be made and maybe the studio space left a vaccum but this constant barrage of films that are \"similar\" to other films shot in 5-7 days with no prep no story is crazy! But when you can make money int he shadows like these guys do thats why you keep seeing 45 executive producers for a film shot in a weekend. Edward drake did 8 of these in a year-- 8!! HOW! Cosmic sin is another example of guys with no talent and access to daddys hedge funds funding films and taking photos on set to make them look important... sad really what they did to bruce."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "toptupper",
        "review_rating": "1",
        "review_title": "Not good.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "phildunphy",
        "review_rating": "1",
        "review_title": "A sin to watch this",
        "review_detailed_main": "I didn't watch the entire movie. I just couldn't take it anymore. Really bad plot with a lot of information thrown in at the beginning. It's movies like this that make second guess my Netflix subscription. Bruce, you can choose better movies to be in."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "lorenzodurante",
        "review_rating": "1",
        "review_title": "Penoso",
        "review_detailed_main": "Come hanno fatto a convincere questo cast a girare questo film? Senza senso, senza storia, senza budget. Scene buttate giù a casaccio. Che pena."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "pejman-44134",
        "review_rating": "1",
        "review_title": "Hmmmmm",
        "review_detailed_main": "Ok honestly, hmmmmm sums up this movie in every aspect. There is simply nothing positive or even neutral to say about this thing."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "blackwell4",
        "review_rating": "1",
        "review_title": "It makes a much sense as a harmonica in an echo chamber",
        "review_detailed_main": "Disjointed storyline is not interesting.\n\nLame dialog is lame.\n\nPhysics fantasy coupled with very unrealistic soldiers is so disappointing."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "mikuski",
        "review_rating": "2",
        "review_title": "Not even worth a comment....",
        "review_detailed_main": "Really ... no comments.\n\nLike don't waste your time. There were moments, when I thought it must get better. But no...."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "adam_brine",
        "review_rating": "1",
        "review_title": "I'm 41 and this is one of the worst films I've ever seen",
        "review_detailed_main": "So much potential from the synopsis, but omg, this was so boring - nothing of note happened, everything was completely vague with no structure or development at all.\n\nBruce Willis is the star, but honestly, this is like a film you make if you've had your whole family kidnapped and threatened with death if you don't do it.\n\nCompletely, dull, flat, lacking in any development or depth. One of the worst films I've ever seen.\n\nAvoid! You have been warned."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "wwyhgdsn",
        "review_rating": "1",
        "review_title": "I just...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "imdaqman",
        "review_rating": "1",
        "review_title": "What. A. Terrible. Movie.",
        "review_detailed_main": "I have no words to adequately describe what an utter waste of time this movie is.\n\nWhat a terrible movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jzimmermann-21816",
        "review_rating": "1",
        "review_title": "Bruce what have you done?",
        "review_detailed_main": "Bruce Willis was one of my favorite Action stars and he turns more and more into a joke. Most of his films lately are pure garbage and Cosmic Sin is a perfect example for that. I don't mind watching B movies, sometime you can discover a hidden masterpiece. However, Comisc Sin is the opposite to that. Cosmic Sin is among the worst films, I have ever seen so far."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "duffestates",
        "review_rating": "1",
        "review_title": "Horrible",
        "review_detailed_main": "This movie should be erased. Horrible from beginning to end. I shouldnt even make it on the rating board."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Bindicuss",
        "review_rating": "3",
        "review_title": "Bruce Willis's NEW Movie is SO BAD It's BREAKING THE INTERNET!",
        "review_detailed_main": "\"Cosmic Sin\" is a film that seems to exist in a cinematic black hole, a swirling vortex of bad acting, nonsensical plot, and special effects that look like they were crafted with a decade-old version of Blender. Bruce Willis, a shadow of his former action-hero self, sleepwalks through his role as General James Ford, a grizzled military man tasked with saving humanity from an alien threat. Honestly, it's almost painful to watch such a talented actor phone in a performance with such disinterest.\n\nThe problems with \"Cosmic Sin\" are numerous. The dialogue is clunky and exposition-heavy, often relying on tired sci-fi tropes and clichés. The characters are paper-thin, lacking any depth or motivation beyond shooting aliens and spouting cheesy one-liners. And the plot, oh, the plot! It's a convoluted mess that jumps between scenes with reckless abandon, leaving the audience bewildered and disoriented. One minute they're on a spaceship, the next they're teleporting to a random planet that looks suspiciously like a quarry in rural England.\n\nBut here's the thing: amidst all the chaos and absurdity, \"Cosmic Sin\" possesses a strange, almost hypnotic quality. It's like watching a train wreck in slow motion, you can't look away even though you know it's going to be a disaster. The film's sheer incompetence becomes a source of amusement, a testament to the depths of cinematic depravity that filmmakers can reach.\n\nSo, if you're in the mood for a truly terrible movie experience, one that will make you laugh, groan, and question the very fabric of reality, then \"Cosmic Sin\" is the perfect choice. Just grab some popcorn, gather your friends, and prepare to embark on a journey into the cinematic abyss. But be warned, you might need a strong drink afterwards to cleanse your palate."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "msanecia",
        "review_rating": "1",
        "review_title": "Avoid this... Even if it's the LAST movie in the cosmos",
        "review_detailed_main": "I just wanted to warn any other poor soul who may have been conned into believing this was anything beyond sub par action filming. It deserves zero stars. Is Willis having some form of aging dilemmas? He literally speaks only a handful of times as if this is his last hoorah of some sort. Cosmic Sin has absolutely zero storyline. Zilch. Nothing. Maybe COVID caused writing, filming, location, and acting issues?? I have literally been watching this movie off and on for 8 hours because I try to finish anything I start (personal issues). It's torture. Just don't. 😣😫😭"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "drwaelmustafawm",
        "review_rating": "2",
        "review_title": "Horribly horrible!",
        "review_detailed_main": "By far the worst of the worst.\n\nLiterally nothing is good about this film. Plot sucks, if there's any. Actors, barely acting. Enemy, sooooooo cliché and lame. Graphics is AWFUL. Make-up is sh*****t.\n\nAnd the worst part, the movie supposed to be 500 years in the future, and somehow we still use yesterday's technology.\n\nA total waste of time."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "socrfan-80182",
        "review_rating": "1",
        "review_title": "Pathetically bad",
        "review_detailed_main": "One of the worst movies I've watched in years. Boring script that made no sense. The actors looked as if they were as bored with making the movie as the audience. Whoever signed off on making this needs to find another line of work."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "dalepanzer",
        "review_rating": "3",
        "review_title": "You know how when you say a movie is bad someone will ask if you can do better?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "ObiWanJabroni13",
        "review_rating": "2",
        "review_title": "I guess Bruce Willis lost a bet?",
        "review_detailed_main": "This thing is a mess. Hard to follow even with all the sci fi cliches. And the \"aliens\" look like Star Wars cosplayers. I'm assuming Bruce Willis either lost a bet or owed a favor to get dragged into this mess. Avoid this at all costs."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bzt96",
        "review_rating": "1",
        "review_title": "Made for TV?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "vire-11946",
        "review_rating": "2",
        "review_title": "So bad...",
        "review_detailed_main": "I love Bruce Willis and I love Sci Fi, so you would think this would be hard for me to dislike. It wasn't, it wasn't hard for me to dislike. This is the most phoned in movie I have ever seen. From the writers, to the actors, to the sound track. Absolutely terrible..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "jasmin-86966",
        "review_rating": "1",
        "review_title": "Machine gun in 2554 LOL.",
        "review_detailed_main": "The film is so poorly made as if the director was competing to make the script as bad as possible. There is no comprehensible introduction, there are too many unnecessary actions of the film. Important scenes are in the form of a moment, and long boring scenes last like an eternity. The film does not hold the viewer's attention.\n\nThe music in the film is terrible, the Space Alliance seems to not exist. A very bad script for a movie made in 2021. Films from 1980 have a better script. I'm writing this review as well as the scenes in the movie. Perhaps the author was inspired by the films Space Soldiers and Armageddon when writing the script."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "seldomane",
        "review_rating": "2",
        "review_title": "Jason X meets Riddick. Why not a Fifth Element 2?",
        "review_detailed_main": "The characters aren't relatable. Camera angles are terrible. I swear most action movies since the 2000's are solely based on getting the camera as close and shaky as possible to disorient the viewer.\n\nCreating convincing action scenes doesn't require CGI every time, all the time. Believe it or not, some of the most loved movies of all time had wide camera angles that didn't change every 0.3 seconds. Like Die Hard...\n\nBruce Willis already did 5th Element. Unless you wanted to try to beat it, this is a waste of time. To involve him and make him the prime poster cover when really he's just a cameo most of the movie, is poor salesmanship. You would have been better to try a Fifth Element 2 than this Jason X meets Riddick.\n\nThe directing was just awful, the lines were COMPLETELY unbelieveable from the start. The action was garbage mostly because of the terrible camera angles and frequent changes.\n\nI don't direct movies, but I know good ones from bad ones, and no offense to one of my fav actors Bruce Willis.... but this movie is not worth watching."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "desertsailor",
        "review_rating": "1",
        "review_title": "Cosmic waste of time",
        "review_detailed_main": "Where to begin? Sloppy writing. Amateurish CGI in spots, a mostly incomprehensible ending, phone in performances.... skip it, folks, look for something better."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bruce-58474",
        "review_rating": "1",
        "review_title": "Cosmic Disaster",
        "review_detailed_main": "The only sin here is the lack of any cohesive thought in writing producing and directing this awful movie. Sad to see good actors and actresses get handed a script of crap. There is.evidence that the writers may have read Starship Troopers by Robert A. Heinlein (GOAT of SciFi authors) and used his Nova bomb as describe in Starship Troopers 3: Marauder and Starship Troopers: Traitor of Mars; \"There has been controversy on Earth over the use of the Q Bomb: Religious fanatics say that the Federation shouldn't decide what planet lives and dies; politicians don't bother; and military officials think that since the Bugs don't use a Q Bomb, why shouldn't they?\" This sad movie attempts to be part HALO, part StarShip Troopers, part Astronaut's Wife, part I don't know what the Fubar. It rambles and stumbles it's way across the screen like an alien bug shot so full of plot holes that it's raining blood and bad lines till it finally collapses in a fit of flatulence, writhing on the theater floor, spilled popcorn and milk duds scattering in all directions, like sparks from a broken dynamo. The green screen, is cheep, the FX only add to the unrealism, there is no sense of immersiveness, and Bruce delivers his worst performance since Hudson Hawk. Spare your eyes and ears and move on from this cosmic cosplayed out weirdness."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bmau-18781",
        "review_rating": "1",
        "review_title": "no sense",
        "review_detailed_main": "I am a fan of B grade sci fi but this caught me by surprise like farting and realising it's not a fart. The biggest sin here is the directing. I cannot believe someone actually funded this project let alone let it be published. This is one of those movies that can end a career it is that bad. Bruce Willis is in it yes.. but I was sure he could act ? Right ? And then there are a few B grade actors as well as some who look like other actors. The scripting was perhaps the worst I have ever seen. They clearly had a budget so why not make a half decent movie ? This is fighting for top ten of worst movies ever watched and I only let it get to the end to see what happened and even then I regret it. Watch at your own peril."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "scoobydoo-29055",
        "review_rating": "1",
        "review_title": "Like watching the gong show",
        "review_detailed_main": "I wish I had a mallet to smash the gong.... kicking the whole movie set off my tv. I'm sitting here waiting for something to happen and get better. I couldn't take this bs and stupid dialogue and stupid music like something was suspenseful when it wasn't. I can see why Bruce sucks now. Every flick he's signed onto since die hard has sucked. I thought this was an alien flick not some vampire zombie movie. Wth? What a pos movie. \"Go go go\" or \"move move move\" when getting shot at.....lmao..Believe all the 1s. I shut this off and didn't watch the rest...45 mins in, I turned on my Xbox damn this was painful to watch half way.\n\nExample of one of the many cheesy lines:\n\nGuy- \"who do you think I am?\n\nGirl replies- \"your worst drinking buddy\"\n\nReally? Who wrote this stupid cr@p\n\nOh and the chick with the yellow and black pig tails? Listen to her cheesy laughable acting and lines. How the hell could this acting get past the producer and director? Hope you have a backup job :D\n\nYippee ki yay Bruce."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "bxnj-69727",
        "review_rating": "1",
        "review_title": "in the past...",
        "review_detailed_main": "In the past nonsense like this would be hidden on the dusty back shelf of a video store to be seen by only the brave or stupid few. Today it is on streaming services for all to see. Wonder how many careers have failed because of this. Bruce, hang your head in shame and me for watching this \"movie\". I have read what the film is meant to be about, but still can't really fathom it. Petrol cars, hand guns, worst space suits I have seen, bomb that looks like it came from an old valve radio, acting that all should be ashamed of. They are all the things to be looking forward to if you pluck up the courage to watch this travesty. I think I would have more entertainment cutting a space rocket from the back of a cereal box and playing with that."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "arshadpahad",
        "review_rating": "1",
        "review_title": "I give you cosmic nonsense.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "indianblade",
        "review_rating": "1",
        "review_title": "Bad all the way around. SPOILER",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "gjc278",
        "review_rating": "2",
        "review_title": "In the 2500s people inexplicably drive current-era cars",
        "review_detailed_main": "If you like plot holes, cliches, corny dialogue that is not funny, and some pretty good special effects...this might be a movie for you. This movie is as dislikable as most of its characters and as confused as most of the actors seem to be."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kevinsbase",
        "review_rating": "1",
        "review_title": "Terrible. Just terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "kalinmajesticimagingcom",
        "review_rating": "1",
        "review_title": "A must see movie - or else you'd never believe how truly bad it is.",
        "review_detailed_main": "We had hoped this would be so bad it's good, but no. Every single element from the script to the acting to the lines - painfully cringe worthy awful.\n\nDid Bruce lose a bet or something?\n\nMy wife just told me she wants a personal apology from him for subjecting her to this.\n\nFortunately, after watching this we can now both start collecting disability as we've said goodbye to countless brain cells."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "blue-52550",
        "review_rating": "1",
        "review_title": "Bruce?!!!?!?!?!?!?!?!?!?!?!?!",
        "review_detailed_main": "First, I saw Bruce and I was like, WOOHOO another alike awesome movie like Armageddon!\n\nSoon, I was like, WHAT!?\n\nI mean literately like WHAT?!\n\nLike WHAT, the Q bomb is made with a wood screw?!\n\nLike WHAT, you can flight in outer space but your suite is not a fully enclosed suite?\n\nLike WHAT, you can fall in atmosphere without burning like an meteorite?\n\nYou, know, WHAT???\n\nThat is exactly this movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "marcoilduce",
        "review_rating": "1",
        "review_title": "Waste of time",
        "review_detailed_main": "I cannot for the life of me say one positive thing about this movie. There is no acting, no plot, no movie. Don't waste your time even clicking on this out of curiosity."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "stefanogiacomelli79",
        "review_rating": "1",
        "review_title": "Worst scifi movie ever..",
        "review_detailed_main": "After a wile i was watching this mybe 15-20 minutes... i skip to the end see if they put the good stuff at the end... i was wrong... looks like a bad fan made movie for youtube... people who made this movie should be shame by themselfs..... what a garbage movie."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "karim-alsayed",
        "review_rating": "1",
        "review_title": "Terrible piece of s@#t!!!!",
        "review_detailed_main": "No need to waste time writing anything....movie wasted more than enough time of my life..."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "joeyfrats",
        "review_rating": "1",
        "review_title": "Just couldn't do it...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "talbotphoto",
        "review_rating": "4",
        "review_title": "Adjust your expectations!",
        "review_detailed_main": "It's a B movie. It's made to kill time. It could've been much worse (\"Monsters of Man\", anyone?)... Yes, the actors seemingly didn't want to be there, and the music was on the opposite side from Zimmer... But it's a B movie, okay?!\n\nOn a bright side, other than presence of a token \"female power\" character with wielding a BFG, there's no virtue signaling whatsoever, no preaching or lecturing... That alone gets 3 extra stars from me. So, 4 in total. Fair enough?"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "radivel",
        "review_rating": "5",
        "review_title": "Makes you wonder what could have been",
        "review_detailed_main": "A strong opening act shows cracks that eventually become chasms of mediocrity. The concept is quite good and really feels like the sort of thing you dreamed up in your nerd-driven fantasy of what could happen in a cool sci-fi storyline, but when the budget gets you Bruce \"Anything for a Buck\" Willis and a bunch of special effects worthy of mid-90s SyFy TV shows, you end up feeling like you've just been lied to. Frank Grillo gets top billing but is on screen for about 5 minutes. Mid to late movie direction is particularly poor, as you sometimes enter the zone of \"spooky ghostly characters in the dark\" and dudes in plastic outfits that bear no resemblance or relation to the interesting type of antagonist encountered in the first act.\n\nThe redeeming quality is that it makes you think about what a cool story this could have been if it had a giant budget. It could have been longer, more fleshed out, and not look like half the movie takes place in a garage."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "vintagevaultarcade",
        "review_rating": "2",
        "review_title": "Cosmic Shart",
        "review_detailed_main": "Watched for Bruce Willis, who almost sounded like Vin Diesel one-liners throughout the movie. Acting was not credible at all for everyone. The CGI was probably the only part worth watching."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "frankie-08908",
        "review_rating": "1",
        "review_title": "Say It Ain't So",
        "review_detailed_main": "Frank Grillo was making some great decisions with projects. He has a very likable personality about him in almost every movie. He's very talented and looked to be on the verge of potentially being a leading actor. Well, something has happened as of late because this is like the 3rd DUD he chose. I literally can't believe he would say yes to be involved in such garbage. Yeah Bruce Willis is long in the tooth but come on, it's Bruce Willis. Well some years ago he decided for some strange reason it's better to be in horrible movies. Why?? Frank Grillo better change his direction fast before there's no turning back. I'm afraid to say it could be over for Bruce."
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "Silicone54",
        "review_rating": "1",
        "review_title": "10 minutes in and turned it off",
        "review_detailed_main": "Bruce Willis will take any acting job seriously he will. To be fair, I can't give a review since I didn't even make it past 10 minutes. What happens in the first 10 minutes?\n\nA small bomb lands in a forest. People talk in front of a Walmart parking lot. We see a dive bar with good ol aluminum siding on the outside. The patrons are dressed in flannel shirts. People pull out pistols during a fight. This is not a scene from 1982...this movie is supposed to be 2542 or whatever date that is 500 years from now.\n\nAccording to the writers, rednecks will survive through the next 5 centuries. Pitiful start and I didn't care to continue with it. I hope you value your time more than Bruce Willis. Did the writers even bother"
    },
    {
        "movie_id": "tt11762434",
        "movie_name": "Cosmic Sin",
        "movie_rating": "2.5",
        "review_username": "uosaintofkillers",
        "review_rating": "1",
        "review_title": "Absolute Garbage",
        "review_detailed_main": "I can't believe Frank Grillo starred in this pile. It wasn't even up to the SyFy channel quality, which isn't hard to achieve. So so bad."
    }
]