[
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Philby-3",
        "review_rating": "8",
        "review_title": "More than a history lesson",
        "review_detailed_main": "You could dismiss this film as a Danish history lesson but it is more than that. It is a love story with an improbable background in a rather gloomy setting, the Danish Court of the late 18th century. Mad (or at least seriously disturbed) King Christian VII (Mikkel Folsgaard - superbe) marries 16 year old English princess Caroline (Alicia Vikander) who happens to be George III's sister). He prefers the company of his dog and mistress to her. It is not surprising that Caroline falls for Johann Struensee (Mads Mikkelsen) who becomes the king's personal physician on the strength of his knowledge of Shakespeare (especially Hamlet). The king is, as they say, easily led, and for a year or so Sturensee, despite being German, has a fine time as de facto ruler enacting liberal measures such as the abolition of serfdom and the repeal of censorship laws, not to mention free smallpox inoculations. But the forces of reaction led by the king's stepmother gather. It was surprising to learn that 18th century Denmark was such a backward society.\n\nMads Mikkelsen gives a nuanced performance – 'quiet intensity' in fact, and Alicia Vikander is equally intense. They are a serious couple imbued with the ideals of the 18th century Enlightenment but their passion is physical as well as intellectual. Unfortunately their ideals are a little advanced for Denmark of the 1770s despite support from writers such as Voltaire. The local book-burners led by Hoegh-Guldberg (David Dencik) are not swayed by argument of course.\n\nThe production is full of atmosphere. The castles are suitably gloomy and there's plenty of medieval squalor beyond the castle gate. Much of the action takes place in winter which adds to the chilly atmosphere. The aristocracy are suitably heartless and the peasants downtrodden. The king provides some zany (if not quite authentic) moments, appointing his Great Dane to his council and ordering Struensee to make Caroline a \"fun queen\".\n\nThis is quite a long movie at 140 minutes yet is enthralling from start to finish. Even though you can guess the ending you are swept along by the story and the performances. You can see why the audiences at Cannes loved it."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "RichardvonLust",
        "review_rating": "9",
        "review_title": "Best supporting Actor 2012 - by a landslide.",
        "review_detailed_main": "I had the great fortune to be invited to attend the World Premiere at the Berlin Film Festival earlier this evening of this wonderful film -and opportunities like that don't come often.\n\nA Royal Affair is Oscar level material in many respects. The screenplay, directing and photography are all superb but the performance of Mikkel Følsgaard as Christian VII of Denmark was perfection. It is so difficult to act a madman acting as if he were sane and I cannot believe any actor taking an Oscar this year could have put up a better performance. Mikkel got the loudest cheer from the audience and he thoroughly deserved it.\n\nThe plot revolves around the machinations of power behind the throne of a simpleton monarch. Christian may be King but he simply wants to play like a child. He is married and fathers a son quite brutally but he loves his dog more than his family. And so a German Doctor is called to treat him. Christian befriends his physician and leaves more and more power in the hands of this foreign commoner. And then the Doctor falls in love with the Queen....\n\nIt's all true and I won't tell more than that. Just go and see it as soon as you can. It puts Hollywood and Bollywood both straight into the dust bin. Classic drama, brilliant script and a piece of thespian-ism that puts Olivier to task. Just brilliant."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "fedilio",
        "review_rating": "9",
        "review_title": "What can i say....i was blown away by this this movie",
        "review_detailed_main": "I saw this last night and its been on my mind a lot since then..\n\nWhat a fantastic movie!!, i went in with high expectations, as i had only read very positive things about it, and I was definitely not disappointed, what a beautiful, sad and touching story Great acting overall, mads Mikkelsen is always good, and this is one of his best roles in my opinion, Alicia wikander was beautiful as the young queen, but the real star of this movie has to be Mikkel Boe Følsgaard as Christian VII, Wow!!, what a great actor, his portrayal of the mentally ill king was superb, he really made me sympathize with Christian, he may have been of his nutter and mean at times, but deep down, I think he was a good guy, but he was a very insecure young man, who didn't know how to behave properly, and who couldn't deal with the obligation of being king, he was misunderstood, and I felt really bad for him at times, I really like the portrayal of the relationship between the King and struensee, they were really very good friends/companions, and struensee was like a father to Christian.\n\nThe costumes were also beautiful, I love fashion in that period, and this movie had some beautiful clothes to dwell on.\n\nIt was about time my country did a movie on our royal history, and now they have, and the outcome is better then i could have ever expected, just beautiful, Hollywood couldn't have done it better, as a Dane I take pride in our danish (royal)history.\n\nGo and see it!!, you wont be sorry"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "patryk-czekaj",
        "review_rating": "8",
        "review_title": "A very satisfying period drama",
        "review_detailed_main": "Historically relevant, A Royal Affair shows its true period-drama nature in the very intelligent and detailed storyline, steadfast and conspicuous acting, and, most of all, sumptuous and glorious interiors, which actually enhance the visual experience significantly. The film expressively reminds the world once again about the illicit affair between Caroline Mathilde (Alicia Vikander), the beautiful Queen of Denmark, and the enlightened, German-born physician named Johann Struensee (Mads Mikkelsen). In all its courtly essence, A Royal Affair presents this 18th century tale with utmost thoroughness, adding huge amounts of tension to its naturalistic substance with every following minute. While it's mostly recognized for the meaningful romantic overtone, this film presents much more than that, even though the star-crossed lovers prove to have the biggest impact on the unexpected turn of events.\n\nIt starts very similarly to Sofia Coppola's Marie Antoinette, with a young princess bound to marry a king she doesn't even know, through the old-fashioned way of a royal transaction. Right after the Queen finally sets her lovely eyes on the mysterious husband-to-be one thing is certain – there is something wrong with his majestic appearance. Christian VII (Mikkel Boe Følsgaard) giggles nervously, and is more interested in greeting his own dog than the woman, with whom he will probably (but not likely) spend the rest of his palace life. Right after the both absolutely awkward and truly humorous announcement of King's nightly visit in his wife's bedroom, and Caroline's anxiously awaited pregnancy, it becomes perfectly clear that the pair won't present itself in the expected, regal way. Those two characters don't even intend to give the appearance of being fully in love with each other. The king wanders angrily around the luxurious chambers making fun of everyone, not knowing that he ostentatiously presents all of his biggest weaknesses. At the same time, the Queen spends most of her time with the newborn baby. When Christian proclaims his forthcoming trip around Europe nobody realizes that big and sudden changes are about to happen. During the journey King's mental illness becomes worse. He needs a private doctor and he needs him quick. This is the moment when Johan Struensee first shows his handsome face. Apart from his unquestionable medical abilities, he proves to be a great admirer of the Enlightenment movement's greatest thinkers and their innovative works, and that's what makes him an ideal partner for the King. After returning to the country, their companionship grows stronger every day. Unfortunately, so does Johan's affection towards Queen's awe-inspiring persona. After a while, it becomes awfully obvious that they won't be able to suppress their deepest urges and a risky romance will soon take place, one that might actually begin a new era in the history of Denmark. Scheming behind the back of the wig-wearing, ignorant council, Caroline and Struensee use the gullible King for the sake of a greater good – they create many new and reformative laws, and using Christian's powerful, yet unstable hand they end up improving the whole land and its citizens' life, rushing Denmark towards the desired Enlightenment.\n\nAs history so often shows, when there is the optimistic, hard-working side there must also be the pessimistic, mischievous one. In A Royal Affair, it takes the form of an ominous, recalcitrant aristocrat named Ove Høegh-Guldberg (David Dencik). Conspiring along with Christian's stepmother Juliane Marie (Trine Dyrholm) he comes up with a perfect plan to get rid of the unwanted German and, at the same time, bring back Denmark's old 'glory'. Revealing the shocking truth about Queen being pregnant with Struensee he wreaks havoc among the society. The return of the Dark Ages is upon Denmark, and no one is able to stop this devastating process, as the King gave in to Ove's strong and convincing character, and, ultimately, to his own illness. Johann and Caroline are banished from the Kingdom, just to see that, sadly, their thorough plan wasn't actually meant to help anyone.\n\nWith its splendidly high entertainment value, A Royal Affair turns out to be a history lesson for everyone. Considerable attention to details in plot and in art design brings out the true substance of the film. The costumes are pitch-perfect, the music flows adequately to the events, and the ongoing transition in the atmosphere intensifies the reception of the whole. A Royal Affair possesses a great energy, which shows its true strength in all the performances. Without offending anyone from the amazing cast, it's important to note that Mads Mikkelsen gave the most award-worthy performance, showing the straightforwardly persuasive impassiveness that may really convince his fans and anti-fans alike. Therefore, those irrefutable acting skills, combined with a well-written script and steady direction, make A Royal Affair one of the most memorable Danish movies of the last decade."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "dbogosian-1",
        "review_rating": "9",
        "review_title": "Exquisitely made dramatic knockout",
        "review_detailed_main": "A fantastic film about a country whose history is seldom portrayed, A Royal Affair is a historical drama set in the latter half of the 18th century in Denmark. An English girl is sent off to marry the Danish king, only to find out that he's not fully sane. In her loneliness she falls for the king's doctor, and they find they share not only amorous feelings for one another, but a passion for Enlightenment ideas and political reforms.\n\nThere are a few caricatures in this movie that keep me from giving it a higher score: the reactionary forces are pure, unalloyed evil; the reformers are probably far more liberal in thinking than would have been possible in that era; and the preaching against established religion is a bit thick. But otherwise, this is a gem of a movie with outstanding performances in all three key roles, particularly the doctor who is portrayed with an incredible intensity and realism. Also noteworthy is the king who is not quite sane yet not totally loony either; the acting here is frighteningly good and utterly convincing. Last but not least, the queen excels in showing real pathos and long-suffering endurance trapped in her destiny, and then comes alive beautifully in her relationship with the doctor.\n\nAs icing on the cake, costumes are sumptuous, period settings flawless, and the music is era-appropriate and delightfully arcane. Original music is also quite good, though most of the time one is so engrossed in the story that the music just vanishes. Movie is almost all in Danish with English subtitles, and I felt the size/font choice for the titles was too big, too pushy, you never quite forget that you're reading titles.\n\nThis is a tale of exploration of the darker side of the human experience: what does it mean to be sane, how can a divinely ordained monarch be deprived of his wits, to what lengths will a person go to promote his/her progeny into power, are the \"unwashed masses\" really grateful to those who try to emancipate them? This movie (and its three main characters) will haunt you for many days."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "dromasca",
        "review_rating": "7",
        "review_title": "love, insanity and social reform",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "writers_reign",
        "review_rating": "8",
        "review_title": "There Is Nothing Like A Dane",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "webmaster-3017",
        "review_rating": "6",
        "review_title": "HK Neo Reviews: A Royal Affair / En kongelig affære (2012) – Denmark (Media Screening)",
        "review_detailed_main": "Mikkel Boe Følsgaard as the mad King of Denmark, may not have been given the title role, but he oozes with scene stealing presence in almost every scene he appears. In saying that Danish historical drama \"A Royal Affair\" is purely carried by Mikkel is by no means an understatement. In fact, the film is rather disappointing with all characters rather blend and uninspiring, apart from the King. Director Nikolaj Arcel (writer of \"The Girl with a Dragon Tattoo\") is clearly a much better script writer than at bringing the picture to life. \"A Royal Affair\" could have been something enormous, but rather it all seemed too much like clichés, too many boredom moments and some rather predictable acting from Mads Mikkelsen as the Royal doctor. I am by no means an expert in Danish cinema, but despite looking wonderfully detail in its depiction of 1700s life, the film lacks a vital ingredient of having a heart. There is no doubt that \"Royal\" is not a bad film and will never be, but one cannot stop wondering what could've been and once again the case of a missed opportunity.\n\nAs mentioned earlier, Mikkel Boe Folsgaard steals the show from far more acclaimed Mikkelsen (\"Casino Royale\"'s fame) and the Queen played by rising Swedish star Alicia Vikander. Mikkel is able to bring his mad character to life and more importantly a human naturalistic touch to it as well. It is a vital stranglehold that the film ultimately fails miserably at. In saying so, Mads Mikkelsen is extremely disappointing in a role that requires so much more. His stoic outlook and appearance certainly did not help the cause, but what really led him down is his inability to show the conflict between love, power and ideals that his character and the audience needed from him. Although it must be noted that despite the age difference, there is an underlying chemistry between him and Alicia Vikander. Moving on to Vikander, there is no question of her pretty face, but despite a promising start, she is never sure of the character that she is trying so hard to portray. At the end, the audience does not feel for either Vikander and Mikkelsen and while both actors should be blamed, a burden should be attributed to the director Arcel, by not being able to exploit the most at his disposals.\n\n\"A Royal Affair\" is really a historical film about a time in the late 1700s when people are starting to challenge the status quo, the introduction of science, questioning of the Church and all of these leading to the times of being in the middle of the age of enlightenment. The famous Royal doctor Johan Struensee is being portrayed as a simple and straightforward idealist guy that bedded a Queen, but rather he is an interesting character that is driven with passion and ideal to change the world and in the midst of things got stuck in an affair with the Queen. However, he is nothing, but a simple character, as he is torn between assuming more and more power as well as his personal drive for ideals. Here, all we see is a simple black and white character where by the end of the film, he seemed more like a villain than a complicated yet flawed character he should have been.\n\nAll in all, \"A Royal Affair\" is really a missed opportunity. Although it must be admitted, that the screenplay and the best actor award seems thoroughly deserving in winning the Berlin Film Festival awards, but the film precisely fails to deliver in every other category. The film is also a tact too slow in the beginning and lacks tension even in the rather frequent sexual Royal affair. Luckily, the film is saved by the wonderful Mikkel Boe Følsgaard whose character despite being the least normal of the trio, stand heads and shoulders above the rest of the crowd. Perhaps the film-maker was right to focus on the pair of scandalous lovers, after all the film name is titled after it. Still, this could easily be a far better film, far better acted and far more deep and meaning. Perhaps, I am being a tact too harsh, but the result of \"A Royal Affair\" is not that it is a bad film, but rather it is far too average, far too normal and far too predictable to be involving and affecting. I should be crying by the end of the film, but instead, I almost felt nothing. Beautiful to look at, but ultimately I felt nothing\u0085 (Neo 2012)\n\nI rate it 6/10"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "georgep53",
        "review_rating": "8",
        "review_title": "Compelling Historical Drama",
        "review_detailed_main": "\"A Royal Affair\" is a Danish/Swedish/Czech production about the reign of 18th century King Christian VII of Denmark, his Welsh wife and a German physician whose progressive ideas shake Denmark's conservative ruling class to its foundations. As best I can discern the film tries to keep true to actual history with some embellishments added concerning the role of the Queen in the political machinations along with some reasonable speculation about a possible menage a trois. The screenplay by Nikolaj Arcel and Rasmus Heisterberg does a nice job of capturing the unusual atmosphere of life at a court governed by a mentally unstable monarch who's little more than a nuisance puppet of the nobility and the church. In the middle of all that is the young English Queen trapped in a loveless marriage. She is also disturbed by the unwillingness of her adopted country to accept the ideas of the Enlightenment then circulating around Europe. Under the direction of Nikolaj Arcel \"A Royal Affair\" is an effective recreation of a bygone age yet one in which we can see our contemporary quagmire between those who advocate change and those condemning it. Mikkel Folsgaard is excellent as the King. He never descends to caricature and is both powerful and pitiable. Mads Mikkelsen is compelling as Dr. Johann Struensee a noble but flawed man given a rare opportunity to improve the lot of the lower classes who are suspicious of him as a foreigner usurping the state. Alicia Vikander is Caroline Mathilde a Welsh princess sent to Denmark in an arranged marriage of noble households with no idea of what's in store for her. This is very good intelligent costume drama that should please fans of the genre. Well worth seeing."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "chiaragiacobelli",
        "review_rating": "7",
        "review_title": "An interesting movie about the history of Denmark",
        "review_detailed_main": "I liked this movie because it is about the age of the Enlightenment in Denmark, usually forgotten by directors and writers. It is not only the story of a king and a queen, but also of their personal doctor, a charismatic figure that had a relation with the queen and brought a big contribution to the development of Denmark. Maybe in some parts the movie is a bit slow and it is not very romantic, what is more the general mood is sad and melancholy, but at the end it is a way to learn something new about the history of Denmark."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "michael_wallace_ellwood",
        "review_rating": "10",
        "review_title": "Truly Excellent.",
        "review_detailed_main": "This was a magnificent film, with stunning performances by the star cast and the supporting roles.\n\nI am not an unconditional fan of Mads Mikkelsen, but he really was strong and convincing in this role.\n\nAnd one could easily forgive the good doctor for falling in love with Queen Caroline, as portrayed by the lovely Alicia Vikander.\n\nAnd one even had sympathy for poor old Christian in the end. I was beginning to wonder whether he was quite as insane as people thought him to be. There seemed to be a genuine friendship between him and Dr Struensee also. Had things gone slightly differently, one could have imagined them forming a happy and successful ménage à trois, and living happily ever after.\n\nAnd the villains were truly villainous :-)\n\n(I spotted a few familiar faces from Forbydelsen I and other places, including Søren Malling (Jan Mayer ), and Bent Mejding who was the standing mayor (playing a not dissimilar sort of character)\n\nA very interesting and surprising historical lesson as well.\n\nHighly recommended."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "frankde-jong",
        "review_rating": "7",
        "review_title": "A mad Danish King ... NOT called Hamlet",
        "review_detailed_main": "There are many films about mad kings. Examples are \"Hamlet\" (1948, Laurence Oliver), \"Ludwig\" (1973, Luchino Visconti) and \"The madness of King George\" (1994, Nicholas Hytner).\n\nIn all the above examples the film is about the decay of the king into madness. In \"A royal affair\" the king (Christian VII played by Mikkel Boe Folsgaard) is \"mad\" from the very beginning. Formally he has a lot of power, mentally he does not know what to do with it.\n\nThis situation gives rise to possibilities of manipulation. In the film it is personal physician Johann Friedrich Struensee (Mads Mikkelsen) who takes advantages of these possibilites. At first out of opportunistic motives (the \"illness\" of the king can't be cured so the job of personal physician is an easy one, but one that gives the oppurtunity to share in all the luxury of the court), later out of idealism (implementing a modern reform programme).\n\nFormally Stuensee has no power at all. He is always in danger of falling out of the favour of King Christian VII. Making a lot of enemies in higher circles with his reform program, in the second half of the film there are a lot of courtiers all to willing to promote his fall. The film derives a lot of his tension from this situation.\n\n\"A royal affair\" is a well made movie.\n\nIt is based on the 1999 novel \"The visit of the royal physician\" by Per Olov Enquist.\n\nMads Mikkelsen gives a very good performance as the royal physician, although in my opinion his performance in \"Jagten\" (Thomas Vinterberg) from the same year was even beter.\n\nThe cinematography by Rasmus Videbæk is very beautiful and resembles occasionally that in \"Barry Lyndon\" (1975, Stanley Kubrick). Incidentally in the opportunistic phase the two stories partially coincide. Barry Lyndon manipulates his wife to get access to higer circles.\n\nDirector Nikolaj Arcel seemed well on his way to Hollywood as a result of the success of this film. He did not manage to match this success as a director, but he did manage to do so as a writer, for example with \"Riders of justice\" (2020, Anders Thomas Jensen), also with Mads Mikkelsen."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "kmontgomery-98515",
        "review_rating": "2",
        "review_title": "Skips over the important parts",
        "review_detailed_main": "The acting is superb from everyone. Mikkel Boe Følsgaard, Mads Mikkelsen, and Alicia Vikander are all standouts.\n\nHowever, I must knock stars for historical inaccuracy. With so much focus on the \"affair\" they skip over Struensee's actions. He dissolved the council and took advantage of a mentally ill man in the pursuit of social reform. All of that is lost by framing his imprisonment as mainly from the affair and his belief in reform is lost by him reversing the lifting of censorship. Not to mention they the ending more \"noble\" than it was. The film tries to make a story of power into a story of romance, but even with the great acting I could never forget the truth."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "PadmeAgnes",
        "review_rating": "9",
        "review_title": "Impressive in its beauty!",
        "review_detailed_main": "Love can lead to transformation yet the force of greed and the lack of political skills can bring anyone down even though you have the best intentions and act for the \"greater good\".\n\nIt does not happen very often that I come out of the cinema and completely shut up. It didn't feel like I was listening to a non-English dialogue. Danish felt like a familiar language ... and it was beautiful in this movie.\n\nThough not with splendid clothes like Marie Antoinette, no intense intrigues, no large battle scenes, it was one of the best historic films I have ever seen. Everything was kept \"small\", yet with so much feeling that I could not take sides with any of the 3 main characters. Fair enough, the greedy and backward upper-class angered me much; just can't stand stupidity, especially when it holds back progress and the aim for improvements."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "unimatrix972",
        "review_rating": "8",
        "review_title": "Another royal love story or social statement?",
        "review_detailed_main": "On the surface, this movie is exactly what the title says, you have an unhappily married queen who has an affair under the king's nose with someone in the King's court. However, the interesting aspect of this story is the context. It is the second half of the 18th century, liberal ideals of people like Rousseau and Voltaire spread across Europe, and threatens to break down the old Feudalistic regime.\n\nThe movie is not a documentary on the ruling of Christian the VII, and should not be regarded as such. After seeing it, I went to read about Christian the VII, and found that many details of the era and his regime were omitted in favor of not making a long tiresome movie. Instead the movie focuses on the relationships between the king, the queen and the physician and to their attempt to change the face of Denmark.\n\nThese three characters are played beautifully.\n\nMikkel Boe Følsgaard as King Christian is just superb and fun to watch, as a mad king he is always there even when not the focus of the camera.\n\nMads Mikkelsen as the physician acts for the most part as a calm yet stern person, however, when he does display emotions it has greater impact, and in my view portraits inner-struggle more effectively.\n\nAlicia Vikander as the queen plays her two role quite well, whether it is the passion and stress that go with having a secret affair, or the audacity and charm that goes with fulfilling her royal duties.\n\nFinally, in my view, the movie is another bell ring to remind us that even Denmark, 300 years ago was a country consumed by religion and fear, and that there are always those who believe in such a way of life."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "JohnDeSando",
        "review_rating": "",
        "review_title": "Denmark becomes enlightened but not without some very dangerous liaisons.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "dinirex",
        "review_rating": "6",
        "review_title": "Not that great",
        "review_detailed_main": "This movie is way to focused on the love between the doctor and queen. The movie could easily have been shortened to 1½ hour instead of 2½.\n\nThe acting and the actors are good, no comments there, but the political aspect were nearly nonexistent. We didn't really learn much about the king himself, because the film was so focus on the love affair between the queen and the doctor. Their relationship was a typical Hollywood love story, and I had a hard time connecting with it.\n\nThis movie is a sad and long love story, that is camouflaged by a interesting cover of political affairs in a mad kings life.\n\nThe ending seems to be a \"we're out of movie time, lets wrap it up!\" kind a thing."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "BeneCumb",
        "review_rating": "8",
        "review_title": "Not a trivial costume drama... Well directed and played",
        "review_detailed_main": "Within the last decades, Denmark has become the leading film country around the Baltic Sea, several films have been praised in major festivals around the globe. En kongelig affære is a pleasant supplement to the succession. Based on real events and persons, the film focuses on broader issues than a simple love between 2 powerful persons. Despite some not-so-good characteristic features of the doctor Struensee, his appearance in the Danish royal and executive circles changed the country thoroughly. And today, Denmark is one of the most progressive countries in the whole world.\n\nThe cast is evenly strong - not the leading roles only, but supporting performances as well. Mads Mikkelsen is great as usual, irrespective of the role, but the biggest surprise to me was Mikkel Følsgaard (as Christian VII) - I had never heard about him before; as he managed to win the Silver Bear for Best Actor at the Berlin Film Festival, I am sure he will be used often both in Denmark and internationally.\n\nWell, the total length could have been less, 2 hour 15 minutes included some protracted scenes. Nevertheless, the film is recommended to all those fond of historical palace dramas."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "aequus314",
        "review_rating": "7",
        "review_title": "Nothing is hotter than repression and forbidden sex.",
        "review_detailed_main": "Set in the 1770s; this costume drama is an amorous return to Danish history marked by the Age of Enlightenment. It explores a scandalous affair between German physician, Johann Friedrich Struensee (Mads Mikkelsen) and the Queen of Denmark, Caroline Mathilde (Alicia Vikander).\n\nWhen the main story begins; both protagonists are left-wing progressives living in authoritarian, repressive times that precede the French Revolution.\n\nAs a gesture of political union, young Caroline leaves England to marry King Christian VII of Denmark. But the marriage proves difficult with his mental illness. Soon she resigns to fate, believing her calling in life is reduced to carrying the bloodline for Danish monarch\u0085 until Struensee enters the royal scene.\n\nEmboldened by his adventurous spirit and intellectual views, both Christian and Caroline connect with Struensee—thus setting in motion a chain of reforms that shake the country's cabinet and people. For a brief moment in time, all three are pivotal to radical change including laws that abolish torture and slave trade; initiatives that bring vaccination to the peasants.\n\nBut this film is titled A Royal Affair and let's face it, nothing is hotter than repression and forbidden sex. Struensee is handsome, wild haired, glassy-eyed stallion and Caroline is rosy-cheeked elegance with a twang of defiance. Tender yearning gives way to furtive desires and the place is a tiny room by the back of a hot kitchen.\n\nBut there's a hitch for voyeurs of this salacious affair--beyond being an adulterer himself, Christian (Mikkel Følsgaard in an underrated performance) is actually endearing in some ways. His fondness for Struensee and protectiveness of him in the royal court creates a sympathetic character that makes it difficult for onlookers to turn away.\n\nIn the hands of director Nikolaj Arcel, A Royal Affair recounts one forgotten romance etched in the history of sweeping change inspired by Voltaire and Rousseau. Based on Bodil Steensen-Leth's erotic novel Prinsesse af blodet, this Oscar nominee for Best Foreign Film is an elegant tragedy underscored by human thirst for expression, power, meaning and redemption.\n\ncinemainterruptus.wordpress.com"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Milo_Milosovic",
        "review_rating": "8",
        "review_title": "There really is something rotten in the state of Denmark...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "proud_luddite",
        "review_rating": "6",
        "review_title": "A mixed result",
        "review_detailed_main": "Based on a true story, this historical drama takes place in Denmark in the 1700s. The mentally disturbed King Christian VII has a personal doctor who manipulates some badly needed reforms in the country while showing a great interest in the king's wife.\n\nThis film is in the genre of beautiful European epics that excel in lighting, music, natural settings, and architectural design. There is also a fine story in the great resistance to the political reforms by stodgy, deceitful bureaucrats who abuse religion in manipulative ways.\n\nThis is all admirable except that there is a feeling this has been done before. \"The Other Boleyn Girl\" and the recent version of \"Anna Karenina\" come to mind as examples of royal brutality and upper-class adultery. The history is fascinating but it probably needed a different style to stand out. As it is, it seems it could have been reduced by about twenty minutes.\n\nAn irony is a post-script that explains the history that follows the ending. If this had been included in the film (rather than just a post-script), it might have been a bit more interesting."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "prada-",
        "review_rating": "10",
        "review_title": "What a film!",
        "review_detailed_main": "They do it hundred times better than Hollywood. Oscar nominated. I Recommend."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Horst_In_Translation",
        "review_rating": "6",
        "review_title": "Interesting and well-acted insight into Denmark's royal past",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "rasmushistoriker",
        "review_rating": "4",
        "review_title": "No surprises.",
        "review_detailed_main": "You can either look at what it is, and what it isn't, and in either case, it's hard not to think of the missed opportunities.\n\nWhat it isn't, is an attempt to accurately portray any of the persons, maybe with the exception of the king. They are characters. This goes for any and all \"historical\" movies, but in this case it's even more obvious, since the main protagonist (Struensee) and the main antagonist (Guldberg), are just that. Protagonist and antagonist, ideal and caricature, white hat, black hat. The reason this is especially disappointing, is that both of them, especially Struensee, were really very interesting humans - faults and all. Whilst the movies purports to feature both English, Danish, German and French, the movie has exactly one line in any of these languages, which is really disappointing, since it would have been interesting to show people the multilingual court of the time. Instead of showing us Struensee and Bernstorff as foreigners, we are merely TOLD that they are.\n\nWhat it is, is just a very run-of-the-mill costume drama, with a predictable climax. As I said, the characters are either good or bad. Any and all opportunity of showing inner struggle, for example how Struensee wanted to do good, but ended up grabbing power for himself, is lost. The forbidden romance is simply justified here. The only character to encompass both good and bad is the king himself, swinging from rudeness and lewdness to being adorably naive and brave. It's such a shame that the movie could not have been about him.\n\nAll in all, the movie is wholly unremarkable as far as the story goes, which is really disappointing when you think of the actual story this is based on. I can't help but think: Is this really all they could get from this?"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "jasmina-27519",
        "review_rating": "10",
        "review_title": "From Danmark",
        "review_detailed_main": "Excellent costume design. Great role of Mads Mikkelsen. The actor we want to see in Hollywood productions"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "kosmasp",
        "review_rating": "8",
        "review_title": "Mads for president (or something like that)",
        "review_detailed_main": "A very well made period piece that did quite a lot of things right. Costume design, set design and the other departments are spot on. And when you have actors like Mads M., you know you won't be able to not do good. While this is based on real characters, one can see that it surely must have dramatized a few things (I didn't read up on the story, so it's only guessing).\n\nStill, even with that \"criticism\", the movie and it's clichés does pretty well. It works as a drama and a character study as well. There's not that much violence, which makes a few scenes with blood, work even better. But there is a bit of nudity, so be aware of that, in case that bothers you."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "treeline1",
        "review_rating": "",
        "review_title": "Great movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "blogurious",
        "review_rating": "6",
        "review_title": "Love and its consequences",
        "review_detailed_main": "Circumstances may change, but love is always the same, regardless of time and space. \n\n\"Royal Affair\" is a compelling story about the madness of a King and his inconsistent behavior during marriage and lack of leadership for his country. It's also a look at how the heart of a woman can be painfully divided between duty and an impossible chance for real happiness in a time when honor and religious views are strict enough to lead a wrongdoer to the gallows. It's quite a long movie, but the development is very well carried out, making it a historical pleasure to watch, for anyone who appreciates the genre."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "antontag",
        "review_rating": "10",
        "review_title": "Really worthwhile watching",
        "review_detailed_main": "Overall a great movie - with a very dramatic ending. A beautifully produced, brilliantly acted historical drama. Perhaps a bit long overall as it is a bit slow in the first hour, but the second half of the film really had us glued to our seats and just takes off - just a wonderful tale.\n\nI was really taken by this movie and found it a bit hard to sleep at night as the lack of human rights for the peasants and the common man in Europe really came through - we have come a long way in 200 years !\n\nI thought most aspects of the film were just fantastic- the acting, the costumes,the cinematography, the palace settings all were first rate . Just a wonderful production.\n\nFor those who like historical dramas like \"Anonymous\" and the TV series \"Rome\", you will find a \"Romantic Affair\" well worth watching.\n\nI am not a big Hollywood production fan and for those of you who like a bit of meat on their movies,this is one for you. Not enough of these types movies are made !"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "JamesHitchcock",
        "review_rating": "7",
        "review_title": "Enlightened Despot",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "BeautifulDisaster5287",
        "review_rating": "10",
        "review_title": "A Masterpiece...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "jennyallworthy",
        "review_rating": "10",
        "review_title": "An Intellectual, Sexy Royal Affair",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "blumdeluxe",
        "review_rating": "7",
        "review_title": "A History Film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "dfranzen70",
        "review_rating": "3",
        "review_title": "Doesn't quite wallow in self-importance, but..",
        "review_detailed_main": "Beginning with its generic-sounding title, A Royal Affair - though based in fact - is tepid, predictable, even downright dull, even for a period piece full of great costumes and backstabbing. It's a movie that'll make you check your watch every so often, maybe glance at the exits. It has its moments, and a very good cast, but it lacks strong direction and likable, relatable characters.\n\nIt's the late eighteenth century in Denmark, which is ruled in name by Christian V (Mikkel Boe Folsgaard). He takes British lass Caroline (Alicia Vikander) as his bride, but neither really likes the other. She's pretty; he's insane. Or is he? Anyway, while the two of them stay apart from each other, enter a German doctor named Struensee (Mads Mikkelsen), who's been nominated to be the king's personal physician as a way for members of the Enlightenment - still with me? - to get into the inner royal circle. They succeed, and thus is set up a quasi love triangle between a German, a Briton, and a Dane.\n\nIf you like period pieces in general, I probably don't have to tell you what this is all about. It isn't long before the doctor and the queen take a liking to one another, and it isn't long before the doctor is insinuating himself into the Royal Court - at Christian's behest, it should be noted. Struensee has ideas, you see, reformation ideas. Denmark is not exactly on the leading edge of free thinking, you see; its streets are filled with grime and rats and feces, while the nobility enjoy lavish lifestyles. Struensee aims to change this if he can, and he's able to convince Christian to endorse his ideas.\n\nNaturally, this behavior won't go by unnoticed; the Queen Dowager, the stepmom of the king, wants her son to be the next in line and is quite displeased when the queen gives birth to a boy. And thus the machinations begin to wrest control away from Christian, to divide him from both Caroline and the doctor, and to return Denmark to the Middle Ages.\n\nOf the three characters, it is the king who is the most intriguing, yet director Nikolaj Arcel gives us almost nothing regarding the character's intentions, makeup, wants, likes, and so on. He's a supporting character, taking a backseat to the other corners of the triangle. Early in the movie, we learn a nifty tidbit - the king is a fan of Shakespeare (he and Struensee trade lines) and loves acting in general. Why wasn't this aspect played up at all? I'll tell you right out how that characteristic could have been useful; like Hamlet, everyone seems to think that Christian is mad. And, like Hamlet, the audience isn't sure if he really is. Had that aspect been explored more deeply, we may have had an interesting movie. Instead, poor Christian is relegated to the sidelines, useful only as a tool handled by others.\n\nVikander makes for a lovely queen (from an American perspective, she could be a stand-in for Natalie Portman) and really turns in a fine role. She's a good person who does her best. She's not unlikeable, exactly, but again we don't see multiple layers in her. Although Vikander tries her best, the character is one dimensional, a symbol for beauty and righteousness - but not necessarily strength of character or even convictions, if she has any. She seems destined to be a victim and nothing more.\n\nAnd then we come to Dr. Struensee, a good man thrust into a situation of which he can take advantage. He's a leading voice of the Englightenment, although anonymously, and he can see that with Christian he can do great things. The movie is told mostly from his perspective and how he interacts with the king and the queen. But while we see Christian's madness/acting and Caroline's smiling/gloomy face, Struensee almost never changes his facial expression. It's not that there aren't multiple layers to the man, it's that the layers are equally boring.\n\nThe movie is slow without being pretentious, at least for a period piece. I would call it contrived and predictable if these events hadn't taken place (at least in general). But it seemed that every time Something Big happened, it was only a result of implausible circumstances. Maybe this was all true, but if so the truth is loaded with ennui.\n\nAnd of course, if you don't like period pieces, stay the heck away. There are no surprises, nothing out of the ordinary, plausible or not. A Royal Affair feels like someone entered \"royal love triangle\" into a computer and got a workable script."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "planktonrules",
        "review_rating": "8",
        "review_title": "Interesting.",
        "review_detailed_main": "\"A Royal Affair\" was nominated for the Academy Award for Best Foreign Language film. I would agree that it was a very well made film about some interesting people, though the film was otherwise a rather unremarkable biopic. Good, but I could see why it didn't take the prize.\n\nThe story is about the Queen of Denmark, Caroline Mathhilde--the sister of George III of Britain. And, while some of the small details might not be correct, the story itself is based on her sad and short life. After marrying King Christian VII, she soon realizes he's mentally unstable and rather perverse--and has absolutely no interest in her. It's a lonely life until she falls in love with the King's favorite, a German doctor who eventually becomes the virtual leader of Denmark. What's next? See the film--though I suppose you could just read up on her on Wikipedia! But you probably shouldn't. The acting and quality of the production is very good and quite compelling. A very good film but one that is, at times, a bit difficult to like because the characters in the movie are a bit hard to like--even the 'good' ones."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "sunchick116-872-583383",
        "review_rating": "8",
        "review_title": "Stop taking children away from Alicia Vikander!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "wesawyournoobs",
        "review_rating": "10",
        "review_title": "Wow!",
        "review_detailed_main": "Finally got around to watching this gem over the weekend. Absolutely stunning, both visually and with the story and characters.\n\nI'm impressed! Foreign flicks are killing it right now. I'm surprised this didn't win an Oscar to be honest. It was really well done - superb, really! - and stuck to history very well (well, from the little I've researched it online!).\n\nI highly, highly recommend watching this movie. It was like being transported into a completely different world. It's been a long time since I've watched a movie, and what was 2 hours felt like 15 minutes.\n\nDefinitely worth your time!"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "paul2001sw-1",
        "review_rating": "7",
        "review_title": "18th century Borgen",
        "review_detailed_main": "In the late eighteenth century Denmark, a radical German doctor soothed the mad King, seduced the Queen and governed the country as an enlightened liberal. Understadnably, it didn't last, and Nikolaj Arcel's film tells the story of his extraordinary rise and fall. It's a compelling story, a historical 'Borgen' and the tragedy of a man who ends up assuming an unsustainable position almost by accident; as a film, it's well-acted but also slow, drawing out a tale that can only ever move in one direction. A touch of sympathy for the old guard might have added some depth. It's interesting to think that the British king of the same period also had his own issues with mental health, another story that has been filmed: the politics here is stronger than in Alan Bennet's 'The Madness of King George', but it's not as much fun."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "lmjones90",
        "review_rating": "10",
        "review_title": "I loved this movie",
        "review_detailed_main": "I was looking through new releases on the Internet this movie popped up. It looked interesting to me so I rented it. Wow, i loved this movie. The acting, the costumes, the cinematography was fabulous. It was nice to see a story from another country as the majority of these royal period pieces involved the French or English royals. I think the actor who played King Christian was genius. I think we will see great things from in the future. The actress who played Queen Carolin was also wonderful and the veteran actor, Mads Mikkelson who played the doctor was also wonderful. I was not aware of this story before the movie and it was a sad time in Danish history, but the movie was a wonderful testament to the truth of what happened. Bravo!"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "WillInDenmark",
        "review_rating": "6",
        "review_title": "A little slow, but the actors deliver",
        "review_detailed_main": "I recently watched \"En Kongelige Affære,\" a Danish historical drama that follows the passionate love affair between Queen Caroline Mathilde and her physician, Johann Friedrich Struensee, during the late 18th century in Denmark. While the film boasts excellent performances from Alicia Vikander and Mads Mikkelsen, I found myself struggling with its slow pace.\n\nCaroline Mathilde, forced into a loveless marriage with the mentally unstable King Christian VII, finds solace in her friendship with Struensee, who is hired as the king's personal physician. As their relationship deepens, they work together to implement progressive reforms that benefit the Danish people. However, their actions face opposition from the conservative elements in the Danish court, and their love affair is eventually discovered, leading to their arrest and trial for treason.\n\nDespite my reservations about period dramas from this time period, the film's portrayal of the political and social upheaval of the era was fascinating. The story explores the challenges faced by those who seek to enact change in a conservative society, highlighting the tragic consequences of pursuing personal and political ideals.\n\nWhile the acting in the film is outstanding, with Vikander and Mikkelsen delivering nuanced and emotionally charged performances, the slow pace of the film was a drawback for me. The plot takes time to build up, and while the historical context is intriguing, it may not be enough to hold everyone's attention.\n\nIn summary, \"En Kongelige Affære\" is worth watching for fans of historical dramas and romance, despite its slow pacing. The exceptional acting and engaging storyline make up for the film's shortcomings, and it is an enjoyable viewing experience overall."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "SnoopyStyle",
        "review_rating": "8",
        "review_title": "Well made drama",
        "review_detailed_main": "King Christian VII of Denmark (Mikkel Boe Følsgaard) is a petulant man, weak ruler, and frequents whorehouses. In 1766, he married the British Princess Caroline (Alicia Vikander). He would disdain her company finding her boring. Their lives would drastically change when Dr Johann Struensee (Mads Mikkelsen) is charged to take care of the erratic monarch.\n\nI am not a historian, and I won't get into any accuracy problems. This movie is a dramatic story. It starts with all three lead actors. Mikkel plays the king with the perfect childlike petulance. Alicia is rock solid as Caroline and shows her range as her character loses control. And Mads powers the whole thing with his intensity. There really isn't a bad performance from anybody in this film."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "cultfilmfan",
        "review_rating": "7",
        "review_title": "A Royal Affair",
        "review_detailed_main": "A Royal Affair, which was Denmark's Oscar nominee for Best Foreign Language Film was not only undeserving of the nomination, but according to all these different reviews I have read, I found it to be terribly overrated. It's a shame because the first half of the film is quite good, very good in fact, but once we hit the second to last half, things just start to fall apart. The first half of the film where we are introduced to the three main and most important characters in this saga is perhaps one of the best parts of the film. Each of these characters are very well played by Alicia Vikander, Mads Mikkelsen and Mikkel Boe Folsgaard. The character study here is very good because we see the different emotions, motives and dreams of each of these characters and how they interact and develop among one another is truly fascinating. Another one of the more intriguing parts of the film is Folsgaard's portrayal of King Christian VII. It's interesting because his performance and way of living is larger than life. He has allusions of grandeur and he is so inappropriate and does not behave, or act like a king should. This is probably because of then some undiagnosed medical condition, which to us makes him look like he has some kind of mental illness, or some type of barrier in his life to make him act childlike and as I said before, completely inappropriate and not the right person to be in the type of power, or leadership role that he is in. His outbursts and acts of eccentricities played to perfection by Folsgaard, are fascinating to watch and one of the highlights of this film. Alicia Vikander, as Queen Caroline Mathilde, also does a good job here and through her performance we can see the pain as well as sadness and loneliness of living in this loveless marriage and going day by day having no real purpose, or anything to drive you, or motivate you to get up from day to day. Her portrayal of someone hurting, lonely and lost is played a lot with gestures and body language and I bought right into in and found the performance delivered. When we are introduced to Mads Mikkelsen's character of Dr. Johann Friedrich Struensee, we have a certain curiosity and fascination to him as well. Not a lot is revealed about him at first, but as time goes by we find him to be a very crucial character to this story because of how he befriends King Christian, but also inspires something in him and motivates him to do better for his people and country than he had previously. Also his relationship with Queen Caroline was an interesting aspect of the story as well as it played out at first, but unfortunately it would ultimately lead to the downfall of the film. Dr. Johann is a strong character and with his more left wing type of politics which were considered more radical at that time, it was curious to watch that at times as well. What, I found in the second half of the movie was that instead of building on any real character development, or emotion, I felt the film tried to tell and make us decide what to think and feel by changing the once very good acting and making it a lot more melodramatic and unbelievable as well as using loud bombastic music and scenarios to evoke some type of feeling from us the audience, but unfortunately for me at least, it did not work. Instead, I found myself growing tired and bored with the film because at this part, I found the film dragged quite a bit and it's once good pacing now seemed really slow and actually boring. While, I once cared for these characters and had some type of empathy for them, they now started to annoy me almost and what route the film went, I almost did not care anymore because the characters were just overly dramatized stereotypes and I was not getting any real feeling, or emotion from the film whatsoever. So in the end the film was trying my patience and I just felt no attachment, or enjoyment from it. It's too bad because the first half of the film was so strong and I was really enjoying it and getting a lot out of it, but when it started to get sappy and melodramatic and everything felt forced, then the film lost me. I am sure there is still a large audience who will like this film judging by the Oscar nomination and the glowing reviews from different film websites, but to me it could have been great, but it steered off course and unfortunately ended up only being average entertainment and movie watching."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "badajoz-1",
        "review_rating": "4",
        "review_title": "Rather Dull Historical Biopic that never really convinces",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "dgefroh",
        "review_rating": "9",
        "review_title": "A royal affair is simply ROYAL!!",
        "review_detailed_main": "Every now and then with a little luck, you will run across a little know film, maybe check out some of the reviews on line, and then take a chance and watch it. If that is the case, trust me when I say \"A royal affair\" is a movie that will not disappoint. Looking at most of the reviews on the IMDb web site, you would get the sense that this is a good movie, but something about the era, the fact that there are sub titles, and maybe the title might turn you off, but do yourself a huge favor and watch this one. The story is compelling and hooks you immediately, the acting is superb and riveting, and the drama based on true events in Denmark in the 18th century is spell binding. This movie has garnered nominations for best foreign language film by both The Golden Globe and The Academy Awards, and it is richly deserving of not only the nomination but also the award. People, there are so many bad movies to watch, when a truly good one comes along, please make sure you see this wonderful and moving epic."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "gettingyoustartedtoday",
        "review_rating": "10",
        "review_title": "A movie to remember",
        "review_detailed_main": "Thoroughly convincing and memorable. The ending was worth every second of this film I cannot praise it enough."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "lasttimeisaw",
        "review_rating": "7",
        "review_title": "Arranged marriage sucks again!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "inspirelake",
        "review_rating": "9",
        "review_title": "Don't be confused by the title.",
        "review_detailed_main": "The title leads us to think this will be a silly romp. It's anything but. Based as closely as I could find on the true history of events, it's an excellent reminder of those incredible people who change the lives of many.\n\nVery well made and acted, a statement of human rights, truth and also deep betrayals and the horrors of the power that a small handful seem to always hold in tight control until the next fray.\n\nWell worth watching for the very valid history lessons within. Incredible forward thinking people who want to free a nation and a people of the backward slaveries of serfdom, disease and lack of basic hygeine. A very good film. Watch it when you're feeling strong."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "mannin11",
        "review_rating": "7",
        "review_title": "Fascinating story, but....",
        "review_detailed_main": "Nominated for best foreign movie Oscar, this Danish film revolves around the eighteenth century love story between Queen Caroline Mathilde, married to the mad King Christian VII of Denmark, and the court's German doctor Johann Struensee, father to the queen's second child Princess Louise Auguste. Mads Mikkelseen, as the doctor, gives a likable and assured performance as the tragic character who attempted to introduce reforms into the Danish constitution that would have bettered the health and prosperity of the masses and weakened the powers of the aristocracy. Mikkel Folsgaard, as the mad Christian VII, gives a scene stealing performance as the hapless individual unable to control his impulses. His performance is both frightening in its irrationality, yet sympathetic in its vulnerability.\n\nWhich brings us to Swedish actress Alicia Vikander as the central character of Caroline Mathilde, given in marriage to a man she had never met. Hard to say where the fault lies for the inadequacies of her performance -- her lack of experience as an actress or with the director, who should have exerted a much firmer hand. From start to finish Vikander plays her role as though headed down the inevitable path towards doom. If a character is to appear more sympathetic to audiences, then she should begin with a sunny disposition that would instantly have the audience on her side. From start to finish Vikander plays the role like a glum, combative shrew, a totally miscalculated interpretation that offers no shading of any kind. Any royal wife of this time who both verbally and physically assaulted her husband, mad or not, would instantly run the risk of divorce, imprisonment or execution. England's Henry VIII set the bloody example for the manner in which royal wives could expect to be treated if they failed to toe the line. That Caroline Mathilde would have been stupid enough to ignore the perils of such behavior would be foolhardy in the extreme. So who is to blame for this interpretation, the actress or the writer/director Nikolaj Arcel?\n\nThe story itself is both fascinating and eminently watchable -- aided to no small extent by Mikkel Folsgaard's showy performance as the mad king and Mads Mikkelsen as the new-thought foreigner struggling to update a backward country, confronted by an intransigent government dedicated to preserving the past. The direction is fine, the film's look is fine -- if not quite up to the extremely high standard set by similar French period pictures -- which are very hard to match. Alas, alas, while Vikander may very well have some fine performances to give in the future, this one fails to ignite due to the lack of vivacity, charm or sympathy elicited by her character. Her scenes with Mikkelsen, which should have revealed a side of her that would have evoked audience sympathy, are as flat and charmless as all that have gone before. This is simply a one-note performance. How could the director not have seen this?\n\nWould I recommend this movie? Absolutely! There is a lot of hard working talent in evidence and the story itself is enthralling. But you know where the weaknesses lie..."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "ma-cortes",
        "review_rating": "8",
        "review_title": "The true story of a normal man who conquered the heart of the queen and started a revolution.",
        "review_detailed_main": "Centered on the triangle formed by the increasingly crazy Christian VII of Denmark, the enlightened idealist Friedrich Struensee and the young but determined queen Carolina Matilda, the film tells the exciting life of brave idealists who risk everything for the liberation of the people and the exciting and forbidden romance that changed an entire nation. Eccentric king Christian (Mikkel Boe Følsgaard) soon gains a fast companion with German Dr. Johann Struensee (Mads Mikkelsen) , a quietly idealistic man of the Enlightenment. As the only one who can influence the King, Struensee is able to begin sweeping enlightened reforms of Denmark through Christian, even as Caroline (Alicia Vikander) falls for the doctor. From 1770 to 1772, his court physician Johann Friedrich Struensee was the de facto ruler of the country and introduced progressive reforms signed into law by Christian VII. They changed a nation forever !. Their love affair would divide a nation!. Their passion changed a nation forever !.\n\nAn epic and dramatic love story based on historical events. The film was nominated for Foreign Language Film at the 2013 Oscars, starring the increasingly popular Mads Mikkelsen (Hannibal, The Hunt) and the up-and-coming Alicia Vikander as the queen who falls secretly in love with her physician - and together they start a revolution that changes a nation forever. Vikander skillfully demonstrates her initial acting qualities before she became an international star and married Michael Fassbender. And special mention mention for Mikkel Boe Følsgaard who steals the show as the insane and erratic king Christian VII. The motion picture was competently directed by Nikolaj Arcel. He is a notorious writer/director of known films as \"Milennium\" saga, \"Island of lost souls\", \"Department Q : a conspiracy of Faith\", \"A Royal Affair\", among others. Rating : 7.5/10. Above average.\n\nAdding more events to those already explained in the film: Christian VII (29 January 1749 - 13 March 1808) was King of Denmark and Norway and Duke of Schleswig and Holstein from 1766 until his death in 1808. Christian VII's reign was marked by mental illness and for most of his reign, Christian was only nominally king. His royal advisers changed depending on who won power struggles around the throne. The young king married his first cousin, the 15-year-old Princess Caroline Matilda of Great Britain, in a dynastic marriage. They had been betrothed already in 1765. Her brother, King George III of Great Britain, was anxious about the marriage but not aware that the bridegroom was mentally ill. The marriage was unhappy, and after his marriage, the king abandoned himself to the worst excesses, especially sexual promiscuity. In 1767, he entered into a relationship with the courtesan Støvlet-Cathrine. He ultimately sank into a condition of mental stupor. Symptoms during this time included paranoia, self-mutilation, and hallucinations. Queen Caroline Mathilde gave birth at Christiansborg Palace to the royal couple's son and heir to throne, the future King Frederick VI. The progressive and radical thinker Johann Friedrich Struensee, Christian's personal physician, became his advisor and rose steadily in power in the late 1760s to de facto regent of the country, where he introduced widespread progressive reforms. Struensee was a protégé of an Enlightenment circle of aristocrats that had been rejected by the court in Copenhagen. He was a skilled doctor, and having somewhat restored the king's health while visiting the Schleswig-Holstein area, he gained the king's affection. He was retained as travelling physician and accompanied the entourage on the king's foreign tour to Paris and London via Hannover from 6 May 1768 to 12 January 1769. He was given the title of State Councilor on 12 May 1768, barely a week after leaving Altona. The neglected and lonely Caroline Matilda entered into an affair with Struensee. From 1770 to 1772, Struensee was de facto regent of the country, and introduced progressive reforms signed into law by Christian VII. Struensee was deposed by a coup in 1772 after which the country was ruled by Christian's stepmother, Juliane Marie of Brunswick-Wolfenbüttel, his half-brother Frederick, and the Danish politician Ove Høegh-Guldberg. Struensee was deposed by a coup in 1772, after which the country was ruled by Christian's stepmother, Juliane Marie of Brunswick-Wolfenbüttel, his half-brother Frederick, and the Danish politician Ove Høegh-Guldberg. From 1784 until Christian VII's death in 1808, Christian's son, later Frederick VI, acted as unofficial regent."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "filipemanuelneto",
        "review_rating": "7",
        "review_title": "A good European film",
        "review_detailed_main": "Based on true events, this film depicts the life and marriage of the Danish King Christian VII with the British princess Carolina Matilde, and her love affair with the court physician Dr. Struensee. Directed by Nikolaj Arcel, this European film, Oscar winner for Best Foreign Language Film, has a screenplay by Rasmus Heisterberg and Nikolaj Arcel. The cast is headed by Alicia Vikander, Mads Mikkelsen and Mikkel Boe Følsgaard.\n\nRoyal weddings have always been source of controversy throughout history, mixing romance with politics or, most often, completely excluding love and giving rise to numerous extramarital affairs with the children that resulted from them. This is one of those cases, fueled by the youth of a dreamy Queen and the revulsion that she developed by her husband, a mad king endowed with an obscene and repulsive behavior. The actors fulfilled their roles well, but Alicia Vikander stood out throughout the film, managing to impress the audience with the dreams and illusions of her character, in a route towards a tragic destiny. Mikkel Boe Følsgaard also shone in the king's role, showing us, thanks to a superb interpretation, not only a mad king but a very sick and troubled man, torn between his uncontrollable appetites and his duties as absolute monarch, innocent as he cannot control himself. Mads Mikkelsen also did an excellent job, but was less convincing in his role. His Struensee seems more interested in changing the country's laws than to live a romance with the Queen. The way the actor thought his character suffers from lack of passion and romance in the way he counter-acts with Vikander. It seems that Struensee also sleeps with the Queen for convenience, not for having in love with her.\n\nThe scenarios are excellent and can perfectly acclimatize history in the country and the palace. The use of computerized effects to show, early in the film, the arrival of the Princess's ship to the Danish harbor, is the scene that mostly disengages from the rest of the film. It simply odds with everything else and it would be preferable to represent this moment in another way. The soundtrack complied well with its role, and the sad melodies that fill the film are truly remarkable."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "lee_eisenberg",
        "review_rating": "10",
        "review_title": "watching these productions makes me wonder why anyone would want to be part of the monarchy",
        "review_detailed_main": "I knew practically nothing about the history of Denmark's monarchy prior to watching \"En kongelig affære\" (\"A Royal Affair\" in English). That did two things for me. First, it made the movie all the more impressive and fascinating; it's clear that the cast and crew put their all into this movie.\n\nThe other thing is that it reinforces something that I wondered while watching season 4 of \"The Crown\": why does anyone want to be part of the monarchy? Much like how \"The Crown\" made Diana look absolutely miserable in her marriage to Charles, \"A Royal Affair\" shows Caroline's unhappiness in her marriage to the mentally unstable Christian VII. No wonder she had an affair.\n\nAnyway, it's a fine piece of work. Even if you know the story, you're sure to love every part of this movie. Hell, I may have studied world history extensively, but watching movies about important events in history makes me realize how much I still DON'T know about world history.\n\nMads Mikkelsen, Alicia Vikander and Mikkel Følsgaard put on outstanding performances, with great support from the rest of the cast. Godt klaret, Nikolaj Arcel!"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "petarmatic",
        "review_rating": "7",
        "review_title": "I love these kinds of period dramas!",
        "review_detailed_main": "I love these period dramas.\n\nThey are nice and mellow. Just as those times were.\n\nIn this particular one plot is rather interesting, they follow mad Danish King Christian VII and his wife. I knew quite a bit about them, but this film opened all of it for me. I loved the plot, it has a quite a dose of humor to it, and it is showing well Enlighment period in Danmark. It is not like I would die without knowing how is went that period, but since I like European history, I always like to watch films they make about it.\n\nActing was excellent, from the portrayal of the King, Council, the Doctor, all actors were up to par with an excellent costume drama.\n\nI also want to emphasize how excellent were the costumes and music. Compliment to the people working on it.\n\nAll in all if you like costume dramas this one is for you."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "stensson",
        "review_rating": "5",
        "review_title": "Costume drama reaches Denmark",
        "review_detailed_main": "It's of course easy to make something out of this subject. Dr. Struensee arriving in Denmark to treat the crazy king Christian in the 1760s and starting an affair with queen Catherine. Struensee finally becomes the most powerful man in the country, but the court conspires, like they were in Verdi's opera \"Rigoletto\".\n\nWe have the good ones and the bad ones and it's pretty obvious who is who. You can't blame von Trier's script to go deep under the surface. Another problem is a too modern way of acting, like the creators underestimate the audience and really really really want us to understand.\n\nThese two hours and fifteen minutes go rather fast, but someway, this is too much costume and too little real drama."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "3xHCCH",
        "review_rating": "8",
        "review_title": "A Royal Love Triangle",
        "review_detailed_main": "\"A Royal Affair\" is about exactly what its title tells us. Caroline is an English princess who was married off to the King of Denmark, in fulfillment of her childhood dreams. They meet for the first time when she went to Denmark, but she was distressed to discover that her husband Christian is not of completely sound mind.\n\nAfter her first child was born, and wallowing in constant loneliness, Caroline begins the titular royal affair with Struensee, the court physician, who was also Christian's best friend and adviser. Caroline and Struensee not only share romantic love, but also a passion for political reform. Struensee uses his very influential position to institute radically progressive policies which eventually revolutionizes Denmark society.\n\nNeedless to say, this is the first time I have ever seen anything about Danish history, so I was enraptured -- not really about the affair, but more about the interesting stories of political machinations and social reformation told in this very fine film. The lavish costumes, elaborate set design and moody music were all perfectly attuned to the period depicted. The cinematography was very dramatic and well-polished.\n\nThe acting was top-notch from all three angles of the troika. Young Swedish actress Alicia Vikander was very classy and believable as Caroline. She reminded me of Emily Blunt's performance in \"Young Victoria\" the previous year. Famous Danish actor Mads Mikkelsen plays Dr. Johann Struensee with subtle passion. He does look a lot older than Caroline so the romantic chemistry seemed somehow strained, especially at the beginning. It does grow on you later though, as the more political aspect of their affair gains more screen time. As the cuckolded king Christian VII, Mikkel Boe Følsgaard delivers a finely nuanced performance as he struggled to balance his madness with some semblance of sanity.\n\nI highly recommend this film for all film fans who love historical films. This is a rare look into a renaissance of sorts in Danish political history borne out of personal liaisons among the key characters in the reform movement. The story-telling style of director Nikolaj Arcel is tight and engaging. It will keep you interested up to the end, especially with the inspired performances of all his actors."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "suciusebastiian",
        "review_rating": "10",
        "review_title": "An excellent Danish film",
        "review_detailed_main": "I am going to start by telling you that this is the first review I am publishing here, on IMDb, and I must say I am very lucky to have discovered, on this occasion, this Danish cinematographer who seems very promising and from whom us, the generation raised by Hollywood, have so much to learn.\n\n\"En kongelig affaere\" (which is Danish for \"A royal affair\" - this has also given me the privilege to notice how beautiful this language is, a fine combination between English and German) is truly invaluable for history buffs and not only. Its story presents us the 18th century Danish society, a society ruled by the Church's superstitions and by its and the nobles', as well as by all those close to king Christian the Seventh's abuses. Johan Struensee (played by the astounding Mads Mikkelsen.) is the royal family's doctor. As a cultivated character with a vanguard mentality, he never hesitates, when given the chance, to put into practice, with the help of the great influence he gradually acquires at court, ideas inspired by the likes of Rousseau and Voltaire, classical Enlightenment writers, contributing, by doing so, to Denmark's modernization and prosperity. He slowly becomes the king's adviser (who suffers of an extremely rare disease which consists in repeated nervous breakdowns and constantly getting into a state of madness), only to turn later on into the queen's lover. This film is going to leave you breathless and have you be delighted by every single minute you spend in front of the screen. Enjoy!"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "ferguson-6",
        "review_rating": "7",
        "review_title": "An Age of Enlightenment",
        "review_detailed_main": "Greetings again from the darkness. I would venture a guess that most are as uninformed as I about this brief, but altogether impactive and fascinating period of history in Denmark. The story is bookended with the (late 17th century) letter that a seriously ill and deposed Queen Caroline sent to her children, the eldest who would later become King Frederick VI. Director Nikolaj Arcel co-wrote the script with Rasmus Heisterberg (the two also collaborated on the original The Girl with the Dragon Tattoo), and present insight into a most bizarre love triangle and power struggle that instigates national change ... and then a severe reversal ... and then change again.\n\nWe meet the luminous Caroline (Alicia Vikander from Anna Karenina) as she is traveling from England for her initial meeting with her new husband, King Christian VII of Denmark. Unfortunately, this intellectual and talented woman is stuck with a mentally unstable and childlike spouse. Once she fulfills her duty by delivering a son, the chamber visits are cut off and the two live mostly separate lives. The king is manipulated and controlled by the court and mostly just does what he is told to do, and signs what he is supposed to sign. This keeps the aristocracy fat and happy, while continuing the harsh policies against the poor peasants.\n\nA local doctor is arranged for the king's European tour and we discover that this doctor has learned how to co-exist and gain the trust of the odd king. What few know is that this doctor ... Johann Struensee is a revolutionary thinker and follower of Voltaire and Rousseau. He seeks social reform in Denmark and soon schemes with the idealistic queen to use Christian as their mouthpiece and gain control of the court.\n\nIt's not long before Caroline and Struensee are sharing much more than ideas, and the big question is ... will their downfall be their ideas for enlightenment or their dangerous love affair? Speaking of the love affair, it bears mention that this is one of those rare, believable stories of true soul mates. Most movies, especially costume dramas, have us believe that soul mates are created by an exchange of glances across a crowded room. Here, the love between these two grows in step with their ideas for social reform. In other words, there is more than lust between Caroline and Struensee.\n\nSometimes the story gets a bit muddled between the love affair and the political maneuvering, but it's not difficult to imagine that this was a real struggle during this period. These are real people with real issues and it's a pleasure to watch the tangled web.\n\nMads Mikkelsen is known to most as the villain Le Chiffre in Casino Royale. Here he captures the nuances of Dr Struensee as both a revolutionary figure and an illicit lover. Alicia Vikander is clearly on the verge of stardom and is wonderful as the complex Caroline. The real scene stealer here is Mikkel Boe Folsgaard as Christian. This key role could have easily spoiled the film in the wrong actor's hands. Instead he balances the mental issues with enough doubt that we viewers are left wondering how much is illness and how much is insecurity ... just how much did he understand?\n\nThis is a very well crafted, if somewhat conventional film that tells a remarkable story from a turbulent time in Denmark. It's a story that deserves a greater audience and this Oscar contender should provide just that."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "estebangonzalez10",
        "review_rating": "8",
        "review_title": "A Beautiful Danish Film",
        "review_detailed_main": "¨I am one of you¨\n\nA Royal Affair is a Danish film that has recently been nominated at the Oscars for Best Foreign Film, and rightfully so. It is my favorite movie in that category so far considering this is a period drama with a great storyline, beautiful production design, and excellent performances from the lead cast. Every period drama seems to focus on the art and production design so much that it sometimes forgets about the importance of the story and character development, but that isn't the case here because despite the careful attention to the art design there was a great story to be told. I felt this was a much more complete film than the recent remake of Anna Karenina, which also happened to star the beautiful Alicia Vikander who has a lead role here. Vikander seems perfect for these roles with her young and angelical face, and she also gives an incredible and strong performance. This movie will open several doors for her, and I expect to see her in many more films in the future. The story is based on historical events that I'm pretty sure every Danish knew about, but I was pleased to be introduced to this period of history. The screenplay was adapted by Rasmus Heisterberg from the novel written by Bodil Steensen-Leth. Heisterberg had co-written the screenplay to the Swedish version of The Girl with the Dragon Tattoo with Nikolaj Arcel, the director of this film. Arcel directs this film with great craft balancing out the technical aspects with the detailed historical events that took place in this 18th century tale. This felt like a great history lesson for me (and an entertaining one at it) and was satisfied with this period drama thanks to a clever script and some strong lead performances.\n\nThe film takes place in Denmark during the mid 18th century as we are introduced to the young queen, Caroline Mathilde (Alicia Vikander), from Britain who is to be married with the Danish King, Christian VII (Mikkel Boe Folsgaard). She has never seen the King or knows what he is like, but royal arrangements have already been made for their marriage as she travels to Denmark to meet her husband. Upon arriving in this new land she discovers that the King is not very fond of her, he seems a little childish and giggles nervously. He receives his dog with much more love than he receives her. Caroline is resigned to live her life this way until she meets the royal physician, Johann Struensee (Mads Mikkelsen), who happens to share her same beliefs and ideals. Europe was in a state of transition as The Enlightenment movement was revolutionizing the Dark Ages with new ideas from Voltaire and Rousseau, but Denmark remained tied to the Middle Ages with their traditions. The council, formed by noble men and clergy, was running everything and Christian VII was only the puppet signing the documents. Upon the arrival of Dr. Johann Struensee, a German intellectual influenced by the enlightenment philosophy, things began to change in the Kingdom as he greatly influenced the King. Although at first he spent most his time fooling around with the King and winning his trust, he ends up falling in love with Caroline and begins to have an affair with her. Caroline realizes that Johann has a great influence in the King so she asks him to use that confidence to gain more power in the council and revolutionize the nation with humanitarian ideals. Of course Johann's influence on the King isn't welcomed by the noblemen who will do what it takes to regain their power.\n\nA Royal Affair stands out from other typical romantic triangles in that here there is really no interest from one party. The King doesn't love his wife, and prefers to spend time with Johann fooling around. He calls his wife mother because he believes she is no fun at all. The affair would have gone unnoticed by everyone if it weren't for the brave ideals that Caroline and Johann came up with in order to start a revolution. This is what upset the noblemen who found a way to distance the King from his physician, and this is where the tension begins to escalate in the movie. That is also what makes the romance so risky and torrid, and in a way makes the story so juicy. The film is really engaging and entertaining, and works wonderfully as a period drama. The script is very clever and introduces several quotes from Rousseau and Voltaire who were a great influence in that time period. Perhaps the films ends up being a little too predictable, but it does so because it sticks with the historical facts and that is pretty much how things happened. I thought the film ended in a rather hopeful note despite it not having a happy ending. Mads Mikkelsen, Alicia Vikander, and Mikkel Boe Folsgaard stand out in this film with some terrific performances and make this film stand out above the rest.\n\nhttp://estebueno10.blogspot.com/"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "AvidClimber",
        "review_rating": "7",
        "review_title": "A Royal Affair — Intrigues, machinations, and a queenly love affair in the 18th century",
        "review_detailed_main": "A Royal Affair is what is says, a royal indiscretion. Whether or not it's matches real events is beside the point, the end is as predictable as history.\n\nThat being said, the rest of the story is quite interesting, especially the evolution of the king and his portrayal. The sets are superb, the costumes are rich, and the score well made.\n\nHowever the intrigues and machinations should have played a bigger role, and the love affair felt almost like an afterthought. The result is a certain lack of focus.\n\nIf you like sad historically based movie about kings and queens, you'll like it."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Vincentiu",
        "review_rating": "10",
        "review_title": "masterpiece",
        "review_detailed_main": "not only for script or acting - Mikkel Boe Folsgaard does an amazing role - but for the force of message. because it is not really a page from Danish history, a cruel love story, brilliant picture of a society metamorphose, about ideal, courage, fear or madness but rare reflection of contemporary world. it is a masterpiece for the science to be more than an artistic creation but wise occasion to reflect to politic selfish impact, to the price of fragile victory and for the last words of a person who has deep desire not to explain pieces of a time roots but to give sense of hope. images, atmosphere, the new demonstration of Mads Mikkelsen art, Alicia Vikander in an embroidery-role, each detail, the dialogs makes this film a splendid event."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "m-abtahi",
        "review_rating": "7",
        "review_title": "Love, Power, and Revolution - A Royal Affair",
        "review_detailed_main": "A Royal Affair (2012) is a captivating Danish historical drama that explores the intersections of love, power, and enlightenment during the 18th century. The story follows a young English princess who marries the mentally unstable King of Denmark, finding herself trapped in a court dominated by a rigid and oppressive Christian orthodoxy.\n\nAmid this turmoil, a progressive German physician, Johann Friedrich Struensee, becomes a trusted advisor to the king and a pivotal figure in the queen's life. Inspired by the ideals of the Enlightenment, the physician, with the queen's support, works to lift censorship, empower civil society, and usher in a wave of reforms. However, their efforts lead to an unexpected and dangerous conspiracy that threatens everything they have fought for.\n\nWith its stunning performances, particularly by Mads Mikkelsen and Alicia Vikander, and its compelling narrative, A Royal Affair is a thought-provoking and visually rich portrayal of passion, politics, and the pursuit of change. This beautifully crafted film is both historically significant and emotionally resonant, making it a must-watch for fans of period dramas and political intrigue."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "doug_park2001",
        "review_rating": "10",
        "review_title": "The Dawn of Enlightenment Breaks Through the Windows of Christiansborg Palace",
        "review_detailed_main": "While obviously for fairly mature tastes, A ROYAL AFFAIR is a film that has it all.\n\n--An engaging and compelling plot: Even if a film about the 18th-century Danish monarchy doesn't sound so thrilling, it is. Much suspense of the slower, more intelligent kind. Complex but clear layers. Romance and some sex.\n\n--Fine acting by all of the major and minor players. Mikkel Boe Følsgaard as mad King Christian VII convincingly (and amusingly) steals the show. Alicia Vikander and Mads Mikkelsen also give very memorable performances. Great costume design as well.\n\n--A lucid illustration of the purpose and effects of the Enlightenment, showing it rather than telling it and never becoming heavy-handed or preachy.\n\n--Nice blend of moods: poignant and melancholy in places, laugh-out-loud funny in others, but always straightforward and realistic.\n\nI could on and on here, but suffice it to say that A ROYAL AFFAIR is a wonderfully rich experience and one of the best all-around films I have seen in quite a while."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "l_rawjalaurence",
        "review_rating": "7",
        "review_title": "Costume Drama with Racist Overtones",
        "review_detailed_main": "A ROYAL AFFAIR has distinct intertextual links to Nicholas Hytner's THE MADNESS OF KING GEORGE in its portrayal of a mad king (Mikkel Boe Følsgaard) who prefers his dogs and mistresses to marriage to a 17-year-old British heiress Caroline Mathilde (Alicia Vikander). Both of them develop a close relationship with German physician Johann Friedrich Streuensee (Mads Mikkelsen): the king regards him as his closest adviser, while the young queen falls in love with him. Eventually that \"royal affair\" proves the undoing of both Caroline and Streuensee.\n\nTold in flashback by the now-banished Caroline, A ROYAL AFFAIR creates an unsympathetic picture of Danish court life in the mid-eighteenth century, one where the King is ruled by his cabinet, and where intrigue is rife. No one can ever be sure of their jibs, especially when the King is so eccentric; but while they are in power, they exploit his weaknesses for all they are worth. The Danish court are explicitly racist in their attitudes; not only do they mistrust Streuensee for his closeness to both monarchs, but they resent his presence on account of his Germanness. The only way to force him out is to insist that he does not \"think like\" a Dane, and therefore cannot be allowed to influence government policy. While the King stoutly supports Streuensee, he lacks both the guile and the self-possession to protect him.\n\nShot on location in the Czech Republic as well as in Denmark, Nikolaj Arcel's film creates a claustrophobic world in which every gesture can be interpreted as political. The environment is as formal as the costumes; no one can ever have sufficient temerity to speak for themselves. The exterior shots are familiar from most Anglo-American costume dramas (carriages pulling away from stately buildings, elaborately costumed balls etc.) but here they are invested with added meaning, as many of the landscapes outside the court appear both bare and poverty-stricken. Clearly the King and his courtiers are too preoccupied with their own intrigues to worry about the people.\n\nThe pace is slow-moving, but this gives us a lot of time to focus on the protagonists' expressions - specifically the public faces that they show to the world that mask rather than disclose their true feelings. A ROYAL AFFAIR is a savage denunciation of hypocrisy - although it might focus on the past, its political significance remains significant today."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Irishchatter",
        "review_rating": "1",
        "review_title": "Yawn......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "mikegibb-60418",
        "review_rating": "9",
        "review_title": "Total Danish Class",
        "review_detailed_main": "As a great lover of the likes of The Killing and Borgen I approached this Danish telling of a fascinating period in the country's history with great expectations and I wasn't disappointed. It is sumptuous and beautifully told with a large and hugely impressive cast. After so many dire Netflix films it was a real treat to come across this slab of pure class."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "jerrycope",
        "review_rating": "8",
        "review_title": "breathtaking! A must see!",
        "review_detailed_main": "I thought this movie was going to be another lame history piece. But this movie was one of the best I have ever seen. it took my breath away. The acting it just beautiful. Mads is at the top of his game. I slowly found my self falling in love with him. and Alicia takes your heart. and as far as the filming the camera work and costumes are just breathtaking. So many things about this film that make it beautiful. Its been months since I have seen it and I still find my self going back to it. its been a very long time since a movie has made me feel this way. This film puts Denmark films on my map. I hope that this does as well at the Oscars as it should."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "azadeh-tafreshiha",
        "review_rating": "8",
        "review_title": "Very good movie, very subtle but powerful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "morrison-dylan-fan",
        "review_rating": "10",
        "review_title": "The End of the Affair.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "r96sk",
        "review_rating": "9",
        "review_title": "Big fan",
        "review_detailed_main": "'A Royal Affair' is an excellent film.\n\nI enjoyed it all, every bit, but the ending is what sold it for me - great conclusion, which didn't do the predictable wrap up that I was expecting it to do. Despite running for over two hours the pacing is near perfect, as is the standout score.\n\nThe actors do wonderful jobs. Alicia Vikander is particularly brilliant, as is a fantastic Mads Mikkelsen. Mikkel Følsgaard also brings a strong performance, early on I wasn't fully convinced but by the end he won me over tenfold. The supporting cast are very good too.\n\nSuch a well written and well told story, the whole look of how its brought to life onscreen is superb. It's a breeze to watch all the way through and by the time the third act completes it manages to bring emotion into the mix as well. Big fan."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "kherad",
        "review_rating": "5",
        "review_title": "an interesting intro on the age of enlightenment",
        "review_detailed_main": "The topic is good, but the movie is very slow and sometimes a little dull, it would have helped if they had a few more minutes of Fredrick at the end instead of some text on screen saying what would happen subsequently to the court and Johan's reforms. The performance is good, specially audience receive a very human narrative on king, Christian, but it would have had helped if some insight into his childhood had been added at the beginning. The performance is good, specially audience receive a very human narrative on king, Christian, but it would have had helped if some insight into his childhood had been added at the beginning."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "dan_pap",
        "review_rating": "8",
        "review_title": "satisfy your game of thrones withdrawals",
        "review_detailed_main": "\"I'm one of you! I'm one of you!\"\n\nA Royal Affair is a true story about a love affair between Queen Caroline Matilde of Denmark (Alicia Vikander) and the German Dr. Struensee (Mads Mikkelsen). The two attempt to influence their mentally incompetent king (Mikkel Boe Følsgaard) to spread their Enlightenment ideas.\n\nI found the story itself to be quite remarkable. I researched the source material that this movie is based on for quite awhile after I watched it. Almost everything in the film is historically accurate. It's rare to come across a historical event where almost every character and situation is literally made for cinema.\n\nThe filmmakers try the best they can to displace the audience into the eighteenth century. The goal is to make this almost entirely authentic. The costumes and music are impressive, and also add to the artistic cinematography. The language used in the film also changes to stay true to the characters. Caroline, born British, speaks English at times, while most of the rest of the characters speak pure Danish.\n\nI can't say enough about the acting. Alicia Vikander is perfect per usual, Følsgaard is convincingly mentally ill, but Mikkelsen is probably the best. I've never seen Mads Mikkelsen in a legitimate film before, but A Royal Affair has convinced me that he's an actor I may want to watch more often.\n\nThe chemistry between the characters is worth exploring as well. The main character is supposed to be Caroline Mathilde, but there is an equal emphasis on the others as well. The main three characters are rarely seen together. Rather, we see them in pairs. Struensee adjusts his persona to match the people he's with, and the given situation. The movie shows all the characters as tragically flawed human beings, and presents no protagonist. They are all victims to their circumstances. This is a bizarre way to present a modern film, but the presentation of the characters is my favorite part.\n\nThere's a lot to be analyzed about this film. This one will probably have me thinking and researching for the next several days. I'm always a sucker for a good period movie, and this one is unbelievable. If you're into a good historical political drama to satisfy your Game of Thrones withdrawals, A Royal Affair is a perfect way to start."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Sergeant_Tibbs",
        "review_rating": "8",
        "review_title": "A rich period drama with enticing and complex characters and unique situations.",
        "review_detailed_main": "It's been a good 6 years since I've paid attention to Mads Mikkelsen, for his uniquely menacing villain in Casino Royale, now he returns in 2012 for a promising two-punch of A Royal Affair and The Hunt. I'm yet to see the latter, though it is my few most wanted of the year left along with Once Upon A Time In Anatolia but the former certainly lives up to his hype lately, with a fantastic subtle film-stealing performance. A Royal Affair belongs among a flavour of period dramas which are desperately tedious but its story and performances make it incredibly compelling. While it doesn't have the eccentricities of Amadeus (although Folsgaard's King Christian feels very inspired by Hulce's Mozart) or the elegance of Barry Lyndon, it certainly comes close to their level of richness. The cinematography and production design are excellent, with an interesting and great use of a shallow depth of field for a period drama. Even though the narrative begins with the soon-to-be Queen and then abandons her when Mikkelsen's doctor becomes involved, the sequences thereafter are fascinating, unique and complex as he manipulates the King to have Denmark follow his views and the film keeps its hold til the very end. While it may be overlong, it's certainly one of the best films of the year.\n\n8/10"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "cluciano63",
        "review_rating": "8",
        "review_title": "Well done story based on fact",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "valis1949",
        "review_rating": "9",
        "review_title": "This Guy's In Love With You",
        "review_detailed_main": "A ROYAL AFFAIR (dir. Nikolaj Arcel) A superb historical drama set in the 18th century court of Danish King Christian VII, and focuses on the affair between the king's wife, Caroline Matilda of Wales, and the eminent social reformer, Dr. Johann Struensee. The love affair between the lonely young queen and the royal physician is certainly the prime focus of the plot, yet it also works as a sublime examination of how ideas of the Age of Enlightenment changed the conservative views of European aristocracy. After being persuaded by the Oldenburg court to control a mentally unstable king, Dr. Struensee becomes the de facto regent of Denmark, and is able to initiate social welfare programs that benefit the people, but resulted in higher taxes on the wealthy. For this, he is deposed and later beheaded. The film works both as a beautiful love story, and also a captivating political thriller. MUST SEE"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "kunal-gautam",
        "review_rating": "8",
        "review_title": "A Gripping Tale!",
        "review_detailed_main": "An excellent period drama with a gripping story-telling style. I didn't really know of the story beforehand (checked on Wiki later to confirm details); so despite the screenplay being a little slow, I found it quite gripping and enjoyed it. The details in the movie seem to conform well with historical facts. It gives a peek into the past, the history of aristocracy; how the power was captured, abused at the cost of common people and how far mankind has come in just a couple of centuries! A kind of movie that you end up thinking about afterwards. Powerful performance by Alicia Vikander; Mads Mikkelsen, Mikkel Boe FølsgaardIts were good as well."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "gradyharp",
        "review_rating": "10",
        "review_title": "'Something's rotten in the state of Denmark...'",
        "review_detailed_main": "The Danes have done it again! A ROYAL AFFAIR (En kongelig affære) is a brilliantly executed and performed step back into history that succeeds on every level. Based on historical fact and the Bodil Steensen-Leth novel 'Prinsesse af blodet' as adapted for the screen by Rasmus Heisterberg and writer/director Nikolaj Arcel, it blossoms from the opening touching moments to the grand and gory closure.\n\nThe story can be summarized as follows: In 1767, the British Princess Caroline Mathilde (Alicia Vikander) is betrothed to the strange and deranged King Christian VII of Denmark (Mikkel Boe Følsgaard), but her life with the near bipolar monarch in the dank and dark kingdom becomes oppressive: Caroline is disliked by the dowager queen Juliane (Trine Dyrholm) and her confidant Ove Høegh-Guldberg (David Dencik) who both would prefer Christian be de-throned, and Caroline must submit to the somewhat distracted and loony acting king on her first night in the palace - but the king's interest soon lags for want of prostitutes and frivolous parties. However, Christian soon gains a fast companion with the German Dr. Johann Struensee (Mads Mikkelson), a quietly idealistic man of the Enlightenment. As the only one who can influence the King, Struensee is able to begin sweeping enlightened reforms of Denmark through Christian even as Caroline falls for the doctor. However, their secret affair proves a tragic mistake that their conservative enemies use to their advantage in a conflict that threatens to claim more than just the lovers as their victims.\n\nThe cast is extraordinarily fine, not only the three main characters (Mikkel Boe Følsgaard finds just the right delicate balance for Christian's moments of sanity and flights of lunacy) but all members of the court and the masses of people living in the last country to move into the age of equality of all peoples. The story is beautifully photographed by Rasmus Videbæk, the stunning costumes are by Manon Rasmussen and the important musical score is in the capable hands of Gabriel Yared and Cyrille Aufort. Though the film is lengthy it is so rich in history and passion that it moves very quickly. Highly recommended, especially for lovers of historical drama.\n\nGrady Harp"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "DICK STEEL",
        "review_rating": "10",
        "review_title": "A Nutshell Review: A Royal Affair",
        "review_detailed_main": "The title would have you think that this is yet another bedroom scandal within one of many royal families of old being put on screen. Well, it's that, and actually a lot more, with Danish filmmaker Nikolaj Arcel taking a look back in the history of the country in the 18th Century, under the rule of King Christian VII (Mikkel Boe Folsgaard), a volatile man for his rumoured mental illness, told from the view of his Queen Caroline Mathilde (Alicia Vikander) from England, which inevitably covered the titular affair with the Royal Physician Johann Friedrich Struensee (Mads Mikkelsen), a German seen to be wielding too much influence on both the King, Queen, and his hundreds of reforms introduced by being de-facto regent.\n\nIf focused alone on the affair, then we'd see how Caroline, promising and every bit the lady a Queen ought to be, got quickly put in her place quite unceremoniously by none other than her King and husband, and a rather public one at that. In fact, everything went southwards in their relationship, with the King having mental issues, and a penchant for womanizing. One can feel for Caroline being short-changed, thinking that her royal life in the Danish household was one that was a walk in the park. In comes Johann from one of King Christian VII's European tours, with whom he shares a trusted bonding with since he's able to address, at times pander, but most times handle, the King's mood swings and erratic behaviour, and soon enough Johann's attention and mutual attraction with the Queen, led to a very physical affair that would be exposed once she got pregnant.\n\nFor those not interested in bedroom stories, this sprawling epic also covers the requisite power struggles within any royal household, with tales of jealousy, greed, and that of ineptness and corruption all rolled into one. It provided an insight to the process where bills got passed, which were ultimately signed by the King, and how this can usually be circumvented by the powers of the few noblemen, for their interests to be passed by the going through of the motions. There was a comment made at one point late in the film that dealt with religion being mixed together with politics, but may be felt as a little bit too late, since it's likely the filmmakers didn't want a certain vocal supporting character to be felt like he's bring targeted because of his background.\n\nAnd if reforms is what you're interested in, Johann's subscription to the Enlightenment movement, being responsible for many reformative ideas being bandied around the land, becomes something on interest in the film as well. It shows how change can come from within, but only if you have someone on the inside willing to make and be the change put forth. The ideas introduced are far-ranging, from the abolishing of the peasant system, the abolishing of torture to things like freedom of the press and the abolishing of censorship, though it somehow did a balancing act when these powers return to bite its master's hands. So it's like a two edged sword, where freedom got provided, and the same freedom being used by the opposition to try and bring one down.\n\nSwedish actress Alicia Vikander makes for an arresting Queen, where you would be able to feel her willingness to risk everything for that level of affection, attention and closeness she craves when she lacked a proper support structure within the royal family. Mads Mikkelsen plays that charismatic doctor, and made it believable with his strong conviction of wanting to improve the lives of people, despite being judged most of the time as an outsider, and a meddler who has the ears of the kings. How he got dealt with in the end was rather ironic, and goes to show the fickleness of people, especially the masses, when it's easy for them to be manipulated to feel in a certain way, which is fair game, really. And rounding up the key trio in the film is Mikkel Boe Folsgaard as King Christian VII, an almost man-boy king of sorts who prefers to play than to rule, and is often tethering on the edge of some crazed, illogical behaviour.\n\nWith lush production sets, costumes and art direction, requisite essentials for any period movie, all combining perfectly to make it one enjoyable blast from the past, A Royal Affair proved to be a wonderful retelling of the political scene of the time, led by self-interests, the protection of one's turf, the constant lying and scheming for power by the inept, and betrayal all rolled into one. And sometimes, things just don't change that much too, especially when the same qualities get seen elsewhere even in today's day and age. A definite recommend!"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "sergepesic",
        "review_rating": "8",
        "review_title": "Chapter from Danish History",
        "review_detailed_main": "It is a highly difficult feat to tell a proud story from your nation's past. History can be dry and unappetizing subject for a movie. The revered or maligned characters could easily come out as stiff, cardboard figures hard to relate to or sympathize with. Nikolaj Arcel, the director of this film deftly avoids this trap. The story of the beginning of Danish Enlightenment is fresh and involved. Today Scandinavian countries seem to be an example of progress and prosperity, but it obviously wasn't an easy journey. This is a powerful, well told chapter from Danish history, filmed in mostly subdued colors, acted richly and precisely, and in the end leaves the viewer educated and enlightened. Quite an accomplishment."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "robinski34",
        "review_rating": "8",
        "review_title": "An Affair to Remember",
        "review_detailed_main": "Often grim, but always enthralling period piece directed by Nikolaj Arcel, who co-wrote the screenplay for the original Swedish production of The Girl with the Dragon Tattoo. Arcel is favoured by remarkable performances from his leads. The incomparable Mads Mikkelsen is as intense as ever and commands the screen, while Alicia Vikander gives an accomplished performance as the young queen, but Mikkel Følsgaard as 'mad' Christian must be the standout, he is entirely convincing in a role that clearly demanded a considerable range of emotion and temperament. You will recognise many other faces and we should continue to be thankful that Scandanavian cinema is deservedly enjoying so much attention, and broadening our viewing horizons, it is such a rich source of material and talent. 'A Royal Affair' is not an easy watch, like so many historical pieces that chart the lives of monarchs and those around them, there is a thick vein of tragedy running through the story. It is not a film likely to be pulled out on a cold winter's evening for its heartwarming properties, but it is a rewarding experience and should open viewers up to seek others works from Scandanavia's increasingly excellent film industry."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "gillespiesan",
        "review_rating": "9",
        "review_title": "An extraordinarily emotional experience.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "jjedif",
        "review_rating": "8",
        "review_title": "Mikkel Boe Følsgaard for an Oscar?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "napierslogs",
        "review_rating": "9",
        "review_title": "Love, power and enlightenment in the Royal Court of Denmark",
        "review_detailed_main": "A young princess, Caroline Matilda (Alicia Vikander), lived an affluent lifestyle in 1760s England and at age 15 she was shipped off to Denmark to marry King Christian VII (Mikkel Folsgaard). Christian was mentally ill and Caroline did not know. Upon arrival at the castle in Copenhagen, it wasn't long before she understood his mental state. He took to her with force, spoke bluntly and rudely and acted like a child. As soon as Caroline conceived a son, she retreated internally.\n\nBut \"A Royal Affair\" isn't just about the King and Queen. It's also about the struggle for political and societal advancement, counteracted with the evils of power, also counteracted with the freedom of love. Back in England, Caroline had access to knowledge. She learned Italian, French and German and read and appreciated accomplished works. When she arrived in Denmark, her books were shipped back to England. They were under Danish censorship. Caroline wanted those books, and her old life, back; she just didn't know how to get it.\n\nA handful of forward-thinking individuals in the King's Court could see how easily influenced the King could be. He was like a child – he just needed to be convinced that he wanted it. With the King's inappropriate behaviour, it was rather easy to hire a personal doctor for him. Enter Dr. Johann Freidrich Struensee (Mads Mikkelsen). Born to a Lutheran Pastor, trained as a medical doctor, but educated in the Age of Enlightenment, Struensee anonymously wrote books on atheism and social reform. He happily accepted the position as the Royal Doctor; he could already see how to put his radical ideas in motion.\n\nCaroline didn't like anybody in the Royal Court until she spied an \"illegal\" book in Struensee's possession. He was her ticket back to intellectual freedom. Through their affair, shared ideals on how to improve society were born. They both believed in scientific advancement, social equality and medical care for everyone. The King was a good man too, he was just unstable.\n\n\"A Royal Affair\" is the story of how Denmark became the most advanced country in the world, if only for a few days. With enlightenment comes reform, with reform comes progress, with progress comes power, with power comes evil, and evil versus enlightenment is a tough battle that can't always be won. It's a brilliant film with powerful performances, beautiful photography, and serves Denmark well as its entry into the Oscar race."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "angelamiatt",
        "review_rating": "10",
        "review_title": "Emotional",
        "review_detailed_main": "I don't know what to say - I watched because I loved Mads Mikkelsen but the entire film was an emotional roller coaster I didn't know the history so was completely unprepared for the ending! I will now be googling danish history!! Amazing film and really worth a watch"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "valadas",
        "review_rating": "8",
        "review_title": "The Tragedy of Royal Love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "tomgillespie2002",
        "review_rating": "8",
        "review_title": "A tense tale of political intrigue and terrific performances",
        "review_detailed_main": "A Royal Affair opens with a melancholy Princess Caroline Matilda of Great Britain narrating as she pens a letter to her unseen children. Flashing back in time, she is a young and beautiful teenager about to be shipped off to Denmark to marry her cousin, King Christian VII of Denmark, giggling and dreaming about what her new life will be like with a man who sounds like the ideal husband. It would seem that we are in very familiar costume-drama territory, and director Nikolaj Arcel's film makes sure to include all the factors that make the genre so appealing to some: the beautiful young bride; an unknown kingdom; handsome period costumes; a bastard child; and a love affair that is passionate but ultimately doomed. Yet a careful, character-driven approach ensures that A Royal Affair doesn't boil over into overwrought hysterics. What emerges is a tense tale of political intrigue and terrific performances, and a fascinating history lesson to boot.\n\nAs the Princess, played by Alicia Vikander, arrives in Denmark, she immediately encounters her husband not as the gallant artist she expected, but as a nervous man-child, giggling to himself while hiding behind a tree. The King (Mikkel Boe Folsgaard) is a puppet on a throne, and quite clearly mentally deranged. He doesn't take much of a liking to his new Queen, and prefers to spend his free time getting drunk in the company of big-breasted prostitutes. Her optimism is quickly turned into bitterness, and is pleased when her husband decides to take a year off his duties to tour Europe. Shortly after his return, German Johann Struensee (Mads Mikkelsen), a skilled yet humble doctor, is recruited as the King's personal physician. He instantly forges a strong bond with the mad King, who is pleased to have a man of stature and intelligence by his side amidst his stern, old-fashioned council. Struensee's influence in court grows, but he finds himself caught up in a dangerous love affair with the Queen that could mean both of their heads should they be discovered.\n\nThis being 18th century Denmark, the King is surrounded by a council of religious old men looking to keep the country firmly in the Dark Ages. Struensee is a believer in the Age of Enlightenment, a progressive philosophical movement spearheaded by the likes of Voltaire and Rousseau. The Queen also shares his liberal views, and their love story isn't so much about their own sexual impulses but a driven and united desire to illuminate their country. Realising just how great an influence he is on the King, the doctor quickly sets about abolishing oppressive laws such as capital punishment, the torturing of suspects, and censorship. This immediately puts him at odds with the ruling aristocracy, who view him as a foreigner destroying their fatherland, and they waste no time looking for a way to expel him from court. It's alarming just how familiar it all sounds with the general one-step forward, two-steps back nature of politics. The three leads are all strong, with Mikkelsen in particular convincing as the reserved man of Enlightenment. By avoiding dramatic melodrama, A Royal Affair succeeds as a simmering portrayal of social disintegration and an intimate, intellectual love story."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "irbazsabik",
        "review_rating": "9",
        "review_title": "Great acting; Good history and philosophical lesson",
        "review_detailed_main": "Story-line => 3/5 (The storyline was linear. Almost everything could be predicted.); Acting => 5/5 (Loved the acting of all the main characters. Considering the overall acting, Mikkel Boe Følsgaard wins the round.); Directing => 4/5 (The progress was a bit slow but the presentation was nice. Loved it.); Visual Effects => 5/5 (Enough for the story.); Screenplay => 5/5 (Since the characters got time to develop, the screenplay was awesome. And the exchange among characters were logical.); Personal Recommendation => 5/5 (Watch it for acting and some history lessons. In the end, you will get some more lessons about how the world works which will give you some insights of life.); Most Favorite Character => Christian(He had to act like a person who didn't have much mental growth, a person who can be a good friend and a king & a person who's always betrayed simultaneously and he pulled that off very nicely. Really stole the light from everyone.);\n\nOverall Personal Rating => 9.0/10"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "tao902",
        "review_rating": "8",
        "review_title": "An Enlightening Affair",
        "review_detailed_main": "Set in 1767, the British Princess Caroline is sent to Denmark to marry the mentally ill and promiscuous King Christian. A German doctor, Johann, a free thinker, is recruited to help organize the king's affairs. He influences the king's policies with Enlightenment ideas, undermining the interests of the ruling class. Johann has a child by the king's neglected wife which gives the conservative ruling council their opportunity to indict Johann of treason, resulting in his execution and restoration of feudal law.\n\nBased on a true story this is an intriguing piece of history well told in a well made film. Convincing, excellent acting within luscious, superbly filmed settings."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "barnabyrudge",
        "review_rating": "8",
        "review_title": "Splendid historical drama, with a very interesting character conflict at its core.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "runamokprods",
        "review_rating": "8",
        "review_title": "A bit stiff, but fascinating history",
        "review_detailed_main": "Subject triumphs over style in this slightly stuffy, slightly staid, arguably overlong, but often fascinating and occasionally moving history lesson.\n\nIt's Denmark at the time of the Enlightenment. The young King Christian is borderline insane -- although, in the most complex performance with the most complex character in the film, Mikkel Folsgaard shows us many sides to this tormented soul. But the film focuses on the more straightforward young Queen shipped in from England, miserable in her loveless marriage to this sad clown of a king, and a very well intentioned German doctor and free-thinker, who feeds the Queen's intellect, and ultimately her body, while calming and befriending the young King, and working with him to bring in new laws that took Denmark out of the dark ages. All this doesn't go over very well with the sitting court, who are loathe to give any power or economic freedom to the people, and so scheme to fight back.\n\nOther than the King, the characters tend to black and white portrayals, but the actual steps of this true (if somewhat romanticized) slice of history make for a quite engrossing film."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Ryan_MYeah",
        "review_rating": "8",
        "review_title": "Strong, superbly acted, and actually quite smart drama.",
        "review_detailed_main": "Denmark's recent nominee for the Oscar for Best Foreign Language Film didn't really have me too eager to see it. Before watching it, I would have mistakenly written it off as just another stuffy and self-important costume drama, but after seeing it, that would have been a disservice. Granted, it is a bit stuffy, and they could have picked up the pace, but this is still quite the elegant, competently filmed and produced period piece set within 18th century Denmark, in which the queen is involved in a love triangle with the king and a doctor, while the king is fighting for new laws of liberation in the country. For these roles, there are a group of such strong performances, none more hard hitting than that of breakout star Alicia Vikander, who is far and away the movie's standout quality.\n\n**** / *****"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "nicolechan916",
        "review_rating": "9",
        "review_title": "An amazing portrayal of a true story.",
        "review_detailed_main": "The film does a great job with creating an authentic feel of the narrative. Settings and costumes are great, but what really caught me off guard was how this film is much more than just a love affair. By watching the trailer, I got the impression that the film was solely focused on the affair and that the ending would be some soppy elopement. I guess my first mistake was that I did not realize this was based on a true story.\n\nCinematography and editing (colour schemes) did a fantastic job at creating an 18th century feel to the film. Arcel does a well at directing all aspects of the film. Juxtaposition of certain shots definitely made a powerful impact and helped to evoke certain emotions. Though the mise-en-scene and script was well produced, I would say that the performance from the actors/actresses is what made this film extraordinary. There are a few scenes though that seem a little blatant and I might question the authenticity of them. But otherwise, this film was well shot, edited and produced.\n\nVikander plays her character with such grace and is able to portray how emotionally scarred she is from being with Christian. Her poise and expressions transcend her performance. Mikkelsen as well does a great job with his role as a strong minded and confident doctor with revolutionary ideas. However, Folsgaard's performance just blew me away. I intensely disliked his character at the beginning but soon realized that he most definitely had some sort of mental illness. After he was somewhat controlled, I began to understand that his behaviour was not his fault and came to sympathize for him. Folsgaard does an incredible job at portraying Christian that he totally embodies his character. The same can be said of the other two, and this trio's performance is simply chilling.\n\nI went on an emotional roller-coaster with this film. Intense dislike for the King to understanding of his actions, anger at the conservative party and council who live for profit, and heartache for Caroline and Johann as they try to keep up pretences. As well, I am satisfied with how the film ended, it did so cohesively and smoothly.\n\nRead more movie reviews at: championangels.wordpress.com"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "vindstilla",
        "review_rating": "8",
        "review_title": "Great interpretation of interesting historic event",
        "review_detailed_main": "I found the story itself rather intriguing and the fact that it is based on real events makes the movie even more worth seeing. I assure you won't be bored watching this, lots of things happened during the relatively short period of time at the Danish court that this movie pictures. The characters are believable and you get a deeper understanding for the complex relationships between them. The actors are all very skilled and I can feel how kings and queens back then where only just people, looking for love and a meaningful life. This is unlike many other period dramas, where the dialogue tend to be too formal and characters archetypal. This is not the case with this film. I truly enjoyed it."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "TheSquiss",
        "review_rating": "8",
        "review_title": "A beautiful, powerful film of love, corruption, political reform & mad kings.",
        "review_detailed_main": "A Royal Affair (En Kongelig Affaere) is the other great performance of the year from Mads Mikkelson that is winning plaudits. Or the first if you haven't yet seen the stunning, heartbreaking The Hunt (Jagten) yet. When it comes to Oscar nominations it is highly unlikely he'll get a look in and will have to be content with British and European gongs, but in the Academy Awards' Best Foreign Picture category either one of his films is very likely to earn a nomination; the current opinion being that this film will clinch the deal ahead of the more challenging Jagten.\n\nIn the eighteenth century, the Prince of Wales' youngest daughter, Princess Caroline Matilda (Alicia Vikander), was married off to her cousin, the Danish King Christian VII (Mikkel Boe Følsgaard). Being just fifteen and unceremoniously dumped in a foreign land was of little consequence compared to the insanity of her husband and the loneliness and misery she suffered. With the arrival of the King's new physician, Johann Friedrich Struensee (Mikkelson), Caroline's life opened up to the possibilities of love and political influence.\n\nLargely historically accurate, though somebody decided to ignore Caroline's penchant for transvestism and the final scene has been attenuated, A Royal Affair is a fascinating insight into the Machiavellian goings-on behind royal doors and could easily be dismissed as a fine fiction were it not a matter of historical fact.\n\nVikander's portrayal of the princess is as sensitive as her performance in Anna Karenina, and one's feelings towards Caroline evolve from pity to admiration as she acknowledges her fate and then challenges it to a duel, refusing to be harangued by her husband's council but understanding that he is incapable of protecting her from them. The chemistry between Vikander and Mikkelson frizzles at times and Caroline's lack of years, compared to Johann's age, is lost in the intensity of their love, and the political influence they seek to hold over the incompetent and bemused king.\n\nBut whilst Vikander and Mikkelson (Casino Royale's Le Chiffre) are the bigger names in A Royal Affair, it is Følsgaard who commands the attention as the childlike king who is blissfully aware of the dark deeds occurring behind his back and powerless to stand up to the attacks from the front. Having shot (and won awards for) En Kongelig Affaere while still at drama school, his career has launched on a trajectory many seasoned actors can only lust after and one suspects that, like his co-stars, he will also transcend Danish language films to reach a wider audience in the coming years.\n\nThough far less theatrical than Anna Karenina, A Royal Affair boasts spectacular sets and the cinematography is entirely sensitive to the action rather than striving to make it's own statement as too often occurs in period films. Director (and co-screenwriter) Nikolaj Arcel never embraces the spectacle at the expense of the minutiae but allows his actors time to evolve their characters so that we barely notice how Johann, in particular, somehow becomes a copy of the very creatures he strives to overthrow.\n\nThe criticisms of Arcel's film, slight as they are, concern needless brevity. With a running time of just over two hours, would it have hurt to expand the film slightly to include the darker edge of Caroline? It is easy to pick the villains of the film but I can't help feeling a fuller representation of Caroline might have allowed for more ambiguity and required its audience to question their own prejudices rather than comfortably judging the obvious crimes. Sometimes even those regarded as heinously immoral can be heroic in their challenge of a society's corrupt norms; it is more challenging for us to admire a person's actions in spite of their characteristics.\n\nAnd perhaps if Arcel had pulled fewer punches and allowed us to see a little more of the brutal regime that Johann and Caroline sought to end, we might have appreciated even more the courage of their actions, not just in love but in heroic political reform.\n\nAt year's end, A Royal Affair will rank highly in most critics' top ten films of the year and if that encourages more people to take the chance on a subtitled film they would otherwise avoid it can only be a good thing. Just not if it is at the expense of Jagten, or Amour or\u0085\n\nFor more reviews from The Squiss subscribe to my blog at www.thesquiss.co.uk\n\nLike the Facebook page: http://on.fb.me/RpitOG"
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "sarahelizabethparker",
        "review_rating": "10",
        "review_title": "Sad, but Beautiful",
        "review_detailed_main": "I'm not a huge fan of foreign language films, but this one is well worth it. Alicia Vikander and Mass Mikkelsen can really act. Their chemistry is electric and you can't help but root for them.\n\nThe historical parts of the film are surprisingly interesting."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "bjarias",
        "review_rating": "8",
        "review_title": ".. given the right circumstances you could pretty much go nonstop",
        "review_detailed_main": "You get the feeling early on in this film things are not going to end well. But it is movie making and not a documentary as the kings first wife in real life had seven kids and the second supposedly had twelve (then another half dozen or so with several mistresses... the man liked to copulate). It's a good film nonetheless, and the acting is top notch.. Mikkelsen and Vikander.. bit.ly/12EJNhc .. are superb.. the entire cast is truly deserved of high praise. Should you enjoy period movies this one could be right up your alley. Wonder what it is these period films have such an allure. In reality the lives of a majority of the population were totally unappealing.. but we're really not watchin most any of that."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Turfseer",
        "review_rating": "8",
        "review_title": "Fascinating chronicle of demented 18th century Danish king and his pro-Enlightenment physician-adviser",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "parausted",
        "review_rating": "10",
        "review_title": "THE DEEP LINK OF BEAUTY AND INTELLIGENCE",
        "review_detailed_main": "THIS MOVIE HAS THE INCREDIBLE MERIT OF PRESENTING A PRACTICALLY DELETED REALITY OF THE OFFICIAL HISTORY OF DENMARK. ITS PROTAGONIST, JOHANN FRIEDRICH STRUENSEE, IS ONE OF THOSE PEOPLE WHO HAVE CONTRIBUTED SO MUCH TO THE FREEDOM OF THE MANKIND... THAT RESULTS VERY INDIGESTIBLE TO OFFICIAL HISTORIANS. THIS FILM BRINGS BACK SOMETHING THAT LOOKED LOST IN THE CURRENT CINEMA: DEPTH, MORAL RELEVANCE, PLASTIC BEAUTY, SINCERE EMOTION, GREAT INTERPRETATION, EXCELLENT DIALOGUES. THE THEME OF FREEDOM OF THOUGHT HAS BEEN FEW TIMES TOUCHED BY CINEMA (I REMEMBER \"WITCH\" IN 1920, \"INHERIT THE WIND\" IN 1959, \"THE PHARAO\" IN 1966), BUT AS IN THIS MOVIE, NEVER. EQUALLY \"A ROYAL AFFAIR\" (TITLE THAT HIDES THE TRUE SENSE OF THE ARGUMENT) SHOWS EMPATHY TOWARDS THE OPPRESSED PEOPLE, TOWARDS THE IDEALS THAT CAME IN THE FRENCH REVOLUTION, AND DENOUNCES THE DARK COMPLOTES OF THE EUROPEAN NOBILITY AND THE CHURCH. THIS IS THE DENIED HISTORY, THIS IS A WORK OF ART THAT OBEYS WONDERFULLY THE GREEK IDEAL OF THE DEEP LINK OF BEAUTY AND INTELLIGENCE. \"A ROYAL AFFAIR\", DESPITE THE TITLE, IS A GIFT FOR THE MIND AND THE HEART."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "freemantle_uk",
        "review_rating": "8",
        "review_title": "Grand and political period drama",
        "review_detailed_main": "A Royal Affair was a prestigious costume drama that works as a political drama as well as a tale of forbidden love and with its director Nikolaj Arcel and star Alicia Vikander becoming successful afterwards.\n\nCaroline Matilda of Great Britain (Vikander) is a British Princess who was betrothed to the insane King of Denmark, Christian VII (Mikkel Følsgaard) a man who acts like a child and has an unmanageable temper. Even worst Denmark was the backwater of Europe, a country that still practice serfdom and ruled by a conservative group of elites. However, Caroline and Denmark's fortunes improve when Johann Friedrich Struensee (Mads Mikkelsen), a man of the Enlightenment, is hired to be King's physician and using his influence sets out to reform Denmark and make the nation into a beacon for the rest of Europe.\n\nA Royal Affair is a lavish looking production, having fantastic costumes and settings, being filmed on location in Copenhagen. The role of Caroline was part of a double whammy for Vikander who became know to an international audience (the other being Anna Karenina) and she was perfectly regal as in the dresses and elaborate hairstyles whilst Mikkelsen as Johann had a more man of the people look. Despite the pretty facade Arcel does contrasts the well-kept palaces of the elites to the streets and fields where the common folk live, filled with mud, rats and other nasties and peasants in field are tied to the land and tried as property by the aristocracy. This fuels Caroline and Johann's ideology.\n\nCaroline and Johann are drawn together because of their minds, being intellectuals and reading subversive literature, mainly the works of Jean-Jacques Rousseau. They are the ones who take over Christian's reign, creating a shadow government before seizing power for themselves. All the political manoeuvring makes A Royal Affair into a less violence version of Game of Thrones. The relationship between the trio is complex, Christian sees Johann almost as a father figure and the only person who can calm the king down whilst Caroline has nothing but loathing for her husband. One of the most powerful moments is when Johann tells Caroline she has to sleep with Christian so they can keep up the charade - an action that clearly causes both of them emotional pain.\n\nAlthough Caroline sets up the film with her letters and voice-over and being the one who opens the film it was Johann and his actions that the actual centre of the film. He is the one who has to befriend the king, be the one who uses the king, has an affair and essentially becomes the Prime Minister. He was the anchor of the film.\n\nA Royal Affair is a lavish production and fantastically acted, especially from Mikkelsen and Vikander and it detailed look in Denmark's history. It is certainly a treat for people who like The Duchess and Anna Karenina, touching on a similar subject manner of political marriages, social status and reform."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "finebeanies",
        "review_rating": "9",
        "review_title": "A fine Danish romance against the backdrop of Repression vs. Enlightenment",
        "review_detailed_main": "A historic fiction placed in the 18th century Denmark deals with the power struggles in the royal circle.\n\nIt is the time when the church has a firm grip on the society, serving the nobility to maintain the laws of serfdom. But progressive thinkers are starting to publish their enlightened ideas and use science to question the church's doctrine. The king of Denmark is mentally ill and those around him recognize that gaining his trust could lead to advancing their agenda. When a German doctor finds a way to gain king's trust and friendship, he enacts many progressive laws to improve the lives of the people. Progress is short-lived because the opposition, assisted by the church, plots to gain their power back.\n\nA romance between the doctor and the queen starts when they share similar liberal ideas. A conflict between duty, exploitation and pursuit of personal happiness is portrayed in the formal manner of nobility.\n\nFilmed at the Prague Castle and in Denmark, the movie is well acted and the story is compelling. The message of enlightenment and using the voice of science and reason to defeat church's oppressive ideas is still very valid today in the 21st century.\n\nI give it 9 out of 10."
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "bluepanda-815-627594",
        "review_rating": "",
        "review_title": "Supremely elegant",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "TxMike",
        "review_rating": "",
        "review_title": "Fascinating fact-based period story from the 1700s Denmark.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "Kirpianuscus",
        "review_rating": "",
        "review_title": "beautiful historical drama",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1276419",
        "movie_name": "A Royal Affair",
        "movie_rating": "7.5",
        "review_username": "rogerdarlington",
        "review_rating": "",
        "review_title": "A star is born: Alicia Vikander",
        "review_detailed_main": ""
    }
]