[
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "With an abrupt ending, it keeps hanging between a comedy, drama and satire.",
        "review_detailed_main": "There have been few good movies made on the subject of a common man being caught in the ugly vicious circle of the corrupt system prevailing in our country. Shyam Benegal gave us \"Well Done Abba\" on the same theme in 2010 and last year we had \"Chala Musaddi Office Office\" based on the famous TV series revolving around the same common man, who always becomes the victim in this corrupt bureaucratic system.\n\nGALI GALI CHOR HAI is also another project made on the similar lines which revolves around a middle class family of Bhopal with only 4 members. There is a retired father (Satish Kaushik), a son who works in a bank (Akshay Khanna), his wife who is teacher (Shreya Saran) and a young modern girl (Mughda Godse) who is a paying guest living with them like a family. Their difficult time starts from the moment they refuse to give one room of their house for the Election Campaign Office of a reputed contestant. But the matter even gets worst when the elderly father (after his refusal to the leader), gives the same room to the opposition's contestant instead. In frustration, the first party starts creating complex situations for the family with the help of local police which further leads to a much serious allegation towards the climax.\n\nInterestingly there was no ANNA MOVEMENT when the two movies mentioned above released in the past years. But now after ANNA being known to every single person of the nation, the subject certainly has its own reach and relevance in the present context. So in that way director Rumy Jafry chose the right plot and star-cast too, to impress the common man watching the film. However once again it is the execution which somehow is not able to make the desired impact on the audience. And for this I would like to blame its childish second half and a very strange or unintelligent conclusion which takes the film to simply no-where in the end with an abrupt finish.\n\nGGCH starts off pleasantly with many light sequences and some well written one liners too. But as the common man gets into trouble, it prolongs the things without any solid base and then later goes on to add many silly sequences in its second half diluting the good impact made by its first hour. Particularly the scenes related with the bag and two funny terrorists following Akshay should have been treated in a better way with at least a little logic. Still the film didn't seem to be that bad until the climax when it suddenly finishes off just with a few slaps, without giving any entertaining or interesting solution for the situation. In other words, it all ends in only a few seconds as if the director was told on one fine day that we have to finish the shooting today itself and they did it as instructed on the spot.\n\nMaking a simple film is a difficult job and Rumy Jafry tries to do the same successfully only in bits and parts in GGCH. The initial sequences of how Police can easily be used to tease a common man are well enacted and directed. But in its later reels, the film loses the grip and keeps hanging between a comedy, drama and a satire. Many sub-plots remain deliberate and under-used, like the tension between Akshay-Shreya, scenes at the Ramlila stage and the plot in which the hero acts as Hanuman in the local Ramlila after his job hours. Particularly the Hanuman angle which was also promoted in the promos remains completely ineffective and useless. Nevertheless in the soundtrack it does have one well written title song sung by Kailash Kher (who is also there in the song) and a catchy item number \"Channo\" featuring Veena Malik of Big Boss fame.\n\nIn the performance section, Akshay delivers a fine act but I still couldn't find anything new in his common man. Both Shreya Saran and Mughda Godse are simply there as the representatives of the opposite sex with nothing great to do in the entire film. Satish Kaushik is entertaining along with Annu Kapoor who comes up with the best performance in the film as the corrupt police officer. Amit Mistry impresses once again and Vijay Raaz remains the same in a brief role.\n\nIn the end, I would like to say that Yes, we all hate corruption and want to get rid of it as soon as possible. But what's the use of making such unimpressive and directionless films which try to encash the burning topic in the name of comedy. Frankly I could only enjoy a few sequences (in its first hour) and some dialogues in the entire film and the rest was just like another lifeless movie made around the common man which you might enjoy watching only on DVD after its home video release."
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "phoenix-rohan",
        "review_rating": "1",
        "review_title": "A huge disappointment",
        "review_detailed_main": "I'm rating on the basis of my expectations with the movie. The movie shows the Indian system exploiting the gullibility of the masses.\n\nGood things about the movie:\n\n1. Actors are good and have done a commendable job\n\n2. Some would like Veena's item song\n\nBad things about the movie:\n\n1. Monotonous story and very depressing throughout\n\n2. Ends abruptly without giving a proper conclusion. But still you'll be happy that at least the movie is over.\n\nI would rather recommend watching \"Office Office\" serial which gives a great portrayal of corruption in the Indian offices along with unique characters to tickle your funny bone."
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "anubish02",
        "review_rating": "3",
        "review_title": "a very weak film",
        "review_detailed_main": "Akshaye Khanna, no doubt is one of the finest actors of Hindi cinema. directer Rumy Jafry's last film life partner was a good film. so i expected a decent film. but it's a total disappointment. people watches movie to be entertained. films carrying social message are highly appreciated many times. but this film is a rubbish. this film portrays corruption & bribery but not in very realistic manner. those are so dramatic. at best it can be a stage drama of village, but it can't be a cinema.\n\nthis film shows no solve of problem. this film doesn't carry single scene to be remembered after watching the movie.\n\nonly good thing was Veena Malik's body show in the item song.\n\nnone of the songs was even average, those are below average. when some people will understand there are no takers of Anu Malik's music in this time."
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "silvan-desouza",
        "review_rating": "3",
        "review_title": "Bad luck for Akshaye Khanna",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "svaidyaji",
        "review_rating": "9",
        "review_title": "Must watch",
        "review_detailed_main": "This movie is a great portrayal of corruption in India. I shows how common man gets entangled in it. Common man loses to the corrupt. It depicts life in a medium city.\n\nIt uses Bhopali accent, and Bundelkhandi dialect. Acting of every one is fantastic. Annu Kapoor excels as a greedy policeman. Vijay Raaj looks like a real thief. Mugdha Godse is overbearing, but tolerable.\n\nRamleela is entertaining and the characters funny. Akshaye Khanna and Shreya Sharan are typical middle class characters.\n\nIt is an off beat movie that is very close to reality. Overall, it is a must watch."
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "Hunky Stud",
        "review_rating": "8",
        "review_title": "this is ridiculous, that is why it is so funny.",
        "review_detailed_main": "the first part was really funny, i sometimes rewind the DVD just to watch the funny scenes again. the ending is a little weak. they could have shown how that little fan got the protagonist in court, etc. the terrorist plot wasn't entirely related to corruption.\n\nthe older police should have won the best supporting actor award, he was also ridiculously funny.\n\ni used to think that India films were mostly about marriages, but i have seen quite a few films that are actually about corruption, and other social problems, etc.\n\nI enjoyed watching it very much.\n\nAnd this is also added to my list of \"Top Indian films about bureaucracy for all Chinese directors\"."
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "jaybhakta-80095",
        "review_rating": "10",
        "review_title": "Needs a Re-Release in Theater.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2188749",
        "movie_name": "Gali Gali Chor Hai",
        "movie_rating": "5.2",
        "review_username": "mandlikkishor",
        "review_rating": "9",
        "review_title": "Must watch very good movie thaks to director for a very good movie after long time a go to seen beautiful movie",
        "review_detailed_main": ""
    }
]