[
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "arupghose",
        "review_rating": "8",
        "review_title": "A film that will make you want to fall in love",
        "review_detailed_main": "I'm watching this film well after it was released in the cinemas (in fact after seeing both Besharam and Chennai Express) so I know how the film had performed at the box office, and what most people thought of it so my expectations were high!\n\nYJHD does through the typical roller coaster of a Bollywood romance, but where it differs from those that have failed, is that it has the star power of Ranbir and Deepika at the top of their game, alongside lovely music by Pritam and fantastic direction by Ayan Mukherjee.\n\nAyan is certainly one of the top young directors in the industry, and after Wake Up Sid, shows exactly why he holds his mantle piece. This work will go down as one of his finest, even though I am sure he will make many more films.\n\nThis role is bread and butter for someone of Ranbir's stature now. He eases into the role, initially playing the fun going flirty young man, then growing into the serious, yet romantic mature man later. This role is not on the same level as Barfi, there is no comparison, however it's these types of roles that will keep Ranbir competing with the likes of SRK for the romantic king award! Deepika has grown massively this year, and this being the third film (Ram Leela is the 4th) she has hit the industry with a bang in 2013. She looks stunning on screen and plays her role perfectly! Kalki, as annoying as her role, again plays it without any blemishes. Her role reminds you of Zindagi Na Milenge Dobara quite a lot! Aditya seems to be alcoholic of 2013 with this and Aashiqui 2 but does full justice to the role regardless!\n\nAnother massive plus point to the film Pritam's music. It's soulful throughout and adds a lot to the film. Kabira, Ilahi and Balam Picharki are my favourites.\n\nOverall YJHD is a beautiful film with performances that will be hard to forget. It may not win any awards this year, but it will certainly will be a film I'll remember."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Peter_Young",
        "review_rating": "6",
        "review_title": "Enjoyable but pretty much a rehash",
        "review_detailed_main": "Ayan Mukerji previously directed Wake Up Sid, his directorial debut, and he did a wonderful job with a film that was both refreshing and very good in and of itself. Just as it often goes with second ventures of promising first-timers, his next film, Yeh Jawaani Hai Deewani, is nowhere as good. I knew nothing about this film when I started watching it except that it was an extraordinary mainstream success. But I was quite interested in watching it. The film is not bad at all, but it just doesn't live up the hype it seeks to generate at its core premise.\n\nThe film follows four youngsters in one of their last trips together before one of them leaves the country. While the film is beautifully shot and is a thoroughly enjoyable watch, it's never more than pleasant, it's never overwhelming, and there's hardly any reminiscence of what the title prepared us for - you'll see none of the youth craze or even youth culture that you would probably immediately associate with this film, and what is lacking at the heart of an otherwise watchable film is the much called-for wild spirit which Mukherjee doesn't manage to capture.\n\nAnd it's not that Mukerji doesn't try. He does. There are some scenes of running through the markets, there are catchy songs and pretty girls, but the script often makes the story not ring true. The only portion where it leaves a mark is in the relationship between the two friends who meet after many years. The romantic tension between the two leads does work to a point, but sometimes it's too polished and fairy tale-like to really be impactful. And the biggest problem, it mostly just feels a rehash of previous films. At points the references to old Dharma (the production company under which the film is produced) films, people, and songs, is really pathetic.\n\nThe film's characters are merely derivative of previous famous characters, and are never given enough depth. Ranbir Kapoor repeats his Wake Up Sid character, and he does it well although it feels he never allows himself to shed all his inhibitions. Aditya Roy Kapur is exceedingly good in some parts and struggles in others, while Kalki is wasted although she is consistently good. The winner of course is Deepika. Again, her character is just a recap of popular characters (Kajol's Anjali in Kuch Kuch Hota Hai; Preity Zinta's Naina in Kal Ho Naa Ho), but she is wonderful, subtly conveying much through her expressive eyes and the tiny, nuanced gestures on her pretty face.\n\nTowards the end, the film grows incresingly fluffy, corny and starry, much to the point of losing the lighthearted nature it sought to define back in the beginning of the show. Heavy music and numerous sentimental scenes are followed by a most shallow moment of realisation on the part of the male protagonist, which is not convincing enough. Yeh Jawaani Hai Deewani is not bad, I have no doubt some would highly enjoy it. Actually I enjoyed it too, I just expected more from this film and was disappointed. Still so, it is watchable and entertaining, with some nice romantic and musical portions."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "snmeesala101",
        "review_rating": "8",
        "review_title": "A bit of both worlds... Must See!",
        "review_detailed_main": "This was not really a romantic comedy, despite the cast lineup. It more like a smart, meaningful story. There are a lot of humorous moments but also a lot of good advice. The theme was not the only great aspect of Yeh Jawaani was the beautiful locations picked for the movie. The cinematography really brought out magic of travel and experiencing new things. Deepika once again displayed her acting genius with a transformation halfway through the movie. The new faces were excellent as well. The casting couldn't have been any better. Because I love traveling, maybe I am a bit biased. However, I do truly feel that it is a movie all youngsters should see. Its not too cheesy or dramatic, a bit for everyone to love."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rahuljonathan-nair",
        "review_rating": "10",
        "review_title": "great entertainment",
        "review_detailed_main": "Like all rom-coms, YEH JAWAANI HAI DEEWANI sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expect no unwanted melodrama, no unwelcome characters, no earsplitting background music to accentuate the proceedings... On the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "dbdipashri",
        "review_rating": "",
        "review_title": "A Confusing Cocktail Of Dream & Desire !!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "planktonrules",
        "review_rating": "7",
        "review_title": "The story of Naina and Bunny has a few clichés, but it enjoyable and fun.",
        "review_detailed_main": "I enjoyed watching \"Yeh Jawaani Hai Deewani\" quite a bit, though I'll admit that the story has a few clichés here and there that kept it from being better. Still, given that I was watching it while flying across the Atlantic, it was a nice time-passer and kept my attention.\n\nThe film begins with Naina and her mother meeting up with a rather vacuous old schoolmate of Naina. While Naina graduated top of her class and is at the top of her class in medical school, this meeting with the schoolmate left Naina feeling that she's missing something...fun. So, on a lark, she decides to drop everything and head off on an adventure--and she picks the same destination the vacuous schoolmate chose. There, Naina slowly learns to unwind and meets sexy Bunny (he is a man--not some furry--despite the name). They hit it off and seem to be falling in love but one HUGE problem stands in their way--Bunny has vowed never to marry and wants to travel the world and experience EVERYTHING. What's to happen? See the film.\n\nLike the typical Bollywood film, this romance is predictable and there's lots of singing. You can't fault the film for this--this is THE format that Indian films follow these days and very few deviate from this. My problem with the film, and it's minor, was the silly scene were Naina takes off her glasses and instantly people notice how hot she is! What a cliché....plus my wife was much like Naina when I met her but is hot with and without her glasses! Still, it's fun and worth seeing."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rathitejas29",
        "review_rating": "10",
        "review_title": "great",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ksreekar",
        "review_rating": "7",
        "review_title": "Fun, frolic, and love-filled.... but riddled with clichés....",
        "review_detailed_main": "Amidst the hype, Madhuri's ghagra, the Ranbir - Deepika relationship and others, there was a sense of hope and expectation with this film for me, just because is was directed by \"Ayan Mukerji\". The director of Wake up Sid, which was a film where I really thought of Ranbir as an actor for the future.\n\nThis film has a cast of some young and fresh actors who bring their A game to the table. Specially people like Aditya Roy Kapoor, Kalki, and of couse the ever charming Ranbir and Deepika. Their performances do give a fresh and joyous sense to the film.\n\nComing to the plot, there is nothing you do not expect, A guy who lives a carefree and adventure filled life (Ranbir) and a girl who is like the one friend we all have and know is a book o'holic.(Deepika). This film does not surprise you with the plot or gives a twist or takes unexpected turns, but the actors and the screenplay makes up for it.\n\nLike almost each and every Karan Johar film, this one has that first half fun filled and second half emotion filled plot, if you know what I mean......\n\nThe soundtrack delivered by Pritam is really foot tapping and catchy. Even with the emotional sogs, he does leave a mark. Don't be surprised if you find yourself humming some of the tunes even after you leave the hall. (Specially Subhanallah and Kabira)....\n\nSome of the locations of the film shot in manali which shows trekking are enjoyable...\n\nThe main fault with the film is the plot itself and how it is presented in a clichéd manner. I don't have a problem with a used plot, but it could have been presented in a way that it does not get boring and too predictable. Guess the makers didn't want to take a risk.\n\nThe characters in this film are well built and we connect to them. Even small roles like Ranbir's parents, Kalki, are well acted and most importantly relate-able.\n\nIn the end this is a film with good acting, good premise, great locations, songs, but does get very much predictable and some times uninteresting. I give it a 7/10"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "manikagarwal2",
        "review_rating": "9",
        "review_title": "Been there ,seen that feeling but still it holds!!!!",
        "review_detailed_main": "so guys it ain't our wake up Sid !!! Director does try with the same self realization theme with the same versatile actor in ranbeer but seems got carried away trying 2 inject so much glam n chutzpah making the narrative way to tedious... it starts with a bang what with all of us gyrating to the ghagra of the \"never say die\" Mrs. madhuri dixit and are taken through a splendid fun n romantically portrayed picturesque snowy lanes of kashmir, bringing along with spirit of friendship n times passed.... But d movie falters in the 2nd half,with things getting repetitive,loaded with extra songs.... watch it for the item song,our super cool hero n his flirtatious nature, his emotions, his dance.. with deeps, his simply brilliantly directed scenes with his father(reminiscent of wake up Sid), ones with deeps n what not, dis guy is turning out to be the next complete actor man... Deeps too pitches in with a fine portrayal of a girl who loses all inhibitions n enacts a very lovely on screen pairing with kapoor...Aditya n kalki perform well again n give a a strong supporting cast. Kudos to Mr. Farooq(only 2 scenes) 4 his superb act of a father concerned about his kid but at d same time wishing to let him live his own life ...Also the feet tapping music, soulful Arijit, cinematography n direction... Wat would have worked the most could have been a crispier editing reducing the overall length by say 20 min....."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ketgup83",
        "review_rating": "6",
        "review_title": "Yeh Jawani Hain Deewani does not live upto the hype surrounding it. All glitters are not gold",
        "review_detailed_main": "\" Life is short ... live every moment until you regret it \" . Yeh Jawani Hain Dewani is all about friendship , adventure , fun and love celebrating each and every instance that will make you feel alive. The film was close to all these ... however it was the loose screenplay in the later part which plays the spoil-sport.\n\nYeh Jawani Hain Dewani brings you different set of people - A young , energetic , travel-enthusiasts who wants to make big in life, a studious-book worm who is sick of her life and wants to enjoy her life, an alcoholic-drug smitten gamblers who is wasting his life and a cool- rcok chic who is in a one-sided relationship. They all come together in one adventurous trip that will change their life forever.\n\nFrom the director of critically acclaimed WAKE-UP SID , Ayan Mukherji chooses a very different subject but falls into same old bollywood melodrama which we have witnessed so many times before. The first half begins with a bang and has routine song-drama with few hilarious moments but it is the second half which blocks the movement and goes in for a toss. Screenplay is average. Dialogues are decent at time otherwise repetitive. Art direction is awesome ( from the house of Karan Johar), Cinematography is eye-catching. Songs are just about average and nothing much to talk about. It is Ranbir Kapoor and Deepika Padukone who steals the show with their engrossing chemistry. i would not say it their break-through performance but it is good enough to pull out the movie from falling into pit. Aditya Roy Kapur goes over the top. Kalki Koechin is superb as Aditi.\n\nYeh Jawani Hain Deewani does not live upto the hype surrounding it. All glitters are not gold. Above average 2.75/5\n\nJoin me on www.facebook.com/Movienomics to read more reviews"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "nihalmohd",
        "review_rating": "1",
        "review_title": "A Movie That Should Have Been Called MakeMyTripHorrible.com",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "siddhantgiri1994",
        "review_rating": "9",
        "review_title": "Let's fall in love",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "namashi_1",
        "review_rating": "6",
        "review_title": "A Decent Light-Hearted Flick!",
        "review_detailed_main": "Ayan Mukerji's 'Yeh Jawaani Hai Deewani' is A Decent Light-Hearted Flick! It works till it lasts. If viewed with minimal expectations, chances of you being disappointed are ruled out!\n\n'Yeh Jawaani Hai Deewani' Is The Same Old Love-Story of how Opposites Attract! A nerdish girl falls for a free-willing boy, but loses him when he leaves the country, only to reunite with him 8 years later!\n\n'Yeh Jawaani Hai Deewani' is clichéd & predictable, but it still delivers some charming moments. The First-Hour is smooth, but the Second-Hour could've been shorter. The excessive length of over 2 hours & 40 minutes, needed some trimming, at least by 20-minutes. The Screenplay, which is inspired by many Bollywood Classics, has a certain appeal to it. But i'd like to add, that, the humor isn't clever enough. Ayan Mukerji has taken a complete departure this time. After making the coming-of-age 'Wake Up Sid', he takes a complete turn in 'Yeh Jawaani Hai Deewani'. He deserves credit for executing the film with style. Cinematography captures the exotic locales with flourish. Editing needed to be crispier. Art & Costume Design are marvelous. Music by Pritam is foot-tapping.\n\nPerformance-Wise: Ranbir is dependable, as always. Deepika has emerged into such a fine performer. She's extremely natural & believable all through. Kalki Koechlin stands out. She delivers a fantastic performance, easily her finest to date. Aditya Roy Kapur is likable. Farooq Sheikh is simply outstanding in a brief role. Kunaal Roy Kapur & Evelyn Sharma are adequate. Madhuri Dixit sizzles in an item song.\n\nOn the whole, 'Yeh Jawaani Hai Deewani' is a thoroughly watchable film."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "angel-leo30",
        "review_rating": "2",
        "review_title": "Avoid...",
        "review_detailed_main": "Poorly directed movie. Couldn't believe they made the whole movie based on world travel, where everyone thinks drinking is the best way to solve all their problems. The movie has a really big star cast - Ranbir, Deepika, Farroq Sheikh, etc but they fail to stimulate except Ranbir Kapoor and Kalki Koechlin. Deepika's dialogues put you to sleep. Her narration in the movie is extremely weak and is ridden with clichés. The story begins with flashback and there are some moments of excitement. Despite beginning with some promise the movie slows in the middle and ends up faltering. Though I enjoyed some of the moments in the movie but overall the screenplay does poor justification to what may have been a good storyline to begin with. The screenplay writer of this movie should really think hard if this is what he/she wants to do for life."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "marijaa11",
        "review_rating": "9",
        "review_title": "Simple Bollywood romance!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "andre_rox99",
        "review_rating": "",
        "review_title": "Your Average Timepass 'Masala' Flick... and it manages to deliver.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "nafisfuadkhan",
        "review_rating": "7",
        "review_title": "I like this movie but hoped better for the ending.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sweet-yashri",
        "review_rating": "9",
        "review_title": "A have-to-see movie",
        "review_detailed_main": "A have-to-see movie. Ranbir has struck again. After the cute romantic movie Barfi Ranbir gives us another romantic movie Yeh Jawani Hai Deewani. I'm not going to spoil it too much but the plot is simple, four friends and an adventure of a lifetime. Ranbir and Deepika's chemistry on screen is lovely and Kalki is just crack up in the first half. In Aishiqui 2 Aditya Roy Kapoor is seen as a lover boy, but that all turns upside down in YJHD, in YJHD Aditya Roy Kapoor is seen as a gambler that keeps losing money. All the songs are great especially 'Balam Pichkari' and having Madhuri do a item no. was a brilliant idea. Just something i did not like was how long it was and also when Deepika and Ranbir are seen kissing the photography is very close up (you can see every step of kissing). YJHD is DIFFERENT to 'Wake Up Sid'.\n\nOverall: 8.5/10 (but that is just my rating)\n\nsomething i will always remember: \"i want to run, i want to fly, i even want to fall, but i don't want to stop' - Ranbir Kapoor (YJHD)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "nadkarnisumeet",
        "review_rating": "7",
        "review_title": "Ranbir and Deepika shine in an otherwise average plot",
        "review_detailed_main": "Yeh Jawaani Hai Deewani review:\n\nYeh jawaani hai deewani Story hai wahi ghisi piti puraani Par Ranbir ki acting hai solid mastani Deepika dikhti hai badi suhaani Dekh sakte hai ek baar bina pareshaani Yeh jawaani hai deewani\n\nRegards, Sumeet Nadkarni."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "asu-ray20",
        "review_rating": "8",
        "review_title": "no second thoughts....just go for it...",
        "review_detailed_main": "I was very much excited for yeh jawaani hai diwaani.Of course i am a Ranbir Kapoor fan after his two back to back super hits.It is also an Ayan Mukerji movie.Now i must say the movie was awesome.The story revolves around four friends bunny(Ranbir Kapoor) Avi(Aditya Roy Kapur)Billi(Deepika Padukone) and Aditi (Kalki Koechlin).Bunny is an adventure and fun loving guy where as Billi is a good nature d girl who loves to study.The movie revolves around four friends who take a road trip in their holidays to cherish their life. Every thing works well between them.Until bunny and Billi split up and meet at a wedding of their friends. The movie even gets better for its songs.special appearance of Madhuri Dixit in the song ghagara just rocked.Their was lot of comedy and funny movements.Emotional movements also worked up brightly.The movie was an absolute treat to watch."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "kakkad_ravi",
        "review_rating": "6",
        "review_title": "Cool romance fanning little breeze this summer.",
        "review_detailed_main": "If you are thinking that YJHD is a blending screening of DDLJ, Jab we met, Dil Chahta hain and ZNMD, then you are absolutely right...!!! The sizzling chemistry between Ranbir and Deepika is the only reason why this movie works. The movie does not have any thing to capture your heart or make you miss a beat, but it entertains you with amazing performances, music, locations and freshness in old drama.\n\nThe 'Badtameez' is unarguably the heart of the movie or the show stopping characteristic of Ranbir Kapoor. For those who wish to fall for Deepika over and over again, the movie could be a good catch. With Pritam's nice music and Balam Pichakari groove to move your body, the movie is surely going to rock your feet.\n\nBut once again beware of the same 'LOVE' climax that would fan off your interest at one point. Climax of the movie is predictable like their crazy journey ultimately reaches its destination 'Love'. The movie doesn't have exceptional plot or story, but it's worth watching one time for the fresh moments it captures. It will give you a \"very little\" cool breeze."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "swanbaupro",
        "review_rating": "3",
        "review_title": "too formulaic",
        "review_detailed_main": "After all the hullabaloo and the packed theatres, I finally went to see it with my partner. And... I was disappointed. The movie started with a formulaic plot. The entire first half was a needlessly extended and excruciating cliché. I actually walked out of the hall because I couldn't bear the mediocrity and would have gone home had my partner not been there with me. The second half was made slightly better by the stronger dialogue.\n\nWhat I'm wondering is how a movie can be made that's almost three hours long but still gives you the feeling at the end of the day that the allegedly sumptuous meal you've just eaten hasn't filled half your belly.\n\nI'm not going to watch any more coming-of-age Bollywood movies. I'm through with beating the dead horse."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ash_mendy27",
        "review_rating": "10",
        "review_title": "Just became one of my favorite Indian movies :) Highly recommended :)",
        "review_detailed_main": "I've been a fan of Indian movies since I've watched 3 idiots and while I was searching for another Indian movie to watch with a genre of romantic-comedy (with the likes of Hasee To Phasee, Jab We Met, Khoobsurat) I came across this movie in one of the suggestions.\n\nAt first I was hesitant to watch this since it's my first time to watch a film starred by Deepika & Ranbir. I've read in some articles that they are quite famous but still I haven't watched yet their movies.\n\nSo it was kinda surprising for me when I saw this film. Yes, it have some cheesy lines and moments delivered by Ranbir but somehow when he delivered it, these scenes became different. It was not cheesy but it became romantic that you watching can't help but smile. :)\n\nThe lead stars have total chemistry! Even though there were scenes that they were not saying anything, but its in their eyes that they were totally expressing it. Through their stares, you can feel the emotion they are trying to convey. Awesome performance by the way!\n\nThe plot also was very nice. You thought that this would happen but the next thing you know, it will be totally different. It was realistic & it showed that sometimes you have to choose between your dreams and the love of your life. That it doesn't mean that if you love a person, he/she will be the one for you and to spend the rest of your life with. A lot of people could really relate to this film. All in all, a very big thumbs up for this movie! If you want a feel good, make-you-want-to-smile-but- also-cry kinda movie then you should definitely watch this. You won't be disappointed. :)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "silvan-desouza",
        "review_rating": "6",
        "review_title": "Not a cult film like Wake Up Sid but superb",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "nairtejas",
        "review_rating": "5",
        "review_title": "Ayan Mukherji Takes An Already Narrated Story & Adds Nothing To It... 50%",
        "review_detailed_main": "Rating: 5/10\n\nHe takes up a ghissa-pita story, much like his debut Wake Up Sid and tries to turn it around. With the cast so heavily gorgeous giving out performances like its their last, revs up the movie-watching experience only for the first half. The second half sucks and drags a lot with cheeky references and illogical sequences. Overall, the route taken to say an old, short, romantic story, is arduous and infested with clichés as it dives into deep philosophy...\n\nTraces of Dil Chahta Hai, Rang De Basanti, Kai Po Che & even Aashiqui 2 is explicit, so is the filmmaking which feels like they have been inspired by Zoya Akhtar. Even the screenplay is timid. The story is clichéd, yes, and to make it worse, the climax actually works against the film although it is justified for a theme like this. Unpredictability is stereotype here but Ayan molds it for his audience as a fun, frothy buddy flick which actually loses pace when theme of Rockstar & Karan Johar led family ties enter the plot.. Juxtaposed with heavy numbers, life elements, relationships, romance & social conflicts, Yeh Jawaani Hai Deewani only appeals till midway.\n\nRanbir (who the film is almost based upon with the decisions he has to make as a complelling life of a nomad) & Deepike jazz up the screen with no mistake at all; yet Deepika's sudden shift from a pious, studious dame to her usual party- girl avatar is fishy , while Kalki & Aditya pass, with the script not letting them explore their insights. Kunaal is apt for the role while I still cannot construe what Poornima, Dixit & Rana were doing there. Revealing their characters may spoil the watch. Parental conflicts, much like in WUS is prevalent. Supporting cast (Farooq, Tanvi) is terrific. Music is brilliant and the locations add up to the movie-watching experience. At 165 minutes, the play seems to immensely go out of bounds, but the lead pair try hard and dishearteningly fail to keep us hooked. Emotions are played with and usual jealousy element brought up. Get a life, Ayan!\n\nBOTTOM LINE: A feel-good movie terribly gone wrong and is only watchable to the people who are blindly in love, and because of Ranbir. YJHD makes no sense at all and has nothing new to decipher. Enjoy the songs, the journey of a life and faint humor, that's it. 49% Recommended!\n\nCan be watched with a typical Indian family? YES\n\nProfanity: Very Mild | Sex: No (Implied) | Nudity: No | Mouth-Kiss: Mild | Violence: Mild | Gore: No | Smoking, Alcohol: Strong | Vulgarity: Mild | Foreplay: Mild"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "veddeshpande-06184",
        "review_rating": "10",
        "review_title": "Superb",
        "review_detailed_main": "Extremely well written...and the acting by ranbir kapoor makes me love him even more...its not easy to completely overshadow deepika padukone..but Ranbir did it! Hats off."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "misyelhasanah-06139",
        "review_rating": "",
        "review_title": "A Movie that can give me a GOOD TIME and MESSAGE also",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Makhzumi",
        "review_rating": "6",
        "review_title": "Entertainment guaranteed !!!!",
        "review_detailed_main": "Well it isn't that much different from our usual Bolly-wood mas-ala. But hats off to Ranbir and his co cast they make it a hell of a more fun. The movie is good. has a nice tempo. some good acting. Some good lines. Good songs and as a whole its an entertainment for sure. We see these kind of movies from time to time. It can be regarded as a typical Bolly-wood movie. But if you are a Ranbir fan its a must see for you. Well i liked the movie cause it was fun to watch with friends. Had a great time. So if you want to enjoy this movie gather your friends and put it on and surely you'll have a nice time spent together. In simple words, easy going , funny , at times a little sentimental(Bolly-wood trademark)and enjoyable."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Kaatil29",
        "review_rating": "9",
        "review_title": "RK'S BEST MOVIE FOR ME",
        "review_detailed_main": "Very inspiring & exciting movie about love,friendship,heartbreaks,passion & simplicity.\n\nA perfect all in the bucket movie for me(9/10)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "user-703-68037",
        "review_rating": "7",
        "review_title": "paisa vasool fim",
        "review_detailed_main": "it is a good movie for first 1hr but after 1 hr its kind off boring.and deepika was looking beautiful and ranbir is looking handsome as-usual.and kalki acting was very enjoyable..and avinash was OK-OK.but story was expectable and locations in movie was very awesome..in the beginning we thought its a very funny film but by the the film going and by the interval its just seem like a emotional movie.and at the end it was a package of a good movie.and manali trek tour in the movie was the best part.and the wedding part both are the best scenes.and i thought it was ayan mukherjee film i thought ayan was come with the new story.but film is not as enjoyable as i am expecting. overall it was a good movie.must watch!!!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "irsathahamed",
        "review_rating": "10",
        "review_title": "Lifetime movie..",
        "review_detailed_main": "One of the best movie ever made by Bollywood, so much life lessons and wake up call for everyone who fed up with life.."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "cinematic_aficionado",
        "review_rating": "6",
        "review_title": "Youthful and enjoyable",
        "review_detailed_main": "A love story between two unlikely people; the Mr Popular and Ms Shy scholar.\n\nIt all begins during a climbing expedition, where our main characters reunite several years after high school and whilst aware of their huge differences as persons, certain chemistry develops and just as they were about to confess their feelings revelation comes through that the popular boy is set for a dynamic career in a far away land, an opportunity which he ceases and whilst it appears that life had taken a course for them all, when they reunite for a friend's wedding, nothing is what it seems.\n\nThere's a youthful virility about this that made it a joy to watch and follow. From the beginning to the end we partake in the lives of the main characters and the producers have made a decent job in making the audience intrigued as to what will follow next.\n\nMy only quandary with this, is that the actual story and the dialogues/sense of humour in particular could have been a little meatier as it would have raised the bar for the entire film, or perhaps this is just me, a Westerner, in appraising something Hindi.\n\nAn enjoyable experience overall."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "jhingalalahmm",
        "review_rating": "1",
        "review_title": "A movie by morons for morons",
        "review_detailed_main": "Oh god! I cant believe that I spent my hard earned money to go watch this movie last night and I so regret it. This is a classic case of a movie by morons for morons. The movie has no plot whatsoever. What were the makers thinking while making this movie??? Where is the story??? What the hell was that all about??? The movie started out at a decent pace but very quickly lost pace and then it dragged on and on and on till I could no longer bear to sit. Thankfully the movie ended abruptly. It was like, OK enough messing around, lets end this movie now! Last but not the least, what was all that alcohol drinking all about? Most characters for most part of the movie have a wine glass or a beer bottle in their hand! Oh, now I understand! This movie was actually a very very long ad for the benefits of drinking alcohol! Well, there you go, now you know what you will be watching if you still want to go that is! YAWN!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "vishalsmail33",
        "review_rating": "8",
        "review_title": "Yeh Jawaani is full of Deewani!",
        "review_detailed_main": "Yeh Jawaani hai Deewani is a refreshing take on the lives of the youth(of varied types)-their needs,their aspirations,their madness. Inspite of being 3+ hours,it never felt like a long film. It is a movie with a lot of flair,adventure and madness, as you would expect from the title.\n\nThe acting cast is mouth-watering. Ranbir Kapoor as Bunny is brilliant. He plays a character who loves to have all the fun, wants to live life at a fast pace and has this quirky ambition of visiting all the beautiful places in the world. Good job Ranbir, great acting skills and mind-blowing dancing skills that is always fun viewing. Deepike Padukone as Naina shines as an actor and shows she is more than just good looks with a beautiful rendition of a nerdy girl who is looking to break all inhibitions. I think she captured a studious,unsatisfied and conflicted girl perfectly. Kalki as Aditi exceeded my expectations. It was a treat watching Aditya Roy Kapoor who always lit up the screen whenever he was present.\n\nThe dialogues are crisp and some of them pretty deep and well thought. The music and the songs stand apart. I actually felt like getting up and dancing to the tunes of 'Balam Pichkari' and 'Badtameez Dil'. The costumes are good as well. Ayan Mukherjee seems spot on in his direction and execution as well as in the selection of the cast.\n\nWhat is good about this movie is that the approach to many things is fresh and is no cliché(The ending is kinda inescapable though).The plot seems perfectly plausible. Bunny does not fall head over heels in love with Naina. They pretty much get back to their lives without any drama.It is circumstances that later makes things happen.\n\n' Yeh Jawaani hai Deewani' is definitely good entertainment overall. An enjoyable experience.Go for it."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "CaptKeshav",
        "review_rating": "7",
        "review_title": "Unexpected Brilliance!!",
        "review_detailed_main": "For me this movie is the biggest surprise of 2013, I had no hopes for this movie. I presumed It might be just another romance comedy and oh boy! wasn't I wrong. Honestly I've never been so happy to be proved wrong. Ranbir Kapoor is THE STAR of this film, he gets to show off his acting skills. Technically He is the best thing about the movie. This movie is something more than just being a story about how a guy finds love. It approaches the younger viewers more closely and gives away the secret that I've spent my lifetime searching-\"How to live your life?\". Alright! Lets put the message aside and judge this movie as a form of art. The Dialogues are perfect, Ranbir Kapoor Stoles the show like stealing a candy from a f**king baby, Deepika Padukone is there to represent us as a character to reproach Ranbir Kapoor's character ans she did a good job. Overall I think this film would approach more to the younger audience as compared to the elders because they're about to start their life and they get too emotionally attached. I give this movie 7.9/10."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "dpatel13",
        "review_rating": "3",
        "review_title": "Not for guys!",
        "review_detailed_main": "From the director of \"Wake up Sid,\" the star-studded cast and Dharma productions, the expectations are high. Yeh Jawani Hain Deewani falls short on the direction, significantly. The production value is high; the songs, the locales and background scores are all great. However, the story is awful. There is nothing new in the story or the story-telling. Wake Up Sid did not have a new story but the direction was spot on. This movie has unnecessary songs (i.e. Madhuri's song), flashbacks (major set back in direction) and forced emotional scenes. There didn't seem to be any character progression as well. Taran Adarsh (bollywood hungama) raves about the character progression but I beg to differ.\n\nThis movie is fine for the audience who like the ZeeTV romantic shows, who are Ranbir-Deepika lovers or the people who go to movies for the cinematography. But to the lovers of new bollywood, this movie is not recommended. About 75% of the movie is very predictable, moves at a slow pace and illogical.\n\nHighly disappointed."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "arjunflamingfeather",
        "review_rating": "10",
        "review_title": "YEH JAWAANI HAI DEEWANI",
        "review_detailed_main": "YEH JAWAANI HAI DEEWANI RATED TEN ON TEN SUBTITLES IN ENGLISH ARE AVAILABLE WITH OR FOR THE FOURTH WORLD NATIONS It is easier for immigrants from an immigrant or diasporic nation like from AMITAV GHOSH to be able to view the same movie as the subcontinent pay roll release of YEH JAWAANI HAI DEEWANI. The letter of to a loved on marks the symbol of love with a professional or personal touch like FOR MY LOVE or SEXY BOO."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ahwaan_padhee",
        "review_rating": "",
        "review_title": "Yeh Jawani Nahi Gawaani",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Swapnilagarwal",
        "review_rating": "6",
        "review_title": "This jawaani is deewani but kahani is purani!!",
        "review_detailed_main": "'Yeh jawaani Hai Deewani' (YJHD) was on audience's watch-list right from release of its teaser. After all, it was going to mark coming back of Ayan Mukherjee after his awesome debut venture 'Wake up Sid' and that of ex-flames Ranbir and Deepika. Yes, Mukherjee has again come up with an ensemble of young characters, encapsulating madness and dilemmas of youth. As always, without delving much into details of story, lets come to movie-highlights:\n\n\u0095 Starcast: Yes, there is still a lot of fire left in the on (off??) screen pair of the Kapoor boy and Dippy, exhibiting sparking chemistry. Ranbir is as endearing as ever whether be the funky, badtameez, spoof, flirty Bunny or the confused, vulnerable, emotional Kabir. However, the character doesn't come off age as gracefully as Sid does in WUS. Anyways, Ranbir looks lovable in every frame. Deepika looks beautiful (and smoking hot) as both the simple nerd Naina and the transformed doc. Again, her extreme characters too aren't as believable as was Ayesha in WUS. Kalki and ARK (Aditya Roy Kapoor) add spunk and glue to the story. Their presence makes YJHD more youthful and deewana. Farooq Sheikh is endearing enough to moisten your eyes in his short cameo. It's nice to see KRK (Kunal Roy Kapoor) in a cameo with his younger bro ARK.\n\n\u0095 Storyline: Deja-vu! Ayan, this time seems to have gone the Dharma (productions) way loading his creation with glitz and glam plus a big fat destination Johar-isc wedding. Borrowing bits and pieces from ZNMD and Love Aajkal, the story is more like old wine in new bottle, and hence, quite predictable.\n\n\u0095 Cinematography: The breath-taking beauty and serenity of on-screen Manali (in actual Gulmarg) has been captured amazingly. Equally eye-catching looks the vintage and royal Udaipur. Full points to V.Manikandan!\n\n\u0095 Music/ Dance: Barring 'Badtameez Dill' and 'Balam pichkari', which already one of the best this year so far, other creations of Pritam fall flat be it 'Subhanallah' or 'Dilliwali girlfriend'. 'Kabira' carried the hangover of 'Iktara' (WUS). Madhuri's 'Ghaghara' number lacks grace and charm is rather not a fit in storyline. Ranbir's energetic dancing adds more rhythm to Pritam's compositions.\n\n\u0095 Flaws: YJHD does have its share of errs as follows: - Predictable old formula storyline - Low IQ and EQ (emotional quotient)compared to WUS - Unnecessary songs/ dance numbers\n\nIn all, YJHD may not be as suave and heart-warming as AM's first creation; nonetheless, it is definitely a one-time watch. Watch it for Ranbir's charm and cute moments of buddy hood!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "jmoneyjohal",
        "review_rating": "9",
        "review_title": "Jawani Ki Jai HO",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "MuviFan73",
        "review_rating": "7",
        "review_title": "Great direction, Great songs, Great star cast thus my vote!",
        "review_detailed_main": "Tone, Script & Story: The movie celebrates friendship of three friends played by Ranbir Kapoor, Aditya Roy Kapoor, Kalki Koechlin. One more friend is added to their group played by Deepika Padukone. This new friend is an introvert of a shy nature.\n\nWhat I liked about the movie is how an introvert gets a chance to express herself. She gets to show her those colors which no body has seen till now. The help coming from other friends towards her to explore her makes me delighted.\n\nDirection, Screenplay, Cinematography: The direction is really good. It comes from a director (Ayan Mukherjee) who has also directed 'wake up sid'. Music: Music is very good. My favorite track is 'Kabira'. Acting: Justified. There are actors who adopt choreography in such a way that it's not easy to imitate. Ranbir in this movie shows why he belongs to that league.\n\nFinal Verdict: Great direction, Great songs, Great star cast thus my vote! Watch it, you will definitely enjoy."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sujath2807",
        "review_rating": "8",
        "review_title": "Funny,catchy music and beautifully shot. I am sold !!",
        "review_detailed_main": "When the trumpet started playing of the Badtameez Dil song in the trailer, i knew the movie is going to be exciting like wise. Normally movie do not do justice to the trailers but YJHD was an exception, i was hoping for the movie to loose its track and go in a wrong direction midway but it never did. I was entertained through out the movie, i do agree that the ending was prolonged a bit but i have seen disasters before so i overlooked it and saw this movie 4 Times.\n\nMusic in this movie was just top class and fresh, when the movie opened with a melodious kabira song with all the wedding theme it looked so beautiful to the eyes. I easily felt comfortable with the movie already, i don't really get the hate this movie has received. Ranbeer acts naturally as ever, deepika looks stunning even in a Geeky avatar and the supporting cast Kalki and Aditya does more than justice to their roles and contributes to the film as equally as the main lead. The first half of the movie is excellently paced and Balam Pichkari is my favorite Holi number of all time; so colorfully shot. Ranbeer's character is a very interesting one and he does reflect our youth culture, yes we refuse to follow the same path, do as we are told and born and die in the same place. In some way his character is inspiring, little selfish of course but the guy wants what he wants. He can undeniably lead a movie and does justice to his role, i mean who can pull off an entry like the one he did post Interval in the \"Badtameez Dil\" song. Second half of the movie is lengthy and the pace gets slow which i feel was required, very few movies can make you like the second half and specially make you laugh. So YJHD was a winner in that, i just cant get enough of the movie's cinematography. Its just beautifully shot be it Manali or Udaypur, its good to see India so beautiful.\n\nI may get lot of disagreements or hate but this movie is one of the coolest movies of 2013, I am a big fan of the YJHD's music. Ayan mukherji has done a great job and finally delivering a commercial movie like this after Swades and Wake up sid shows his versatility. Thumbs up to Actors performances, thumbs up to the music and of course the director. Hope to see such pleasant for the eyes and soul movies in future, definitely a must watch and a collectible."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "shahx302",
        "review_rating": "7",
        "review_title": "YEH JAWAANI HAI DEEWANI is a movie that can turn a HEART-BROKEN ALCOHOLIC into the LIFE OF THE PARTY.",
        "review_detailed_main": "MOVIE REVIEW: YEH JAWAANI HAI DEEWANI\n\nRecently,A lot of ROM-COMs and COMING-OF-AGE movies have been released in Bollywood and many of them have been given a HARSH treatment by the public.So,there is immense pressure on the directors and writers because they know that they'll need to come up with something UNIQUE.\n\nAyan Mukerji (Director) seems to have handled the pressure quite well and has indeed created something UNIQUE.Hats off to him for that.After watching Wake Up Sid,one can never expect him to make something like YEH JAWAANI HAI DEEWANI.He not only wrote a WONDERFUL story that contains a STRONG message and bitter REALITIES of life but has also managed to present it in a very GRACEFUL manner by writing the SCREENPLAY himself as well .He surely has GROWN as a director and knows exactly how to speak his heart out in a way that settles well with the audience.When he is calling shots,expect no prolonged MELODRAMA or any uncalled for TWISTS.REMARKABLE work by this 1 film old director. *KUDOS*\n\nYEH JAWAANI HAI DEEWANI is a REFRESHING tale that revolves around four friends----Bunny (Ranbir),Naina (Deepika),Avi (Aditya) and Aditi (Kalki).They are having all sorts of fun together on a trek trip until they realize that they're growing older and life has started turning to an unlikeable direction.\n\nRanbir Kapoor plays an IMPETUOUS,FLIRTATIOUS,FUN-LOVING and INTREPID guy,with a STEP-MOM issue,who wants to live his life to the fullest.He dreams of exploring the world and he is quite OBSTINATE concerning that.He is just UNSTOPPABLE throughout the movie.Ayan Mukerji has capitalized Ranbir's abilities very SMARTLY.Firstly,He'll give you a stomach-ache with his WITTINESS,EXASPERATION and STRANGE GESTURES and then he'll make you wanna jump up your seat and DANCE alongside him in a number of up-beat songs.After all of that,he'll show you his CONSIDERATE,INTROSPECTIVE and EMOTIONAL side which will melt your HEARTS.He has done an AMAZING job as usual.Undoubtedly,he is the NEXT BIG THING in Bollywood. KEEP on ROCKING!!! \\o/\n\nDeepika Padukone essays the role of a \"GOOD GIRL\" who has always been the brightest student but hasn't really ENJOYED her life.Then she meets three people who are completely different from her and this changes her life.She is EXTREMELY CUTE in the first half and then shocks with her ULTRA HOT and SENSUOUS look in the second half.After delivering a FANTASTIC performance in COCKTAIL,she has NAILED IT yet again. Way to go GIRL!!!\n\nRANBIR and DEEPIKA share a SIZZLING CHEMISTRY and it is something to watch-out for. Their eyes SPARKLE when they look at each other.It seems as if they forget the world around them when they're together on the DANCE FLOOR.They're indeed IMPRESSIVE in separate frames but together they set the SCREEN ON FIRE...together they're a TREAT TO WATCH...together they're MAGIC.\n\nAditya Roy Kapur's (of Aashiqui 2 fame) role is of a GOOFY guy who is addicted to gambling,fails in almost everything,has no sense of achievement and LOVES his friends.There isn't much for him in the screenplay but whenever he is on the screen,he is DELIGHTFUL.\n\nKalki Koechlin is the new TOMBOY of Bollywood.Her performance is very CONVINCING and ALLURING.She holds her own SIGNIFICANCE even though the film clearly belongs to RANBIR and DEEPIKA.\n\nOnce again,Pritam has produced a CHART-BUSTER ALBUM.This guy is a GENIUS.Almost all the songs are hits and have been choreographed SUPERBLY by Remo D'Souza and Farah Khan.BATAMEEZ DIL,BALAM PICHKARI,DILLIWALI GIRLFRIEND and GHAGRA are there to ROCK UP the place while KABIRA and SUBHAN-ALLAH are the songs with SOOTHING TUNES and TOUCHING LYRICS.\n\nBrilliant work by V. Manikandan (Cinematographer).He has captured EXCELLENCE in each and every frame and has done it keeping in mind the VISION of the director and the TERRIFIC work of the PRODUCTION DESIGNERS (Amrita Mahal Nakai and Rajnish Hedao).\n\nFull marks for Manish Malhotra and Samidha Wangnoo, (Costume Designers).They've added TONS OF GLAMOUR to the movie.The OUTFITS are out of this world,specially,the ones that DEEPIKA PADUKONE dons in the second half.\n\nIn short,YEH JAWAANI HAI DEEWANI is a movie that can turn a HEART-BROKEN ALCOHOLIC into the LIFE OF THE PARTY.\n\nFor me,being a CINEMA LOVER,missing a movie like this would be a SIN. Watch this and CELEBRATE LOVE and FRIENDSHIP."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "jb1981",
        "review_rating": "1",
        "review_title": "please avoid!!",
        "review_detailed_main": "I watched it on Youtube last night as I had nothing better to do. Sooooo bad!!! These kind of movies were popular (with SRK) some 10 years back. In recent years, the track record of Bollywood (Barfi, Dirty Picture, Pan Singh Tomar, etc) makes you think it has evolved beautifully and quite positively. But such movies make you feel hopeless. What the hell is wrong with the producer? He and his films are all about some dream world which does not exist.\n\nKalki and Ranbir are really good actors, but their talent seem to be completely wasted here. Padukone gives bland expressions. And the other guy seems to be a serial drunkard (first Aashiqui and now this one). Forget about carrying any message, this movie even lacked the entertainment quotient. So only one word: AVOID!!!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "g-gurgaon",
        "review_rating": "9",
        "review_title": "Fantastic, Classy, Enjoyable",
        "review_detailed_main": "Amazing movie from KJo. Impressive performances by Ranbir, Deepika & Kalki. Must watch, light hearted movie which you'll enjoy to the fullest with the family & friends. I specially liked the lines of Ranbir like when he meets Deepika after a pond time, he asks her whether she is married, she replays No, Then he asks whether you have kids & she answers, Yes- 6 & he spontaneously says, \"Behuda Aurat\" but in a very comic manner which i liked. There are many such little enjoyable lines throughout the movie. One more thing which I liked is the way Ranbir re-proposed Deepika in the end. The manner he proposed her was not all Filmy but very casual, which was commendable & different."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "xmen130",
        "review_rating": "6",
        "review_title": "Not What Expected But An Average Movie With Same Old Concept",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "bobbysing",
        "review_rating": "5",
        "review_title": "Wasn't expecting such routine stuff from the team.",
        "review_detailed_main": "Director Ayan Mukherjee played it safe in his first venture WAKE UP SID with a youthful routine plot wrapped in a glossy package. The film had Ranbir in it to pull that off, along with some good songs and an execution appealing to the young. So, after establishing himself as a director, I was expecting something great and novel in his second venture YEH JAWAANI HAI DEEWANI which unfortunately has been made exactly on the same formula like his first. The film has a big star-cast lead by Ranbir-Deepika along with the current heartthrob Aditya Roy Kapur post his AASHIQUI 2 success story. Plus it also has a big production house and a hit musical score by Pritam to add to its credits. But strangely despite having such great support from both the actors and the producers, Ayan again opts for the same old wine in a new bottle kind of storyline, with nothing fresh in the name of content in his second film. Hence the result remains the same i.e. just average.\n\nBut more importantly, it was really strange to accept it as a Ranbir Kapoor film, as after ROCKSTAR and BARFI, the talented boy was reportedly reading only innovative and fresh scripts for his next films quite intelligently. Now what did he see in the script of YJHD as novel or fresh, remains out of my understanding and the actor must have done it just for the sake of his relations with the director and the production house, as it seems. Because in reality, if anyone else (with not a known name) would have gone to him with such a routine script, hugely dependent upon its youthful gags and sequences only, then he would have rejected it right away, without giving it any second thoughts. So that should say it all as per the plot line of the film is concerned.\n\nYJHD begins on a good note and then offers you nothing in terms of story-progression in its first half. Further, post intermission it continues delivering everything predictable and never comes up with something exceptionally different or unique till the ineffective climax. The at your face promotions of brands like \"Make My Trip\", \"Appy\" and more turn it into a sub-standard product and the additional 'Madhuri's item number' too fails to serve any desired purpose. It slows down repeatedly at many places in the second half and also remains a bit lengthy film for such kind of known plot where the viewer already knows what's going to happen next.\n\nThe technical merits of YJHD include its witty one liners, catchy cinematography and enjoyable soundtrack from Pritam. Though the background score is strictly OK but it's the songs which infuse new energy into the film, every 10-15 minutes as its big saving grace. Particularly the choreography in 'Balam Pitchkari' & 'Badtameez Dil' is hugely enjoyable, featuring some nonsense lyrics too which actually go un-noticed due to the catchy melody.\n\nIn the performance department, as expected, it's a Ranbir Kapoor show all the way. To say the truth, minus Ranbir's honest & visible efforts, the film falls flat since it has neither anything new nor any major unpredictable twists to keep you glued. Putting it more brutally, both WAKE UP SID as well as YEH JAWAANI HAI DEEWANI couldn't have made it to anywhere without Ranbir Kapoor. Deepika looks gorgeous in all her revealing dresses & acts well too, but her badly written role doesn't let her make any huge impact right till the end. For example, after 8 years of college life (studying medicine), the girl must have reached a status (as a doctor), whereas the film makes no mention of it in any scene post intermission. Aditya Roy Kapoor impresses once again even when he doesn't have a full length role here as Ranbir's only friend. Kalki is just the same like in all her previous films and I didn't find any change in her portrayal of the fourth friend. Both Kunal Roy Kapoor & Tanvi Azmi are good but Dolly Ahluwalia remains underutilized in her 2-3 scenes only. Similarly Evelyn Sharma looks sexy & appealing in her small role but Rana Daggubati just comes and goes without making his presence felt.\n\nHowever, apart from everyone else in the film, the scenes I enjoyed the most were the ones between Ranbir Kapoor and Farooq Sheikh who is simply adorable as the loving father of his passionate son, eager to follow his dreams. Particularly their sequence towards the climax is truly moving, redefining the father-son relationship on the screen, in just few minutes.\n\nSumming up, YEH JAWAANI HAI DEEWANI is a perfectly packaged film for the youth, which is purely made to succeed in the first three days of its release and nothing more. Beyond that neither the makers are interested in re-creating any cinematic history, nor has the film got anything substantial to prove itself in the long run. In short, its just another big budget Bollywood film which relies majorly on its Star value, music and marketing gimmicks, more than the content.\n\nSo, if you just want to have a marginally good time in the theater, laughing occasionally and enjoying a few good songs thrown in at regular intervals to keep it going, then probably you may like it as an average entertainer. But in case you are expecting something great, inventive or unique from the actor of ROCKSTAR and BARFI then you are sure going to be disappointed a lot."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "deepak-manoor",
        "review_rating": "8",
        "review_title": "The Magic of Bollywood Romance is Back",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "akshay-ak-kumar",
        "review_rating": "6",
        "review_title": "Good but way too long",
        "review_detailed_main": "Its a movie which was divided by two halves....the first half is excellent !! Fast , funny one liners, exotic locations and gr8 chemistry btw Ranbir, Kalki and Aditya !!\n\nBut Ayan Mukerjee shld know that u can't make an epic from a wafer thin plot. The story drags and drags....jokes dry up ....only music and dance keeps u awake and interested !! And the last half hr is a huge disappointment !!\n\nFrankly, its a Deepika's movie....she is brilliant !! Ranbir...sleep walks thru his role. This is not Barfi stuff. Kalki is superb while the bros...Aditya and Kunal are adequate. Farooq Sheikh deserved more screen time....what an actor !! And what the hell was Rana Daggubati doing in this film ??"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "BelieveOnePictures",
        "review_rating": "10",
        "review_title": "For entertainment, you must watch it! Critically, a maybe.",
        "review_detailed_main": "Hi,\n\nMost romantic Bollywood movies nowadays fail to entertain you because they are so sad, and depressing. Or they have very cheesy jokes. But Ayan Mukherjee has made Yeh Jawaani Hai Deewani as one of the best entertainments in Bollywood. Every single song is so beautifully written, with nice dance choreography, and amazing music! The movie keeps you engaged throughout, and has really funny moments.\n\nFor those really picky critics, they may say that the movie is a common script. They'll call the acting very basic, and nothing extraordinary. But I believe that not every movie has to be fully detailed, or needs a very different storyline with extraordinary characters. Sometimes you just want to watch a simple movie that makes you smile, and doesn't make you think really hard about what's going on. And that's exactly what this movie is.\n\nFurthermore, this film gives a good message. I will not spoil it for anyone, so I will not say what happened. But it gives you a good message.\n\nIf you don't want to spend money in the theatres, it's fine. But make sure you watch it in good quality.\n\nIt's a 10/10 for entertainment."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mazumdar-abhilash1993",
        "review_rating": "6",
        "review_title": "Not up to the Buzz produced",
        "review_detailed_main": "Yeh Jawaani Hai Deewani is the second movie of Wake up Sid fame Ayan Mukherjee. As Wake Up Sid was a beauty, he was not up to mark with this one, not disappointing as well..\n\nThe movie is all about Friendship,love, ambitions,fun, celebration and adventures. Contrasting characters made the movie very interesting. All the four friends are very different from each other.\n\nThe Jokes and gags in the first half are fantastic and you will definitely laugh out loud.But the second half of the movie dips gradually and the movie is way to long for today's busy audience.\n\nComing to the performances,all of them are outstanding making it a fun watch at the end. Ranbir the ambitious person and at the end a man in love is extraordinary, Deepika from a boring to a fun loving girl is something to watch and till date its her best performance. She adds layers to her character.Kalki is the surprise package, she is above expectation, again a awesome display.Aditya Roy Kapur is cute and adorable, he is effortless.\n\nHats off to the Cinematographer for capturing such outstanding scenes. All the scenes looks beautiful and full credits to Cameramen.\n\nAyan Mukherjee has done reasonably good but not as his first movie.Dialogues are good, narration of the story is somewhat ordinary as the first half is fast and the second half is very slow paced.\n\nOverall it is a nice entertainer. Don't expect much just watch it and you decide ..."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "eh5963-297-967354",
        "review_rating": "8",
        "review_title": "A lovely love story!",
        "review_detailed_main": "Indian cinema is progressing in rapid speed. Gone are the cheesy rom-coms and over the top action movies. Still, it's nice to see an older story in new treatment with some up to date situations and characters. Ayan Mukherjee's Yeh Jawani Hai Deewani may not be as path breaking as his first venture Wake Up Sid, but it still manages to keep the viewer intrigued.\n\nTruth is, if you've had a stressful week and want a full on entertainer that not only enlightens but also educates about life - YJHD is absolutely what you need.\n\nNaina is a nerd who has spent most of her life in books and probably has done nothing exciting in her life. She one day bumps in to Aditi who is a carefree girl about to go on an adventurous trip with friends Bunny and Avi. A boring Naina falls for the spontaneous Bunny but for reasons is not able to tell him, mainly due to the fact that he wants to travel the world and live life at full speed. It's 8 years later and one of the friends is getting married. Back comes Bunny, Naina and feelings...\n\nYJHD has many moments that make you smile or teary-eyed. The moments with Ranbir-Deepika are all classic! The chemistry between the 4 actors is noteworthy.\n\nThe best thing about the movie is the chemistry between the lead pair. Notches above than what they did during their first film together Bachna Ae Haseeno.\n\nDrawbacks? Yes, a few. First off, the Ghagra song featuring the evergreen Madhuri Dixit is not needed and if it was to go in the film, it should have been better placed. Also, Ranbir's relationship with his stepmom should have been better explained.\n\nPritam's music is fantastic. Every song is awesome. Badtameez Dil, Balam Pitchkaari, Ghagra, Dilliwali Girlfriend, Kabira, Subhanallah etc are all chartbuster material.\n\nThe writing is brilliant for the most part.Especially in the first half.\n\nAyan Mukherjee's direction is first rate. This is a bigger film than his last and he's handled such a big task so well. Looking forward to his next.\n\nAditiya Roy Kapoor and Kalki are perfect for their roles. They are just brilliant in every frame. Supporting cast is good too.\n\nAll said and done, it's the lead pair that take this film to a whole 'nother level. It's really what you take back with you. Ranbir Kapoor is charming as ever and of course, he's the best of his generation when it comes to acting. Deepika springs a surprise here and she looks stunning even in specs. This is her best act yet.\n\nOverall, YJHD is an entertainer all the way. Watch it for a smile."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "arushigarg14",
        "review_rating": "6",
        "review_title": "Enjoyable Sequel to Wake Up Sid, Tribute to Indian Cinema but nothing fresh about it.",
        "review_detailed_main": "If Bombay Talkies went all out paying tribute to 100 years of Indian cinema building extravagant, if not exaggerated, castles of how deeply films have had an impact on the ordinary and extraordinary lives of the Indian people, YJHD does so in a simple,everyday, almost nonchalant way. The movie is about regular people who, like you and me, complicate their lives when it gets too easy and detangle it when it gets too complicated. It does not speak of a love which in an idealistic, tempestuous, all encompassing manner prevails against all odds and enemies like the hero of the Hindi movie, but it speaks of one which is found and realized through a journey of self-discovery where life sometimes comes in the way and sometimes shows you the way. It speaks of success and failure in the same breath just as it speaks of the wild and the calm spirit. It touches base with the very urging topic of the \"Fear of Missing out\" of today's times. It speaks both of letting go and moving on as well as of compromising some dreams for the promise of companionship. And it does all this in a typical Bollywood masala movie, song, drama, friendship, emotion, family fashion.\n\nThe movie packs powerful performances by the supremely talented Ranbir Kapoor who is clearly growing into the star of the decade. Kalki Koechlin as always portrays her part adeptly , not forgetting to mention Kunal Roy Kapoor who even in his small part stood out and shone, albeit from the sidelines. Deepika Padukone looks her gorgeous, beautiful, desirable self delivering a fair acting performance and wonderful and best yet dance performances. Aditya Roy Kapoor does his part fairly well, his dialogue delivery reminding you of a certain Mr. Farhan Akhtar. He might prove to be a decent crowd puller in the form of a female fan following but still needs to improve if he wants to look effortless. Rana Daggubati can hardly be commented upon in his blink and miss cameo but Madhuri Dixit sparkles like a goddess in hers. The surprise at her appearance in such an item number cameo can only be outdone by the bundles of grace that she brings to the \"item\" song and dance routine which in spite of its raw theme was served in a wholesome, refined package. Ranbir manages to match step, performance and presence with Madhuri in Ghagra while outdoing his own dancing skills in Badtamiz Dil. Farooq Sheikh, Tanvi Azmi and Dolly Ahluwalia perform impeccably while Evelyn Sharma is forgettable in her role.\n\nAyan Mukherjee can easily be called the king of coming-of- age Indian cinema in today's times. He takes a mediocre story and screenplay, which is also his own work, and prepares a palatable dish out of it which moves at a comfortable pace. He is supported by a brilliant Manikandan who gives his best work so far weaving magic with his camera work capturing everything from the snow covered terrains of Manali and Kashmir through the aesthetically shot streets of gorgeous cities like Venice and Paris , from the forts and lakes of Udaipur to the gloriously shot sizzling dance numbers. The humour content is healthy and the dialogues are average except for the very well placed one-liners from various talked about movies down the long path of the Indian film industry.\n\nThe music, by Pritam, is youthful, catchy and keeps an eager interest alive for the viewer in the movie and complements the flow well but it fails to qualify for any spots around extra-ordinary or new. Songs like Ilahi and Kabira could possibly be remembered as soulful melodies while Ghagra, Balam Pichkari and Dilli Waali girlfriend might live on as potential dance performance music. Lyrics are strong and fresh in that they aren't predictable, but at the same time, do not lend a hand to the storyline of the movie. A possible exception is Kabira which is YJHD's version of Iktaara denoting similar transformation. Choreography is energetic, fresh and reverberating.\n\nThe movie reminds you of DDLJ at more places than one and seems like a contemporarised version of it where the characters themselves, rather than their families, stand in the way of love and togetherness. It paints nothing very new on the canvas of Indian cinema but is a befitting tribute to Bollywood while staying true to the ways and thinking of the current generation of Bollywood buffs. It picks up where Wake Up Sid leaves off and speaks of settling down where Wake Up Sid speaks of rising up. Most importantly, it serves as a reminder to today's omnipotence and ubiquity chasing youth to stop running and slow down. - \"You cant do everything. There will always be something that you miss. So its better to live the moment and enjoy where you are now.\""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mnsh-prasad12",
        "review_rating": "2",
        "review_title": "Ayan Mukherji and Karan Zohar need to swap credit.",
        "review_detailed_main": "Guys its typical Karan Johar movie the only difference is it didn't start with letter K. Ayan i didn't expect this kind of movie from you not because i bought tickets in black for this movie but you had showed us a nice story through Wake Up Sid and you deserved national award for that but YJHD its really put you in a league of entertainment cinema without story. I wish you will go back to same liking level of audience after WUS and before YJHD. And for Ranbir Kapoor .. Why did you choose this story..i know you liked to do different kind of films and with different characters ..but your character Bunny was similar to your movie BAH but its has some good connection points but in Bunny the flow of the character was really unrealistic like Karan Johar's movies character. Last but not least ...the film credit should goes like this Karan Johar -Director and Ayan Mukerji- producer."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sambuddha376",
        "review_rating": "8",
        "review_title": "Bollywood's answer to Hollywood's summer blockbusters",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Utsab_Bandopadhyay",
        "review_rating": "7",
        "review_title": "Feel good factor of youth tackling ambitions and life",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "saima1",
        "review_rating": "1",
        "review_title": "Please don't bother wasting your time",
        "review_detailed_main": "This movie was beyond awful... 1 star seems too generous honestly, it was the most hyped movie. I was so disappointed to see the movie. Which turned out to be an exaggeration of the trailer (that did seem quite promising at first). But anyway the movie itself had nothing else to offer, nothing new and was quite predictable as to where it was all heading. I'm ashamed that such a movie is still applauded by people when there are movies that get half as much recognition and really have talent! I walked out of the cinema during the ending because it was so awkward to watch. Don't get me wrong, I love Ranbir and Deepika as actors but this seemed like they gave it no thought when they decided to act in it and only went in it for the chance to somewhat flirt with one another all in the name of a \"movie\". The only good thing were the songs but after seeing the movie I didn't see their point because they had no story to them either. I usually like the songs better after seeing the movie."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "pnvl2011",
        "review_rating": "8",
        "review_title": "Good one with amazing performances entertains especially the youth audience",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "atiqsinin",
        "review_rating": "7",
        "review_title": "Good Timespass",
        "review_detailed_main": "Review : The story of 4 friends. Bunny (RK),Aditi (Kalki),Naina (Deepika) and Avi (Aditya). When three of the friends are discovering their life,Naina is just studying,what she is been doing from her school days.Then she meets her classmate Aditi and somehow manage to go on a trip with her friends Bunny , Avi, Aditi.Then various things happen ,they rediscover them selves and can they reach to their destiny? . My view : It is a typical Bollywood Rom-Com flim with a modern day flavour. You should enjoy the movie if you don't really try to think that much about some things like: How Naina suddenly changed where her glasses goes ? Suddenly it seems like their among affairs with each other and after sometimes they are just friends. . But their is some fun,lessons (mostly impossible),thoughts you can get.But you must think there could have been a lot more with this extraordinary plot.\n\nTop of the actors (Among Leads): Deepika Padukone.Though her transformation was illogical but she suits really well in both of her characteristic.\n\nFlop of the actors : Kalki koechlin .She is a great actress.But the dialogue delivery with hindi doesn't suit her.\n\nMy Rating : 7/10 .\n\nFor more reviews stay connected to : fb.me/sinix75"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "saytosandeep",
        "review_rating": "8",
        "review_title": "MY REVIEW: Something is left out...doesn't matter",
        "review_detailed_main": "\"Doesn't matter how hard you try, there will be something left out\". The movie states this loudly and actually the same can be said for the movie. The movie has one of the finest cast possible with awesome music. But then you have a predictable story-line and a prolonged sangeet sequence. You have Ranbir Kapoor brimming with unstoppable energy sharing the scorching chemistry with gorgeous Deepika. But then the director tries to pack-in too many things in those 2.5 hrs. But in the end, you can safely say you had a great time watching this rom-com because the movie has always its heart at right place. Deepika gives her best again after cocktail. Aditya Roy Kapoor (Ashiqui 2 fame), Kalki and Farooq Sheikh, all give their best shot. Ayaan who gave us Wake Up Sid shows that he is here for long run. Ranbir Kappor showcases his dancing skills with irresistible charisma in songs like \"Badtameez Dil\" and \"Dilli Wali Girlfriend\". All in all, you have 2013's first major blockbuster which entertains and provides food for though in equal measures."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "riskamalda",
        "review_rating": "7",
        "review_title": "I like it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "aminifatimaaa",
        "review_rating": "8",
        "review_title": "great movie, greater emotions",
        "review_detailed_main": "This wasn't just a Bollywood movie soley made for entertainment. This was a movie about emotions, about how people change, a movie about love and passion. An adventure full of growing up together as friends to figuring out what truly matters in life and time later on. An emotional start to the journey of Bollywood films that lie ahead."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rudrkadam",
        "review_rating": "7",
        "review_title": "A must-see movie to fall in love with!",
        "review_detailed_main": "\"You can never be old and wise... If you were never young and crazy.\" Someone, who means a lot to me, suggested me to watch this movie. And, TBH this movie is just awesome! I loved it and I bet you'll also love it."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sashank_kini-1",
        "review_rating": "2",
        "review_title": "Ayan Mukherjee's Yeh Jawaani Hai Deewani isn't an effort but an attempt at direction, a miserably lazy one that too. Yeh Jawaani Hai Puraani, Bahut Puraani.",
        "review_detailed_main": "'Yeh Jawaani Hai Ghissi Pitti' 'Yeh Jawaani Hai Puraani''Wake Up Sid (Hangover Version)' could easily become alternate titles for 'Yeh Jawaani Hai Deewani'\u0085 no, let me change that a bit – more suitable titles for Ayan Mukherjee's sophomore effort\u0085 no, not really an effort, more an attempt at direction.\n\nHe serves you cold soup this time and that isn't the worst part – he also serves you the same soup. With a heavy handed treatment; it feels like your college canteen's old lunch lady's made the soup. That's how lazy Ayan Mukherjee is this time - his story is trite, his dialogues are stale, his characters are hackneyed, their situations clichéd and their resolutions tiresome. This guy seriously needs to grow out of this 'follow your dreams' 'accept change' 'settle down' phase; yes, he got his chance in 'Wake Up Sid' and he fared well, but this is plain directorial lethargy.\n\nDeconstructing Yeh Jawaani Hai Deewani's plot shall begin with a cliché – it's about four young friends. Oh, a respite – two are boys and two are girls so it's not the 'all-guy film' or the 'all-girl film'. This film starts with one of the girls reminiscing her past, as the other is to get married. The girl who's narrating is Naina Talwar (Deepika Padukone), and she takes us eight years back into the past, when she was studious, plain-Jane, good-girl Naina. And as all studious good-girls need to be spectacled, she dons one. Still looks hot in it, but since it's Bollywood and spectacles is equal to 'behenji or nerd', our Naina's totally ignored by guys.\n\nShe's in the supermarket with her snobbish mother, shopping in her little skirt/shorts (anyway, she's showing legs, but nobody notices because she's got 'spectacles' on). She hears someone yell near the exit counter; it's Aditi, her former schoolmate. Aditi is mad at a young stout kid who was checking out her legs (according to her). He tells her she's not that hot – she gets madder. Naina approaches her, they greet, Naina's mother talks about her daughter, Aditi praises Naina for being the 'padhaku' type and then tells about her trip to Manali. The scene ends with Naina being secretly invited by her to the trip.\n\nNext scene at dining table. Naina's mom's insulting Aditi for being the 'bad girl'. Naina throws a tantrum with 'I want a holiday' and then leaves the table. Next we see her checking out Make My Trip Site, probably co-sponsors for this film because they're everywhere! Our brave girl Naina slips out the next day and joins Aditi for the trip but Aditi isn't alone – she's with Bunny and Avi.\n\nWe're already introduced to these two chaps – Bunny is the photographer who dreams of travelling around the world (for some reason, Ayan can't think outside the box; Ranbir Kapoor in Wake Up Sid = photographer, Ranbir Kapoor in Yeh Jawaani Hai Deewani = photographer) while Avi is an alcoholic who loses lots on gambling (no idea how he gets the money). We first find Bunny in a brothel filming with a foreign crew about prostitutes; so there's the usual 'spicy talk' with the prostitute, then a totally purposeless dance number featuring Madhuri Dixit. But we know why it's been added – it's a Karan Johar production, he was a judge with Dixit on a dancing reality show, he must've thought it appropriate to randomly place her in a dance number that's got NOTHING to do with anything. She looks lovely though, and her dancing is sensuous and expressive but why on earth (or why in a brothel of all places) is it there?\n\nSo Bunny's the photographer who calls his step-mom 'step-mom' (ridiculous and childish – why not the first name?), Avi is the faltu (useless) alcoholic, Avi is the cool girl and Naina the 'scholar'. All board the train to Manali, their trip being sponsored by MAKE MY TRIP (they could've just had the four break the fourth wall and shout 'I love Make My Trip!). They meet hot chicks, and Bunny has a crush on one of them called Lara, a hot but dumb chick like you see in every other college movie; the girl actually has a background music' played whenever she's on screen and it's so kiddish, your brain feels embarrassed that it has gifted you the power of hearing for these sounds. Okay, so on trip our Naina loosens up (she wears lenses and voila turns into a hot crazy babe in a day), begins enjoying life (she gets drunk. Don't tell her fussy mom though) and falls in love with Bunny, who's commitment- phobic. There's a scene where both Naina and Bunny scream from the edge of a hilltop and you really wish they'd slip and fall to their deaths so the film could surprise us.\n\nThe film never does surprise us. Our hero Bunny leaves for US after the trip, Naina becomes Aditi's best friend, Aditi decides to marry a podgy guy named Taran after Avi doesn't reciprocate the feelings she has for him, while Avi remains a drunkard and is in huge debt. The second half's more embarrassing and most of its set around Aditi's marriage. Random characters come and go and we are meant to chuckle (we don't, not once). There are the 'buddy movie serious scenes' we don't give a rat's a— about; they're a chockfull of banal moments stuffed with platitudes you'd find on Facebook, written by IQ 100 boys and girls who only think their crappy thoughts are profound.\n\nThis kind of film minting hundred crores at the box office is sheer criminality. Don't encourage Ayan Mukherjee to make more like these! Stop Johar from making money like this!\n\nAnd do reconsider your Make My Trip subscription if you have one – they'll take you to Kashmir, calling it Manali!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ishaansdeshpande",
        "review_rating": "10",
        "review_title": "No movie can just beat this one. The best ever!!",
        "review_detailed_main": "A movie to watch whenever you are down, not feeling good or just feeling whatever and whenever this movie will just make you feel the best of inside you. The movie just makes us value all the precious we have in our life. The movie has some lines which are now classic lines everyone will always remember. The movie just moves us completely and in some part we can all relate to this. The trek the friendship bond and the fun they have all over the movie is just the best. A suggestion; there might just not be any deepika running towards you on the station, so just dont do a trek for that and ya take a trekking stick if you are going to plan a trek with your friends after the movie:)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sohamvhadgir",
        "review_rating": "7",
        "review_title": "Something different",
        "review_detailed_main": "So I girl who never makes friends but in trip he make friends and love him because after that her life's change but for me it's not love story the movie where we learn friendship,life's, losing you old memories and so many the movie focus on Binny life but the way they represent him and the devlopment of od Binny is so amazing the ending and starting is too amazing or Binny and we can learn something the relazing of his father was something emotional for me and last he regrate that we want for this father for its something different movie because her we saw changes of four friends and ending that I want in this movie and I get it."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "hydbad-info",
        "review_rating": "1",
        "review_title": "Full of time waste",
        "review_detailed_main": "This could be a great ragging material. I do not understand what movies director think about Indian public. I went to watch this with friends with great excitement and this excitement could last only till first 20 minutes . We started hearing whispers from rest of audience which made us a bit more confident that we are not alone. It may be other way round as we may not be targeted for this movie. But I am very much interested to interview to anyone who was targeted for this movie and praised it. This film in simply nonsense, moreover, it is so called a dedicated to \"Youth\". The only thing I liked in this movie is that it got over before 2 and half hour otherwise it would have been made me mentally sick."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "akhilsyngal",
        "review_rating": "9",
        "review_title": "Friendship & love forever",
        "review_detailed_main": "By far one of the best films I have watched . It's a pure entertainment Bollywood masala film which will keep you entertained & make your day . It's adventure , fun would encourage you to travel to a hilly or exotic location .I feel so lucky to wayltch this film in theater."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ahirjoy",
        "review_rating": "7",
        "review_title": "Good !!!",
        "review_detailed_main": "Yeh Jawani Hai Dewani - Definitely worth a watch, a pleasant experience. The director Ayan Mukerji has done even better job after \"Wake Up Sid\". Though Ranbir(Bunny)-Deepika(Naina) chemistry has done wonders, still I was blown away by Ranbir's wonderful acting yet again as smart, confident, charming, ambitious young star this time. The houseful RDB was a proof that Ranbir will go miles from here, he is the king of the teens and young hearts (and yes, the news is, I still consider myself young!)! It is not only a Rom-Com movie, in few cases it has gone very deep into emotional turmoils which we face sometime between a golden overseas career and relatively simpler but content life with our near and dear ones. People may not like the happy ending and expected decision, but I liked it very much personally as it vibrated my own decisions. The songs by Pritam was very good, specially \"Fakira\" was awesome. I was bowled out by Maduri's item dance, she still looks the same when I was 10 ;-). Kalki did another brilliant job after Shanghai in limited time. Aditya Ray Kapoor and Farooq Sheikh was also good in their roles. Manali where Bunny and Naina met for the first time was picture-perfect, hats-off to the camera crew, I don't remember the names, but it is people like them who make the difference. The story is simple, so no point in telling it here, instead go and enjoy. Overall 7/10 from me."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rishi_ff",
        "review_rating": "9",
        "review_title": "I liked it",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "tushargupta-27286",
        "review_rating": "6",
        "review_title": "Nice",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rinmoy-talukdar",
        "review_rating": "8",
        "review_title": "a new era of bollywood movies",
        "review_detailed_main": "After a week of its release and crossing the 80 crore mark and racing towards the 100 crore mark i finally decided to give the film a watch and i would say i wasn't disappointed.After a very long time i saw a movie which is fresh!If not for Ranbir Kapoor or for Deepika Padukone then you can actually watch the movie for Ayan Mukherji who has such a brilliant way to express his story.The way he has put forward his story which is quite simple but indeed so powerful because of the way he has described the film.One thing is for sure that while writing the script of the film he had actually pictured Ranbir Kapoor for the role because trust me no one else would fit into the role ever,even he would have you would actually want to watch Ranbir in the film because he has been so wonderful in the film.He is the finest actor we have now in bollywood and you can actually see that in his performance in the film throughout.It is really a question that how many actors be it Veterans or the youngsters of his age could actually perform like him!His lady in the film Deepika also got a chance to shine in the film.According to me its her best performance till date!She has beautifully described \"Naina Talwar\" a geeky girl who is bored with her life and needs a change!Recollecting an interview of hers she mentioned how did Ayan make her cry on the sets when she cracked a joke saying it was too cold and she didn't want to shoot and how Ayan scolded her saying that she didn't know what was this film gonna do for her career,it indeed is true!Talking about other actors Aditya Roy kappoor was OK throughout,it seemed he couldn't get out of the hangover of Aashiqui-2 where he was a troubled musician lost in alcohol and it continued in this film too.Talking about Kalki Koechlin she was kind of OK too and her better half a healthy cameo by Kunal roy kapoor was good too! Not missing out the powerpacked performance of Farooq shaikh who returned to the industry after quite sometime was brilliant.Both of the scenes he was in was actually quite incredible.All the songs in the film are quite wonderful and you want to keep on humming it once you leave the theatre.So its a must watch for youngsters who are bored of the high action packed flicks running adjacent to the film Yeh Jawaani Hai Deewani.I rate it 8 out of 10.\n\nP.s this is not a script where i would rather disclose the script of the film! dor that i would rather want you to yourself watch the film! I just did mention the key fctors for which this film is worth 8 out of 10."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sa_a",
        "review_rating": "7",
        "review_title": "Watch for Deepika and Ranbir!",
        "review_detailed_main": "Yeh Jawaani hai Deewani- 2013 Director: Ayaan Mukherji\n\nMuch more is expected from a writer and director like Ayaan. The movie has a really big star cast - Ranbir Kapoor, Deepika Padukone, Farroq Sheikh, etc but they fail to stimulate except Ranbir Kapoor and Kalki Koechlin. Undoubtedly the film has the best song collection of 2013.\n\nIt seemed more focus was given on the dreams of Ranbir as he remained the centre of attention in the movie. Overall the film set, the colors, songs were perfect but story lagged at several points, still it was loved by all despite of having errors in it.\n\nAnd as usual Aditya Roy Kapoor was found drinking to solve his problems. Eh !!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "aashutosh-vyas",
        "review_rating": "5",
        "review_title": "we have seen it 100 times haven't we?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "souparnorules",
        "review_rating": "8",
        "review_title": "One blast of a time",
        "review_detailed_main": "YJHD is one remarkable movie of the youth romance and drama genre. It is an absolute feel good movie. The four pivotal characters are brilliantly portrayed by the superb cast. Deepika, Ranbir, Kalki and Aditya lit up the screen. The director Ayan Mukherjee also deserves due appraisal. It's a must watch. The music is vibrant with excellency! Overall, I must say it is a movie to be remembered down the line."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "iampavan-92166",
        "review_rating": "6",
        "review_title": "Good movie",
        "review_detailed_main": "When trailer came of yeh jawaani hai deewani peoples are having lots of expectetion and movie also match peoples expectetion.\n\nRanbir kapoor have a ultimate character in this movie he want to live today don't want leave on tomorrow. He want to see whole world and made a list what thing want to get first. And he had a camera and want to shoot everything in this.\n\nDeepika padukone is a medical student she has not frnds and don't want to share life with others. And finally she got married with Ranvir kapoor.\n\nAditya Roy kapoor is a full time drinker character he don't want to do anything only he had focus on the liquor kalki love him but he never fell it and juse West whole life with drink.\n\nKalki have a cute girl character and she have one side love with Aditya.\n\nOverall movie is nice please watch it and I want to see it hit on the screens."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mydarkside1982",
        "review_rating": "2",
        "review_title": "Clearly Must NOT Watch !",
        "review_detailed_main": "DISCLAIMER: THE ONLY PURPOSE OF THIS FILM IS TO TAKE OUT Rs 250 FROM YOUR POCKET AND PUT THEM IN OURS!\n\nWhile I know a lot goes into movie making and it is unfair to simply rip it apart, this one deserves it. \"My anger outweighs my guilt\" First, do not believe any reviews that rate this movie any better than 2/10. They are most definitely paid!! Second, AVOID this film at all cost. Remember, the ticket might come free or it might someday be aired. But the time spent has a value too!\n\nWhy not to watch? #1. Well, you have seen this brand of movies a million times before in Bollywood. One strong reason. #2. The performances are also lackluster from most stars, except for Kalki. I would mention Ranbir and Dipika. Just a mention. No praises. #3. Direction was not really required. The producer could have cut budget by excluding the Director's fees. Even with just the stars and a cameraman, the film would have been better. #4. Script! This is THE STRONGEST POINT of Why-Not-To-Watch!! The script is tailor-fit (not made) to en cash great locations and all the Bollywood masala of hot girls, dance number, shaadi and the drama that follows. There ARE NO characters in the real sense. You can actually feel the confusion of the script and the lack of work (forget depth) in the end-product. The twisting and tampering of the original script at the discussion sessions and even the reckless insertion of marketable scenes is felt by the audience. I am being considerate while assuming that there WAS indeed an original script. Chances are high that it is a script prepared right on the sets.\n\nSo even if you are of the Jyada-Dimag-Nahi-Daalneka type STILL AVOID ! Your bucks are precious ! Teri-mehnat-ke-paise-hai !\n\nSo why did I give it even 2 points ? Well 1 goes to the cameraman and the other goes to Kalki's performance.\n\nAdd one more to the #HopelessBollywood !!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "MehdiRizvi-7867",
        "review_rating": "10",
        "review_title": "Entertaining And A Beautiful Love Story",
        "review_detailed_main": "\"Kabhi kabhi kuchh baten hamare yaadon ke kamre ki itni khirkiya khol dete Hain ki hum dang rhe jaate Hain.\"\" Yaadein mithai ke dabbe ki tarah hota hai ek bar kholo to sirf ek tukda nahin kha paaoge.\" This is one of my favorite movies . I can't extoll how good this movie is... The movie is completely explain about Love , one-sided love , family issue , friendships , life , economy etc... Personally i recommend to everyone to watch this , especially for the one who is sad or depressed should definitely watch this movie .... Hope this movie is blessing for those who wish to fly , wish to run , wish to fall down just don't want to brake. For those who wants to live every single breath of their life .\n\nAnd the location were awesome (Manali & jaypur, Rajasthan) and all the songs are very beautiful, u can feel them.this has drama, comdey, best dialogues n lots of emotions and many others things ... Deepika Padukone , Ranbir Kapoor , kalki koechlin & Aditya Roy Kapoor were like real character . It teaches us we get one life so enjoy do everything what u want do... There is my favorite line of Naina \"jitna bhi try karo, kuch na kuch to chootega hi. Isliye yahan isi pal ka hi maza lete hain\""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rahul-rdthecool-das",
        "review_rating": "7",
        "review_title": "Funny casual movie",
        "review_detailed_main": "Though it didn't meet up to my expectations but it is not that bad at all.\n\nIt is all about friends and friendship mainly.\n\nExpect a lot mature stuff than this from director ayan Mukherjee.\n\nMusic and set design of the movie was good."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "geetikanair",
        "review_rating": "9",
        "review_title": "One of the best movie from bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "kunalkhandwala",
        "review_rating": "6",
        "review_title": "Unmeaningful, overacted and underwritten youth story",
        "review_detailed_main": "Stardom can achieve a lot in India. Apart from convincing masses to buy various products, it can turn dud scripts into blockbusters. Ayan Mukherjee tells us something about the youth, yet again after 'Wake up Sid'. Is he representing the current generation? Is he out to inspire them? Does he have an undying message in the life and travels of Bunny Thapar? Disappointingly, it is none of the above. 'Yeh Jawani Hai Deewani' rides on the back of Ranbir Kapoor who at times, appears lost in bland scenes and tries hard in others to put life in them. The anguish can be felt by some of the audience and instantly they can conclude that this melodramatic, cheesy and inebriated representation of a non-existent class of youth is just over-the-top.\n\nThe wafer thin plot revolves around Bunny's (Ranbir Kapoor) aspirations of carefree world travel. Not only does he have to convince his father (Farooq Shaikh) to let him live his dream but he must then tolerate his friends, the loud and indecisive Avi (Aditya Roy Kapoor) who has some occasional funny dialogue and Aditi (Kalki Koechlin), who was frankly better off in Kashyap's realistic films since the fake vibe she carries is terribly unconvincing. Then of course, they take a 'make-my-trekking-trip' to Manali, joined by the studious Naina (spectacled Deepika Padukone) who must awkwardly endure the games, flirting, drinking and street fighting that the others so happily indulge in. Thereafter, Bunny travels abroad for his education and career, without much happening in that phase apart from solitary moments of photography, random hook-ups and pensive introspection. Then suddenly, he gets a video invite to Aditi's wedding in Udaipur where they are all back to flirting, drinking, fighting and a lot more dancing this time.\n\n\"I want to fly, I want to run, I even want to fall but I don't want to stop\"... at the surface, Bunny's philosophy is alluring but without the backing of a script to support it, those lines just fade away into drunken indulgence. On one hand he claims to enjoy his way of life and on the other, being love struck, his conviction melts in a lip-lock scene. His dilemma is his weakness and perhaps the film's major drawback.\n\nThe immaturity and inaneness of several scenes contribute to the incredulity of Mukherjee's script. Now he leads the folks of small towns and villages to believe that city-dwellers are a part of this cool culture where girls call each other 'dudes' and a guy addresses a girl as 'Man'. To add to that, the pahadi folks would feel miserable about their own lives knowing that city people can hike up the snowy peaks while being dressed for a party, drinking along the way, listening to their music on large headphones and then discover German mountaineer parties over the next hill. The other harsh reality that is uncovered by Mukherjee's vision is that as you start traveling around the world, you tend to grow an ugly beard because you don't have to give a damn.\n\nEventually though, Mukherjee gives rise to the much needed maturity in the film when Bunny and Naina struggle to relate to each others' lives and conclude that \"tum galat nahi ho, sirf alag ho\". Only if the conclusion of it all had been along those lines, the film would have been more realistic and meaningful.\n\nRanbir Kapoor rides the film on his shoulders. As versatile a dancer that he is, Ranbir also pulls off comedy, tragedy, indifference and seriousness with equal credibility. With just a handful of memorable dialogues, his potential hasn't been realized by Mukherjee and to make it worse, the supporting cast does not match up to his level. Kalki Koechlin was impressive in Anurag Kashyap's films but she seems quite out of place here. The first half of the movie is overacted with loudness that gets irritating. Aditya Roy Kapoor too tends to be louder than required and is reduced to the most poorly written character in the movie. Farooq Shaikh extended a favor to the director by taking up his role which wasn't worthy of such a fine actor. Deepika Padukone still struggles with the simplest of roles and tries to drive attention to her skimpy clothing rather than expressing various emotions. Her spontaneity may have improved but versatility and credibility of her character are still lacking. The true star of the film however, is Manali and its surrounding snowy scenery. The Himalayas have seldom been depicted in such spectacular fashion and the scene on the mountain top is awe inspiring (only to be spoiled by Ranbir's unnecessary screaming).\n\nThere are too many songs by Pritam in this Deewani Jawani. Balam Pichkari is a catchy holi song while the Madhuri Dixit Via Agra track is forgettable. Kabira is melodious but reminiscent of Iktara. Badtameez Dil is fun to watch with some excellent choreography and upbeat tunes.\n\nAyan Mukherjee's attempt at portraying the lifestyles and challenging relationships of today's youth had some foundation but lost its way in the cheesy, incredulous delivery of the script. Too many fake characters delineate little more than indulgence in alcohol, women and the carefree attitudes. Zoya Akhtar's take on such a subject was far superior (ZNMD) in every aspect with depth in its story, characters and the exemplary direction. 'Yeh Jawani Hai Deewani' is just not meaningful enough for the viewer to care about the characters or story. Too much of it was over-the-top from the beginning to recover its credibility. Add to that, the occasional overacting and numerous songs that put brakes on an already struggling story-line. Bunny's character seems determined to live life his own way at times but still seems confused and uncertain about the long run. If that was the point of Mukherjee's film, then it should have been titled 'Wake up Bunny'."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "yednaptihor",
        "review_rating": "9",
        "review_title": "Amazing film with brilliant music",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "smg242",
        "review_rating": "7",
        "review_title": "Ain't a masterpiece, but if you're new to Bollywood, this is where to start...",
        "review_detailed_main": "Yeh Jawaani Hai Deewani (stylized as YJHD) is the routine Bollywood romantic-comedy-drama, with the backdrop of travel. It has all the elements of a typical Bollywood romance that you'd probably expect from Shah Rukh Khan, another Bollywood actor known as the 'King of Romance' in India. There's romance, bromance, bonding, as well as some drama.\n\nHeck, I'd call this a slight rehash of DDLJ (Dilwale Dulhania Le Jayenge), one of the most successful Bollywood films worldwide. But DDLJ is almost 20 years ago. This is a modern update on the story, catered for the audiences of today.\n\nIt has a great emotional angle to it, without the melodrama. If you see the film, you'll probably know what I mean. Also, the chemistry between the lead pair Ranbir Kapoor and Deepika Padukone is downright FIERY, and Deepika wildly excels in her subtle yet meaningful and deep performance as the introvert Naina.\n\nThe dialogue is hilarious at times, and the movie has it share of well- written scenes, which almost perfectly depict every character's emotions. The music is simply grand.\n\nYJHD isn't all that ambitious, and may seem like a bit of a departure from director Ayan Mukherji's last directorial venture, Wake Up Sid. But for those of you reading this review and are not living in India, you should really start with this film, if you want to check out some of Bollywood.\n\nGreat performances, simple story, fiery song-and-dance sequences, funny lines, and a romantic soul, YJHD is a fine successor to DDLJ, for the youth."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "adi8169",
        "review_rating": "1",
        "review_title": "awful film",
        "review_detailed_main": "first 45 min are LONG BORE WITH NO CLUES.their is hardly any story . their are hell of things not taken care of .director tried to do similar to ZNMD BUT HAD FAILED MISERABLY.this film is only to put Ranbir Kapoor in spot light , his dad might have sponsored the film. people choose to watch film based on its songs which were average. Deepika was even more disappointing. Kalki and Aditya do their part good , way better than other two. i wonder how this film makes this much money? Indians if u want some good quality cinema ignore such movies . it would send a message to the makers that we wont watch bulls**t . Deepika starts remembering what happened 8 years ago and never returns back. guide says the BUTA peak is dangerous to climb yet the first timer Deepika does it easily. guide says no one has ever returned from the peak yet they come down with out any mountaineering equipment."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ambivert_idiot",
        "review_rating": "8",
        "review_title": "Great Modern Bollywood Drama",
        "review_detailed_main": "If you are in bad mood or worried about future or overthinking, this movie is a perfect mood booster for you. You will find best dialogues, romance, dance, songs, dedication and the true friendship of modern era in the form of Karan Johar productions. But the ending was not of Karan Johar types. The dialogue 'Jitna bhi try krlo bunny, life mein kuch na kuch toh chhootega hi\" fits better on the ending of this movie as well. The ending could be like this: \"Aditi is getting married. Bunny and Naina smile at each other. Naina says him a sweet sa goodbye. Bunny's phone rings in a minute and he's off with his backpack. To a new destination while \"Illahi\" song plays in background. Avi got some investors and finally able to save his bar. Naina and Bunny both are happy they chose their life which is free from any boundaries.\""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "zlewis-964-927170",
        "review_rating": "7",
        "review_title": "A lovely coming of age movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "prasadgawali4",
        "review_rating": "4",
        "review_title": "Very disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "engrumair21",
        "review_rating": "9",
        "review_title": "Total Entertainer..!!",
        "review_detailed_main": "YEH JAWAANI HAI DEEWANI (Movie Review)\n\nONE LINER:\n\nBadtameez Dil Maane Na..!!\n\nEXPECTATIONS:\n\nExpectations were high from the very start. KARAN JOHAR production, AYAN MUKERJEE coming after WAKE UP SID, RANBIR KAPOOR with DEEPIKA. ADITYA ROY KAPOOR after AASHIQUI2. Everything was making it more to top. Music worked big time. Expectations rose day by day... And a Huge hype was there.\n\nVIEWS:\n\n1. For me YJHD is much more then my expectations.\n\n2. Total Fun total entertaining. The most fresh movie after ZINDAGI NA MILEGI DOBARA and at various occasions in first half ZNMD comes to mind..\n\n3. Beautiful Direction with good script and good dialogues..\n\n4. Cinematography was top notch..\n\n5. Music works totally with the movie. A total enjoyable music.\n\n6. Chemistry of the lead pair RANBIR KAPOOR and DEEPIKA is just brilliant.. They seemed extra comfortable with each other.\n\n7. All the characters were well defined and none was unnecessary even if it was for few seconds too.\n\n8. First half is just Mind blowing carrying full ratings.. Its the second half which has problem and that is , it is dragged and pace becomes slow at spots but overall a good second half too.\n\n9. A Friendship movie having romance, fun etc everything in it. Total YOUTHFUL.. YOUTH is loving it. But remaining all ages will love it too.\n\nSTORY & SCRIPT:\n\nStory is very good. Script is beautiful. Screenplay is Too good . Dialogues are brilliant.\n\nDIRECTION:\n\nAYAN MUKERJEE rocks in his second outing after WAKE UP SID which was loved by many. But in my opinion this one is much better than that.. His direction is beautiful and mature.\n\nMUSIC:\n\nMusic By PRITAM is total fun going with the movie and it becomes more catchy after seeing the movie. BALAM PICHKARI is the best of the lot. KABIRA is just excellent in the movie although I didn't enjoyed it much in audio hearings previously. Choreography of the songs is beautiful.\n\nCASTING & ACTING:\n\nRANBIR KAPOOR is without any doubt justified in superstar league. His hard work shows. His choice of movies is brilliant. He has acted beautifully again here.. It's His show totally. His acting His expressions, dialog delievery everything is great.. He is totally rocking.\n\nDEEPIKA PADUKONE is just mind blowing. Her one of the career best acting. She is so beautiful in the movie and even acts beautifully. She is too too good. And lead pair chemistry is awesome.\n\nADITYA ROY KAPUR after AASHIQUI 2 is in complete form again. He rocks.. A great actor to look forward too.\n\nKALKI surprisingly gives her career best here. At few places you cant believe that this is Her.\n\nKUNAAL ROY KAPUR and FAROOQ SHEIKH are too good in their respective parts.\n\nEVELYN SHARMA is total eye candy as her role demands..\n\nRemaining actors OK.\n\nPLUSSES & MINUSES:\n\nPLUSSES:\n\n1. Friendship, Love And Romance.\n\n2. Music.\n\n3. Actors.\n\n4. Chemistry between lead actors.\n\n5. Movie's Execution and direction, cinematography.\n\n6. Freshness.\n\nMINUSSES:\n\n1. Few places pace drops in second half and it gets dragged in second half too.\n\n2. Could have been trimmed easily 15 minutes..\n\nCONCLUSION:\n\nOVERALL a Total Fresh lovely Friendship movie with lot of fun, emotions, entertainment, everything.. Can't miss it watching in cinema. Go For It..\n\nRATINGS: 8.5/10."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "BubbleBollywood",
        "review_rating": "7",
        "review_title": "Youthful exuberance!",
        "review_detailed_main": "The Start of the motion picture is fortifying however it backs off amidst the second half,nevertheless the strings tie up exceptionally well at last and is certain to abandon you with a grin all over. Ranbir Kapoor is the work of art who figures out how to be not just maddeningly endearing,but loaded with that pizzazz . He entrances you with his look that make his character Bunny so adorable. Post Cocktail, Deepika makes her character unmistakable, mixing sympathy, sexiness with prosper. Aditya is the dim steed who gives a fine proof of his ability .Kalki resembles a tornado of ability that unfurls bit by bit as she stands her ground in spite of the nearness of Ranbir and Deepika. Farooq Shaikh, as Ranbir's dad, is just exceptional. Rana Daggubati shimmers in his cameo.\n\nYEH JAWAANI HAI DEEWANI is adorned with a young score by Pritam like 'Badtameez Dil', 'Balam Pichkari' and 'Ghagra' that are high-on-vitality influences you to have a craving for moving along and have just hit the fame graphs. 'Kabira' overflows a meloncholy song . The movement of 'Badtameez Dil' is super with Ranbir rotating to the tunes with amuse. Madhuri's quality in the 'Ghagra' track includes belief as well. In general, YEH JAWAANI HAI DEEWANI is a fabulous interpretation of sentiment and connections. this one should evoke genuine emotion with not only the young, but rather motion picture watchers of all age-gatherings. Its a motion picture not to be missed ."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "jamalnasir",
        "review_rating": "8",
        "review_title": "Much better than expected.....",
        "review_detailed_main": "This is the first review I am writing for a bollywood movie. I believe this movie deserves one.\n\nAfter reading reviews and keeping an eye on this movie for over a week, I was in two minds whether I should go watch this movie or not. There are so many negative reviews here that just make you think that this movie is going to be terrible and you should not have any good expectations before you go to watch this movie.\n\nIf you are a movie expert and pretty much watch every bollywood movie that comes out than you might not find this movie to be appealing. But if you are somewhat like me who occasionally watches good bollywood movies than I would recommend you go watch this and decide for yourself.\n\nAs other people have said, first half of movie is somewhat fast and is more funny compared to second half. Second half gets more emotional and reflects typical Indian love stories. But that does not mean that second half deserves to get 2/10. I would rate first half 8/10 and second half 7/10.\n\nAll the songs in the movie are really good and most of them relate to the movie very well. Only thing you might find a bit strange is Madhuri's role in the movie and that song at the start.\n\nIf you are a fan of Ranbir/Deepika, this movie is a must for you. Both of them have done a really good job. Many people criticized the acting but I personally don't think there is anything wrong with it. We go to watch a movie to enjoy it not to bite down on every possible little detail and find mistakes and errors. No movie is perfect and to me this is very good.\n\nThere are few things to note if you are going to watch the movie with family/kids. Movie itself is not bad but there are few dirty jokes/talk and some kissing scenes. Other than that there is no rude language.\n\nI watched a bollywood movie in the cinema after a long time and really enjoyed it. I would say if you are not sure about this movie give it a try. Just keep in mind this may not be your favorite but it certainly won't be the worst you've seen."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "hamz-b",
        "review_rating": "7",
        "review_title": "A Very Good Entertainer From Ranbir-Deepika",
        "review_detailed_main": "I watched this 3 months after the release and i must say that it isn't as bad as everyone has made it out to be. I agree its a plot that has been used in Bollywood many times, but the way Ayaan Mukurjee executes this is very different from your usual Bollywood films.\n\nThe plot centres a group of friends which includes Aditi (Kalki Koechlin) Avi (Aditya Roy Kapoor) and Kabir Thapar (Bunny) (ranbir Kapoor), who all ready to take a rec around manila. Naina (Deepika Padukone) plays a geeky, quirky middle class Indian girl who's only dream is to live like others, she gets all this when she joins Bunny and his gang on their rec to manila. The plot follows as all usual Hindi films usual do.\n\nRanbir Kapoor after Barfi gives a performance of a lifetime as the carefree Kabir, he plays the role as though he is Kabir himself which is why Ranbir in this moment in time is one of the leading stars of the industry. Deepika also gives a brilliant performance she goes from strength to strength with this role as Naina. Both main actors live the characters as though they are themselves. Aditya and Kalki add a bit of mas ala to the cast. Overall the main cast is very good and hats off to Ayaan and Karan for producing a story that has been told but in a modern style.\n\nOverall a must watch for Ranbir-Deepika fans and overall Hindi movie lovers."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sruthy_90",
        "review_rating": "9",
        "review_title": "this is the story of two people with different dreams and view points of life!!",
        "review_detailed_main": "this movie plot may be usual one.. but is definitely an amazing journey..i did not know much about this movie when i went out with my friend today..but now i feel really good and something new after watching this.. Ranbir Kapoor and Deepika Padukone are at their best!!! the scenic beauty of Manali and Udaipur Taj is breath taking.. the music is not moving except the \"bartamiz dbl\".. if you are a person who loves to explore the world and take travel as profession, surely you can relate to Bunny(Ranbir)....this may not be a golden feather in the cap of Dharma productions, but surely is a silver feather.the history of the relationships and break ups between Ranbir and Deepika is not felt at all.. hats off to their professionalism.. the trio friendship is an old wine in new bottle but it still tastes good and refreshing if u are a fun loving person.. just go for it!!don't expect anything much!!just watch it!!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sharadkrishna",
        "review_rating": "7",
        "review_title": "Unforgettable experience!!",
        "review_detailed_main": "YeJawaniHaiDeewani(20/24) ---Story 2.5/4 ---Screenplay & Direction 3/4(because of last 40 minutes) ---Cinematography 3.5/4 ---Performances 3.5/4 ---Music 4/4(songs are for lifetime!!) --- Miscellaneous 3.5/4(dialogues, philosophies, wholesome) --Standouts -- Ranbir-Deepika's style, performances and chemistry with each other in 2nd half is just euphoric; iconic songs which will remain fresh for our whole lives; the images, shots, locations, costumes, sheer bewitching to eyes; philosophies subtly discussed in last 40 minutes(jitna bhi try karo Bunny,life me kuchh na kuchh to chhotega hi, to jahan hain wahi ka mazaa lete hain; Taran ke pahle main thik hi thi sab thik tha lekin usse mil ke realise hua ki main khush bhi ho sakti hoon; tum galat nahi ho bas mujhse bahut alag ho; wo jante the ki zindagi apni marzi se jeene ki kimat kya hoti hai aur unhe garv tha is baat ka ki tumme wo kimat dene ki himmat thi; waqt kisi ke liye nahi rukta hai, beeta waqt hai lekin kharch hum hote hain)baat itni si hai ki the heart should take precedence some times over brain, over logic, over practicality(crying inside🙂) Issues -- First 2 hours pure typical repetitive Bollywood trope, illogical, borderline cringe..Another problematic takeaway is regarding alcohol, any fear, any grief, any joy, you must have to have alcohol.."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ulteriorme",
        "review_rating": "1",
        "review_title": "Every bad movie you have ever seen - just tad more worse",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ayushparasar",
        "review_rating": "9",
        "review_title": "A journey that you must experience",
        "review_detailed_main": "It's not a movie, it's an exciting journey that leaves you enthralled !! I watched this movie without many expectations and it surprised me with its beautifully carved screenplay and some astonishing dialogues. This movie has a message and some learnings that everyone can implement in their lives.\n\nThe actors have portrayed just what they needed to do. And all were brilliant in their roles. The music and songs are top-notch and their lyrics are just as meaningful.\n\nThere's a 4-5 minute dialogue sequence towards the latter half of the movie between Kabir and Naina which has some really meaningful and deep message. My favourite one is \"JITNA BHI TRY KARO, LIFE MEKN KUCH NA KUCH TOH CHHUTEGA HI... TOH JAHAN HAIN, WAHIN KA MAZAA LETE HAIN NA..\""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sulemanisbeast",
        "review_rating": "7",
        "review_title": "Modern and a touch of classic",
        "review_detailed_main": "Yeh Jawaani Hai Deewani is a captivating movie that has its fun-filled moments that leave you with a happy smile! One reason why people will come see this movie is for the cast and colors. From fast beat tunes such as Balam Pichkari and Dilliwali Girlfriend, memorable scenes in Manali and the special appearance by Madhuri Dixit, it deserves a win. The movie takes you on an adventure and its all about traveling with friends and what happens along there journey in life. Yet, the movie lacks with a good story and its basically another version of Dil Chata Hai. There really is no problem in the movie but watch this for Ranbir and Deepika that bring a charming on-screen couple. Ranbir's cute looks and Deepika's beauty is worth a watch! If the cast was different, the movie probably wouldn't do as well because the scenes are made for the cast that's in the movie. It's a light-hearted film that basically tells the story of big name movies such as DDLJ and Kuch Kuch Hota Hai in a short modern version but it most relates to Dil Chata Hai. I give this film a 7 out of 10 for its fantastic moments that have lights and colors all over with a touch of a modern and classic movie!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "phadvijayanand",
        "review_rating": "3",
        "review_title": "Typical pakau bollywood movie.",
        "review_detailed_main": "Yeh Jawani Hai Deewani Review\n\nGood Things: 1. Typical Bollywood movie - Songs, Drama, little fun action 2. Typical Karan Johar movie - Big/colorful sets,amazing locations Nothing else !\n\nBad Things: 1. Music - except couple of songs, its loud. 2. Story - Nothing new rather ghisi piti movie 3. Typical Ranbeer - With same roles & kind of dialogues, Ranbeer is boring now. 4. Double meaning or vulgar dialogues- it's nowadays fashion to have this kind of dialogues. As there are no good dialogues in the movie, only these dialogues make some fun. 5. Madhuri - Old Madhuri on worst song\n\nand many more..."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "disharma-24131",
        "review_rating": "9",
        "review_title": "Heartfelt romantic dramas with a touch of adventure and self-discovery",
        "review_detailed_main": "Bollywood romantic drama Yeh Jawaani Hai Deewani was released in 2013. Directed by Ayan Mukerji and produced by Karan Johar, the movie stars Ranbir Kapoor, Deepika Padukone, Aditya Roy Kapur, and Kalki Koechlin in lead roles. The film explores themes of friendship, love, ambition, and self-discovery.\n\nThe story revolves around four friends: Bunny (Ranbir Kapoor), Naina (Deepika Padukone), Avi (Aditya Roy Kapur), and Aditi (Kalki Koechlin), who meet during a trekking trip in the Himalayas. The movie traces their journey through various stages of life, from their carefree college days to their individual struggles and aspirations as adults. Bunny is an adventurous and ambitious guy who dreams of traveling the world, while Naina is a nerdy and introverted girl who gradually opens up to new experiences. The film explores their complex relationship, their unrequited love, and their paths crossing again after years of separation.\n\nOne of the highlights of \"Yeh Jawaani Hai Deewani\" is its beautiful cinematography, which captures the scenic landscapes of the Himalayas and other locations with great visual appeal. The film's music, composed by Pritam, is also a standout aspect, with several catchy and melodious tracks that became popular upon release.\n\nThe performances in the film are commendable, with Ranbir Kapoor delivering a charismatic portrayal of Bunny. He effortlessly transitions between the carefree and adventurous persona and the more mature and introspective side of his character. Deepika Padukone shines as Naina, effectively portraying her transformation from a shy and reserved girl to a confident and self-assured woman. Aditya Roy Kapur and Kalki Koechlin provide good support with their respective characters, adding depth to the narrative.\n\nThe screenplay strikes a good balance between light-hearted moments, emotional depth, and some thought-provoking dialogues. The film effectively explores the themes of friendship, love, and self-discovery, capturing the dilemmas and choices faced by the characters as they navigate through life.\n\nHowever, one criticism of the film is its runtime, which stretches over three hours. Some viewers might find certain portions to be unnecessarily long, affecting the overall pacing of the narrative.\n\nOverall, \"Yeh Jawaani Hai Deewani\" is an entertaining and visually appealing film that offers a mix of romance, drama, and comedy. It successfully portrays the journey of its characters, their relationships, and their pursuit of dreams. If you enjoy heartfelt romantic dramas with a touch of adventure and self-discovery, this movie is worth watching."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sachinbudania-82657",
        "review_rating": "6",
        "review_title": "A decent watch but with old common theme",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "avnij-26322",
        "review_rating": "10",
        "review_title": "Magical",
        "review_detailed_main": "This movie will never be old This movie is absolutely a gust of fresh air how many times I watch this movie, it seems like I am watching it for the first time."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "adarshkrockz",
        "review_rating": "7",
        "review_title": "Feel good !!! 7 on 10",
        "review_detailed_main": "Feels Regretted on late watch. Watched in August 2020 in lockdown periods. It's a feel good - romantic type of movie. Engaging story telling. And good performance from the actors."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "singhal-52253",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": "Great entertainment Like all rom-coms, YEH JAWAANI HAI DEEWANI sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expected our wishes and entertainment fully I admire these kind of movies for youths so that they could be interactive and understand the people and their wishes, ask each to watch these type of. Movies regularly , very thankful for the cast and crew of this movie many times."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mayur-k2011",
        "review_rating": "2",
        "review_title": "one time watch",
        "review_detailed_main": "this is strictly a one time watch... first half is good.2nd half is some what boring!!!!music is good,supporting actors done fine job. so people those fans of & love to watch light romantic movie here we are... leading actress looking good & beautiful so as actor. the movie take pace in 1st half. after the interval it some what slow down. end is as we expected.. as true movie lover is only one time watch & that's all. this movie written as Indian audience in mind but i think it remake of some Hollywood movie...as no other movie in competition with it. obviously it box-office record is grossing no point at all.overall go and watch with family,friend,lover but in my opinion it is ONE TIME WATCH.."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "akashanand-23026",
        "review_rating": "10",
        "review_title": "LOVE THIS MASTERPIECE",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "saad_khi",
        "review_rating": "2",
        "review_title": "Yeh Jawaani is not Deewani!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "devanshuppal",
        "review_rating": "9",
        "review_title": "A perfect lovestory!",
        "review_detailed_main": "Well, This is an idealistic movie. It can be an inspiration for all the young audience. Movie was mind blowing especially the characters and there part to play in this movie. The favorite character of mine is naina. She was such a bibliophile and turned into a different personality all at a time. From shy and studious naina to the bold and brave. She is the character who took my heart and this complete movie runs along with her that's the best part of it."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "vamsii_44",
        "review_rating": "8",
        "review_title": "Masterpiece movie",
        "review_detailed_main": "Alot of entertainment and emotions.a worth watch watch."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "saravanansekar-56218",
        "review_rating": "10",
        "review_title": "Nice movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ankita-kumar",
        "review_rating": "1",
        "review_title": "Dil Chahta Hai Wannabe Fails Miserably",
        "review_detailed_main": "Once again, we have an example of new age Indian cinema which purports to be \"different\". In many ways, it is worse than the old school boy-meets-girl formula films of yore because one didn't walk in with the hope that some new ground may be explored.\n\nWe as viewers are expected to meet the aimless, destructive, misogynistic and homophobic protagonists and consider them lovable. Not.\n\nWe are supposed to consider their boorish behavior applaudable. Not.\n\nRanbir Kapoor who put in a fine show in Rocket Singh - Salesman of the Year seems to have decided that he no longer wants to act when hamming away is adequate. Pity! Deepika Padukone is utterly miscast as a woman with her head in books and unaware of her stunner looks.\n\nAditya Roy Kapoor as the resident lush and Kalki Koechlin as the bindaas gal are good but then the movie is not really about them.\n\nThis is the nth time that Hindi film directors have tried and failed to recapture the Dil Chahhta Hai sort of chemistry between protagonists. I just wish they would stop trying to be cool because they fail miserably."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "greendaffodile",
        "review_rating": "10",
        "review_title": "Fall in love with this movie",
        "review_detailed_main": "Good movie i watched ever. Nice acting of acteess made everyone mad. Love scenes are awsome of every actors doing best some time lackness found when hero speaking love with herione. But choreography matches those lackes.. Actress performed better then her previous movie not only acting. Her face similier moon that every movie lovers love her beautiness.. Climax teaches who love truly they make beautiful world.. Direcotr toich is nshown every frame of this movie.. Camera angle says script of this movie make by brilliant person who directed this movie.. And those actors all makes this movie better in bollywood in this days."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "shvmbanerjee",
        "review_rating": "1",
        "review_title": "Bad",
        "review_detailed_main": "Boring, unrealistic and predictable. The movie never seemed to end. It could have easily shortened by 40 minutes. There were instances I actually wanted to stop watching. Its flawed and portrays a unrealistic and illogical story of Naina and Bunny. Not to forget the ironic ending."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "devanshmay",
        "review_rating": "10",
        "review_title": "My All time favourite",
        "review_detailed_main": "One of the best films. It had everything a film must hold. Gr8 performances gr8 direction. Full Paisa vasool entertainer. Must watch. Also the chemistry between rk & dp is 🔥🔥🔥"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sarkar-shuvo",
        "review_rating": "10",
        "review_title": "Most Crazy Romantic Film !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "muneerasgg",
        "review_rating": "8",
        "review_title": "not that good but not that bad",
        "review_detailed_main": "This used to be my favorite Bollywood movie until I watched recently and realized how cliche it is, still not that bad"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "TheNonSmoker",
        "review_rating": "1",
        "review_title": "Not Recommended 👎",
        "review_detailed_main": "Story, cast, direction is just so bad, I wonder how this movie didn't flop in the box office, ah nepotism, not I understand..."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "benudharmahakul",
        "review_rating": "10",
        "review_title": "Nice Movie",
        "review_detailed_main": "Great entertainment Like all rom-coms, YEH JAWAANI HAI DEEWANI sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expect no unwanted melodrama, no unwelcome characters, no earsplitting background music to accentuate the proceedings... On the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "novamaju",
        "review_rating": "1",
        "review_title": "Do not for the life of you watch this.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "dhavalhthakkar",
        "review_rating": "10",
        "review_title": "Worth watching it once.",
        "review_detailed_main": "You remember a movie not on Characters played or its cast, you remember the movie based on how it made you feel. I saw this movie in my Engineering. It is based on many people's life especially students traveling to US. There is always a period in life where you can't spend enough time for your loved one's and you have to move ahead. That's how it is. This movie is a classic example which makes you cry and laugh in the same movie. Just watch it once, it's worth it.\n\nThe acting of cast is perfect, the movie is full of adventure. You will definitely enjoy this 2 hours drama once you watch it. It is full of Bachelor's life and based on career of young ambitious person.\n\nThe last part really made me cry as Ranbir could not meet his father before his father's last breadth."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "yaduydk",
        "review_rating": "10",
        "review_title": "Must watch",
        "review_detailed_main": "I watched this movie in 2013 or 14. At that time I sae this movie as a mere movie with great songs.\n\nBut now when I rewatch it after 8 years, it almost fills my mind. This movie made me extremely happy after watching and refreshed my old memories Its a must watch for everyone and all its music are lit too\n\nI end with its opening dialogue : Memories are like a sweetbox,once you open it you cant never stop in a piece of it.😍(\"Yaadein mithai ke dabbe ki tarah hota hai ek bar kholo to sirf ek tukda nahin kha paaoge.\")"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "itsmshuman",
        "review_rating": "10",
        "review_title": "go for it",
        "review_detailed_main": "A vibrant journey through love, friendship, and self-discovery, \"Yeh Jawaani Hai Deewani\" is a Bollywood coming-of-age film that leaves a lasting impression. Directed by Ayan Mukerji, the movie seamlessly blends romance, drama, and humor, offering a captivating narrative.\n\nThe film revolves around Bunny (Ranbir Kapoor), a spirited young man with a passion for travel and exploration, and Naina (Deepika Padukone), a studious medical student seeking to break free from her introverted shell. As their paths cross during a trek, the story unfolds, taking the audience on a rollercoaster ride of emotions.\n\nOne of the film's strengths lies in its well-developed characters, each with their own quirks and dreams. The chemistry between Ranbir Kapoor and Deepika Padukone is palpable, adding authenticity to the evolving dynamics of their relationship. The supporting cast, including Aditya Roy Kapur, Kalki Koechlin, and Kunaal Roy Kapur, brings humor and depth to the narrative.\n\nThe cinematography is visually stunning, capturing the picturesque landscapes of Manali and the grandeur of the destination wedding sequences. The film's soundtrack, composed by Pritam, is a mix of soulful melodies and energetic tracks, complementing the narrative and enhancing the overall viewing experience.\n\nWhile \"Yeh Jawaani Hai Deewani\" excels in portraying the excitement of youth and the complexities of relationships, there are moments where the pacing feels a bit stretched, particularly in the second half. However, the film's heartfelt moments and the chemistry between the lead actors make it a memorable cinematic experience.\n\nIn conclusion, \"Yeh Jawaani Hai Deewani\" is a joyous celebration of youth, love, and friendship. Ayan Mukerji's direction, coupled with stellar performances and a captivating soundtrack, makes it a film that resonates with audiences of all ages. Whether you're a fan of Bollywood romance or a sucker for scenic visuals, this film is a delightful exploration of the highs and lows of life's adventurous journey."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "dkingshuk",
        "review_rating": "2",
        "review_title": "Over hyped",
        "review_detailed_main": "I'd give two stars one for its music another for Deepika, jokes apart this movie is below average.\n\nFrom the acting stand point almost everyone in this movie over acted. Story, direction screenplay is also below per. As a normal viewer you can not connect to the story line unless you pretend to be connected to its melodramatic description. I can't digest the fact that it has got some good ratings and a blockbuster tag."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "gangutm",
        "review_rating": "10",
        "review_title": "Good story and chemistry between Dips and Ranbir",
        "review_detailed_main": "I'm watching this film well after it was released in the cinemas (in fact after seeing both Besharam and Chennai Express) so I know how the film had performed at the box office, and what most people thought of it so my expectations were high!\n\nYJHD does through the typical roller coaster of a Bollywood romance, but where it differs from those that have failed, is that it has the star power of Ranbir and Deepika at the top of their game, alongside lovely music by Pritam and fantastic direction by Ayan Mukherjee.\n\nAyan is certainly one of the top young directors in the industry, and after Wake Up Sid, shows exactly why he holds his mantle piece. This work will go down as one of his finest, even though I am sure he will make many more films.\n\nThis role is bread and butter for someone of Ranbir's stature now. He eases into the role, initially playing the fun going flirty young man, then growing into the serious, yet romantic mature man later. This role is not on the same level as Barfi, there is no comparison, however it's these types of roles that will keep Ranbir competing with the likes of SRK for the romantic king award! Deepika has grown massively this year, and this being the third film (Ram Leela is the 4th) she has hit the industry with a bang in 2013. She looks stunning on screen and plays her role perfectly! Kalki, as annoying as her role, again plays it without any blemishes. Her role reminds you of Zindagi Na Milenge Dobara quite a lot! Aditya seems to be alcoholic of 2013 with this and Aashiqui 2 but does full justice to the role regardless!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Vivekmaru45",
        "review_rating": "1",
        "review_title": "Rambir Kapoor: The Runt Of Rishi's Litter.",
        "review_detailed_main": "I don't know what the fuss was about this film. I decided to see it and was bored less than half-way through it. I have seen similar films about coming to age sexuality: Dil Hai Ki Manta Nahin, Jo Jeeta Wohi Sikander, Maine Pyaar Kiya, Hum Apke Hain Kaun?, Aashiqui(Original Rahul Roy film), Dil, Woh Saat Din, Ram Teri Ganga Maili, Saaweray Wali Gaadi(BEST ONE AND MUST SEE SUNNY DEOL FILM), Ek Duuje Ke Liye(TIMELESS CLASSIC ALSO MUST SEE), Lahme, Henna, Chandini, Saagar, Masterji, Prem Pratigya, Eeshwar, Saheb, Mili, Agar Tum Na Hote, Ghar, Veer Zaara(LATE YASH CHOPRA MASTERPIECE)..... The list goes on and on....\n\nThis film can be compared to rat turd. It really stinks!\n\nThe film is about a young teenager Naina (Deepika Paad-ukone Paad=Fart in Hindi or Gujarti for that matter...) leaving home against her parents wishes and going on a camping trip. There here womanhood wakens and she feels sexually drawn to another college-mate she knows called Bunny(The Runt Kapoor).\n\nEight years pass. Naina finishes medical school and works in a clinic. Bunny works as a television cameraman for travel shows and roams the world, as he had planned. They meet again in Udaipur, for Aditi's lavish wedding to Taran (Kunaal Roy Kapur), an awkward but adoring engineer. Naina and Bunny are again strongly attracted to each other. Both resist love – Bunny because he does not want to give up a dream job he has been offered (as a travel show host), Naina because she fears that Bunny will break her heart again. Will they find a way to be together? Spectacular dance numbers punctuate a roller-coaster romance. Only in the last few minutes of the film does love triumph.\n\nVerdict: you're better off watching the above mentioned movies."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "netrapals-80437",
        "review_rating": "10",
        "review_title": "Ye jawani hai deewani",
        "review_detailed_main": "Though I'll admit that the story has a few clichés here and there that kept it from being better. Still, given that I was watching it while flying across the Atlantic, it was a nice time-passer and kept my attention.\n\nThe film begins with Naina and her mother meeting up with a rather vacuous old schoolmate of Naina. While Naina graduated top of her class and is at the top of her class in medical school, this meeting with the schoolmate left Naina feeling that she's missing something...fun. So, on a lark, she decides to drop everything and head off on an adventure--and she picks the same destination the vacuous schoolmate chose. There, Naina slowly learns to unwind and meets sexy Bunny (he is a man--not some furry--despite the name). They hit it off and seem to be falling in love but one HUGE problem stands in their way--Bunny has vowed never to marry and wants to travel the world and experience EVERYTHING. What's to happen? See the film.\n\nLike the typical Bollywood film, this romance is predictable and there's lots of singing. You can't fault the film for."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ranjithkumarj-35487",
        "review_rating": "10",
        "review_title": "Fantastic",
        "review_detailed_main": "Like all rom-coms, YEH JAWAANI HAI DEEWANI sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expect no unwanted melodrama, no unwelcome characters, no earsplitting background music to accentuate the proceedings... On the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "yadav-20837",
        "review_rating": "10",
        "review_title": "Love story",
        "review_detailed_main": "On the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized! A boy and a girl take a life-altering holiday together. She is mousy, studious, bespectacled. She doesn't drink, smoke and has never been kissed. He is a reckless charmer who flirts outrageously. Love blossoms, for her at least, but they must part and then reunite in the foreground of a big fat Indian wedding. Where they enjoy the party."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "Infycd_",
        "review_rating": "1",
        "review_title": "Why????? Ewwww",
        "review_detailed_main": "I don't know why this movie was so popular.. such a stupid movie. I can't stop laughing.. oh god what a idiotic story. This stupid teenager giving it highest rating for what? Ewwww cringeee... Ranbir man give some expression yaar seriously worst actor and Aditya he doesn't even know acting.. damn I need to watch some good movie to overcome by this masterpiece movie."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "tricksshikhabo",
        "review_rating": "10",
        "review_title": "An eye cathing romantic Hindi film",
        "review_detailed_main": "Maybe it's sound weird to watch again and again the same movie. But what makes it special? That's the question. It has great acting, romance, love and heartful feelings. I can't write it just go and watch now."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "advaitkamat",
        "review_rating": "4",
        "review_title": "Ordinary.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "yodhant",
        "review_rating": "10",
        "review_title": "Awesome movie!",
        "review_detailed_main": "7 years gone and you can still watch this movie with the same feel and emotions"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "viswadravid",
        "review_rating": "9",
        "review_title": "A soothing love to the heart",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "shubhamkumartiktok",
        "review_rating": "10",
        "review_title": "Life changing movie",
        "review_detailed_main": "If you have lost many friends in our of achieving something aur reminishing the old memories . It is the best movie you can watch . This movie also feel give u a new way of seeing the life as we only have one acting level of every single actor is the at peak .\n\nI have watched this flim at least 20 times I still get the vibe I am watching it first time we can feel connected to story . This is not a typical bollywood movie that's make it more special ."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ananyadubey-66755",
        "review_rating": "1",
        "review_title": "Bad writing",
        "review_detailed_main": "Such bad writing with cringey dialogues and extremely problematic scenes with no character arc. This movie owes all its success to it well written songs and not sloppy story and horrible writing."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "abphadore",
        "review_rating": "8",
        "review_title": "An Ode to the Bunny inside us",
        "review_detailed_main": "\"Yeh Jawaani Hai Deewani\" is a vibrant and heartwarming romantic drama directed by Ayan Mukerji, released in 2013. Set against the backdrop of picturesque locations in India and abroad, the film explores themes of love, friendship, ambition, and self-discovery with a touch of nostalgia.\n\nPlot and Execution:\n\nThe film follows the journey of Kabir Thapar, fondly called Bunny (played by Ranbir Kapoor), a carefree and ambitious young man who dreams of traveling the world and making a mark in the field of photography. His life takes a turn when he reunites with his old classmates during a trekking expedition in Manali. Bunny's encounter with Naina Talwar (played by Deepika Padukone), a shy and studious medical student, sparks a deep connection that transcends their contrasting personalities.\n\nStrengths:\n\nChemistry and Performances:\n\nRanbir Kapoor and Deepika Padukone deliver charismatic performances as Bunny and Naina, respectively. Their on-screen chemistry is palpable and forms the emotional core of the film. Kapoor brings Bunny's restless spirit to life with charm and vulnerability, while Padukone portrays Naina's journey from introversion to self-assuredness with grace and depth.\n\nSupporting Cast:\n\nThe ensemble cast, including Aditya Roy Kapur as Avi and Kalki Koechlin as Aditi, adds richness to the narrative. Aditi's exuberance and Avi's carefree attitude provide a perfect contrast to Bunny and Naina's evolving relationship, creating moments of laughter and reflection.\n\nVisual Aesthetics:\n\nAyan Mukerji and cinematographer V. Manikandan capture the beauty of Manali, Udaipur, and other locations with stunning visuals. The picturesque landscapes, coupled with Pritam Chakraborty's soulful music, enhance the film's emotional depth and create a captivating visual experience.\n\nThemes of Friendship and Growth:\n\n\"Yeh Jawaani Hai Deewani\" celebrates the bond of friendship and the transformative power of love. The film explores how relationships evolve over time and the impact of personal choices on one's journey of self-discovery. The characters' dilemmas and aspirations resonate with viewers, making the narrative relatable and engaging.\n\nWeaknesses:\n\nPacing Issues: While the film's narrative is engaging, some viewers may find certain sequences and subplots repetitive or stretched, affecting the overall pacing of the story.\n\nConclusion:\n\n\"Yeh Jawaani Hai Deewani\" is a refreshing blend of romance, drama, and coming-of-age elements that appeals to audiences across generations. Ayan Mukerji's adept direction, coupled with stellar performances and captivating visuals, makes this film a memorable cinematic experience.\n\nThe film's exploration of love, friendship, and personal growth resonates with viewers, offering moments of laughter, tears, and introspection. \"Yeh Jawaani Hai Deewani\" remains a beloved Bollywood classic, celebrated for its relatable characters, memorable dialogues, and soulful music.\n\nOverall, \"Yeh Jawaani Hai Deewani\" is a journey of emotions and aspirations, reminding us to cherish every moment, follow our dreams, and embrace the joy of living life to the fullest. It's a must-watch for anyone seeking a blend of romance, entertainment, and heartfelt storytelling in Indian cinema."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "my-letterbox",
        "review_rating": "2",
        "review_title": "Only meant for Ranbir and Deepika fans",
        "review_detailed_main": "The first thought before watching this movie was that it will be mixture of adventure, comedy and drama but the film was no longer near to my expectations. This movie was like director want to have every ingredient of movie making but it was undercooked.First half of movie is OK, songs are good and it passes really quick but for the second half i have to check every minute of my watch , not to mention movie was bit lengthy. when i was leaving i heard a bunch of people wow this movie is awesome, i will really suggest them to check their taste buds for movies. No offense to Ranbir and Deepika fans, this movie is only meant for you people, just go and say WOW Ranbir and WOW Deepika, because movie don't have anything else :)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "gautam-moharil",
        "review_rating": "9",
        "review_title": "Ay Kabira maan jaa",
        "review_detailed_main": "A story about friendship, about chasing your dreams and about knowing the right time to settle down. The first half is cliched garbage but the second half makes up for it with brilliant pacing and dialogue. The music is brilliant and the performances are good."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "thejashwinikr",
        "review_rating": "10",
        "review_title": "Nowadays trekking become passion of young generation. Based on this the theme of yeh Jawaani hai deewani. So u can watch this movie and enjoy the passion of young generation",
        "review_detailed_main": "Nowadays trekking become passion of young generation. Based on this the theme of yeh Jawaani hai deewani. So u can watch this movie and enjoy the passion of young generation. Trekking is the thing which we can see the Nature so closely. It's a nice experience which all should see once in life. So this film based on trekking and how love begins. Both concepts are near to nature. Both are beautiful moments of life. If you see you will have same experience with them. You can watch a movie and have a great experience for three hours leaving all our life hurdles. So please watch and have great experience."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "huzefanampurwala",
        "review_rating": "10",
        "review_title": "Jawani Diwani",
        "review_detailed_main": "Worth watching?\n\nOn the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized!\n\nExcited\n\nStarring Ranbir Kapoor, Deepika Padukone, Aditya Roy Kapur and Kalki Koechlin in prominent roles, it lives in our hearts rent-free, even after a decade since its release. It tugs our heartstrings, makes us think of a forgotten loved one, and the craziness of youth.\n\nGlorified A Toxic Character. Enough has been said about Bunny being a man-child who treats his family and friends as dispensable. He blindsides Avi (Aditya Roy Kapoor) and takes up a job outside the country. He doesn't even stay in touch with his friends until one of them invites him to their wedding."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "savannihatkar",
        "review_rating": "1",
        "review_title": "Worst Experience",
        "review_detailed_main": "Overrated , Predictable, shallow, clichéd, zero realistic. I hated the movie. Everything is just so freaking over the top and fake."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "murtazavana-19268",
        "review_rating": "10",
        "review_title": "A beautiful movie. All time favourite!",
        "review_detailed_main": "This movie will make you laugh, cry and love at the same time. The actors did well. Just amazing work ! #friendship #love"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "himanshushekhar8",
        "review_rating": "2",
        "review_title": "A very badly directed, and a poor screenplay.",
        "review_detailed_main": "Bah! What a shame. First things First. What made me go to this movie.\n\n1. The publicity and the hype that was created around this movie's release. 2. Good(looking)Star cast.\n\nThe start was not bad. Ranbeer was responding to all the responsibilities that the director thrown at him, but the moment Deepika started to speak, I knew that the movie was over. I thought at first that a few pages were torn from the Dialogue Diary. The \"too much filminess\" of this movie might make you feel like you're being robbed of the ticket price that you've paid. Well there are a few movies with too predictable ending, but a simple story with this type of lame direction is just below average. Kalki saved a little grace, if it wasn't for her I wouldn't have been writing this review.\n\n2 stars for\n\n1. Kabira. 2. Kalki and ranbeer.\n\nrest 8 stars the movie didn't deserve"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "amitgarg_pta",
        "review_rating": "10",
        "review_title": "Film is super magic part off life in between anchor off direction.",
        "review_detailed_main": "It is art gallery .dictation is work over screen time in between time gap overwork effort.it is screen."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "AngShel",
        "review_rating": "8",
        "review_title": "Reality Check!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "vilontetoyou",
        "review_rating": "10",
        "review_title": "Best Indian movie of the most recent generation",
        "review_detailed_main": "Love the chemistry between Ranbir and Deepika. Also, loved the two other supporting characters. Such a feel good movie. Loved it!! Can watch it over and over."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rajkumar-kannan-276-940987",
        "review_rating": "3",
        "review_title": "Bollywood Trash",
        "review_detailed_main": "The movie has two parts - the first part is like watching Travel and Living channel and the second part is like watching NDTV good Times. There is really no script or story and everybody except Kalki probably has no acting skills! There is no chemistry between the lead pair , which is an essential aspect while casting for a Rom Com (drama) like this. The whole movie is a drag and probably a good summary of what Bollywood is all about - wonderful cinematography (ad quality) combined with hollow script and non actors (of course never ending) The lucky people in the cinema hall were those who paid for the lazy-boy couches - they probably got a good nap!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "iambharat-10227",
        "review_rating": "8",
        "review_title": "Awesome Movie Must watch",
        "review_detailed_main": "Very nice movie, you learn how to live life, how to enjoy it. It is a very very nice movie I love it.... Awsm songs and acting was good too.....Worth watching...... refreshing and energetic. love and friendship at its best. must watch for all youngsters at least once Awesome Movie I watched the movie on first week I really like this movie..itz jst 2 good... its a mixture of fun love entertenment evrythng what a movie should have\n\nI have now started finding better movies through www.flickstree.com.It not only suggests great movies to watch,it also tells where you can watch the movie online......I would highly recommend it......"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "vinayakagrawalu",
        "review_rating": "4",
        "review_title": "Predictable and Disappointing",
        "review_detailed_main": "Hi All, I went to watch this movie with a lot of hope to see something new in bollywood BUT it was a typical Karan Johar type love story.\n\nStory: Ranbir Kapoor aka Bunny is the cool crazy guy. Deepika aka Naina is a studious girl. They meet and Deepika falls in love because of bunny's carefree attitude but Bunny is not interested in love. Now, guess what happens in the end!!!\n\nMusic: Apart from Battameez dil and Kabira, all other songs are just OK. I don't know why they put so many songs in there.\n\nScenery: Yes this was good. Good locations and colorful dresses. But hey, isn't that what Karan Johar does the best."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "naukriyash",
        "review_rating": "10",
        "review_title": "Fun movie and good songs",
        "review_detailed_main": "This movie has become a cult movie and all the songs have become party songs. Ranbir Kapoor, Kelki and other actors are so good. Even though this was a fun movie, the intense looks of Ranbir Kapoor never go away, he can nail any romantic comedy movie. Apart from fun and all the good songs, this movie inspired me how you can be fun with all your loved ones, meet them often no matter how much successful you become and how busy you are with your work life. Ven though Ranbir Kapoor has did so many movies, I still treat him as a younger version of Saif Ali Khan, they both have so many similarities."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sachinbhuyan",
        "review_rating": "10",
        "review_title": "Outstanding",
        "review_detailed_main": "What a fun entertainment movie man ,i still watch the movie again and again"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "arsenalfcclubwearegunners",
        "review_rating": "8",
        "review_title": "Memories with friends",
        "review_detailed_main": "Yeh Jawaani Hai Deewani: A Heartwarming Journey of Love and Friendship\n\nYeh Jawaani Hai Deewani\" is a delightful blend of romance, comedy, and life lessons that resonates deeply with anyone who's ever had dreams, fallen in love, or cherished friendships. Directed by Ayan Mukerji, the film beautifully captures the essence of youthful exuberance and the complexities of personal growth.\n\nThe story revolves around Naina Talwar (Deepika Padukone), an introverted medical student who embarks on a transformative journey to the Himalayas with her former classmates. The trip rekindles her friendship with the charming and adventurous Kabir \"Bunny\" Thapar (Ranbir Kapoor), the carefree Avi (Aditya Roy Kapur), and the vibrant Aditi (Kalki Koechlin). As Naina finds herself falling for Bunny, she faces the bittersweet realization that his dreams of wandering the world might never align with her hopes of a settled life.\n\nRanbir Kapoor shines as Bunny, bringing a charismatic energy to the role of a man torn between his wanderlust and newfound love. Deepika Padukone delivers a compelling performance as Naina, transitioning from a shy introvert to a confident woman. The chemistry between Ranbir and Deepika is palpable, adding depth to their evolving relationship.\n\nThe supporting cast, particularly Aditya Roy Kapur and Kalki Koechlin, add vibrant colours to the narrative. Aditya's portrayal of Avi, a fun-loving yet troubled friend, and Kalki's Aditi, who navigates her feelings and eventual maturity, are noteworthy.\n\nThe film's strength lies in its relatable characters and the message that life is about finding a balance between pursuing your dreams and valuing the relationships that shape you. The scenic cinematography, capturing the breathtaking landscapes of Manali and Udaipur, adds a visual treat to the emotional rollercoaster. However, the movie's length (2h 40m) might feel a bit stretched at times, and some scenes could have been crisper. Despite this, \"Yeh Jawaani Hai Deewani\" remains a heartwarming film that emphasizes the importance of friendships and love while chasing one's dreams.\n\nOverall, \"Yeh Jawaani Hai Deewani\" is a must-watch for its beautiful portrayal of relationships and the timeless lesson that while it's essential to follow your dreams, the journey is more fulfilling when shared with loved ones."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "simplyharshil",
        "review_rating": "3",
        "review_title": "Better to wait for its television premiere then to shell out money for buying the tickets!!",
        "review_detailed_main": "Entered the hall with high expectations. \"Wake up Sid\" was at the back of my mind when I decided to go for \"Yeh Jawaani Hai Deewani\". But it was a complete led down to the expectations as the story failed to grip the audience.\n\nMoreover I think that the storyline is somewhat similar to movies such as Bachna Ae Haseeno and DDLJ.\n\nThe plus points were Ranbir's performance and Deepikas's girl next door look.\n\nSo folks my perception is that instead of going to a hall just wait for the television premiere..."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sourav-63975",
        "review_rating": "10",
        "review_title": "Chemistry Between Leads",
        "review_detailed_main": "The on-screen chemistry between Ranbir Kapoor and Deepika Padukone is a major highlight. Their performances and interactions contribute significantly to the film's charm and appeal. The film boasts stunning cinematography, capturing picturesque landscapes and vibrant colors. The visual appeal adds to the overall cinematic experience, especially in the scenes shot in picturesque locations like Manali and Udaipur. The soundtrack of \"Yeh Jawaani Hai Deewani\" is memorable, with tracks like \"Badtameez Dil\" and \"Balam Pichkari\" becoming chartbusters. The music complements the youthful and energetic theme of the film."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "karan_k619",
        "review_rating": "5",
        "review_title": "Boring!",
        "review_detailed_main": "Boring and an overrated movie! I wonder how people gave this piece of shit 9 & 10. Most of the times there were just long songs one after the other. Ranbir Kapoor overacted in the whole movie and sometime it felt that there was no connection between his acting and the movie plot!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "prianka-guru",
        "review_rating": "8",
        "review_title": "Its a fun Movie, with fantastic music.",
        "review_detailed_main": "I loved the movie for several reasons:\n\n1. Ranbir, Kalki and Aditya have acted very well. Deepika's acting is not as captivating as that of Ranbir's or Kalki's or Aditya's.\n\n2. Music is great. Very cool and very hummable.\n\n3. Overall its a feel good movie.\n\n4. Direction is good.\n\n5. The places where the movie is shot are all so gorgeous.\n\nI wouldn't compare it to 'Dil Chahta Hai' (DCH) or the likes of DCH. Its just another movie which happens to have friends with issues that you can relate to.\n\nSo my suggestion will be \"Watch it for fun, don't try to make any sense out of it.\" If you do that you will also love it as much :)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "aaakarunarathna",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "The best bollywood movie in recent times. Gives a mix bag of emotions laugh, tears, etc, undoubtedly the best performance of Ranbir."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "guriwalla",
        "review_rating": "10",
        "review_title": "Best Film In My Life",
        "review_detailed_main": "This film is amazing! The first time I saw it, I decided that one day I would become a filmmaker, and my dream has come true. Today, I work in the film industry. The storytelling is captivating, the characters are richly developed, and the cinematography is stunning. Each viewing reveals new details, making it a film I can watch repeatedly. I've watched this film over 50 times in my life. Its emotional depth and unforgettable scenes never fail to inspire me. If anyone asks me to watch it again, I'll watch the entire movie without a break! It's a masterpiece that has left a lasting impact on my journey as a filmmaker. Highly recommended!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "nikhildaware",
        "review_rating": "4",
        "review_title": "Old Script, New Touch...",
        "review_detailed_main": "YJHD(2013): So.....was not expecting much outta this movie anyways...but, I wud have to admit that the movie started promisingly well and looked good till intermission. However, as you all know the fate of maximum Hindi movies after that, this movie also lingers and lingers a lot till director decides to end it in a way it cud have ended long ago. At least cud have saved 30 mins of audience. Power points of movie are Ranbir's acting and good punches in dialogue. Downside is that movie is having nothing new and kinda gets boring by end. I literally saw ppl watching time on when this movie is gonna end in hall. Lol.... Anyways.. Lets hope for a better flick next time... My 2 cents on this?? Don't waste your hard earned money..."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ekagrarawat10",
        "review_rating": "9",
        "review_title": "One of the best romantic drama bollywood movie, Had a different experience watching it!!!",
        "review_detailed_main": "Very entertaining and beautiful romantic comedy drama movie. I went to watch this movie just before going to the college with one of my very good school friend. However, the friend didn't show up, so I end up watching this movie alone in a cinema hall(first and last time alone). So, this movie has a different place in my mind bcuz of the experience of watching it alone. I will remember this movie for the rest of my life, and watching it just before going to the college has a different place in my memories . However, the story could have been a bit better, but nonetheless it's a total entertainment package , specially the background music at different time intervals gives me goosebumps even after so many years!!!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "preetiguptauser",
        "review_rating": "1",
        "review_title": "Love story",
        "review_detailed_main": "Old typical love story and lots of songs , no fun , it's just wasting up your time."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ashishgoyal-89194",
        "review_rating": "10",
        "review_title": "Beautiful movie",
        "review_detailed_main": "Well i watched the whole movie today being a south indian i always cherished watching real Bollywood movies made in 2013's like jawani diwani I heard songs and had a glimpse of story line but after watching whole movie i realized that its a story of two people who had different view for life.\n\nThis movie stand in the list of my favorite movies. Nice, Wonderful, Fabulous, Awesome movie. I watched this movie 5 times but I never bored till now.\n\nI can watch it anyday and any of every second. I don't know if people understood the purity of the film when it was first released though serious, this is my all time favourite forever will be. I can't find a flaw or waste my time on that because of it being impossible.\n\nThe best thing about this movie is it's grip on audience. The movie hasn't given even a single minute where the attention and eyes get off."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "vivekiways-69-930786",
        "review_rating": "8",
        "review_title": "Entertainment unlimited.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rahmanuddinsyed",
        "review_rating": "8",
        "review_title": "PRETTY OVERRATED",
        "review_detailed_main": "Positives: Good acting performances.\n\nOne of the best cinematic shots.\n\nHeartwarming dialogues.\n\nSoulful songs.\n\nNegatives: Good story premise but halfly written and unexplored Didn't found it to be that good.\n\nWatch it for time pass.\n\nScreenplay felt drag at many places.\n\nNothing new."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "kaflesanatan",
        "review_rating": "8",
        "review_title": "A total Entertainer..",
        "review_detailed_main": "The film is about love, youth and finding yourself.\n\nThe cast is fantastic! Ranbir Kapoor and Deepika Padukone make a sizzling pair on screen. Their chemistry is electric and keeps you hooked throughout the film. They play childhood friends who reunite during a trekking trip, and their journey of self-discovery and romance is both heartwarming and engaging.\n\nThe film is visually stunning, with breathtaking locations in Manali and Udaipur. The cinematography captures the beauty of these places, and the vibrant colors add to the overall visual appeal. Plus, the dance sequences are super energetic and will make you want to get up and groove along!\n\nThe music in this film is a total hit! From the foot-tapping \"Badtameez Dil\" to the soulful \"Kabira,\" the soundtrack is diverse and memorable. The songs add an extra layer of enjoyment and perfectly capture the different moods and emotions of the story.\n\nKalki Koechlin and Aditya Roy Kapur bring their own charm to the film and add depth to the story. They have their own subplots that intertwine with the main narrative, giving a well-rounded feel to the overall movie.\n\nCelebrate life with your friendship."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "user51555",
        "review_rating": "5",
        "review_title": "just time pass movie.",
        "review_detailed_main": "Just a general time pass movie. You wont miss anything if you decide to watch something else or go doe a walk instead. Actually I would recommend taking a walk.\n\nNothing like 3 idiots, nowhere close. Not funny. Just a story telling, not a whole lot of it.\n\nSame formula that has become kind of boring now, like BR Chopra, Yash Chopra formula films. Then add some free advertisements for booze, which must be their side business, looking at how desparately they advertise for it in every single movie these days.\n\nThen Deepika has to shed clothes in every movie these days, even though it makes no difference."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sulemanfazli",
        "review_rating": "10",
        "review_title": "Classic!",
        "review_detailed_main": "This movie has become a classic and I love watching it every time!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "nallaiah",
        "review_rating": "8",
        "review_title": "Clean bold",
        "review_detailed_main": "A superb movie with marvellous crew recruited... awesome acting and dialogues were well time played...a very good movie giving a peacful journey throughout"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mukesh-77729",
        "review_rating": "10",
        "review_title": "Favorite movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "pratima347",
        "review_rating": "5",
        "review_title": "Why was this movie made?",
        "review_detailed_main": "Ranbir-Deepika..the hottest pair of this decade. There was so much hype about this one,I wondered how mind blowing it would be. Then,the movie started. An hour into the movie and I could not figure out what was different about this one than the so many zillion formulaic movies made before..I could not think of one difference. Also,it's very lengthy,almost 3 hours. It felt like Ayan Mukherjee had to remind people he was still in the industry and he made a meaningless movie to prove this and he had an unlimited budget for this. Yes,the songs are great,the actors are too good and it's shot in very scenic locations,but it is the story or the absence of one that let me down. By the end of it,it felt like 4 great actors were thrown in front of the camera and asked to relive their earlier years. Nonetheless,it has a lot of dreamy content and it does make you feel good because of its good music and an unrealistic happy ending. Watch it if you're a big fan of the romantic genre."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "tahamidtazwar17",
        "review_rating": "10",
        "review_title": "His dream is similar to some of our dreams.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "zeeshanabid",
        "review_rating": "1",
        "review_title": "Disappointed at Ranbir!",
        "review_detailed_main": "Success of movies like this is the main reason why Bollywood has started failing nowadays and South Indian Movies has started doing lot better business. Watch this movie if you want to learn about the blunders of Bollywood. Otherwise avoid it."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "guptalalit",
        "review_rating": "10",
        "review_title": "Evergreen",
        "review_detailed_main": "It's has been 7 years since this movie released. I enjoy watching this movie every time I watch it. This movie is complete entertainment package. Everyone should watch it at least once."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mathewmily",
        "review_rating": "8",
        "review_title": "A ranbir deepika show",
        "review_detailed_main": "I am a huge ranbir deepika fan,so it comes as no surprise that I can watch this movie n number of times.well ayan is an excellent director and the screenplay is awesome.The story is not great since its old formula but its presented well.\n\nThe director has made sure that he gives enough screen presence to all his characters but this somewhere eats into the lead pairs love story which is the crux of the movie. Nevertheless they manage to sizzle on screen with unbelievable chemistry,their eyes speak millions and in their intimate scenes they are in their own world.they display love as love is subtle and soul wrenching.How can the possibly be not in love.\n\nAyan uses this spark to his fullest.if nit for anything yjhd seems like ayans tribute to the love they once shared"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sanahashamkhan",
        "review_rating": "8",
        "review_title": "Yeh Jawaani Hai Deewani: A Heartwarming Journey of Love and Friendship",
        "review_detailed_main": "Yeh Jawaani Hai Deewani\" is a delightful blend of romance, comedy, and life lessons that resonates deeply with anyone who's ever had dreams, fallen in love, or cherished friendships. Directed by Ayan Mukerji, the film beautifully captures the essence of youthful exuberance and the complexities of personal growth.\n\nThe story revolves around Naina Talwar (Deepika Padukone), an introverted medical student who embarks on a transformative journey to the Himalayas with her former classmates. The trip rekindles her friendship with the charming and adventurous Kabir \"Bunny\" Thapar (Ranbir Kapoor), the carefree Avi (Aditya Roy Kapur), and the vibrant Aditi (Kalki Koechlin). As Naina finds herself falling for Bunny, she faces the bittersweet realization that his dreams of wandering the world might never align with her hopes of a settled life.\n\nRanbir Kapoor shines as Bunny, bringing a charismatic energy to the role of a man torn between his wanderlust and newfound love. Deepika Padukone delivers a compelling performance as Naina, transitioning from a shy introvert to a confident woman. The chemistry between Ranbir and Deepika is palpable, adding depth to their evolving relationship.\n\nThe supporting cast, particularly Aditya Roy Kapur and Kalki Koechlin, add vibrant colors to the narrative. Aditya's portrayal of Avi, a fun-loving yet troubled friend, and Kalki's Aditi, who navigates her feelings and eventual maturity, are noteworthy.\n\nThe film's strength lies in its relatable characters and the message that life is about finding a balance between pursuing your dreams and valuing the relationships that shape you. The scenic cinematography, capturing the breathtaking landscapes of Manali and Udaipur, adds a visual treat to the emotional rollercoaster.\n\nThe soundtrack, with its memorable tracks like \"Badtameez Dil\" and \"Kabira,\" complements the film's mood perfectly, making it an auditory delight.\n\nHowever, the movie's length (2h 40m) might feel a bit stretched at times, and some scenes could have been crisper. Despite this, \"Yeh Jawaani Hai Deewani\" remains a heartwarming film that emphasizes the importance of friendships and love while chasing one's dreams.\n\nOverall, \"Yeh Jawaani Hai Deewani\" is a must-watch for its beautiful portrayal of relationships and the timeless lesson that while it's essential to follow your dreams, the journey is more fulfilling when shared with loved ones."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rimkhan1",
        "review_rating": "5",
        "review_title": "A wasted effort",
        "review_detailed_main": "It hurts you when you see a movie which had a potential of being good but leaves a bitter taste at the end. Story line is confusing and so was makeup. 8 years didn't bring any difference to any of four major characters. One major character seem to have no roll at all. It is kind of sad mixture of two or three recent hit movies like Zindagi Na Milegi Dobara. Karan Johar should spent more time making movies rather having coffees. Songs are barely OK. Even Kabeera's lyrics let it down, although beautiful music to it. I am banging my head about what Aashqui 2 guy Aditya Roy Kapoor is doing in this movie. Ranbir Kapoor and Kalki Koechlin are way over the top in first half of the movie. It seems the movie desperately cries for experience all along."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ActuallyRishi",
        "review_rating": "8",
        "review_title": "Worth to watch.",
        "review_detailed_main": "I really like the movie. It's one of the best movies of Rabir Kapoor. This movie teaches us that we should do what we want to do."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "amanand838",
        "review_rating": "5",
        "review_title": "Watch it for Music, Ranbir and Deepika",
        "review_detailed_main": "Yeh Jawani Hai Deewani-:A movie which does tickle you at times but never takes itself seriously,which might have been the best thing if those heavy messages weren't there.YJHD tries to be at multiple boats throughout its run time.A bit of ZNMD,flavour of Swades and portions of IHLS makes the whole of YJHD.\n\nAyan Mukherji who made the wonderful Wake Up Sid which was so simple in itself that even flying birds will look somewhat more complex in front of it and it became the USP of Wake Up Sid.But here Ayan is taking YJHD to a commercial level by selecting heavy locations,adding glamour and using chart busters which weren't there in Wake Up Sid.This ultimately transfers the bar to the other side which the movie was making.\n\nNevertheless,the movie does take you to a joyride in the first half and in bits and pieces in the second half.Some truly fun moments are there which really are worth mentioning.The chumma chumma de de sequence,aditi(kalki)-so-desperate-to-fight sequence and Ranbir-flirting sequences. The performance of Ranbir is a not-much-not-less kind of performance.It's an appropriate mix of a charmer,a believer,a good dancer and a dream follower.Deepika is so good in her Geek-naina,Independent-Naina and Lover-Naina character.A genuine performance by her.Kalki is so much fun each and every time she appears. The new pjyakkar and sharabi of Bollywood has arrived.He(Aditya Roy Kapoor) should learn how to control his facial expression while delivering his dialogues rather than doing roles of a sharabi.Faarooq Sheikh is awesome in his cameo. But the real hero or rather star of YJHD is Pritam Chakraborty.His compositions are sometimes rocking and sometimes so soulful that stands tall or even compromises for some dull moments in the movie.Hats Off to the Genius.Chart busters such as Badtameez Dil,Ghaghra,Dilliwali Girlfriend and soulful tracks like Shubhanallah,Kabira and Illahi are there.The music is for the classes as well as the masses. The movie suffers too much while giving messages which needed a deft touch.Inspite of some fun moments there really are less no. of high points in the movie.\n\nIt could've been a much better movie if they had done some more work on the script.Watch it for it's Music,Ranbir-Deepika and last but not the least Madhuri's comeback."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "moutushireza",
        "review_rating": "10",
        "review_title": "One of the best",
        "review_detailed_main": "Words can't explain how much I loved this movie... definitely a 'must watch' movie..."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "mepunkazz",
        "review_rating": "9",
        "review_title": "Simply Beautiful",
        "review_detailed_main": "Only thing I would complain is the movie name. Why could not they come up with some beautiful name for this beautiful movie instead of something silly like this.\n\nI had not watched this movie earlier thinking it is one of those Ranbir movies with light story. But I was simply amazed by watching it.\n\nThe first part of movie so instantly connects us to the deepika's character. Deepika is such a superb actor and so gorgeous. And it simply drives us through some magic moments, those moments are though exaggerated as part of dharma movie but we can relate to.\n\nAnd 2nd part of movie, we find ourselves more inverted in Ranbir's character. This movie is such a breeze to watch. Emotionally full of love and feel good moments. And ranbir's scene at the end touched me. It is really feel good movie.\n\nBoth Ranbir and Deepika nailed in the movie. But deepika looks more natural."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "deepupanicker",
        "review_rating": "10",
        "review_title": "Awesome!!",
        "review_detailed_main": "A movie that you can watch over and over again..!!"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "dishan-mendis",
        "review_rating": "1",
        "review_title": "So lame and pathetic........",
        "review_detailed_main": "This movie was so bad it compelled me to warn others and to write my first review.Can't imagine that a USD 8 Million could be spent on such rubbish let alone it appalls when some thing of this nature hits a usd 48 Million on box office.This was my first movie of Ranbir Kapoor and Ayan Mukharji and both didn't give me that important first impression.I wanted to deliberately have patience to give it a chance to take something out of it but it was just down hill.There was no likability factor about Bunny's character and I don't have a clue as to why Naina should fall for him.It wasn't the same Deepika Pandukone I saw in Chennai Express either.Neither it gave me laughter nor tears but left with an emotionless soul through out.So naive to think that problems can be solved by a mere kiss and it really pisses me off. Message conveyed is completely out of my moral compass. Humor was just mediocre.All in all this is miles away at best compared with movies in the caliber of \"Veer Zaara\",\"Dilwale Dulhania Le Jayenge\" \"Qayamat Se Qayamat Tak\".When a movie is intriguing it ends so fast as I am not conscience about time but after 45 minutes of this movie I felt many times stop watching it.Please Mr Ayan Mukherji you have a lot to take from your producer Karan Johar's books."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "afrozalucky-98301",
        "review_rating": "10",
        "review_title": "Great Story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "ochiranjit",
        "review_rating": "8",
        "review_title": "Yeh Jawaani Hai Deewani is a 2013 Indian coming-of-age romantic comedy film.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "arumallasundeepreddy",
        "review_rating": "10",
        "review_title": "\"Yeh Jawaani Hai Deewani: A Cinematic Symphony of Love, Friendship, and Unforgettable Journeys\"",
        "review_detailed_main": "\"Yeh Jawaani Hai Deewani\" is a vibrant coming-of-age film that seamlessly blends friendship, love, and self-discovery. With a dynamic cast led by Ranbir Kapoor and Deepika Padukone, the movie strikes a perfect balance between heartwarming moments and energetic celebrations. Ayan Mukerji's direction, coupled with Pritam's memorable music, creates a visually stunning and emotionally resonant cinematic experience. \"Yeh Jawaani Hai Deewani\" is a delightful journey that captures the essence of youth, making it a must-watch for those seeking romance, laughter, and a touch of nostalgia.\n\nThe narrative seamlessly weaves together heartfelt moments, humor, and emotional depth, making it a delightful cinematic journey. \"Yeh Jawaani Hai Deewani\" stands out as a refreshing and relatable story that resonates with audiences, leaving a lasting impression."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sdev-18759",
        "review_rating": "10",
        "review_title": "Heartwarming, Feel good Romance! Watch it without any doubt.",
        "review_detailed_main": "It's one of my favorite movie. Infact after this movie Ranbir Kapoor is my favorite hero. Comedy, Romance, Friendship, Love, Ambition, Good Music. So it's a combo!! After watching this movie you'll fall in love Ranbir's character. Don't miss it."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "khabc",
        "review_rating": "10",
        "review_title": "An all time classic",
        "review_detailed_main": "For all those romantic wanderers out there this is THE MOVIE.\n\nPerfect songs, Perfect Locales, Perfect cinematography, Perfect choreography, Perfect Direction & of course the Perfect Lead pair. Its as if Ranbir and Deepika were tailor made for this roles.\n\nThis is an enderaring romantic movie that you can watch for umpteen number of times. Deepika and Ranbir's acting is perfect. You can't get enough of them. Even Aditya roy, Kalki and Kunal roy have done a splendid job.\n\nAll in all, one of the best feel good romantic movies of all time.\n\nGo have fun...."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "shubhamchatare",
        "review_rating": "9",
        "review_title": "A great movie which tells about how to live life to the fullest",
        "review_detailed_main": "A very nice movie which will make you follow your dreams even though what comes in your life...The theme was not the only great aspect of Ye h Jawaani was the beautiful locations picked for the movie. The cinematography really brought out magic of travel and experiencing new things It is a very inspiring movie for youngsters to not only enjoy there life to the fullest but also make make yourself self independent... However, I do truly feel that it is a movie all youngsters should see. Its not too cheesy or dramatic, a bit for everyone to love.\n\nA worth movie to watch....Full of Friendship, Love and Determination."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "arorapranay-60803",
        "review_rating": "10",
        "review_title": "Awesome movie",
        "review_detailed_main": "A must watch movie with friends as it is one of the best movie I've watched so much fun and everything everyone wishes to have friends like adi who always supports bunny no matters what ."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "adityarajsinghgour",
        "review_rating": "9",
        "review_title": "Great Songs",
        "review_detailed_main": "Good attention is given to details Story is also good A little lengthy."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "amanprajapat-57308",
        "review_rating": "10",
        "review_title": "Keep u with the seat....",
        "review_detailed_main": "No words to describe this master piece.....So so relatable ......Frnds and love."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "sasikanth20",
        "review_rating": "8",
        "review_title": "Fun fun fun!!",
        "review_detailed_main": "If fun is what you're looking for, and have the patience to sit through a long movie, then this one is for you. Directed by Ayan Mukerji, whose last venture was the impressive Wake Up Sid, Yeh Jawaani Hai Deewani has all the elements required to make a good film. However, Ayan falters way too often, both with the screenplay and direction, which make YJHD just an average film. The story has shades of Dil Chahta Hai, Zindagi Na Milegi Dobara and 3 Idiots, but it does not charm you like any of those. I thought the screenplay was mediocre.\n\nNevertheless, a decent one time watch. Deepika and Ranbir sizzle up the screen, while the rest of the cast does a good job. On the downside, a shorter film with better screenplay would have been more effective.\n\nActing: 8.5/10 Story-Screenplay-Direction: 7.5/10 Technical Aspects: 7/10\n\nVerdict: 8/10\n\nFor a detailed review, please visit sasikanth.me :)"
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "robinrakibulhassan",
        "review_rating": "10",
        "review_title": "Great movie. Soul shifting.",
        "review_detailed_main": "I already watched it 5-6 times. Let's have a good luck to you. I will still be watching this movie again and again. Crying need yarr."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "farmerindian",
        "review_rating": "10",
        "review_title": "Hh",
        "review_detailed_main": "SPONSORED Reviews: Yeh Jawaani Hai Deewani Poster Yeh Jawaani Hai Deewani (2013) User Reviews (184) Add a Review rahuljonathan-nair2 August 2013 10/10 great entertainment Like all rom-coms, YEH JAWAANI HAI DEEWANI sparkles with romance, merriment and heartache, is brightly glossy and boasts of crackling chemistry between its lead actors, but Ayan makes sure the heady concoction never waters down. The best part is, he never borrows from romantic clichés that most love stories depend upon and that, in my opinion, is this film's biggest strength. Expect no unwanted melodrama, no unwelcome characters, no earsplitting background music to accentuate the proceedings... On the whole, YEH JAWAANI HAI DEEWANI is a revitalizing take on romance and relationships. A wonderful cinematic experience, this one should strike a chord with not just the youth, but cineastes of all age-groups. Watch this celebration of love and get mesmerized!\n\n30 out of 41 found this helpful\n\nPeter_Young17 September 2021 6/10 Enjoyable but pretty much a rehash Ayan Mukerji previously directed Wake Up Sid, his directorial debut, and he did a wonderful job with a film that was both refreshing and very good in and of itself. Just as it often goes with second ventures of promising first-timers, his next film, Yeh Jawaani Hai Deewani, is nowhere as good. I knew nothing about this film when I started watching it except that it was an extraordinary mainstream success. But I was quite interested in watching it. The film is not bad at all, but it just doesn't live up the hype it seeks to generate at its core premise.\n\nThe film follows four youngsters in one of their last trips together before one of them leaves the country. While the film is beautifully shot and is a thoroughly enjoyable watch, it's never more than pleasant, it's never overwhelming, and there's hardly any reminiscence of what the title prepared us for - you'll see none of the youth craze or even youth culture that you would probably immediately associate with this film, and what is lacking at the heart of an otherwise watchable film is the much called-for wild spirit which Mukherjee doesn't manage to capture.\n\nAnd it's not that Mukerji doesn't try. He does. There are some scenes of running through the markets, there are catchy songs and pretty girls, but the script often makes the story not ring true. The only portion where it leaves a mark is in the relationship between the two friends who meet after many years. The romantic tension between the two leads does work to a point, but sometimes it's too polished and fairy tale-like to really be impactful. And the biggest problem, it mostly just feels a rehash of previous films. At points the references to old Dharma (the production company under which the film is produced) films, people, and songs, is really pathetic.\n\nThe film's characters are merely derivative of previous famous characters, and are never given enough depth. Ranbir Kapoor repeats his Wake Up Sid character, and he does it well although it feels he never allows himself to shed all his inhibitions. Aditya Roy Kapur is exceedingly good in some parts and struggles in others, while Kalki is wasted although she is consistently good. The winner of course is Deepika. Again, her character is just a recap of popular characters (Kajol's Anjali in Kuch Kuch Hota Hai; Preity Zinta's Naina in Kal Ho Naa Ho), but she is wonderful, subtly conveying much through her expressive eyes and the tiny, nuanced gestures on her pretty face.\n\nTowards the end, the film grows incresingly fluffy, corny and starry, much to the point of losing the lighthearted nature it sought to define back in the beginning of the show. Heavy music and numerous sentimental scenes are followed by a most shallow moment of realisation on the part of the male protagonist, which is not convincing enough. Yeh Jawaani Hai Deewani is not bad, I have no doubt some would highly enjoy it. Actually I enjoyed it too, I just expected more from this film and was disappointed. Still so, it is watchable and entertaining, with some nice romantic and musical portions.\n\n13 out of 17 found this helpful\n\narupghose16 November 2013 8/10 A film that will make you want to fall in love I'm watching this film well after it was released in the cinemas (in fact after seeing both Besharam and Chennai Express) so I know how the film had performed at the box office, and what most people thought of it so my expectations were high!\n\nYJHD does through the typical roller coaster of a Bollywood romance, but where it differs from those that have failed, is that it has the star power of Ranbir and Deepika at the top of their game, alongside lovely music by Pritam and fantastic direction by Ayan Mukherjee.\n\nAyan is certainly one of the top young directors in the industry, and after Wake Up Sid, shows exactly why he holds his mantle piece. This work will go down as one of his finest, even though I am sure he will make many more films.\n\nThis role is bread and butter for someone of Ranbir's stature now. He eases into the role, initially playing the fun going flirty young man, then growing into the serious, yet romantic mature man later. This role is not on the same level as Barfi, there is no comparison, however it's these types of roles that will keep Ranbir competing with the likes of SRK for the romantic king award! Deepika has grown massively this year, and this being the third film (Ram Leela is the 4th) she has hit the industry with a bang in 2013. She looks stunning on screen and plays her role perfectly! Kalki, as annoying as her role, again plays it without any blemishes. Her role reminds you of Zindagi Na Milenge Dobara quite a lot! Aditya seems to be alcoholic of 2013 with this and Aashiqui 2 but does full justice to the role regardless!\n\nAnother massive plus point to the film Pritam's music. It's soulful throughout and adds a lot to the film. Kabira, Ilahi and Balam Picharki are my favourites.\n\nOverall YJHD is a beautiful film with performances that will be hard to forget. It may not win any awards this year, but it will certainly will be a film I'll remember.\n\n22 out of 33 found this helpful\n\nplanktonrules14 October 2013 7/10 The story of Naina and Bunny has a few clichés, but it enjoyable and fun.\n\nI enjoyed watching \"Yeh Jawaani Hai Deewani\" quite a bit, though I'll admit that the story has a few clichés here and there that kept it from being better. Still, given that I was watching it while flying across the Atlantic, it was a nice time-passer and kept my attention.\n\nThe film begins with Naina and her mother meeting up with a rather vacuous old schoolmate of Naina. While Naina graduated top of her class and is at the top of her class in medical school, this meeting with the schoolmate left Naina feeling that she's missing something...fun. So, on a lark, she decides to drop everything and head off on an adventure--and she picks the same destination the vacuous schoolmate chose. There, Naina slowly learns to unwind and meets sexy Bunny (he is a man--not some furry--despite the name). They hit it off and seem to be falling in love but one HUGE problem stands in their way--Bunny has vowed never to marry and wants to travel the world and experience EVERYTHING. What's to happen? See the film.\n\nLike the typical Bollywood film, this romance is predictable and there's lots of singing. You can't fault the film for this--this is THE format that Indian films follow these days and very few deviate from this. My problem with the film, and it's minor, was the silly scene were Naina takes off her glasses and instantly people notice how hot she is! What a cliché....plus my wife was much like Naina when I met her but is hot with and without her glasses! Still, it's fun and worth seeing.\n\n9 out of 14 found this helpful\n\nnairtejas31 May 2013 5/10 Ayan Mukherji Takes An Already Narrated Story & Adds Nothing To It... 50% Rating: 5/10\n\nHe takes up a ghissa-pita story, much like his debut Wake Up Sid and tries to turn it around. With the cast so heavily gorgeous giving out performances like its their last, revs up the movie-watching experience only for the first half. The second half sucks and drags a lot with cheeky references and illogical sequences. Overall, the route taken to say an old, short, romantic story, is arduous and infested with clichés as it dives into deep philosophy...\n\nTraces of Dil Chahta Hai, Rang De Basanti, Kai Po Che & even Aashiqui 2 is explicit, so is the filmmaking which feels like they have been inspired by Zoya Akhtar. Even the screenplay is timid. The story is clichéd, yes, and to make it worse, the climax actually works against the film although it is justified for a theme like this. Unpredictability is stereotype here but Ayan molds it for his audience as a fun, frothy buddy flick which actually loses pace when theme of Rockstar & Karan Johar led family ties enter the plot.. Juxtaposed with heavy numbers, life elements, relationships, romance & social conflicts, Yeh Jawaani Hai Deewani only appeals till midway.\n\nRanbir (who the film is almost based upon with the decisions he has to make as a complelling life of a nomad) & Deepike jazz up the screen with no mistake at all; yet Deepika's sudden shift from a pious, studious dame to her usual party- girl avatar is fishy , while Kalki & Aditya pass, with the script not letting them explore their insights. Kunaal is apt for the role while I still cannot construe what Poornima, Dixit & Rana were doing there. Revealing their characters may spoil the watch. Parental conflicts, much like in WUS is prevalent. Supporting cast (Farooq, Tanvi) is terrific. Music is brilliant and the locations add up to the movie-watching experience. At 165 minutes, the play seems to immensely go out of bounds, but the lead pair try hard and dishearteningly fail to keep us hooked. Emotions are played with and usual jealousy element brought up. Get a life, Ay."
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rmara1750",
        "review_rating": "",
        "review_title": "Not as good as it's made out to be",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "iamArpon",
        "review_rating": "",
        "review_title": "YJHD - A Big Budget Bollywood Rom-Com-Travel Movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "rahasyaratna",
        "review_rating": "",
        "review_title": "A perfect escape destination – Ye Jawani Hai Deewani.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt2178470",
        "movie_name": "Yeh Jawaani Hai Deewani",
        "movie_rating": "7.2",
        "review_username": "bhatia-apurv",
        "review_rating": "",
        "review_title": "YJHD :: Lets fall in love....... again ! ;)",
        "review_detailed_main": ""
    }
]