[
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Moscow calling",
        "review_detailed_main": "Don't be fooled by my funny summaries ... well try not to. I will not be angry if you do - it would validate them. London calling riff aside, this really isn't a good movie and my rating is another example of what friends have called me being too nice. But how can I not be with a cast that includes Claire Forlani, Ron Perlman and the great Christopher Lee? It is quite impossible.\n\nIf you don't count them in, this is more miss than hit. Still there are some fun little nuggets to be found here. But it is really a good thing they stopped making those. Because I wouldn't have been able to say after this: I'm through. Although there still is the TV show to watch I reckon ... well maybe I'll endure that too one day ... never say never.\n\nElvis references aside (someone over there in Russia apparently was a big fan), revolutions not being taken in, this tries to bond the US with the Russians I reckon ... I don't think it really succeeds, but what do I know."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "JohnSeal",
        "review_rating": "5",
        "review_title": "Looks like the last of a redoubtable series",
        "review_detailed_main": "Call me weird, but I have always enjoyed the Police Academy movies, and I found this one a pleasant diversion thanks to guest stars Christopher Lee and Ron Perlman. It's as silly as ever, but quite inoffensive, and Ian Jones captures some wonderful Moscow locations. Just think, without the fall of the Berlin wall, this film would not have been possible! Rife with continuity errors (look at the car windows during the chase sequence, and note that Perlman's character's last name is spelled differently on a manifest than it appears elsewhere), this was obviously filmed on the cheap. I like it anyway."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Chuckles11",
        "review_rating": "5",
        "review_title": "It's the worst Police Academy movie!",
        "review_detailed_main": "This is by far the worst PA movie out there. It's not horrible because (like me) you are probably a fan of the other PA movies. This movie is one level above terrible just because it's a PA movie and has most of your favorite characters in it like Captain Harris, \"Motor Mouth\" Jones, Callahan, Tackleberry, and Commandat Lassard. The plot is really bad. There are some genuinely funny moments in the movie. But there are only a few. It seems low budget, poorly written, and basically everything else that can be wrong, is wrong. But I suggest you watch it so you will have the ability to say you've seen all SEVEN police academy movies, and can trick your friends into watching this debacle, just like what I'm trying to do to you right now."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "The_Movie_Cat",
        "review_rating": "2",
        "review_title": "\"They've been doing this act for over a hundred years.\"",
        "review_detailed_main": "What is it that's so resolutely unfunny about Mission to Moscow? Is it the lifeless direction? The disinterested performances? The lack of atmosphere? The joke-free script? It's all of these things, of course, but there's also something inexplicably poor about it that you just can't quite put your finger on.\n\nThe regulars are the major weak point. While the guest cast have the misjudged enthusiasm to irksomely overact, all the usual culprits seem embarrassed by the whole thing. None of them sell their underwritten, reheated lines, and the fact that Bubba Smith and Marion Ramsey failed to sign up is a damning indictment. What comes through the screen, from George Gaynes to David Graf, is the sense of souls bleeding. \"Please get me a proper job, there must be a better way to pay my mortgage\" these actors scream with every fibre of their being. Leslie Easterbrook gets her usual single \"my character's got big breasts\" joke - why does she even bother to sign up for this crap? Michael Winslow looks old, tired, and frankly bored with the whole thing. Was his involvement only confirmed at the last minute? Because while he gives a curiously muted performance throughout, the script also fails to accommodate his talents in almost any way. Note that this is the ONLY Police Academy sequel in which he doesn't do his (admittedly run into the ground) \"Bruce Lee\" schtick.\n\nPolice Academy managed to keep up the same level of quality between films three to six - they were all rubbish. But even by their low standards Mission to Moscow plumbs the depths, making Citizens on Patrol look like Annie Hall. New recruit Charlie Schlatter, there for the completely incongruous love interest theme, is never funny and the Russian characters are the crass stereotypes you'd expect. Any film that promises \"we're going to kick buttski\" is clearly dumber than is tolerable, and a tasteless reference to Chernobyl doesn't help matters.\n\nThe only Police Academy film made outside the 80s, it was produced five years after the last one - why?!!?? Was there a big demand in the market for sh*te? Some cartoon sound effects (whistles, birdcall, etc.) are added to the action to try and pep things up, but this really is a DOA of a movie. True to form (or should that be formula?) it ends with an extended chase sequence that is neither suspenseful nor convincing.\n\nJust look at scenes like the one where G.W. Bailey gets hit in the face with stew. The stew is clearly missing his face and just lands on his chin, so Bailey (the only regular who tries) moves his face so that the full brunt of the stew will land on it. This dedication to duty is admirable, but also perfectly highlights the sloppy desperation of the whole thing.\n\nThe series' move from the teen fodder of the first two, 15 certificate, movies had been subverted into the last five, PG cert entries. This is at its lowest ebb here; a comedy that seems wholly aimed at the under-5s and doesn't know what to do with its characters. Russian acrobats entertain the kiddies while its ... er... \"stars\"... are left to stand around like second bananas, giving unfunny reaction shots.\n\nMaybe it's the \"fish out of water\" feel of it all, with the somewhat flat Russian espionage themes failing to ignite. But whatever it is, Mission to Moscow feels like a TV sitcom with the canned laughter track removed. In any other franchise this would be described as an \"unfortunate, sad end\" to the series. With Police Academy however, finishing with one of the unfunniest comedies of all time seems strangely apt. 2/10."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "adrian_knott",
        "review_rating": "",
        "review_title": "A serious drama about mental illness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "herrgruber",
        "review_rating": "1",
        "review_title": "Shocking. Truly shocking.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "GrandMaster_E",
        "review_rating": "1",
        "review_title": "What happened?",
        "review_detailed_main": "This film is the worst film that I have ever seen in my entire life. Where is Guttenberg and all the funny charachters? Why is the tall, blonde women being betin up? What in every courses names is going on in this movie? The first movie in this serie was good. The second one good, third one good, fourth was funny at it's places and so was also the case of the fifth...number six was very bad and number seven is so f***ing bad that im crying when i see the piece of crap."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "bronsonskull72",
        "review_rating": "1",
        "review_title": "Zero out of Five",
        "review_detailed_main": "This time the remaining recruits (Gaynes,Winslow,Bailey,Easterbrook and Graf) are back this time to help Russia fight off a computer programmer/mobster who plans on ruling the world with a strange video game in what is unquestionably one of cinema's worst movies ever. Yes it's that awful. I don't give many movie Zero stars, because I like giving at least a full star rating, but this sequel is just so awful one cannot even believe their eyes when watching this worthless tripe. Is there one laugh to be found in the entire movie? Well, yes there was one scene that had me laughing, it's how the news reporter is supposed to be hooked on \"The Game\" but there is actually no video game inside the unit. Aside from that this is so awful that it doesn't even deserved to be mentioned in the same sentence as comedy, indeed it doesn't deserve to be mentioned in the same sentence of Police Academy 5! The only positive spin I can perhaps put on Mission To Moscow is that it most likely killed the series, and even if it didn't, there's no possible way a sequel could be worse than this.\n\n0/5 Matt Bronson"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Mercury78",
        "review_rating": "1",
        "review_title": "Nothing else to do, and still a waste of time.",
        "review_detailed_main": "I saw this film when I was on a 9 hour ferry crossing, I didn't even have to pay to go and see it, and it was still the most painfully stupid and unfunny film I have ever sat through. I actually quite liked the first film, being young and impressionable it made me laugh. But this was just embarrassing.\n\nI'm very happy to help this film out with its progress up the IMDB list of worst films of all time. 1/10."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Old Crow-2",
        "review_rating": "1",
        "review_title": "Can it get any worse?????????",
        "review_detailed_main": "This movie is one of the worst films I´ve ever seen. I didn´t laugh at all during this total flop. I can´t believe the Police Academy went this far! They should´ve stopped years ago!!!!!!!!\n\nThis movie is bad bad bad, perhaps worse than the worst movies I´ve seen. There´s nothing positive to say about this. Expect that if we are lucky, there won´t be any other parts in this series!\n\n-10 out of 10 (SUCKS BIG TIME!!!!!!!)"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Sandcooler",
        "review_rating": "1",
        "review_title": "It's uhm, in color",
        "review_detailed_main": "God, I don't even know where to start here. This movie is not just awful, the only thing to describe it is surreal or hypnotic. This is a comedy without any jokes, no story, no anything. It's not hard to get why this is the last credit for both screenwriters. We see something with a bellboy in a hotel, then something with Lassard getting in the wrong car, some bike tricks with Jones, just try to make a plot out of this. The actors all look incredibly bored, even the new guy seems like he's already sick of these movies. The attempts to humour are just really bizarre. Of course you have the usual reused jokes from the original, but now they've added weird cartoon sound effects to them like you're on a really bad trip. In reality you're just watching a really bad movie. Really it's no surprise this movie tanked, just check out the tagline. Oh God the tagline. Kicking buttski(cringe). Make you laughski(roll up in a ball). The academy is YAAARGH back...ski. Excuse me I'm going to hang myself now."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "setnicgabriel",
        "review_rating": "10",
        "review_title": "Pure comedy. I laughed a lot.",
        "review_detailed_main": "This movie is not for everyone. It's good for fans of the genre. It makes you laugh and makes your day more beautiful and that's it! RIP! for most of the actors who are no longer with us and who make us laugh even now."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "manitobaman81",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "Passable fun. After reading some of the negative reviews on here, I just have to say that some people really don't get it. It is very light-hearted and it isn't complex at all. This is probably the worst of the sequels, with nothing to laugh at, yet still somehow heartfelt and riveting from the first frame to the last. I refuse to totally dismiss this, because I find it quite engaging, in a guilty pleasure sense. The plot is not as well thought out as the original, but it still does the cast well. This film is worthy of whatever hopes you have. It gets 7 out of 10 even though the main plot of the film was constantly being interrupted!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "torstensonjohn",
        "review_rating": "2",
        "review_title": "Bombs Away",
        "review_detailed_main": "Not much to say with the idiocy within the film. I feel absolutely embarrassed for Ron Pearlman to be in this film. It lacked wit, creativity, humor and was just dull. I laughed maybe, maybe once. BOMB"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "mcfly-31",
        "review_rating": "",
        "review_title": "now it's stupid",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "gwnightscream",
        "review_rating": "4",
        "review_title": "Could've Been Better!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "ma-cortes",
        "review_rating": "4",
        "review_title": "Below average and routine sequel with several jokes , chases , confusion , and lots of fun",
        "review_detailed_main": "Run-of-the-mill sequel with usual ingredients , mayhem, entertainment and amusement. In Police Academy : Mission to Moscow , the bumbling team to accomplish the most dangerous assignments , this time to confront nasty Russian mobsters . It is a run-of-the-mill follow-up with ordinary trappings , antics , confusion and mayhem . The misfit Police Academy is now assigned an abroad mission in this sequel to the popular Police Academy movie, as they go to cold Moscow, a few years after their success in Police Academy 6: City under siege (1989). Here Commandant Rakov (Christopher Lee) calls in friend Commandant Eric Lassard (George Gaynes) to lend a hand in stopping a megalomaniac Russian mobster , and before long, the experienced team to carry out their mission . The Russians need help in dealing with the Mafia and so they seek help with the veterans of the academy . They head off to Moscow, in order to find evidence against Konstantine Konali (Ron Perlman) , who marketed a computer game that everyone in the world is playing . As our friends Larvell Jones (Michael Winslow), Eugene Tackleberry (David Graf) , Captain Callahan : Leslie Easterbrook proceed to a risked journey to contend the most dangerous criminals in the world . Kicking buttski !. Making you laughski !. The Academy is backski! Just when we thought the Cold War was over, leave it to these guys to heat it up again !. The Police Academy regulars, from meathead Tackleberry to the impeccably inept Cmdt. Lassard, are back again to answer law enforcement's most uproarious role call !. Take off with the original cast... and some new recruits as they take to the streets and the skies to fight crime . On land, on sea, or in the air, no place is safe from them! But relax, Russia . Think of the academy. Now that's the kind of school people can trust, the kind of school whose grads fight crime with slapstick instead of nightsticks. Those goofy oddballs in blue are going to tangle ! . Objective: Laughs. Hold everything! The cadets are training for an all new adventure!\n\nInferior entry but amusing , funny and cheerful film , filled with action-packed , thrills , hilarious set-pieces, tongue-in-cheek and lots of humor. As the more bumbling team formed by the police officer friends Michael Winslow : Jones , David Graf : Tackleberry and a nerdish recently graduated Cadet Connors : Charlie Schlatter and Commandant Lassard : George Gaynes are assigned an overseas trek to fight crime once again plaguing the Moscow streets. The premise is simple and plain , as our misfit , botcher team from the known police force is assigned a Russian mission and subsequently to undertake a confrontation to an evil gang . Director delivers a professional work but with no much interest , his knack of getting the most out of characters and situations without ever going over the top making for some very big laughs . This production pays tribute to previous film , taking parts here and there , and repeating former sketches . The jokes and frolics come as thick and fast , hit and miss as usual and it is done in good spirit if not always in good taste . So-so picture with accent on sight gags , and humour that stems from the diverting roles established in other movies . The sympathetic cast formed by the motley band of misfits giving fun interpretation creating confusion , laughs ,mayhem and chaos . Showing up habitual actors in the popular series, such as Michael Winslow , David Graf , and of course G. W. Bailey who in previous entries had hoped to return as Lieutenant Harris, but was passed over in favor of Art Metrano , but he appeared in this Police Academy 4 and other sequels . In fact , Michael Winslow, David Graf, and George Gaynes are the only actors to appear in all seven Police Academy movies. However, original cast members had allegedly complained about losing screentime to the new cast members. It contains an attractive and lively score by Robert Folk , series' regular , including the classic leitmotif . As well as atmospheric and appropriate cinematography . The motion picture was regular but professionally directed by Alan Metter and with no originality, because it copies other previous films of the famous saga . As trivia to mention the risked conditions to shoot when government troops began their assault on the Russian parliament building , in fact President Boris Yeltsin was literally at war with the Communist-controlled Duma as the entire cast and crew had to retreat quickly on October 4, 1993 . Producer/writer Paul Maslansky and Director Alan Metter were lunching at the United States Embassy when the confrontation began. They decided to re-group with their company at the Hotel Gorbachev Finance Academy, about five miles from the chaos. Filming resumed a few days later, confident that President Boris Yeltsin had regained control.\n\nThe series based on the chracters written by Neal Israel and Pat Proft is as follows : ¨Police Academy¨ 1984 by Hugh Wilson . ¨Police Academy 2: Their First Assignment¨ 1985 by Jerry Paris , James Signorelli . ¨Police Academy 3: Back in Training¨ 1987 by Jerry Paris . ¨Police Academy 4: Citizens on Patrol¨ 1987 by Jim Drake . ¨Police Academy : Assignment Miami Beach¨ 1988 by Alan Myerson.¨Police Academy 6: City Under Siege¨ 1989 by Peter Bornerz . ¨Police Academy: Mission to Moscow¨ 1994 by Alan Metter . And ¨Police Academy the series¨ 1997/1998 , 26 episodes by Neal Israel, Paul Maslansky, Pat Proft ."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "utgard14",
        "review_rating": "1",
        "review_title": "Worth Waiting 5 Years For...",
        "review_detailed_main": "...said no one ever. So, the last Police Academy sequel was in 1989. It was terrible. This one came out in 1994 and it proudly picks up where the last one left off. Christopher Lee plays a Russian police commandant who can't catch criminal kingpin Ron Perlman. So he sends to America for the Police Academy losers. This is surreal. The plot is so deeply stupid that I lose IQ points just typing it. Series regulars George Gaynes, Michael Winslow, David Graf, Leslie Easterbrook, and G.W. Bailey return. No laughs are to be had. The cast, whose likability kept the series afloat early on even when the jokes missed the mark, can do nothing to save this sinking ship. Actually, it had already sunk by this point. Now it's just a few survivors desperately trying to stay afloat before the sharks eat them. Avoid unless you are a glutton for punishment."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "JRGBUCS",
        "review_rating": "1",
        "review_title": "I'm glad my power button works.",
        "review_detailed_main": "After 6 movies, couldn't they buy better writing? Or at least better acting? The slapstick is the dumbest I ever seen. Harris is just dumb, not funny anymore, in fact that goes for the whole group. If you want to see a good PA movie, just watch the first one. BTW, I love it when they show the Russians speaking English to each other, even when there are no Americans around."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "samilan",
        "review_rating": "1",
        "review_title": "I did like Police Academy movies... Before this one.",
        "review_detailed_main": "I grew with the movies Police Academy 1, 2, 3, 4 and 5... I can't even keep on track of how many times I have seen them. I can't believe how all the time they kept on getting worse and worse. 1 and 2 were great. 3 and 4 were good. 5 was enjoyable. But 6 and afterwards were just awful. I'm glad I watched this movie. Once. I have never even given it another thought afterwards. Until I saw it here in the top 100 of the worst movies ever. Which is where it belongs."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "phubbs",
        "review_rating": "2",
        "review_title": "Police Academy: Mission to Moscow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Remington3200",
        "review_rating": "1",
        "review_title": "100% Laugh-free",
        "review_detailed_main": "Putting it as simply as I can so as to truly convey my contempt for this film: many of us have heard people use the line \"two hours of my life I'll never get back\" to describe a movie they disliked, and there really isn't anyone alive who doesn't find that phrase old and tired. This is the only movie I've ever bothered to use a version of that line on (thankfully, it's only 83 minutes, not two hours) out loud, because no other obscenity-free phrase describes it.\n\nI've seen some terrible movies in my day, but up until sitting through this one I never found myself actually ANGRY at a movie for being terrible. This movie is supposed to be a comedy, and I'm not exaggerating at all when I say I found it to be ONE HUNDRED PERCENT laugh-free. There's not even a single accidental funny moment anywhere in all 83 minutes. Awful. Horrible.\n\nI implore anyone who hasn't seen this movie yet to avoid it like the plague. Your 83 minutes could be spent better doing almost anything else."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "bevo-13678",
        "review_rating": "10",
        "review_title": "What will they think of next",
        "review_detailed_main": "I don't know about you but I hope they never stop making police academy movies"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "contact-282",
        "review_rating": "7",
        "review_title": "3.5 is ridiculous... it's no worse than others",
        "review_detailed_main": "It's really no worse than any of the previous installments. I just finished a PA marathon on Neflix and I can say that they're all very consistent, I wouldn't rate one higher than other.\n\nRussia is portrayed rather inaccurately but who cares, the movie is fun to watch."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "captaincheese69",
        "review_rating": "3",
        "review_title": "Meh",
        "review_detailed_main": "Still better than Hollyoaks or the Twlight movies."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Big Movie Fan",
        "review_rating": "",
        "review_title": "Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "planktonrules",
        "review_rating": "2",
        "review_title": "The franchise is running on fumes...if at all.",
        "review_detailed_main": "The first \"Police Academy\" was a mildly funny film with a lot of jokes...some very funny, many not. It's surprising because of this that six other film sequels followed as well as a short-lived TV series. While I have only seen the first two films, I decided to watch this final movie for one big reason...it's currently on IMDB's infamous Bottom 100 List--the 100 lowest rated major release films. Somehow it turned out to be the only entry in the series to make the list.\n\nThe plot involves SOME of the idiots from the previous films being invited to Russia to help the Russian police capture a gangster named Kanali (Ron Perlman). And, once there, the team act like a bunch of brain-dead buffoons. Steve Guttenberg left the series after the fourth film (a sure sign that the franchise stinks when even Guttenberg won't appear in the movies), he's replaced with a bland wimp played by...well, who cares?? He's not the only absence...several other series regulars are strangely absent....their good luck, actually as the film has no redeeming qualities whatsoever....none.\n\nHow bad all this? Well, for starters nothing about this is funny. Instead of laughs, they use a lot of bad slapstick...such as a scene where the perennial foil, Captain Harris, has a dog urinate in his face and several scenes where guys are hit in the crotch. Also, for big laughs(?) all the sound effects not done by Michael Winslow were stangely loud and exaggerated. None of the film makes much sense and it's obvious that the actors were simply going through the motions in order to get a paycheck and they had pretty much given up on their careers.\n\n\n\nOverall, a film that is LESS funny than cancer...and a truly cynical excuse to squeeze the last few dollars out of a failing franchise. See it only if, like me, you actually WANT to see all of the Bottom 100. I can think of no other reason to see it...unless you are a masochist or plan on using it to torture someone.\n\nI give this one a 2....as at least the film has nice cinematography and is in focus and has sound."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "filmbuff1970",
        "review_rating": "1",
        "review_title": "Turkey",
        "review_detailed_main": "The end of an Era not with a bang but the lamest whimper. The Police Academy series had its fair share of laughs. This trash does not contain even one funny scene. Poor Christopher Lee having to appear in this dud. As for the rest of the cast shame on there Pathetic attempt to cash in on a once popular movie series.1 out of 10"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "rohanm546",
        "review_rating": "1",
        "review_title": "The worstest sequel of all Police Academy movies from the Franchise!!",
        "review_detailed_main": "I don't know in first thing, why this movie was made. It has nothing nice to offer you as its before 6 sequels. All comedy scenes seems as if they were created purposely for the sake of comedy as this is a comedy movie. All actors from the original one who were there in this movie looks like did this movie only to earn extra bucks nothing. Thank god Steve Guttenberg Aka Mahoney didn't did this movie. Its better to watch first 6 movies as a re run or repeat again, movie rather than watching this movie first time. Please don't waste your time watching this movie."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "TBJCSKCNRRQTreviews",
        "review_rating": "1",
        "review_title": "Look, it's not America! Isn't that hilarious?!",
        "review_detailed_main": "A Russian mafia boss(Perlman, who can't not be a badass... he is only human, though, and he can't save this; neither can a Stalinesque Lee) has put out a new cartridge(played on the GameBoy, available from Nintendo at your local stores in a variety of colors!; also, going by the first scene(by the way, did they have nothing to cut to?), you don't need to insert it to play it), and there's some crime or somesuch. Clearly the writers didn't care, so why should we? Trust me, when you find out what the supposed plan is, it's beyond ridiculous. I watched the second movie, the third and then this on TV. Not sure why they skipped the three inbetween... I have a hard time imagining that they were worse than this. At this time six years had passed since a flick in the series(you know, back when they cranked them out as if their oxygen supply was depending on it). You might think this time was spent on a script. You would be wrong. This is violently unfunny, with extremely poor, uninspired and half-assedly executed gags. Do you laugh when you see things flying back and forth through the air? If so, this is for you. Literally, I think that was their goal. Try to count the amount of objects that you'll see this happen to. They're also unbelievably culturally insensitive. If this stuff was at least clever, or had genuine observations, but it's based on a proud ignorance(and clear fear) of anything beyond the borders of the US. Had this been seen by many ex-Soviets, the Cold War may have started back up. Not just because it's offensive, no, also on account of how incredibly stupid it makes its country of origin look. Look. I have guilty pleasures. We all do. This one, however, crosses a line that I'm not sure anybody realized existed. You see, whenever the production of a creative enterprise is undertaken, there's an expectation that actual effort will go into it. If nothing else, by accident. This manages to avoid that entirely. A lot of energy must have been spent on keeping it out. The acting is bad. Characters are cartoons. The \"humor\" is screwball without skill. Cinematography and editing are average at best. At least there are hot chicks. There is brief nudity in this. I recommend this to those who have to experience the dread for themselves. 1/10"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "elpaz79903",
        "review_rating": "5",
        "review_title": "Not very smart",
        "review_detailed_main": "First and foremost this is a funny movie. Problem is, it's been done six times before. We have here the seventh installment to the ever popular Police Academy series and not the best in the bunch, not the worst either. Personally, I thought part six was worse than this.\n\nHaving the Academy go to Moscow and reek havoc was so much of a good idea that it might work. It does work for a while until it becomes routine comedy. Slapstick is one but routine gets tiresome. Now I hope this is the final part in the series, 'cuz it gets old too fast.\n\nThe acting was okay, the direction was fairly decent, and that parts finding the person's DNA and habits with the hair and front desk clerk posing as the commander while sitting on the toilet were well done. The main plot was the sleeper here, and the small comedy parts were the interesting parts in this movie hence the 5 out of 10 rating I give."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Feels like a life sentence",
        "review_detailed_main": "As has been said before in my reviews for the previous six 'Police Academy' films, the best of the 'Police Academy' films will always be the original by quite some way. It isn't great and will never be a favourite comedy or overall film of mine, but it clearly knew what it wanted to be so it was easy to take it for what it was and what it set out to do.\n\nIt was followed by six sequels, and none of them were as good or even on the same level as the first, though admittedly some are worse than others. Most of them are actually being pretty bad or worse and lose what was enjoyable about the original in the first place. While it was with the fourth film where things properly got particularly stale, it was from the fifth film where finding redeeming qualities proved to be difficult, with the sixth film and especially this one being particularly bad.\n\nJust in case you're wondering why all the seven films were watched, mainly it was curiosity to see as to whether the sequels were as bad as their reputations, to see if they were that bad or if it was a case of going against the general consensus (which honestly has happened with me before).\n\n'Police Academy: Mission to Moscow' is the worst of the series and is the first time in a while where watching a film (which always helps me forget any troubles and is a favourite pastime) feels like the viewer is serving a life sentence of their own. Not even some nice locations can save it because a gorgeous city is not used in its full majesty. The previous sequels ranged from tolerable to terrible but still had a couple of casting bright spots or gags that just about worked. 'Police Academy: Mission to Moscow' has neither of those, it's completely devoid of laughs and has no redeeming qualities, as the locations are pretty wasted here they are not enough to count as one.\n\nOnly a few of the original cast members return, but are reduced to acting even stupider than before and looking bored while all their material is one-joke and no longer funny, instead being dull and annoying and saying it's gone beyond breaking point doesn't feel enough. Charlie Schlatter, if can be humanly possible, manages to be even blander and more ill at ease than Matt McCoy.\n\nAnd what possessed great actors like Christopher Lee and Ron Perlman to take part? Lee tries but has very little to do, an unforgivable waste of a screen icon who could turn lesser material into gold when able and a crime that none of the other films committed. Perlman constantly looked like he regretted doing the whole thing, the embarrassment and lack of enthusiasm is all over his face the whole time he's on screen.\n\n'Police Academy: Mission to Moscow' is so amateurish-looking it makes the previous sequels, all of which looked cheap, look like Best Cinematography/Editing Oscar winners. There is nothing memorable about the soundtrack, while the direction gave the sense that the director didn't know what he was doing.\n\nLike the sixth film, the premise was stale by the fourth film but now it is a case of an increasingly thin and repetitive premise stretched to breaking point and now with this film beyond that. The film is completely laughter-free, with recycled material that passed its sell by date long ago, and at worst the writing and gags are worse than infantile, swaps genuine hilarity, wit and cleverness for a distasteful mean-spiritedness, low-brow smut (that would make the crudest 'Carry On' films seen sophisticated in comparison) and juvenile vulgarity.\n\nIn summary, absolutely awful and the worst of the 'Police Academy' films. Mercifully, no more was made after this. 1/10 Bethany Cox"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "WedgeJarvest",
        "review_rating": "2",
        "review_title": "Why was this movie made?",
        "review_detailed_main": "I'd like to say more but what is there to say? Why was this movie made? Not one laugh, NOT ONE! i pity anyone who watched this movie, let alone enjoy it??? Was this movie made with the intent of being the worst movie ever or is there a chance someone thought it might be good. Surely not!\n\nI've been told to make this comment 10 lines long, so I'll finish with a comment to the director, cast, and crew of this monstrosity. 'What the hell were thinking? You will rot in eternity for wasting anyone who watched this movie's time and for putting them through o much pain!' I'm presently searching for a movie worse then Police Academy 7 but i have been unsuccessful. My quest continues."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "fugu_286",
        "review_rating": "10",
        "review_title": "I'm in de bathrooooom...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "BigWhiskers",
        "review_rating": "7",
        "review_title": "Not bad considering it was a low budget direct to video release",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Spartan-3",
        "review_rating": "1",
        "review_title": "Suckiest film ever",
        "review_detailed_main": "Don't rent this film, it's supposed to be a comedy but there's nothing funny in the film!!! Only thing I felt when I was watching the film was anger. SUCKIEST FILM EVER!!!!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "bob the moo",
        "review_rating": "",
        "review_title": "One weak, stupid pratfall after another",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "nathanielg2",
        "review_rating": "1",
        "review_title": "Unbelievable stupidity and lack of taste! An all-American SHAME!",
        "review_detailed_main": "Watch any \"Police Academy\" or \"Porky\" series film, and then think that someone invested money in making such a lousy movie, and that someone else actually spent time writing it, and (the worst part) that people paid for tickets to see these pieces of garbage - not my case, as I saw very little of them on TV -, and also imagine that there are kids watching their parents play roles in the movie. How can you respect these people after that? Movies like these are as tasteless and show as poor an imagination as the cheapest amateur middle-eastern clandestine porn shots. Why would someone find fun only in absurd and bizarre stupidity? Why would an absolute idiot, or a disgusting pig, or a ridiculed gay -and that's all these films are made of- make anyone laugh? You like these films? Think about what that tells about yourself."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Johan-smedjebacka",
        "review_rating": "5",
        "review_title": "Better than it's reputation",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Sleepin_Dragon",
        "review_rating": "2",
        "review_title": "Why on Earth would Christopher Lee have said Yes?",
        "review_detailed_main": "Let's face it, it isn't funny, there are no laughs in this film whatsoever. The script is bad, and the performances are woeful, several years on since Police Academy 6, all of the magic and life has long since drained away, I find it quite a sad watch. The plot makes no sense at all, even in the most crazy of times this lot will have been unemployable!\n\nThe original run were a child of their time, the first few had a definite sparkle, by 1994 audiences had changed dramatically, and sadly this disaster had all the appeal of an airline Russian salad.\n\nThe stereotypes were a disaster, at least the costumes are decent, and they have lots of authentic Ladas.\n\nA sad watch. 2/10"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "mafster",
        "review_rating": "1",
        "review_title": "Approximately 80 Mins. of Suffering",
        "review_detailed_main": "Watching this film made me see the truth...I'd rather have pins impaled into my eyes than waste a second watching this...erm...film!!! The only thing from this series that actually gets better with age is Leslie Easterbrook. I beg people who are curious to stay clear or actually watch it and understand why you would want to blow yourself up for fun afterwards.\n\nI have also noticed that they are planning an eighth adventure with some of the old stars. Let's just hope they can create a GOOD film this time round otherwise my eyes are gonna sting!\n\nSo a 0 out of 10 from me and it will never shift...well maybe the other way to -1."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "s-woodier",
        "review_rating": "1",
        "review_title": "god help us all.",
        "review_detailed_main": "enthusiastically, i took my best friend to this film. he is still not speaking to me. the audience were silent for the whole movie (except for the ones who were demanding a refund, and that was more or less everyone.) my other friend is blind and deaf and even he was finding it a struggle.this film must be quarantined for all our sakes. if there is an outbreak of police academy 7, we are all dead. the actors all look like someone has got a gun pointing at them from behind the camera. In reality, it is the audience who are pointing guns at them. I will never forgive warner bros. for tricking people into going to see this monstrosity."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jhaggardjr",
        "review_rating": "1",
        "review_title": "Only one laugh",
        "review_detailed_main": "I had said in my review of the first \"Police Academy\" that I had never seen the seventh film in the series subtitled \"Mission to Moscow\". Well guess what? I just happened to catch it on TV, and I wish I hadn't. The \"Police Academy\" series did hit absolute rock bottom with \"Police Academy: Mission to Moscow\". I only laughed once through the entire picture. Only once.\n\n1/2* (out of four)"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Biffe",
        "review_rating": "1",
        "review_title": "This movie will only make you mad and embarrassed!",
        "review_detailed_main": "All the previous Police Academy -movies have all had some kind of \"event\" or comic episode that they will be remembered for. Police Academy 7 does NOT! This movie is the \"Disney-version\" of the PA -movies! It contains so many cheap jokes and such bad acting, that only VERY young kids will let this movie get away with it! The humor is on a \"clown-level\" and contains mostly people slipping, falling and trying to make funny-faces...\n\nThe actors look like they have been asked to improvise and make stuff up as they go along and the script could not have been much longer then the movie-title itself...\n\nThey have only managed to get a hold of five of the original cast and only three of these five is the well known police Sargent's that we know from the previous films. As the movie goes along, it looks like they start to realize, along with us that are watching, what a mistake it was to \"act\" in this movie and that this will probably be the last PA-movie in a long time!\n\nHow they got Christopher Lee and Ron Pearlman to act in this mess, I will never understand!\n\nBiffe, Norway"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "sethn172",
        "review_rating": "10",
        "review_title": "My review on the 7th installment in the \"Police Academy\" series...",
        "review_detailed_main": "\"Police Academy\" first came out in or around 1984, I think. The first time I've seen this movie (and this was not in theaters, this was way later, on TV, I think), it was funny. It was like \"Car 54, Where Are You?\" Almost.\n\nSeveral parts later, the Police Academy jump the pond...all the way to Moscow, Russia! There, they have to deal with the Russian Mafia. I've read the tagline for this movie, and that made me laugh: \"Kicking buttski. Making you laughski. The Academy is backski!\" You gotta love the \"ski\" part of Eastern European languages; believe me! You have to try that sometime! I hope there will be an 8th \"Police Academy\" movie in the works soon!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "saint405",
        "review_rating": "6",
        "review_title": "Sequels keep piling on",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "theobm",
        "review_rating": "1",
        "review_title": "rule of thumb",
        "review_detailed_main": "There is a rule of thumb that goes along with Police Academy: Mission to Moscow, if u liked the first 6 Police Academy movies that came before it..., it doesn't matter you are still going to think this movie sucks. It was obviously just a production company trying to make sure they squeezed the last possible cent out of the series and forgot they should have come up with a watchable plot first."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "autumnshowers",
        "review_rating": "",
        "review_title": "A masterpiece.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "EijnarAmadeus",
        "review_rating": "1",
        "review_title": "One of the worst movies made",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "SteveNo96",
        "review_rating": "1",
        "review_title": "No one should have to watch this!!",
        "review_detailed_main": "This movie was so bad that they should have put up a warning before it started that it was going to be lousy. It isn't enough that Mahoney and Hightower weren't in it, but you knew after number 2, it was going to stink. This was the worst of all of them and rightfully, the last one."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "DeepRest",
        "review_rating": "1",
        "review_title": "Final nail in a long overdue coffin",
        "review_detailed_main": "Speaking of nails, I specifically remember stepping on a nail a few months before I saw this movie. My foot became infected and I had to endure a long healing process, along with a ton of shots. That experience, as painful as I remember it being, was far less painful than sitting through this godawful movie. I'd walk a plank full of nails a mile long, while barefoot, rather than watch this movie again,"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "SnakesOnAnAfricanPlain",
        "review_rating": "1",
        "review_title": "Police Academy: Mission to Moscow (1994)",
        "review_detailed_main": "The final nail is hammered into the coffin. Grossing less than $1,000,000 at the US box office and for good reason. The film relies on jokes about the Russians and their accents. Even Hooks, Hightower and Hurst fail to reappear. Gaynes is given top-billing, but is reduced to a \"lost in Russia\" subplot. Bailey has nobody to play off making his character the downer for the first time. He needs a Proctor to riff with. Lee and Perlman do their best with bad accents, but just aren't interesting. Winslow, Graf and Easterbrook are used too much, making their characters do things we're not familiar with. Schlatter is a kind of Mahoney, but he's never truly likable. Bad jokes, wasted characters, and a sense that nobody cares about what is going on, leaves this film as useless as you'd expect."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "nicholls905-280-546911",
        "review_rating": "1",
        "review_title": "Terrible",
        "review_detailed_main": "Poor film and conclusion to the Police Academy franchise. I would increase my review of number 6 if I'd known this was terrible. Incoherent plot and humour, or lack of humour. I had blamed the short pre-production timeframe previously, but this has no true excuse. Bad filmmaking and production results in one of the worst films created. The original cast didn't return for good reason. Why are the Russian officers like chimps? Just a bad film."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "nickthegun",
        "review_rating": "1",
        "review_title": "Craptacular",
        "review_detailed_main": "Police Academy is one of those franchises you can draw an exponential graph of crapness for. I loved the first one ('Mahomo' still kills me), thought the second was O.K and so on. They gradually got worse and worse (actually six had its moments, but I digress), culminating in this craptacular effort. Actually it culminates in the equally terrible 'Police Academy: The series', but that's neither here nor there (but fits in well on the crap-o-graph).\n\nThis film is bad for so many reasons it is frightening. My first beef is with roping in a few well respected actors into this farrago. My second is with all the terrible Russian stereotypes. Well actually my second is really that this film is crap, but that's a bit general.\n\nThe fact that the Police Academy series has followed such an easily identifiable loss of quality surely showed someone that making this piece of crap was a bad idea. Or at the very least showed them where they went wrong in the previous 4. It is just a project that was bereft of ideas from the start, a sign of a bankrupt imagination.\n\nWhat a load of Crap. (I know I mentioned that a lot, but what other word encapsulates the feeling of this film so well)"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "alistair-3",
        "review_rating": "1",
        "review_title": "So bad you'll feel an urge to stab yourself in the leg with a fork!",
        "review_detailed_main": "Watching this film was, without a doubt, one of the most painful and tortuous events of my life. It's not just that the same tired old jokes don't work anymore, it's the feeling of utter despair and sympathy for the actors who have been reduced to turning out this kind of drivel in order to feed their families. I feel like I should sue the studio for depriving me of 82 minutes of my life."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "lady_y",
        "review_rating": "10",
        "review_title": "Funny movie!",
        "review_detailed_main": "I see that rating of this movie are not high but this is in USA. May be if you are Russian, you like it more? Anyway, never seen such a charming Russian gangster like Konali. I also thought that after losing Steve Guttenberg as Mahoney \"Police academy\" will never really come back again, I didn't like too much 5 and 6 movies. But it happened and although it has some boring scenes, I liked Russian mafia (the first time! *smile*), scenes in theater and restaurant and the idea of kidnapping *smile*. Yes, I like this movie. A lot."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "RF456",
        "review_rating": "6",
        "review_title": "The worst of the series.",
        "review_detailed_main": "I rented the movie hoping to see another silly but funny police academy installment, but I soon discovered that this movie is beyond silly. It's almost like a spoof of all the police academy movies before it. All I have to say is don't watch it because you will waste your time and money. I recommend the 4th installment instead because in my opinion it is much better."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "unknown270",
        "review_rating": "1",
        "review_title": "The first movie I have ever turned off right at the beginning",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "the_silent_man",
        "review_rating": "",
        "review_title": "c'mon....... (WARNING: SPOILERS AHEAD !)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jakabrezigar",
        "review_rating": "1",
        "review_title": "extra total ultra mega rip off",
        "review_detailed_main": "well, this officially qualifies as the worst movie i've ever seen in the cinema. i should've just gone out for a burger or something. true, there was not much else to see at that time, but still nothing could be worse than this flick. very very poor acting, plus i didn't smile once during the whole movie and believe me it wasn't just one of my moods. my advice to you stay far away from it as posssible."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "wchngliu",
        "review_rating": "1",
        "review_title": "The First Police Academy Was Somewhat Fun, But Seven Is Overkill",
        "review_detailed_main": "The thing with film sequels is that although it is important to retain the premise, the concept and the characters, it is also important that each film is as different and diverse from the last in terms of plot especially. Unfortunately with the Police Academy series, it is the same old lame, toilet filled, childish jokes used over and over again and the same old tireless formula being milked to death. The acting is bad,and when I mean bad, I don't mean wicked or brilliant- just mediocre, the humour is more on par with the under 10s and not even clever and humorous as it was the first time round. The first two films were okay but by the third onwards, it starts to grate on you, as you wonder how on earth the people behind this managed to get away with churning out the same old tireless jokes and infantile, silly humour in each instalment.\n\nThis type of humour worked with the Naked Gun trilogy but that's because it only went as far as three films, which is reasonable enough. But SEVEN? Now that is when a film becomes predictable, the same as the last and thus, it is no longer watchable anymore. Police Academy seven was in itself awful... just bloody awful."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "mentalcritic",
        "review_rating": "1",
        "review_title": "They exhumed Ed Wood...",
        "review_detailed_main": "Maybe it's the clumsy political message about the good we can all do if we just work together. Maybe it's the poor attempts to make something patently awful seem funny. Perhaps it is the incredibly stilted dialogue. Could it possibly be that the characters don't even receive half of their first dimension? Regardless of the reason, one cannot help but imagine that if Ed Wood were alive today, this would be the kind of film he'd make.\n\nThe Police Academy films as a series were never about high-brow humour, or high-brow anything, but this film has so many problems with it that it's impossible to know where to begin. Charlie Schlatter, obviously desperate to appear in anything since his career tanked after The Delinquents, plays a part that is as discernably different from Brownie Hansen as a white wall is discernably different from a bone-white wall at a distance of eighty feet. George Gaynes is the top-billed star, but the story displaces him from the action very early on. The rest of the cast struggle with a script that doesn't even allow them to perform the schtick that they got down to an art in the other six films.\n\nThe story, such as it is, concerns itself with a Russian crime syndicate that distributes a video game. So far, so good, except the first moment we see when the game is explained involves a newscaster playing it on a Nintendo Gameboy... that doesn't have a cartridge loaded into the appropriate slot. It gets worse from there. Claire Forlani gets the thankless task of portraying Charlie Schlatter's love interest. Given that she doesn't draw attention to her poor acting, even trying to act off a guy who looks more like Alfred E. Newman than police officer material, she must represent the Good Actor quotient of this episode. The plot is not a whole lot better. I can understand Charlie's character going into the crime boss' hideout undercover, but I'd like to know how it is that almost the entire rest of the squad show up.\n\nRon Perlman and Christopher Lee also get a turn to injure their careers here. Lee's performance is fairly quick and to the point, giving a bit of exposition to explain why the Russian police would solicit the help of these goofballs. His screen time is minimal, but it's not enough to add this film to the list that have left Christopher Lee wanting to fire his agent. Ron Perlman gets a great deal more screen time, but thankfully he manages to convince the audience, in spite of the layers of crap, that he really can act. While you're watching him, however, spare a thought for G.W. Bailey, who has tried so hard to find credible work outside of this ridiculous franchise, all to no avail.\n\nTo be fair, the film is fairly reasonably shot. The photography, while not nearly as brilliant as that shown in Sergio Leone films, is competent enough to demonstrate why the only way to present a film is in the intended aspect ratio whenever the option exists. The dialogue, while horribly stilted, manages to get the story across. I wonder if it is just a coincidence that the character name Konali is so similar to that of a video game developer (Konami). I also wonder if the Russian gymnast police were originally intended to make grunting sounds similar to the bleating of monkeys. The last strength of the film, as is always the case where Police Academy is concerned, would be the incomparable George Gaynes, although one has to wonder if he was in full possession of his faculties from around the time he signed his contract.\n\nI gave Police Academy: Mission To Moscow a one out of ten. Don't act like you're surprised. This is without a doubt one of the worst films ever made, and its place on the IMDb's bottom 100 is well-deserved. Its best purpose is as a present for someone you're not fond of."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Leofwine_draca",
        "review_rating": "3",
        "review_title": "Nothing to see here...move along",
        "review_detailed_main": "The seventh POLICE ACADEMY film and the one that notoriously killed off the franchise (TV series and planned remake aside). This one sees the few remaining familiar faces heading off to Russia to combat an evil megalomaniac who plans to put Trojan horse software into a popular video game franchise he's created.\n\nIt's as ludicrous as it sounds, but what really hurts MISSION TO MOSCOW is the lack of talent involved. I never thought I'd miss Steve Guttenberg but I really did and David Graf is no substitute. Michael Winslow is the only one I have any remaining liking for and even he's more annoying than funny here. Poor old George Gaynes and G.W. Bailey play out the same tired gags that they've been running since the first instalment.\n\nIt's fair to say that I never laughed once during this puerile gag-fest in which all the jokes are well telegraphed, the slapstick is painful rather than amusing, and the acting embarrassing. This is the infamous POLICE ACADEMY that Christopher Lee appeared in as a favour, although thankfully he's not on screen too much. As for Ron Perlman's villain...well, Perlman has made his disdain of the movie widely known, so there's not much more to be said than that."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Bored_Dragon",
        "review_rating": "5",
        "review_title": "Guilty pleasure",
        "review_detailed_main": "The last part of the \"Police Academy\" franchise is on the IMDb Bottom Rated Movies list and its Metascore is 11, and I laughed to tears at its reviews. The movie inspired a bunch of people to hilarious bashing. And it is a fact, the movie is disastrously bad. The script is retarded and the humor is even worse. The few jokes that could pass as humorous are the recycling of the previous films in the series, so this is not particularly funny either. But for reasons I can't explain, I liked this movie better than the previous three. While four to six made me yawn, this one relaxed and somewhat amused me. And you can't imagine my surprise and delight when no less than Christopher Lee appeared on the screen. Plus I've always been weak on Claire Forlani.\n\n5/10"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "vonnoosh",
        "review_rating": "3",
        "review_title": "No less bad than the average modern day comedy remake.",
        "review_detailed_main": "Remember those Pink Panther movies with Steve Martin or that one with Roberto Benigini? How about these new Ghostbusters movies? The 2016 movie was bad enough but just the trailer of After Life made my eyes roll. How about that latest Vacation movie? Mission to Moscow is at least as good as those and it has an advantage those movies didn't have. This doesnt try so hard to be something its not. Good.\n\nThis movie is lousy compared to everything else already done in the series. I liked the Police Academy movies when they were new to cable. Granted my age was still in single digits in those days and Id grown out of cartoons by then. I remember seeing 2, 3, 5 and 6 often on Cinemax and I do mean often. Paid Cable had a tendency to beat to death certain movies. There is a nostalgia around them like sitting through Twins, Memories of Me, Money Pit, Punchline, Awakenings, Air America, Weekend at Bernies and Who's Harry Crumb? All movies played out beyond anyones comprehension on cable, But Mission to Moscow? I didnt know that existed until years later because it was direct to video. Now that Ive seen it, I can at least say Ive seen it.\n\nWhat everyone says about it is true. It was all done before and better in these movies with a fuller ensemble cast and when the gags weren't worn out yet. I wouldn't recommend watching this one. Really the backstory about the making of this is far more interesting and would have been an excellent documentary. Not many comedies are produced in the middle of a civil war. I found myself imagining what was happening behind the scenes when I should have been laughing at the jokes. It is also interesting to see Russia instead of Toronto like most of the other movies.\n\nAnother advantage this movie has over the overdone but still bad remakes is you can at least see some of the original cast, half of which are gone now. Indeed, David Graf has been gone for nearly 20 years now.\n\nAgain, its bad but in the present day context of what Hollywood tries to revive based on name recognition alone, it is at least as good as most of them..."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "aliyjam",
        "review_rating": "2",
        "review_title": "an unnecessary made serie",
        "review_detailed_main": "I gave 2 points for the last scene. Characters of police acedemy series were badly scripped, especially Captain Harris, he is not that kind of fool charracter in previous parts. The only problem is the script that affected the movie badly."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "on_the_line",
        "review_rating": "10",
        "review_title": "Police Academy rules the world!",
        "review_detailed_main": "Any Police Academy film is worth 1 million 'The Hangover's'. I don't get people who only like the first Police Academy. The Police Academy franchise has brought us many, many, wonderful, wonderful, films. They are all excellent. I still can't decide whether number 3 :Back In Training is better than the first film. I am yet to find any other film that replicates the wonderful style of comedy put forward in the Police Academy films. I can't wait for the 8th film to be released and if brain-dead haters, who can't work out that the films are supposed to be ridiculous, stop the 8th film from being released, then the world will reap my vengeance."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "rataube",
        "review_rating": "6",
        "review_title": "Enjoyable if you like the series",
        "review_detailed_main": "I just re-watched all 7 Police Academy films, this one might not be the best one in the series, but it isn't the worst one either. The plot makes no sense, most of the scenes are beyond ridiculous, but the same can be said about most of the other Police Academy movies. If you enjoyed watching the old cast goofing around before, this one can bring up a few smiles, specially Commandant Lassard, who is as clueless as usual. Many of the usuals (Mahoney, Hightower, Fackler, Zed, etc) are absent from this one, but Lassard makes up for it."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "SkullScreamerReturns",
        "review_rating": "4",
        "review_title": "Part 7: Maybe slightly better than part 6",
        "review_detailed_main": "I was curious to see this one since long time because I had the memory that it was the worst of the series by far. Watching it again I was surprised a little bit. Because I think it wasn't much worse than part 6. Maybe even an inch better beause there was more plot and the jokes were a little bit more amusing. I also liked the ending with Lassard, it had a little bit of that old glory that should be in the series finale. The Russian setting doesn't work really well for me, it's a little bit forced or something. It's interesting that Christopher Lee was in this film. I've never seen him in a comedy. But he didn't give much value to the movie because he didn't do anything but talk few lines with russian accent.\n\nAlongside with part 6 this is the weakest Police Academy movie. Not one of the worst films ever, but only recommended for Police Academy maniacs."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "MovieAddict2016",
        "review_rating": "",
        "review_title": "Even the tagline suckski!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "marttilamberg",
        "review_rating": "2",
        "review_title": "One of the worst movies ever.",
        "review_detailed_main": "This must be one of the worst movies I've ever seen. The main purpose of these no-brainer comedies are just to have some good laughter with a good company. The only times we laughed, while watching must have been when the film was so bad that it was ridiculous All the jokes are so predictable and pure underarm fart. All the best characters are gone, only Sgt. Jones, Tackleberry and Capt. Callahan('s breasts) are present. The writers couldn't make any good jokes of their wild personalities. Michael Winslow's funny sound imitations are only clips worth watching, and even they are worse than usual. Commandant Lassard was also present, but the character was effectively written out of the movie by a joke that lasted too long (for the whole movie!). Even Christopher Lee's performance as the Commandant Rakov was ridiculous.\n\nThe plot must have been very mild, just an excuse to make a new movie. I'm not sure because I can't remember it any more, even though I saw this just about a week ago. And I remember all the other Police Academy plots, even though I've seen them years ago."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "fantasmic1971",
        "review_rating": "1",
        "review_title": "Please...",
        "review_detailed_main": "This is a sad, final entry in the film series. I enjoyed the movies up until this 7th installment. What were they thinking? What a waste of money! Truth be known, I'd actually welcome another Police Academy movie -- as long as the next one was actually funny. And interesting. I rented this one once, watched it once, and never watched it again. It was just that bad. Parts 1 - 4 were good, 5 was okay and six was better. What the deal with PA7 was I'll never know!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jaws!",
        "review_rating": "2",
        "review_title": "piece of garbage",
        "review_detailed_main": "at least the other movies in this series had humor. this movie is not one bit funny or entertaining. i don't know why they waited so long to release such trash. this movie is maybe worse than class reunion,which was a beyond unfunny movie. i give this trash * out of ****"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Bethwagstaff",
        "review_rating": "3",
        "review_title": "Lame.",
        "review_detailed_main": "What is this mission to Moscow you speak of? I only know a completely lame movie that was call that. This is what that was. I'm sorry. Comedy? What is this comedy you speak of? This is pure crap. Not comedy. I dont even want to tell you about this mess.\n\n3/10"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "mik31415",
        "review_rating": "1",
        "review_title": "Don't waste your time",
        "review_detailed_main": "This is the worst movie I've ever seen. It's a shame that a funny movie like Police Academy spawned so many awful sequels. Watching it I felt embarrassed for the film's actors, producers, and everyone else involved in its making. Those guys must really need what little money this straight-to-video disaster brought in."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "malkane316",
        "review_rating": "4",
        "review_title": "Quick Reviews!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "BandSAboutMovies",
        "review_rating": "4",
        "review_title": "The last one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "rossrobinson",
        "review_rating": "10",
        "review_title": "fantastic",
        "review_detailed_main": "Police academy 7: Mission to Moscow i thought was a fantastic movie. The actors and actresses were fantastic in this movie i think. This movie was made in 1994, making the actors and actresses a come back after a 5 year break. I hope there will be an 8th police academy movie because i just think that it is police academy are a great set of movies. 10 out of 10."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Filmreader",
        "review_rating": "7",
        "review_title": "I enjoyed it",
        "review_detailed_main": "I don't give a b loody damn for the critics of others. I enjoyed and I will watch it again and again !"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "rangesterling",
        "review_rating": "2",
        "review_title": "Why even bother with 7th movie",
        "review_detailed_main": "They should've stopped at the 6th one, there was no need for making this film."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "RussianPantyHog",
        "review_rating": "",
        "review_title": "Lighten up folks!! This movie is funny.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Anonymous_Maxine",
        "review_rating": "2",
        "review_title": "The first time in my life I've ever consciously missed Bobcat Goldthwaite",
        "review_detailed_main": "Ah, so here we are. Rock bottom. The Police Academy series has been through a lot of ups and downs over the years. They seem to have been hugely popular during their times of release, and really, if you look at the numbers, it's not hard to see why such a prodigious stream of sequels was made. The first movie was made for a budget of around $4.5 million and brought in a stupendous $81 million at the box office. The second movie brought in $55 million, part 3 brought $43.5 million, part 4 $28 million, part 5 almost $20 million, part 6 a meager $5 million, and Mission to Moscow proudly raked in a whopping $126,000. If nothing else, the Police Academy franchise stands as a perfect example of a film series that was played out until it was officially a very, very dead horse.\n\nThe awesomely moronic plot this time involves a Russian mafia boss named Konstantine Konali (played by none other than Ron Perlman, now better known as Hellboy), who is marketing a video game that he plans to use to secretly distribute a computer virus that will allow him to hack into government security systems and like, take over the world or something. The movie opens with a scene that is meant to show us how purely addicting this game is. We see a news report where a woman is giving her news report, and her co-anchor, a man in maybe his 50s or so, is sitting next to her oblivious what's going on because he's so entranced by the Game Boy he's playing. I imagine we weren't supposed to notice that there was no cartridge in the machine he's playing, but no matter. I'm willing to let that go in order to enjoy the avalanche of stupidity that was to follow.\n\nSo why are the members of our beloved Police Academy in Moscow in the first place? Well, it seems that the Russians need help in dealing with the Russian mafia, so they have recruited the help of the most famous police academy in America. And mostly the gang is all here except for Mahoney and Zed, both of whom I am sad to say are missed.\n\nLassard, of course, is his usual self, so he has gotten himself lost and ends up at a Russian funeral within a few hours of touching down in Moscow, so the rest of the team occupies themselves with trying to compile evidence against Konali while Harris follows along two steps behind waiting to jump in at just the right moment and claim credit for everything.\n\nAs usual this provides plenty of opportunities for bonehead comedy, but they just pulled out all the stops with the low brow humor this time. Harris and Tackleberry end up dancing in full make-up and costume in a Russian ballet in one of the movie's most embarrassing scenes, Harris attempts to spy on Konali and instead gets a dog peeing in his eye through a periscope, and Jones has developed the ability to open safes with his noise effects. Sigh.\n\nIn the movie's defense, it does have it's moments. Well, it has it's moment, anyway. There is a scene where Tackleberry jumps at the opportunity to give a speech to the Russian authorities about American law enforcement tactics, and he launches into a vicious beratement of the piddly \"excessive force\" policies that are tying his hands back in the states. Yeah, the movie is spectacularly stupid, but this might have been one of Tackleberry's two or three best scorns in the entire series.\n\nIf you ever find yourself watching this thing on DVD, make sure to watch the short supplemental video that's included! I have to admit that I have found it particularly interesting and amusing to watch these videos for each installment in the series, where much of the original cast come back together and discuss the movies. I especially love G.W. Bailey (who played Captain Harris), who clearly has grown weary of having ever had anything to do with the series. In the video for part 5, he sarcastically mentioned people who would approach him years later and ask if he still had \"Dork\" tanned across his chest. For this one, it is noticeably difficult for him to conceal his resentment as he talks about his past in performing Shakespeare on stage, and now he's remembered for a dog peeing in his eye.\n\nDon't worry, Mr. Bailey, haven't you seen the box office for this movie? No one's seen it!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "steve-575",
        "review_rating": "1",
        "review_title": "awesome movie!",
        "review_detailed_main": "Great movie! How in the world did Forrest Gump win the Oscar over this movie? It's such a travesty that not one person from this film was even nominated for an award! How could the people who vote for the Oscars overlook such a great script and phenomenal acting? Oh well, I can't wait for the next Police Academy movie. Hopefully the next one won't get overlooked come Oscar time!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "crazyrabbits",
        "review_rating": "3",
        "review_title": "I can't believe it came to this...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jboothmillard",
        "review_rating": "1",
        "review_title": "Police Academy: Mission to Moscow",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Smells_Like_Cheese",
        "review_rating": "1",
        "review_title": "Mission to Moscow",
        "review_detailed_main": "Oh how sad is this, I finally finished the Police Academy series, with the first 4 sequels, I was actually looking forward to the last of the bunch, but as it turns out, everyone was right, Mission to Moscow fails and falls flat on it's face. There was no laughing at all on my case and I was actually looking forward to this movie. I loved the first few Police Academy movies, so I didn't see why I couldn't love the last couple sequels, but at this point, I think they were just trying to milk the Police Academy series for all that it was worth. There is only 2 of the original classmates back together and we have Harris, Harris is the only funny character these past couple of sequels. Mission to Moscow really doesn't try and is without a doubt the worst of the sequels and was a waste of my time, the story was weak and the characters were lame.\n\nThe team is sent to Moscow, Russia to help them out with the Russian Mofia and their crimes. The Russian Mofia is distributing video games and is brain washing the entire world with the record breaking sales they are making. But the team plans to go under cover and take down the idiot criminals who are beyond hard to believe that they could even spell let alone take over the world or security systems with their minds. Lasard must try to make sure the team can do this while trying not to embarrass the American cops and their reputations.\n\nPolice Academy: Mission to Moscow, I wanted to trust this movie, I watched it with an open mind and am very disappointed. We only have Harris and Winslow to pick up the team with the laughs, but even they couldn't hold it together enough to make this movie funny. It's just trying too hard and was nothing without the old gang, it would have been so much cooler if they had the original cast back for the last movie, but I don't know if there were plans to make another Police Academy, but I'm glad they didn't. Police Academy: Mission to Moscow wasn't good, I wouldn't recommend it at all, it was lame and a sad ending to a funny series.\n\n1/10"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "pmtelefon",
        "review_rating": "5",
        "review_title": "Not as bad as you think",
        "review_detailed_main": "\"Police Academy: Mission to Moscow\" is a near miss. It's not a total loss. It has some funny moments and quite a few almost funny moments. This movie was hurt by its lack of budget. The location photography looks really good but much of the movie looks cheap. That said, I enjoyed watching this movie. I really liked the adventures of Commandant Lassard. I wish this movie spent more time with that story. It was funny. Honorable mention: a dreamy Claire Forlani."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Bosco 55th",
        "review_rating": "10",
        "review_title": "Low budget comedy movies never work.",
        "review_detailed_main": "We should all know low budget comedy movies with a storyline never works. Besides, it was the seventh sequel. You shouldn't expect that much from this movie. As a loyal fan to the earlier Police Academy movies...I am forced to like it."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "TulioIMDB",
        "review_rating": "7",
        "review_title": "We're off to Russia!",
        "review_detailed_main": "We're off to Russia to kick many many butskis and we will crush them in Police Academy 7.\n\nThe American police are on a mission to mess with the operation again.\n\nIt was a light hearted amusing funny movie with silly gags and likeable characters.\n\nSergeant Eugene Tackleberry always cracks me up when he's enforcing the law.\n\nOn the other hand this is an uninspired installment in the franchise and lacking the charm of the earlier ones so it's not the best and is missing some of the classic characters and some parts are a bit slow but it's a nice little goodbye from the coppers franchise.\n\nMeet you in the bathroom!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "PathetiCinema",
        "review_rating": "1",
        "review_title": "I laughed until I bled.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "MrBaldrick",
        "review_rating": "",
        "review_title": "A towering masterpiece",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Uriah43",
        "review_rating": "3",
        "review_title": "Going Through the Motions",
        "review_detailed_main": "Needing help to deal with a powerful member of the Russian mafia, \"Commandant Rakov\" (Christopher Lee) of the city of Moscow requests the assistance of \"Commandant Lassard\" (George Gaynes) along with some of his best police officers to advise and assist them. However, when his team gets there they discover that there are those within the Moscow police department who aren't so keen on obtaining their help. Likewise, \"Captain Harris\" (G. W. Bailey) has his own agenda which isn't necessarily the same as everyone else as well. At any rate, although the movie started off well enough it soon reverted to the same old gags featured in all of the other films in this series and everything-and everyone-seemed to be simply going through the motions. Additionally, nobody really stood out one way or the other either. In short, although there were a couple of fairly entertaining films in this series, the sad fact is that everything has pretty much run its course and the thrill is clearly gone. I have rated this movie accordingly. Below average."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "sandalphonmk",
        "review_rating": "1",
        "review_title": "Disquisting",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jp992751",
        "review_rating": "3",
        "review_title": "Not as good as the others!",
        "review_detailed_main": "If you have never seen a police academy movie, than this one might be ok to watch. It has its entertaining moments but nowhere near compares to the original. It does not deserve the low rating it has recived on this site."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Edge49",
        "review_rating": "4",
        "review_title": "Worst one of the bunch",
        "review_detailed_main": "I binge watched all police academy movies over a couple week span and I wish I could have my time back. This one was awful, no surprise. Just a bunch of small clips that made absolutely no sense but somehow a plot was formed somewhere. There was a quick scene with some nudity and that bumped my rating up 1.\n\nThis series started great from the first one and then just kept getting worse and worse. I'll say it again, only watch this one if you're doing a police academy marathon. There is literally no other reason to watch this movie."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "adamjohns-42575",
        "review_rating": "1",
        "review_title": "Mission to find a script?",
        "review_detailed_main": "This film manages to create a simplistic unfunny kind of \"humour\", but Lassard is still quite good, he does some great things with his face and he is probably the best bit about the entire film as he goes off on a journey all of his own.\n\nThere's some very obscure mid European comedy that is really quite odd and they play on the Russian circus thing far too much and maybe even the Russian stereotype as a whole for that matter. I was confused by the Russian police \"clowns\" that sounded like the three stooges, but I could have coped with that, if they had been the only circus reference.\n\nConnors was very cute, but the film was definitely missing Hightower and maybe even hooks too.\n\nAll in all I don't think it really needed to be made, but it's better than a couple of the others.\n\n127.55/1000."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "scrybe314",
        "review_rating": "3",
        "review_title": "Beating a Dead Horse for the Last Time",
        "review_detailed_main": "Let me just say that, for the record, I enjoyed the Police Academy movies. I even found a few laughs in Number Six, which is by no means an easy feat. Yet I first viewed this piece of cinematic flotsam when I had tonsillitis. My pain tripled.\n\nAgain, the first few P. A. movies were actually okay. The slapstick was good, Winslow's sound effect talents were original, and the characters had life in them. Police Academy 7, however, has eliminated all but the most uninteresting of characters. Callahan is still a one-joke character, Winslow's sound effects have long since become irritating, and the rest of the cast isn't worth noting. I didn't find much to laugh at in this movie. IT was fairly obvious where the humor was supposed to come into play, but it just wasn't there.\n\nI believe this to be a case of beating a dead horse, but to a whole new level. The producers/directors who thought that bringing the Police Academy crew back *again* and not suffer the same fate as Miami Beach weren't beating the horse; they were slapping thing's tombstone. It was a disappointment to see the decline of the series, because it almost destroys the humor of the original three. You can't help but know what the characters will turn out to be, and it just makes for a depressing movie overall."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "filipemanuelneto",
        "review_rating": "1",
        "review_title": "An unnecessary film.",
        "review_detailed_main": "Sometimes it seems producers have a hard time understanding when a movie shouldn't be made. The \"Police Academy\" franchise should have ended in the sixth film, and even then it would be ending up pretty worn out. This film, made several years later, was an effort that was simply needless and certainly leaves no one with good memories.\n\nAfter seeing the movie, I was really sorry that the franchise ended with such a bad movie. It was something that, for me, should have been avoided. \"Police Academy\" was one of the most interesting and successful comic franchises of the 80s, and there are still many people who have fond memories of these films today. I myself, as a child, saw them several times on television.\n\nThe script is perfectly idiotic and a simple excuse to take some of the characters in the film to post-Soviet Russia, where they must help the local police to fight a big mobster who is turning into an oligarch (one of many that, as we know, emerged from the ashes of the communist regime, fat with shady deals in which the Russian people ended up losing). It's an unhappy, poor script made by incapable people. Humor, on the other hand, is completely absent. I don't laugh for a single minute.\n\nThe cast, which until now had been relatively stable (with the absence of several actors starting from the fourth film), had completely collapsed, and most actors refused to be part of this project. George Gaynes is back, but his character, Commander Lassard, looks simply like an old man with Alzheimer's (with all due respect to anyone suffering from this serious illness, don't get me wrong). Gaynes is not funny, and his performance here is disgraceful. Michael Winslow also tries to make some of the jokes he's already used to us, taking advantage of his vocal skills... but he doesn't have the material or time and what he does has no freshness or novelty. Sir Christopher Lee makes a brief appearance in the film, and as far as I can understand, he did so as a favor to the producer. Friendship is a beautiful thing, and also professional courtesy, but I bet Lee won't want to be remembered for this movie (and he certainly won't, he's done better things, as we know). Who ends up standing out in some way is Ron Perlman. The actor, who we know for other, much more dignified works, tried to be funny and give some dignity to his character. Meritorious, respectable, but unworthy of the actor he is. The rest of the cast is not worth mentioning.\n\nAre there any redeeming qualities in this film? To be honest, I don't think so..., but even so, I feel obliged to make a small caveat: I liked the fact that they did a lot of the filming in the real city of Moscow and that they used real Russian extras and Russian speakers. This gives the film a certain authenticity that deserves to be highlighted, and which is most lacking nowadays, where any piece of green or blue screen replaces a real set and saves a few dollars on the production budget. However, it must have taken courage and some dose of madness to try to make a film in the midst of the political and military upheavals Russia was experiencing in those years."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "bocephus-3",
        "review_rating": "10",
        "review_title": "Mission to Moscow is a Mission of Fun",
        "review_detailed_main": "Police Academy movies never really get the respect that they deserve. Most people will just say that this movie or the series are bad. This movie was released directly to home video, VHS at the time and people did not get a chance to see it. This movie is just good fun. The late David Graf is a comedy genius, the man knew what was funny and what was not and had a great eye for finding a perfect script. The move of the series to Moscow helps add a new and exciting twist to a all ready wonderful series. Steve Guttenberg should have fired his agent for not getting him involved in the film. The legendary actor Bubba Smith also does not appear in this film and makes me wonder his ability to make good career choices. There are many touching scenes, many moments when I laughed and cried. I am waiting for them to release a DVD with director commentary, and cast interviews.I give this movie an A+"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jasonturvey",
        "review_rating": "1",
        "review_title": "Utterly dreadful",
        "review_detailed_main": "I laughed twice. Once when Captain Harris farted, and again when he burped. And that was it.\n\nOne of the worst films ever made."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "annalevit",
        "review_rating": "",
        "review_title": "for Russians - funny",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "lippylip26",
        "review_rating": "5",
        "review_title": "Pathetic conclusion to a very enjoyable series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "themovieraidshow",
        "review_rating": "1",
        "review_title": "A Mission To Go Nowhere",
        "review_detailed_main": "The story goes right to where it should of built up but it's weak, simple and un interesting. It doesn't make much since that they have to bring American police from the U. S. to take down a Russian mob boss, it doesn't give much of the flavor given in the earlier sequels but it really wants to tell us it's a three stooges go to Moscow vibe.\n\nIt's just not a good sequel although it is nice to see some of its familiar cast return, it tries to be slapstick and hard to even like this sequel.\n\nA positive thing to say is this ended. Some franchises should quit to a certain point considering the types of characters this one has it can only stretch thin."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "MJB784",
        "review_rating": "3",
        "review_title": "Police Academy movies were as dumb as they seem to be.",
        "review_detailed_main": "Now, the boys in blue go to Moscow to save the day when a rich man tries to take over Russia's most famous game titled: The Game. He then calls it: The New Game. Police Academy's very first straight to video filck. The gang seems wiser than before because everybody else appears to be dumber than they are. The gang is even losing lots of their buddies from other Police Academy movies. Actor Michael Winslow's sound effects are getting too boring. Don't worry, the title designs are better than before. Not even the dearest Police Academy fans would want to watch this movie because of how boring it is."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "oswaldmosley",
        "review_rating": "10",
        "review_title": "Please release me let me go...",
        "review_detailed_main": "Will people please start backing this film. OK pin our ears back: THIS FILM IS NOT SUPPOSED TO BE TAKEN SERIOUSLY. IT IS A SPOOF. Leslie Nielsen is one of the finest old-man actors in the world and this film hinges on exactly the same tired gags as have kept him afloat for the last 15 years. How can you not like it?????"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "GLINES",
        "review_rating": "",
        "review_title": "An Insult!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "vickyangel",
        "review_rating": "8",
        "review_title": "Excellent film!!",
        "review_detailed_main": "Excellent film, really funny and Charlie Schlatter really made the film worth seeing. There was humour, action and romance, and well something in it for everyone to see. I really enjoyed it and recomend it to all Charlie Schlatter fans!!"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "worstofwrestling",
        "review_rating": "",
        "review_title": "This movie made me consider shooting my Television",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "punter11",
        "review_rating": "10",
        "review_title": "Thank you for this film",
        "review_detailed_main": "Police Academy was popular in Russia back in the day. It is likely that this film (#7) was made for russian audience. It is different fron #1-6.\n\nI enjoy watching this film. There are a few moments, fleeting details which make this film the best in the series for me.\n\nBig thanks to all who participated in making this film."
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "reecor-09202",
        "review_rating": "",
        "review_title": "did not like at all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Chad-14",
        "review_rating": "10",
        "review_title": "A rollicking adventure deep into the pits of stupidity.",
        "review_detailed_main": "If you actually were able to view this crap all the way through, you are better able to absorb self inflicted torture than the average human. I was agonizing through this wonderful piece of film up until the \"egg scene\" and had to \"turn away\" and turn it off. All I can think of to sum up my final thoughts of \"Mission to Nausea\" is (and I quote) \"I'm in ze bathroom, I'll meet you there\".\n\nrating: 0.5 Smirnoffs (out of a possible 1000)"
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "nmoc",
        "review_rating": "",
        "review_title": "the Citizen Kane of comedies",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "VINIT1981",
        "review_rating": "",
        "review_title": "ABSOLUTELY PATHETIC!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "ditka-2",
        "review_rating": "",
        "review_title": "Score another one for the wacky cops we all love!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "norrie81",
        "review_rating": "",
        "review_title": "Oh Dear",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Deigo",
        "review_rating": "",
        "review_title": "This movie is a public health hazard",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "ncfc-canary",
        "review_rating": "",
        "review_title": "Oh my god, how low did this series sink?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "VINIT1981",
        "review_rating": "",
        "review_title": "ABSOLUTELY PATHETIC!!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "slay913",
        "review_rating": "",
        "review_title": "Police Academy Flunks",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "B Lawless",
        "review_rating": "",
        "review_title": "Bankrupt of anything close to being funny....",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "tfrizzell",
        "review_rating": "",
        "review_title": "They Had to Travel Outside the Country to Fail This Time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "LesWaste",
        "review_rating": "",
        "review_title": "This movie didn't suck that much. Ok, so I lied",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "movieman-1408",
        "review_rating": "",
        "review_title": "worst of the series",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "pipin-1",
        "review_rating": "",
        "review_title": "Perfect example of a waste of time.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Klectron",
        "review_rating": "",
        "review_title": "Does the word 'crap' mean anything to you?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Hac",
        "review_rating": "",
        "review_title": "If you bought it, HEY! You just bought an expensive blank tape!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "Tanusha",
        "review_rating": "",
        "review_title": "The worst series.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0110857",
        "movie_name": "Police Academy: Mission to Moscow",
        "movie_rating": "3.5",
        "review_username": "jellyneckr",
        "review_rating": "",
        "review_title": "Only a few good laughs!",
        "review_detailed_main": ""
    }
]