[
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "vivekdlko",
        "review_rating": "7",
        "review_title": "The best sci fi bollywood can offer till date",
        "review_detailed_main": "Well Krrish is the highly awaited sequel to \"Koi mil gaya\". The wait is finely over.so how does it fare?Does it live up to the hype? well there could be mixed answers to this question.\n\nIts definitely better than the first part. But on the acting point of view it definitely disappoints. the film solely relies on Hrithik Roshan's shoulders and he delivers but this is certainly not his best as an actor though as krrish i cannot think of anybody else but him playing the role , all the other characters are just passable which include the highly talented \"Rekha\" who looks uncomfortable in the role of a grand mother.Priyanka Chopra looks good and is camera friendly though not much of the histrionics on her part.\n\nThe story is quite predictable with hardly any twists.The first half of the film is a mediocre boy meet girl romance with tracing the origins of krishna aka krrish. the music is alright though not as good as rajesh roshan's previous attempts. its only in the second half that film picks up and the special effects come into play.These special effects are good according to bollywood standards. Like any other superhero movie it does have a villain in Naseeruddin Shah.he has played roles as a villain like in \"Mohra\" before but this time hes strictly okay.\n\nThe film has high production values the director has handled the product well.But overall he's confused whether to churn out an out and out sci fi flick or a mix of all genres.The film was Promoted as a Super hero movie though its more of a romantic-super hero type. That thing could be due to the budget constraints it was not made as solely as a science fiction/super hero movie. The special effects look a mix of \"matrix\" ,\"crouching tiger hidden dragon\" and other action flicks . On the whole krrish traces the origins of our very own desi super hero. it could be the first in the series with more to come. I hope the sequel will be more of a super hero type with more CGI and special effects romped in.\n\nGo see krrish if you are a Hrithik Fan. you will not be disappointed.\n\nall an all a popcorn flick with a difference."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "SelvarajanK",
        "review_rating": "6",
        "review_title": "A Super-Hero is Born",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "singh-amrit",
        "review_rating": "7",
        "review_title": "It has started.",
        "review_detailed_main": "So it finally started. India's first super hero is finally here and is ready to take on the best in the business. Krrish opened almost together with Superman Returns and is already eating a major share of business from the legendary super hero, which is a hint enough to mark the grand arrival of the Indian. World now seems a safe place, along with Superman, Batman and Spiderman, now we have Krrish to save the world from evils. The film invests a lot of time in evolution of a super hero from a common man. But once it arrives, you wish the movie runs for some more time... Krrish could do with some more action. the film ends just when your excitement is on the peak. Hrithik pulls the act very well, and Rakesh Roshan again proves that only he can extract best out of his boy. Though the movie is good, but not as good as its prequel Koi Mil Gaya, where you had 2 things to watch out for..splendid acting by Hrithik and Jadoo... This flick certainly lacks Jadoo... both the lovable alien and the cinematic magic... But I guess arrival of Indian Super hero could not have been better. Bravo and all the best Roshans."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Heatednemz",
        "review_rating": "",
        "review_title": "Not \"YET\" as good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "eternally_screwed89",
        "review_rating": "7",
        "review_title": "Don't go by the hype and don't compare it with Hollywood and you will be fine.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Abdulxoxo",
        "review_rating": "7",
        "review_title": "Entertaining",
        "review_detailed_main": "Krrish is a film full of entertainment. There's action, comedy, drama, songs etc and Hrithik Roshan is in his finest form. He has not just given a great performance, but has also fought and danced very well. Some of his dance moves are really jaw-dropping and clapworthy. The action sequences are splendid and spectacular; each and every action sequence is wonderfully crafted and some camera angles during the fights are surprisingly awesome. The special effects are surprisingly amazing for its time. The music is very good, though background score can be a bit intrusive at times. All in all, Krrish is a great blend of musical numbers and good action sequences which makes it enjoyable to watch."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "brandon_lee420",
        "review_rating": "7",
        "review_title": "awful bollywood sucks a*s they are copycats",
        "review_detailed_main": "god this is the 1000th time they copied holly wood first the picture they copied from daredevil second copied it off paycheck this one has a machine that can look into the future so does paycheck third when krrish was saving the girl he was walking on the damn walls copied it of spider-man this movie is bull-sh*t it's goddamn boring i hate it so much i wish there was no stupid bollywood this is the first bollywood super hero movie made and its crap and so will be the second one and it will be awfuller than this one bollywood thought this was good but it fu*kin sh*t Hollywood is the best ever it's better than that cr*p bollywood if u think u would agree with me vote for me"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "boymusicalboy",
        "review_rating": "7",
        "review_title": "nice one",
        "review_detailed_main": "Definitely Indian Superhero . hritik worked amazing with special effects . almost touching Hollywood standard . dressing of hritik in rural area is very touching . hritik's face expression is perfect but his body language shows that he is a little bit conscious in front of camera . When he is in mask he did superb . I was excited when he ran behind the villain at the end of movie ,it was amazing sequence . Rakesh roshan really show his work in large scale . this movie will definitely make great records in Indian history . after so many years I went to Cinema hall for Indian movie , and I am satisfied . I am suggestin to all my friends to see this movie .Priyanka 's role was also good ."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "The_Mighty_Warrior",
        "review_rating": "10",
        "review_title": "A critique of the criticisms",
        "review_detailed_main": "I have been lurking on this section for some time now, with a few raised eyebrows at some of the comments that have been passed here. I think some are just wholly unjustified and inaccurate.\n\nI have seen Krrish twice now. It is an unabashed popcorn entertainer. You're typical Hollywood special effects summer blockbuster, only that it has a unique Indian soul and the quintessential Bollywood elements. It is an accomplished blend of Indian popular storytelling , western technology and Asian action and it's historic success in India, proves how successful this fusion is.\n\nSurprisingly, unlike most Hollywood film, where technology and action takes precedence, here special effects are minimally and virtuously(often seamlessly) used and most of the emphasis is on the emotional journey of the protagonist, who is reborn as the superhero, only towards the end, shifting to sci-fi action and concluding in a mesmerising ground-air-sea helicopter chase sequence, supported by an awesome and adrenaline-pumping background score.\n\nNow I am going to deal with the common issues made against Krissh:\n\n1. Action and special effects do not compare to Hollywood standards.\n\nYou really do need to define what Hollywood standards are. I have seen many big budget Hollywood special effects extravaganzas and the quality of special effects are variable; they range from good to bad; from shot to shot and from film to film.\n\nKrrish is nothing below \"Hollywood standards\" It has effects work that is on par or better than some Hollywood films, and less than some. What matters most, is do they work on their own terms, and given that masses of people, including international critics have appreciated them, means an emphatic yes.\n\n2. The techniques, effects and stunts are borrowed and/or plagiarised from Hollywood and Asian films; such as Crouching Tiger, House of flying daggers,Paycheck, Matrix.\n\nFirst of all, it would make sense that special effects techniques have been repeated from Hollywood, because the special effects supervisors - are from Hollywood.\n\nIt would make sense that the stunts and martial arts have been repeated from Asian films, because the stunt choreographer - is from Hong Kong.\n\nSecondly, techniques are invented to be reused. There is no need to reinvent the wheel.\n\nA filmmaker has at his utility an entire tool-kit of established techniques. It is how he uses them to actualise his vision that creates originality. In that respect, Rakesh Roshan is not a hack, because while he borrows techniques, he tailors them to his unique vision and lends them an originality of their own.\n\nThe stunts and action scenes have been designed according to Krrish's character and his own quirks, abilities and idiosyncrasies.\n\nIn particular, the final ground-air-sea helicopter chase sequence and the shot where Krrish uses the fountain jet to catapult him(awesome shot) into the air has never been done before. The anime-inspired fight sequence on the island is another spark of creativity. The initial sequence of him running to catch the glider is another very original sequence. Ditto for the Circus fire scene.\n\n3. Krrish is a mundane love story, comedy and drama for most of the film. Not enough superhero elements.\n\nWhen I watched Krrish the first time, I too echoed the same sentiments. I wanted to see more action scenes and superhero elements, not the usual run of the mill romantic comedy. I was disappointed. Then when I watched it the second time, this time without expecting a superhero film, I realised it's not suppose to be a superhero film; it is the beginning of a superhero\n\n4. Krrish is a hybrid of other superheros films and copies plot elements.\n\nSuperhero films are quite a predictable genre and share many similarities. They are the classic tale of good vs evil, where the hero is super-good and the villain is super-evil(often a megalomaniac with designs to take over the world) and the film builds to the final face-off, where good will invariably triumph. Superman follows the exactly the same story arc; so does Batman; so does Spiderman; and yes, so does Krrish.\n\nAnother similarity is that the superhero-ego will often be incognito and not reveal their true identity, except to a select few. You see this in Superman; Spiderman and Batman; so, you also see it in Krrish. Again, because the superhero is mysterious, they become the talk of the world and the the press become obsessed with them and in unveiling their identity. You see this in Superman; Spiderman and Batman; so you see it in Krrish.\n\nKrrish is as original and unoriginal as any superhero film. If you can accept that Superman is not a copy of Spiderman and Spiderman is not a copy of Batman. Then you should be able to accept that Krrish is not a copy of either of them and stands as an original work.\n\n5. Krrish is just the usual Bollywood potboiler, with songs and dances, comedy, melodrama and colours.\n\nSo are 99.9% of Bollywood films. This is the unique Bollywood identity and film-making heritage and make no mistake about it, Krrish is an all-out Bollywood film, made for mass consumption by Bollywood fans.\n\nKrrish is a very commendable and well-made film, an all out-entertainer, with plenty of cool action and special effects, but with it's heart in it's story of Krishna becoming Krrish(played admirably by Hrithik Roshan) It's also a historic milestone in Indian film-making, and will be to Indian cinema, what Superman was to American cinema. Expect the sequel to even bigger.\n\nAn impressive and world-class entry by Bollywood to the fantastic world of sci-fi and fantasy. I look forward to more such films from Bollywood. In fact, as I write , another Bollywood director is in the preproduction phase of a big budget futuristic sci-fi romance set in 2050 India, and not an ordinary love story, it's the love story between a robot and a human!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "pranavb83",
        "review_rating": "6",
        "review_title": "Pretty good, one of the best products in years!",
        "review_detailed_main": "Krrish draws parallel similarities to many Hollywood movies in terms of scenes and stunts; But The movie is well made and it stands out overall and seems to be paying \"Homage\" to these greats! One would have to be very negative in calling Krrish a rip-off/hackneyed, considering the core story is general showing the genesis of a hero and the destruction of evil. I'd say about 10% of the movie's screenplay has been copied from Hollywood movies such as The Matrix (some fight sequences), Shaolin Soccer (Some fight sequences, volleyball match), Batman Begins (Angry Krrish fighting thugs), Daredevil (Jumping at times), Spiderman (saving kids from burning circus and jumping through a truck with a container attached), Superman I (running past a bus with kids in), Kevin Costner's patented swimming from Waterworld and more importantly PAYCHECK (The lab, the equipment and the concept of seeing the future and trying to change it)!!! The end bit though made many people including me laugh (not meant to) when the computer (From The grandpa era) makes the same sounds used initially to contact the aliens. On the whole .. enough songs not to bore you and enough action and fantasy for your money's worth for the first time in years!!! The background music is on par with Hollywood big budget movies yet it falters when they show the villain .. The Roshans do a very good job overall, All the characters seem three Dee .. 6.5/10!\n\nKrishna Mehra's father was killed in a laboratory fire overseas (minutes after he was born) and his mother died as she could not bear her husband's death. Krishna at age 5 was discovered by his school's headmaster and his grandmother to be able to answer questions that usually search grade twelve 'science majors'. This becomes a problem for some reason for the grandmother and she and Krishna disappear from the eyes of people they know into the wilderness. The boy is so gifted, he has feet that can walk on water and air, he can outrun a horse (reminicent of Shadowfax from LOTR), he can climb mountains and trees faster than apes. The boy turns into a handsome man so innocent and untouched by the outside world that he seems too naive for his age. His only friends are birds, fishes, apes, some village kids, an idiot and all other creatures you can imagine (leave out the poor roaches!). One day he miraculously rescues an angel who fell from the sky onto tree tops because of a parachute accident (Priyanka Chopra), a series of funny incidents follow which include ghost stories and Priya's (Chopra) camp organizer Mr. Komal (Puneet Issar) recording a fever of 104 C. Soon everything is out in the open, Krishna is in Love with Ms. Priya (she isn't) and her holiday ends and she's back in Singapore. Since she and her friend Honey are late, Honey cover's their butt by convincing their boss of a story for their channel 'STAR' which will show the Indian Superboy (??)! Priya unwantingly cajoles Krishna to come to Singapore and ask her hand in Marriage from her mother else she'd be married off elsewhere. Krishna decides to go for it and has an argument with grandma as to why he can't leave? Grandma the wise explains \"Your father was gifted with special powers and was renowned worldwide for his intelligence. He died because of a lab fire caused in the presence of people who exploited his powers for the innocent boy he was. MAMA died in grief. I don't want to loose you too!\" However she gives in and tells him \"Go ... get her\"\n\nPost-Interval, Krishna is in Singapore and what follows is his glamorous and spectacular display of martial arts skills (he picks up by watching for a few seconds) to get some money for a disabled Asian girl's operation. Next he rescues (now wearing a mask not to reveal his identity as grandma said so!) people from a burning circus (again jaw dropping). \"Krrish\" (kid asks name .. 'Krish' comes out) is all over the news and reward is offered. Krishna's friend (asian girl's brother .. Chirs Lee) finds his true identity and is joyous for him. Krissh doesn't want the reward or fame and tells Chris to claim the reward by giving Chris his mask to have enough money to get his sister operated on (a small piece of the mask was extracted from the circus and would be used to match in order to present the S$25,000 award). Meanwhile, Dr. Aryan has almost completed his 20 year dream of building a machine that can see the future (project started by Krishna's father; this was the lab where destruction and death took place). Krish has to discover a truth about his father's past and rescue the world from this power-mongering megalomaniac."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "vincentcastle81",
        "review_rating": "3",
        "review_title": "Left a lot to be desired",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "DICK STEEL",
        "review_rating": "8",
        "review_title": "A Nutshell Review: Krrish",
        "review_detailed_main": "The very first Indian movie I saw in its entirety as a kid, was Annamalai, starring Superstar Rajnikanth. Since then I was intrigued by Indian cinema, but never found the patience nor the time to sit through the standard fare of at least 2.5-3hrs of pure spectacle. On and off I caught bits and pieces of movies shown on TV, and the last Bollywood movie I saw mid-way, was Shah Rukh Khan's Asoka, and that's it.\n\nKrrish is a sequel to the blockbuster Koi... Mil Gaya, also directed by Rakesh Roshan, but no worries if you haven't seen the first movie - you'll be brought up to speed in no time, and Krrish will also work if it stood alone. First off, it's a superhero movie combined with science fiction, so that was a plus point to have this movie reintroduce me to Bollywood once again. And it worked. With romance, action, and some comedy thrown into the mix, what can one ask for more for pure entertainment?\n\nThose not familiar with Bollywood movies might balk at the length of Krrish - almost 5 minutes shy of 3 hours, which is quite standard runtime fare (there is a clearly marked \"interval\" in the movie, but it was not utilized here). But I tell you that you won't feel its length, and will actually secretly hope that it continues some more. The first hour dwelled on the introduction of our hero Krishna (Hrithik Roshan), a man born with extraordinary powers, whose grandmother Sonia took upon herself to shield him from a world awaiting to exploit his talent, if discovered. It's like a visit to the Kent farm, except that the whole grandmother- son relationship looked more at home vis-a-vis Spiderman's Aunt May and Peter Parker.\n\nWhen Krishna meets Priya (the gorgeous Priyanka Chopra, Miss World 2000) by chance during her adventure holiday camp, and he becomes smitten with her, moving the movie towards a romance. She's the quintessential Singapore modern career girl, who puts career (or trying to salvage it) before love, and therein complicates matters of the heart when we get to the boy-momentarily-loses-girl bit. Plenty of drama in this area, though it doesn't dwell too long on it, increasing the pace for the action bits.\n\nThose eager to see Krrish, the superhero, will have to wait almost 2 hours before he makes an appearance in full costume. He's like Jet Li's cousin Black Mask with the black outfit and abilities, but with a better looking facial piece to disguise his identity. But with or without costume, we see Krishna's prowess through various stunt and fight choreography enhanced by wirework from one of Hong Kong's stunt masters, Chen Siu-Tung, especially in his \"qing gong\" abilities to glide effortlessly through the air like Chinese martial artists. There's also a showpiece for Hrithik to demonstrate the kung-fu skills picked up, and the fights, if compared with other Bollywood movies, have toned down its cheesy sound effects and credibility issues because of its premise (if a superhero punches you, you'll definitely fly what).\n\nAnd what's a Bollywood flick without song and dance? Yes, our hero sings and dances when romancing his love, from the mountains in India to the skyscrapers in Singapore, but he doesn't do so as his alter-ego Krrish (yup, just let the superhero stick to kicking serious rear). There are 5 beautiful songs in Krrish, and save for the one in the circus, the rest did not involve mass dancing by extras, which kept the focus purely on the leads. And the dance choreography was pretty amazing too, though I was surprised that Hrithik Roshan, given his muscular bulk, could dance so gracefully. Oh, did I mention Priyanka Chopra is gorgeous?\n\nWhile the romance and action bit were interesting, the science fiction bit was unfortunately found wanting. Not that it was bad, but because it was too familiar. Adapting the same plot as Philip K Dick's Paycheck, the sets, premise and plot device looked exactly the same as John Woo's Paycheck movie - we have the evil Dr Arya (Naseeruddin Shah) building a supercomputer which can look into the future, and therefore becoming God himself. The evil lair too looked like Woo's underground lair in M:I2, complete with pigeons (no doves in Singapore).\n\nFor those who want to know more about the local landmarks used - Singapore Expo was used quite a bit, since it's large enough to be filmed at different areas passing off as different venues, even doubling up as Changi Airport's arrival hall entrance with smart editing. The Esplanade was another choice location as the HQ of a conglomerate run by Dr Arya, with National Library's Pod doubling as the penthouse office. There are many scenes with glass windows, which will clue you in on the location of the current setting. Other notable locations are the condos at Kallang, Shenton Way / Raffles Place, Lau Pa Sat (widely publicized during the shoot here), the Singapore River and our offshore islands.\n\nKrrish reminded me that cinema is about the big spectacle, and I encourage anyone who's into song, dance, and especially those interested in seeing local landmarks make their way into movies, to give Krrish a shot. It made Singapore look sexy, and probably showed us a different angle in making an action movie here. While awaiting the arrival of Singer's Man of Steel, watch Krrish!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "santhosh-10290",
        "review_rating": "7",
        "review_title": "Krrish",
        "review_detailed_main": "Good movie. Hrithik Roshan and everybody acted very well in the movie. VFX in the movie was also very good The movie was entertaining but the movie was somewhat lagged at 2nd half. Songs and BGM were not so good in the movie. Fight scenes in the movie was very good. Good Movie."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "itskiwidude",
        "review_rating": "3",
        "review_title": "New Concept for a Bollywood movie",
        "review_detailed_main": "A new concept for an Indian film, thus kudos to Mr rohan for making such a brave effort. Of all the Indian superhero movies made so far, i would say this was perhaps the least worst. People say it is copied and what not (then again we've all come to expect that of most bollywood films), but the fact is that the movie lacked general direction and purpose, thus a lot of the scenes were a drag. In addition, the plot seemed to be non-existent, and the sub plot was very weak. a movie with very general ideas that requires viewers to turn a blind eye to various plot holes. for example, kirsh and his father, despite a whole generation gap, seemed to be living in the same time period. even though i tried my best to watch the whole movie, it got too mind-numbingly boring thus i had to walk out about two thirds of the way through. and off the 4 people i sat down to watch the movie with, only 1 managed to see the whole thing. i found out from them what happens in the end, and by the sounds of things, i am very glad i walked out and saved myself and hour. Overall, this movie robbed me of two hours of my life which i shall never get back. still 3 very generous points awarded for the effort."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "bluazur",
        "review_rating": "",
        "review_title": "Decent but thats all",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "sdar_skcor",
        "review_rating": "7",
        "review_title": "Krishna, who has extraordinary powers meets Priya, falls in love, obviously, goes to Singapore and is soon confronted by his strengths and his family's past.",
        "review_detailed_main": "I seriously think that we all should give the Roshans as well as Bollywood a break. Krrish is a really good movie and it is a vast step for Hindi cinema. Of course, if you've seen Hollywood action movies then you might not be able to sincerely enjoy the action shots of Krrish. Though they are definitely a very new and attracting thing to the crowds of people engrossed in Hindi movies, the action will seem slightly artificial to those who aren't. Still, the movie does bring out the acting talents of both Hrithik and Priyanka. The movie has a very fresh look to it and the colors, sceneries and costumes not only suite the story but also the characters.\n\nThis movie proves that the Roshans are willing to take risks and Hrithik beautifully brings about the critical points of the two different characters that he plays. They have evidently put in a whole lot of effort and they deserve to be applauded.\n\nIf you haven't seen Krrish then I suggest you go and do so but, remember to keep an open mind and an accepting attitude when and if you do go to see it. It is an enriching experience that makes you feel proud to be an Indian."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "smilesk",
        "review_rating": "6",
        "review_title": "Krrish is good but still...........",
        "review_detailed_main": "Well I seen the movie now.It is good but still not that good.\n\nI think some things work and many things not.Main thing is that we cannot see much more action that we expected and see lots of romance and drama that we did not.\n\nMain thing is that in first half story moves very slow and in second half very fast.Romance scenes between Hrithik and Priyanka did not work out and that is main problem. In second half story of Rohit, Krishna becomes Krrish and story between Priayanka and Krishna going together and it confuses sometimes.\n\nRakesh Roshan also did not gives more detail on character of Krrish and his powers.What powers he possess and what are weakness and also no details on character of Rohit and his wife.Why Rohit does not possess that powers which his son gets.\n\nWell there are some good points also in movie like twist of rohit is live and also how krishna becomes accidental hero in circus fire. Action is very less but it is good.\n\nHrithik is main actor in whole movie and he done superb job but Priyanka disappoints and therefore first half seems very slow.\n\nAll and all the movie which can be watched at least onetime and maximum only one time. It is good but we want more Krrish in Krrish than Krishna."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "runi_star",
        "review_rating": "7",
        "review_title": "I must say, for a change it's a refreshing Hindi film sequel!!!",
        "review_detailed_main": "Film: Krrish Cast: Rekha, Hrithik Roshan, Priyanka Chopra, Nasserudin Shah, Puneet Isaar Director: Rakesh Roshan\n\nWhen I saw Hrithik dancing like a kangaroo in the song Dekho Pawan bhi...Chori Chori, Chupke- Chupke...I made up my mind that 'I will not watch the film'. But sometimes second thoughts are handy. The second half of the story is fun to watch. The hype of the Indian superhero is worth all its claims!!\n\nHrithik is a treat to watch in the second half. But Priyanka Chopra? She doesn't fit into the category of sweet, innocent girl which she tries to be in the beginning. \"Just imagine\", bahadur, played by Hemant Pandey had good comic timing!!\n\nThe film starts off with Rohit junior i.e. Krishna showcasing his talent as a painter. Later, realization of the fact that Krishna is a whizkid after the IQ test. Rekha being a protective grandma, takes him away from the eyes of the cruel, selfish word.\n\nAlthough which part of the world they were staying, they kept it a hush - hush secret affair with the audience also!! Not fair, at least they could have told us!!\n\nKrishna grows up in the armor of nature. Birds and animals are his compatriots, no wonder he dances like kangaroo!! Good logic!! Transitions are wonderful, like the one where Krishna's tear turns out into the Dragon head, establishing Singapore. Amazing display of stunts, Superman, you better Return!!\n\nThere is a surprise element in the film, which shows that it has a better thought of screenplay!! Unlike other superheroes, here Krishna, Christianizes his own name Krrish!!!\n\n\"When it comes to Hrithik, Roshan senior is very demanding\", I thought of this line because the original choice of the actress was Aishwarya. Think people as where was this line used. Piyush Shah did an excellent job in the department of cinematography!! I must say, for a change it's a refreshing Hindi film sequel!!!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ahmadaYAZ100",
        "review_rating": "6",
        "review_title": "Indian Superman Soup",
        "review_detailed_main": "Krrish's script writer (or whoever conceptualized the character of Krrish) watched lots of super man and sci-fi foreign movies and turned Krrish, the hero and the movie a mixture of all. Sample these:\n\nKrrish dresses like Zorro (the mask, the leather overcoat in 30 degree hot Singapore). - Krrish runs in the air and jump across and over like Incredible Hulk. - Krrish can jump over/ across city landmarks like Spiderman (eg, when he sneaks into Dr Arya's lab.) - Krrish runs as fast as Dash Incredible of the Incredibles. (eg, where he avoids bullets from Dr Arya) - Krrish can fight like a Kung Fu warrior (when he fights Dr Arya's guards on an island) or like Jackie Chan (eg, when he fights motorcycle riders. (The lead, Hrithik trained for 1 month+ under the famous Tony Cheng of Hong Kong.) - Krrish can, of course, sing like an Indian hero. - Krrish's father Rohit builds a computer that can see future like Precogs of Minority Report. He works on intangible keyboards like in that movie. Rohit is kept in suspended animation by Dr Arya as the convicts in Minority Report. - Krrish's father Rohit can read like autistic Raymond in Rain Man (Rohit finishes Dr Arya's book in minutes.) - Krrish's father Rohit meets with a left-behind alien (as in ET, the Hollywood movie which stole the idea, some credibly claim, from India's Satyajit Ray.)\n\n\nCut the dance sequence, reduce the length to 90-120 minutes. The movie may be accepted by global audience and I would rate it 7/10.\n\nAs an aside, Singapore government invested in the movie which was half shot in Singapore. Krrish is/will be a case study for business schools (Indian Institute of Management-Indore, Hongkong University, Harvard Business School.)"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "eevaoberg",
        "review_rating": "8",
        "review_title": "Krrish, the first Indian film I have seen on cinema",
        "review_detailed_main": "I saw Krrish in Stockholm yesterday. I am not keen on science fiction movies, even if I used to read science fiction when I was young. I have never before seen an Indian movie on cinema and perhaps because it was the first time, I liked Krrish very much. Indian films are longer than Hollywood/European films, but it didn't feel long at all. Must have been entertaining! It did not matter at all that the film makers had borrowed ideas from other films(Flying Daggers, ET, Dr.Who, whatever). The film was very Indian and didn't feel like a copy of anything. I loved the music and dances, the dance in the circus was wonderful!\n\nThe actor who played Krrish felt quite right for the role. I have seen him in KKKB, but didn't think much about him then, was too fascinated by Sharukh. This is my first film critic ever! Becoming addicted to Indian films make me do strange things!!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "shivanis9",
        "review_rating": "7",
        "review_title": "India's first super hero delivers!",
        "review_detailed_main": "Well, Rakesh Roshan has done it again. Krrish was such and enjoyable film to see. The plot didn't drag on and it was believable. Hrithik Roshan is great in this film, performing and delivering. Priyanka chopra was alright, but i preferred Preity Zinta in Koi Mil Gaya. The songs were great and was pictured beautifully, especially in the first half in the mountains. The special effects were mind-blowing for an Indian film and the stunts were great! This film is good for children and adults alike. I really recommend this film to anyone. There was bits of the film which dragged on a bit, and really wasn't needed, but there were more good bits then bad. One bit i loved was the twist at the end.. but you'll have to watch the film to find out!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Vicky_baba",
        "review_rating": "3",
        "review_title": "super dud!!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "springsunnywinter",
        "review_rating": "10",
        "review_title": "Heartfelt Cinema",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "kammaz",
        "review_rating": "6",
        "review_title": "Watch it ... if only for the special effects!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Pankratz",
        "review_rating": "1",
        "review_title": "Utterly disappointed despite Hrithik's honest performance.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "long-ford",
        "review_rating": "",
        "review_title": "Good Hrithik and decent stunts but overlong with weak plot and a bad script",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "SumanShakya",
        "review_rating": "7",
        "review_title": "Rakesh Roshan's technical extravaganza.....",
        "review_detailed_main": "Two things common in Rakesh Roshan's movies: that it starts with the letter 'K\" and secondly, touches on something new for Hindi movies (although not in every movie). With \"Khoon Bhari Mang,\" he introduced the concept of cosmetic surgery, idea of extra terrestrials in Koi Mil Gaya and superhero theme in \"Krish\" , which is also a sequel to \"Koi Mil Gaya.\" Technically \"Krish\" supersedes \"Koi Mil Gaya\" in terms of production values, sets and overall the trick photography. Story-wise too the film gets interesting especially in the second half with much of the excitement. The first half is however a bit dragging missing the innocence of \"Koi Mil Gaya.\" Overall, the film is impressive in the technical aspects like photography and special effects which is seldom seen in Hindi movies which makes it Rakesh Roshan's best effort though it contains the ordinary clichés of Hindi Movies like the regular villains and improbabilities.\n\nRating: 3 stars out of 4"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "meltdownmonk",
        "review_rating": "6",
        "review_title": "Painful to watch, and yet it Blew My Mind!",
        "review_detailed_main": "OK, filled with the usually bollywood song and dance, and these didn't really stand out for me, totally skippable, though the Circus dance was somewhat bearable. Hrithik has a few fun moves in a couple of the other songs as well.\n\nI found while some points in the movie contained some very nice cinematography, and some flair in style with the occasional humorous bit (two brightly dressed Indian women (beautiful actresses as well) arguing in an elevator with the random average looking dude in-between them trying to follow what's going on... just priceless, couldn't help but laugh at that.\n\nThe costume change was innovative, and a improvement, and the whole hair thing seemed to work out, since, it totally could have been Krishna's buddy.\n\nI just found the beginning to be horribly weak, overacted (but that's normal) and over dramatized (also normal) Krishna still seemed a bit to childish, and i'm not sure if it's just Hritihiks acting, or a bad interpretation of the character.. why set him up smart, only to have him act like a little kid throughout the movie... (though there were points I could feel some brilliance coming through, sortuv...) It wasn't until perhaps the last half hour... suddenly everything started to blow my mind... like it got so crazy with effects and everything.... maybe the whole last half... but just the action bits, and the flashbacks... it just kinda worked, all the special effects were cheesy yet awesome, and it seemed to steal from just about every major super hero/action movie. X-men, Batman (pick one) Superman (again pick one) Matrix, also, Anime in general .... The jungle scene where he fights the island security was right out of Naturo, or ... any anime... the older the more sense it makes... with the blurry background, and random moves, and then the stop.... PERFECT! i nearly peed my pants it was so awesome... at that point you just can't take the rest of the movie seriously, because everything that happens, it just *awesome* all kinds of random special effects, and power display and illogical hostage situation... (seems like the bad guy's taunt him with things only Krishna would want... except... why would they do that unless they knew it was him? ) UGH The Lay's chips in multiple scenes was a nice touch.. or some kind of advertising deal... not sure which... also, the Black Eyed Peas poster in the office at work...\n\nI kept seeing plot holes, and perhaps this is all better for a thread... basically: The movie is too long, and boring up to the intermission, and even then, it's kinda bad, but it becomes a action/special effects fest at the end, and it's just too fun to miss... it's what i was waiting for, the entire movie... made me happier than when I saw the Main Hoon Na final fight scene (which is worth a see, it's just so ridiculously bad, it's awesomely good!) Thank you Rakesh Roshan for bringing something different into Bollywood, it may be a crappy movie, but it looks professional, and flashy, and it has just enough plot a nd action to make me happy."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "FilmFlaneur",
        "review_rating": "6",
        "review_title": "A Krrishtion of focus..",
        "review_detailed_main": "Krrish is an Indian superhero film which makes for interesting viewing in the light of such mixed Hollywood outings as Daredevil, Spiderman, X-Men etc. Hidden by his mother from the enemies of his late, genius father, hero Krishna has inherited enhanced superpowers granted to his dad by kindly aliens in the first installment of the saga. Swept off his feet by a visiting female journalist in his remote retreat, at length he reluctantly returns to Singapore only to discover that elements of the past tragedy may not be what they seem. Soon he is forced to don a mask to hide his real identity and battles against a technological conspiracy which has at its heart a personal imperative.\n\nOverlong and entertaining, Krrish has many of the merits and faults of Indian popular cinema, while still providing a novel experience for fans of the western superhero genre. Most interestingly, the Indian superhero has few of the neuroses and persecution complexes which mark out his western counterparts, never viewing his superhuman nature as a curse for instance. His special talents seem part of nature and not a dubious mutation of it. The first half of the film, consisting of a slow moving romance as Krrish, living with his overprotective auntie, discovers his heart and his destiny, has one or two decent moments but one longs for more outright drama. Notable scenes include the first meeting with his co star as he romances her, Tarzan-like, descending down a tree together in a prolonged arboreal embrace after a hang glider crash above. But these are meager highlights in what proves a slight and generally unmemorable opening act.\n\nThings pick up considerably however after the half time intermission as, once installed in Singapore, Krrish moves into a different gear entirely. In the film's best and most excitingly choreographed sequence, the hero first dons his improvised mask to rescue victims trapped inside a burning circus tent while later, in another impressive moment, he leapfrogs across boats on the river to reach his enemies. Most of the wire-work based stunts in the film are well done and some - such as the moment when he slides his motor cycle along a warehouse floor to unseat several other riders, are exciting and new. Krrish's super powers mainly consist of Dr Doolittle-like communication powers with animals, super strength and speed, but there is no denying that in the requisite black mask, with streaming hair and Matrix mac he looks very cool when required. Ultimately though it has to be admitted that the film is not a complete success; the central conceit of a computer that can 'foretell the future' for instance is a clumsy one and, while Krrish is a great action figure, the film itself seems uncertain on which elements of his character to concentrate on, which leads to some loss of focus. But a decent enough effort all the same."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "McCharlotte",
        "review_rating": "7",
        "review_title": "Remember, this is a bollywood film",
        "review_detailed_main": "I'll try to keep this short. This film is only good if you do not try to judge it too much. I've seen only a few Indian films and this one is definitely better than those that I've seen. It has funny moments and the action and special effects are a lot better than I expected from this type of film. The musicals are kind of annoying, but I guess, that comes with all bollywood films. Also, I did not know this was a sequel. So it was a surprise when the film takes this sudden weird twist. The best thing to say about this film, is that it is a mix of many different genres and this sometimes works and sometimes does not - but if you go in expecting a lot, you will not like it."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "bdschwantner",
        "review_rating": "8",
        "review_title": "Krishna Mehra (Hrithik Roshan) is an Indian country lad with super powers. He falls for a city girl (Priyanka Chopra) and goes to Singapore to win her heart. Awesome Ensues.",
        "review_detailed_main": "Krrish is a unique movie that combines many elements and genres. Reviewing this film is no easy task; reviewing it objectively is even harder. This is because Krrish breaks many of the expectations of a western moviegoer. It's action is unusual, its acting is often exaggerated, not to mention that its in a foreign language! Getting a good perspective on the film is hard when it doesn't look anything like the movie one was looking for. So, let me just get my bias out on the table early on in this review. I loved it! I haven't laughed that hard in any action movie ever. I haven't seen fights that good in any comedy ever. Nor have I ever seen music videos like those in any sci-fi super hero flick. I love the crazy place this movie has found in terms of genre. This film moves easily from pop music video to manga-style action to touching drama to thought provoking sci-fi. It's just great.\n\nHowever, the bizarre amount of slapstick comedy, product placement/general commercialism, and constant switching of genre may very well put some western viewers off. This movie is not your usual super hero flick. Batman this is not.\n\nIt is, however, an excellent movie that combines the core elements of the super hero genre with romance, comedy, and sci-fi, and does this quite effectively, thanks to the good dialogue, great choreography and effects, and great acting and dancing by Hrithik Roshan and Priyanka Chopra.\n\nI was thoroughly entertained and would recommend this film to just about anyone who is willing to suspend disbelief, sit back, and enjoy the show."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "anagpal",
        "review_rating": "7",
        "review_title": "Great first attempt, I hope the sequel is better",
        "review_detailed_main": "I think the movie deserves credit for a lot of elements like great action sequences (worthy of Matrix / Crouching Tiger Hidden Dragon etc) and also an inspired choice of Hrithik as a superhero...i don't think many other bollywood heroes could have carried it off...\n\nI think where it loses out is by having too complex a storyline, too dragged out in parts and by not giving its characters (other than Hrithik) any depth...\n\nthere are one or two funny sub plots (like the one with the ghost) but overall i think if they had polished the movie up, reduced the length and focused on the action / superhero element, it could have been a great movie. For more of this and other reviews, check out my blog (apurvbollywood) at blogspot."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "black_fairy2006",
        "review_rating": "2",
        "review_title": "krish is a awful movie",
        "review_detailed_main": "Rakesh did his best but he couldn't make it he need a lot of improvement. Story of this movie is good but if they used some technology then they would have make a spectacular film. \"krish\" is the second part of Hrithik's film \"Koi Mil Gia\" which got some good ideas and made good business. They got some idea from the English movie spider man but i did get it that spider man used the web to fly around the buildings but what did Hrithik use to fly and climb mountains like spider man. Krithik have done a good job in this movie. Rakesh should avoid from Plagiarism and should use some own new ideas to make a blockbuster film. But \"Krish is a good time pass movie."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "aasifali",
        "review_rating": "9",
        "review_title": "Finally a Superhero of our own",
        "review_detailed_main": "The wait's over, even though it took quite long.The movie is excels in acting and story. The story is refreshingly different and not abashedly picked up from any of the superheroes of Bollywood. Its in fact very good and innovative.One that is different and yet rooted to its base characters. Hrithik has one again excelled at everything from doing his own stunts to acting and dancing(forte). The direction is sleek and styled. For once i could relax, put down my critical enjoying view and abashedly enjoy whats supposed to be our own superhero with all the values and dignity. The movie has a good mixture of both humor and class"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ukb007",
        "review_rating": "7",
        "review_title": "Certain to be the first one in a string of sequels.",
        "review_detailed_main": "Nice movie. An unsuspecting watcher will catch his breath when he discovers that Rohit (Koi Mil Gaya) is dead, and this one's a story about his son. De-commissioning the successful hero of a film in the sequel takes a lot of courage.\n\nThe fight sequences are spectacular. I can't remember when last I saw such polish on the Indian screen. And the movie just craves for a sequel! I'd particularly draw your attention to the brief sequence where Krrish is standing with his father and watching a spaceship slowly arrive. Jadoo making a comeback? Will the next film have Jadoo cure Roshan Sr of his brain-trauma problem and possibly of his age too? These anticipations are delicious. No question about the fact that the first Indian Super-hero is born in the celluloid pages of Krrish Saga."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "a-laly",
        "review_rating": "4",
        "review_title": "I am completely disappointed",
        "review_detailed_main": "I was so eager to see the sequel to \"Koi Mil Gaya\" which in my opinion was not only a refreshing film, but had a great character written for Hrithik Roshan, and he DID deliver. But \"Krrish\" is so sappy and so one dimensional that even the most ardent fans of Hrithik, such as myself, found it difficult to sit through the overly sentimentalized movie. I wanted to wipe the perpetual smile off of his face and the almost infantile portrayal of the super hero was as flat as a day old chappati. The songs and dances will be forgotten as soon as you exit the theatre. And Priyanka Chopra is not someone who lights up the screen with her acting abilities. Nasiruddin Shah was having fun with his over the top villain role and not much else. The dialogue was so bland and cheesy and the stunts were from Matrix 101. That was the biggest disappoint. Hrithik just does not come off as a super hero and more's the pity. If there is a sequel to this, please Rakesh Roshan, hire a qualified script writer and give a better grip to the story with more shades of grey to the characters. I hope to see Hrithik soon in a better written film. He is a good actor wasted in substandard films. Maybe he should do a couple of films with Ram Gopal Verma to wipe out his goodtwoshoes image."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "nish_r",
        "review_rating": "",
        "review_title": "Plot Rips-off 'Paycheck'",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "siddiquaa-24728",
        "review_rating": "7",
        "review_title": "Good",
        "review_detailed_main": "It's Really interesting movie..full of entertainment.. Like them together"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "akbarnali",
        "review_rating": "7",
        "review_title": "Surprisingly Watchable",
        "review_detailed_main": "I'll be frank: when it comes to Rakesh Roshan's films, I have a bit of a prejudice, that prejudice being that I almost uniformly hate every film he's ever made. Barring a few scenes from \"Khoon Bhari Maang\" and \"Kishen Kanhaiya\" I find his films boorish beyond recompense. That said, I ventured to watch \"Krrish\" only to see how India's first comic book type super-hero would be presented. To my pleasant surprise, the film is remarkably watchable, due mainly to the 'fun and fantasy' element which Roshan Sr. gets right.\n\nPlotwise, the film is not much different from other superhero films, but then one doesn't watch these film for plot or character. Hrithik Roshan is quite good as Krishna/Krrish, though one wishes they had injected a bit more psychological depth into Krishna- he is a unilateral character who only seems to operate in \"nice\" mode. Naseeruddin Shah is expectedly satisfactory, as is Rekha who delivers most of the films moments of pathos. Priyanks Chopra is perhaps the least impressive of the lot. She isn't the 'typical heroine' here, but her delivery comes off as mechanical in several scenes. She needs to can the plaintive crying from here on out. Plus those attempts at imitating Juhi Chawla's cutie pie facial expressions don't gel well with her duplicitous persona. If they were going to cast her as a deceiver, they should have gone the whole hog and made her a last-minute redeemer.\n\nThe special effects are quite good and the technical team deserves full recognition for putting together a film that is visually awe-inspiring. The major flaw of the film are its songs, which are neither particularly memorable nor necessary to the film. But hey, even superheroes should get to sing and dance (and dance he does, extraordinarily in \"Dil Na Diya\")."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "arupghose",
        "review_rating": "6",
        "review_title": "India's first superhero is brilliant, but lack of real depth in the script is the real flaw",
        "review_detailed_main": "Finally a superhero of our own...Krrish has arrived! The anticipation for this film was immense, especially after the success of Koi Mil Gaya, but unfortunately for me it did not live up to the hype.\n\nRakesh Roshan is an excellent story teller - Khoon Bhari Mang, Karan Arjun, Koyla, Kaho Na Pyar Hai, Koi Mil Gaya but there's always a level of 'unrealistic' in his films! Krrish is not Rakesh's finest work - that mantle piece would certainly go to Koi Mil Gaya, but Krrish comes off nicely from here and makes you wait anxiously for the next version - Krrish 3!\n\nThe film is a little slow, and does not contain much of the superhero action as you expect once you watch the trailer.\n\nHrithik Roshan, as he was with Koi Mil Gaya, is the soul of Krrish and plays the role of both father and son with supreme ease! The simple truth is that his role as Rohit (an older version now) is far more demanding than his role as Krrishna (minus the stunts). Hrithik is fantastic in every scene, and his chemistry with Priyanka is pleasant. The way he slides into the role of Krrish so simply yet effectively shows that this actor is on top of his game.\n\nThis is far from Priyanka Chopra's best work, but then again the role doesn't require her to be at her best, but she comes across annoying at times (maybe that was required), but on the whole she does well. Naseeruddin Shah has always been a fantastic actor, but his role as Dr Arya doesn't quite come across that well. I know Rakesh wanted a more senior actor to play the villain role, but perhaps someone like Anupam Kher would have done a better job.\n\nThe music of the film is decent with my favourites being Koi Tumsa Nahin and Main Hoon Woh Aasman, but the background theme music by Salim-Sulaiman is fantastic and sets the tone well.\n\nOverall Krrish is slightly overrated, but once you watch Krrish 3, you realise why it's quite slow...it was simply a build up to the big show!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "rock831983",
        "review_rating": "6",
        "review_title": "Could have been much better",
        "review_detailed_main": "Krrish the most ambitious project by Rakesh Roshan may open doors for Superhero flicks in Bollywood. But whether the movie is worth hype.Definitely not. I am not in mood to write full fledge review so will write main points.\n\nRakesh Roshan tries to make this flick mix of 'Superhero' and 'Love Story' and thats where the muvy flatters I have to rethink the movie name while watching whether its name is 'Krrish-Love story of a Superhero' or 'Krrish' Cauz this muvy takes ur almost 2 hrs out of 3 hours in establishing Hrithik-Priyanka love story While the future vision idea was lift up from John Woo's 'Paycheck' but even that doesnot support this mediocre flick cauz that idea is only around for sometime in movie while most of the time movie wanders around Hrithik-Priyanka love story.\n\nNow the actions.There was nothing like never seen before for those who have seen 'Matrix' and 'Crouching Tiger, Hidden Dragon' But looking at budget and all i can say that was good attempt.\n\nSuperhero flicks needs more to be at point rather than every now n then going into emotional themes. This movie is made for the kids and will be liked mainly by the kids. And inspite of being E.T ripoff Koi Mil Gaya was much better product The biggest disappointment is Rakesh Roshan's direction who tries to mix mag things\n\nNow music.Music is big letdown as we know already.However if u have heard it few times before it will not hamper muvy progress However RR should take care of better music next time.\n\nActing-Inspite of being good footage Priyanka hardly leaves an impression.Sometimes she looks amazing,sometimes horrible And her friend not only looks horrible but she acts horrible too Hritik's friend whose name is perhaps Hemant Pandey is good Nasruddin Shah overacts and a villain who could have send a chill in blood makes a laughable material by his news act and all. The only actor who leaves most impression after Hrithik is offcourse Rekha.She makes you believe however short her role is written she can act gracefully.\n\nAnd,i will end on a positive rating due to two reasons.First cause of attempt of 'Superhero' flick which will open doors for more such flicks in bollywood cause of its commercial success.\n\nSecond and most strong point is Hrithik's sterling act.He is the heart and soul of the movie. And he is the only reason to watch this flick which is a forgettable and kiddish affair.\n\n3/5"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "jwhale9382",
        "review_rating": "8",
        "review_title": "Krrish and Bollywood Rock!",
        "review_detailed_main": "Krrish is the first movie from India that I've seen. I saw it on Youtube. I didn't have very high expectations, but after watching it, I was blown away.\n\nKrrish is a film about India's first superhero. It starts with a young man named Krishna, who lives in rural India with his grandmother. Krishna has several unique abilities, including super-strength, super-speed, enhanced intelligence and levitation. One day, Krishna meets and falls in love with a young woman named Priya. After she goes home to Singapore, Krishna follows and hopes to ask Priya to marry him. In Singapore, he finds reasons to uses his powers to help mankind, including fighting a mad scientist named Dr. Arya. He becomes Krrish, the icon of millions of people.\n\nKrrish is just an awesome movie. It has plenty of action, romance, humor and super-heroics. On top of all of that, I saw the movie as an up-close look at modern Indian culture. All in all, I thought this movie was great and Bollywood rocks.\n\nIf you love superhero movies you with love this movie.\n\nThe movie has since been removed from Youtube. I hope I can find it again."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "daywalkeri",
        "review_rating": "1",
        "review_title": "What A Crap ....",
        "review_detailed_main": "What this movie is in real; nothing but an effort to create an Indian superman... ridiculous to see media making such a hype of this crap story... the story is OK but acting has nothing to do with this movie.. Hrithik Roshan looks good as always but as far as performance and acting goes he is still a kid... a kid encouraged and crowned by the Indian media... but it doest makes any difference.. if you want to see some Hollywood stolen special effects (and that too in poor performance), some idiotic dialogues and childish acting by Hrithik Roshan and want to waste some hours and in the end scratch your head and shout.. then you can watch it..otherwise let the children watch it and dream about being krrish... Brithik has done a good job in Dhoom 2 (he was the only one to do a good job) and I think he must focus more on such movies than being a clown like Krrish... this ain't a superhit but it is all the hype and publicity ...which is bad for bollywood itself... from the view of critics... in the end... good movie for children to watch but if this one gets any award (best actor/story/movie), then I got ONE word for this crap ... FLUKE !!!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Sjhm",
        "review_rating": "8",
        "review_title": "Utterly charming, cute, sweet, funny and ultimately satisfying film",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "agrawalapoorv",
        "review_rating": "3",
        "review_title": "KRRISH ain't a Super-hero...He is a Super-zero",
        "review_detailed_main": "Well, this movie released 5 days before Superman Returns.If u see both the movies you will find a great difference.Krrish is a mixture of spider-man, He-man, Superman, Batman etc...This movie is for kids of 6-7 years.. If you see the movie named \"APARICHIT\" it is far better than Krrish but Krrish has a budget that is 15 times greater than \"APARICHIT\".They show any rubbish showing Krrish fly and it's all rubbish... But it doesn't look fake THANK GOD... This movie will succeed all because of its hype and its a sequel to \"Koi Mil Gaya\"\n\nKrrish is a loser, a boring movie and has no comparison with \"Koi Mil Gaya\"..Just avoid it..\n\nAPOORV AGRAWAL"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "rajeevno1",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "One of the best movies ever in the Indian cinema. Will definitely get many awards. Hrithik is simply the best. keep it up!!! This type of movie has never been produced in the Indian cinema and matches movies Hollywood style. I don't think there can be any other actors that can fit in hrithik role. It is a great and feel good movie both for children and adults who will enjoy it a lot. The songs are excellent especially \"Dil na diya'. This movie is so exciting that you cannot get bored although it is more than two and a half hours long. This movie is recommended for all ages and it should be watched by one and all because it is worth it!!! Thumps up for all parts of the movie"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "die_Heuchler",
        "review_rating": "1",
        "review_title": "ET meets Superman! How lame is that?",
        "review_detailed_main": "This is perhaps the worst superhero movie I've ever seen. What the Roshans have done is simply spent a week watching all the Hollywood superhero movies and spiced it up as 'Desi.'? And who ever on earth told them that Priyanka Chopra fitted the role? No man, don't even think about making the third part for this film. And what's up with the script, character artists and everything? Mr. Rakesh Roshan must take few lessons on writing a powerful screenplay and get rid of lame language. The big problem with the thing is that the Roshans have managed to make a 2006 movie with recipe, that worked only 11 years ago. They've failed to realize they're not making Karan Arjun. (http://imdb.com/title/tt0113526/) Well Roshans, hope to see an original movie next time around!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "laddhu",
        "review_rating": "10",
        "review_title": "Krrish - What a great movie!!!",
        "review_detailed_main": "This was a fantastic film! Hrithik Rosham delivers yet again! It has everything. Action, Suspense, Drama and Comedy also, without scrimping on the storyline.\n\nMaking a sequel to Koi Mil Gaya wasn't an easy job to do but Krrish delivered in every way possible. Special effects were great and extremely well done. If you haven't seen a bollywood film before, this is an excellent one to start with. You don't necessarily have to have seen Koi Mil Gaya to understand and appreciate Krrish but it does help with some things.\n\nThe cinema I saw this in was packed full and everyone in the audience loved it, so much so they were cheering for the good guys and booing at the villains and giving huge applause at the end. I thought it was fantastic! Don't miss out! A big thumbs up from me :)"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "exinator",
        "review_rating": "4",
        "review_title": "Krrish- The Indian Kukuboy",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "the_mantra_man",
        "review_rating": "10",
        "review_title": "KRRISH - Kool RRiveting Indian Super Hero - Brilliant !",
        "review_detailed_main": "Shorter version : Don't Miss It !!\n\nLonger version (No Spoilers !!) :\n\nRakesh Roshan may become the biggest showman India has produced in Hindi, for he definitely knows his filmKRAFT. Producing a good quality product and probably the first mega-hit SEQUEL with a steady increasing pace, that goes from 0-500mph by the time the movie is over requires planning, control and execution. RR delivers big time.\n\nHrithik takes RR's vision and makes it even better by performing at the highest level. If we are talking about a SuperStar phenomenon after the Big B, with a combination of Personality, Built, Charisma and Consistency, IMHO Hrithik will be IT in the years to come. The improvements needed would be a little more aggressiveness in angry roles.\n\nKRRISH does begin where Koi Mil Gaya ended...and as the movie progresses does seal itself as a true sequel. When you walk out in the end, you feel justice is served to KMG.\n\nThe humor in the first half, the sequence of events, the songs (which are part of the movie, rather than being stuffed into the movie) \"Chori chori...\", \"Aao Suanoon Pyar ki..\" and \"Dil Na Diya..\" (what an amazing dance number by HK in the 2nd half) are refreshing. Action scenes do have the signature of HongKong Martial arts master Siu-Tung Ching, a little less in the 1st half and it takes quite a bit to introduce the character Krrish, which comes into existence only 15-20mins after the interval. The action is increasingly more than you can imagine in the 2nd half. The special effects are first rate.\n\nN.Shah is just amazing as Dr. Arya and it would have been nice to see more of him but would have made it unnecessary. If Rekha and Hrithik deliver the most emotional performances throughout the film, Hemant Pandey, Puneet Issar, Priyanka & friends provide the comic relief in the first half. Sharat Saxena is menacing with his looks. APSingh is the perfect B****yBoss and the Chinese guy Gin Xia for his brief stunts\n\nOverall - Great Entertainer and yes I'd like a sequel to Krrish :-)\n\nSome Dings at KRRISH - The first child actor who plays Krishna is quite irritating (thanks to only a 5 min role), Introduciton of the character Krrish could've been a bit sooner in the film, The films length (the last song could've been cut even if it gets under your skin over time due to its softness and awesome picturization)."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "hombregol12",
        "review_rating": "3",
        "review_title": "wow",
        "review_detailed_main": "i have seen some real trash in my life but this has got to take the cake here. Virtually no storyline to speak of, actors who act like they're acting, improbable and completely illogical premise... even for a Bollywood movie.\n\nnever mind that there are severe continuity issues involved here, throughout the film i failed to understand just the extent or nature of \"Krrish\"s superpowers. one minute he's running with a horse and by the end of the movie he's a combination between NEO and Flash where he's literally dodging bullets.\n\napologetics of Indian cinema want to point out the budget involved. first of all... crouching tiger hidden dragon had a budget of $15... roughly the same vicinity considering the Roshans didn't fork out that extra cash since this is a father/son venture (dad did the music as well). house of flying daggers, another masterpiece from the Chinese, is also cost around $10 million. in both cases the special effects as well as acting and the general ambiance of the movie are ABOVE and BEYOND krrish, the producers of whom seem to content in ripping off 6/7 year old movies like matrix or crouching tiger. cheap shows on the sci-fi channels are more thrilling to the eye.\n\nbut the special effects are not why i gave it such a low rating. for starters, Priyanka Chopra should quit movies altogether. she's a model and thats apparent. damn we miss the likes of Madhuri Dixit who were real actresses at the very least even if they didn't have the 34-24-36 figure. Hritik Roshan shows why his ilk, all the sons of former bollywood superstars, are no match for the khans. i hope all that waxing and steroids have paid off. personally though id prefer a Bachchan in a superhero role because at least they look nominally Indian. Naseeruddin shah is completely out of place. Rekha's talents are also wasted.\n\noverall, i hope u guys don't fork out the $10 per ticket we have to here in America to watch this garbage."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Sherazade",
        "review_rating": "10",
        "review_title": "Finally, a superhero I can relate to...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "qi_lau",
        "review_rating": "5",
        "review_title": "Hrithik saved the movie.",
        "review_detailed_main": "Krrish is the first Bollywood movie I've ever seen in my life. After seeing this movie, I was amazed, but somehow I felt it was lackluster.\n\nWhy lackluster? Read on.\n\n1. Priyanka Chopra has no relevance in the story. Though she was the reason why Krishna became Krrish, Priyanka's acting is kinda useless. Her acting just made things worse.\n\n2. The villain is so weak. I thought this movie would be cool because Krrish is now a hero, but the villain is a weakling!\n\n3. The songs are annoying. Namely the \"Dil Na Diya\", it annoys me a lot.\n\nGood thing the film was saved by Hrithik Roshan. I personally think that Hrithik Roshan is one of the few actors in the universe that can make garbage look awesome."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ijzeren_jan",
        "review_rating": "8",
        "review_title": "If you like superheroes, than this one is a must!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Angelus2",
        "review_rating": "3",
        "review_title": "Trailer looked very good...But the film was crap.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ringslady1987-1",
        "review_rating": "9",
        "review_title": "Give the Krrish team a break!",
        "review_detailed_main": "I'm not a bollywood fan or a Hrithik fan but I thought Krrish was a sincere effort. The Roshans go all out to set a trend/make a new genre by borrowing/copying/stealing from Hollywood but they did not ruin the experience for me. In fact, they did quite the opposite; I cherished the film. Bollywood rarely has sequels; the Roshans set the record in Bollywood by making the first Bollywoood sequel to their film, Koi...Mil Gaya, which happens to be the first sci-fi Bollywood film. They follow it up with the first Bollywood superhero flick shot for the first time, if I'm not wrong,in the foreign land of Singapore. Altogther, the father-son duo have set 4 records in Bollywood: the first idea of a sequel, the first sci-fi Bollywood film, the first Bollywood superhero flick and the first-time Bollywood shoot in Singapore, courtesy of the Singapore Tourism Board.\n\nHrithik is undoubted the star of the film, he steals from the very blend Priyanka Chopra but villain Naseerudin Shah and Veteran Rekha hold their own territories. Hrithik has a great body but I wish he will stop smiling too much throughout the film as he does not exactly have the best smile in Bollywood.\n\nBesides heroine Priyanka, the music, of which only 'Ek Ladki' and the theme music stand out, is a buss.\n\nFor those criticizing fellow Indians out there who lash out at the film 'inoriginality' and the 'imitation of Hollywood', they ought to be proud that India can at least churn out a special effects galore with believable superhero and an original Indian-type sentimental background story, ignoring the superhero stuff."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "kooleshwar",
        "review_rating": "4",
        "review_title": "Best piece of crap I have ever seen.",
        "review_detailed_main": "First things first I do try to be as objective as possible while reviewing a movies especially movies like Krrish as they draw the maximum opinions most of which on the opposite ends of the spectrum.\n\nI HAVE ATTEMPTED TO SEE THIS MOVIES FRMM MY OWN EYES AND THE EYES OF THE TARGET AUDIENCE (THE CHILDREN AND PEOPLE WHO SIT IN STALL AND THOSE WHO SEE MOVIES IN SMALL CITIES AND WHISTLE WHEN HRITIK ENTERS THE FILM OR DOES A STUNT ETC).\n\nThe opposing opinions first\n\nMY OPINION\n\nHritik is a bloody bad actor he range of facial expressions is limited to the smiling face and the puckered modeling face. He is loud and garish and all his movements are overstated and exaggerated. He loves the camera and every shot looks like it has been framed for a modeling assignment. Not to mention that IN NEARLY EVERY SCENE THE WIND IS BLOWING INTO HIS WILD MANLY LOCKS GIVING ME THE FEELING THAT HE IS A PROSTITUTE AND THE MOVIE AND THE DIRECTORS ARE HIS PIMPS SHOWING HIM OFF THE WORLD. His presence on screen is overbearing and unpleasant in many sequences. Add to that he takes every opportunity to break into dance using exaggerated movements and dances too expressively as if he were a choreographer and not a star. I Don't KNOW WHAT PEOPLE ARE THINKING WHEN THEY SAY HE IS A GOOD ACTOR EVEN YOU AND I CAN ACT LIKE A SPASTIC ESPECIALLY BECAUSE SPASTICS BEHAVE IN MANY WAYS AND ALL YOU DO IS TO BEHAVE WEIRDLY AND BAM YOU ARE A SPASTIC, TO ACT AND SPEAK AS NORMAL PEOLE DO IS THE REAL CHALLENGE.\n\nTheir TAKE\n\nWe love Hritik and we don't care if he can't act he looks great and the more we see of him to the better. He looks cool with his black coat and his black mask and as long as he continues to look good we will continue to worship him. Not to mention cheer every time he gives another one of his classy poses.\n\nMY OPINION\n\nThe COMPUTER ANIMATION IS THE BEST IN Indian CINEMA but its overused and you get the feeling that a child has been handled a new toy and he wants to carry it around wherever he goes. So we have totally unnecessary instances of the graphics being used specially in a long chase sequence, a couple of songs, and motorbike fight scene. HOWEVER EVEN THE BEST IN Indian CINEMA HARDLY COMPARES TO A B GRADE Hollywood FLICK.\n\nTheir TAKE\n\nDid that guy just kick a bike that went and rammed into 3 4 other bikes, hell we love it. Did you see we had one Hritik dancing and now we have another one dancing on the building. That's 2 Hritiks side by side. We totally love this movie. We haven't seen graphics of this quality ever in a Hindi film and the more we get the better. I'm so excited let me whistle.\n\nPoints where we agree....\n\nOUR OPINION\n\nThe songs in the first half were fine (though not good and definitely not even as good as KMG) but the ones in the second half were irritating just when we see the action has started and we finally begin to see some fast movement in the plot and some good action and romantic sequences, suddenly we have to see our superhero dancing around like a stray rubber band to ordinary lacklustre songs. Why are scenes even involving Hritik talking have 50% of the screen having Singapore sprawling scenery.\n\nOUR OPINION\n\nSome scenes were really good such as the airport robbery scene, the show fighting scene, the initial comic scenes.\n\nI will deny this later but the romantic scenes were expertly handled, I've never been in love but I guess any village boy who is shown love by a city hottie will act in a similar way to Krissh. Also I got acquainted to girls very late in life (18), the awkwardness and excitement one feels when one makes his first friend who is a girl is something I can identify with (thanks J and Shilpa ).\n\nWE LOVE NASEERUDIN\n\nHis comic intercepts and menacing tone were perfect for the film and this is one villain who will stand out in for a long time. For me he was clearly the best thing in the movie.\n\nFINE BY ME BUT BAD FOR THEM\n\nWHAT WITH THE F@#$ING English WHY THE HELL MUST ALL THE CREDITS BE IN English 95% OF THE PEOPLE IN THE THEATER CANNOT READ ENGISH AND 90 % CANNOT UNDERSTAND IT. WE HAD WORLDS LIKE ASTRONOMY, FUTURE, ISLAND, At least 25 DIFFERENT English WORDS. In the beginning of the movie Hritik breaks into an English monologue to show of the priyanka WHY THE F^%# CANT WE HAVE Hindi SUBTITLES my friend asked me what it meant. I could see the dazed look on the audiences faces Also I had a guy ask me what is the meaning of future, isn't bhavishya an understandable word.\n\nMust stop............review already to long must summon powers .........yes I've stopped more comments...on to the summary.\n\nMay not have been a great movie for me but who cares besides me. THE AUDIENCE IN BHAVANGAR LOVED IT.\n\nANY MOVIE THAT PLEASES IT TARGET AUDIENCE IS A GREAT FILM.\n\nWatch it if you love Hritik or if you share the tastes of the small city moviegoer.\n\n+'s a few good scenes including romantic ones, best graphics in Indian cinema, Priyanka Chopra, Naseeruddin Shah.\n\n+/-'s overdone, overbearing Hritik, overused graphics, inspired even original parts not exciting.\n\n-'s to much English including credits (more abusing), bad acting by the rest of the crew even Rekha looked straight out of a 70s film, ordinary songs especially in the second half.\n\nTotal 3.5/10 for me 10/10 for the public"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "bethgamburd",
        "review_rating": "8",
        "review_title": "Indian superhero",
        "review_detailed_main": "I love Bollywood movie, especially Hrithik Roshan and finally, Bollywood gets around to making an excellent superhero movie and one that they didn't borrow the idea from (that i know of ). Hrithik Roshan does some excellent stunts ala Crouching Tiger and some excellent dance moves ala Hrithik Roshan. The plot is good and the evil bad guy is good. the plot had an unexpected twist that added to the movie. The girls, however, were definitely Bollywood \"blondes\"...they really didn't have to be that gorgeous and THAT stupid, did they? the first part of the movie really had some fun to it and was lighthearted and had wonderful scenery. the second part was also great, but didn't show enough of Singapore. this was all in all, a great sequel to Koi Mil Gaya."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "partho-choudhury",
        "review_rating": "5",
        "review_title": "some plagiarism, some copies, some coincidences, all in all a good show",
        "review_detailed_main": "Part conceptualization from ET (as much as RR may deny) + part characterization from Forrest Gump (thats urban legend) + Emotional plot from Superman (surprisingly both have dollops of the same father-son bonding stuff, though, to RR's credit, this could not be a copy) + Costumes from Batman and Wonder woman (obv) + Technology plot from Paycheck and Minority Report (complete plagiarism, right down to look and feel) + Soundtrack from Gladiator (also complete but clever plagiarism) = Krrish.... All in all, a good show!!!\n\nSomething has to be a standard, and since Hollywood has consistently proved to be superior in almost all aspects of film making (as accepted by even Indian masters), this film has good story telling credentials, appropriate acting levels, pretty good sci-fi shots and reasonable entertainment value."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "imdb-ikysmoviedatabase",
        "review_rating": "8",
        "review_title": "It was big at the time of its release",
        "review_detailed_main": "This movie was huge the year it released. I think it was the first Bollywood super hero movie. I remember I really did enjoy the film back then. Now as krish franchise continues it looks as if the film makers are targeting the younger audience more meaning the kids. Even though the box office numbers are great but the quality of the films is dropping. Well we will see what the new krish brings us in future."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "gpdd5",
        "review_rating": "5",
        "review_title": "Disappointing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "TharsheyN",
        "review_rating": "10",
        "review_title": "A Brilliant Film & A Perfect Sequel!",
        "review_detailed_main": "Krrish is the sequel to the 2003 Bollywood sci-fi film Koi Mil Gaya. If you didn't know that well now you do so go watch it to understand everything from this film, thou even without watching it you shouldn't be very lost to be honest.\n\nKrrish like it's predecessor has an amazing cast with the addition of Priyanka Chopra as Krrish's love interest. Hritik Roshan once again does a superb job portraying both Rohit and Rohit's son Krrish. Priyanka does a similarly good job at her character Priya. Priya is nothing like Nisha as while being very beautiful(it's Priyanka Chopra/Mrs World after all) she is rather easily influenced by her friend Honey, to use Krrish's feelings for her in order to drag him to Singapore to act in their television series and save their careers at the same time. While that sounds horrible it does get better as Priya slowly starts to fall for Krrish, she eventually realizes this and tells Honey that she now has real legitimate feelings for Krrish. Unfortunately Krrish has already walked off after hearing the first bit of the conversation where they mention having used his feelings for her to rescue their jobs. Don't worry though as Priya ends up fixing up the mistakes she made and everything turns out good in the end. All in all each actor did a splendid job playing their respective characters!\n\nNow for storyline, the storyline continues from where Koi Mil Gaya's ends but a couple years later (the in between time is covered at the start of the film by the narrator) after Nisha(Preity Zinta) has unfortunately passed away to due heartbreak at believing her husband Rohit lost. Rohit's mother Sonia Mehra(Rekha) is left raising Rohit's and Nisha's son Krrish. Unlike his father Krrish is born very smart and capable of incredible physical feats due to Jadoo's powers being passed down from Rohit to him. Sonia try's to hide him away from the world but it only works for so long... let me not say anymore before I spoil it but all in all a brilliantly continued storyline that will captivate the watcher and leave them wanting more. (A lot of reviewers have said there is not enough action/superhero scenes but remember this film is more a start of his superhero character/an origin story, plus a romance.)\n\nNow onto the special effects, they were perfect for the film and fit the style of the movie as well as the characters without overdoing it and making the film just a bunch of flashy special effects one after another. The way Rajesh Roshan has done it is perfectly suited to the movie and film series.\n\nFinally to the music and dance scenes, it wouldn't be a Bollywood film without these. But while many Bollywood movies have songs that aren't so great or scenes that add nothing to the film, Krrish's dance scenes are all amazingly choreographed and continue the telling of the story and the characters. The songs themselves are all really great and afterwards had me rewinding just to replay and listen to some of the songs again!\n\nTo wrap things off, this is a really well done film with an amazing cast, special effects, songs and dances and accomplishes everything it set out to accomplish.\n\nA well earned 10/10 from me!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "jagdevs-1",
        "review_rating": "5",
        "review_title": "Superboy enters the Matrix....",
        "review_detailed_main": "Introduction - Hritik and Rehkha once again. Living in some remote village away from public eyes. Hritik discovers his super powers and is soon leaping of horses and swinging of trees like some sort of modern day tarzan. He meets pryianka who is with a whole load of annoying college kids on some sort of camping trip and you are left with a boy meets girl inclusive of silly pranks type story. And its not until mosty of the film has passed that you get to see some serious action. Enter the villain of the story. and a whole Matrix style plot evolves. Pryanka's acting is average and annoying at times. Hritik is fairly OK and Rekha is the only one that really shines out. Nasserudin's villain is a bit too comical at times and could have been done better no where near the frightening mogambo of Mr India (played by the great Amrish Puri) All in all not bad but nothing to shout about average sequel."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "niravbhavsar-20645",
        "review_rating": "10",
        "review_title": "why too less rating? this is fabulous",
        "review_detailed_main": "Why only 6.2 ratings? i think most user gave rating from 2006, as per history of bollywood, krish is best sci-fi or superhero movie , everything was pitch perfact , perfact story, action , screenplay, music . even in till today 2020 we would like to watch krish if its come on TV."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "magutosh",
        "review_rating": "5",
        "review_title": "It is so bad that it's good",
        "review_detailed_main": "I've not seen an Indian film since Mr. India when I was a child, this one certainly brought back some good memories.\n\nI have to say I thoroughly enjoyed this average-Indian-length-but-ridiculously-long film. However, judging from filmmaker point of view, it is so bad that I even don't know where to begin.\n\nApart from wonderful music and bollywood-trademark-dance scenes, the film is made out of artistic-wannabe-but-surreal-dialogues, pieces-of-badly-executed-Hollywood-lookalike-actions, some shots were lit in a way that looks like it was superimposed, or maybe they were, plus over-the-top camera angle movements. Some parts were so corny that gave me goosebumps. Having said that, the lead actors have performed a wonderful job, as always.\n\nThe funny thing is, when you mix all those bad elements together and blend in the Indian way, it became great entertainment.\n\nWill I watch it again? Absolutely not; will I watch another Indian film given the opportunity? Definitely!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "arjunflamingfeather",
        "review_rating": "10",
        "review_title": "KRRISH",
        "review_detailed_main": "KRRISH the excellent movie with magic in it's hinds."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "paramantaal",
        "review_rating": "",
        "review_title": "Same as other bollywood films",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "shawkeer",
        "review_rating": "3",
        "review_title": "Don't Waste you time - overrated!",
        "review_detailed_main": "The one advantage that a sequel has over any other film is that it needs no build-up to set the stage nor does it need to introduce the lead players; it can straightaway get into the meat of the story and catapult the viewer into the heart of the action. However, this one advantage has not been put to use by the makers of Krrish. Though a sequel to Koi Mil Gaya, it tries to begin a new on several fronts and the lame screenplay never really gets off the ground, except towards the last 15-20 minutes of the film, and by then it's too late.\n\nWhat Koi Mil Gaya was to ET meets Close Encounters of the Third Kind, Krrish is to Superman meets Spiderman (with some Matrix action thrown in). But Koi Mil Gaya was an extremely well crafted entertainer with a crackerjack screenplay and deft direction by Rakesh Roshan, breaking the conventional hero mould and establishing that a great performance which is not necessarily heroic in true Indian tradition (but has heroism written all over in terms of originality and clever inspiration from other successful works) is bound to work. Krrish is not what one would expect from the same maker. It's not even a patch on the prequel, and wastes away valuable screen time establishing itself and its eponymous hero. Yes, this is a superhero film, and yes, some action sequences have a Matrix hangover and the special effects are worthy, well executed by any set world standard, but it's the writing which is very poor and lets the entire film down.\n\nKrrish does not match up to the prequel nor does it live up to the huge hype which has been created."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "jaxhasu",
        "review_rating": "10",
        "review_title": "Krrish",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "rutvig",
        "review_rating": "5",
        "review_title": "Close, but no cigar!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "evergreenoldboys",
        "review_rating": "10",
        "review_title": "Krrish is Jadoo!",
        "review_detailed_main": "Do you hate Bollywood films? If so, let me first say this: You're going to hate Krrish. That may sound like a no-duh-ism, but I think some of you may go thinking, \" Well, this is really a super-hero movie with some songs in it.\". Sorry. It's not quite like that. The music in Krrish is its very skeleton and if you just don't dig that kind of thing, the meat hanging off of it is just not going to be enough for you. Maybe you should just go see Superman Returns...but I thought it sucked, so don't come asking me for a refund. Besides, if Peter Parker started singing and dancing you'd hate Spiderman too...\n\nDo you love Bollywood films? Then I think Krrish just might be your kind of movie. It has truly great songs by Rajesh Roshan; some of the best Bollywood songs ever. Amazing singing and dancing in creative musical sequences with fabulous cinematography and great sprinkles of special effects magic. Krrish is packed to the brim with all of the flowers, romance and warm fuzzy feelings that accompany the greatest Indian films. If you like Koi Mil Gaya you must see this. Its a great follow up and there's some amazing surprises and twists waiting for you...\n\nHave you never seen a Bollywood film? or have you seen Bollywood films and were not so sure about them? Go see this movie. You've never seen a Bollywood film? WIth all this talk of flowers and dancing would you be surprised if I told you Krrish is a super-hero movie with a very serious tone and some shockingly dark twists? It is. The juxtaposition of the sweet video-like song sequences with the frenetic wire-fu leaping and bum-kicking of the action sequences is really quite entertaining. You've seen Bollywood films but were not too sure how to feel about them? Krrish is wonderfully Indian, but more accessible to western audiences than some Bollywood films. While it is 3 1/2 hours long it moves at a brisk pace. The music and action sequences are perfectly placed within the film to create a whooshing flow. The fight scenes are really brilliant and considering Superman Returns had zero fight scenes Krrish is the place you will want to go for some bone jarring, villain juggling, super powered fists of fury this summer!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Mr. Bug",
        "review_rating": "",
        "review_title": "Good sfx for Bollywood",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "meenotigoswami",
        "review_rating": "4",
        "review_title": "Not good as KMG and Krrish 3",
        "review_detailed_main": "The movie is not upto the mark.Its nowhere be near to KMG and Krrish 3.CGI level and fight scenes are very less than the other two movies in the franchise.I had a huge expectation from this movie but it didn't live up to it.Songs are good though.\n\nOverall if you have watched KMH and Krrish 3 and liked it then Krrish will surely will disappoint you.Thumbs down."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "info-2513",
        "review_rating": "9",
        "review_title": "A runaway hit in India",
        "review_detailed_main": "A runaway hit in India, where its homegrown title superhero \"Krrish\" will likely out-gross the much-touted \"Superman Returns\" import, Rakesh Roshan's sequel to his madly successful sci-fi extravaganza \"Koi ... mil gaya\" pilfers \"ideas\" from multiple Hollywood comicbook sagas with beaming insouciance. Not content to walk on water, swing through forests at supersonic speed, and demolish a cricket field with a single ball, Krishna (reigning heartthrob Hrithik Roshan) also sings and dances divinely as romance decidedly trumps deeds of derring-do for most of the pic's 172 minutes. Enjoyable, daffily improbable escapist romp further expands Bollywood's pop genre repertoire.\n\nFearing the discovery and exploitation of her very \"special\" young grandson Krishna, Sonia (Rekha) whisks the boy off to the hinterlands. There, the plump little geek develops into a gorgeous hunk who communes with animals and smiles contentedly at all creation. When a beautiful career woman named Priya (Priyanka Chopra) drops, Jane-like, into his life via a parachute, Krishna disappears into the trees to play childish tricks on her and her friends, occasioning numerous duets as the couple frolics through the jungle.\n\nBut Priya works for a media company, and, when her job is threatened, she lures Krishna to Singapore, ostensibly to meet her mother but in reality to peddle her newfound \"superboy\" discovery. Before he goes, however, Sonia tells Krishna that his father was betrayed by an evil scientist, triggering flashbacks to \"Koi ... mil gaya\" and to Krishna's dad, who looks exactly like him (not too surprisingly, since Hrithik played his progenitor in the previous film).\n\nKrishna promises his grandmother that he'll hide his extraordinary lights under a bushel. Not until more than half-way through the film does Krishna's alter-ego, Krrish, finally materialize, his zigzag half-mask and shiny black coat disguising him even less effectively than Clark Kent's dorky homburg and glasses. After a big musical number, a three-ring Bombay circus showstopper, Krrish appears on cue to save children trapped in a burning tent -- performing a death-defying rescue that may be the only thing that could top the just-wrapped song.\n\nThesping is engaging, aside from Miss World 2000 Chopra's vapid posing (though, to be fair, it is hard to maintain any tonal continuity while changing costumes more frequently than one changes expressions). Rekha brings depth to her role as the nurturing grandmother, and Naseeruddin Shah, as the power-mad corporate scientist Dr. Arya, has great fun chewing up the futuristic scenery."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "sandhirflora",
        "review_rating": "5",
        "review_title": "Do we really need an Indian superhero?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "rohonnag",
        "review_rating": "10",
        "review_title": "This summer, the son rises!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "sredd-2",
        "review_rating": "",
        "review_title": "Krrish flying head to head with Superman",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "AnonymousbutDilpreet002",
        "review_rating": "3",
        "review_title": "Silly romantic flick",
        "review_detailed_main": "Okay, this one was promoted as first major hindi superhero film. But it turned out to be a usual Bollywood romantic comedy.\n\nThe film has no major plot in the first one hour. Krrishna lives in lonely hills with his dadi. He falls in love with a tourist girl, Priya. After some 40 minutes of time waste, she goes back to her place(Singapore). She calls him and asks him to come there. After a heated argument, he convinces her. We are told of his past then. The story starts only in the second half. Still there's just a bit of plotline, almost non existent.\n\nStunts were wierd. Not saying they were bad, but unusual. The superpowers of Krishna will put Hollywood superheroes to shame. Whatever he touches turns powerful, that's the only way you can explain how the volleyball he hit cracked a rock.\n\nHritik is a good actor. He was 32 when he did Krrish but he brilliantly captured the innocence of a 20 year old boy. But he whispers a lot. Rekha and Naseeruddin Shah supported brilliantly. Priyanka chopra is diassapointing and Manini Mishra overacted. Hemant pandey is good in his brief role. But everyone is monotonous throughout the film. Also, except Krishna, no character is given any depth.\n\nThere isn't anything in it which we haven't seen a hundred times before. Why would I advice someone to watch it?"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "nomanali77",
        "review_rating": "8",
        "review_title": "Surprisingly Good!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "naveen_buddy",
        "review_rating": "10",
        "review_title": "movie just for sponsor products",
        "review_detailed_main": "well this is the worst movie i saw this year well some say its first superhero movie with lots of effect but there is nothing original about it it running packed house because of media hype there is no effect in movie only rope tricks are used storyline is stupid nothing new in it and director fail to describe what super power our hero have one should remember superhero is not the one with superpowers he have to sacrifice a lot like spider-man , batman and others so please please stop saying its the best movie. for first half it just a romantic movie hero chases heroine like all other Hindi movie at end filmmaker realize time to end the movie so hero go after villain and take his revenge someone at least tell me what is new in this movie expect is Hrithik Roshan hair style music is worst so please guys beware before u watch this movie"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Li_85",
        "review_rating": "10",
        "review_title": "Brilliant Entertaining Movie...MUST SEE",
        "review_detailed_main": "I Cant Believe at what some people are saying about this film, that it was crap. Its suppose to be a Fictional movie, who cares about the Technology stuff. I can name you 100 Hollywood HIT Films like this, anyway.\n\nBollywood have tried making superhero movies in the past like Toofan, Ajooba and even the Hindi version of Superman (Ultimately Crap). Krrish is an amazingly and Professionally filmed Movie that entertains all the way. The Graphics are Fantastic and probably the Best ever witnessed in an Indian Movie. The movie has Action, Comedy, Romance which is a little longer then needed and family drama with revenge. Hritek has given a good performance as usual, Koi Mil Gaya role was more challenging. The Beautiful Priyanka Chopra looks very sexy as usual and delivers a good performance. All Supporting characters were good in their own ways.\n\nI noticed Some people did not enjoy this, But some people Do have Bad taste, its natural. My opinion, A Excellent and last 30 minutes is non stop fun."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "AishFan",
        "review_rating": "9",
        "review_title": "Bollywood's first superhero makes a storming entrance!",
        "review_detailed_main": "Who better than Hrithik Roshan to attain the honor of giving India it's first superhero? It clearly shows that Hrithik put in his 200% into this film whether it be his death-defying stunts across the skyscrapers of Singapore, his superb acting, or his superhero physique. You'd think the Roshans couldn't come up with a better storyline than the original, but think again! Krrish has just as intense and moving a story as Koi Mil Gaya. Apart from the breathtaking action, the story has strong emotions and themes making it all the more enjoyable. Where Hollywood superhero movies like Batman, Spiderman, and Superman have villains with an odd, powerful physical strength, Krrish's villain has a power of a different dimension--time. Powerful emotions and an intelligently written script set Krrish apart from your typical Hollywood superhero flick. Priyanka was extremely disappointing and irritating for the first time. Songs are lame."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "him_bkn",
        "review_rating": "10",
        "review_title": "Brilliant - the movie Krrish the acting of Hrithik and his stunts",
        "review_detailed_main": "Hrithik Roshan is the best superstar in the industry not only in Bolywood but also in Hollywood and he has proved it through Krrish. He is always underestimated by many people but he is more talented than khans of Bollywood and if he does not get Oscars for this movie, it will be ignorance of talent by the world. Watch the movie his actions, his emotions and his acting and dancing skills all Superb even Hollywood Superman can't match his standards. ANd another great thing is some actions he has performed himself and not through computer generated images, only due to him the movie is a super hit blockbuster in India and abroad."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Smartt",
        "review_rating": "8",
        "review_title": "A super-hero with heart!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "superfan35",
        "review_rating": "9",
        "review_title": "First-rate film",
        "review_detailed_main": "I am a long-time Superman fan, not South Asian, and loved this movie. It is good both within Bollywood standards as well as on its own in terms of introducing a new concept in Indian cinema. I agree with Effulgent-Warrior's comment's 100% -- to compare it to other genres of movies would be a mistake. In and of itself, it combines a good story, excellent cinematography, solid visual effects, wonderful music and an incredible performance by Hrithik Roshan.\n\nI went into this movie with absolutely no idea of who Hrithik Roshan was or any knowledge of the movie's background (other than that it was about an Indian superhero), and was blown away. The standards are incredibly high across the board, it's a great plot, the performances are solid, and it's a very entertaining experience overall. To dissect it against American standards would be a big mistake. If there's one thing that bothered me it was the blatant product placement, but I know that's a Bollywood standard as much as the music and almost 3 hour length!\n\nHrithik Roshan could easily have a distinguished career in the U.S., able to go up against any American or British action actor in my opinion. He's that good.\n\nIn summary, this is a first-rate film that deserves to be watched. I can't wait for Krrish 2."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "v-gobind",
        "review_rating": "8",
        "review_title": "Krrish.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "viit3",
        "review_rating": "8",
        "review_title": "Complete Hindi Masala Movie",
        "review_detailed_main": "I saw this movie today and well I am darn happy with it. Whoever said about there being no comic books in India does'nt realise mo one was going out to make a comic book movie but all that the makers were trying to do was to dish out something different for Indian audiences who are sick of all those stupid lovey-dovey movies.\n\nYes,there are a lot of clichés here.Yes there are many scenes in which it is evident that the makers turned towards Hollywood for \"Inspiration\" but so what .They made a damn good movie .\n\nThe acting was really good .Mostly the movie focused on Hrithik but the rest of the cast especially Naseer also showed there class .The story had a number of plot holes which I am not going to disclose but you simply had to accept them.But the songs were when it was difficult to watch the movie.\n\nAll in all a really good movie."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "zeroin_ht",
        "review_rating": "8",
        "review_title": "Krrish is ambitious and it delivers!",
        "review_detailed_main": "I must have read about 10 reviews so far in three days and I do not understand the reason for the gloom. I went to watch Krrish after reading a scathing review and I was so surprised! The problem lies in the expectations. Why would you go for Krrish expecting to see Hollywood style special effects? And more pertinent a question is why should you compare? Granted that we in India get to watch movies like M:I:3 and X-Men 3 as soon as they release in the West, must not we realize that taking to such movies and making such movies is a whole lot different? And in comparison, Krrish has more emotional reach than either of the above sequels managed. So I think its a good balance. Hollywood uses its studio power to spend millions on special effects, Indian films don't have that kind of money - exactly the reason why they attempt to tug at your emotions...\n\nYes I loved Krrish.\n\nIts the story of the son of Rohit Mehra, the mentally challenged kid in Koi Mil Gaya, who receives powers from an alien called Jadoo. When the movie opens, Rohit and his wife are dead and their Krishna is a precocious five year old. He is too mature and intelligent for his age. Afraid what to make of this, his grandmother (Rekha) takes him far away to Manali and home schools him. Krishna is friendless. In the absence of human friends, he grows up with nature and has a rapport with its beings.\n\nEnter Priya. Its a case of love at first sight. After a few songs later, he follows her to Singapore where she is a reporter. There circumstances force him to reveal his powers. And consequently he gets embroiled with the bad scientist with the dream of ruling the world, Dr Arya.\n\nKrrish's romance is cute and innocent and the love angle is fresh. The action sequences, though they take a little time appearing on screen, when they appear they are mighty good, for a first attempt at this genre of movie-making. Hrithik Roshan showcases his intensity and screen presence. Even in aggressive moves, he is elegant. He is a fine actor. A pity that he shines only when his father directs him.\n\nPriyanka Chopra doesn't quite seem perfect for the role of Priya. Priya was a role that required someone who looked a bit more natural and wilder. Chopra looks a sophisticate without any rebelliousness in her. Someone like Parveen Babi or Zeenat Aman would have chewed up this role. Rekha as the grandmother doesn't have much to do this time, other than look concerned and sad.\n\nThe background music is good in bursts...there is no consistency. A really good background score would have been an asset. The music is quite old style.\n\nYou must watch this movie without any background clutter of Spidey movies, Batmobile, M:I series and other SFX movies. Be fair, for the west had access to this technology decades before us, even the Chinese are far ahead. Let our film makers come to terms with this (its a toy for them now) only then will they be hungry to get the best of it."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "kathuria_nidhi",
        "review_rating": "8",
        "review_title": "Krrish- Watch Out Superman!",
        "review_detailed_main": "When you watch Krrish, you deeply feel the passion, effort and honesty the father-son team invested in the film. Over two years in the making, Krrish is indeed the fruit of labor that manages to reap the sweetness and some true spellbinding moments for its viewers too. The movie is finely structured so that there is no conflict with its prequel 'Koi Mil Gaya' and runs with a fine pace, barring the songs that are a big dampener compared to earlier two Hrithik films, including the mega one 'Kaho Na Pyar Hai'. The director Rakesh Roshan should be applauded for not getting carried away with fatherly love, lest it jeopardize other crucial characters that push the story forward. Priyanka Chopra has a meaty role of almost a parallel length with the superboy. Rekha had her screen moments too. Naseeruddin Shah as the bad man has a good entry point and animating short & crisp monologues of a notorious newsreader. Preity Zinta is surely missed but her exclusion was perhaps essential for the sequel and likewise for the friendly alien 'Jadu'. Once again, the screenplay is skillfully penned by a brigade of writers including Rakesh Roshan and Honey Irani to name a few. Hrithik- Priyanka introduction scene is one of the most stirring love-scenes in the present Hindi cinema, rendered with innocence and 'love is in the air' magical moments. The comedy in the first half is not brash but rather the one with connectivity at the grass roots with the flavor of modernism. The stunts are awe-inspiring and antithesis to pre-release film speculations of a hybrid between a Superman and Spiderman. The expected flights are replaced by giant grasshopper leaps over skyscrapers and the clichéd cape is also dropped for a reversible black long cloak; not very impressive, but effective. The cinematography is top notch capturing Kullu Manali and Singapore in exciting and adventurous frames as the playground for our superhero, who is also the man of the moment; Hrithik Roshan. The overnight superstar of 'Kaho Na Pyar Hai' has once again warranted his stardom amongst the equals a.k.a. the Khans. A sane head over strong shoulders, jutting almost superhuman jumbo biceps, the man of steel has put tantamount pains in his character portrayal projected with realism and conviction. Why watch Krrish? In a nutshell, Hrithik Roshan! But to give devil his due, watch Krrish because it boasts of great acting, tight screenplay, seductive cinematography, enthralling stunts, effective story telling, bull's-eye direction and because you loved 'Koi Mil Gaya' and Hindi Cinema is ready for sequels! Phir Hera Pheri, Darna Zaroori Hai\u0085many more to follow"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "rahuldhaval",
        "review_rating": "8",
        "review_title": "Alright Worth watching",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "yourz_sanju",
        "review_rating": "10",
        "review_title": "Don't consider Krrish as a remake of Spiderman with Indian Masala mixed",
        "review_detailed_main": "Krrish is not an ordinary Indian movie which has action sequences that remind you of Spiderman, batman, and other movies of Hollywood. It differs itself from them. Krrish will be enjoyed by kids and family audiences because of no vulgar scenes. Though Hollywood is just mimicking most of the scripts from Hollywood, the existence of Indian culture hasn't completely vanished away. This is why most NRI and other Asian audiences tend to like a movie like this. As a matter of fact, the stunts of Hritik might influence the children as most children did after watching \"shaktimaan\". The hard work of Rakesh Roshan is seen by the strong character such as Krishna (hritik) and Dr. Siddhant Arya (Naseeruddin Shah). These two characters are like a spirit of this movie. The rest character is well on their places."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "scott-1483",
        "review_rating": "8",
        "review_title": "A good movie if you take it for what it is...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "playboibbz09",
        "review_rating": "10",
        "review_title": "Amazing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Pgoel",
        "review_rating": "9",
        "review_title": "Rakesh Roshan and Hrithik do it again!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Indianmoviebuff",
        "review_rating": "9",
        "review_title": "Krrish -- A very good movie",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "indiana_gs",
        "review_rating": "10",
        "review_title": "Awesome Movie with Music",
        "review_detailed_main": "Awesome movie with realistic stunts and SFX. The movie is entertaining too, with good songs and the costumes are great. The Great Shots of India and Singapore make movie quite good. Worth watching it, even though you cannot understand Hindi !!! plus you can go for the ones with English subtitles. Anyone can understand this movie, people of any age can view along with their families too. It has given a tough beating to Superman, which is struggling in India. This shows that Indians can make world class movies with SFX and that too 1/10th of the total cost, which is required in Hollywood to make a movie.People should watch it."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "hydbad_secbad",
        "review_rating": "10",
        "review_title": "Bollywood's foray into super-human films in a grand style",
        "review_detailed_main": "A film in which the director's hard work and dedication can be clearly seen.Hrithik's performance is outstanding.Priyanka Chopra is beautiful and managed to perform her role well.Songs are OK. This is a sequel to Rakesh Roshan's Koi Mil Gaya... This movie shows us what happens to Rohit (Hrithik in Koi Mil Gaya) after the alien Jadoo leaves bestowing powers to him. The young Hrithik(Krishna) is grown in a remote village due to Rekha's fear of losing grandson due to his gifted strengths and power which passed on from his father, Rekha's son. Priyanka entrance. After a little romance/drama he visits Singapore to bring the heroine back to India. He vows to his grandma that he will not use his powers and get recognized. But circumstances compel him to do so and Krishna becomes Krrish. Rest is all about the super-human stunts and high-tech computer labs and eventually an expected finish with the death of the bad guy. This is an awesome movie for Hrithik fans and kids. Bollywood has made a strong entry into super-human films. This film will not let anyone down except for music lovers who like simply watching songs. Songs do not appeal the first time but couple of the numbers are actually good. Kudos to the Roshans for making Krrish. People who have seen Superman, Spiderman, Pay check, Minority report will have a deja vu feeling but at the same time it is wrong of us to expect a complete original film in an era where a new film is released every day."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "sghnmbjb",
        "review_rating": "10",
        "review_title": "Excellent Movie",
        "review_detailed_main": "Krrish is the first attempt by an Indian director to make an Sci - fi movie and he has done an excellent job. Let me tell you its not easy to make a movie. Those people who criticize Krrish to be a mix of superman,batman and what not are just criticizing the movie for the SAKE of it. I would recommend those people to make a movie first and then understand how difficult it is..... All directors cannot be steven spielbergs and I think Rakesh Roshan has done a good job . And this is just his first attempt........give Bollywood time and the day is not far when they would make even better movies than Hollywood. Hrithik was just awesome and he is in my books the best dancer in bollywood right now. Eagerly waiting for the next sequel too......"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "key_12001",
        "review_rating": "10",
        "review_title": "Fantastic Movie",
        "review_detailed_main": "I think one more success in the hat of Priyanka Chopra. She had added a feather to her beauty. She is gorgeous. Being my favorite actress, She is just lovable in each and every sequence in the film. I wish I could some day meet Priyanka. OK on to the film, Hrithik has acted geniusly, I feel that it is one of the biggest success for him as a super action hero. He has implemented life in the role he was given. He was also Brilliant. So as Rajesh Roshan He was also best. His direction was perfect and to the task. It is quite difficult to make a movie in which a child aged 6 years to a man aged 60 years can sit together and view it. Just Perfect and Fabulous. And above all I really Love Priyanka whole heartedly. She is cute Lovely and just..............Lovely. Priyanka looks so beautiful in all the sequences in the film."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "mayursha",
        "review_rating": "10",
        "review_title": "Amazing movie !",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "yaps_caps",
        "review_rating": "10",
        "review_title": "Krrish is a wonderful experience!!",
        "review_detailed_main": "Krrish is a masterpiece from father-son duo.\n\nThe film is spell-bounding and the hero of the film is just wonderful and he has done a wonderful act in this film.\n\nThe sound effects and cinematography is seen to be believed on the big screen.\n\nJust mind blowing experience after a long time... thanks to the hero and his director hats off to u. all the kids and their parents must watch this movie A must watch for all the movie buffs The greatest film of the year Krrish is a masterpiece from father-son duo.\n\nThe film is spell-bounding and the hero of the film is just wonderful and he has done a wonderful act in this film.\n\nThe sound effects and cinematography is seen to be believed on the big screen.\n\nJust mind blowing experience after a long time... thanks to the hero and his director hats off to u. all the kids and their parents must watch this movie A must watch for all the movie buffs The greatest film of the year"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Nomad123",
        "review_rating": "9",
        "review_title": "A treat for Indian comics fans..we have one worthy superhero!!",
        "review_detailed_main": "I dreaded going for Krrish not because i don't like the theme but that it may not live up to my expectations.I was astounded by the technical aspects and the details of character Rakesh Roshan gave his son.Any superhero enthusiast will know that all the ingredients in this movies are mandatory for any superhero.Mind you the director did not have a base to build up on for a superhero except his prequel.Its as different from Koi Mil Gaya as Rohit is from Krrish.Introduction scenes are pleasant.It starts off mellowly and keeps changing gears every 15-20 min.Hrithik is the heart and soul of the movie.No other hero in Bollywood or Hollywood can emulate his emotions or his inimitable style.The sequences are reminiscent of Crouching Tiger Hidden Dragon style movies.The scene where the hero heroine descend after the rescue is beautiful.The movie moves predictably as the target audience is such.\n\nMoving on to more important stuff.As you would have noticed in trailers the superpowers are given special care to.Rakesh Roshan has made sure that Krrish is no Superman or Batman or Spiderman.He does not fly or use ropes or webs to move from one place to another.He just jumps and bicycles in AIR!!This sole aspect is unnoticed by the many detractors but only hardcore comic fans will notice =>.For a 40 day martial workshop the performance of Hrithik is outstanding by any measure.As usual he is not satisfied by giving his 110% he always gives 200% for any performance.He succeeds too.\n\nHe gets smitten by the reporter-on-vacation as its his first contact with outsiders.He follows her to Singapore and eventually the movie has many twists and turns(which are predictable for seasoned movie goers)but decent enough as passable.The twist in last 20min is laudable as no one would have seen it coming.The ending was very satisfactory.\n\nThe movie has some cons too.Some scenes were too comic book like and could have been avoided a.k.a. some kicks,punches and a few multiple attacks within same second could have been avoided.It is a bit long at nearly 180 minutes.Songs are average but a treat to watch as Hrithik delivers effortless dance sequences.\n\nThe best technical and action effort to ever to grace an Indian screen.Kudos to Rakesh-Hrithik pair.They click together well and they have now been time tested.This genre was an untouched territory but now we have a worthy team to take India into this.Here's wishing them a blockbuster on their hands and hoping desperately to see many more sequels of Krrish."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "yasserhasan1",
        "review_rating": "10",
        "review_title": "Krrish-the best movie of the year",
        "review_detailed_main": "I watched this movie recently and I would be very glad to say that I enjoyed a lot of it. I mean to me there wasn't any difference in watching this movie \"Krrish\" compared to any other English superhero movie(eg:-Superman, Spiderman, Batman etc.)I am very glad that India has finally done it, they have made a movie which could be really compared to any good movie in here. The use of sci-fi is first time introduced in Indian cinema and I will be very happy if they continue to produce a good movie like this. This is the best movie of the year. And I am really dying to watch the next sequel of this movie. Its a 10/10."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "mctrix2004",
        "review_rating": "10",
        "review_title": "great film",
        "review_detailed_main": "this film is excellent and i not saying this because it hrthik roshan film but it has all the thing that a film needs like comedy,action,love and suspense and all this combination in that film are great and i dnt think that Kran johar can make movie like that not even with his multi money!!! i'm glad that Rakesh Roshan has made this film and i very very happy to Se film like that it will more fun if the movies hits at the top and i will be glad Cos i like to Se looser like Kran johar. this guy only cast people like Rani,pretty,and shuruk khan this people are his puppet and they follow him Wat he says. PEOPLE GO OUT AND WATCH THIZ MOVIE IT IS GREAT AND I'm SURE YPU WILL LIKE IT TOO SUPPORT RAKESH AND HRTHIK FOR THIS MOVIE!!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "0U",
        "review_rating": "",
        "review_title": "Not bad",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ravind_kumar",
        "review_rating": "9",
        "review_title": "Krrish - a landmark film in Indian Cinema",
        "review_detailed_main": "Krrish is an outstanding film. It is a landmark film in Indian Cinema. The film deserves to be a bigger hit than what it appears to have been. This is as per my perception. Within a few weeks of release, promos drastically reduced. It seems Rakesh Roshan has been more than happy with the success. And probably a bit complacent as well. The film is superb in its genre, particularly in the context of Bollywood which is having its first Super Hero film. Hrithik is unbelievable, story does not have loose ends and Naseer adds class to the film. The film is fun, engaging and stunts fit well in the story. Good work by Rakesh & Hrithik."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Mr-Niceguy50",
        "review_rating": "10",
        "review_title": "An Awesome movie! But, not better than Koi Mil Gaya.",
        "review_detailed_main": "This movie was very well done and the songs and dances were amazing! Hrithik Roshan is such a loose dancer! So Flexible. But Priyanka Chopra disappointed me. Her role was just like every other superhero's lover role, helpless and and over acter, and overreactor. She shouldn't have been in the role. I don't blame her for the acting she did. It's the script writers that need to be blamed. She doesn't deserve to be blamed at all. But she could have made suggestions and not stood back. The best role was played by Nasserudin Shah for his villainous role as the power crazy, time maniac. He really scared me when he did his \"breaking news\" quotes. He just seemed so calm yet violent. He acted like Nana Patekar. He just scared the heck out of me, but at the same time, he would just stay calm and just say, \" That's true if he's gone, how will I ever control time?\" He is just about the scariest villain I've seen, next to Amrish Puri. All in all, the movie was good, but, sadly, not better than the prequel."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "papanloveu",
        "review_rating": "8",
        "review_title": "Superhero!!",
        "review_detailed_main": "I think it's a great movie. At a time when almost all the film makers were going on the same track, Mr. Roshan chose to do something different."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "shivakumarvishwa",
        "review_rating": "10",
        "review_title": "Amazing.Better than the first",
        "review_detailed_main": "This is one of the best movies ever.The movie is wow from beginning to end.The special effects are excellent.THe cinematography is excellent.There is no scence that drags.The story is brilliant.It is the sequel of Koi mil Gaya(2003).Rohit and Nisha are married.One day Rohit goes to Singapore.He goes to a lab.Somee problem happens.At the same time Nisha gives birth to a child.The lab explodes.He(rohit)dies.Nisha too dies.The baby is named Krishna.The film opens when Sonia found out that Krishna has a brilliant Iq.He takes him far away(Possibly to Himachal Pradesh).Years later he grows up.He meets Priya and falls in love.He goes to Singapore.One day on a circus night a few children's are inside the blazing tent.He wants to save them.He takes a mask and becomes KKrish.Dr Arya wants him.The stunts are MINDBLOWING.Hrithik delivers a breathtaking performance.Priyanka looked pretty as usual but sadly she was just about okay.Rekha is okay too.Nasserdun delivers a good performance.The music is faboulous.A Must see Rating-9/10"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "rrchatterjee",
        "review_rating": "8",
        "review_title": "Spoof Biggest ever in Cinema History",
        "review_detailed_main": "How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)How was Krrish born when his dad was out of country for continual 2 years. :)"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "immohammadsrm",
        "review_rating": "10",
        "review_title": "Best Movie",
        "review_detailed_main": "I will give this a 10 because you put a lot of effort into making this movie and putting your most creative ideas in and I also give ¨Koi mil gaya¨ a ten because you made it my favorite movie of all times! And you put a lot of effort into these movies! :D And just to let you know I have not watched Krrish 2 or 3.\n\nThe best movie series in Sci-fi Bollywood movies. Krishh has made it with great acting of Hrithik Roshan, the charming hero with superpowers. This movie has inspired various movies and can be watched by anyone ...100%good. Good drama,story, music ,acting plot, comedy and great action thrill."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Ali_mozaffari_1999",
        "review_rating": "8",
        "review_title": "Excellent and emotional",
        "review_detailed_main": "It had a great storyline and screenplay, but a bit of its heroic parts are a lot of exaggeration and far from logical, in general it is very good and memorable for me"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "Im_Perfections",
        "review_rating": "10",
        "review_title": "Krrish-The Brilliant Film of All...Will Be Bless...",
        "review_detailed_main": "Wouh...Firstly, I am so glad that Krrish was shot here in my country, Singapore...I have been always supporting Hrithik and is Hrithik Roshan die hard fan...Even though I am unable to see his shootings that time, I can felt his presences here... And the other thing that makes me crazy is that Krrish was a very fantastic film and overall I had seen it two times in cinema even though it cost $10 per ticket , I tell you it's more than worth it...Now, I'll always watch the DVD...I'll be able and don't mind watching it a million times again and again... Hrithik really acted out that character very wonderfully and is the first Indian Super Hero... He really makes a Blast off performances in all the songs. I believe that Hrithik had done a brilliant job and this movie is a Biggest Blockbuster Movie. I really hope and pray that this movie will win. Even though,there are some negatives mind set peoples out there,whatever BUT overall...The truth and the fact is that Krrish is the BIGGEST BLOCKBUSTER MOVIE...I wish Hrithik Roshan and Rakesh Roshan , All The Best... And for the people around the world...Krrish is a movie that u can't miss out...It's a WASTE WHO NEVER WATCH IT..."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "disharma-24131",
        "review_rating": "9",
        "review_title": "A marvelous watch for the family",
        "review_detailed_main": "Directed and produced by Rakesh Roshan, Krrish 2006 is an Indian Hindi-language superhero film. Starring Hrithik Roshan and Priyanka Chopra, Naseeruddin Shah, Rekha, Manini Mishra, Archana Puran Singh and Sharat Saxena, this movie portrayed the best storytelling of a superhero. A second installment of Koi mil Gaya, is a complete package of action, thrill and mystery. The charming chemistry of Hrithik and Priyanka is not disappointing. It is an enigmatic and fascinating story of Krrish who was forced to use his superpowers to save the world.\n\nThe originality of the story has absorbing elements of insightful sensitivity and thought provoking idea of good over evil. This film has the potential to imagine and think out-of-the-box. The big budget movie is an excellent and intriguing plot which has the powerful ability to leave an indelible mark on the watchers. Before watching movie, take a look at the synopsis to make a fair decision.\n\nBelow is the synopsis.\n\nSynopsis:\n\nKrishna (Hrithik Roshan) was endowed by his father with magical abilities at birth. Priya enters his life and takes on a life of her own. He goes to Singapore when she calls his name. The megalomaniacal scientist Dr. Siddhant Arya is about to alter the course of history forever in Singapore. Dr. Arya is the only person standing between him and his dangerous fantasies.\n\nSongs:\n\nThe music composer Rajesh Roshan has given the future generation an all-time chartbuster hit song. From Dil Na Diya to Pyaar ki Kahaani, all the songs are timeless priceless gifts for everyone to sing and dance.\n\nThe melodious voices of Shreya Ghoshal, Sonu Nigam, Udit Narayan, Alka Yagnik and Rafaqat Ali will force you to add all the songs in your along playlist. The calming and emotional lyrics of the songs can refresh your moods.\n\nActing performance\n\nThe acting of all the actors and actresses are flawless and commendable. With good dialogue delivery and catchy dialogues, the fast moving and engaging acting of all the performers had given the best all time superhit. A sensible acting will make you go through the emotions such as, sympathy, anger, joy and fascinating romance.\n\nYou will not get disappointed, bored or feel stupid."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "wholelottame",
        "review_rating": "8",
        "review_title": "Enjoyable",
        "review_detailed_main": "Krrish is neither as bad as some people claim through simple and generic nitpicks nor as good as some people hype it up. But the movie is good enough to be enjoyable throughout its entire running length. Krrish is a very light hearted movie that one can see with his family and not take too seriously. The story is easily predictable. They might have ripped off too many Hollywood movies and may have also flooded the scenes with different sponsor brand names but despite all those flaws, there is a lot of enjoyable content. Hrithik Roshan's acting is never to be doubted, especially after Lakshya (this movie is no lakshya though) and he does deliver a superb performance. Just don't go expecting something ground breaking because it is not, even though it may be a landmark by Bollywood standards."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ritik_",
        "review_rating": "10",
        "review_title": "Not a Movie, But an Emotion <3",
        "review_detailed_main": "When I was a kid, I don't remember, how many times I'd watched this movie.\n\nIf I watch it now, I'll find it a good movie or a very good movie, but the emotions are still way too attached.\n\nIts background score, the action scenes, the story, everything is just almost perfect. Yes, it has a lot of silly mistakes, but that doesn't take away the fact that it's one of the best superhero movies ever made.\n\nEven its sequel couldn't touch its legacy, I don't think any other Indian movie will.\n\nI absolutely love this movie and it deserves all the success it has got, especially in the time of its release!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "kumudjolly",
        "review_rating": "10",
        "review_title": "a beautiful experience to see Indian superhero",
        "review_detailed_main": "Hrithik Roshan is one of the best things ever happened to bollywood and without him Krrish would not be possible. And who says music is not that great, songs are so melodious and again the picturization was too good. One can easily watch this movie mulitple times just to see Hrithik and his super hero style. Some of the stunts like jumping over the river,monkeying between the trees fighting with Chinese mafia were awesome. Rekha's makeup was over board to make her look older. which was unnecessary. Amazingly, Priyanka Chopra manages to look okay with Hrithik. Other actors and Naserudin were good. In the first part there is a old filmi style comedy, which some how appeals. There is a comedy, emotions, love, values and an awesome and clean entertainment for the whole family."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "jdpsaren",
        "review_rating": "10",
        "review_title": "Nostalgic",
        "review_detailed_main": "My All time favourite Movie. This film was made at a time when Bollywood had no proper superhero film like Hollywood. Only shaktimaan and few others were there but they dominated the TV shows but a proper film, no, not that time.\n\nMany people in 2006 (due to lack of proper internet) werent aware that Krrish was the sequel to Koi Mil gaya. Only after watching the film they realized that.\n\nKrrish was an instant hit not only because it was a sequel to an already superhit film, but the fact that Indian audience got to witness probably its first proper looking superhero film on the big screen. The plot was also believable considering it inherits from its prequel hence krishna's powers were quite well justified."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "gangsta_intoxicated",
        "review_rating": "8",
        "review_title": "a gr8 bollywood film",
        "review_detailed_main": "I saw Krrish the other day...and i was really surprised to see how intelligently the film has been made..it has everything for a perfect movie.. i am a big movie buff and have seen almost all super-hero movies,,,be it superman, spiderman batman,,, and compared to them i think the storyline of krrish is much more realistic and believable,, it is a new beginning for Hindi cinema..as now it is almost at par with Hollywood.. this 10 million dollar has turned out to be better and more entertaining than 200 million dollar superman,,,what a movie it was...though it would have been a little more better if hritik spent more time in the mask...way to go rakesh sir..we're waiting for the rd part..with a little better graphics,,"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "ajayrahl",
        "review_rating": "10",
        "review_title": "Krrish",
        "review_detailed_main": "Now this was money well spent, Every money has been counted for.\n\nA first Indian Superhero movie that rocks the house.\n\nFather and Son did an Excellent job but could have been improved in places but good anyway.\n\nThe special effects were in line with what they had to work with and all the credit to the director a job well done.\n\nNow this was money well spent, Every money has been counted for.\n\nA first Indian Superhero movie that rocks the house.\n\nFather and Son did an Excellent job but could have been improved in places but good anyway.\n\nThe special effects were in line with what they had to work with and all the credit to the director a job well done"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "mattysid",
        "review_rating": "10",
        "review_title": "Woahhh Surreal",
        "review_detailed_main": "I just sat for 3 hours in a cold outdoor cinema at the Pusan International Film Festival, South Korea and can frankly say that Krrish has to be one of the most surreal, most wonderful movie experiences I have had the pleasure to be subjected to for a long time! I haven't laughed so much in my life, and I don't mean that in a negative way. Myself, my friends and the several hundred Koreans there, were in absolute hysterics from beginning to end. I am sure that it wasn't the directors intention to make us laugh, but laugh we did and I thank him for it.\n\nThe Korean audience were applauding the fight sequences and at the end of the movie, there was a huge cheer and round of genuine applause for a really entertaining night.\n\nGreat stuff...go and see it."
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "sghay",
        "review_rating": "8",
        "review_title": "surprisingly good",
        "review_detailed_main": "i rented this movie after seeing the trailer and thinking \"aaah, bollywood has discovered hong Kong style rope-work\" and wondering what they would have done with it. hrithik has never struck me as a heavyweight in the acting world (although he's gorgeous and he is one of--if not the--best male dancer in bollywood) but in koi mil gaya and krrish i was really proud of the work he did. very different from the normal type of character he plays, and subtle, too. (i'm trying not to spoil the story here).\n\noverall, i'd say the last 45 minutes or so was the best part of the movie, when it got more into what he had to do and away from the lovey dovey stuff which, considering the characters they wrote for those girls, was extremely disappointing and given the heightened intelligence Krishna is supposed to be endowed with, almost unbelievable.\n\ni'm glad i saw it and came away with a new respect for hrithik as an actor..\n\ni do think the cover shots for the DVD and the movie menu might have been partly inspired by takeshi kaneshiro in \"Returner\"...anyone else know what i'm talking about?!"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "kendrachailyn",
        "review_rating": "8",
        "review_title": "About Krrish and Why I was pleasantly surprised",
        "review_detailed_main": "I've been watching Hindi movies every since I was 17 years old, and I have to say, never have I seen a movie like this one! I mean, I love Rhitik Roshan but there is something about the way he Plays Krrishna Mehra that was just filled with genuine acting! It was amazing and if you are a person that watch the movie just for graphics, then this movie exceeds expectation. The fight scenes are well prepared, the singing were in context and not just a bunch of people singing and dancing around trees for now reason.\n\nI love the blend of cultures in this movie and I love the way Krrish was a superhero but at the same time, he is human. He is NOTHING like Superman or any of the English superhero that I grew up with. Krrish is more of the people's hero.\n\nAgain this movie was a great watch and I think after sending this, I really should watch it again.\n\nCheers all! K"
    },
    {
        "movie_id": "tt0432637",
        "movie_name": "Krrish",
        "movie_rating": "6.5",
        "review_username": "marshaof",
        "review_rating": "",
        "review_title": "The Roshans just keep getting better!",
        "review_detailed_main": ""
    }
]