[
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "nathan-mcgee6",
        "review_rating": "3",
        "review_title": "Pointless remake",
        "review_detailed_main": "I'm not the one to hate on horror movie remakes I actually enjoy watching a classic remade for the modern audience. But that's only when the director can create a new modern twist or add more to what the original didn't have like what Zombie did for Carpenter's Halloween. But the remake of Eli Roth's Cabin Fever is just one of the most pointless horror remakes I've ever seen next to Psycho. The story of the movie is lame. It's everything you seen in the original just with different actors in these scenes. You actually know what's coming next. You even know what the characters are gonna say next. There's nothing new added in the directors own vision. It's the same Dog death opening scene. The scene where one of the characters gets his hand attacked by Dennis is the same. Even the camp fire story is the same. The only difference is the ending of the movie, which is not half bad. The characters are very unimportant to this movie or at least they felt like it. You don't pay even a minute of attention to them because, well they are supposed to be the same as well and they make the same dumb choices of survival as the original. The blood n gore effects seem to be up higher than the original. But it might it some gore lovers we do see a lot more blood all around in some scenes especially in the bath tub scene we see even some skin coming off.\n\nI didn't enjoy this remake at all it's nothing, but watching the same movie you already seen. You know what's coming next. The characters die in the sane order as they did in the original. The only differences you'll find is the ending, higher blood n gore, and different actors who shouldn't be allowed to ever act in another movie again. I don't recommend you watch this waste of a remake. You'll have a much more better time re watching the original movie."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Sleepin_Dragon",
        "review_rating": "3",
        "review_title": "Why?",
        "review_detailed_main": "The film industry must be in real crisis if average films are being remade after little more then a decade. The original was an OK film, I wouldn't have said it was a classic, and this remake seems so unnecessary, it doesn't differentiate from the original in any way, it doesn't bring anything new or different, it's basically remade word for word. The gore scenes are somewhat improved, a little more dramatic, and the dog scene is more dramatic.\n\nI have so very little to say here, as I didn't enjoy it all that much, it seems only a few years ago that I went to the Cinema to watch the original, I find it more disappointing that new ideas simply aren't there, there surely has to be a vast undiscovered writing talent out there.\n\nmehh, 3/10"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "manuelasaez",
        "review_rating": "5",
        "review_title": "Useless remake is useless",
        "review_detailed_main": "This movie should not have been made. It does nothing new, different or even remotely better than the admittedly average original. Had it been Evil Dead-remake caliber, we would have been in for something special. But everything from the acting to the gore has taken a considerable hit with this remake as to effectively make it Cabin Fever-lite. This movie doesn't even try to be original in its retelling of the film, as the same basic set-up (and even some of the dialogue) has been reused and recycled to ill-effect. Worst part of it all? Save for a few of the actors, the performances were atrocious. Honesty, I have seen found-footage films with better acting than what some of these no-talents pulled off. The movie was limited in its vision, and toning down the gore does a disservice to everything that was good about the original film. It's just basic in almost every way, and really is a waste of resources. If you didn't believe Eli Roth was a hack before, you certainly will after watching this mess. Not recommended, even if you have absolutely nothing else to watch."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lnvicta",
        "review_rating": "1",
        "review_title": "This Cabin Fever reboot fails in every way imaginable.",
        "review_detailed_main": "Cabin Fever is just another one of those movies where studio executives thought, \"Hey, the original was good so why not milk the f*ck out of the name and release heaps of garbage, call them sequels, and the money will come.\" Now this reboot comes along with the exact same script as the original so I figure the execs were just like, \"F*ck it, why even try?\" And it shows. The good news is that this isn't a theatrical release - it's limited on-demand or something so thankfully a majority of people won't be aware of this abomination's existence. But for those who are, let me affirm your suspicions: this movie blows.\n\nFirst off, none of these people should be allowed to act ever again. I hesitate to call them actors because I saw no semblance of acting on screen. The characters are unlikable and annoying, which is weird because I don't remember hating them in the original. I didn't care if any of them died; in fact I wanted them all to die so the movie would end as quickly as possible. It literally goes down the horror movie cliché checklist. The cabin in the woods schtick, clueless college kids, creepy guy at a gas station, perfunctory sex scenes, loud sound effects to make you jump, etc. Hell, even the gore is lame. Patient Zero had better gore effects.\n\nPlease don't watch this movie. It makes Patient Zero look like The Dark Knight. Watch the original if you want, or literally any other Eli Roth movie. I don't blame Roth for this mess because I'm pretty sure he just signed off on it, made some green and never thought about it again. It doesn't even have his signature silly style. It tries to take itself seriously and it fails miserably. Then they shoehorn in some jokes that aren't funny at all, and you laugh at how horribly they were delivered, and then you'll contemplate what you're doing with your life. It's a chore to watch, seriously.\n\nCabin Fever is just another byproduct of the horror remake craze. Avoid at all costs."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lupitag-11852",
        "review_rating": "1",
        "review_title": "No, no, no.",
        "review_detailed_main": "While not a shot-for-shot remake (the angles and cinematography are different), this remake uses the same script as the 2002 original with slight alterations. Despite this seemingly pointless exercise, I was prepared to give it a chance and not hate it for failing to aspire to anything original. I'll go on the record saying I -wanted- to like this film, despite some unease after watching the trailer. I'm sad to say it fails to live up to the original in nearly every regard.\n\nWhat sets this remake apart from it's 2002 predecessor is the lack of any chemistry between the actors. It's not that any one particular actor is singularly bad, it's that none of them feel like they're in the same movie. It literally feels as if they pulled random strangers off the streets and asked them to make-believe they were friends for a weekend. I simply couldn't buy that any of them would take off for a weekend together, much less have known one another for years, as is the case for at least two of the characters. They feel like strangers and it doesn't help that all of them seem to be acting as if they're in completely different films--the disconnect is that apparent. It's upsetting that, despite having many of the same scenes and lines as their original characters, everyone in the cast feels so disconnected from the script that they utterly fail to bring any of their characters to life. They're the ghosts of what we saw in the original film, the acting completely lifeless. It's as if none of them wanted to be there.\n\nRoth's trademark humor is also excised in favor of a few random throwaway jokes, delivered in such a deadpan tone by the actors that each one falls flat on its face. This time around, the director goes for a more serious approach to the material (a mistake, I believe) and attempts to paint the film as a tragedy. Nothing attempts to sell this more than the overly-ambitious music score, which is so epic at times that it feels like it belongs in a big-scale war movie. The composer feels the need to John Williams this thing up at times, which just leaves the viewer scratching their heads at why such a big spectacle of a score is being utilized for a film that largely takes place in a single cabin.\n\nAs if to keep from being too familiar, the deaths are altered just enough to qualify as being original, as long as you don't count on being surprised. Practically everything is telegraphed a mile in advance thanks in no small part to the reliance on the original script so that even the prospect of new deaths isn't enough to warrant much excitement.\n\nPerhaps the biggest blunder is the recasting of Deputy Winston as a woman, played by an actress with zero comedic timing (although this doesn't stop her from being handed humorous dialogue). The character is a painful reminder that no one invested in this remake knows how to bring life to their character, as is true with the weed-toting camper (played by Eli Roth in the original). No one would call the acting in Cabin Fever '02 a revelation, but it's as good as gold compared to this.\n\nThe entire film is permeated with a depressing lack of passion on or off camera. It's as if no one wanted to be doing this. Roth's film, while certainly underrated by many, at least felt as if it was made by someone who cares. This is a lifeless remake on par with the new Nightmare on Elm Street. Truly a flat, emotionally barren production not even worthy of viewing as a curiosity."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Michael_Elliott",
        "review_rating": "",
        "review_title": "One of the Most Pointless Remakes You'll Ever See",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "n_Disappointment_p",
        "review_rating": "3",
        "review_title": "Update that falls on it's face.",
        "review_detailed_main": "So I take most movies as what they are, entertainment. But sometimes you can't help but get annoyed with stupidity/lack of common sense. This \"update\" really just \"modernizes\" the original Cabin Fever staying pretty true to the story line a some minor changes here and there... I was alright with this movie and tried to put up with it but Eli Roth has an ability to make his characters seem like the DUMBEST living sentient beings in the world. In the world of Horror movies, I understand, the people have to be lower than average intelligence and lack common sense so that the plot will progress cause instead of knocking on the door of a trailer so you can use the phone for help, the character decides to \"peek\" in through a window in stead EVEN tho all the lights are on... so the inhabitants obviously don't listen to his pleas for help cause they seem him as a sexual predator.\n\nI was kind of excited for this cause the original Cabin Fever was (IMO) a ground breaking piece of indie horror, it came out during the time when indie films were coming out of the shadows and actually gaining momentum. But this movie, I tried to stick it out, I really tried but there are levels of stupidity in this that \"cringe\" is a gross understatement. If you saw the original Cabin Fever and liked it, give this one a go! It's not entirely bad. But if you haven't seen the original first...\n\nWATCH THE ORIGINAL FIRST, PLEASE!!!\n\nand Mr. Roth, please inject just a meager amount of common sense into your characters, please?"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "HailPaimon_",
        "review_rating": "3",
        "review_title": "A pointless, practically shot-for-shot remake of a film that wasn't very good to begin with.",
        "review_detailed_main": "I'll admit I've never been much of an Eli Roth fan. The original Cabin Fever was a pretty bad movie but I wouldn't even recommend this film to Eli Roth fans, as it is a pretty pointless remake. Fans of the original probably should stay away.\n\nIf there was one positive thing about the original film, it was that it had that low budget charm to it. There's something about low budget horror films that I like and Cabin Fever had that. However, this remake does away with that charm as it obviously had a higher budget. A higher budget doesn't always mean a better film, though.\n\nThe acting in this remake is atrocious and the dialogue is even worse. The characters are all underdeveloped stereotypes that you really don't care about at all. Nearly all the scenes of the original are redone shot-for-shot, but they're handled in a much messier manner. There are a few minor differences, such as the \"party man\" cop character is now played by a female, for some reason.\n\nAs for positives, there aren't many. The cinematography was decent and the gore and makeup effects were pretty damn good actually. Some of the music was alright. But that's about it. I don't see why this film had to be made.\n\nOverall, this is a shallow remake of a bad, low budget horror film from 2002. If you've never seen Cabin Fever but plan on watching it, I'd go with the original, as it is the better of the two. However, that's not saying much, as they're both pretty shitty. If you are a fan of the original, you probably won't like it much. But you might watch it anyway just to compare the two. I wouldn't pay much to see it, though. Maybe rent it if you get the chance.\n\n3/10"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Mattc164",
        "review_rating": "1",
        "review_title": "Beyond ridiculous.",
        "review_detailed_main": "I mean what the hell. Remaking movies that're less than 15 years old... What's next?"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "gerry_barnaby",
        "review_rating": "1",
        "review_title": "A carbon copy of the original, you might as well play the original say it a remake",
        "review_detailed_main": "Cabin Fever (Remake) Horror) I kind of went in to this film thinking that this would be told in a different way, maybe in a better way than its original film. Now I'm not normal a El Roth fan but even I've got to notice this film has to be his worst ever film.\n\nI mean remake are meant to be told different, with new character, new story, new way of this flesh eat bug virus now sadly if you were expecting that you will be disappointed.\n\nCabin fever remake is basically a rehash, carbon copy of it original scene by scene, which make you wonder why in the hell didn't he just make something new. Because this by any standards of a horror film is just a complete waste of money & time making the same film as the original in every way possible.\n\nSeriously you might as well put the original film in your Blu-ray or DVD player & call it a remake, this is just how bad this is, coming from El Roth seriously he could of done better.\n\nSadly this is not a film i can recommend watching, i cant force you not to watch it , i can only warn you not to expect anything different from the original film. It entirely up to you if you watch it or not at least I've warned you. You may like it or you may not depend of you point of view, but not a film i can say yes it good. Sorry horror fan got to be brutally honest with this one."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "coreyjdenford",
        "review_rating": "1",
        "review_title": "Remake Fever",
        "review_detailed_main": "This my review of Cabin Fever (spoiler free)\n\n0.5/5\n\nCast: Gage Golightly, Matthew Daddario, Samuel Davis.\n\nPlot: Five Friends celebrating graduation rent a cabin in the woods, only to find themselves falling victim to a flesh-eating virus – and, later, some redneck types who don't take kindly to their germs.\n\nHorror fans can be a baffling bunch sometimes, often screaming bloody murder often when a genre classic gets remade, forgetting that some of their favourite modern horror films (The Thing, The Fly, The Ring) are remakes themselves. All of which are significantly better than this. It has been 14 years since the original Eli Roth gore-fest and some of the audiences that this is aimed at were toddlers at the time. The first one wasn't even good enough to be considered a classic even though it's better than this, and then there were the two sequels the second one better than the first and third one, let's not talk about that one. This brand spanking 2016 version had so much potential and even the Cabin Fever series isn't a talked about franchise, this film still had potential but it's just an extremely lazy remake. It would be better to watch the first one again because this one copies every word from the original script, and that's not to say it's a bad thing it's just that this one is just so bad. The film even copies every well third-base shenanigan the original one had. The thing is, is that claustrophobic horrors can actually be quite good but director Travis Z (Z for Zariwny) goes to far in trying to make this a horror (not convincingly) and not enough focusing on the claustrophobic feeling. To be fair is it supposed to give off tat feeling? Or is it just corny re-hash? People including myself would choose the second one even though the other 3 films are corny but not lazy like this is. Although this is one for the average gore fan but this is neither gory nor entertaining because even the original had gore as a feature but also it had the aspect that it was meant to be entertaining.\n\nHere are some points as to why this is the laziest horror ever made:\n\nStory: The story is probably the biggest point to take out because well there is no story or it's so bad it just feels like there isn't one. The story is a complete remake or in this case reboot because it looks like the director has just copied something that an original much better director did back in 2002. The story is in a humorous is that right to say? No it's humorless and quite frankly just cheesy and there are some really cheesy films out there all of which are better. If you like originality in a story then please this because this isn't original the director just rehashed something that's already been done and that is putting it nicely.\n\nCharacters: Another thing that the director copy and pasted because these characters although not played by the same 'actors' (again putting it nicely) they are just an exact copy as the first. They act in the same way they get infected the same way and it still has the skin peeling when you shave gimmick to it, but that is what made the first one good and well a classic although not really classic. The moral is the characters do the same thing not always a bad thing but in this case it is.\n\nSpeaking of the actors some of them would have very young when the first one came out and it's highly unlikely they even watched it, they should have done because then they wouldn't be in this. The original director intended to make this like The Evil Dead but there was one thing missing it didn't have the Indie feeling to it and yes Eli Roth is no Sam Raimi but you can see why he did it. Even the successful sequel which was disowned by Ti West not long after it came out. As this drags humorlessly towards the end there is a feeling of regret wondering why you spent so much money on a 'crappy remake' to an acclaimed classic. In fact it might be better watch the first one again and forgetting this even exists. There is a growing sense of dread it fosters has less to with the intended horror of watching you BFF's become infected by a deadly virus, than the creeping suspicion that nobody's heart is really in it.\n\nVerdict: A duff remake of the beloved original so really nothing new, Travis Z's do-over of the 2002 classic gore-fest is surely one of the laziest despite the fact it is made from virtually the same script.\n\n1/10 one to avoid forever."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jtindahouse",
        "review_rating": "8",
        "review_title": "Like it or not it's one of the best films you'll ever see rated 3 on IMDb",
        "review_detailed_main": "Boy oh boy do people hate remakes. This 'Cabin Fever' remake has a rating of 3.7 on IMDb which is exceedingly low, usually saved for only the most vile, terrible and unwatchable films you could imagine. Is it a bad film? No. Is it a remake? Indeed. I would go out on a limb to say over half the people who have rated the film haven't even seen it, and have simply come to the page and clicked '1' in protest of the film even being made at all.\n\nI don't believe it's fair to hate a film simply because it is a remake. Judge it on what it is and what, if anything, it adds to the original is how I look at it. I enjoyed this one. The original was Eli Roth's welcoming party to the horror genre. In his first film he already had more style, flair and class than most horror movie directors achieve at any point in their careers. The remake, admittedly working with Roth's original script, keeps a lot of that flair and adds a few nice touches of its own. A few characters are tweaked, some death scenes are changed (for the better in my opinion) and yet the core of what made the original great stays in tact.\n\nThis is quite a strange case where the original had its second sequel come out only 2 years ago and yet here we are with a reboot almost at the same time. It's no secret Hollywood is very short of ideas, and a consequence of that is we are going to see more and more reboots and sequels as the years go on. My advice is roll with the punches and see the good side of it, which is that people who would otherwise have never been familiar with the original will now become aware of its existence. Is a 'Hostel' reboot next? I won't lie, I'd actually get very excited if that was announced."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "DanteRiggs",
        "review_rating": "7",
        "review_title": "It's ok, but the original is better",
        "review_detailed_main": "Don't believe the ratings, this is not a 3/10 movie. It's actually ok.\n\nHowever, I have to agree with the people complaining about why this movie was made. This movie is basically a 90% copy of the original. I don't understand why this movie was made. It has almost the same scrip and the acting is not better.\n\nBut again, it is ok. I don't recommend watching this movie if you recently saw the 2002 version. It's like watching the same movie again."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "eldrakeo",
        "review_rating": "1",
        "review_title": "Why did they try to ruin a great cult movie?",
        "review_detailed_main": "I don't write many reviews but I was curious when I heard they made an almost shot for shot/line for line remake of this movie. And they BUTCHERED it! The acting is worse than a B level acting team. They found a way to make every line incredibly flat and unconvincing. It pained me to watch this and I am offended by everyone who had a part in this. The original was a weird but fantastic movie, this was an insult."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "randyfromscream",
        "review_rating": "1",
        "review_title": "The worst movie I've ever seen in my life",
        "review_detailed_main": "If you like the first one from 2002 or 2003 then avoid this film. I thought Fant4stic (2015) was the worst film I've ever seen but nope it's this lame reboot. Mediocre acting like really. They got a award for best reboot like WHAT WERE THEY THINKING?! The writing in this crap fest is horrible and Bert in this movie suck like the old one have energy he didn't care about the rules but in this one he's wimpy. I rather watch Fant4stic then this piece of s**t."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "TerribleKatherine",
        "review_rating": "1",
        "review_title": "Do not watch this!",
        "review_detailed_main": "I am a fan of Eli Roth. I really did enjoy the original Cabin Fever even though it had some flaws (what movie doesn't), and his movies keep getting better. Why was this horrible re-make done? The plot is similar to the original, but the chemistry between the cast is not there. Actually it's painful to watch these people trying to behave like they are best friends!! I have seen also the 2nd and the 3rd movie and they were Oscar-winners compared to this mess."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "filipemanuelneto",
        "review_rating": "1",
        "review_title": "An amateur and unnecessary remake, to be avoided at all costs.",
        "review_detailed_main": "The remake fever is reaching a point where it seems that there is no criterion or logic for making a remake that goes beyond the decision to do so. But worse than that are the remakes that virtually do not add or alter anything to the original film, limiting themselves to remaking it in the same way it was initially made, only worse. This is precisely what we see in this film, where Travis Zariwny made a worsened version of Eli Roth's 2002 film.\n\nI will not waste time summarizing the plot because I think the best thing is to see the 2002 film. Both films have exactly the same story and this film went so far as to copy dialogues. I need to say more? It is not a remake... it is a copy, almost an act of plagiarism. The cast is also forgettable. Gage Golightly is only there to appear naked, Matthew Daddario and Samuel Davis have no presence and the rest just say their lines and die, in the bloodiest way possible, because that is what matters and what the public wants, the director thinks.\n\nThe film is very low budget and seems, to some extent, made to raise money or as a school test for some group of film students. Everything stinks of amateurism in this dull and revolting film that is so unnecessary. Not even the actors' effects and makeup work, everything seems fake and artificial, or exaggerated to the limit. Decidedly, a movie to avoid."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "TheLittleSongbird",
        "review_rating": "1",
        "review_title": "Feverish disaster",
        "review_detailed_main": "Have absolutely nothing against remakes, or at least that is the aim. Although there are a fair share of bad ones, like 'Psycho' and 'The Wicker Man' (both of which made the criminal mistakes of being completely pointless) there are some great ones too such as 'The Fly' (which to me was an improvement over the still good original film and a great film in its own right as well, actually forgot that it was a remake which is testament to how good it was).\n\n'Cabin Fever' is among the worst of them. As well as being badly done in every way, and not in a marginally bad way but quite catastrophobic, it commits what condemns too many remakes in being completely unnecessary and having no spark at all. This is soulless cash grab level film-making level, personally do not like films without soul and made for money and nothing else. The original 'Cabin Fever' may not the most mind-blowing of classics and had its foibles, but it was at least watchable and had a likeability about it, that is not the case with this.\n\nThere is a degree of faithfulness to some of the shots that stops it from being rated zero or in the minuses, but they are not particularly stylish or inspired at the same time this time round. The music is far too loud and has no creepiness or any kind of atmosphere whatsoever, you just want it to shut up.\n\nScript-wise, there is just nothing to it. This time there is a real awkwardness and blandness to it with no flow or personality, the worst of it makes one cringe. There is nothing suspenseful or scary here and although there are scenes one recognises they just do not have the same impact here, things just happen but make no real impact and comes over as tired and repetitive. There is no momentum and the direction is the equivalent of being stuck in the mud.\n\nFound myself very irritated by the characters throughout and the actors looked like they did not want to be there and were promised something substantial to do the film (and probably didn't get).\n\nAll in all, a disaster. 1/10"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lumpacidshadow",
        "review_rating": "",
        "review_title": "Pointless and Awful",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "davillain-92109",
        "review_rating": "2",
        "review_title": "Cabin Fever, the head cold remake!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lukem-52760",
        "review_rating": "1",
        "review_title": "ABSOLUTELY TERRIBLE & POINTLESS",
        "review_detailed_main": "WHY did they remake a cult classic that's not even that old & use the exact same script word for word & literally just changed the actors?????\n\nEli Roth's 2002 Cult classic Cabin Fever is an excellent throwback back Horror to the 70's & 80's & worked perfectly!!!! The cast was very good especially the extremely underrated RIDER STRONG was excellent & gave the best performance in the movie & made a very good lead in the same way Bruce Campbell did in evil dead when he finally took charge & became covered in blood & guts i felt the same here with Rider Strong.\n\nAnyway the pointless remake took away all those excellent elements & performances that made the 2002 movie an instant cult classic & put new boring emotionless soulless actors in place but saying the exact same dialogue as the original classic!!!! So it was weird & POINTLESS & totally terrible!!! I could only hear the original cast especially Rider Strong in my head whenever the new cast talked so it was awful!!!! One of the absolute WORST remakes of all time it can go right next the horrendous The Fog remake!!! Both pointless & completely unnecessary & terrible"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "hnt_dnl",
        "review_rating": "1",
        "review_title": "Utter dreck",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "alchemist2012",
        "review_rating": "10",
        "review_title": "An Excellent Remake Of A Classic",
        "review_detailed_main": "I really do not understand all the low ratings for this film... Being an avid horror fan and having seen the excellent original 2002 Eli Roth classic I watched this remake Nov sure what to expect. A few minutes in and I realised I was going to enjoy this.. For someone who has seen countless friends in peril horror films what struck me was this felt totally 'fresh and new'. Action from start to finish....I was not bored for a moment! The acting was good, the photography was excellent and so too was the musical score (my home cinema speakers certainly took a pounding in places). The special affects were good...especially the rabid like dog! These days too many films made with plenty of hard work and the very best of intentions are criticised and put down....ignoring all the 'good' things about them and instead just pointing out all the bad points.. Personally I did not find 'anything' I did not like about this film. My only regret is that I did not get to see this at the Cinema....I would have very much liked that! I would like to thank 'everyone' involved in this film for making it an excellent and very polished remake. I enjoyed it from start to finish and I hope you too will give this a chance and enjoy it as much as I did...."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "olgavalentovaov",
        "review_rating": "6",
        "review_title": "Hey, I Liked This (Please Don't Kill Me)",
        "review_detailed_main": "I will be the first to admit that when it comes to movies, my tastes are strange, to say the least. But I really did enjoy this film (I even came back for seconds) and I think it's...entertaining. That's the only adjective I can think of at the moment so it'll just have to do. I have not seen the original (nor do I plan to), so I have nothing to compare this to, but in my eyes this flick was everything it was supposed to be. It wasn't that scary, but it was certainly gory, and that definitely counts for something, it was creepy, it was just cool. I say give it a shot - you won't regret it. (I already know you're going to watch it - it's got Matt Daddario, c'mon.)"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "kp_luvs_boyz2000",
        "review_rating": "2",
        "review_title": "You already made this movie!!!",
        "review_detailed_main": "I'm highly disappointed this is the exact same plot as the original!!! Lame... if you are going to remake the movie give us something new!! Bad bad bad!!! Get some new material!!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "dukecitydoors",
        "review_rating": "1",
        "review_title": "Why?!?!?",
        "review_detailed_main": "I love movies, but they rewrote a C+ movie into this F- new version. No creativity and wasn't fun to watch. I think I could have directed, screen written and acted better than this junk. Worst movie I've watch in 2019."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Milk_Tray_Guy",
        "review_rating": "2",
        "review_title": "Zero atmosphere, zero tension, zero point",
        "review_detailed_main": "Remake of the 2002 movie of the same name. The cabin in the woods is more of a luxury apartment in the woods, the photography is far too bright too much of the time, the hillbilly locals and the deputy are cartoon characters, and the whole thing has as much atmosphere as an episode of Dawson's Creek, or The O. C.\n\nGood horror is more than what's shown - it's camera, lighting, and sound, creating a sense of dread, unease, even other-worldliness. This has none of that. It's got the starkness of a true-crime reconstruction show. The characterisations of the leads are paper-thin; the one death that shows any emotional weight soon descends into borderline comedy (and an after-credits scene that makes NO sense), and the whole film just leaves a feeling of 'why?'\n\nThe girls are pretty. That, in all seriousness, is the best thing I can say. 2/10."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "nkreig",
        "review_rating": "1",
        "review_title": "There is nothing to spoil from a movie that used the same script as the original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "vandeman-scott",
        "review_rating": "1",
        "review_title": "It's not all bad. JUST KIDDING! It's all bad.",
        "review_detailed_main": "Really bad. Really, really (really) bad. How bad is it? So bad it could gag a maggot -- not from being gross, but just from the sheer badness of it.\n\nThis student film is ... wait, what? Professionals made this? No way, because it's colossally bad."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "sonnyc-50020",
        "review_rating": "1",
        "review_title": "The worst horror remake ever?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "akashmanutd",
        "review_rating": "1",
        "review_title": "3 little Differences from Original 2002 version",
        "review_detailed_main": "I'm not going to mention any story. Because it is ditto copy of 2002 original version. Lets see what is difference from 2002 version?\n\n1.Police inspector involved in the movie is a female this time. It was a male in the original. Hell, even the name is same-Winston. In fact , all characters have the same names. But neither funny. Absolute crap.\n\n2.In the sex scenes, there are b**bs on offer to see. Yeah. There was less nudity in the original one as Marcy of 2002 version (Cerina Vincent) had problems with that. Marcy of 2016(Nadin Crocker) had none. She performed them.\n\n3.Ending has one less scene where in original there is a scene of hospital as Paul is inspected there in 2002. That scene is cut in 2016.\n\nOther than these 3, you can play 2002 version alongside 2016 version. Same script. Same dialogues. No difference at all.\n\nTalk about WORST SEQUELS.\n\nThis even tops Cabin Fever 2 , who I think was the shittiest I've ever seen. I'd have given it -10 ratings if IMDb allowed it!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "rosecalifornia",
        "review_rating": "1",
        "review_title": "Creativity is gone...",
        "review_detailed_main": "Everyone has already done a great job in comparing this to the original.\n\nWhy even do a remake? Who funded it and they did they think they had something really great to show and improve on? In this film it seems they can't figure out whether it is supposed to be horror, slasher porn, or even something humorous like Tucker and Dale (which is actually great).\n\nIn any event, the attempt on any front failed miserably. It is sadly predictable and boring. The acting is non-existent. The only thing this movie has going for it, is some of the (short) shots of the forest are very pretty. Other than that, stay away."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "VenturousArtist",
        "review_rating": "",
        "review_title": "\"The Same Disease, But Less Effective.\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Grebby1968",
        "review_rating": "8",
        "review_title": "Was worth the wait",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "acedj",
        "review_rating": "7",
        "review_title": "I did not hate this.",
        "review_detailed_main": "Cabin Fever is a movie about five friends that rent a cabin on a body of water in some Podunk town where the locals are all a bit on the eccentric side, to be polite. On their first night a diseased man tries to enter the cabin and when denied entry tries to steal their car. They force him to leave through violence, but before long the members of the group start showing signs that they too have the disease.\n\nI saw the original forever ago when it first came out and pretty much forgot about it. Going through Netflix, I saw this and decided to watch it. It was pretty close to a shot for shot copy of the first film, but I must say that the special effects were better. If you are not someone that is part of the cult that loves the original and have not seen that one for years, then this one will not disappoint you. Pretty solid horror movie here."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Java_Joe",
        "review_rating": "1",
        "review_title": "It's Literally the Same Movie.",
        "review_detailed_main": "If you've seen the original Cabin Fever from 2002 then there's really no reason to see this one because it's the same movie. Different actors but with just a few minor changes from the original it's literally shot for shot, line for line the same exact movie.\n\nThere was no reason for this movie to be made. The original is no classic nor was there an audience clamoring for an updated version. It's only 14 years later. Had they changed the story in some way like the recent remake of the Evil Dead it might have at least been able to say that it was it's own story but no. This is exactly the same. Well actually not quite because compared to this one, the original is better and that's not something I'd ever thought I'd say about the 2002 version.\n\nThe actors in this are bland and honestly don't act like normal people. In one scene one of the guys brings out an assault rifle, mirroring the BB gun scene in the original movie. But this time it goes off accidentally, almost hitting one of his friends. The reaction? An almost bored, \"keep that thing away from me\" instead of the adrenaline pumping scene that this would have been in reality.\n\nAll in all, there is no reason to see this unless you just really need to see a bloodier version of the original."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Adrian232",
        "review_rating": "1",
        "review_title": "Why did they bother?",
        "review_detailed_main": "This movie is a near exact remake of the 2002 original. They add nothing new to the movie, while simultaneously removing all the subtleties that made the original movie good.\n\nThe score is a little over the top at times. The acting is OK, but Samuel Davis' performance was a bit irksome. I think maybe they made the locals appear a little bit more sane compared to the original, perhaps taking a tip from Tucker and Dale vs. Evil. They could have gone farther and ramped up the dark comedy elements, but there were none. The creators shouldn't have bothered with this movie, and neither should you."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "iamblue86",
        "review_rating": "1",
        "review_title": "Awful movie",
        "review_detailed_main": "This has to be one of the worst movies i've seen so far this year. I see a lot of bad movies through out the year, but this one really suck it.\n\nThe acting is bad, the crappy music playing, The gore effects is incredible bad...There is not one positive thing to say about this movie.\n\nAlthough i could live with these things, they can be kind a laughable in some movies, but what i don't understand is why every single character in this movie act like a moron in any given situation? Is it normal to set a guy on fire when he ask for help? only in a B-horror suck movie.\n\nI mean there is no human beings who act like this in the entire world but here it seems to be normal to act like a complete retard. Even though this movie is so bad, i will still recommend this for everyone to watch, because like the Holocaust we must never forget how bad it can get, so show this movie to everyone you know or else we forget."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "johnplocar",
        "review_rating": "1",
        "review_title": "If you hated the original, this is no better.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "thesar-2",
        "review_rating": "3",
        "review_title": "Not Down with This Sickness",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Dieter_Pete",
        "review_rating": "1",
        "review_title": "plain awful",
        "review_detailed_main": "This movie was so bad I even write a review about it. IN English! First of all I am not a big fan of Eli Roth nor am I a fan of the original Cabin Fever. I used to be a horror flick fan but as you grow older you get more sophisticated. There are still a few new good horror movies out there but this remake was just unnecessary. The idea to make a remake of mediocre horror flicks isn't bad at all. A new director gets the chance to take a script and make a better movie than the original out of it. I mean 14 years past by and film making business is evolving. Taking a mediocre movie the chances are high that a remake will be better than the original but this reboot is almost a 1:1 copy but in a worse way. The acting was so bad that I didn't know if I should laugh or cry about it. The movie itself is packed with horror clichés. Man I really had to pull myself together to watch this movie until the end credits. I mean some movies are so bad that they are admittedly entertaining but this one was just bad. The Cabin Fever Reboot is a 1 out of 10 stars because it IS awful and hasn't earned any more stars."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lordzedd-3",
        "review_rating": "1",
        "review_title": "A remake worse than a bad original",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "clintstevens",
        "review_rating": "1",
        "review_title": "Move Along, Nothing To See Here",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "DontFreakImUnique",
        "review_rating": "",
        "review_title": "Horrorcom?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "rizplate",
        "review_rating": "10",
        "review_title": "pretty good",
        "review_detailed_main": "I don't know why all the hate, I haven't seen the original but this was pretty good, a bit funny too.\n\nI don't know why all the hate, I haven't seen the original but this was pretty good, a bit funny too.\n\nI don't know why all the hate, I haven't seen the original but this was pretty good, a bit funny too."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "alexis-16851",
        "review_rating": "7",
        "review_title": "Eli Roth has done it again!!!",
        "review_detailed_main": "I have watched this movie right now and it got me stunned. Even if its a remake of the old classic it is done perfectly. The gore the excitement the music score the all new characters Eli Roth is putting every time when he does a movie all added up to make the perfect horror movie. I liked very much how he put the music blended with the horror scenes and it was made it so nice that it kept me at the edge of my seat. I don't know the reason why everybody got it very bad but its a perfect movie to watch. Really for horror fans its a must watch. Please go watch it now and decide for yourselves if its worthy to watch or no. I was very captivated of it. Eli Roth has done it again!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Steve-war",
        "review_rating": "2",
        "review_title": "Not just awful, but awfully awful.",
        "review_detailed_main": "From the moment this film gets underway with a car travelling through the wilderness accompanied by a score either ripped off or tipping its hat to the music from The Shining during its own opening scene, I knew this was not going to be a landmark moment in cinema. Maybe it was because the music sounded like it was being played on a second hand Casio keyboard from the 1980s. This is immediately followed by a nod to Donnie Darko, so I'm guessing it was intentional. Ghastly acting from the cliched group of 'teens' yapping about Minecraft, wifi, and the usual horror trope of no phone signal. They all look nearer 30 than 18. You need to sidestep this like you would a land mine. Not good."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "sparkthametal",
        "review_rating": "5",
        "review_title": "Average at best....",
        "review_detailed_main": "I'll admit to not having watched Cabin Fever (2002) for quite a few years, but from what i can remember, this is nowhere near as good.\n\nThe premise is the same as the original being a remake, but just doesn't have the same impact. More gore, and even more stupidity, but these types of movies aren't ever going to be logical.\n\nThe characters, just cut out clones from every horror film, nothing likable about any of them, so you don't even care when they die. The script is just shocking, seriously the dialogue and the execution of it is just poor. The characters are portrayed as having at least half a brain on their shoulders at the start, but that soon disappears. I'd say the beginning is actually OK, just average though, but once it gets into the main story its just another dumb horror movie.\n\nBUT, if you take the film for what it is, its an alright watch. Just a bunch of teens dying in various gory ways (although i can tell there will be an unrated version as some scenes were obviously cut). So if you're into that sort of film, give it a rent. If you want a more intelligent horror, this isn't for you."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "magoojack-83695",
        "review_rating": "1",
        "review_title": "do not waste your time!!",
        "review_detailed_main": "this movie is garbage, i just watched it to the end and it sucks. i like the the first cabin fever but Eli Roth should be ashamed for doing this piece of boring crap. The acting wasn't bad though except for the dude acting like he was playing black ops in the woods. Very boring and never has the blood or gore of the original, so why make a crap remake? I watched and waited for the build up of blood, gore and sickness that i thought a remake in 2016 would bring and man was i fooled. Please do not buy rent or bootleg this piece of crap. I try not to be negative and i suck at writing, just trying to warn people of crap movies that i am tired of looking at."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "johnamartine",
        "review_rating": "1",
        "review_title": "A Tour De Fail",
        "review_detailed_main": "I am dumber for having watched this. Awful has a new standard. It's like a cafeteria of the worst possible facets that comprise a horror movie. Bad acting? Yes! The worst! A terrible plot! Check. A rifle with a magazine that contains endless ammo until it runs out and then magically has more ammo in the next scene? Yup. Backwoods idiotic stereotypes? Yes. I could go on but why bother. This move goes beyond suck."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "TopClassNeek",
        "review_rating": "1",
        "review_title": "Just my very short opinion.",
        "review_detailed_main": "This Cabin Fever remake is honestly one of the worst films I've ever seen. Utterly and totally pointless garbage. They've imitated characters from the original and made them worse. Please, any horror fan out there who needs a fix like I thought I did. Turn back. Turn back and run. It's not worth your time. If you ignore my advice, don't say I didn't warn you."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "eshort-70219",
        "review_rating": "1",
        "review_title": "This Movie is Shockingly Embarrassing",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "smashbreakman",
        "review_rating": "2",
        "review_title": "awful, just pure bad direction",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "maintenancecarnegie",
        "review_rating": "1",
        "review_title": "Pathetic remake (Saying it is a copy of the original is quite funny)",
        "review_detailed_main": "The original was well thought out in every way and an excellent gore horror movie. This remake, however, is terrible in almost every way. They literally copied almost line for line the original, but the acting, choreography, and almost everything else is just terrible. I have no idea how they could screw this movie up so bad. Do yourself a favor and watch the original (2002), which is produced and directed by Eli Roth and then if you want a pathetic laugh, watch this one. How you turn an 8-9 star movie into a 1 is beyond me..."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "ericrnolan",
        "review_rating": "8",
        "review_title": "A short review of the \"Cabin Fever\" remake (2016)",
        "review_detailed_main": "I don't understand why the 2016 remake of Eli Roth's \"Cabin Fever\" (2002) is so hated by critics and audiences. It has a 0% rating over at Rotten Tomatoes, and reviews of the movie are withering. I personally thought it was a very well made horror film; I'd rate it at least an 8 out of 10.\n\nSure, I understand the criticisms. This is definitely an unneeded remake. And the new cast here feels bland compared to the doomed vacationers in Roth's campier, weirder outing 14 years prior. (Although this isn't a shot-for-shot remake, it still proceeds mostly from his original script.)\n\nBut the new \"Cabin Fever\" is well filmed, and it's damned horrifying. Director Travis Z significantly ups the gore, violence and frightening imagery - it's not for the squeamish. It passes the litmus test for decent horror movies, because it scared me.\n\nMaybe I'm just partial to Roth's basic story concept - a terrifying new illness that jumps from person to person in an isolated location from which it's difficult to escape, turning them against one another. It's precisely the same plot driver as the one for John Carpenter's \"The Thing\" (1982), which is among the greatest sci-fi/horror films of all time. And I suppose Roth's story could be taken as modern retelling of Edgar Allan Poe's \"The Masque of the Red Death,\" with some of the director's sadism and unique black humor injected into it via his screwball, eccentric characters. Remake or not, this is still a creative change of pace from a genre consistently overcrowded with slashers and shrieking ghosts."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "MattyGibbs",
        "review_rating": "7",
        "review_title": "Very similar to the original but still enjoyable",
        "review_detailed_main": "It's pretty clear there isn't much love for this remake. However I like to give any film a chance and I was pleasantly surprised at how much I enjoyed this one.\n\nI've seen the original a few times and it is very very similar however I still found plenty to enjoy here. There is a slight increase in gore and a slight twist on the sheriff cameo. Like the original there are some laughs and a few jump moments to go with the gory moments.\n\nI was worried the acting would be poor but to be honest I thought all the cast did a decent job with what they had.\n\nI can understand why some people may not have wanted a remake and to be honest it does seem a bit pointless if you've seen the original. However as a standalone film this really isn't that bad at all and it kept me and the wife entertained.\n\nIf you liked the original and are open minded or if you haven't seen the original then this is worth watching."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "nicole10221991",
        "review_rating": "1",
        "review_title": "Oh my God, what the F is this?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "xvubojypasyhwurhxkedivvr",
        "review_rating": "4",
        "review_title": "From horrific to horrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "GiraffeDoor",
        "review_rating": "2",
        "review_title": "I got nothing out of this movie",
        "review_detailed_main": "Even by the standards of a bad horror, there is nothing to make this noisy mess memorable.\n\nI didn't like the characters, I didn't get any atmosphere, I never really felt any unease at all. I haven't seen the original but I still might, but even if you are OK with sitting through sub-par horror, I cannot impress enough just how dull and lazy this was."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Bibleman_Adventures12",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I don't even want to waste my time on this horrendous collection of digital pixelation, but yet here I am on this site writing a stupid review on it. Whatever. I'm a fan of the original movie; I love the dark sense of humor it has, the high amounts of raised palms and \"wtf?\"'s thrown about while watching the movie. I love the low budget feel of it, as it gives aspiring filmmakers like myself a sense of hope, as if saying \"hey, I can do this!\" It's undeniably stupid and I completely understand why many despise it, but for morons like me, entertaining isn't a good enough word to describe it.\n\nSorry if this review is poorly written. I just simply don't care when it comes to this movie. Hey, kinda like the makers of this movie! Maybe I should be hired to write the next Cabin Fever remake.\n\nSo just 13 years after its release and not even one full year after the release of its latest sequel, some producers thought it'd be a timely idea to remake Cabin Fever. Now even though I enjoy the original, there certainly are a plethora of flaws abound, and a remake could freshen things up. Raise the budget, do some things the original couldn't, hire better actors, better filming equipment, raise the atmosphere, etc. Sadly, and actually quite shockingly, none of that is done here in even the slightest. The actors are bland and forgettable with little to zero distinguishable personalities, whereas the actors in the original looked and acted different. You had the jock, the fat one, the shy nerd, the girl next door, and the slut. Here, you have basic person 1, 2, 3, 4, and gamer nerd. The side characters also work poorly here. The original had basically every variation of redneck and it worked perfectly, while this one has some 30-year-old who looks like the director's cousin, and a fat guy. The budget here is $20 million, whereas the budget in the original was just over $500,000. Don't you think the $20 million version would have the better actors and effects? Sadly, this is incorrect, as the only thing to show the 20 mil is the gloomy forest cinematography. Even the vehicle in this movie, some generic Jeep Grand Cherokee, feels like one of the cast members decided to use their moms car, instead of the original which used a rare 1970's Chevy Blazer Silverado. Don't you think the new, more expensive version would have the vintage vehicle and not the SUV that you could buy from an independent dealer for a few grand?\n\nOther changes are beyond confusing, especially ridiculous changes that aren't even necessary. In the original, Burt accidentally shoots a hermit because he is hunting and mistakes him for an animal; perhaps a bit far fetched, but plausible. Here, Burt is fantasizing in playing a real life Call Of Duty mission, gets a bit too carried away, and accidentally shoots a hermit. Perhaps this could work if he were either eight years old or schizophrenic, but for a normally functioning human to do this is mind boggling on the writers part. The director also thought a random fully automatic Carbine machine gun would be more realistic than a normal hunting rifle from the original, a change that makes absolutely zero sense. The opening scene where a hermit discovers that his dog companion is dead was suspenseful and creepy in the original, where the man slowly realizes his dog is not only dead, but completely mutilated. Here, the hermit walks into the frame with a boring pan shot, his dog literally falls apart like it's made of Lego's, and the hermit falls to his knees like a character from an awful Mexican soap opera and cries \"NOOOOOO!\" to the heavens, all within 15 seconds, giving us no time to feel the suspense. Speaking of the dog, we learn here that its name was Pancakes, meaning the deranged karate kid had mistaken Burt for the hermits dog...? Was that the intention?\n\nOne of the big selling points of the films advertising was that the characters all had different rewritten deaths, so that'll automatically make us want to see it, right? Well, even that is wrong. All of the characters die in literally the exact same ways, with maybe one or two things changed. For example: one person dies by getting bludgeoned to death in the original, while here, they pour gasoline on her, and THEN she gets bludgeoned. Big difference, as you can see. Another character dies by getting ripped apart by a rabid dog in the original, while here, she shouts at the dog and THEN gets ripped apart by the rabid dog. What the point of even trying to exploit these \"different death scenes\" when there is nothing even remotely differently about them? The one thing you could've changed from this film for an actual reason and purpose, and you didn't? Whatever, who cares.\n\nThis is the worst film of 2016 I've seen thus far, and is also probably the worst remake I've ever viewed. Why was this even made? Seriously, why? Cabin Fever 4 is still in pre- production as I'm writing this, so obviously the franchise isn't dead. Maybe Eli Roth is planning to remake all of his movies but with bigger budgets, worse/more bland characters, and only the stupid and unimportant stuff changed. Who knows, who cares. I get that people hate the original, but there is no way people could like this more, even the most dedicated of Cabin Fever haters will like the original more than this rubbish. This thing only played for a week in all Houston cinemas, and it's no surprise why. There are hundreds of more things wrong with this movie, so much more that I could probably kill an entire forest from printing it onto paper, but who cares. Obviously, the creators of this film didn't."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "questl-18592",
        "review_rating": "2",
        "review_title": "Stir Crazy",
        "review_detailed_main": "This may be one of the dumbest movies I've seen in some time. A group of college kids go to a cabin in the woods for the weekend and awful stuff happens. Creative, right? Well, in this case, it's no human or monster after them but a flesh eating virus and the inescapable power of stupidity.\n\nI don't normally get into spoilers but I'm going to give some examples because they bothered me that much, I'll try to keep it vague but still. SPOILERS!\n\n1. Girl is dying from this disease that has her skin falling off, begs boyfriend to put her out of her misery so he takes a shovel and stabs her in the face with it because... Why wouldn't you do that? Ugh. To make it worse, when that doesn't work he decides to grab a gas can and douse her in gasoline before lighting her on fire. What. The. Hell? Let's just go out of our way to kill our loved ones in the most drawn out, agonizing ways possible, yeah?\n\n2. Another girl starts feeling symptoms is starting starting to break out and they know that it means rashes and skin falling off. What's she do? Well the same thing any rational person would! She decides to take a bath and shave her legs. OMG I don't even care that you're suffering anymore!\n\n3. Dude raises a gun to defend himself from hillbillies (because of course we need them too) and they laugh and tell him he wont be able to do much with the safety on as he's failing to shoot them. So, clearly he takes that advice, thanks them and goes on his merry, right? No! He shoots them because OBVIOUSLY that's what would happen and this movie and everyone in it is an idiot.\n\nEND SPOILERS!\n\nLook, stupid movies can be fun, generally when they embrace it or are just so ridiculous that you can't help but laugh. This fails to do either. It is taking itself seriously the whole way and good lord it was painful to watch. So much of the horror industry feels like it's trying to get away from some of the super easy tropes and this one just runs headlong into needing everyone to be so stupid I don't get how they survived normal life in the first place. The only reason this isn't getting a rock bottom review is because there was one character that I didn't hate and the visual are effectively off putting, which I'm thinking is the intent. So, yeah, you managed to be gross, way to go movie but you failed to provide a single reason for anyone to watch this. Ever. Epic fail."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "annieringading",
        "review_rating": "2",
        "review_title": "Watch the 2002 version instead",
        "review_detailed_main": "This is your typical seen it before horror but not only had I seen it before I'd heard it before to, this had the exact same script as the other film from 2002 with the same name Cabin Fever (2002).\n\nSeemed a bit odd watching it as it didn't bring anything new to the table in fact it was no way as good as the other movie.\n\nThere was a couple of good moments but if I'm honest I was I'd just watched the 2002 version."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "skinging",
        "review_rating": "1",
        "review_title": "Who's rating this higher than a 1?",
        "review_detailed_main": "I read a lot of reviews before watching this but I'm a sucker for bad movies so i wanted to watch it. With that said, bad or not I give appropriate ratings. A 1 star rating is about a half star to high. Reading some of the otber reviews, whos giving this more than a 1? I saw a rating for a 5 and then the guy said how the movie should've never been made. That point is very true but a 5? Come on. If you dont like watching bad movies please do the world justice, skip this movie and then go tell everyone you know that they should never watch it. Its that bad"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "musicfangirl",
        "review_rating": "1",
        "review_title": "Yikes. (Sort of a spoiler)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "youngtravis-97356",
        "review_rating": "8",
        "review_title": "These 1 star reviews are ridiculous",
        "review_detailed_main": "If you just sit down and watch this as a movie of its own, then it's pretty great. My wife and I both thought it was better than the original (Eli Roth 2002 version) and we both liked that one a lot too. I hate when I see a movie with so many opinionated idiots giving 1 star reviews and the movie is by no means a 1 star movie. Has anyone seen \"Things\"? That is a 1 star movie. This was creepy, gory, scary and occasionally funny without the humor distracting from the film in the way the original does. I really think some morons like clogging up review boards with 1 star reviews because they are salty, bitter and bored individuals."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "matthew-sheffer",
        "review_rating": "6",
        "review_title": "I honestly believe it was better than the original",
        "review_detailed_main": "It's not the greatest horror film or remake ever made but they it brought \"more\" than the original. Here me out....\n\nThe gore was MILES above the original. The original had a lot of late 90's \"blood.\" You know the corn syrup or whatever the hell it was they used. In the remake it literally looks like pieces of the actors body are falling off. The gore is kind of more believable. You get a real sense that these people are rotting to death.\n\nThis film is darker than the original. The deputy is more like a sociopath who knows the dark secret but doesn't care. The little bunny child is just creepy as f. I think if Eli Roth has made this now instead of almost 20 years ago, it would easily get 7 stars.\n\nAside from the darker feel and realistic gore, yeah the acting was definitely forgettable. Marcy has a great set of b00bs but that's about it.\n\nDefinitely not a 3 star movie"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "twwj",
        "review_rating": "1",
        "review_title": "Why?",
        "review_detailed_main": "I don't understand. Why was this made? Pointless, less horrifying, and time I will never get back."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "dar0417",
        "review_rating": "1",
        "review_title": "Worst Remake",
        "review_detailed_main": "Wow this could be the most pointless remake ever. Same everything as the original but they did add the element of social media that didn't work because none of their cell phones would work to make the plot work."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "bevanaaron",
        "review_rating": "3",
        "review_title": "Just watch the original 2002 one",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lazerjaguars",
        "review_rating": "3",
        "review_title": "wow driving to the overlook hotel wow a bunny mask, diesel horn go jump scare!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "chloehiggs",
        "review_rating": "1",
        "review_title": "Ever heard of subtle?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "CrackerJack30",
        "review_rating": "3",
        "review_title": "They should have made \"Cabin Fever 4: Outbreak\" instead",
        "review_detailed_main": "Like others mentioned before, there is simply no reason for this movie to exist. A remake that is 95% like the original from 2002 with 0 new ideas (unless you count slightly different camera angles in some scenes, a new gun and the mention of the internet).\n\nThe actors are WAY worse compared to the ones from the first film, Samuel Davis can't carry this movie the way Rider Strong did it 2002, the whole cast seems to be embarrassed to be in this movie most of the time, at least that is an understandable feeling.\n\nWhile the script of this remake is now dead serious without a hint of humor (making it even more unwatchable), the music score is really laughable, over-dramatic and unfitting, as if it was made for a \"Lord of the Rings\" movie, gets rejected and was re-used here for no logical reason at all.\n\nIt's just sad that they canceled \"Cabin Fever 4: Outbreak\", which would have continued the story of \"Patient Zero\" and should have played on a tropical island & a cruise-ship. I would love to watch that movie with a new setting instead of this pointless remake.\n\nBetter watch the original from 2002 or maybe give the third installment of the franchise, \"Patient Zero\", a chance, this one is just plain and boring to watch."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "madison_greaves",
        "review_rating": "1",
        "review_title": "Dummy",
        "review_detailed_main": "So dumb lol don't waste your time. So dramatic and not scary. Bad dialogue"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "svenaldo-36686",
        "review_rating": "4",
        "review_title": "Ruined by the actors.",
        "review_detailed_main": "I found this a frustrating watch as I always enjoyed the original and was looking forward to the remake. It didn't bother me it was a like-for-like copy because it clearly has good production and the cabin is in a nicer setting.\n\nThe thing that totally destroyed the film for me was the acting. It was abysmal. Maybe I'm being too harsh as I thought the cast in the original suited really well, but some scenes here are over acted and you can almost see on their faces they're thinking about their next lines. Almost as if the characters were just going through the motions without any feeling.\n\nThis film is aesthetically slick and modern and maybe that does take the edge off a bit compared to the raw original.\n\nI think it's bad by comparison, but as a stand alone film it's entertaining. Though the original is your better option."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lkata",
        "review_rating": "10",
        "review_title": "Better than 1 star.",
        "review_detailed_main": "This movie wasn't as bad as many people say. Good actors, good makeup artist. Worth it."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "fluffchop",
        "review_rating": "7",
        "review_title": "A remake that sticks really close to the original film",
        "review_detailed_main": "I do love stories about 5 young people go to stay in a cabin in the woods, I always enjoy that sort of thing. It's nice to see a remake that stays the same as the original. If you are old enough to remember seeing Robocop and Total Recall then lived through to the remakes of those two films you will totally recall vomiting at the screen over how utterly inferior those remakes were. With Cabin Fever it's almost the same dialog and story as the original film. So that's a good thing because it was a good story to begin with. Good in terms of having a setting, a plot, and a good execution of that plot to spell out a story. I found it weird watching this remake as the original and two sequels I had just watched. So nothing was new under the sun except for a worse cast in terms of the babes weren't nearly as pretty. It was just updated in terms of gore effects and the dog was a better character. The hey deliverance line was hilarious too. Let's face it, not everyone saw the original, so based on a viewing of this movie as your only viewing experience I think it's a 7/10."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "dnabney",
        "review_rating": "2",
        "review_title": "Wouldst thou like the taste of cheese?",
        "review_detailed_main": "When this film began, I genuinely thought it was a horror-comedy. As the film progressed, i realized it was just a cheesy movie that was not intended to funny, which makes me sad."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "LeonLouisRicci",
        "review_rating": "1",
        "review_title": "Hold Onto Your Wallet, that Fraud Eli Roth is Back in Horror Town",
        "review_detailed_main": "Shamefully Poor Remake. Eli Roth proves Once-Again that He has No Respect for the Power bestowed upon Him by His Legions and what \"Credibility\" He had is long past its expiration date. Continually making one Bad Film after another that exposes this One Trick Pony as a Fraud.\n\nFans of the Original and Horror Fans in general have been Deceived once more. A Recycling of a Slightly Above Average Movie into a Bland, Blood Soaked Bore is Roth's \"Gift\" to all the Loyalists out there that turned a Loathsome Filmmaker into a \"Name\" that has done Nothing to earn it in the first place.\n\nAll of Roth's Ideas are Rehashed from better Filmmakers (Sam Raimi) and this one should Expose the Pose, once and for all. How Long this Loyalty will last is the question. After this, one of the Worst Reviewed Movies in History, may be the Warning Sign that the Jig is Up, the Writing's on the Wall, and the Emperor is Naked. This Writer/Director Loves Clichés.\n\nThis Film doesn't deserved to be Reviewed but Eli Roth must continue to be Scorned, Ridiculed, and Run Out of Horror Town. Compensation, Apologies, and Reappropriations are Due. He has Swindled too many and must be Held Accountable."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "BA_Harrison",
        "review_rating": "3",
        "review_title": "Why?",
        "review_detailed_main": "Cabin Fever (2002) was a mediocre biological horror that suffered from poor characterisation and an uneven tone, but which was still a success (financially speaking) largely thanks to the hype that surrounded it (mostly generated by its creator Eli Roth). This remake, directed by Travis Zariwny, had the opportunity to improve upon Roth's film in almost every way, but instead follows the original so closely that it too disappoints, suffering from the same pitfalls as the original.\n\nAs if regurgitating the same content with the same weaknesses wasn't bad enough, Zariwny sees fit to make the characters thoroughly unlikeable, and consequently impossible to care about (at least Roth's film had the lovely Cerina Vincent in it). This is perhaps the only film where I have found myself rooting for bacteria to claim victims in the most painful way possible! With two cruddy sequels, and now this dreadful remake, I think it's time to close up this cabin for good."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "shawnblackman",
        "review_rating": "4",
        "review_title": "Why?",
        "review_detailed_main": "A group of friends travel out to the old cabin in the woods for a fun filled week only to have it disrupted by crazy inbred families and a man with a nasty flesh eating disease. As they try and help the man things get bad. The friends find themselves one by one contracting the fatal disease and have different ways of dealing with it. They find out who their real friends are.\n\nThis is a remake of Cabin Fever (2002). This sort of duplicate remake seems to lack any real pacing and horror from the original. Its like a fire that doesn't have any heat. One problem is nothing happens for the first hour and then a crescendo of everything happening in 20 minutes.\n\nThe gore is awesome and even some T & A thrown in. The sound and score is great as well. The scenery is wicked but you don't feel anything for the characters or the story for that matter as nothing really stands out. You get this glossy wrapped gift with nothing inside.\n\nMy biggest question was why was this even made? It did keep with the original concept and I believe Eli Roth was involved with the project but they could have at least done Cabin Fever 4. With a few changes we would be none the wiser. No we probably would complain anyways."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "overlyweirdtwitter",
        "review_rating": "1",
        "review_title": ".Waste of time",
        "review_detailed_main": "To keep it short and simple, the story was too rushed, I thought things started going wrong way too early into the movie and of course the characters didn't do anything a logical person would do, also the trailer kind've spoiled the movie and I don't know it wasn't that good at all, I'm not gonna like the special affects and makeup wasn't that bad but the story was stupid and there were a lot of screw ups with scenes."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "crazygamer1653",
        "review_rating": "3",
        "review_title": "Completely ruined version of original Cabin Fever (2002)",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "havok-flicks",
        "review_rating": "1",
        "review_title": "Perfect example of an unnecessary sequel",
        "review_detailed_main": "From the very first shot I knew I was in trouble, no build up, no flow, no tension, just right into the exact same characters plays by worse actors.\n\nThen the story starts and there are no differences from the original. It is essentially a shot for shot remake of the original just with far worse actors and none of the heart and creativity which made the original bearable and enjoyable to some.\n\nThe worst thing about this film is its pacing, it really has no emotions, it just happens, and worse it does not TRY to have pacing or emotion.\n\nOverall an embarrassing film with is the epitome of an unnecessary and unwanted sequel. All in all avoid this like a flesh eating disease. It will do no good."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "paul_haakonsen",
        "review_rating": "4",
        "review_title": "Another very unnecessary remake...",
        "review_detailed_main": "The very first thing that came to mind when I stumbled upon this 2016 remake of the 2002 \"Cabin Fever\" movie was \"why?\" I am not overly a fan of remakes in general, but remaking a movie as new as \"Cabin Fever\" was just even more puzzling to me than remaking older movies. Especially since the 2002 movie was quite alright. But alas, I gave the 2016 remake a chance.\n\nAlthough little did I know that this was going to be almost a frame by frame replica of the 2002 version. As such, then director Travis Zariwny paid the original movie no respect or tribute, and it was just a shameless cash-in on an already fairly established franchise of horror movies. And this remake was very, very unnecessary in every aspect.\n\nSure the effects in the 2016 remake were good, and were certainly a notch upward compared to the 2002 version. But again, it just left me with an overwhelming sensation of questioning why this movie was even remade at all.\n\nThe acting in \"Cabin Fever\" was good, and the people on the cast list were doing good jobs with their given roles and character. It was actually Aaron Trainor (playing Tommy), one of the guys at the gas station/convenient store, that put on the most memorable performance, despite having only a supporting role.\n\nI am sure that for newcomers to the \"Cabin Fever\" franchise, then this 2016 remake is a great introduction to the franchise, but for us who have been with this since 2002 it was nothing more than a slap in the face.\n\nAnd while the effects and the story was good, the movie just suffers terribly under a very heavy boot marked with \"this should never have been remade\". And as such, then this 2016 remake is not as enjoyable or appealing as the original 2002 version.\n\nOne thing that was a constant nuisance to the overall enjoyment of the movie, was the questionable pick of music they opted for. The music was overly annoying and just too loud, and it deafened out much of the dialogue in the movie.\n\nI am going to rate the movie four stars out of ten based on the story, albeit it being a frame by frame copy of the 2002 version, the good acting performances and the special effects. But in my opinion, then if you are going to watch \"Cabin Fever\", then pick the 2002 original version over this remake any time."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "deivuza",
        "review_rating": "9",
        "review_title": "i did enjoy it",
        "review_detailed_main": "Even though its a remake i did enjoy myself watching it in 2016 resolution and colors if you know what i mean"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "itsthelawrence",
        "review_rating": "6",
        "review_title": "A mediocre splatterfest",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "FAIZ555",
        "review_rating": "1",
        "review_title": "Awful Awful Awful Awful Awful!",
        "review_detailed_main": "I hated this movie so much that it's actually the worst thing I've ever seen! The acting is generic, the script is the same as the original but terribly converted to modern time (same problem with A Nightmare on Elm Street remake), and terrible everything! Can I give it a 0 please? I'm a fan of the first Cabin Fever, it may not be a masterpiece but I enjoyed it. I thought remakes are suppose to update or change something not similar to the original. This is a pointless remake by the number! Watch Texas Chainsaw Massacre remake, The Ring remake, Friday The 13th remake, and The Hills Have Eyes remakes because just don't watch this movie."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "ukulele33",
        "review_rating": "3",
        "review_title": "HA! OH Eli!",
        "review_detailed_main": "If you think this as a comedy its not as bad as people say. I really laughed at points. STOP! It was REALLY bad but if you set aside the bad acting, script, directing, plot, cinematography, props, gaffers, producers, AD's, hell lets put in Kraft services,.. its really got... well a mashup of teen horror mixes in with an outbreak. Granted, NOTHING is explained and you actually root for the people getting killed."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "xxmissy_lynnxx",
        "review_rating": "1",
        "review_title": "What a piece of tag",
        "review_detailed_main": "Nothing like making the EXACT SAME MOVIE with a different cast who can't act at all I may add. This should have never have beenv made. It makes me so furious just thinking about it!!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "lynncolesgp",
        "review_rating": "1",
        "review_title": "Sanitized passionless worthless",
        "review_detailed_main": "The first movie was exuberant, and corny. The characters were well defined, and stereo typical. To the point of being unapologetic. And I loved them. I related to every single one of them in someway. And I fought for them.\n\nThis remake is so watered down that its sad. It makes me sad to think that this generation is so cold and passionless."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "kp_luvs_boyz2000",
        "review_rating": "2",
        "review_title": "It's the same movie as the original!!! Lame!!",
        "review_detailed_main": "I was hoping for a totally different remake!!!! Nope the same movie as the original! Not clever at all! I hate this movie and it made me luv the original more!! Don't even waste ur time!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jasonpauljones-64690",
        "review_rating": "1",
        "review_title": "A very bad movie",
        "review_detailed_main": "It's crap. Pure and simple. The acting. The direction. The script. The special effects. The horror. All crap. The only reason I gave it a star is because of the musical score that was actually cool even though it did absolutely nothing to help this movie. If they didn't have the earlier movie to copy off, they wouldn't have been able to make a movie at all. Of that I am very sure. It really does look like something a year 3 class made in drama class and actually I would say it's worse than that and I'm not disrespecting year 3 students they do a great job and at least they can make something that is entertaining and not horrifically boring."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "drizzo-30520",
        "review_rating": "3",
        "review_title": "No need for another remake of a remake!",
        "review_detailed_main": "Just awful...a remake of a remake almost EXACTLY the same in every way! Sooooo bad!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "mark-777-922994",
        "review_rating": "1",
        "review_title": "The worst of all the terrible horror/thriller reboots/remakes",
        "review_detailed_main": "Before watching this I thought a remake seemed a little pointless, but afterwards I was amazed. It was actually far worse than I expected. There is nothing good in this garbage fire, it adds nothing to the original."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "randynalley",
        "review_rating": "8",
        "review_title": "Not As Bad As They Say...In Fact In Some Ways Better",
        "review_detailed_main": "Yes this film is very similar to the original. The parts that aren't us where it exceeds the original. First, some of the goofiness has been removed. Let's face it, Eli Roth is no Sam Raimi. Takes a special director to mix comedy and horror. Second, the Gore has been increased. Some of the death scenes are mutch better. The evil dog in this one rocks. Over all I would say this is a darker version of Cabin Fever that focuses more on horror and less on comedy. Watch it for yourself and have a open mind."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "bbvhdrbj",
        "review_rating": "7",
        "review_title": "Hated for no good reason",
        "review_detailed_main": "This remake is done extreme close to the original movie. As it seems, that's reason enough for many people to only give one star. And with a lot of nostalgia the problems of the original are quickly forgotten.\n\nI won't talk about the story, since it's the exact same as the original. The biggest differences are the actors, the effects and overall production quality. As far as acting goes, you won't see anything special here. At least the cast was less annoying. (Like the policeman that was replaced with a woman in this one)\n\nWhat really makes this remake shine, in my humble opinion, are the visuals. There are beautiful shots of landscape throughout the movie and much better effects (like the scene in the bathtub). It really is pure eye candy and gorgeous to look at. This alone set's the movie apart from his predecessor.\n\nIf you haven't seen both of the movies, I really recommend to go with this one."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "romneyranjo",
        "review_rating": "3",
        "review_title": "Cabin Fever will make you \"ill\"",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "bowmanblue",
        "review_rating": "2",
        "review_title": "Just\u0085 why?",
        "review_detailed_main": "'Cabin Fever' was released back in 2002. And again in 2016. However, about the only thing about the 2016 version is that it forces us to ask that most existential question: how can something be exactly the same yet completely different? The 2002 film has gone down as a cult classic. And for good reason – it's awesome! Okay, if you're into cheesy horror films with teens dying in various gruesome ways then it's awesome. It takes the – oh so familiar – premise of a group of annoyingly beautiful teenagers going on vacation to a remote cabin in the woods and then meeting a sticky end. Nothing new there, but it's just the way it's done. It knows it's not original and often plays on the clichés you'd normally find with the genre, plus it throws in some truly random and surreal moments just to keep the audience on their toes.\n\nAnd not they've gone and remade it. And a remake it literally is. They've used the same script as the original, sticking to the same running order of scenes and same dialogue (or at least 90% of each). Therefore, it just feels weird watching a film you know really well, only with new actors speaking all the lines. Just pick your favourite film then imagine watching it with new actors reading the same words just slightly differently. It would probably be a bit disorientating and off-putting and you'd probably just end up thinking, why am I watching this? Well, that's how this remake comes across.\n\nIt's not even like the actors are that good. They all look as uncomfortable as we – the audience – probably feel watching them. They have no chemistry and come across like they're all starring in a different film to each other. Plus the gore looks cheaper than the original – seriously, there's an animal in the opening scene that looks like a blood-soaked children's puppet you'd see on kids' TV. I loved the original and regularly watch it. This version brings nothing new to the genre. If you're a horror film, just watch the original. This one is possibly the most pointless remake ever (with the possible exception of that 'Psycho' remake in the late nineties)."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "vengeance20",
        "review_rating": "2",
        "review_title": "Should've made Cabin Fever: Outbreak...!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "asboike",
        "review_rating": "1",
        "review_title": "Just bad",
        "review_detailed_main": "I'm a huge fan of the original and this remake didn't hold a candle to it. It was the same script with bad everything else. Couldn't even finish it"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "KatamarisWrath",
        "review_rating": "2",
        "review_title": "Atrocious gory entertainment that should be avoided.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "dorianse25",
        "review_rating": "3",
        "review_title": "If you saw the other, you've already seen this...",
        "review_detailed_main": "I almost thought I should checkbox spoiler because you already know this movie. There really is nothing new at all. Carbon copy with different actors. Only finished the movie because I thought something new would be thrown in. I was wrong. I don't know why you would do a remake so soon. Its only been a couple years since the other movie, and the other was better. Don't waste your time with this one. Eli Roth really failed at this one. I've enjoyed some of his other movies, but I really wonder why he decided to remake this movie. Did he imagine a big success would come of it? Was he forced to remake this movie for some reason? Did he just say \"FOOK IT\""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "mattmasi",
        "review_rating": "3",
        "review_title": "Wow just wow",
        "review_detailed_main": "I don't mind \"typical\" horror movies that are unoriginal and stick to a over used formula, but the acting and dialogue has to be decent or better. This movie seems to be more focused on referencing weed, sex, alcohol and video games than offering us even decent acting and dialogue. \" I did that to, and I got drunk\" awkward silence. I love bad horror movies bit this was just cringe. Not sure what's worse the script or the acting performances. It's only merits are the the cinematography looks good, it does a good job looking like a hollyHoll movie, but a 13 year olds weekend project underneath"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "cyifly-2",
        "review_rating": "3",
        "review_title": "Started Off Bad. Then Got Worse",
        "review_detailed_main": "Did you need more of an explanation? Gore fans might like it. People who like a decent horror plot from writers won't."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "laurenlambert",
        "review_rating": "8",
        "review_title": "Remake surprises me",
        "review_detailed_main": "I actually really liked this movie. I might actually prefer it to the original and I loved that one!! I think the characters in this one are more likeable. I'd definitely recommend this one."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "leenlou",
        "review_rating": "7",
        "review_title": "Why the low scores???",
        "review_detailed_main": "Ive seen the original and couldn't remember what it was about or if it was a sort of cheesy horror so i thought I'd give this a go even though it got bad reviews but it was ok, not the best acting but still pretty good. Id say if you like a good horror with gore and splatter then forget all the negative reviews and watch it."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jasonjdrake",
        "review_rating": "1",
        "review_title": "If I was able to use a minus score",
        "review_detailed_main": "It wasted 90mins of my time, I won't waste yours pull this awful movie apart"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "shobanchittuprolu",
        "review_rating": "3",
        "review_title": "Cabin Fever may not give you a fever but headache is guaranteed...",
        "review_detailed_main": "Cabin Fever (2016): This one is a reboot of 2002 Eli Roth's successful Cabin Fever.Its one of the most gory horror with disgusting scenes.I just thought that original one is just average.What about its reboot??\n\nPlot: While visiting their getaway cabin, five friends Karen (Gage Golightly),Jeff (Matthew Daddario),Paul (Samuel Davis),Marcy (Nandine Crocker) and Bert (Dustin Ingram) succumb to a flesh-eating disease.How did they escape this infectious disease??\n\nPlus Points:\n\nNone\n\nMinus Points:\n\nCabin Fever itself is a unnecessary reboot.It is one of the worst movies of all time and surely worst of 2016.Acting is so lame that they can run Raspberry awards on their own.\n\nSo Cabin Fever may not give you a fever but headache is guaranteed...\n\nMy rating 2.5/10"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "burlesonjesse5",
        "review_rating": "5",
        "review_title": "VIEWS ON FILM review of Cabin Fever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "dharris206",
        "review_rating": "1",
        "review_title": "Trash",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "MrT10001",
        "review_rating": "1",
        "review_title": "Absolutely appalling...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "thewalkingdad",
        "review_rating": "1",
        "review_title": "LMAO... what a joke!",
        "review_detailed_main": "What a massive embarrassment for Eli Roth! 😅 I've lost all respect for him... for taking a brilliant and original movie and turning into this sad piece of trash. They removed EVERYTHING that made this movie great, and replaced it with bad acting, weak execution, and boring dialog. All of the humor, artistry, and movie magic is gone! They even replaced the hot chick with a horribly weird-looking little hobbit! I absolutely hated this movie and loved the original. Shame on you, Eli. This joke of a project should end your career just to teach you a valuable lesson. Ooooooh... faced... scratch moded!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "thalassafischer",
        "review_rating": "4",
        "review_title": "Eli Roth is So Very Stupid",
        "review_detailed_main": "Look sometimes I just want to watch a popcorn horror film that is silly and fun, maybe a bit gory or gross but not especially scary. That is relaxing and takes me back to being a 12 year old at weekend slumber parties. But Eli Roth cannot even manage that.\n\nCabin Fever (2016) seems like it is...intentionally bad? The first small town hick they encounter at the gas station cannot act worth a darn, and this running gag continues about midway through the film when a pretty female police officer appears and acts like she's a character in a terrible porn with a plot.\n\nWHY? Is this funny to a demographic of horror fans? Why do people like Eli Roth? He wastes these beautiful settings with bright and exciting cinematography by filling them with moronic characters, ridiculous plot lines, and the sort of actors who should definitely keep their day jobs."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "FlashCallahan",
        "review_rating": "3",
        "review_title": "No more pancakes for me.......",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "demelzawinters",
        "review_rating": "10",
        "review_title": "Awesome",
        "review_detailed_main": "This movie is freaking awesome! I recommend all horror fans to give this movie a watch. My whole family and friends all loved this movie too. Though they felt this was too scary for young children."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "trashgang",
        "review_rating": "6",
        "review_title": "took a while before the extreme gore comes in",
        "review_detailed_main": "14 years after the shocking original and a franchise it was time for a remake. All I can tell that the word shocking can't be said of this remake. The original was gory as hell throughout the whole picture here you have to wait before the virus starts working.\n\nBut once it does the gore comes in but can't save the picture. Therefor there was too many talking going on. They put in some gratuitous nudity to keep you watching the flick but again, it doesn't save it. There's one scene were you suddenly see the tattooed girl banging her boyfriend. It didn't add a thing to the story and it didn't make any sense at all.\n\nThe assault rifle doesn't add a thing too to the story and the deputy is as weird as hell. Who and what she is isn't clear at all.\n\nBut of course the clichés are there. The dump people living around the cabin. The warning not to stay, you know them. was it all that bad, oh no, it does deliver some nasty moments and once the virus enters the bodies it's gore galore.\n\nMaybe I'm infected by not really liking this remake, be warned, the easy offended will be shocked by some scene's but the cherry wasn't on the cake.\n\nGore 2/5 Nudity 1,5/5 Effects 3,5/5 Story 2,5/5 Comedy 0/5"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "toddmanning-66704",
        "review_rating": "1",
        "review_title": "Dropped the ball.",
        "review_detailed_main": "A movie about a few privileged heterosexual white children. They couldn't die fast or brutally enough for me. How about trying to actually represent society in your cast."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "TheBarleyGuy",
        "review_rating": "3",
        "review_title": "I mean, yeah... it's terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jeffreyc-32567",
        "review_rating": "5",
        "review_title": "Cabin fever my view.",
        "review_detailed_main": "Well straight off the bat a lot of bad reviews here. Why do people bother to write bad reviews and take about 4 paragraphs to analyse the film 📼. Personally I gave a 5 star rating because I quite enjoyed the film. I have all the cabin fever films 📼 so will start to rewatch them again. Biffin good 📼 film so happy 😊 viewing jacey out cheers."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Corky0705",
        "review_rating": "2",
        "review_title": "Don't bother watching",
        "review_detailed_main": "I liked the first one, but this one is complete total garbage. It may have been a while since I've seen the first but I don't remember the dialogue being unbelieveably terrible like this or the characters and the decisions the characters make for that matter. Not a single person in this is likeable. They all deserve what they got minus the one young blonde. The acting is laughable and cringy. Especially the hillbillys. You legit roll your eyes every other min. We were honestly rooting for the virus at one point. Don't bother watching."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "skybrick736",
        "review_rating": "3",
        "review_title": "Cabin Fever (3/10)",
        "review_detailed_main": "Upon first viewing the Cabin Fever remake, I legitimately thought that I was playing Eli Roth's original when clicking play on Netflix. It's been so many years from first viewing the original that it took nearly 30 minutes for me to realize that the film I was watching was a recycled, useless remake. Who in the world would pretty much follows Roth's script to a tee when the story wasn't even groundbreaking to begin with? These are the type of projects that lack vision, emit no feeling or fright, and they waste a bunch of space for potential original horror content in this great genre. Unlike the original that had some scenes that were extremely whacky, this version didn't take a shot at one ballsy scene. The film felt like a total hack recreation but some super fans. Aside from hating the movie, there are a few positive aspects of the film being Gage Golightly and Nadine Crocker. Without those actresses' stunning screen presence and quality performances this would have been a total catastrophe to watch. I never felt so stupid watching a movie A.) not knowing the film was the remake and B.) the storyline rotted my brain."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "kosmasp",
        "review_rating": "5",
        "review_title": "Try to avoid ...",
        "review_detailed_main": "Comparisons! With the original that is. You may not be able to completely do that, but if you know for sure, than this very close to the source movie, will not be to your liking at all. If you can blend it out and watch this for what it is (a teenagers in the woods kind of movie), you will be able to enjoy it.\n\nApart from quite a lot of nudity (more than the original as far as I remember), this is also as bloody as it can get. Quite a lot of scenes do not make a lot of sense, so if you start using your brain, the movie experience will go downhill. The characters may not have too much meat on them (no pun intended), but they fulfill their jobs. It can be a \"fun\" ride if you let it ... It won't be the near the greatest you ever had of course"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "hitchcockthelegend",
        "review_rating": "5",
        "review_title": "Ouch! Ouch!",
        "review_detailed_main": "My my, the most horrifying thing about this Cabin Fever remake is the vitriolic scorn poured on it by the horror hordes! It is in no way a great film, or even a particularly good one either, but to me it's no worse than a whole ream of other gore based horrors I have been bored by since the new millennium dawned.\n\nIn my defence, I wasn't over enamoured with the original in the first place, so it was no big stretch for me to give this one a shot. It also obviously helped me that I haven't seen that original since the year it was released, so hazy memory and all that. What I got here was a pic full of blood and grue, sex and stereotypes, and poor acting. That is often the norm in the gore slasher genre of things...\n\nOn the plus side is the superb cinematography by Gavin Kelly and a truly head rattling musical score by Kevin Riepl, the latter of which even does a cheeky steal from Symphonie Fantastique (Hector Berlioz). And there's the gorgeous and sexy Louise Linton playing a fantasy driven Deputy! Hoo-Hah! But I digress.\n\nI'd never watch it again, I wouldn't dream of recommending it to serious horror buffs, and although there's a very good emotional pull late in the day, it's pretty much an empty shell. But I did have fun while it was on. Sue me. 5/10"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "POOLSH4rk",
        "review_rating": "4",
        "review_title": "CABIN FEVER",
        "review_detailed_main": "I happen to really enjoy movies like these. It may have most of the same script as the 2002 version but it's still a great movie overall, and interesting to say the least with the different actors to see the difference between the group in this version."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "alexhenderson-11711",
        "review_rating": "8",
        "review_title": "Very f&(@ing gory",
        "review_detailed_main": "Had me gagging cause of all the blood and gore. This wasn't a great remake, but it was very entertaining to watch."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "j0hn22",
        "review_rating": "7",
        "review_title": "Wtf is going on with the low ratings",
        "review_detailed_main": "First of all, the plot is basic, the characters, the casting and the location were all good. The kills were super gory and intense. Actually, the whole movie was intense (especially the last 40 minutes). The only negative of the movie is the first 30 minutes, because it's so boring (I mean we just see a group of kids partying, drinking and having sex) and predictable. However, I think the execution was well done."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "KoolCatReviews",
        "review_rating": "2",
        "review_title": "Struggle to see why this movie was made",
        "review_detailed_main": "It's not a bad movie but I struggle to see why this movie was made at all. Its so similar to the other cabin fever it's pretty much the same. The location and some shots are worse than the orgnial. The casting seems no better but only worse. It just does't make sense why this was even filmed."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "juliankennedy23",
        "review_rating": "5",
        "review_title": "I've got the Fever",
        "review_detailed_main": "Well, let's start with the good news. The film is attractively shot by cinematographer Gavin Kelly and director Travis Z manages to not shake the camera.\n\nYep, that is about it. This is easily one the most pointless remakes. Cabin Fever is only fifteen years old and isn't exactly an unreachable classic. This film uses the same screenplay and despite getting rid of the racist old guy (which ironically is one of the scenes that stands out as working in the first film.) it keeps all the rest of the quirky\u0085 and plays it straight. For example, it keeps the party cop (gender swapped) and the bitey kid who yells pancakes. Neither of which are as good as the originals. The original movie, as stated above, plays this material a little looser and funnier. What's even worse for our Cabin Fever remakers is that Cabin in the Woods has subsequently come out and it certainly apes the opening for Cabin Fever and deconstructs it.\n\nThe serious tone does this film no favors and the acting is all over the place. Cerina Vincent played the girl shaving her legs in the original. She had a nice girl next door vibe so to see her in a sex scene was one of those nice treats that horror films can have. Nadine Crocker, on the other hand, has a serious stripper next door vibe. So her sex scenes are more as if one paid the five dollar cover charge and was hitting the free buffet. In fact, all the actors were wooden without a memorable performance. The rednecks looked like they escaped from He-Haw 2000.\n\nI am not against horror film remakes in principle. The new Friday the 13th missed the point but was at least entertaining and the My Bloody Valentine remake was certainly an improvement. Who this movie is for is a complete mystery. Fans of the original will find this wanting, wooden, and pointless. People who hated the original swill also hate this. As for those who were not around for the original? For god sakes, it's from 2002\u0085 rent the BluRay."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "michaelRokeefe",
        "review_rating": "5",
        "review_title": "A reboot of a classic. Horror and gore!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "michael-3204",
        "review_rating": "4",
        "review_title": "Pointless, but okay I guess",
        "review_detailed_main": "The question posed by this version of \"Cabin Fever\" is \"why?\" Why remake a relatively recent horror film that, while it was nicely done and announced the arrival of a filmmaker (Eli Roth) lots of people had high hopes for, wasn't particularly groundbreaking? I thought I would find the answer in watching the remake, but as fine as this iteration is, it doesn't quite manage to make a case for its existence in a world where the original is still relatively fresh. The cast, the direction, the effects, and the cinematography are not appreciably better nor worse than the original. The story is almost identical, with a few minor variations. (The local hard-partying deputy sheriff in this version has been gender swapped, but otherwise performs the same function as in the original.) The rough spots of the narrative have not been smoothed over -- in fact, they tend to stick out more here than they did before. Even in the original, the rapidly devolving situation the main characters found themselves in and their reactions to the threats they faced came off, at times, as a bit abrupt. That's true here as well, only more-so because the somewhat higher production values make this feel more naturalistic and realistic. The character contrivances stick out more, and the eccentric nature of the townsfolk our city- kid anti-heroes are surrounded by seem even less convincing than they did in the more stylized (and decidedly lower-budget) original.\n\nThis is fine. Anyone who really loved it the first time around might like to see roughly the same movie again with updated technology (which, of course, doesn't work, so it's really mostly useless). I liked the first movie and was mildly engaged by this. Everyone else can safely skip it, unless you think you can arrive at definitive reasons why the filmmakers even bothered."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "myemail-38116",
        "review_rating": "1",
        "review_title": "Absolutely a waste of money and time",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "topherfischer",
        "review_rating": "5",
        "review_title": "Nostalgia Cuts Deep",
        "review_detailed_main": "Cabin Fever (2002) was the first horror movie I watched as a kid. From that day forward I have been an obsessed horror fanatic and always look to Cabin Fever (2002) as the GOAT. When Spring Fever and Patient Zero came out I was surely disappointed as it did not serve justice.\n\nI say that because when I heard the news about this remake I was so exited I nearly cried as a gent in his mid 20's. I waited nearly a year and bought it the first day it came out to own. Then I watched it...\n\nKnowing it was the same script it was incredibly difficult to not compare to Cabin Fever (2002). In the back of my mind I kept thinking why they continue copying what Joey Kern said so masterfully, or how Cerina Vincent could not be re made. It was really difficult but I do enjoy how the remake is a little more modern. I could not nor will I ever get passed the fact there seems to be no chemistry between these characters, the actors themselves seem to be good actors but the dialogue seemed utterly forced resulting in no on screen chemistry, would have been nice to hear more new lines and some improv.\n\nThe things I LOVED about this remake was the cinematography, certainly deserves to be recognized along with the score. It was so different from the OG it made it a whole new movie.\n\nForever a fan of the franchise."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "hannahevetteaguon",
        "review_rating": "1",
        "review_title": "If I could give 0 stars I would",
        "review_detailed_main": "This movie was beyond pointless and stupid. Lets forget the fact that this movie is a remake and lets pretend this was an original. Even if this movie was an original, it would still be the worst movie I ever watched. The ending was definitely the worst part. The fact that I just sat there and wasted an hour of my time on this stupid movie is beyond crazy. How do you take a classic movie and turn it into a poop fest. Trash ending and I don't want to spoil it but the kid over the dead body, the sheriff shooting the boy, the scene where she gets out the shower and is all messed up, the scene where he kills her in the shed. Just a waste of time and Im upset ive even watched this movie, so upset that i sat down and created an IMDB account just to write this review. This movie sucks do not waste ur time watching. PS my cousin said the movie with shawn from boy meets world is way better. Shout out you cousin."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "guymannc",
        "review_rating": "1",
        "review_title": "Worst movie ever",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "dkgupta493",
        "review_rating": "9",
        "review_title": "I personally like all cabin fever movie",
        "review_detailed_main": "Its not about what other people say about the movie but I like the suspense and the journey of the movie and their characters. But at last one should be safe."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "LouAbbott",
        "review_rating": "6",
        "review_title": "If You Didn't See the Original, This Film Is Not Bad",
        "review_detailed_main": "I didn't see the original film or the sequels, so I approached this remake with an open mind. This version of \"Cabin Fever\" is a cross between \"Night of the Living Dead\" and John Carpenter's \"The Thing.\" There is a sense of doom, and paranoia grows among the principles as the film goes on. One scene in the film struck me as very funny. One of the principles exits a shed to find three \"bad guys.\" The \"hero\" tries to shoot the three with his rifle but it doesn't fire. One of the bad guys says, \"No, you got the safety on.\" The hero looks down, clicks the safety off, and then mows down all three badies. I mean, how stupid do you want to be?!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Stevieboy666",
        "review_rating": "4",
        "review_title": "City Kid - \"What's in the woods?\" Redneck - \"Bad stuff!\"",
        "review_detailed_main": "Five friends (2 hot chicks and 3 guys) go for a break at a secluded lakeside cabin, no internet, no TV but there is a deadly flesh eating disease. The fourth movie in the Cabin Fever franchise this is a rather pointless reboot of the original 2002 movie. Although the acting is reasonable I couldn't care less about the characters to be honest. Nadine Crocker spices the movie up by getting naked several times, though why her boyfriend still has his pants on during the first sex scene I just don't know! Plenty of gore, though most of it comes late on in the movie. The only positive that I can draw from this is that I am going to re-watch the original version."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "narathip_87",
        "review_rating": "4",
        "review_title": "For fans of graphic horror only.",
        "review_detailed_main": "The trouble with \"Cabin Fever\" is there is no spontaneity, every beat and every gag stodgily telegraphed by its familiar source material. The film is occasionally jolting in its gruesomeness, but terminally by-the-numbers."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "icemax-17493",
        "review_rating": "2",
        "review_title": "Simply Unnecessary",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "sabelleu",
        "review_rating": "4",
        "review_title": "The casting and script needed improvement",
        "review_detailed_main": "I think the main issues with this are the casting and lack of updates to the script. The characters are still awful but now they mostly aren't acted well either plus the shot-for-shot approach remove any and all suspense."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jremigio2001",
        "review_rating": "4",
        "review_title": "No story",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "treakle_1978",
        "review_rating": "1",
        "review_title": "Don't waste your time or money!!",
        "review_detailed_main": "This was a shot for shot remake of the original classic. This is a huge waste of time. Stay far away from this movie. I'd rather watch grease 2 and I hate that movie but not as much as this pile of garbage.\n\nTim Treakle"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jusst_aguy",
        "review_rating": "1",
        "review_title": "Not needed at all",
        "review_detailed_main": "Watch 2002's and totally skip this one. At least the original has an element of surprise and the \"Boy Meets World\" guy in it this doesn't have anything. SKIP!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "bieten2004",
        "review_rating": "5",
        "review_title": "Current 3.7 score is too low",
        "review_detailed_main": "This movie is not special, but does every movie have to be? No!\n\nIt's an average body horror movie, with good acting and partially great special effects.\n\nI have the feeling as though they did their best with the budget that was provided.\n\nDue to the fact that this is (basically) a remake, the story is not creative, everybody who knows \"Cabin Fever\" will not be surprised.\n\nNonetheless I enjoyed this movie because I believe that not every movie must be special and the entertainment value was sufficient. I wasn't bored, annoyed or irritated and because I didn't have high expectations, the viewing experience was sufficient.\n\nBecause of this I gave this average horror movie what it deserves, a 5 out of 10."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "frankblack-79961",
        "review_rating": "6",
        "review_title": "Decent re-make. Why all the hate?",
        "review_detailed_main": "While the 2002 version will always be amazing, this wasnt bad. Its not as visceral and terrifying as the original, but i really don't get the low rating. There a far, far worse movies that carry a 4,5 or 6. For sure watch the original first. That movie made me sick to my stomach. This one just didnt carry the weight of the first and i think thats why people got so pissy over this update version."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "sevsevencom",
        "review_rating": "1",
        "review_title": "How to ruin a great cult classic",
        "review_detailed_main": "The original movie with hostel 1-2, are 3 three of my absolutely favorite horror movies all time. This ridiculous remake lacks all the originality and chemistry and casting. I saw the original one at the cinema and I absolutely loved it. The Gore, the jokes, the music.. perfection! The person who decided to remake this movie is a moron. PANKAKES!!! That original blonde kid was amazing!"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Horror_Junkie_607",
        "review_rating": "5",
        "review_title": "Don't really understand?",
        "review_detailed_main": "I enjoyed the original cabin fever, and I have nothing against remakes/reboots. This one I just didn't understand. I don't get why the remade it when the original isn't that old. Not sure what they were thinking."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "flook75",
        "review_rating": "4",
        "review_title": "Why did Eli Roth agree to this?",
        "review_detailed_main": "Money, money, money. Only reason I can assume Eli Roth thought this was a good idea\n\nIn total agreement with many of the other reviews on here, a pointless remake. I enjoy the 1st one, not great, but enjoyable\n\nThere was no need to remake it. If you want to watch a crap Cabin Fever film they made 2 sequels which are also meant to be garbage\n\nSome of the story is laughable. The main characters each try to find help at various points. Instead of heading down the road they used to get to the cabin. They decide the best idea is to wonder around the woods. Hoping they will bump into someone. Must be some small woods because they keep meeting a random bunch of crazy characters\n\n4 might be a bit generous but the gore effects for a low budget film aren't bad.\n\nStick to the original."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "allyswinington",
        "review_rating": "3",
        "review_title": "It Was Good Until the End",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "souravbanerjee-55077",
        "review_rating": "1",
        "review_title": "what the heck did I just watch?",
        "review_detailed_main": "Seriously , don't ever make remake , The producer , actors everybody should be banned for christ sake , why on earth would you remake the original masterpiece with the same plot , same twist , same dialogue and lame actings . The part 1 and 2 was superb , Patient Zero did very good as well and after years of waiting we get this trashbag , The original plot of this Cabin fever story is really unique where you see people getting infected with flesh eating virus , the part 2 is surrounded with high school guys , patient zero is prequel of the original one . I was expecting this part 4 gonna surprise me with new story and it would be fun . Well , 90 minutes I will never get back in my life ."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "alexivalle",
        "review_rating": "2",
        "review_title": "If You Saw This On Netflix, Stay Away",
        "review_detailed_main": "I consider myself a horror connoisseur. It's my favorite genre. I love legitimately great horror films like the Shining or the Conjuring, cult classics like Evil Dead, and campy slashers like Friday the 13th part 8. The point is that I can typically enjoy a horror movie, even if it's kind of bad. But, this film is BAD. It's not even so bad it's good, it's not even enjoyable. It's So Bad it's BAD. I may have gotten a laugh a time or two, but they were very few and far between. Even drinking with friends while watching wouldn't make this enjoyable.\n\nI'll be honest, I've never seen the original Cabin Fever. It's actually why I watched this one. I found this remake on Netflix and got 10 minutes in before realizing it had to be a remake (references to Call of Duty Black OPs and Grand Theft Auto 5 would be anachronistic in a 2002 film) and decided to press on. So as someone with no affiliation with the original source material, I can't compare it to the original. However, I can tell you that as a movie, this film is terrible. The writing is awful (I can't even put into words how bad), the acting is all over the place, and the characters are written to be so stupid that the characters from Friday the 13th (2009) look like Nobel Prize winners by comparison. It's not scary and they also have a few really terrible jump scares where it turns out to be their friends or some random person.\n\nHorror typically requires some suspension of disbelief. But there's suspension of disbelief and then there's that little voice in your head practically begging you to turn it off. But, I completed the film just so that I can tell you to heed my warning and save yourself 90 minutes of your life. If there was any reason for you to watch it (even you horror fans out there), I'd be honest and tell you.\n\nBut just to be fair, here's the stuff I \"liked\":\n\n-It's mercifully short -I'll admit that the gore is okay, but as someone who likes gore (you can go see any of my ratings on much worthier horror films), there are far better choices than this. -Some of the cinematography looked pretty good -The main guy wasn't the worst actor ever, even if everyone else is pretty bad. (Looking at you, girl who played Winston and the guy with the rifle) -The car chase scene/tracking scene was decent. Nowhere near the best I've ever seen, but competent. -This movie had some money thrown at it. I don't know if that makes it better or worse.\n\nTLDR: Save your time. Pretty damn terrible"
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "ottoskorzeny-53649",
        "review_rating": "3",
        "review_title": "Terrible",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Lulu-lemon29",
        "review_rating": "1",
        "review_title": "I can't take it anymore",
        "review_detailed_main": "I'm not sure what's going on with the film industry but someone needs to step up and fix it.\n\nI mean where do I even start.... This movie is shameful. Bad acting, bad script and just one big old mess.\n\nI feel embarrassed for the whole team.\n\nI'm just speechless.\n\nThings that made no sense at all and had me banging my head against the wall.\n\nE.g. Girl catches virus, is bleeding and wounded... what a perfect time to take a bath and shave her legs.... Like... WHAT!!??\n\nPlease please please who ever let this slip, tell me what was going through your head. No really I need to know.\n\nI just can't anymore. I've given up on the movie industry.\n\nFor anyone who liked this film, even the tiniest bit, I pray to God that you never reproduce and may the lord have mercy on your soul."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "DaBulls23",
        "review_rating": "4",
        "review_title": "Nothing New. Very Average Horror Remake.",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "patricklouiegybondalisay",
        "review_rating": "5",
        "review_title": "Medocre at best.",
        "review_detailed_main": "Disappointed with the movie .Waited for almost 45 minutes forthe movie to actually progress,., The good thing here , is if you are a gore fan , you can see some of that in this movie but still fails to redeem the entire movie."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "wolfie-23088",
        "review_rating": "5",
        "review_title": "Enough with the 1's!!!",
        "review_detailed_main": "The Greasy Strangler is a 1 rating! Go check it out!\n\nA 1 rating is a movie you could make yourself with a 2nd hand video cam and paying the actors with free crack! ! Ok, so you didnt like the movie. We get it. Then give it a 4 or 5.\n\nQuality recording, music, sound, acting good. Great scenery. Helicoptor aerial filming aint cheap either. Story not award winning...yes. But entertaining if you are a horror buff."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "mm-39",
        "review_rating": "3",
        "review_title": "Lacking!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "Calicodreamin",
        "review_rating": "3",
        "review_title": "Good premise gone bad",
        "review_detailed_main": "Classic idiots in a scary movie, running around and making really bad decisions. I mean, they \"quarantine\" the sick girl but go in the shed every five minutes? The storyline is pretty ridiculous even by scary movie standards, what's with the sheriff and the backwoods hillbillies? The acting itself is just bad. But, the gore and special effects really work, it was gross and gory."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "nogodnomasters",
        "review_rating": "4",
        "review_title": "What did I tell you about biting city folks?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "konnerkent",
        "review_rating": "7",
        "review_title": "better than the original?",
        "review_detailed_main": "I really liked the one that came out in 02 but i probably havent seen it in 20 years so when i stumbled onto this one thinking it was a reboot or continuation or something like the new Jeepers Creepers or Wrong Turn (both of which i liked a little bit more than the original movies) i decided to check it out. Sadly it took me way too long to realize it was a remake, and a pretty decent one at that. Some aspects of this i really liked more than the original, and others felt a bit over the top in unnecessary ways....but such is the way of horror flicks. Overall i liked it a lot and will probably give it a rewatch at some point. I do find it super ridiculous to remake a movie so soon after the original came out, but i am happy with the result."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "LetsReviewThat26",
        "review_rating": "6",
        "review_title": "not terrible, not the best",
        "review_detailed_main": "Eli roth is a great director, and with the likes of the hostel series he has established himself as a great. Despite this film not being liked I thought it was good, but not as great as the orignal as it didnt have that real creepy vibe and in places played off more like a comedy at times. We have our group of nearly thirty year old college kids. Karen, jeff, paul, macy and henry and its spring break so why not go down to a luxury looking cabin but they are unaware of whats really lurking in the woods there that being some strange virus that seems to be going around. Paul is the only character thats written here to be smart as soon as he sees an infected person hes like hell no and shuts them off. The gore is alright but theres not enough filling for this sandwhich but its still enjoyable which ever way you look at it."
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "jb0579",
        "review_rating": "",
        "review_title": "Seriously?",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "adamfitz-82269",
        "review_rating": "",
        "review_title": "The ending was intense!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt3832096",
        "movie_name": "Cabin Fever",
        "movie_rating": "3.7",
        "review_username": "thefutureisunwritten",
        "review_rating": "",
        "review_title": "I done GOOFED!",
        "review_detailed_main": ""
    }
]