[
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "corereflection",
        "review_rating": "6",
        "review_title": "good flick...",
        "review_detailed_main": "the director presents a thriller that will make you watch every scene cautiously. forgetting the first 15 minutes. then the movie gets the treatment it has to. it covers in all aspects. a good suspense till the end that will make the watchers crazy. rock solid songs and good background score that thrills and makes you sweat for fear. a good suspense and crisp storyline. i like a movie when it covers all the elements like story , action , romance , comedy , revenge , tragedy , emotion. the movie covers story well. it holds romance in the first half. revenge is the crux and suspense . tragedy and emotion is not applicable for this movie. comedy is way too far for a thriller. since it covered most of the elements in the right way. this movie is a good flick ."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "chirag_shah775",
        "review_rating": "7",
        "review_title": "Could have been better, but entertained!",
        "review_detailed_main": "The cinematography was the best part of this film...The lighting and photography was brilliant! Also, some of the angles had a very frightening and mysterious feel to it. The direction and story was also unique.Yes, this was overall a well made film but it could have been so much more! A few unnecessary scenes slowed the pace down a bit. The director attempted some cliché gags to frighten the audience. Sometimes it gave me the \"been there done that\" feel. The acting in the film was OK. Emraan in my opinion, was the best. Adhyayan Suman and Kangana Ranaut were OK. One thing I don't understand is, what was the need of the random English dialogues? That made things a bit less believable. The film was also a bit melodramatic...But it was a good movie overall."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "Uriah43",
        "review_rating": "5",
        "review_title": "Failed to Rise to the Same High Standard as Its Predecessor",
        "review_detailed_main": "This film begins with a fashion model by the name of \"Nandita Chopra\" (Kangana Ranaut) having just completed a show and subsequently being invited to a party afterward. It's during this time that she receives a call from her former boyfriend \"Yash Dayal\" (Adhyayan Suman) inviting her to an awards ceremony that is taking place for which he is being considered as a possible winner for a news segment that he filmed previously. She reluctantly accepts and it's during this time that the two of them get back together again. Not coincidentally, it's also during this time that she begins experiencing hallucinations and discovers that a strange young man named \"Prithvi Singh\" (Emraan Hashmi) has begun stalking her for reasons yet to be revealed. Now rather than reveal any more I will just say that this film started out great but began to fizzle toward the end before totally collapsing in the final few minutes. As far as the actors were concerned, I thought Emraan Hashmi and Nandita Chopra performed adequately enough but neither were superior to Bipasha Basu or Dino Morea in the previous film. That being said, while this certainly wasn't a bad horror film by any means, I didn't think it rose to the same standard as its predecessor and for that reason I have rated it accordingly. Average."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "AvinashPatalay",
        "review_rating": "",
        "review_title": "Raaz Kee Baat Keh Doon Toh.....!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "prabhjitsinghwalia",
        "review_rating": "7",
        "review_title": "Nice Story with Low Horror Qoutient",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "Pratik112",
        "review_rating": "7",
        "review_title": "Good.",
        "review_detailed_main": "I was looking forward to this one and more as I enjoyed the previous, which like this one, was a Mahesh Bhatt film. While this one is directed by Mohit Suri, the previous one was directed by Vikram Bhatt and starred Bipasha Basu, Dino Morea and Ashutosh Rana.\n\nA successful model, who is married to a man who makes reality programmes, is stalked by an artist and soon things start happening.\n\nEmran Hashmi's acting was perhaps at its best in this and Adhyayan Suman, son of TV presenter and actor, Shekhar Suman, is also good. Jackie Shroff, who makes an special appearance, is also good as his character pushes the story. But I felt that Kangna Ranaut could have improved on her character a bit more as I found her a bit unconvincing in some scenes but in some she was good - but she needed to be consistent as her male colleagues.\n\nThe first half was good but the second half could have improvised but nevertheless it is still a good film, one that is worth watching but not with children."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "silvan-desouza",
        "review_rating": "4",
        "review_title": "Hotchpotch",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "ThironthoramDude",
        "review_rating": "7",
        "review_title": "Delivers as promised!",
        "review_detailed_main": "Raaz TMC may not be as spine chilling as the original Raaz(2002), but it sure delivers! Kangana Raunat as Nanditha gives out her best performance till date. If she was all about attitude in her previous release 'Fashion'(2008), here she is an emotional, loving and expressive lady. Unlike most of the bollywood lead ladies she does know how to act. Her portrayal of the lady who has to deal with the supernatural was the most defining aspect of the movie.\n\nAdhyayan Suman( son of Shekhar Suman) as Yash(Nanditha's lover boy) does well for a person doing his second film only. And the less that is said about Emraan Hashmi, the better. His role of the painter, who can paint the future(an idea lifted straight from Heroes, but presented in a different manner) was pivotal to the plot and was surprisingly less inclined towards the womanizer roles that he usually does. Jackie Sheroff was highly underused and dwelling into his character will reveal the plot, so less said , the better.\n\nJust like the previous edition, the songs of Raaz 2 are good n hummable. The storyline also offers some respite, from the clichéd family dramas n love stories. Mohit Suri, the director has done a commendable job, but he has left a few loose ends as well, like for eg: What exactly is the role of the supernatural in painter's ability to paint the future??.\n\nIn a nutshell, I would say this is one movie that you can enjoy, if u in a mood for some Kangana Raunat special with a horror angle to it!"
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "the_don_2005",
        "review_rating": "4",
        "review_title": "Disappointing film",
        "review_detailed_main": "The first half of this movie was acceptable. Credit goes to Emraan Hashmi. The second half was abysmal to say the least. The theatre was packed. If it wasn't for Emraan Hashmi's brilliant performance & entry, I would certainly have left the theatre during the interval. The beginning of the film was somewhat bizarre. I kept on watching expecting explanations for what I just witnessed. As the plot unfolds, you realise that this movie is balderdash. The script was absolutely weak. This is a horror film and I was laughing. That isn't a good sign. Kangana Ranaut's acting skills were good. Adhyayan Suman is abominable as Kangana Ranaut's boyfriend/lover. He should quit acting altogether or at least improve his acting knowledge by joining 'ACTOR PREPARES'. His dancing was beyond ridiculous. The climax of this film was hilarious, especially Jackie Shroff's entry. This film is one to avoid at all costs. Only go to watch this film to witness Emraan Hashmi's revitalising performance. He's the anchor that saves this film from drowning.\n\nBonne chance."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "molla-huq",
        "review_rating": "7",
        "review_title": "Not a bad one as an Indian horror flick",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "meenotigoswami",
        "review_rating": "1",
        "review_title": "Movie Asudh hai Sadh chuka hai",
        "review_detailed_main": "Being a horror buff I was highly disappointed with this movie.This is the worst horror movie in Bollywood.The movie is not scary at all.No suspense.Only songs are good.Jaggu dada has been wasted.Ardhya suman doesn't know anything about acting.Kangna tried to scare us but ended up being a joker.Emran tried hard to make an impact but failed miserably.Mohit Suri totally ruined the Raaz franchise.He can never be like Vikram Bhatt.The mystery of this movie was just stupid.\n\nOverall being a horror lover you will be very disappointed with this movie.For the sake of Raaz(2002) don't watch it.I wish it was never made.Monumental disaster."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "wwwaviavinash",
        "review_rating": "9",
        "review_title": "My all time favorite",
        "review_detailed_main": "One of the best Indian horror movie ever made . Mohit Suri is very talented director of Bollywood."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "ashishkbajpai",
        "review_rating": "7",
        "review_title": "Not at par with Raaz (2002), But still worth a watch",
        "review_detailed_main": "Thank god its not pathetic as \"1920\", which was more like spoof of some English horror movies. I would like to call Raaz-2 as one good supernatural thriller after years in Hindi (mind it i have called it as a thriller instead of horror). While making horror movies the most difficult part is to uncover the secret in the end and still keeping the fear alive for audience. Raaz-2 actually comes well till the point where it uncovers the mystery but after the mystery is unfolded, the last 15 mins goes like picnic for audience i.e. without any fear. To me a good horror movie is one which delivers fear till its last scene and gets over with an unended fear in your heart, i think raaz-2 falls a little short to deliver that, which fortunately looked good in Raaz (2002), as it was also a happy ending too.\n\nMusic, camera, Special Effects, are good and above of all the story is fresh. Which is the biggest plus point for the movie, Because least expected from a horror movie is a story which is already known to audience. Some sequences used by director are type-casted and are being copied from some English movies like Ring-1 & Ring-2. To me director looks like a big fan of J-Horrors :), hence Raaz-2 can be said as a Hindi version of some J-Horror.\n\nKangana did a great job and Emraan & Adhyayan Suman also suits well in their respective roles. I would say in overall its a good attempt from the Raaz team who finally delivered a Hindi movie with good story and a positive message in the end. I would rate it as 7 out of 10, worth a watch."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "unbornpaniwala",
        "review_rating": "5",
        "review_title": "Five stars only for Kangna",
        "review_detailed_main": "Movie does not appear to be a horror or thriller because of its predictability. At least not for horror movie afficiandoes. Half way through I already was able to get a hint of what the end would be like.\n\nWithout spoiling too much for those who are still waiting to watch this movie. What? Am I kidding? Its been 6 months since it came out but anyways I think nothing makes it worth watching than Kagna alone. My only complain is that she looks too cute to look scary even in a ghostly appearance. That apart she does a good job at genuinely putting life into a character that builds on you. I like a horror movie which ends with a lot of tension and shock leaving behind the viewer with a climax that sticks in their mind for a long long time. But unfortunately the whole thing dissolves in the end particularly because the concern for Kangna's character gets removed by the end.\n\nIn fact other than watching her and commenting on her dresses in some not so \"demanding\" scenes all we were doing was laughing away at some of the \"scary\" scenes. The graphics have been done well for a bollywood movie... but its too late for them.\n\nOK so my final say is watch it for Kangna otherwise skip it."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "DICK STEEL",
        "review_rating": "6",
        "review_title": "A Nutshell Review: Raaz: The Mystery Continues",
        "review_detailed_main": "The first Raaz starring Bipasha Basu has nothing to do with this film. The mystery indeed continues here in name only, just like how the Thai horror franchise The Art of the Devil 2 having no relation to Part 1. It's a totally different story altogether with no return of characters from the first film, so this rose could be called any other name, and would it smell as sweet? There's a certain formula followed here and comes with the obligatory \"logical\" explanation, but the story could have been nipped and tucked a little to help in the pacing.\n\nFashion model Nandita (Kangana Ranaut who seems stuck in such roles, the last of which was the recent Fashion) and her fiancé Yash (Adhyayan Suman) seem to hit all the right notes as a successful yuppie couple. At first we're told the relationship is on the rocks, but then a quick reconciliation over an awards ceremony meant happy days for both. For her, she's at the height of her career, and for him, being the successful producer-director of a long running reality television series called Superstition, which explores the many myths and beliefs in Indian culture, and goes about deconstructing and debunking them. So of course, things start to go bump in the night, but seemingly affecting Nandita more, to the point of insanity.\n\nWe get introduced to an artist Prithvi (Emraan Hashmi), who falls into a drunken trance with a few swigs, and ends up painting masterpieces of people he doesn't know, only to find that the impressions of his paintings are predictions of future occurrences. Recognizing that his drawings lately have resembled the high profile model, he takes it upon himself to explain things, and this sets everything up for a romantic triangle, where his brooding demeanor doesn't put him in the good books of flamboyant Yash.\n\nThings with Nandita start to get worst, and just as you wonder if there would be any inkling of Hollywood come smacking in the face of the film, there had to be some homage paid to movies like Ghostbusters (Kangana's rendition of the Gatekeeper, anyone?) and The Devil's Advocate, but this being Bollywood meant it's a clothes on affair in the display of deep- rooted scars in front of a church altar. Shades from Asian horror like The Ring also gets overused here. Songs have to be worked in, and this was done fairly smartly in having to set it in pubs, private serenading and a much unwanted dream-like fantasy of Prithvi lusting after Nandita (well, it did seem that way).\n\nDirector Mohit Suri employed every trick in the scare book in order to work up some boo- moments, some of which still get effectively delivered, while others dallied on the anticipation too long and backfired. From mirror images to shaky doorknobs, from copious amounts of blood stained walls to deserted underground car parks, sound effects in the theatre were maxed out to give that sense-surround creepy feeling, with whispers and creaky doors used to great effect. Alas the narrative failed to exploit the technical brilliance at the film's disposal, and investigations by both Prithvi and Nandita (the character of Yash does get forgotten for a while) take their toil as they take just too darn long to get to where they should (about 40 minutes!).\n\nUnfortunately we don't get to see a lot of footage of superstition which could've been milked for various scenes. Instead, it becomes a rather bland X-Files episode where the superstitious and the non-believers go head on toward unraveling the mystery of the worshippers and rites of a remote town, with some environmental concerns thrown right in just because it's the in thing. The link that binds the characters together were too weak to say the least, becoming too trying especially in its final revelation with a last ditch attempt.\n\nIf it had tightened its pace and felt no need to explain everything in verbatim, this could clock way below 2 hours, and a tighter thriller could result. Not a bad experience for my first Hindi thriller, but it had room to be much better."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "jayraj-rao",
        "review_rating": "7",
        "review_title": "Wont Disappoint but could have been much more better",
        "review_detailed_main": "All i want to say is the mystery continues wont disappoint but it could have been better.The story is about Nandita who experiences supernatural experiences but doesn't know why its happening to her.A painter experiences visions about her which are a sign that nandita is in danger.He has a gift in which he can see peoples future. When he sees Nandita in a mall he tells her about his paintings and his visions but she doesn't believe him until he saves her from danger. Nandita wants to know the truth why the experiences are happening to her.Asking prithvi for her help she goes on a trip to know the mystery about the things happening to her. Must mention the song maahi which is a chart buster and u know it when you r in single screens.The special effects have been well worked on in this movie and can say by far the best try to make things happening in the flick.The background music of the movie is good.\n\nNow the performances in the movie by Emraan and Kangana are really good. adhayan suman is unconvincing and needs to improve.\n\nThe movie could have been much better without songs between kangana and adhayan suman.Emraan character could have been well worked on as the character was strong but could have been developed and made much interesting ,the story writer could have added a lot more punches for this character as he has very little to do in front of kangana.But considering his performance emraan rakes up some good points in whatever he has to do.\n\nThe climax of the movie could have been better as after working so hard on the movie it does not justify the story it could have been much better and in a more polished way.\n\nI would rate the movie as 7/10 and applause the director for trying really hard and getting us close to a horror film which justifies the story but falters in the end which is not convincing."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "looneytuna",
        "review_rating": "3",
        "review_title": "The Ring and the grudge with songs and bad acting.",
        "review_detailed_main": "Mohit Suri had clearly not made this film for those who watch Hollywood horror flicks. And for those who haven't. this film will take you through all of the ones you have missed.\n\nWith strong, and in some places, completely identical, references from movies like the Ring, The Grudge and The Haunting are uncanny. Right from the production design to the cinematography, it seems like all the filmmakers have done is create a montage of the best scenes from these horror films. And tell me that Hashmi's character doesn't remind you of Heroes? Where, finally, there is some original story from the filmmaker's side, the film loses plot and the audience wishes it would just go back to being a montage.\n\nFor those who have seen Raaz (1) and want to go back for a scare, you might be disappointed. The movie tries too hard to scare, and even then, it fails.\n\nThe acting was bad. Except Emraan Hashmi, no one is worth a mention. If I have given the movie a 3 star rating, it is only for its production design, which has successfully recreated the designs from its English counterparts.\n\nOverall, this movie is worth a watch if you have nothing better to do. However, those who aren't fans of horror and haven't seen much of The Ring, Grudge and its likes, you will enjoy it much more than I did."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "kumar-chetana",
        "review_rating": "6",
        "review_title": "Engaging Horror Flick",
        "review_detailed_main": "The movie has an enticing beginning on a dark night with a gruesome surprise that cuts rapidly to join the bustling present of the heroine's unsuspecting and usual complicated life in Mumbai. 'Nandita' (Kangna Ranaut) is an established model in love with a reality news show anchor 'Yash' (Adhyayan Suman). The movie opens with the two uniting where they left off and both characters on a professional upswing. Suddenly, a brooding and determined painter, 'Pritvi' (Emraan Hashmi), emerges from the shadows to follow Nandita around. In their first meeting in an elevator he gives her a succinct summary of why he has been drawn into her life against his wishes. Prithvi counsels her that he thought that he had painted his masterpiece - the face of a woman who he thought didn't exist when suddenly he realizes that she exists and has a life of her own. To further complicate matters he can see her dangerous future unfold. The movie now erupts into a sharp ride of Prithvi trying to save the hapless Nandita from near certain death as well as disbelief from her doting boyfriend - Yash, a firm non-believer of the paranormal. Emraan is actually quite balanced in his performance and seems completely sincere and free of any melodrama. Kangna is well cast in the character though her dialog delivery lacks punch and is often limp. Wardrobe and styling are mostly good. Nandita (Kangna) must journey to the source of her troubles with the help of the mysterious painter - Pritvi, who seems to rescue her each time from certain death. Adhyayan could be better in his debut, with his dance steps seeming ill choreographed, his protestations of love seeming a little too maudlin and only his performance in the climax showing any real spark. The movie certainly had the audience riveted and on the edge of their seats, however, could have done without at least one song and a stronger portrayal of the boyfriend in Adhyayan. Worth special mention are the scenes where Nandita has her first tryst with the strange force that nearly kills her in her bath and a dream flash that has Prithvi incorrectly imagining her being mowed down by a truck, realizing the error and then actually seeing her at the exact same place. Towards the climax is an interesting special appearance and a lamentable explanation of Prithvi and Nandita's connection to each other. All in all, this will certainly spook you if you watch this at night and go home alone to your apartment! The scenes of self torture and the attempts to depict Indian occult practices are scary though brief."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "bobbysing",
        "review_rating": "4",
        "review_title": "The secret is fine but it's not scary as a solid Horror movie.",
        "review_detailed_main": "Horror Genre in Hindi Cinema has improved and impressed in the last few years and we have now entered a new phase leaving behind the pioneer makers of horror movies in India, The Ramsay Brothers. Mohit Suri, the director of \"Kalyug\", now comes up with his \"Raaz - The Mystery Continues\" and tries his skill in a different subject than his earlier movies. Though his direction is competent but the movie is not as convincing as his earlier ones.\n\nFirst of all you cannot categorize \"Raaz\" as a horror movie, because it does not scare you enough. On the other hand it is a suspense thriller with a secret to unfold towards the climax. Though there are some spooky scenes with a story of a spirit taking its revenge, but you don't feel scared or haunted while watching the movie. In fact the suspense and secret is quite entertaining but its not spine chilling which makes you sit straight with your jaws open. So it was not right on the part of its producers to promote it as a solid horror movie. The story is about a girl (Kangna) who gets possessed by a spirit who wants to take revenge from his killers. Adhyaman is her boyfriend who does not believe in the supernatural and is also involved in the crimes done in the past. Emraan Hashmi is a painter who gets glimpses of the future sequences which are going to happen with Kangna, so he wants to help her out of it. Emraan is also related to the spirit and the revenge but is ignorant about it.\n\nThe movie starts at a very slow speed with all unwanted scenes related to the love affair between Kangna and Adhyaman. And it only catches up as Emraan and the supernatural theme is introduced. Story wise its not a novel theme but is handled well by Mohit in his first attempt in the Suspense/Horror Genre.\n\nIf you are not a fan of English & World Cinema then you may find many sequences worth watching and entertaining. But those cinema lovers who have got their dose of Asian Horror movies (Thai/Japanese) would find it all cliché and not good enough. Screenplay is tightly written towards the end but is quite weak at the start. Cinematography is fine with some good effects too.\n\nIn the acting department Kangna gets most of the marks once again after \"Fashion\". She again is featured here as a ramp model but she is top rate as a scared girl. Her scene where she abuses the spiritualist/politician sitting in the first row of a fashion show is the best scene of the movie. You will be surprised to hear the language used in that scene impressively as it will shake you well on your seats. Adhyaman Suman is just OK with not so impactful with his dialogues and dances. He does a much better job towards the end as the villain.\n\nEmraan Hashmi once again proves that he is quite capable of carrying a solo hero movie and can also bring in the crowds on the first day itself. The opening of this movie strengthens his creditability with the producers to more higher levels. He impresses throughout the movie more with his eyes and expressions. The movie is sure going to add more numbers to his fan following with his stylish new look. It was refreshing to see Jackie Shroff in a special appearance and he acted fine. Musically, \"Mahi\" song is already a Hit and the other tracks are also soothing to the ear while watching the movie.\n\nOne point which goes in favour of the movie is the depth with which \"Mohit\" uses the Couplet of Kabir \"Bura Jo Dekhan Main Chala\". The reference to these lines beautifully explains the trauma faced by Kangna in the end scene.\n\nBut the main point which works against the movie is that it is not a solid Horror movie as publicized by the producers. It is more like a Hitchcock suspense thriller with great sound effects and shocking secrets. There are certain unanswered question too in the movie, like there is no explanation given to the scene where Kangna insults the Politician in her fashion show (Why she did that?). If the script and narration was written more towards the horror factor, and more scary scenes then this could have been a big crowd puller. But for now it is just an OK, time pass movie, which can be watched if you have nothing else to do for a few hours.\n\nLastly as per the tradition of Vishesh Films, \"Raaz\" is also an inspired movie with inspirations coming from more than one movie. The horror scenes (bathtub scene & the Well in the end) are inspired from \"The Ring\". The hidden roof floor in the house inspired from \"The Grudge\". The future prediction plot inspired from \"The Final Destination\" Series Movies. And the main secret of the movie which is told in the climax is inspired from Julia Roberts \"Erin Brockovich\" where she is also investigating about the water of an area getting contaminated due to the Energy & Gas plant running nearby. Sounds Familiar\u0085."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "creedreaper",
        "review_rating": "6",
        "review_title": "Not as Good As First One, But Comes Close to Expectations",
        "review_detailed_main": "I could not help but to compare it with the First one, and this one does not live up to it. Although the acting of Emraan and especially Kangana's was very commendable, but this sequel did not had the elements which needed to jump u off u chair, and honestly the first part did. This sequel's storyline went weak, there could've been aloooot of suspenseful ideas made but it fails to do so. I was expecting to see some Exorcisms etc... but towards the end it just gets stupid. The first Raaz catches u right away from beginning with the introduction of Ashutosh Rana and until the end he scares u immensely. The screams on first Raaz really scared the hell out of audiences on every instance but this part u had to wait to get scared. I would say this movie was just a little better then Phoonk, but cannot be compared with First Raaz."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "ssvikas",
        "review_rating": "3",
        "review_title": "Not Scary at all, Kangana does well & Emraan can act",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "swatimis",
        "review_rating": "9",
        "review_title": "A True Indian Suspense Thriller after a long time!",
        "review_detailed_main": "I have personally failed to come across good Indian horror/thriller movies. But, Raaz seems to put in a good word for itself. It loses a point for Suman's role and acting. Otherwise, well worth watching. Firstly, it presents issues that our society REALLY faces. And secondly, it takes a look at the REAL evil and not just the regular outlook at good versus evil that we're used to seeing.\n\nThe movie starts off putting forth a lot of questions that were well answered as you watch the movie. The topics raised throughout the movie keep you guessing till the very end. I won't say more about the movie and ruin the suspense for you.\n\nA good watch overall. Well recommended for the specific corrupt group of Indian population (the netas, and on and on). ;)"
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "sumanbarthakursmailbox",
        "review_rating": "6",
        "review_title": "Overall not a bad movie",
        "review_detailed_main": "The movie starts off very well and promises a grand finale. But once the background story is out, the movie fails in it's attempt to bring everything together and all the characters involved in one big scary bundle. It doesn't work at all and leaves one feeling foolish at the end of an unintentionally goofy little climax.Overall not a bad movie but not worth spending money inside cinema halls.For any horror movie to work, the entire story of why it happened must be really good and solid. For the audience to love and enjoy the movie they must be captivated enough to feel that such-and-such happened because of so-an-so reason. But if the reason doesn't work then the entire premise in which the movie is standing on falls and the film fails to deliver. In Raaz, the entire background story of the ghost and the reasons for the anhonee happenings is a big letdown. Technically the movie is good with some good editing and excellent background music by Raju Singh. The sound effects are good and up to the mark. The cinematography, a very important aspect of any horror flick doesn't raise above average. There has been efforts to use color filters in some sequences but somehow they don't seem to accentuate the scene much.Acting wise Kangana Ranaut has a very meaty role and she delivers it with gusto and gives an exemplary performance.Emraan Hashmi does well but he doesn't anything great in this role. Adhyayan Suman needs to brush up his acting and needs to improve his dancing pronto. In one of the songs his dancing becomes unintentionally hilarious."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "pushpargha",
        "review_rating": "3",
        "review_title": "Bhoot wants revenge.......bhoot takes revenge...CRAP!",
        "review_detailed_main": "Yet another Mahesh Bhatt horror flick but this time, not for the first time, its disappointing. The concept of Raaz TMC, is a mix of The Ring and Shutter. Stolen concepts yet again. Emraan Hashmi and the first scene were the only high points of the movie. The movie runs at a good pace but enter second half, it all becomes predictable. Kangana's was OK but nothing special. We have seen performances like this before. Urmila specializes in them. ADHYAYAN SUMAN.....WHAT IS HE DOING MOVIES HIS ROLE IN THE MOVIE WAS NOT PATHBREAKING OR SOMETHING LIKE THAT and there was nothing much there in the story as well to help his role. Jackie Shroff turns up at the end but again i feel being a dignified actor he should not have done this role in this script. All in all, a flop for me."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "sabrina104",
        "review_rating": "6",
        "review_title": "OK but could have been much better",
        "review_detailed_main": "the film keeps you on the edge at all times, surprises come then and there. Emran and Kangna did a fantastic job, they both do justice to their roles, however unfortunately same couldn't be said about Adhayayan, he was not very convincing in the role he played, i think he should just stick to singing because i don't see any great actor in him. i must say Hindi films are getting better and better at horror movies, the scary scenes were actually good. the reason i only gave this film a 6 is because lets just say i thought the \"raaz\" that you was in the film was weak and also a bit ridiculous, the first raaz movie was actually better than this one, it had a stronger plot and i don't think they should have named this film raaz two because it doesn't link in anyway to the first one accept for the title of course. i would say if you want to watch a horror movie this would be my second choice."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "bond2009",
        "review_rating": "3",
        "review_title": "nothing new",
        "review_detailed_main": "Raaz the mystery continues is the title but this movie really sucks its not the sequel to the original Raaz (2002) which was far better than this garbage. No scare at all it looked like a spiritual movie meant for laugh. I really never expected such a movie from bhatt production they have given a scariest movie of bollywood like \"1920\" in recent times.\n\nThe story of the film is about the premonitions and ghostly experiences like the person who is going to be killed is alone and he is followed by some kind of spirit or he gets attacked at some point of his life. You could feel the horror factor and the movie doesn't go to show any scientifically designed reason or logic behind the incidents and the movie looses grip in the second part.\n\nDirector mohit suri needs to check some Hollywood horror movies before directing any other horror movies. The only thing I liked in the movie was a song \"maahi\" and the gorgeous kangana ranaut. my rating is 3/10"
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "BollyReview",
        "review_rating": "10",
        "review_title": "Fantastic Movie! Must Watch!",
        "review_detailed_main": "I really like this movie. It's a perfect thriller by my definition. It's scary, especially the first view, but not nonsense scary. The story makes a lot of sense and it also delivers a message, a lesson about humanity as well.\n\nI think all the actors did a great job. I became a fan of Kangana with this movie. She's definitely the heart of the film.\n\nI usually don't re-watch thrillers, with the exception of Chandramukhi. But I have watched this film at least five or six times since now! This movie was definitely a pleasant surprise. I'm glad I took a chance with it. I hadn't seen the original Raaz, but I'll definitely be looking forward to the next one."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "duahemant",
        "review_rating": "8",
        "review_title": "Story tells about the greatest evils inside us. A couple who is future oriented and can do anything to make future bright. A boy who is an artist and can foresee the future.",
        "review_detailed_main": "Raaz - The Mystery Continues' is not exactly a sequel of 'Raaz'. It actually explores the evil within the human psyche and is a fresh story. The word is that Director got inspired by Indian mythology, where good and evil are interwoven in human nature. He has cited the example of the great saint Kabir, who had said that the greatest evils are inside.\n\nIts a story about fight between good and bad deeds. Movie has a pace,viewers will not get bored at all. Story has got strong twists and binds the viewers till end.\n\nKangana puts in a great performance, one, I admit, I didn't know she was capable of. Her scenes when she gets possessed, as well as when she walks the ramp, are brilliant.\n\nEmraan does complete justice to his character. Adhyayan comes across as a raw actor, who needs to work on his acting. But he compensates with a convincing act in the second half of the film.\n\nThe music and background score is very good, and makes an impact.\n\nOne wishes that more attention could have been given to the story, and the faltering climax.\n\nOverall,a Cool Horror film."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "springsunnywinter",
        "review_rating": "10",
        "review_title": "Raaz- the Mystery that should be revealed",
        "review_detailed_main": "The movie deals with issues of the \"evil within\" the human psyche and how it manifests itself. It is based on the myths and superstitions that are still widely existent in the contemporary Indian society. The film attempts to challenge one's beliefs about paranormal phenomena. It is about anticipation of fear and the fright residing within ones' self. Emraan Hashmi plays a painter, named Prithvi, who has an extraordinary gift. His paintings tell Kangana Ranaut's character's future. It is a bit similar to The Omen but not a complete inspiration.\n\nI really like scary horror movies which is what Raaz- the Mystery Continues is. It was really interesting and entertaining throughout and you just don't know that what is going to happen next. Bollywood has always been weak in the horror genre but they are showing some progress now. Emraan Hashmi and Kangana Ranaut both acted really well and I prefer eerie & frighting scenes in a horror movie rather than violence & gore because the main aim of horror genre is to scare which is what the film had.\n\nThe music of Emraan Hashmi's films are always good and the music of the first Raaz was amazing so it was important that the music is good for this movie and it was not as good as the first but the song Maahi is really haunting.\n\nThere is one thing I don't understand about the title that why is called \"Raaz- the Mystery Continues\"? Because it is not a sequel to the 2002 movie Raaz which was a Hollywood version of What Lies Beneath. They simply could've called it Raaz - the Mystery or Secret."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "ThnkrBelle",
        "review_rating": "10",
        "review_title": "The bar for Indian horror has been raised!",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "tusharvyas15041987",
        "review_rating": "10",
        "review_title": "AN Ultimate Thriller...",
        "review_detailed_main": "In a brilliantly executed shot, Kangana casually looks for some pills in her cloak, while her image in the mirror is standing still.\n\nRaaz-The Mystery Continues is filled with several such spooky moments \u0096 some work, some don't. Bhatt camps' sequel to the surprise 2001 hit Raaz has no relation whatsoever to the Bipasha Basu-Dino Morea flick. Except that both films are essentially murder mysteries with some edge-of-the-seat moments.\n\nMuch like comedy, watching a horror flick also requires some suspension of disbelief. RTMC is a clever blend of superstition, mythology with social maladies and religious politics. The plot flows like a thriller - filled with enough twists and turns to keep you engaged. The makers have clearly kept a mass audience in mind. Because without getting too melodramatic, the narrative packs in a number of crowd pleasing, emotional sequences. This emotional link is handled competently in the climax which may not be as scary as expected but certainly not funny either.\n\nThere's also a split second full-bodied nude shot of Kangana when she is thrown out of the bath tub. But it is executed with utmost aesthetic value.\n\nIf you are a horror-suspense-thriller lover...just go for it..."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "samdarsh",
        "review_rating": "8",
        "review_title": "Could be even better if anyone better than Adhyayan was in it",
        "review_detailed_main": "Though most of the elements are taken from the movie \"Grudge\", still this Movie is good to see. Though it starts a bit dull, after the entry of Emraan, the story picks some pace and then there are great twists and turns and some funny events which you all will know after watching the movie. Emraan and Kangana acted quite well, and Kangana's new look is something special in this movie. This is not a very scary type but still it holds the suspense till the very end. Worst part of the movie was the actor named \"Adhyayan Suman\". His acting was not so good, and dance was horribly bad. Then even the story, action scenes and the story twist keeps the audience glued to their seats. This is a good welcome to year 2009 by Bollywood."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "shariquehashmi",
        "review_rating": "8",
        "review_title": "Superb Suspense !!!!!",
        "review_detailed_main": "This sequel to \"Raaz\" is finally worth watching for Kangana's portrait of traumatized womanhood. An act she has mastered. Mohit has gone right in the casting as well. Emraan is just perfect for the part and his expressions speak a lot. It is not the same Emraan you have been seeing till now. Kangana enacts her part well and succeeds in getting your sympathy.\n\nThe film is a definite must watch, it delivers more than it promises. it is that one good horror film, that Hindi horror film fans have been deprived for a long time .\n\nThere are sufficient twists and turns plotted at just the right juncture to give you shocks. The suspense too is well maintained right till the climax. Generally Bollywood horror films tend to have lengthy and at times unconvincing flashbacks to support the happenings but thankfully in here the flashback is not only slickly shot but is also right in length and very convincing. The camera-work by Ravi Walia deserves special mention especially for night shots which are aplenty in the film. He has succeeded in creating the right eerie atmosphere. The song are well placed too and thankfully few."
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "guhapritam7",
        "review_rating": "9",
        "review_title": "The mystery opens...",
        "review_detailed_main": ""
    },
    {
        "movie_id": "tt1340838",
        "movie_name": "Raaz: The Mystery Continues",
        "movie_rating": "5.7",
        "review_username": "samirindya143",
        "review_rating": "8",
        "review_title": "Raaz-2 must watch, it delivers more than it promises",
        "review_detailed_main": "Yash (Adhyayan) and Nandita (Kangana) is a couple deeply in love. While Yash is heads a successful reality show on TV called Andhavishwas which exposes superstitious beliefs in India, Nandita is a successful model. One evening Nandita realizes that a stranger (Emraan) is following her. The stranger then manages to encounter her in her building lift. He introduces himself as Prithvi and shows her the paintings he has drawn of her. What has him intrigued is that though he had never seen her before, he has drawn her many portraits including one which shows her lying in a pool of blood. He tries to caution her about something evil about to happen to her soon but she ignores him. But from then on, strange things start happening her as if she has been possessed by an evil spirit. What twists and turns follow next form the rest of the film.\n\nFull marks to Mohit Suri for making that one kick-ass horror thriller which can easily put on par with Hollywood's best in terms of plot, setting, technique and acting. Though the initial few minutes appear dragging with a slow pace, the film takes your grip, once Kangana gets possessed. There are sufficient twists and turns plotted at just the right juncture to give you shocks. The suspense too is well maintained right till the climax. Generally Bollywood horror films tend to have lengthy and at times unconvincing flashbacks to support the happenings but thankfully in here the flashback is not only slickly shot but is also right in length and very convincing. The camera-work by Ravi Walia deserves special mention especially for night shots which are aplenty in the film. He has succeeded in creating the right eerie atmosphere. The song are well placed too, especially the song Mahi by Toshi is the main attraction.\n\nMohit has gone right in the casting as well. Emraan is just perfect for the part and his expressions speak a lot. It is not the same Emraan you have been seeing till now. Kangana enacts her part well and succeeds in getting your sympathy. Adhyayan shows remarkable improvement as an actor from his debut film.\n\nThe film is a definite must watch, it delivers more than it promises. Not only it is way far better than the first Raaz, it is that one good horror film, that Hindi horror film fans have been deprived for a long time now since Bhoot. Go for it and be prepared to be spooked."
    }
]